{"id": 383154, "author": "secretdecks", "title": "Catalyst Swarm & City Hub Playbooks", "url": "https://cardano.ideascale.com/a/dtd/383154-48088", "category": 26244, "amount": 45000, "description": "O enxame de catalisadores vive no espaço virtual, mas precisa de primeiras experiências para implementar sua rede e Experiência em ambientes reais", "funded": 1, "upvotes": 37396300, "downvotes": 23264205, "votes_result": 14132095, "votes_cast": 115, "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "Este projeto pretende levar uma comunidade existente que já é virtual para uma primeira comunidade piloto para o mundo \"real\". Ao fazer isso, serão então desenvolvidos projetos e playbooks que poderão ser usados para implantar comunidades similares em diferentes cidades. O impacto per se desta proposta pode não ser grande simplesmente porque se baseia no estabelecimento de uma comunidade com relativamente poucas pessoas, mas servirá como piloto e lançará as bases para começar a construir uma base de conhecimento para o futuro. A equipe afirma que precisará apresentar uma nova proposta para desafios futuros, a fim de dar impulso ao projeto. De modo geral, concordo com a alocação de fundos.\r\n", "q0r": 5, "q1": "A equipe descreve as qualificações e a experiência de cada membro da equipe, cada um dos quais tem uma experiência considerável e uma reputação dentro da comunidade Catalyst. O plano de implementação é simples, e todos os passos que a equipe pretende dar são bem compreendidos. Entretanto, quando se trata do orçamento, embora haja uma discriminação muito específica dos elementos que o compõem, o custo não está associado a cada item. Como resultado, não é possível fazer uma avaliação precisa da justificativa do valor solicitado. Apesar da falta de uma seção sobre os riscos potenciais para o sucesso desta proposta, a experiência acumulada pela equipe me dá confiança de que esta primeira fase será bem sucedida.\r\n", "q1r": 4, "q2": "Há uma explicação muito boa do roteiro; ele foi estruturado para três meses, e haverá explicações extensivas do que estará acontecendo em cada mês. Apesar de os critérios de sucesso não estarem completamente descritos na proposta, com base na minha leitura da proposta, detecto dois resultados principais, (1) formar um grupo de 20 a 30 pessoas em Berlim, e (2) criar um livro de brincadeiras para consolidar todas as boas práticas para a construção de comunidades locais.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 13, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "O enxame catalítico é um conceito bem sucedido, trazê-lo ao mundo real teria realmente ramificações maravilhosas. Um enxame catalisador com experiências do mundo real poderia realmente apoiar muitas contribuições fazendo maravilhas para o ecossistema Cardano. Com o plano detalhado como proposto acima, a equipe tem total confiança na proposta. Sendo Berlim o principal público alvo, poderia facilmente ajudar o enxame a espalhar sua influência em todas as direções pela Europa e eventualmente pelo mundo. Com as colaborações potenciais mencionadas na parte final da proposta, não há dúvida de que os novos rostos no ecossistema recebem orientação de qualidade e os apóiam em suas contribuições para a rede. As oficinas e eventos, além dos livros didáticos disponíveis para todos, sem dúvida conduzirão muito tráfego confiante e talentoso para dentro da rede.", "q0r": 5, "q1": "Com o plano de ação bem elaborado e os resultados razoáveis, as chances de sucesso da proposta são muito altas. Para somar a isso os rostos familiares como Felix e Dan, a comunidade tem muito poucas dúvidas a respeito da experiência que a equipe teria. O plano detalhado do orçamento e o fundo muito prático fazem completa justiça à proposta. A dica da equipe de solicitar fundos adicionais durante as próximas rodadas mostra a determinação e paixão de longo prazo que a equipe carrega consigo. Tendo fornecido a lógica acima, acredito firmemente que esta proposta é uma das idéias notáveis sob o desafio.", "q1r": 5, "q2": "Com um manifesto tão elaborado em mãos, existem muito poucas dúvidas sobre a proposta. Há indicadores claros que os auditores poderiam utilizar para medir o progresso do projeto. A natureza de fonte aberta dos livros de exercícios, encontros constantes e eventos e discussões comunitárias, o aumento do fluxo de tráfego na rede e as contribuições especialmente dos parceiros de colaboração. Entretanto, a falta de KPIs quantitativos para compreender o número de recém-chegados, o número de usuários ativos dos serviços poderia acrescentar mais informações. É bastante compreensível que, estando ainda em seus estágios preliminares e sendo uma proposta muito centrada nas pessoas, tais métricas são bastante difíceis de serem definidas. Mas mais informações delicadas sobre as métricas fariam desta uma proposta completa, em minha opinião.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 19, "ne": 11, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This idea in this proposal is a good one. Creating a local community  hub in Berlin is in complete sync with the challenge problem. The proposer has properly articulated how this proposal will add value to the cardano ecosystem. In fact the local community hub will attract people with different profiles who can join the cardano community and help build the ecosystem up. The proposer has mentioned eventual additional funding in fund 8. Based on all the information provided in this proposal, it can have a pretty good impact.\r\n", "q0r": 5, "q1": "This proposal has some pretty notorious names known in the cardano  community who are part of the team. Although I would suggest to the proposer to add linkedin profiles or other resources to back his claims, I can give them a pass given that Victor corcino who is a member of the team is very credible in the cardano community, specially for those involved as CA and VCA. I would also suggest to the proposer the add a budget breakdown of the 45000 requested. The proposer planned to add a budget breakdown in fund 8, but my question is how did they calculate the actual budget. Apart from that, the proposer has provided a timetable until april 2022 with all the details and expectations. The plan is laid out with as many details about the proposal. The only thing remaining is a successful execution which is likely to happen based on the information given in this proposal.", "q1r": 5, "q2": "This project is auditable for me as there is all the information necessary to track its progress. The roadmap provided in the proposal is filled with as many details as it needs to be. The milestones are also clearly stated and the desired results are outlined as well. Metrics and KPIs are also in place. The problem has been described clearly and the solution as well. Based on this information, I think that this project will be easily auditable.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 16, "ne": 6, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "It was a pleasure to read your proposal. I think that your suggestion is not yet a bit of evidence or validation for your statements in this summary. will you be targeting individuals? like during the seminar, you just gave the main ideas in theory, but in reality, you haven't mentioned. Any problem has an idea to solve, but what I think you are What is missing is how do you prove to the community how your proposal has a strong impact on the community in the region and the world. Hope next time you will pay attention and add more.", "q0r": 2, "q1": "I believe the team makes claims without any specific evidence and documents to back up what you say in this proposal. about experience or any links to back up the experience claims. How about your strict? above all the concern is that you are requesting a capital of 45000 USD without showing us a clear funding sheet is it reasonable?. also you are missing the documents for community verification about your statements and the proposed team. You need to explain more clearly about the budget, the experience of the team clearly, the proposal will bring higher feasibility.", "q1r": 2, "q2": "The proposed team has come up with a specific roadmap in real time. But it has not provided enough information on how to use the specific capital, how much money to go to which item to implement this proposal. Whether the KPI is determined. The success of the project depends on what criteria? Hope you reply soon next time, as well as review the proposal and provide enough information and accompanying spirit to be appreciated by the community for the transparency of the proposal.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This is a very helpful proposal, it builds up a Catalyst Swarm Community in Berlin, build bridges and presence of Cardano and Berlin entrepreneurs and startups, initiatives and movements. Simultaneously releasing a Playbook, it documents the ways that proposers maintain and grow the community.", "q0r": 4, "q1": "The team includes many members with extensive experience and knowledge, but how to verify that information, it is necessary to add the personal profiles of the people involved (linked in,... ). It is also necessary to provide links to previous projects (here the proponent mentioned Eastern Town Hall, Catalyst School but did not give a specific link).\r\nThe proponent only provides a short-term roadmap (3 months), but it is analyzed in detail. It defines specifically what to do in the first 3 months.\r\nAsking for a budget of $45,000, should make it more clear what book this money was used for. I see a description of the budget allocation in the proposal, but no specific value has been provided.", "q1r": 3, "q2": "The information provided is certainly not enough, but we can still judge its success. In addition to the content I mentioned in the previous section, the proponent also needs to have a success evaluation criterion (playbook hits,...), clearly defining difficulties-challenges as well as solutions. overcome.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 19, "ne": 3, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "A construção de uma comunidade de catalizadores em Berlim é um primeiro passo para gerar Blueprints e Playbooks sobre como criar comunidades urbanas", "experience": "Proponente Financiado, Assessor Comunitário & Assessor Comunitário Veterano, Mentores e Referentes de Propostas, Membros da Equipe de Desafio e Embaixadores"}