{"id": 383493, "author": "ubnsekpong", "title": "Start Haskell Community: Beginners", "url": "https://cardano.ideascale.com/a/dtd/383493-48088", "category": 26244, "amount": 18000, "description": "A maioria dos Desenvolvedores na Nigéria não tem o conhecimento de Haskell e a entrada para construir Dapps em Cardano. Nós construiremos uma comunidade.", "funded": 0, "upvotes": 16123275, "downvotes": 18502510, "votes_result": 2379235, "votes_cast": 104, "f6_no_assessments": 4, "f6_rating": 2.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to create a hub where developers can increase their knowledge (on any level) about Haskell, and build a community where they can interact with each other. This is addressing the challenge in two important ways: One, it will attract more Haskell Developers to the Cardano ecosystem but it will also do so through a perspective that Cardano and IOHK is focusing heavily on, Africa. Not only will the ecosystem grow, but this proposal gives important insight to what is needed, directly from the ground level. Two, it will increase and spread knowledge about Cardano and Catalyst right where we want to have a heavy focus, for humanitarian reasons. I would say that the problem statement and the solution to said problem is in alignment, both on a micro and a macro level. It is a long term, slow growing investment so huge and direct results won't be present initially (most likely), but it is planting a seed for the future of both Cardano, Catalyst and its presence and growth in Nigeria. I strongly agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The core team seems to have relevant experience of both software developing and education, to put this proposal into finished product, with verifiable LinkedIn profiles added. The idea and proposal is clear and simple, to organize training in Haskell, connect with other community hubs and spread knowledge. I would have liked to see a more detailed breakdown of the budget. There are some mentions on what the funding will be used for (internet, power, lunch in order to be able to host the training sessions), but if the proposal would include for example: How many people will be working no these educational meetings, will they be paid? How many working hours is estimated for the different participants? Will the core team use some funding for marketing, etc. If this kind of information would be included in the proposal, it would further increase the credibility and understandability of the proposal and development. All in all, I agree that this proposal is likely to be implemented successfully. ", "q1r": 4, "q2": "The core idea of the proposal is very clear. It would be very beneficial if the proposal included a detailed roadmap, with some estimated timeframes. At the moment, the only details provided are organizing meet ups in the first weeks, and partner up with 4 hubs within 6 months. With the inclusion of some measurements of success (KPIs), the proposal would be a lot stronger. A suggestion of this could be: After partnering up with these 4 hubs within 6 months, we are planning to have courses in Haskell development (2 beginner courses and 2 intermediate courses) twice a week, during a 3 month period. Each course will hold 10 participants, and will be hosted by one facilitator/educator and a software developer. After 3 months we hope to have had around 45 students \"graduated\" from the course. \r\nIf there is a social media channel for this project, it would be great to also include that in the proposal. Because it shows that the team intends to be transparent and communicative with their community. (Speaking from my experience as a teacher and a researcher of education and social anthropology). It is a really great idea to have connections with different hubs, and I believe the proposal would benefit greatly from a deeper explanation of this. Is the intention to connect all 5 hubs and create a larger channel for people to communicate and cooperate on? Lastly, if the core team presented some short thoughts on possible challenges or risks during the development and implementation and how to deal with them, it would further increase the credibility of the people behind this proposal. Due to the lack of information regarding auditability (as explained above), I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposals intent is commendable, it seeks to educate individuals in Nigeria on Haskell starting from zero knowledge to become, in the words of the proposers, a hero. The method of achieving this is by collaborating with a various networks hubs throughout Nigeria. The proposer and their team will attempt to develop Haskell materials on their own which will also be the material they distribute to their communities. Their method of building interest is by organizing a series of meet-ups. With that in mind, on the basis of what they intend to achieve and based on the key metrics of the Challenge setting, this proposal indeed is moderately effective.", "q0r": 3, "q1": "Though moderately effective, this is not supported by the proposers experience, most specifically the proposer themselves. Though it is stated that they are Haskell developers and Plutus Pioneer participants, none stated this in their LinkedIn profiles. Of the proposers, 2 (two) have actually created credible hubs in their respective region. Only the proposer themselves, has no clear credential of being a lectures, Haskell developer or Plutus Pioneer participant. Based on these findings alone, it is most likely this proposal will not be implemented successfully. Add to that no budget break down, an implementation plan that does not focuses on creating the syllabus educating on Haskell but rather on marketing. The timeline has many gaps and is with out a clear action plan is unrealistic. There is also no effort to consider the risk and challenge the proposers will face during the duration of the event; which perhaps can be in the form of the current pandemic. Please do reach out to the Catalyst School to learn more about formulating a standard proposal. Building relations with WADA might also prove beneficial in for the proposers in terms of building up a network.", "q1r": 1, "q2": "Unfortunately there is no clear roadmap with milestones. No action plan and also KPI's, makes auditing this proposal not possible. Problem statement and solution are not concise and repetitive. Each overlaps with one another, resulting in this vague and need further iteration proposal. Please iterate further this proposal with Catalyst School's various online materials if reaching out is not an option.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 19, "ne": 5, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "There are still a little amount of people who understands Haskell. This proposal intends to help developers in Nigeria by building a community of Haskell developer, that would teach and train developers Haskell from 0 to well seasoned Haskell developer. By helping developers to learn Haskell, it will help Cardano to gain more developer to help with building the smart-contract, and will further drove adoption from various app build on Cardano. IOHK already have initiative and program for teaching Haskell in African continent, so this proposal will be a great complimentary for that.", "q0r": 5, "q1": "The team is proven to have the experience needed for this proposal to succeed, and we can verify that by checking at their Linkedin profile. Unfortunately, this proposal only explain the things that they are going to do, without providing any crucial details like: roadmaps, plan for implementation, goals, and budget details. I have a lot of concern with this proposal, for example: How do you organize the meetup, online? Offline? How to achieve it? What are the hubs that you will partner with? Regarding the budget, how did you get USD 18,000 from? Providing the budget details will greatly help for us to see what you're doing. Etc. My suggestion is for the proposer to have a clear sight and goals, accompanied with the ability to be able to articulately explain how you will achieve these goals.", "q1r": 1, "q2": "As I said before, this proposal lacks of any implementation details and roadmaps. So it will be hard to audit, let alone track the progress because there aren't any specified platform or media for us to check. Metrics and KPIs also not included, which further make this proposal is impossible to audit. ", "q2r": 1, "assessor": "z_assessor_640", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "I think this proposal is touching the need of this challenge as it aims to train young Nigerian people about Haskell and how to build Dapps on Cardano. This could bring more users to Cardano and be onboarded if the proposal is implemented well.", "q0r": 4, "q1": "Although this proposal has a good idea and a capable team, it seems to be incompletely written. There is only some steps for the action plan, there is no timeline, resources or broken down budget added. I strongly disagree that this proposal will be implemented successfully.", "q1r": 1, "q2": "This proposal doesn't give me sufficient information to audit its progress since it doesn't have a roadmap with milestones, key metrics to success or KPIs. ", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Construiremos uma comunidade de desenvolvedores Haskell em parceria com centros, treinando iniciantes de nível 0 a Hero em Haskell.", "experience": "Equipe de Palestrantes Universitários, Desenvolvedores de Software, Desenvolvedores Haskell e Plutus Pioneer."}