{"id": 383731, "author": "trancuong", "title": "Vietnamese Cardano Community's Hub", "url": "https://cardano.ideascale.com/a/dtd/383731-48088", "category": 26244, "amount": 10420, "description": "Uma pesquisa sobre a comunidade Cardano Vietnã mostra que cerca de 80% não sabem ou respondem incorretamente aos conhecimentos básicos relacionados à cadeia de bloqueio Cardano.", "funded": 2, "upvotes": 88642520, "downvotes": 1474387, "votes_result": 87168133, "votes_cast": 231, "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal seems to be a viable project to boost the existence for the already assembled community. There are a lot useful info on how things will be done and even it lacks in covering some aspects to be taken into consideration, it has a good chance to be a successful one.\r\n\r\nIt would be nice to have a direct link to the survey (the problem), to see exactly what was the purpose of it and how relevant was to the target audience.", "q0r": 4, "q1": "The team has grown its experience on how to maintain an active community and was involved in other Cardano related events thus giving a good insight about the odds to successfully complete the work.\r\n\r\nThe budget is broken down into identifiable items (with relevant info) and the team knows what resources are needed to achieve the goals of the proposal.\r\n\r\nThe proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\n\r\nThe proposal offers a realistic timetable to complete the work.\r\n\r\nThe proposer has to consider challenges and risks relevant to a successful implementation. (how do you retain user interest for the subject? how do you attract and retain new users?)\r\n\r\nFor the project to stay afloat in the future it seems that additional funding is required, an aspect that should be taken into consideration by the proposer.", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. There are also metrics defined that measure the success of this project. \r\n\r\nThe only thing I miss in this proposal is that the proposer has not mentioned possible difficulties and how to deal with them and also if additional funding is required for the future of the project.", "q2r": 4, "assessor": "z_assessor_309", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The issue being 80% of Vietnam Cardano community doesn't have enough knowledge about Cardona ecosystem. The proposer wanted to create a info center containing all the knowledge and info about cardano in Vietnamese. This availability of information in Vietnamese will be very helpful for Vietnam community to understand more about cardano ecosystem. Hence this proposal effectively addresses the issue", "q0r": 5, "q1": "Based on the details provided in the proposal  the proposer and their team have enough experience and have been actively working on improving Cardano Vietnam community. They have provided a detailed plan on how they will be  implementing the proposal and they have given a clear roadmap with time frame for each of the steps hence it's very likely this proposal will be executed successfully ", "q1r": 5, "q2": "The proposer had provided a complete budget breakdown with all the expenses and have also given a step by step timeline each with a target to achieve within the timeframe.\r\nWith all these information it would be enough to track the development of the proposal successfully ", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 20, "ne": 3, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "The challenge is all about setting up and developing community hubs. This proposal aligns with the challenge as it looks to setup  a hub in Vietnam. There is great potential and drive in this country and as such this proposal , if implemented successfully, would provide excellent value or money to the Catalyst/Cardano community. ", "q0r": 5, "q1": "Looking at the past experience and the work that have been involved into date provides confidence that this team has the right set of skills to deliver. The budget requested is reasonable for Vietnam and the cost breakdown makes sense.\r\nFor completeness i would like to have seen a something linking activities, resources and costs, so the voter could see who is actually doing each bit and therefore be held accountable.\r\n ", "q1r": 4, "q2": "The metrics are useful in terms of tracking website visits and Youtube subscribers. The suggest challenge targets include driving people to be active in catalyst/cardano. Adding these targets would have elevated this proposal.", "q2r": 3, "assessor": "z_assessor_45", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The problem is that most of the Cardano community doesn't understand the basics related to the Cardano Blockchain. The solution is to create a Cardano Vietnam center with website, YouTube, Blog... to provide the community with official information and documents about Cardano in Vietnamese. It's a great proposition to incentivize people to participate in the Cardano ecosystem\r\nAnd the given solution completely solved the problem. I strongly believe that.", "q0r": 5, "q1": "The proponent has done a lot of background work and thought through the ideas that underlie the proposal, which adds to the feasibility of the proposal. Group information can easily be checked on the individual links that the proposal provides. The proposed team consists of 3 main members, they are all heads of major Cardano forums in Vietnam, so there is no doubt about their ability to implement their proposal.\r\nThe plan is presented in a really optimal way, it is very likely that this proposal is successfully implemented in the way that the proponents describe. The proposal was well thought out, gave very clear reasons why it should be done, and I found it to be a great proposition, with a very high probability of success. According to statistics, there are about 40,000 members playing Cardano on forums in Vietnam, but only 20% of them master the knowledge of Cardano, most of the reason is because they don't understand English. . By creating an official information center about Cardano in Vietnamese for the community, I think it will help this community grow more and more.", "q1r": 5, "q2": "A clear roadmap with 6-month milestones is provided, all deliverables are specific, stages provide clear dates where progress and results can be tracked. can be checked by the community\r\nThe suggested metrics will certainly allow us to test and track the desired results. KPIs are very clear and fit the definition of success\r\n    The budget has been thoughtfully planned and detailed, with a great proposal like this, I think the budget given is a bit modest, 4$ / 1 hour is too little for your efforts or Are not?", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "Thanks for your review."}, {"q0": "The proposers highlight a problem with the divide in knowledge around cardarno fundamentals in the vietnamese cardano community comapared to the wider community and propose a range of online resources to further educate and fill this gap. These knowledge gaps were ascertained through a community survey and it would be useful to the proposal to make the community survey questions and results accessible to reviewers or to the community at the beginning fo the project. While the hub will initially be virtual in the provision of electronic resources, there is a desire to also build a physical space in further stages. The propject will impact Vietnam directly and the global community indirectly through raising awareness and the ability for interaction. ", "q0r": 5, "q1": "The vietnamese translated website is already live and translation and provision of information through online videos has a high degree of likely success. The team has a proven track record of accomplishing great work in the country-focused cardano community. They have worked tirelesly for the past 4 years translating essential cardano documentation into vietnamese and this project funding would help them builds on these skills and experience and expand what they are already doing. To me, they have proven they have the vision, motivation, and ability to succeed. The budget and implementation plan is explained clearly and appears an affordable use of funds.", "q1r": 5, "q2": "The community may audit the work through the youtube, website, and telegram channels. the KPIs are easily measured by the number of youtube subscribers and website visits. I would suggest that an additional KPI of youtube video views and video engament metrics are also included in the reporting. As an additional suggestion, the initial survey designed to assess community knowledge is a great tool for assessing the impact of this project from a base level and it could be used again at project conclusion to track the rate of knowledge-building.", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "Hi there, Thanks so much for your comments. 100% agree with you about KPIs. My team (especially Marketing team) and I have been discussing alot about that. And we are going to update on Dec,25,2021. Once again, thanks so much."}, {"q0": "The proposal has a certain degree of impact on a particular blockchain Vietnamese speaking community. I believe the outcomes would be more significant and reliable in information storage and delivery to a vast audience. With problem statement \"A survey on Cardano Vietnam community shows that about 80% don't know or incorrectly answer basic knowledge related to Cardano blockchain.\". The proposal should include minimal information on how this data and statistics were collected and the target groups used in this survey.", "q0r": 4, "q1": "If your team stores those contents (translates/Video/blog, etc..) from the current hosting site, content to produce in the next six months or future on to the main Cardano forum/Exchange etc. Thus, your team would save and use the $1000 on website hosting and all the server rental for translation quality and enhance the marketing reaching to the end-user. The reason for that is for community and community benefit so not just the Vietnamese. Still, whoever visits these main sites and the chance that they would see exponent effort, I believe and share what your group has done for Vietnamese in Cardano ecosystem and possibly use similar methods in their language. It is a win-win game for Cardano and your team and the community overall.", "q1r": 4, "q2": "The precise details on what to do in each month provided, the budget has a breakdown for entirely next six months if the proposed would be funded. With this effort, I believe the child and team member who take care to report in the next three months would be appreciated from your detailing, well-done team.", "q2r": 5, "assessor": "z_assessor_726", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1, "reply": "Hi there, thanks for recommending to \"store on to the main Cardano forum/Exchange etc\", ....\" win-win game for Cardano and my team and the community overall\". That's absolutely what we intended to do at the beginning. But you know, the key point (different point) is Marketing and User Interface. We would like to spread Cardano to as much people as possible. And using our own website with good design/user interface will attract more people."}], "solution": "Estabelecer um centro de informações com website,youtube,blog... para fornecer à comunidade informações e documentos oficiais sobre Cardano em vietnamita", "experience": "Equipe: Especialista em Marketing, Community Outreach, Gestão de Projetos, DevOps, Escritor e Analista de Conteúdo Técnico, Fluente em inglês e vietnamita"}