{"id": 383975, "author": "profd2004", "title": "Cardano Blockchain Lab in Kenya", "url": "https://cardano.ideascale.com/a/dtd/383975-48088", "category": 26244, "amount": 38255, "description": "Embora o Quênia esteja na vanguarda das inovações tecnológicas na região, Cardano ainda é pouco conhecido entre o público & Devs.", "funded": 2, "upvotes": 106120920, "downvotes": 2583699, "votes_result": 103537221, "votes_cast": 247, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "O problema identificado nesta proposta está de acordo com as expectativas do desafio. Keyan é um país na África onde a adoção global da tecnologia de cadeias de bloqueio precisa acontecer para ajudar a comunidade local a resolver alguns dos principais problemas que estão enfrentando. A criação de um centro para orientar os desenvolvedores agregará muito valor à comunidade local, bem como ao ecossistema cardano. O jogo final deve ser aqueles desenvolvedores capazes de construir dapps no ecossistema de cardano, que resolverão os problemas que os africanos estão enfrentando neste momento. Além disso, o proponente acrescentou métricas-chave que se alinham perfeitamente com o desafio. Eu não identifiquei um plano de escalonamento para desafios futuros, mas em minha opinião, pode haver pelo menos duas formas de escalonar esta proposta - uma sendo a replicação do mesmo centro em outras partes do país, a outra sendo a ampliação do centro existente. (Classificação 5)", "q0r": 5, "q1": "O proponente mencionou ter experiência em desenvolvimento e em tecnologia de cadeias de bloqueio, mas não forneceu evidências como um perfil vinculado ou mesmo um trabalho anterior a esse respeito. Sugiro ao proponente que acrescente essas informações, pois elas são realmente importantes para julgar a viabilidade do projeto. Além disso, o orçamento foi dividido em itens identificáveis. Todos os itens necessários para realizar este projeto foram delineados, mas não estou apto a saber a exatidão dos preços indicados. Mas, com base em minha única intuição, acredito que os preços estão corretos. Além disso, um cronograma foi fornecido pelo proponente. Mas não identifiquei, nesta proposta, um plano no caso de ser necessário um financiamento adicional. Sugiro ao proponente que tenha isto em mente, pois o orçamento provavelmente nunca será exatamente preciso. No total, tenho forte confiança, com base nas informações delineadas nesta proposta, que o projeto pode ser implementado com sucesso.(Classificação 4)\r\n", "q1r": 4, "q2": "Esta proposta tem uma alta probabilidade de ser auditada com base nas informações fornecidas pelo proponente. A proposta inclui um roteiro e marcos razoáveis. Os marcos podem ser rastreados em 3 meses, 6 meses e 9 meses. A comunidade recebeu todos os detalhes, incluindo os KPIs, a fim de acompanhar o progresso desta proposta. No total, posso dizer que o problema descrito nesta proposta foi descrito claramente e a solução também.(Taxa 5)\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Impacto:\r\n\r\nA declaração do problema:\r\nO Quênia está na vanguarda da inovação tecnológica, mas Cardano continua sendo largamente desconhecido entre o público e os Desenvolvedores da região.\r\nPara resolver este problema, o proponente elaborou um plano para introduzir um Laboratório Cardano Blockchain no Quênia.  Este esforço é projetado para resolver a falta de conhecimento sobre Cardano no Quênia e servirá para trazer nosso eco-sistema para a vanguarda do reconhecimento tecnológico na região.\r\nO plano exige trabalhar com Organizações Não-Governamentais bem sucedidas para formar equipes de jovens profissionais quenianos focados no eco-sistema Cardano.  \r\nInformações demográficas:\r\nO projeto tem como objetivo a integração de novos desenvolvedores, a tradução do conteúdo de Cardano em suaíli e a realização de trabalhos de desenvolvimento de cadeias de bloqueio hospedados pelo site lidonation.com, um pool de estacas baseado em cardano (LIDO) e um website introdutório.\r\nEste projeto procura impulsionar a adoção em nível térreo com um plano robusto para conduzir um forte alcance comunitário com a participação ativa e benéfica de vários recém-formados na faculdade.\r\nUm plano de ação:\r\nO plano dos proponentes começa com a aquisição de computadores usados exclusivamente para administrar Cardano e facilitar o mentoramento, o trabalho do desenvolvedor e o treinamento.  Com o início do programa de mentorship, a equipe planeja então formar encontros mensais dirigidos por dois oficiais de alcance comunitário que também receberão horas de escritório e participarão/estabelecerão canais Swahili Cardano em plataformas de mídia social.\r\nParte do plano inclui fazer com que o laboratório se torne auto-sustentável ao encontrar formas de explorar o ecossistema Cardano e suas oportunidades.  As coisas que estão sendo exploradas incluem:\r\n1. doação de ex-alunos\r\n2. a gestão de um pool de estacas\r\nEsta proposta trata do desafio aos Pólos Comunitários Scale-Up Cardano, empregando inovação ousada combinada com planejamento concreto para atingir sua missão declarada. Concordo plenamente que esta proposta trata efetivamente do desafio:  PONTUAÇÃO DE AVALIAÇÃO 5.\r\n", "q0r": 5, "q1": "Viabilidade:\r\nO proponente desta avaliação usa um plano sólido e conhecimento regional especializado para comunicar uma visão de sucesso deste projeto.  \r\nIndicadores-chave de desempenho (KPIs):\r\nO projeto já está em andamento e se for bem sucedido.  O lançamento do Hub nos próximos 6 meses será o primeiro de seu tipo no Quênia. 5 desenvolvedores já estão aguardando para fazer parte do programa de mentoria.  Uma vez que os desenvolvedores atuais sejam treinados, eles farão a transição para o gerenciamento do laboratório.\r\nEste projeto tem o apoio da Friends of Ngong Road (FONR), uma organização sem fins lucrativos sediada nos Estados Unidos que faz arrecadação de fundos para a NRCF e a Ngong Road Children's Foundation.  A NCRF é uma ONG com sede no Quênia que oferece oportunidades de educação de qualidade às crianças afetadas pelo HIV/AIDS que vivem nas favelas de Dangoretti, em Nairóbi, Quênia.  \r\nKaribu Techmates é um programa patrocinado pela NRCF para ajudar os recém-formados universitários com habilidades técnicas a acessar treinamento e oportunidades de emprego. O novo centro de estudos Elimu Hub oferece oportunidades de aprendizado e emprego na economia on-line.  Este projeto está trabalhando para se tornar um parceiro estratégico neste empreendimento, desenvolvendo uma forte comunidade Cardano de alcance e desenvolvimento.\r\nEsta proposta poderia se beneficiar da exposição à grande base de doadores da FONR/NCRF, aumentando assim o alcance geral do projeto.  Estas ONGs bem estabelecidas fornecem a credibilidade necessária para este projeto.\r\nUm Roteiro:\r\nO objetivo de 3 meses é ter 5 estações de trabalho dedicadas, 2 estagiários desenvolvedores e 2 oficiais de alcance comunitário que teriam hospedado seu primeiro Evento Comunitário e estão programados para continuar com os eventos mensais.\r\nA meta de 6 Meses veria a primeira coorte de desenvolvedores se formar no programa e a segunda coorte começar com eventos comunitários acontecendo a cada mês e se reportar à Comunidade Catalisadora com atualizações sobre o comparecimento e feedback dos eventos.\r\nA meta de 9 Meses exige que os veteranos Mentees liderem programas contínuos de mentoria de desenvolvedores com o laboratório envolvido com a Comunidade Catalisadora.  Isto também criaria oportunidades para novas parcerias e financiamento para manutenção contínua neste ponto.   \r\nHabilidade necessária para completar o projeto:\r\nAs principais pessoas por trás deste projeto são:\r\nDarlington Wleh - um Engenheiro Dev/Ops com 3 anos de experiência que é descrito como tendo um profundo conhecimento de tecnologias de nuvens, linguagens de programação de computadores, e tecnologias de cadeias de bloqueio. Seu perfil é verificável através do LinkedIn.\r\n\r\nStephanie King não tem um perfil profissional, portanto é difícil se ela tiver a habilidade, a experiência ou o histórico para alcançar o objetivo do estado.\r\nA divisão do orçamento:\r\nO orçamento detalhado para este projeto está detalhado e explicado muito bem. Ela delineia os custos para:\r\n1. desenvolvedora Mentees\r\n2. postos de computação\r\n3. site para o laboratório\r\n4. diretor de mentoria\r\n5. alcance comunitário\r\n6. espaço de escritório, materiais, marketing, hospedagem de eventos\r\n7. coordenador e administração do Cardano Hub\r\n8. uso da Internet\r\n9. eletricidade.\r\nEsta discriminação de custos é abrangente e se presta muito bem para estabelecer transparência e credibilidade com a Comunidade Cardano. Concordo que, dada a experiência e o plano apresentado, é altamente provável que esta proposta seja implementada.  PONTUAÇÃO DE AVALIAÇÃO 5\r\n", "q1r": 5, "q2": "Audibilidade:\r\nComo este projeto ainda está em seus primórdios, os indicadores-chave de desempenho ainda não foram totalmente desenvolvidos. No entanto, há informações suficientes entre o roteiro e a discriminação detalhada do orçamento para acompanhar o sucesso deste projeto usando estes dois documentos para acompanhar com precisão o progresso do programa. O programa utiliza:\r\n- Desenvolvedor Mentees - $4.500 Estagiários no programa de mentoria de desenvolvedores recebem $250/mês por um compromisso de 30 horas/semana.\r\n- Estações de computação - $11.000 3 Novas estações de desenvolvimento com capacidade para executar todas as peças arquitetônicas do cardano: db-sync, um nó, servidor graphQL, ogmios, hasura, um backend de carteira e o backend de aplicação plutus.\r\n- Website para o laboratório - $360 Isto cobriria o custo para criar um novo website para o Laboratório Cardano da Ngong Road em Nairobi Quênia, e para hospedar o site por 1 ano.\r\n- Diretor de mentoria - $6.000 Darlington dirige o programa de mentoria e passa 5 horas por semana treinando os indivíduos acompanhados no programa, incluindo uma sessão de programação de 3 horas de pares. Darlington já está mentorando 2 alunos recém-formados. Ele também orientou com sucesso 3 estudantes para posições de engenharia de software em tempo integral na Yelp, electricbikereview.com e no Departamento de Jogo e Pesca do Colorado (todos eles ainda estão empregados nas respectivas organizações).\r\nEventos Comunitários e Divulgação\r\n- Community Outreach - $6.000 Pays for 2 Community Outreach officers in Kenya, mais o apoio do Coordenador da Equipe da Nação Lido. Planejaremos e hospedaremos reuniões mensais, horas de escritório com membros da comunidade interessados em Cardano, e participaremos de Plataformas Sociais para ajudar a criar e fazer crescer canais de conteúdo queniano/swahili para Cardano.\r\n- Materiais de escritório, aluguel de espaço, capacitação de marketing, hospedagem de eventos - $2750 Pays for Zoom and MailChimp Subscrições, móveis e suprimentos de escritório, e refrescos para eventos mensais.\r\nUtilidades e Administração\r\n- Cardano HUB Coordenador e Administração - US$ 3.200 Paga para o pessoal da Nação Lido e Elimu Hub contratar pessoal, coordenar objetivos, planejar futuros fluxos de receita para sustentar o laboratório além dos 9 meses de lançamento.\r\n- Internet - $4033,00 Esta quantia cobre 60% do custo da Internet para as instalações durante 9 meses. Conseguir uma boa Internet no Quênia é desafiador e caro; ser capaz de ajudar a NRCF com isto é fundamental para alcançar esta região com ferramentas de cadeia de bloqueio!\r\n- Eletricidade - $412,00 Esta quantia cobriria 50% da conta de eletricidade para as instalações por 9 meses. O novo Elimu Hub está sendo construído para funcionar com energia solar!\r\n- Concordo que as informações fornecidas são suficientes para auditar o progresso e o sucesso da proposta. PONTUAÇÃO DE AVALIAÇÃO 4\r\n", "q2r": 4, "assessor": "z_assessor_479", "no_vca": 15, "ne": 9, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Este é um projeto realmente incrível que procura fortalecer a comunidade local no Quênia através de uma parceria com um centro comunitário bem estabelecido - Elimu Hub. A premissa deste projeto é fornecer os recursos físicos e a educação necessária para ensinar a comunidade local sobre Cardano e aumentar a conscientização sobre Cardano dentro de um ambiente seguro e acolhedor.\r\n\r\n\r\nA equipe tem uma vasta experiência e já está engajada na entrega de tradução swahili em Cardano. Eles irão orientar 5 novos desenvolvedores de Cardano e apresentar muitos ao ecossistema cardano através de eventos e workshops baseados na comunidade. O projeto é focado localmente em uma área empobrecida do Quênia, a escalabilidade deste projeto pode ser possível através da implementação de modelos similares e parcerias em outros espaços comunitários em favelas em todo o mundo. Para isso, seria necessária uma excelente documentação para construir um estudo de caso sobre o impacto deste projeto.", "q0r": 5, "q1": "O núcleo comunitário com o qual esta equipe de projeto tem parceria está baseado nesta área desde 2003 e desenvolveu uma visão de longo prazo de como eles poderiam beneficiar crianças e jovens nesta área através da educação e, de fato, através do fornecimento de esperança para o futuro.\r\n\r\nA equipe tem um plano detalhado para acrescentar ao núcleo educacional existente e terá o apoio de uma equipe dedicada com experiência Cardano. O plano de execução deste projeto também é realmente sólido com orçamento para pagar a participação do mentor que removerá barreiras significativas para os jovens participantes nesta área e, além disso, os motivará e os educará a contribuir o máximo possível para o programa em termos de seu tempo e energia.\r\n\r\nO cronograma, o orçamento e o programa em geral são realmente claros e fazem muito sentido, considerando o contexto em que a equipe está trabalhando. Ele fornece recursos físicos, acesso estável à Internet e apoio para o alcance da comunidade e suprimentos básicos.", "q1r": 5, "q2": "Este é definitivamente um projeto que poderia ser melhorado se houvesse um perfil contínuo nas reuniões da prefeitura para ajudar na entrega e garantir que o projeto continue no caminho certo. Nesta fase, há muito pouco indicado na proposta referente a como eles relatariam, porém parece haver um grande interesse em Cardano e isto apresentaria oportunidades para trocar idéias e inspirar mais projetos de mudança de vida como este em todo o mundo. Os KPI's e os marcos são claros e mensuráveis. As datas de entrega não são específicas, no entanto, os marcos baseados no tempo permitem que o início do projeto esteja em sintonia com o resultado do financiamento e provavelmente uma miríade de outras considerações para a execução de um projeto desta natureza.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 11, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "I think this proposal effectively addresses the challenge since it wants to create a hub/ lab in a NGO (Ngong Road) in Kenya to introduces and educate graduated students of this NGO about Cardano/ blockchain. Target community is good since fresh graduates are sensitive about technology. They can form a hub and sharing information with others.  ", "q0r": 5, "q1": "Timeline, budget, team, resources are all fine.\r\nThe only thing that makes me concern is the sustainability of the lab since it asks to be invested facilities ($11k for computer stations) but I don't see how to generate the lab's own money to continue operating after 9 months being funded. ", "q1r": 4, "q2": "Roadmap with milestones is clear. I advice team to add KPIs to the proposal, for example: number of people joining offline meet-ups, numbers of engagement Swahili social channels, people attracted to Cardano via the lab, etc.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Ampliar o núcleo de estudantes comunitários existentes para adicionar um Laboratório Cardano Blockchain com computadores dedicados, mentoria de desenvolvedores, e ed. comunitária.", "experience": "14+ anos Software & Cloud Engring, desenvolvimento de Blockchain, consultoria empresarial, idiomas do mundo, redação técnica, ensino, mentorado 3 pés ."}