{"id": 384643, "author": "mayraceja", "title": "6-Wk Crypto Bootcamp + VC Demo Day", "url": "https://cardano.ideascale.com/a/dtd/384643-48088", "category": 26255, "amount": 120000, "description": "加密货币初创企业需要获得以加密货币为重点的教育、顶级加密货币投资者和导师的帮助。大多数加速器都太普通了。", "funded": 1, "upvotes": 38857025, "downvotes": 15226705, "votes_result": 23630320, "votes_cast": 162, "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "是的，这个提议有效地解决了挑战，并可能为Cardano生态系统提供重大影响。通过专注于加速器的加密货币项目，不仅提供教育、训练营和辅导，而且还提供在加速器内进行推销的机会，该提案将自己与这一类别的其他项目区分开来。这增加了该提案的影响，因为开发人员和其他加密企业将配备技能，将他们的项目推向下一阶段，同时与已经在Cardano生态系统中的关键人物有直接联系。  我希望看到该团队计划如何让Cardano社区参与该计划的开发，以及如何与他们分享最终产品。目前还不清楚如何选择感兴趣的社区成员参与，或者这将是一个开源项目，还是将其商业化以获取利润。虽然我确实认为这个项目听起来可以给社区带来影响，但这一点需要进一步解释。为了得到满分，投票者不应该对 \"什么\"/\"如何\"/\"为什么 \"等内容留下疑问。", "q0r": 4, "q1": "是的，鉴于所提出的计划和提案人的经验，这个提案极有可能成功实施。提案人在提供他们的证书方面做得很好，供社区成员在投票前验证。很明显，他们有经验可以提供，并且是区块链/加密货币领域的资深人士。由于以下原因，我对这部分给予4/5的评价。1）没有时间表，路线图只提供了方案的概述，但没有提供他们计划如何开发/实现它；2）预算对于所要求的金额来说远远不够详细。说10万美元的工作人员并没有给选民任何指示，说明你是如何得到这个数额的，以及它是否合理--多少工作人员？他们的缺席并不意味着这些问题不存在或没有想到，但这取决于提议者是否明确，而不是让选民通过假设来得出结论。将这些要点纳入今后的工作，可能会给选民带来额外的信心，相信所提出的建议是可行的。", "q1r": 4, "q2": "不幸的是，所提供的信息既不充分，也不足以审计该提案的进展和成功。虽然我很感谢其中包含的 \"结果和关键绩效指标 \"部分，但它过于稀疏，没有真正衡量该提案是否可以被审计。例如，提案人列出了。15-30家初创企业从第一批学员中毕业；每个团队至少有1次以上的现场导师会议；成功的演示日；以及学员毕业后的调查。然而，这些内容看起来更像是一份检查清单，而不是可以被审计的东西。让我进一步解释，如果你有15-30个项目的毕业生，你将如何确定他们所花的时间是否成功？这是否包括辍学或自然减员？对这15-30人的选择标准是什么？接下来，每个团队有1次以上的现场指导课程是一个有趣的指标，但这也是他们将与客人一起经历的课程的一部分--所以不清楚这将如何帮助审核提案，因为这已经是他们完成的一个标准。最后两点也让人感觉太不成熟了，让投票者对可审计性有信心。你如何定义一个成功的演示日？资助的项目数量？有兴趣的风险投资商的数量？参会者的数量？还有，关于合作后的调查，什么会有帮助？- 你们将衡量什么？- 如何将结果提供给社区？\r\n由于这些内容似乎缺失，但对投票者来说是至关重要的，因此我既不同意也不反对这一内容。在未来的几轮调查中，我强烈鼓励对选民进行更详细的说明。", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is to set up an accelerator for 15-30 start-ups by two proposers who have experience across the VC and start up space, though not in actually running their own accelerator.  This meets what the challenge is trying to do, though maybe not quite as well as proposals from already up and running accelerators such as SeedStars. ", "q0r": 4, "q1": "There is a reasonable outline of how the accelerator would run. No detailed plan has been provided on how to get to this stage and make it all happen. Whilst the proposer have been involved in this area, its not clear from their LinkedIn profiles how much they were involved in actually getting it all up and running. They probably have the networks to bring in the mentors given their experience. It would be nice to see a better budget breakdown than just staff 100k, Marketing/ Website/Docs/Admin 20k. \r\nA more detailed plan on how to manage the behind the scenes and costs would give more confidence of a successful delivery.", "q1r": 4, "q2": "The program ahs been set out and delivery it thus auditable. They have set out some KPI's which can be measured. One of the KPI's is \"Successful Demo Day\". What is success in this context. Is it the amoutn of funding raised, the number of people attending/viewing, the amount of media exposure? It would be good to have some goals around this against which success can be measured. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 6, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "With aligned key metircs and goals, this proposal answers exactly what is being asked in the challenge. The problem is well identified and solution simply explained. The suggested bootcamp and investor connections sound like a scalable solution that could be a great follow-up for Catalyst funding.", "q0r": 5, "q1": "Both Mayra and Audrey are well-known figures in the industry and it's an honor to read a proposal written by them. The plan is very good and the enclosed 7-page pitch deck relays the same information more visually. A bit of nitpicking though: on one slide the white font on light background is almost invisible.", "q1r": 5, "q2": "The deliverables and KPIs are simple and understandable. Only thing that could have been opened up more is the budget. How is the $100,000 for staff distributed? Which roles, how many hours, at what rates etc.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Definite 6 week crypto boot camp to provide mentorship. Clearly addresses the challenge.", "q0r": 4, "q1": "The team of experts have the experience to implement the proposal. The team are Mayra Ceja and Audrey Chaing, who are blockchain specialists with over 10 years experience. Links to their profiles are attached to the proposal. The team can implement the proposal successfully. The detailed plan outlines pre-wor, education and worksheet, 6 week live sessions, virtual bootcamp, recorded video, among others, which all point to a successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clearly showing in the proposal as week 1 to 5 with clear guidelines. The budget however is quite high and a little more details could have been provided to allow effective auditing. Hence my 3 star rating. ", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal demonstrates acceleration and mentorship benefits for selected companies. It is unclear what the rough selection criteria would be, so therefore, its unclear if this proposal benefits the community as a whole or if it is substantially additive to the existing ecosystem. ", "q0r": 4, "q1": "The Team is competent and accomplished. The concept is not unduly difficult.", "q1r": 4, "q2": "The proposal lays out no milestones in program development. Therefore, it's not possible for the community to audit the progress of this accelerator. Success milestones are present and seem publically auditable, ie did this happen? yes/no.", "q2r": 4, "assessor": "z_assessor_701", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The proposal is the very definition, in a traditional and useful sense, of accelerating and mentoring individuals for beginning ventures.\r\nThis is a 6 week bootcamp course, with a structure layout and mentors already lined up.", "q0r": 5, "q1": "The experience of the team of proposers, as well as the mentor examples provided, appear to be of very high quality.\r\nThe plan, as mentioned, is a well-structured 6-week bootcamp course ranging from initial fundraising concepts, to mentor reviews and pitches.\r\nOne concern is a bootcamp course is a lot of information in a very short period of time. I was not able to determine if there will be any prior requirements. This is not a determining factor, however a consideration.\r\nThe budget is broken down as 100k or staff and 20k for everything else. I am not sure I am understanding the thought behind this number breakdown. I would suggest a slightly more involved explanation of individual costs, could help viewers.", "q1r": 3, "q2": "The graduates and as well as the survey (providing the results are anonymously public) are decent KPIs for this proposal.\r\nI am not sure it is clear to viewers what determined a \"successful demo day\".", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Cryptcellerator（为期6周的加密货币训练营），由经验丰富的区块链专家和风险投资人组成。包括现场会议、导师和加密VC演示日。", "experience": "10年以上风险投资、创业公司/加速器、区块链，教育过1000多家创业公司，顶级加密货币风险投资/创业公司的导师网络"}