{"id": 381011, "author": "wx10086", "title": "市值拉升", "url": "https://cardano.ideascale.com/a/dtd/381011-48088", "category": 26247, "amount": 500, "description": "(a) letter", "funded": 0, "upvotes": 14912287, "downvotes": 15992916, "votes_result": 1080629, "votes_cast": 115, "f6_no_assessments": 8, "f6_rating": 1.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Whilst I cannot read Chinese, the translation of the solution \"Find a large fund company to cooperate in market value management\" is not a proposal.", "q0r": 1, "q1": "No plan has been presented. The experience provided of \"Keep rising like eth\" is not experience. This is not a real proposal.", "q1r": 1, "q2": "No deliverables or timelines provided thus progress cannot be audited. No metrics for success provided.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 39, "ne": 4, "ng": 27, "nfo": 8, "vca_o": 1}, {"q0": "This proposal should have been removed. There is just far too few content to assess it in any way, regardless of the language it is written in (Chinese). The only thing I can make up out of the translation of this proposal is 'Dora Disk' and even with that information, there is no context to determine what it is. ", "q0r": 1, "q1": "The proposer's relevant experience states 'Keep rising like ETH' in Chinese. I fail to see how this is likely to be implemented successfully if the proposal doesn't even possess content explaining what it is about, let alone how it would rise like ETH. ", "q1r": 1, "q2": "There is nothing to go by. Not even a plan or an explanation why something that is non-existent should require 500 USD. ", "q2r": 1, "assessor": "z_assessor_113", "no_vca": 32, "ne": 3, "ng": 24, "nfo": 5, "vca_o": 1}, {"q0": "How this proposal is still in the assessment phase I do not know. We get no information on what the proposal represents or how it plans in executing it. I do not believe this proposal fits within the challenge", "q0r": 1, "q1": "Regarding feasibility, we get no information as well. The experience provided is rising like Ethereum. That is indeed the plan of Cardano and we plan to get ahead of Ethereum but this does not provide any relevant experience to this proposal. there is no detailed plan so we don't know what the proposer plans on doing.", "q1r": 1, "q2": "The same goes for audits, we have nothing to work with. No plan, no roadmap, no evidence of a budget breakdown. There is no way we can assess the progress of something that does not exist.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 26, "ne": 0, "ng": 21, "nfo": 5, "vca_o": 1}, {"q0": "My Google translate of the Chinese is as follows:\r\n- Title: Market Capitalization\r\n- Problem statement: Many suggestions pull plate [may mean withdraw?]\r\n- Solution: Find a large fund company to cooperate in market value management\r\n- Experience: Keep rising like ETH\r\nIt is not clear what the relationship is between these suggestions and the challenge.", "q0r": 1, "q1": "No information is provided on delivery of the plan to increase market capitalization (of what?).", "q1r": 1, "q2": "No information to allow audit is provided.", "q2r": 1, "assessor": "z_assessor_495", "no_vca": 25, "ne": 1, "ng": 17, "nfo": 7, "vca_o": 1}, {"q0": "I'm glad to see your proposal. It seems to be an incomplete proposal, I have to give you a low rating because it is incomplete in content. I hope you will complete it soon and submit it to the fund. Come, wish you success.", "q0r": 1, "q1": "the proposal team has not stated any information. Please clarify and improve next time. I am quite curious about the content of this proposal next time.", "q1r": 1, "q2": "this seems to be a draft. sorry to give you a low transparency score for the project. look forward to reading the team's proposal next quarter.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 24, "ne": 0, "ng": 15, "nfo": 9, "vca_o": 1}, {"q0": "This Proposal has no specific plan or solution. All are still just ideas. Proposer should spend more time developing the proposal a plan to implement these ideas. To make it more convenient, the proposer should make a proposal in English so that he can reach the voter and get the comments from the CA.", "q0r": 1, "q1": "No relevant experience of the team was given. No plan, solution or roadmap. So the proposal is not feasible", "q1r": 1, "q2": "No deliverables of timelines thus delivery cannot be audited. No metrics for success mentioned.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 24, "ne": 0, "ng": 15, "nfo": 9, "vca_o": 1}, {"q0": "This proposal is about market capitalization [市值拉升]. This idea remains very abstract. Problem [建议多拉盘 - Recommended Dora Disk ?] is almost not provided. The solution is not clearly defined [\"Find a large fund company to cooperate in market value management\"?]. Therefore, based on the given information, I strongly disagree with this proposal's impact, I can rate it with a score of 1", "q0r": 1, "q1": "There is a lack of the following information: (1) team/proposer's profile; (2) Information of demo/pilot/similar works; (3) Budget breakdown; (4) Risk (and mitigation). Therefore, based on the given information, I strongly disagree that this proposal will be implemented successfully, I can rate it with a score of 1", "q1r": 1, "q2": "The information provided is very limited and remains very abstract.\r\nTherefore, based on the given information, I strongly disagree with this proposal's auditability, I can rate it with a score of 1", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 22, "ne": 0, "ng": 16, "nfo": 6, "vca_o": 1}, {"q0": "The project proposal currently mentions the initial goal very briefly - the content is unknown:\r\n1/ Proposing the problem to be solved\r\n2/ Suggest how it adds value to Singularity A.I and Cardano\r\n3/ Proposing future expansion scale", "q0r": 1, "q1": "Proposal provider has not provided evidence (References, links, ..) about relevant factors.\r\n - There is no clear number of members participating in the project\r\n- Unallocated budget, split items if done\r\n- There is no timetable for completing the project and corresponding resource and technical factors", "q1r": 1, "q2": "Information about the project is not provided enough to assess the progress of implementation\r\n- Milestones and related timelines\r\n- The attached KPIs\r\n- The solution is not clear", "q2r": 1, "assessor": "z_assessor_757", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}], "solution": "找到大型基金公司合作的市值管理", "experience": "a rise above a certain level (of)"}