{"id": 383200, "author": "travisyatsko", "title": "AI/ML Dataset Extraction Service", "url": "https://cardano.ideascale.com/a/dtd/383200-48088", "category": 26247, "amount": 30000, "description": "AIプロジェクトはデータに基づいて動作しますが、現在、ブロックチェーンからデータを抽出するには、db-syncでノードを動作させる必要があるため、制限があります。", "funded": 1, "upvotes": 40010464, "downvotes": 7259777, "votes_result": 32750687, "votes_cast": 148, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Great idea. You can't build ML models without data and this would make the data accessible to the larger ML community without having to go through all the hassle of running your own node. Will increase the number of people experimenting on Cardano Blockchain data which is the first step to producing useful ML based products. My one question is what is the funding model going forward to keep the service running. How many people/queries can that AWS instance usefully serve? If the proposers aren't intending on making a commercial product out of this, a nice output could be to create and AWS package that people could run on their own instance. This would allow someone to prototype a product here, then switch to their own instance to run their product to manage their own reliability and data access.", "q0r": 5, "q1": "This is a relatively simple plan and the proposers have ample experience to execute. The budget is a little messy, total is set at 30k, so taking out fixed components that leaves 5k for the AWS service which at $160.month is 31.25 months. Is that how long they intend to leave it running for? Or will they spin up more instances for a shorter period?", "q1r": 5, "q2": "Delivery of the service is in one sense easy to audit. However it would be better if the proposers put some numbers around the amount of data/queries they expect to be able to handle. Measurement of success would be better served by targeting a number of unique users of the service, and even better a number of new projects that get spawned out of initial access to the data here and then going on to running their own node once they prove up their idea. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 30, "ne": 9, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "Analytical data is of importance when it comes to general development. To that respect, this is a great idea in order to create more insights and identify efficiency opportunities. Deploying it as a free service would lower utility barrier and in extent the more it gets used, the more efficiency gain can be realised. Therefore, the ROI (return on intention) gets fulfilled as it would basically pay itsself back. This project has a focus on facilitating AI-development instead of deploying AI within the actual project initially. ", "q0r": 4, "q1": "There is a huge need for this in the community, especially for SPOs (staking pool operators) who rely heavily on this data. The relevant experience claimed by the proposers is representative to the task they intend to take on themselves. Being engineers, they understand the importance of accessibility to an array of data. ", "q1r": 4, "q2": "Most auditable features are present in this proposal, but in the funding breakdown, it states a cost of 20K USD for engineering, this could be improved by detailing how many engineers you are aiming to employ and how many hours they are prospected to work. To improve the proposal, Some more information on how the data would be obtained would clarify the process as well as a definition of success explaining how many people the service is aimed at. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "Gathering data that is analytical data is an important step for AI and ML. By providing a service that makes gathering data a breeze would boost the ecosystem. This would lower the barrier for apps and tools to be build on the ecosystem. ", "q0r": 5, "q1": "The proposal has what it needs. We get a clear roadmap, the team proposing this has the relevant experience needed for this project. The proposal would benefit from a bit more details in the budget breakdown.", "q1r": 4, "q2": "To make a good audit on this proposal after funding we get all the fundamentals. But as stated above some clarity in the budget breakdown would be advised, How many engineers do you have or plan on hiring for this proposal? What is in the miscellaneous?", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has two issues with respect to impact. First, it is not actually an AI/ML proposal (see below). Second, it does not suggest any connection to SingularityNet.\r\n\r\nEssentially, this is a proposal to set up a SQL search service on a Cardano node. While it is true that the output might be used for AI/ML purposes, there is no AI/ML involved in the proposal. Furthermore, there is no explanation of the type of datasets that would be generated and why they would be structured in a way that is useful for AI/ML.", "q0r": 2, "q1": "The proposal is not technically complicated and the team has strong technical expertise, so I agree it is highly likely that the proposal to build a SQL search service will be implemented successfully. I do not strongly agree because the lack of specific design criteria for the stated AI/ML purpose means that the details of what is to be built are uncertain.", "q1r": 4, "q2": "There is one audit / assessment criterion -- building a website that returns the output of SQL queries as a CSV file. This would be a clear indication of success for the project. However, it would be preferable if there were also criteria tied to usage of the website, e.g. number of users, number of queries.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1, "reply": "This proposal attempts to solve a fundamental problem to conduct AI/ML analysis of the Cardano Blockchain. While the project itself does not conduct any direct AI/ML techniques, quality data is the first step to successful models. Currently there is no easy mechanism for data extraction and this proposal aims to enable further community development between Cardano/SingularityNet. "}], "solution": "カスタムSQLクエリとデータセットを可能にするサービスを作成し、データ収集の負担を軽減することで、より多くのAI/MLプロジェクトを可能にします。", "experience": "トラビス・ヤットコ6年以上 ソフトウェア・エンジニア, SPO, TPM\nJia Yang: 6年以上、SpaceX社のエンジニア\nイスマエル・ムノス: 博士、6年以上エンジニア"}