{"id": 397004, "author": "jx", "title": "Finance DAO dApp + Stakepool Web3", "url": "https://cardano.ideascale.com/a/dtd/397004-48088", "category": 26438, "amount": 50000, "description": "Social networks are noisy and incentivize click-bait. Information is hard to find. Access to good research is expensive. Fomo and Hype.", "funded": 0, "upvotes": 23278957, "downvotes": 13415401, "votes_result": 9863556, "votes_cast": 92, "f6_no_assessments": 6, "f6_rating": 3.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 202, "q0": "DAOs are interesting thing and a hot topic these days. Giving the power to the community is the way to go and is according to Cardano main ideas. Self-sufficiency through stake pool funding is an interesting solution for such proposal. What I would like to see is some kind of confirmation that such solution is needed by the community (any kind of research, article or even forum topic) - to know that it's trully required by the people.", "q0r": 4, "q1": "It's hard to assess team experience when not knowing it. Judging by the fact there is MVP proposer himself is probably also the developer but except from his said experience we see no proofs of it. What's more, most of the job openings are up for grabs so we cannot be sure who will be the part of final team.", "q1r": 4, "q2": "Proposer presented possible KPIs which sound reasonable (number of users, visits, conversion rate from lurker to active user). It would be good to know how community will be able to assess it - I believe that only admins will have access to backend to see the stats. Are you going to present monthly/quarterly reports? Where and in what form? ", "q2r": 4, "assessor": "z_assessor_1086", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8562, "q0": "Considering that a large part of those that come into contact with cryptocurrencies, at this stage, are investors the creation of a dedicated, incentivized social network can prove to be a very important addition to the Cardano ecosystem. This is especially true since according to their website https://finclout.io the platform aims to provide investment-related data for multiple cryptocurrencies, but the “principal currency of the platform at launch will be Cardano”, thus potentially exposing a large number of new users and investors to the blockchain.", "q0r": 5, "q1": "From his experience statement, the proposer behind this project is a very competent person, more than cable of implementing the proposed solution. \nI have also visited the https://finclout.io website and it seems to have been built by experienced and knowledgeable developers, capable of developing the project further, along the lines described in this proposal.\nThe proposer also visibly understands the type and qualifications of additional team members that would be needed to successfully implement the project, as these are clearly detailed.", "q1r": 4, "q2": "I would have liked to see a bit more details in the broken-down budget, like for instance expected salary costs per employee, but besides this minor omission, everything required for a smooth auditing process is present. Progress indicators and tracked metrics are clearly and sufficiently described. The project is already launched so there was no need to include an expected launch date.\nThe roadmap described is also clear and provides sufficient information on what the community could expect. More details in the roadmap would have been a nice addition, but perhaps these can be included in a future submission if the proposal is not funded in this round.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10843, "q0": "The proponent wants to build a social media app which includes a DAO and a stake pool. What is not clear to me is that this will be a decentralized application built with smart contract or is this a centralized app like web 2.0 like? I think that the proponent should clarify this as this challenge is for building dapps on Cardano. Besides this fact, I think that the idea may be a good one. Social media, if it’s decentralized and allows the community to earn money on top of that, can have a great impact on the ecosystem. I suggest to the proponent to give more information on the technology they will use to build this social media. After that we should be able to truly evaluate its impact on the ecosystem. For Now I give it a neutral rating  3", "q0r": 3, "q1": "They already have a MVP at https://app.finclout.io. I visited the website which looks nice but didn’t sign up. I think that the proponent knows the team needed to complete the work. They have provided the salaries of the team members needed as a budget breakdown. Altogether, this proposal is not easy to assess because it sounds like a web 2.0 project which is trying to put a web 3 mask by adding a stake pool in the mix. However, only the proponent can clarify this. I give it a neutral rating 3.", "q1r": 3, "q2": "The proponents have included milestones to complete certain tasks such as launching a token and organizing events on the platform. They also have provided metrics that should help track the progress of the project. Altogether, I think that the proposal is auditable based on the amount of information included.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10864, "q0": "The idea is to create a site where people research, discuss and share knowledge about the financial world. It's not very clear how Cardano's technologies would be used here. The proponent talks about DAOs, but who would constitute them? How would they operate, relate? Site members earned cryptocurrencies as a reward for doing what, exactly? The whole is confusing. The proponent explains better the functioning of the site itself - for example that it would have an artificial intelligence that would select the feed of each user based on their experience, similar to tik tok; it also lacks some features of the site, but the most important part for us (how does this all relate to Cardano) is superficial. The purpose of the challenge is to fund Dapps projects that are clearly beneficial to our blockchain, and with that it is imprecise, unfortunately the impact is low.", "q0r": 2, "q1": "There is no roadmap in the proposal, all that is said is what is expected to be ready in March and May. The ideal would be for the proponent to explain, since the time is 2 months, what would happen weekly. What activities which professionals would have to perform so that the partial objectives mentioned were achieved, that is, what would compose the pre-production process here. The budget is also not well explained. The asking value is high, and is divided into some parts, and these are just mentioned. It is not explained, for example, what \"others\" would be, how marketing would happen, how the work routine of the professionals involved would be, the price of their working hours, etc. We could not reliably understand how the requested money would be used; much more detail and clarity would be needed. And finally, regarding the professionals involved, it would be much more appropriate for them to attach a summary of their CV to the proposal, instead of just making their names, roles and linkedin profiles available. I think this part has to improve as a whole.", "q1r": 2, "q2": "To measure progress, 5 indicators are pointed out, but they are not well explained. They are quite technical, not being understandable to all readers of the proposal (I include myself in this part). It would be better if the proponent explained in simpler ways which quantitative and qualitative aspects would be used to monitor the development of this project; and also how the Cardano community would be aware of all this. Speaking of end results, the proponent is fully focused on how the platform would be considered a success, and not on how we could measure that impact for Cardano. How has all this benefited our blockchain? Have some specific goals of the challenge - such as increasing active members in the community, acquired and delegated Ada, circulation of CNFTs - been achieved? Finally, unfortunately, the auditability seems to me to be quite inadequate, requiring a complete review of this part of the proposal.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10952, "q0": "This is a proposal that aims to solutions to social media issues of information mismatch  and the expensive and almost impossible way of getting value and tailored made information by users in most social media channels. The creation of this social media platform with aim of circumventing the issues where users are incentivize to be moderatos in their choosen field of interest. The proposal is definitely aligned with goals and objectives of this campaign and the creation of this app will surely lead to more adoption of the network.", "q0r": 4, "q1": "From the information provided, it is obvious from plethora of experiences and past achievements provided that the proposer has the acumen and the competence to deliver this project. This notion is mainly buttressed by the fact that there is already an MVP in existence and live. The team's profile was not provided coupled with the budget breakdown and cost analysis was not detailed enough to verify the basis of the estimates. However, from what has been achieved so far, goes to say that the project is in good hands for a successful implementation.", "q1r": 4, "q2": "The proposal has given more than enough relevant information to effectively monitor and assess the progress and development of the project. A list of success KPIs were provided though there were no quantifiable basis to assess these metrics. Am convinced that with the information provided that the project can effectively monitored by the community.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10953, "q0": "This proposal aims to help traders by providing self-curated content that is produced by the community. In this day and age of click-bait and self-serving agendas, the idea of decentralized content creation and distribution is commendable. What makes it special is that it’s not only distributed content creation but the idea is that people are also curating and moderating each other’s content. They are all part of the same DAO, stake in the same stakepool and they are compensated with “creator tokens”.", "q0r": 4, "q1": "I had high hopes for the MVP but unfortunately it didn’t work: I was not able to log in after creating a password. It bugs me a bit that there are typos on the website (seems to be still work in progress), there are errors in the enclosed slideset (e.g. the persona slide talks about Frank and Wilson although it’s only one person), and the language in the proposal could be improved (example: “context” → “content”). Although petite mistakes in their own right, all this gives a bit of a rushed image of a one-man project. To make the proposal better it would be great if you could smoothen the edges for Fund9 and come back with a full set of team members. That would help create the needed additional confidence for the project that has an absolutely fantastic core idea.", "q1r": 3, "q2": "It is not clear if this is purely for Cardano or if there is some cross-chain angle (Solana logo on the website). Likewise, the entire deck is about crypto content but then also stocks are mentioned in the proposal. Moreover, the budget is not detailed enough. Mostly it goes to salaries (40%), marketing (30%), and architecture & services (25%) but there’s also a cost category “Other - 5%” that slips another $2,500 USD in without explaining what it is used for. Finally, the auditability section mentions some objectives and key results but that’s it. Listing five metrics without goals is not enough. You need to let the community know how they can keep track of your progress and success.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Finclout DAO+stakepool is a simple way to earn by sourcing, curating, and moderating financial context. Everybody is a mod in the DAO.", "experience": "Wrote the Research Paper on it\nMVP built\nSoftware that I have built is used in Banks across the globe\nImplemented AI-models across 11 countries on a 35B portfolio\nManaged a 4 Billion USD portfolio\nLaunched a DAO, a Cardano stake pool (RBA), mined, folded, and farmed crypto"}