{"id": 398070, "author": "ankitmawle", "title": "De. Application and Tender filing", "url": "https://cardano.ideascale.com/a/dtd/398070-48088", "category": 26438, "amount": 25000, "description": "All governments and institutions use manual or online application and tender filing, which being centralized are not secure or transparent.", "funded": 0, "upvotes": 24865772, "downvotes": 21745015, "votes_result": 3120757, "votes_cast": 89, "f6_no_assessments": 5, "f6_rating": 3.066666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7319, "q0": "The idea of ​​this Dapp is very good and theoretically fits perfectly with the objectives of the challenge. In this challenge, we are looking to fund Dapp projects that are beneficial to the Cardano ecosystem, that make our blockchain popular, that increase the number of active members in the community, the amount of Ada in circulation, the commercialization of CNFTs and the largest number of smart contracts being registered on the Cardano blockchain, for example. In this case, this Dapp works precisely on the last topic I mentioned. The idea here is to allow ordinary users to add files and have them minted in smart contracts. As new data would be added, new smart contracts would be created. A good summary of what would be done here is present in the following excerpt: “Encrypted archives end-to-end and privacy-based system to transparently check the status of each application”. It is also interesting how the proponent explains that “encrypted data whose values ​​can only be read after the opening period or authorized authorities as needed”. This generates a greater sense of control and security in relation to what is being coined. The only issue that I identified about the impact is that the user experience could have been better explained, as well as some uses of the case could be exemplified. I'll explain my point better: we know what will happen, but we don't know how people outside the cryptographic universe would be educated about the activities developed here. How would a regular user, who has never had contact with blockchain, learn to use the benefits of this Dapp? How could it be made useful and accessible to everyone? Or would it really be built with a more specific target audience in mind, who already understand how blockchain technology works and already know how to handle the technologies in question? Regarding the use cases, I think the following: the explanation of how Dapp would work is great, as it is accessible to most readers (CAs, vCAs, voters, etc). The proposal is highly technical, however it was explained in relatively simple language. However, I still haven't been able to visualize in practice some examples of how this Dapp could be used in people's daily lives. For example: companies, some single individual, a group of people in a hub... If 1 or 2 examples of how it could be used were included in the explanation, I believe the level of understanding of the project as a whole would be increased. Therefore, I liked the proposal, I thought it is well aligned with the objectives of the challenge, it only needs a few improvements to become ideal in the impact part. \n", "q0r": 4, "q1": "The proposal script is ok. We know what activities would be developed and according to the months of the year. However, it would be even better if the proponent detailed each of the actions mentioned monthly in greater detail. For example, during the “Development of the Decentralized Bidding System”, what small steps would have to be completed for this development to take place completely? In May, the “Development of the decentralized application form filing system” would take place. Lay people in the development part (like me) don't understand exactly what the difference in work is between the development of the bidding system and the development of the application form filing system. That's why I think it would be important for the proponent to clearly delimit the work needed for one of those months, which professionals would do what, how and for approximately how long (it is not strictly necessary that the time be further broken down, although it would be highly positive if the work was also divided into weeks). Now moving on to the budget explanation, in my opinion this part also needed to be more carefully detailed. The bidder explains how the total money requested ($25,000) would be divided into a few blocks, these blocks being made up of various things. For example, the first one would be: “Smart contract + web3 + AI developer hiring salary = approx. $10,000 by January 2023.” How much would go to smart contract, and how much would go to AI developer salary? Approximately how many hours would this professional dedicate to the project, so that we can know the value of his work hour? As in this case, the other blocks could be better broken down, for example the marketing part, 3 thousand dollars are requested exclusively for this, but it is not explained what publicity strategy this project would have, which would be the places where it would be publicized, and how it would be publicized and so on. Finally, speaking of the team, unfortunately this part was the one that left the most to be desired, because we don't have details about each of those involved. We only know the professional roles for the project to become possible, however, it would be essential for us to know who would fill each of these vacancies; we would need to know them individually in order to convey a certain trust. It would be necessary for their full names to be informed, as well as their professional resumes, including previous jobs (so that we could get an idea of ​​what experiences they have), as well as how these people relate to our blockchain. Therefore, the feasibility still has a lot to improve, because in my view the information provided was very basic, especially on the part of the team. \n", "q1r": 2, "q2": "From what the proponent informs, the project development process could be accompanied by the construction of the site and the github repository. Theoretically, this is already what is necessary for the Cardano community to be able to gradually follow the process of building the Dapp. All that was needed was for the proponent to inform us more details about how these sites would be filled. For example, what content would build the site? How often would the github repository be updated? In addition to the gradual milestones, that is, the partial results obtained during the Dapp development process, would the proponent inform us about the work routine of the professionals involved? My perception is that we have the basis of what we need, but not a detail that makes us really understand how the updating of these sites will happen, that is, what the Cardano community will be able to follow little by little. Now speaking of the end scenario, success would really be the delivery of a “secure and transparent platform as a service for various governments as well as institutions for all their application archiving needs with systems to roll back everything”. The larger objective would be to help “substantially reduce corruption and bribery in all its forms”. I think that, in fact, this is the most sought-after goal, however, once again, it lacks detail. How would we be able to understand if these goals were in fact achieved? How could we know if Dapp was delivered in full and in the way it was promised? And how can we assess the way users are using these technologies? And, more importantly: how can we see the real impact of all this for the Cardano ecosystem? It is necessary for the proponent to clarify these issues. My suggestion is that he does a survey directly with users, in order to understand how the end use of Dapp is going, if they are managing to create smart contracts, minting their data on our blockchain in a totally inviolable and transparent way. In this way, we would have a real understanding of the impact that the project would be having on the public. In the same way, it is essential that the proponent do some research on how this Dapp helped to popularize our blockchain, increase the number of people who manage smart contracts and also if this all increased confidence in the technologies relevant to Cardano, in order to contribute for widespread adoption of our blockchain. So I think auditability is going the right way, but it still needs a review and more detail on both parts (auditability of progress and final results). \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 2097, "q0": "This proposal aims to introduce a mechanism that allows interested parties to file tender proposals with governments and institutions through the creation of smart contracts. The app would also have a KYC feature and would benefit from the assistance of an external  oracle network (chainlink). \n\nFrom my experience every government or institution that accepts tenders to be submitted electronically has its own solution implemented, and it would be extremely challenging for a blockchain product to be able to “speak” to all these external solutions, bug-free and in a timely fashion. While I applaud the idea, I think that from a feasibility point of view the scope of it needs to be greatly reduced to perhaps a very targeted test project, or even to a pre-feasibility study to really understand all the complexities of interacting with multiple institutions and siloed systems. ", "q0r": 3, "q1": "Unfortunately the proposer is for the time being by his own in backing up this proposal, without an already existing team. So from a delivery point of view I raise a strong concern - that there are significant risks of non-delivery or impossibility to form a competent team around the subject. Timewise, the project would take from Apr 2022 until Jan 2023 but again, I take these estimations with a pinch of salt in the absence of a team behind the proposal. \n\nGiven all of the above I deem two stars enough, with a low feasibility project in front of us. I highly encourage the proposer to gather momentum around his idea and come back with another iteration that looks much stronger in terms of team and delivery capability. ", "q1r": 2, "q2": "The proposer promises that the github repository of the project would be made public, and that a website would be created for it. The proposal definitely lacks a more detailed dive into the performance measurements needed in order to tackle metrics around tender proposals, like for instance: number of submitted tenders, success rate vs. non-blockchain tenders, cost of submission comparisons, etc. These are just a few possible reflection points for the proposal’s future iterations.", "q2r": 3, "assessor": "z_assessor_1454", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10860, "q0": "Unfortunately, the proposal does not really fully explain itself. While the reasoning behind it, improving tendering processes and counteracting bribery and intransparency is something quite useful (speaking as someone working at an engineering company where fair tendering processes play a vital role), the solution could be explained better. Is it going to be built on Cardano or another blockchain, or an entirely new blockchain? How will the encryption work? What role will Governance play, as it is dropped as a word but not explained? In this stage, it is difficult to assess the exact impact and scalability of the proposal and how well it matches the challenge.", "q0r": 3, "q1": "The implementation plan of the proposal is lacking. A rough roadmap is followed by a budget that only contains lump sums that are not diversified by the sub tasks and possibly seem way too low for the ambitious project of organizing a blockchain, a tendering system, programming an AI an combining this all with encryption of data and governance at the same time. The proposer does not really present a lot of information about himself and admits that he still needs to assemble a team. Some possible risks have been identified but no solutions presented for them. The positive thing however is that the proposer has some of the required competencies himself. Still I think with this planning, the proposal is not very feasible at the moment.", "q1r": 2, "q2": "As mentioned in the sections above, a lot of what the proposal is supposed to contain and how it is interconnected remains unexplained, thus it will be difficult to audit the deliverables as a whole, however the main deliverable and the milestones can be audited to some amount.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10874, "q0": "A decentralized tender filing platform sounds like a great idea to me. The problem with centralized tender filing - especially in developing countries , is that it encourages corruption which is obviously bad for the system. I think that the proponent has raised an issue that needs to be solved. The proposal is in line with the challenge and I can say that a platform like this will have a positive impact on the Cardano ecosystem. ", "q0r": 5, "q1": "Even though the idea of this proposal is great, the execution of it is a little bit  weak. The proponent didn’t include the necessary information to give me confidence in the successful implementation of the project. I recommend to the proponent to add a timeline to complete the work (there is a timeline but it's not clear when the dapp  will be deployed on mainnet ). I would also suggest adding as much information on the team as possible. As of right now, there is only the proponent in the team but he/she should add a linkedin profile or other resources that can prove the skills and experience claimed. However the budget has been broken down into identifiable items that seem reasonable based on my intuition. I have to say that I like the idea but there is no information on the proponent which makes it a little bit hard to give a positive feasibility rating. I give it a neutral 3 rating. ", "q1r": 3, "q2": "The proposal includes a roadmap which contains information on the development of the dapp, but I don’t see the mainnet release date. I suggest to the proponents to add this information in order to improve the proposal and increase its chance of being funded. The metrics/KPIs are pretty vague, but they can be improved by adding precisions on it. I suggest to the proposer the run regular update on development progress and the number of desired initial users of the platforms ad metrics and KPIs. That said, I think that the proposal is auditable but it needs some improvements.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10884, "q0": "The proposer has identified a good niche for possible use of blockchain technology via a Dapp or integration. He focuses on the fact that governments and institutions use centralized systems for organizing tenders and receiving bids. A blockchain linked system might improve transparency and trust in the system. However, the possible impact of the proposal seems weakened by the fact that it does not envisage developing the system for a specific client(s) who would be able to influence/help the platform's development with specific client input. The proposer has aligned his proposal for a Decentralized Application and Tender filing System well with the challenge. However, I am not sure that the proposal addresses any of the guiding questions head on:\n1. [What are the key applications that underpin the application ecosystem on other platforms?] Has a similar app been developed on other platforms and why? \n2. [What are the most profitable or most used applications on other ecosystems?] How profitable could this proposed DApp be? \n3.[What needs do users of Cardano have that could be solved by new applications?] Are any potential governments or tendering bodies - Cardano users? \n4. [What applications deliver the highest amount of value with the least amount of technical sophistication?] How much quantifiable value would the use of the proposed platform bring to the governments/organizations - in order for them to ditch their existing systems? \nThe proposer identifies 5 risks, including a risk of non acceptance. One challenge or risk is that the new platform \"will help reduce substantially reduce corruption and bribery in all their forms\" - which means the Dapp and platform might be opposed from inside governments. The listed challenges have not been addressed in detail with mitigation strategies. \n", "q0r": 4, "q1": "Reading this proposal I kept asking myself how well does our proposer know the intricacies of the very complicated world of government tendering. The proposer is currently a single member of the team, but plans to expand to include a total of five members. The proposer has in web3 development and IoT, ML, AI, plus worked as consultant at Deltiin India Tech Pvt. Ltd. How much knowledge does the proposer have about the design of tendering systems? The use of smart contracts to accept end to end encrypted filings and a privacy based system to transparently check the status of each application - are just some components of tendering systems and many e-solutions exist and this solution will have to compete with commercial rivals who have full commmercial packages available. The feasibility of developing a quality system that meets government needs may be doubtful - if market research has not been performed previously to assess real needs of real governments who are the potential end clients. The budget seems modest and it is borken down in components that seem reasonable for the aims of the project. \n", "q1r": 3, "q2": "The auditability segment specifies that the proposer will  use the milestone deliverables as well as the development of the github repository and the website - as measures of success. The github address has not been specified and the Proposer should probably include it if resubmitting this proposal in Fund 9 (if it does not get voted in in this Fund). The milestones deliverables - are simple - but we are not aware of their quality in any in-depth form. For example, Development of Decentralized Tendering System  - is a milestone. What are the specifications of this Decentralized Tendering System  - we do not know, so it will be dificult to audit quality and features as they are not part of the proposed timeline. Similar for other milestones... The proposer specifies that the ultimate success of this project will be providing a secure and transparent platform as a service to various governments as well as institutions ... However, the proposal does not include intentions to approach governments and institutions. I understand it might be outside the scope of the project, however there might be room for including that aspect if the proposal is resubmitted in Fund 9. For example, there might be room for doing some research with local government and institutions on their precise needs - before the final product is designed and developed. Despite the inclusion of milestones, we do not have more information about specific metrics and KPIs that could be used for auditing progress. The inclusion of weekly or biweekly progress reports on a dedicate website could be interesting, if the proposal is resubmitted in Fund 9 (if rejected by voters in this fund).\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "use of smart contracts to accept end to end encrypted filings and privacy based system to transparently check the status of each application", "experience": "I am a fullstack developer with 1 year of experience in web development as well as IoT, ML, AI. worked as consultant at Deltiin India Tech Pvt. Ltd. from june 2020- present.\nI have web3 development experience of 4 month."}