{"id": 399135, "author": "fellx27", "title": "Medusa Wallet", "url": "https://cardano.ideascale.com/a/dtd/399135-48088", "category": 26438, "amount": 45000, "description": "There are a lot of web-based wallets that use potentially insecure keys-processing scenario. Medusa should fix that.", "funded": 1, "upvotes": 31166331, "downvotes": 17724887, "votes_result": 13441444, "votes_cast": 179, "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 10208, "q0": "Having an authoritative, full-featured, up-to-date and secure web-based wallet for the Cardano community is important for the Cardano ecosystem. At the very least, I personally, have found webwallets on other chains useful and am using them on a semi-regular basis.\nIt is yet another indisposable tool that should be on the Cardano toolbelt.\n\nAn MVP is already publicly available for testing. Via this proposal they wish to add another slew of features which will provide an easier usage experience for users, additional security features, API for 3rd-party integrations, multi-staking...", "q0r": 5, "q1": "They are a known and proven entity with a proven track in the Cardano community. \nThere is no doubt in my mind that they will succeed.\n\nMilestones are provided and a budget was presented.\nTeammembers were presented, although not spectacularly well. The proposer and Tester#1 are Cardano ambassadors. I found two Cardano-related mentions of Tester#2 on the web.\nStill they hold Cardano's trust and that is the reason for my rating.", "q1r": 5, "q2": "The auditability part is not great. They basically forward our attention to their twitter account for news and any questions we may have.\nTheir account in the current form doesn't have detailed enough progress reports that would be suitable for tracking progess efficiently.\n\nTheir code will not be open-source. However that is not a must in this category.\nIn the comments, the proposer mentioned their backlog. What would be nice, is having a public access to their task-board so that we could see the progress that way.\n\nA plus is that they are developing a public and free website where we will be able to check most (or maybe even all) of the features mentioned in the proposal.", "q2r": 3, "assessor": "z_assessor_832", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3808, "q0": "Proposer provides a complete explanation for the challenges. They provide solutions with integration of existing products. Just need to add some features. I've tried to create a user with the link provided and it loads fast with no password but using 2FA Authenticate.", "q0r": 5, "q1": "The implementation of the project proposal is described for only 1 month, namely April 2022, it is better to make it clearer and write down the processing time for each item. The team that has made this wallet work on the testnet certainly has complete competence as a developer. The proposed budget is appropriate and described in detail.", "q1r": 5, "q2": "This product is already running according to the description at the beginning of the proposal, it will only integrate a few more features. So the progress of the implementation of this project can be monitored according to the milestones that the proposer has compiled. I hope they have a blog of some kind to explain the development in more detail.", "q2r": 5, "assessor": "z_assessor_1681", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8591, "q0": "The proposal is for the expansion, continued development, and testing of the Medusa Wallet, light wallet for Cardano. The wallet is touted to be very secure and given the presented set of features that seems indeed to be the case.\n\nSecurity and anonymity will be driving factors for Cardano and Blockchain technology in general for the foreseeable future. After reading the security features description and testing the testnet version of the product I assess that the Medusa Wallet can definitely satisfy the needs of one ever-growing subset of the Cardano community.", "q0r": 5, "q1": "The Medusa Wallet roadmap is concise but offers a clear picture of the steps that the team plans to undertake in order to complete the deliverables of the project.\n\nThe team is presented with a short bio, and judging from that they should be more than competent to deliver the proposed project. However, I would have liked to see links to professional profiles for each of the team members, as it stands now only the artist has a link to her previous work.\n\nThe amount allocated for professional auditing of the code base is far less than I have seen requested by other projects. I would have liked to see the name of the company the team is planning to employ for the audit.", "q1r": 4, "q2": "Unfortunately, the auditability section of the proposal is lacking, simply linking to your Twitter account is not enough data for the proposal to be easily verified and tracked in the future.\n\nI would recommend including KPIs, a clear description of goals, and other auditability metrics that will enable tracking progress towards project completion.\n\nI would also recommend including in the definitions of success markers specific to the completion of the scope of the proposal, preferably tied to timeframes such as 3, 6 or 12 months.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9736, "q0": "Medusa is a free Cardano wallet that the community can use to store and manage their ADA. The proposer is looking to upgrade the existing experience from 1.0 to a newer version that will have better security guarantees and a number of requested features from existing users. Some of those features will include OTP-keys re-generation, 3rd party API, byron support and ledger integration. Wallets are a fundamental part of the Cardano ecosystem that allow people to create their own wallet and interact with different applications. Having diversity in the area of wallets will help to ensure that there is innovation being supported in the technology used for handling wallets in the community. Considering that the wallet already has a number of existing users there is a high chance this proposal can produce a high impact for that user base and new potential users.", "q0r": 5, "q1": "The proposal team has a lead developer that developed the first version of the Medusa wallet. They have a background in computer science and security and have outlined some of the security issues with existing wallets. The information provided on the security concerns helps to provide evidence that the proposer has a good understanding of the requirements for a more secure wallet. The proposer has also already delivered a functional wallet and has provided the link to the new version that is up for testing. Due to the proposers background, delivery of the initial wallet and the information provided it looks likely that this proposal can be executed effectively. The only feedback for the proposer in terms of improvement would be that they only requested a small monthly sum for the development cost which seemed low for a full time developer. It is important that those pushing the ecosystem forward with high effort initiatives are rewarded well for doing so!", "q1r": 5, "q2": "The proposer provided a Twitter link to keep up to date with the updates from the wallet development. No KPIs were provided which should have been included to help understand what the goals are for this proposal. For instance - implementing the new features and reaching 2000 users would be a good potential goal. The proposal was clear an easy to understand and already has a working version that the community can audit which improves the confidence that the community will be able to continue auditing the progress of the already implemented wallet. It would be good for the proposer to open source parts or all of the code related to this wallet for auditability purposes and to help the community learn faster on how to create a good wallet.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The Medusa 2.0 platform has an unique deep-researched security model. More in description.", "experience": "5 years of development for Cardano Ecosystem;\nComputer Science and Digital Security degrees;\nThere is an already launched product;"}