{"id": 400279, "author": "matt.artano", "title": "smART Mint: DIY evolving NFTs", "url": "https://cardano.ideascale.com/a/dtd/400279-48088", "category": 26438, "amount": 68800, "description": "There is no solution for creatives to mint evolving, programmable NFTs, for which there is a high demand, without programming knowledge.", "funded": 2, "upvotes": 61936671, "downvotes": 14710917, "votes_result": 47225754, "votes_cast": 254, "f6_no_assessments": 5, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 552, "q0": "This proposal perfectly addresses the challenge. Artano wants to build an innovative product, which would allow digital artists and creators without the technical skills to create programmable NFTs, a futuristic and not very widespread standard, but with great potential. Empower digital artists to easily create programmable NFTs thanks to Artano means creating a bridge to bring them to Cardano, and with them all their supporters and collectors interested in their product. Artano's collaborations in the world of art and fashion are an example of the potential of this platform in increasing the adoption of Cardano, reflecting the challenge's goals. The funds required are in line with the size of the team and their expertise, which has been amply demonstrated.", "q0r": 5, "q1": "The proposal is highly likely to be implemented successfully, as the team has already been able to build a quality NFTs marketplace and minting platform focused on digital art. Furthermore, Artano has shown that he has the technical skills to create programmable NFTs and shouldn't work with a whole new concept. The roadmap presented is detailed and realistic, it is also given space to any future additions, demonstrating how Artano is a dynamic and always evolving product. The issues they may have to face are not major obstacles and in the worst case the product would be developed with a slight delay.", "q1r": 5, "q2": "The parameters indicated to evaluate the progress and success of their programmable NFTs minting service are detailed and enough to audit the developing phases, although Artano could consider some more parameter to evaluate the success of the programmable NFT minting service, like the number of iNFTs minted with their platform and also could be more accurate in the success criteria, attracting 100 new artist in a few months is different from attracting them in a few years.", "q2r": 4, "assessor": "z_assessor_1187", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1654, "q0": "The need for artists to mint their own evolving, programmable NFTs without coding knowledge is the problem they recognize in the Dapps challenge. Giving artists these tools will bring more artists and users to Cardano and create more transactions. The metrics of new users using this new tool and a new viable application on Cardano aligns with the challenge setting. As this project is seeking to collaborate it will be able to scale as collaboration is essential in web3.", "q0r": 5, "q1": "The team behind this already have a working marketplace and they are looking to collaborate with Charli3 to create NFT- specific oracles. Clearly they know what is needed to bring this project into fruition. The budget is very reasonable and broken down into identifiable tasks and hourly rates. They will launch the product after 2 months and keep adding features after the launch, which seems very considerate. They mention briefly in the budget breakdown what will be used for the frontend and backend development. They explained how they are making use of the metadata and oracles to make these NFTs programmable. They could have given more detail in how all the marketplaces, blockchain explorers or NFT viewers will be able to display these qualities.  They considered 3 challenges/risks and have solutions for 2 of them, The 3rd challenge will only set them back a week or 2. ", "q1r": 5, "q2": "They have a 2 month roadmap with weekly milestones. The  milestones indicate the start and release of tasks, making this transparent and easy to track the progress of this project. Completing the minting tool and getting 100 artists to use it is the only KPIs they provided. There are many other KPIs you they could ad to this list to make it easier to track the performance of this tool. Like users trading iNFTs, the amount of iNFT trades. These could also be indicators upon release. The problem they describe is the many artists out there unable to mint because of lacking the skills to mint evolving NFTs. The solution they offer is clearly explained and quite simple. They will create a user friendly minting portal, where artists can easily mint evolving NFTs. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6046, "q0": "The proposer finds a valid problem within our community (and within the crypto ecosystem in general), as a programmable NFT minter is not very common. My understanding is that only aysinc.art and artblocks.io on the Ethereum chain have something similar. So the potential to discover is great.\n \nThe solution to this problem, as I already said, is the creation of this programmable NFT minter within an NFT market in our chain that has been working successfully for some time. So the conditions are ideal and could add value to Cardano.\n \nThis project fits perfectly into this challenge and is able to scale to address future challenges.\n", "q0r": 5, "q1": "The strongest field of this project is probably feasibility because this group of entrepreneurs has been working for a long time within our ecosystem and, until now, they have always managed to keep their word and their promised projects.\n \nThe project timeline is very professional and ambitious. Through it we can perceive that the team has a clear idea of how to start the project and how to finish it in an interval of only three months.\n \nSomething similar happens with the budget. Well detailed and broken down. And quite reasonable for a project of this magnitude.\n \nAnd although the team seems ideal for the development of this project, there are no links that certify the specific skills of each of them. To access linkedins, you must first enter artano.io. This detail is not enough to lower them a point, but I recommend it for future funds.\n \n", "q1r": 5, "q2": "Although the proposer tries to list some kpis and milestones within auditability, a little more work and description was missing in this area.\n \nI think auditing will be easy for the community on this project, as in just three months we should see a new feature within artano, but certainly a little more detail and process guidance in this category would have been welcome.\n \nAnyway, the problem and the solution in this project are stated in a clear and reasonable way, so my score in this case is not optimal, but it is satisfactory.\n", "q2r": 4, "assessor": "z_assessor_32", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6606, "q0": "The idea of programmable NFTs is revolutionary to say the least. The proposers want to build nft that change depending on certain conditions. They also want to give non-technical people the ability to mint these nft without the need of writing codes with an user-friendly nft minter. I think that the proposal is in the scope of this challenge and that it can bring a lot of value in the cardano ecosystem. The proposers have done a good job explaining the idea", "q0r": 5, "q1": "The proposers have already experienced dealing with nft as they are the artano.io nft marketplace creators. I have a good amount of confidence in the successful implementation of this proposal. Moreover, the proposers have done a good job by including all the information necessary to the execution of the project. However I recommend to the proposers to add links to the team members linkedin profiles. Other than that, they have provided a roadmap and the budget is broken down well and seems reasonable. I’m a digital marketer and I have experience with the rates of developers. Altogether, I have confidence in the successful execution of this project and I’m keen to see the results.", "q1r": 5, "q2": "I think that this proposal is auditable based on the information provided by the proposer. They have included a roadmap with milestones that will help track the progress of the project. I recommend to the proposer to provide monthly updates on the github commits and reports on the development of the project. These are strong KPIs to include in the proposal in my opinion. Other than that, the proposers have done a good job including the necessary information for its auditability.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8165, "q0": "The proposal clearly and succinctly describes how it will address the \"DAPPS and integration\" challenge. According to the proponent, there is no special solution for training high-demand, growing, programmable NFTs without programming knowledge. The solution the author offers is to create a user-friendly programmable NFT miner that requires no prior knowledge of blockchain or programming. If implemented successfully, this proposal will help attract talented artists globally to achieve their creative visions on Cardano by changing the way they communicate with audiences and at the same time ensuring that The Project's collection and their investment in it are not at risk due to having a policy ID open. There are 3 main challenges and risks that can be encountered when implementing the project, and the author has reasonable solutions to solve those challenges. Providing a link about Artano that the team created (https://artano.io/), one of the most influential high-quality NFT marketplaces on Cardano also contributes to the team's experience and competence, helping community can be more confident in the success of the project the team will create.", "q0r": 5, "q1": "Proposal provides a very detailed and easy to follow plan. The 3-month roadmap with milestones is given that each week is associated with specific goals, looking at the plan, the community can visualize each step of the project's development easily. The $68,800 claim budget is divided into major sections, the allocation of funds is clearly explained, and the hourly allocation is also explained. From a planning standpoint, I found it very well presented in terms of timelines and budget allocations. The community can fully track the progress of the project.\nRegarding the project team, the advisor is Jerome Chailloux: AI Pioneer, an art-science collaborator, and the Artano Core team of 8 members with descriptions of experience and qualifications that I consider appropriate for the project. this. However, it would be nice if this experience was verified on an external platform (e.g. Linkedin, Twitter) or some mention of how the team interacts with the catalyst in this timeframe. It will increase the credibility of the group if the proposal presents the experience and skills of the team members.", "q1r": 4, "q2": "It is recommended to measure project progress by conducting two user experience surveys with artists to understand their needs and how to recommend a solution that is as easy as possible for artists using advertising. fox. In my opinion, this is a pretty good measure to know if your project is really successful or not. The overall project goals give a good sense of what success looks like and where, ultimately, the smaller time frame features are getting us into the bigger picture. Therefore, I fully agree that the information provided is sufficient to assess the progress and success of this proposal. This proposal is a new proposal unrelated to the previous proposals.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a user-friendly programmable NFT minter that requires no prior knowledge about the blockchain or programming.", "experience": "Created Artano, one of the most impactful high-quality NFT marketplaces on Cardano.\nTeam has experience in building Dapps on Bitcoin, Ethereum and Cardano.\n\nCollaborated on art-tech projects including London Fashion Week, minted programmable NFTs with top artists & galleries."}