{"id": 400666, "author": "nicoarqueros", "title": "Milkomeda Game", "url": "https://cardano.ideascale.com/a/dtd/400666-48088", "category": 26438, "amount": 40000, "description": "Gaming is one of the fastest growing categories in crypto. Cardano is not quite there in terms of quantity of games.", "funded": 2, "upvotes": 124448670, "downvotes": 19453736, "votes_result": 104994934, "votes_cast": 236, "f6_no_assessments": 6, "f6_rating": 1.3888888888888886, "videos": [], "media": [], "f6_assessments": [{"id": 1518, "q0": "The proposers fails to give any details at all about the game they seek to fund. Nilkomeda game is described as \"a simple casual game that uses blockchain concepts\". This is nowhere enough information provided in order to give a proper assessment. Additionally, this proposal has been submitted in the Dapps and Integrations category while there is a challenge dedicated for games, namely \"Gamers On-Chained\". Unfortunately , this proposal cannot be considered complete and the proposers are advised to review other successful proposals within the gaming challenge to align their proposal with those. And also submit their proposal in the \"Gamers On-Chained\" category in the future. The score given in impact is 1 star.", "q0r": 1, "q1": "The timeline presented for the project can easily be viewed as an estimation with no further evidence to back up the estimation. The proposal is not complete and neither credible or feasible in its current state. Score given: 1-star.", "q1r": 1, "q2": "Unfortunately there is no description about the game or what the expected outcome is. Therefore, it is not possible to audit the progress or success of the game. The proposers are suggested once again to review the proposal completely and look at successful proposals for inspiration. Score given: 1 star.", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 7731, "q0": "Really appreciate proposer for having an idea to create Game with Milkomeda. But, what impact will we (communities) have if proposer build a game is not aligned with this challenge's campaign brief. If proposer really want to encourage potential users with games, proposer can submit this idea in Gamers On-Chain challenge rather than Dapps & Integration challenge. Also, this proposal were not explaining anything about the kind of game they will build, what kind of users they targeted, etc.", "q0r": 1, "q1": "We can all agree about proposer's technical and contributive experience, but with this kind of proposal we all agree too that this could be a better proposal if proposer following proposal guideline. As their timeline only to 3 months to build and 1 month to get a feedback, it is can not be measured because the kind of games not explained by the proposer. And about the budgets: there was a lack of detail. For those $40k, what % will given to pay external company who will create the game? If there is any detail about that, we (communities) can recheck if it is a reasonable budget or not.", "q1r": 2, "q2": "This proposal have no roadmap with milestones. Since proposer want to pay external company, where can we see their progress? The metrics or KPIs are too general to follow. As no clear plan is provided regarding what the funds would be spent on, it is rather difficult to imaging auditing the progress and project's success. Adding more specifics information regarding metrics, what will the team do, and any objectives would be helpful.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8171, "q0": "First of all, in my opinion, the problem and the solution presented are not suitable for the challenge. According to the proponent, games are currently the fastest growing category in the blockchain space, and Cardano has yet to really grow in the field. And the proponent's solution is to create a Milkomeda game that will be a simple casual game using blockchain concepts, bringing adoption and usage to Cardano through Milkomeda. Since this is a game project, I think it would be better suited to the \"Gamers On - Chained\" challenge. There is a sincere advice that I give to the proponent that you should clearly define what challenges your project is facing, in order to receive funding I think it is essential that the information about the proposal be complete. content and criteria should be clear, this proposal looks like an idea or your walk, it is not a complete proposal. I hope you'll come back next time with a more complete recommendation and if possible you should include a bit of an image or the website of the Milkomeda game.", "q0r": 1, "q1": "All the information that can be used to measure the viability of the project is described very briefly, and I have almost no basis to judge the probability of the project's success. The proposal provides three timelines for project completion, but there don't seem to be any details on how the community can track the proposal's progress. Without a blueprint, the $40,000 request budget is also unallocated. No go-to-market strategy, no budget analysis to see if the amount is right. Also, the project team is called \"dcSpark with experience building many dApps\" without further explanation. Team is one of the very important factors determining the success of a project or not. Any reference to team size, qualifications, and previous experience of team members will allow for better evaluation of the proposal. For all of the above reasons, I strongly disagree that this proposal will be successfully implemented.", "q1r": 1, "q2": "Suggestions missing: Plan, resources, detailed analysis of steps, milestones, budget analysis, team members, time allocation. There's no justification for budget or implementation, it's just very sketchy. To improve listening, proponents should include a roadmap, milestones, development roadmap, key dates, metrics, and KPIs. The proponent did not demonstrate sufficient knowledge of this development, the expertise of the group, or any skill-related information required for such undertaking. No technical aspects are explained or presented. Based on the information in the proposal, I disagree that it provides an adequate measure of the proposal's progress and success.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8527, "q0": "This is a proposal that focuses on building Milkomeda Game - an expected simple casual game that uses blockchain concepts to bring adoption and usage to Cardano. Regarding impact, some issues that should be noted are as follows:\nfirst, as can be seen, the problem is quite clear, however, solving this problem may not contribute to achieving the challenge's goal and KPIs, in some certain meaning; The issue raised has a certain convincing, I agree that the number of games on the Cardano platform is currently not much, compared to other Blockchain ecosystems. As for the solution, I think there are a few issues that emerge that need attention with this proposal: (1) building a fun game is, in a sense, still relevant to the goals this challenge seeks to seek. [\"What applications will provide the most value for end-users in 2022?\"], however, since the problem stated has not been carefully explained, my question is: how urgent is it to make a fun game in achieving the goal set by this challenge?; and (2) the solution has not been described clearly enough in detail (supported by very limited information on: team, goals, roadmap, KPIs, budget structure) so that the expected impact is not clearly visible.\nIn conclusion, I strongly disagree with the impact of this proposal.", "q0r": 1, "q1": "Regarding the possibility, there are some issues that should be noted, including:\nFirst of all, this team profile still remains very abstract, there is very limited information to evaluate how suitable their skill, experiences for implementation would be. In addition, the proposer did not provide any information that shows their demo/pilot/prototype/similar games completed in the past. This proposal's goal is not clear because too little descriptive information is provided to clarify the content of this game], and there is not any KPIs/metrics for measuring the success, no roadmap for tracking the implementation progress, and no budget breakdown, as a result, it is hard to assess from this side. Finally, the risk is defined but not clear enough, and without any mitigation.\nTherefore, based on the provided information, I strongly disagree with this proposal's feasible", "q1r": 1, "q2": "Regarding this proposal's auditability, there are some issues that should be noted, including:\nFirst of all, as can be seen, there is no information of team in this proposal [not even an external link to their web page or Git Hub,...], therefore, it is very hard to evaluate how feasible it is. Secondly, the roadmap is provided but remains quite abstract, and there are not any KPIs/metrics provided for measuring the success of this proposal, I agree that the release game is the final result, however, based on where to measure the community Measure the quality, the success of the expected product? Similarly, this proposal did not provide the budget structure with cost items, only the total budget of $40k. Based on the provided information, I strongly disagree with this proposal's auditability", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8607, "q0": "The team behind me the Milkomeda project wants to build a casual game to introduce more people to Cardano in a fun and engaging way.\n\nThis idea is promising as a concept but it definitely needs more time in the oven for it to mature into a feasible proposal. Given the competence and the skill level of the dcSpark team, I have little doubt that if they dedicate more time to this project they will be able to resubmit a much more complete and successful proposal in one of the next Catalyst funding rounds. I encourage them to do so, as this idea has a lot of potential. I've written some suggestions at the end of this assessment that will hopefully help with that.", "q0r": 2, "q1": "I support most of the other great ideas and projects that dcSpark has submitted as proposals for funding in Fund8, however, clearly this one needs a bit more work. \n\nThe founders of dcSpark have an undeniable track record in the Cardano community and have been involved in a lot of aspects and built a lot for the ecosystem. As such my recommendation is that they clarify what they want to achieve and formulate at least a basic plan of action surrounding this idea. I suspect they wouldn’t have submitted any of their other proposals without having clearly defined goals. This is especially important as, speaking from experience, game development is a lot harder than it might seem.\n\nI have included a few suggestions at the end of the Clarity/Auditability section of my assessment.", "q1r": 2, "q2": "Given that the team behind this proposal are already recipients of multiple Catalyst grants in multiple funding rounds they should already be very familiar with the auditability requirements of Project Catalyst. As such I really would have expected to see a lot more clarity around the deliverables, milestones, and KPIs of this project. \n\nAs it is presented now the proposal, including the Auditability section, lacks sufficient detail and clarity.\n\nA few suggestions of what is required to turn this into a successful Catalyst proposal:\n- a more detailed description of the problem it aims to address, namely the lack of games that promote Cardano to the big segment of the population that enjoys casual games\n- an easy to follow plan for achieving the stated objectives, in this case introducing a large number of people to Cardono through a casual game.\n- clearly described, unambiguous, trackable, metrics and KPIs that enable easy monitoring of the project’s progress.\n- clearly presented milestones describing the expected progress on the project.", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10204, "q0": "Ok, the proposal contemplates a decentralized application, but there is no specification of it to be able to give it the maximum score considering that it fits with the challenge. Please describe the proposal in detail for next time.\n", "q0r": 4, "q1": "No detailed plan appears, it only proposes a simple list and without any work behind it explaining what they will do in 4 months. Nor can you see the experience of the presenter or the team that will carry out the proposal. There is still a lot of work behind the proposal to see it as a possible success on implementation.\n", "q1r": 1, "q2": "The auditability section is very poor. It does not indicate any metrics or indicators of success. Please work more on the proposal. You can't publish these kinds of ideas without work behind them, hoping for funding and support from the Catalyst community. Proposals are very important to the community and there are many people working hard on them.\n", "q2r": 1, "assessor": "z_assessor_830", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Milkomeda Game will be a simple casual game that uses blockchain concepts. It will bring adoption and usage to Cardano through Milkomeda.", "experience": "dcSpark has experience building multiple dApps."}