{"id": 400985, "author": "anushajain", "title": "Decentralized Social Network", "url": "https://cardano.ideascale.com/a/dtd/400985-48088", "category": 26438, "amount": 78000, "description": "People's data is worth much more than we can imagine. We give our data for free to centralised social networks. This data is often misused.", "funded": 0, "upvotes": 22638032, "downvotes": 22861425, "votes_result": 223393, "votes_cast": 99, "f6_no_assessments": 3, "f6_rating": 2.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 2041, "q0": "This proposal has a huge use-case. There can be a lot of room for a new Dapp to be created that is similar to something like twitter or Instagram. It will have a focus on cryptocurrency. I envision this having the ability to do a couple things that would help address the challenges. It will increase the amount of participation and conversation in the Cardano ecosystem. It will increase the demand for Nft's because people will want one for their profile picture, and it could even create new ideas/business opportunities for a team to come together and build a Dapp on Cardano. There is also a huge lack of privacy on centralized social media platforms. Creating a Dapp that serves this purpose on the blockchain will include the security benefits that we experience on the Cardano Blockchain. For these reasons, I give this section 5 out of 5 stars. ", "q0r": 5, "q1": "There are a couple of things that I would include for this proposal. I love the idea of it and I see a great business opportunity. However, when listing off experience and team experience, it should be a little more specific. When stating that you have been involved in social media since you were 4, we still don't know how old that makes you. Also, when stating your experience with working on PR of multiple companies. Which companies and what skills have you developed. There should also be names included in all of the main team members. This could be for the web-developers and blockchain-developers too. Once that information is given, there will be a higher chance of receiving funds for fund 8. For now, I have to give this section 2 out of 5 stars due to lack of this key information. ", "q1r": 3, "q2": "There is a lot of information, but it is still lacking in certain areas of the proposal. For example, The roadmap and detailed budget breakdown were written very well. It shows readers what exactly is going to happen with this process and even where the funds will go. It is just hard to receive those funds when the community wouldn't be able to put names behind the work. This adds limitations on the ability to follow-up with the work and is harder for the community to hold this team accountable for what they set out to do. This makes it hard with the given information to help this proposal be successful. After including this information, there can be further discussion. For now, this section receives 3 out of 5 stars. There is potential here, just needs a little more information. Good luck!", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2528, "q0": "The idea about social networks being decentralized has been discussed for a long time. Indeed, centralized social networks like Facebook have censoring and privacy problem, and decentralized social network could be the solution. However, the proposal has not addressed the two main problems about decentralized social network platforms (DSNP). First, how would this proposed DSNP covers its expenses, including server maintenance and development costs, and generates revenue. Second, how would this proposed DSNP brings in new users and retain them. The proposer should start by addressing the approach for these problems either by proposing new solutions or by observing existing ones such as Bluesky and propose improvements from them.", "q0r": 1, "q1": "The proposal should provide the profiles of the aforementioned 6 members in the tech team as to provide evidence of relevant experiences and capabilities to deliver the project successfully. I suggest the proposed timetable for launching the app to be extended to 3-4 months, because there are a lot of steps in order to release an app, from requirements gathering, designing, development, and testing, and 1 month is simply not enough, based on my experience working in IT consulting. The budget section could be improved by explaining it in greater details, for example by changing the monthly salary to work hours. This part of the proposal could be improved significantly if it were to be written by one of the tech team because they could explain more of the technical aspects of the project, as of now the implementation plan is unclear.", "q1r": 1, "q2": "The metrics used for measuring the project progress does not correlate well. For example, how would volumes of likes transaction correlates with the project development progress?\n\nThe success of the project is still vague. Perhaps the mentioned metrics previously are for measuring the success. But even if that is indeed the case, there is no specific amount we can refer to in order to determine whether or not this project is successful. It could be improved by providing a specific amount within a specific time horizon, one example would be: 3000 new users registered every month for the next 6 months.", "q2r": 1, "assessor": "z_assessor_1522", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5938, "q0": "The proposer has identified a problem and a solution to the problem but is somehow unclear if is a real world use case and what is the added value to the Cardano ecosystem. The incentive mechanism is not a guarantee that people will post more and more quality content. It is very unclear how \"decentralized storage\" will be achieved as a significant part of a decentralized social platform. The proposer has not provided any relevant info about this social platform model.", "q0r": 2, "q1": "It is unclear who are the other members of the team with the exception of the proposer. There are not traits of evidence to emphasize the necessary experience and skill to implement such project only a statement about \"I have a tech team that has delivered various blockchain projects over the past year\" without any endorsement or references for this.\n\nA good concept about decentralized storage is peer-to-peer meaning that (some of) the content could be always available as long as it is a connection between 2 peers. The proposer should identify the best storage model for this type of social platform.\n\nThe budget is broken down into identifiable items. A timeline with achievable milestones is provided but it looks very narrow to deliver such an app. Also it seems that it misses an important phase of development - The Testing. Without testing an app you cannot deliver it as a working app.\n\nThe proposal doesn't explain technical aspects like architecture, language and technologies if they are crucial for implementation. (what framework is to be used? etc.)\n\nThe proposer has not considered challenges and risks relevant to a successful implementation. (how about the competition, how about some legal constrains and why someone will switch form already known and very familiar social platform? etc.)", "q1r": 2, "q2": "Thirst thing to start developing an social media app is to give it a name, with resonance preferable and to create a relevant whitepaper about it. The proposer should identify the target audience of this type of app (is there any specific topic that will connect the people?)\n\nThe proposal looks more like an concept than as a working product as it lacks in providing relevant info for a successful implementation.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A decentralised social network of the people, by the people, for the people. A platform where users have a choice on how to use their data.", "experience": "I have been a user of modern day social network since I was 4 years old. Since then, I have understood the mindset, direction and growth of these platform. I have been working as a social media manager. I got into blockchain in 2020 and I have worked on PR of multiple projects."}