{"id": 401485, "author": "gianni.schotte", "title": "Fundraising platform for NGO's", "url": "https://cardano.ideascale.com/a/dtd/401485-48088", "category": 26438, "amount": 150000, "description": "Funding initiatives lack transparency and people are suspicious when donating as they don’t know how their money will be put to use.", "funded": 0, "upvotes": 22626701, "downvotes": 25229091, "votes_result": 2602390, "votes_cast": 92, "f6_no_assessments": 5, "f6_rating": 3.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7428, "q0": "This proposal presents a great idea. The problem addressed here has been addressed previously in other proposals, but without so many extensive, clear and detailed explanations. It is about creating a Dapp where people can donate money (either in cryptocurrency - Ada - or in a fiat currency) or materials to different NGOs that are promoting different campaigns. I found it very positive how the proponents portray with great specificity the complete user experience, from the moment they are viewing the campaign options to help until the moment they would receive probable rewards (NFTs, access to exclusive content, etc.). And also how they explain the journey of NGOs to obtain funding. In other words, the activities that would be carried out by different types of users in Dapp are extremely understandable, we can clearly visualize what these processes would look like after the project is launched. I found the possibility of sharing the partial results of the campaign on social networks, whether videos or photos, results that were progressively achieved through donations, very valid. I think it would be a very organic way for more people to learn about the existence of these NGOs, these projects and even Dapp, which would indirectly attract new members to the Cardano community. Another very positive point is that the proponents claim that no part of the donations would be directed to them, that is, the donors' money would go 100% to the chosen projects. However, for the application to be profitable in some way, they would offer some services such as mentoring on “Campaign Design and Platform Launch” and “Invoice Audit Service”. In other words, the proponents were very honest when they say they don't want to profit from the heart of the project, but everyone needs profit to be able to continue dedicating their time to this project, and I found the exits to be very smart and fair for all parties. As I mentioned at the beginning of my analysis, there are already other projects of the same nature, but this one differs from the moment it encourages donors through rewards to maintain a link with NGOs, always donating more and more. The proponents finish explaining the impact by speaking in an objective way the advantages of the application for both donors and NGOs. In my view, the proposal is of high value, it could add a lot to Cardano since donations could be made in Ada, probably new people would create digital wallets, while the project evolved and native tokens were also included as rewards, the uses of Cardano's technologies would be further intensified. I think the project meets the challenge's objectives very well, as it will help to expand Cardano, make our blockchain better known and respected by new audiences. \n", "q0r": 5, "q1": "The script of this proposal is very objective and cohesive (as well as the other parts of it). We know that the development of the project will last 1 year, and that it is divided into some phases (1 month, 3 months, 6 months, 9 months and 1 year). The activities that would be developed in each of these stages are listed in topics. I think from the way it is presented, we can understand very well what is to come and what small parts make up the whole. Despite this, I think that instead of dividing every 3 months, the proponents could have divided the activities into monthly intervals. This would further improve the specificity levels in our compression of the development process. However, as I said, the script is quite assertive in reporting what would happen and when. Now talking about the budget division, the total amount requested is 150 thousand dollars (a very high value), however, the proposal is very complex technically, making the value make sense. It is divided into work packages: Business development (20k/year) + Solution development (100k/year) + Marketing and communication (30k/year). I disagree that this part is presented properly. As it is an expensive value, a much greater level of detail would be required. For example, in solution development. The tasks reported are “Technical Resource Hiring and Infrastructure (Web/Application/Network)”. Each of them should be explained more extensively, how much would go for each? Which professionals would dedicate themselves here? What would your work routines be like? How many days a week would they work on it, and for how many hours? That way, we would know the amount charged for the hour of work and we would have more material to conclude if it is a fair value or not. So I think that part deserved to be reworked. Speaking now of the team presentation, the last part to be analyzed on feasibility, we are not properly introduced to the team members. We know what its principles are and what professional areas would be needed here (ie what main activities professionals would develop). But unfortunately we are not introduced individually to each. It would be necessary for us to know: their names, what each one would do, a small curriculum about them, so that we could understand which projects they have been involved in so far and also how they relate to our blockchain, if they are active members of the community and how. So, although I really like the proposal, I will unfortunately give this topic three stars, because I really think it should be restructured and improved in several ways. \n", "q1r": 3, "q2": "We have a lot of material that can serve as a basis for us to monitor the progress of this project; in the script, several activities are listed and we know when they would need to happen (however, as I explained, it would be more interesting if this division were smaller, in months). So we know what to monitor at what time intervals. I was dubious about the Agile methodology, which the proponents claim they will use to monitor phases and tasks. What methodology is this? By which platform would this monitoring be done? How will all this information reach the Cardano community? It would be necessary for the proponents to clarify whether, for example, the standard meetings with the IOG coordinators would generate content (qualitative and quantitative data) on the partial results, and if these would be made available to the Cardano community, and also how, that is, by Through which communication platform? Will they create a website, post it on github, in our community's telegram and discord groups? Looking now at the auditability of the final results, the definition of success is seen when “we reach a point where our platform is active so that organizations and employees can come together and build relationships in a way that both parties can benefit”. I agree that this is the ultimate goal, but how can it be measured by objective, verifiable data? I think the proponents lacked explicit more direct ways of perceiving whether success was indeed achieved for both Dapp itself and Cardano. Some ways I thought: about Dapp - it could be measured how many NGOs were benefited, how many projects, how much money/materials were donated, how many donors, how many rewards were forwarded to them and etc. And for Cardano - how did these users come to understand and relate to our blockchain? Have they become members of the Cardano community? What did you do with NFTs that were received as a reward? Did they buy more Ada to donate and also invest? In my view, a broader research was lacking, and that these results were easily scalable by all members of the ecosystem. So I think auditability is average, proponents provide a principle but not deep, specific ways to audit success. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 510, "q0": "The proposal identifies a serious problem: people are hesitant to donate to established NGOs because there is a lack of transparency and trust about how donations are spent. Their proposed solution is well-defined: by using blockchain ledger transactions for each step of the process, they can provide end-to-end transparency for donors to support something they care about and have verifiable proof of how it was spent. This problem and solution is a good fit for the campaign, because it's a DApp solution that could attract users to Cardano and really put the network in a positive light. \n\nI do have some concerns about impact: Is this solution team dedicated to the Cardano network? They only mention Cardano by name one time, in relation to seeking a dev team. Other than that it seems somewhat Network-Agnostic. Is their intent to leverage the Cardano-blockchain for their ledger transactions or not necessarily? Mainly, I'm looking for clarity and transparency on this question.\n\nThey have done some good thinking about how the solution will grow in phases 2+, by leveraging voter approval for invoice verification, and adding more social sharing elements.", "q0r": 4, "q1": "The proposers are upfront in their admission that they do yet have the team they need to execute this work. Before fully funding a project of this size, I think it would be important to be a little farther along on the path of technical validation and spec-ing out the work.  \n\nI would also recommend starting to identify NGOs who might partner with you through this work. If you had 1-3 NGO partners who were willing to participate and advise as you develop the product, that would increase my opinion of the feasibility. The proposers have included seeking those partnerships as part of the project, but I think we are getting the cart before the horse. By talking to some potential NGO partners much earlier in the process, I think you will gain valuable insights into other risks and requirements that may guide the solution design.\n\nOverall, this proposal is missing certain key elements to support feasibility at this point of asking for a big budget project. My recommendation would be a scaled-back proposal that would allow you to build a technical team, do some partnership research with NGOs, and come back with a more fully detailed proposal with a clear feasibility proposition.", "q1r": 2, "q2": "The proposers have defined a number of deliverables, but not too much detail about where they will be shared. \n\nIdeally I would like to see some goals and deliverables around how many organizations/campaigns are set up and successfully run through the platform. I would even be in favor of \"Funding\" the first few campaigns (ie so that the NGOs don't have to bite off the cost of this new offering) so that we could get a quantified metric like \"5 Funding campaigns with end-to-end transparency run through the platform\"", "q2r": 3, "assessor": "z_assessor_1180", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 992, "q0": "This proposal seeks to address longstanding concerns about non-profit accountability. The impact statement provides two compelling customer journeys, one for prospective donors, the other for NGOs themselves. Both are described in rigorous detail. The ability to take fiat donations and convert them to stablecoins opens up a potential market for the platform that can potentially exceed the typical crypto-community. Additionally, the proposal makes a strong case for how blockchains can be used to add transparency to the donation process. \n\nThe only part of the impact statement I have some concerns with is with regard to profitability. As laid out, revenue from campaign design could be feast or famine. The invoicing auditing service could potentially smooth things out a bit, but I'm curious if this is a service NGOs find burdensome enough to want to outsource in this fashion. Would the use of this service be compulsory on the platform?", "q0r": 4, "q1": "The proposal notes that the proposers have a background in engineering, but the plan appears to be to hire a developer to do either all or a percentage of the development? It's not entirely clear. As written, I have concerns that the project could be overscoped given that it doesn't spell out how much technical expertise is being brought to bear, nor does it itemize the expected labor costs. How much sweat equity is going into this? How much will the proposers be paying themselves?\n\nThe proposal does break costs down by phase, but a deeper dive into manpower would answer a lot of lingering questions, I believe. ", "q1r": 3, "q2": "The proposal lays out how the project will internally track its performance. This aspect appears to be well-thought, with clearly defined phases and application of Agile project management techniques. What's less clear is how the proposers intend to make the project auditable to external parties. When can we expect to see tech demos? An alpha build? Give us something meaty to chew on along the way. ", "q2r": 3, "assessor": "z_assessor_1251", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5231, "q0": "I have an extreme bias in favor of non-profit improvement initiatives and it's actually an area that I want to get into for a career. I could actually be interested in THIS organization if they had provided a link. I preface this review this way to convey my extreme reluctance to give a negative score, due to an extremely high price tag with not enough information. The impact section is VERY thorough about the process in which they intend to handle things (which I appreciate) but I think many other CAs might appreciate this type of information being separated into an external link to reference as needed. This section should be for information about what impacts could be made, how the proposal directly addresses the problems, and what impact this proposal has on the Cardano ecosystem (which is severely lacking in this proposal). For example, it could be stated that only 67% of total donations made actually make it to the cause they intend to support - the rest goes to the fundraisers (and a minimal amount goes to operations costs). Quantifiable information that addresses the problem helps to tangibly understand the need for the solution. There's also an important element of innovation that needs to be clearly expressed because that's the entire point of Catalyst. I want to know what makes this project different than other blockchain charity projects (which also tells me that the proposers have done their research and are aware of the solutions that already exist). Back on this impact to Cardano issue, I assume the platform is meant to be built on Cardano but it's a little concerning that it doesn't actually say it outright. That might seem over-skeptical to some but there are a lot of proposals (mostly in the adoption/legislation category) that are not directly involved in Cardano. The only evidence I see of interacting with the Cardano ecosystem is \"Reaching out to the Cardano community and see if someone is willing to join us.\" Generally, I need to be seeing a little more of a concise proposal with more relevant details and a little less \"over-explanation\" of processes that don't make a difference in my decision making. ", "q0r": 2, "q1": "This is probably the best roadmap I've ever seen that also provides me with no assurance or confidence that the team can get the job done. If you do some digging, you can find (what I think is) their website at https://www2.deloitte.com/us/en/pages/consulting/topics/blockchain.html but this is not provided by the proposal. However, I don't know if this is them and I don't know what the names are of the people working on this particular project. Also, for a price tag this high, I absolutely need LinkedIn profiles and more detailed descriptions of each team member's resume. The plan is awesome but the plan has no backing for me to be able to vote positively. This is a lot like someone coming into a bank for a house loan, giving an amazingly plan for how they plan to pay the mortgage from the income of their high-paying job, and then providing no evidence of income or credit score information. I cannot objectively approve. ", "q1r": 1, "q2": "I often am most critical in this section of the proposal, so this proposal is in trouble. There is credit due in the reference to KPIs listed in the previous section. I vote favorably on tangible/quantifiable KPIs, which the previous section lists a couple of (50k social media and 100 contacts surveyed). Where I vote unfavorably is the identification of \"product completion\" as a KPI for success. It is my philosophy in this section is that there should be more emphasis on metrics for usage. While a completed product is vital, the real impact made on the world is if people are actually using the product. So I look for metrics on tangible numbers on usage, interest, or confirmed partnerships. I give bonus points for milestone-based metrics that demonstrate a plan to progressively improve over a given period of time. Overall, this proposal has a fantastic game plan with no evidence, metrics, and/or details. They've got the wood and the kindling without the flame. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5907, "q0": "The idea is very good, addresses the challenge, as it creates a new Dapp that will levarage cardano blockchain (challenge KPIs \"Solutions utilising the power of smart contracts\" and \"result in new, viable applications built on top of Cardano\"), and is able to offer solution to make donations to NGO safer and more transparent and, potentially, increase them. \nProposal is also very complete, providing a business model with how to stay profitable without diverting donations money, has a communication/marketing strategy in place and is phased. It also clearly shows its value proposition on \"Benefits for fund raising campaign\" and \"Benefits for contributors\").\nRisk management is well done, with 2 mapped and a mitigation strategy in place.\n\nThe only question left is where they intend to act, if it is global, in a specifc region/continent/country and expand afterwards. Some initial scouting and contact with selected NGO could have been done also, to check if any is already interested in testing the prodct.\n\nAll in all, however, I think it is a great proposal, addressing the challenge and having  a potential positive social (and even enviromental, depending on the NGO) impact.\nActually, is says that UN SDG are not applicable but, depending on the NGO, it can target several.\n", "q0r": 5, "q1": "There's a clear time-framed roadmap, with clear deliverables and activities. they include technical and business activities, which is very good.\nbudget breakdown is fair and divided in work packages and these workpackages match the acitivites in the schedule. It would be just nice to see how many hours each one would take (or even, if possible, how each bullet in each WP would cost). Proposal takes up 6% of total challenge budget which is not a lot.\n\nThe team part could have more information though. It just mention general team capabilitiy but no names and specific experiences are provied, as no ways to verify the information as well. It says they are part of the Deloitte blockchain consulting deparament but there should be way to really attest that. Furthermore, it is also said that they lack technical knowledge and still going to hire new people to the team.\n\nTherefore, I'll score the feasibility as 3 following the critieria that plan and budget are ok and team is not (2 (plan and budget)/3 (plan budget and team)=66% times 5 stars equals 3,33 stars)\n\n", "q1r": 3, "q2": "There are good milestones that can be extracted from roadmap and some fair time-framed kpis with target (related to PoC and UI/UX design completition). I also liked that the project will follow an agile approach and the user stories will be made available to commumity. \n\nHowever, there's also space to add kpis related to satisfaction of the solution from users (via a survey, for instance) and how many NGOs they managed to engage in the PoC. Moreover, after launching the product commercially, it is imporant to monitor how it is tool usage, how many NGOs and donators signed up, how much money was raised, how many invoices were certified and etc. However, this last kpis might be for the future, outside the scope of this proposal, which. as I understood, empasses more until the PoC of the solution.\n\n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We introduce a transparent fundraising platform where contributors receive audited proof through an app of how their donation is spent.", "experience": "With a background in engineering, we are both passionate about analyzing problems, designing and delivering a solution and really make an impact that matters. As part of the Deloitte consulting blockchain department we are familiar with defining concepts and the business needs."}