{"id": 403967, "author": "blueberry1172", "title": "Wildlife Conservation Pool DApp", "url": "https://cardano.ideascale.com/a/dtd/403967-48088", "category": 26438, "amount": 95000, "description": "Currently, no DApp exists to support climate conservation or endangered species conservation organizations within Cardano's ecosystem.", "funded": 1, "upvotes": 24436747, "downvotes": 19734249, "votes_result": 4702498, "votes_cast": 104, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"id": 9720, "q0": "Wildlife Conservation is probably amongst the top critical issues that needs immediate attention and even SDG supports such efforts. The impact the proposal could bring is certainly massive however, we have seen a lot of proposals revolving around wildlife conservation especially in \"Grow Africa, Grow Cardano\" challenge. The interesting fact is the proposer's idea to embed a Defi to raise support to the non-profit organisations striving to conserve wildlife, but apart from that I feel a lot of redundant features in the other proposals, and I feel a careful consideration is required to make this proposal stand out and unique compared to the others. The aim to reduce carbon footprints and make the transactions more and more rewarding is gonna draw some attention and hence I would score 4 out of 5 on the impact parameters.", "q0r": 4, "q1": "The team seems to have covered every gap there is to fill ranging from developers to advisors. The cumulative experience the team brings to the table is astonishing and looks capable of getting this project up and running. The timeline defined although includes more of a one-liner milestones, is self-explanatory and is quite enough for a reader such as myself get an idea of their approach. The budget however makes up to about 4% of the entire funding allocated and looks like a bit overestimated but the team makes an excellent note saying the entire team shall be self-funded and all of the funds raised through catalyst shall strictly be used for the project development, hosting and support which shows the connection the team has with their project and their intent and passion to work on it. Assuming this is all the funds that might be required to bring the project to life, the manifesto we have in front of us has all likelihood of being economical and worthwhile.", "q1r": 5, "q2": "The KPIs defined are carefully defined so as to stay in track with the milestones the team has defined in their action plan. Also to mention they are subset of the challenge's key metrics and that is a green flag. The success criteria and outcome the team measure in terms of number of partners onboarded, funding raised, species saved are all supplement to their metrics. But the detailing provided looks a little scarce and most of the facts are left to the readers and community to draw assumptions regarding how impactful and effective the development process would be during the development phase. Most of the metrics revolve around the quantifiable measures post development of the proposed application and tracking the development would be a little less relaxing but post launch the metrics are crystal clear for the audit process and hence I hold myself back from giving full marks on the auditability parameters.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 512, "q0": "I don’t see much alignment at all with the challenge. To wit:\nIs this proposal akin to “key applications that underpin the application ecosystem on other platforms”: no\nIs it akin to the most “profitable or most used applications on other ecosystems?” Surely no.\nDoes it solve a NEED that Cardano users have? No, not sure it’s even a want. \nDoes it deliver the highest amount of value with the least amount of technical specs: neither of these. \n\nPerhaps a different challenge could be a better fit for this idea - something focused on conservation, for example.", "q0r": 2, "q1": "The detailed plan and timeline consists of bullets like:\n-assemble a team\n-establish partnerships \n-raise money\n-launch an NFT project\n(And more but they are all this vague)\nIf the proposers have a plan or expertise in these very different, challenging things, that is not evidence in the proposal, or in the website (which is pretty but doesn’t say much) \nThe budget divides 95k into three big chunks and calls it a day. \n\nFor a proposal of this size and scope I’m looking for far more detail, planning, proof of concept. You should have some notion of who your “partners” will be, what that NFT project might be, and how you are going to “establish” a “successful online community of 25k”, for example.", "q1r": 2, "q2": "This proposal names some “measurable” things but mostly doesn’t say how many we will get. Good audibility means not just measuring “something “ but knowing what the goal of that measure is. For example, instead of “number of conservation organizations supported”, try “donate 10k to 3 conservation organizations by the end of 2022” - this is an accountability goal that can be accomplished. \n\nThe success statement is similarly vague and doesn’t provide a verifiable definition of “done”. ", "q2r": 2, "assessor": "z_assessor_1180", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 805, "q0": "The Wildlife Conservation Pool is a very innovative proposition that can help protect increasingly endangered wildlife species. The construction of a Pool aims to be very noble that is to restore the ecosystem that is increasingly lost. The interesting thing is that you have added an element of entertainment but also very attractive to the participants by giving them the opportunity to own a larger amount of money through the lottery. I have a small suggestion for you that you can completely develop this application as a lottery application to attract more people and thereby get a larger budget for conservation organizations. .", "q0r": 4, "q1": "Your team is amazing, I believe that with the years of experience of Kale, Brandon, Nick, Joao, Tyler, ... along with your passion for wildlife conservation, you will do well. this proposal. What is missing is that what are the possible risks for this proposal to fail? For example: How do you guys get people to participate more in the Pool? I think you will need to have more communication sessions in the community such as partnering with the East Cardano community or similar Cardano communities to help the community know about your Pool and when they know the amazing things you're going to do with endangered animals they'll be very supportive of you.", "q1r": 4, "q2": "Do you also need to give more details on how to use the $95000 funds? For example: $30,000 for specific Defi product development, how will you spend it?... The more detailed your expenses are after receiving the disbursement, the more the community will appreciate the transparency. more of you. In addition, you also need to specify in numbers about KPIs such as: How many people join the Pool after 3 months, 6 months or 1 year? How many conservation funds are supported?... I believe that if you give the full numbers, the community will agree more.", "q2r": 3, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8186, "q0": "Cardano's proposal to clearly identify the problem that no DApp exists to support climate conservation or organizations that conserve endangered species in the ecosystem of Cardano is an issue that needs to be addressed at this challenge. It is directly related to the challenge. The solution defined by the author provided using a smart contract is Black Rhino, which builds an internal platform, with NFT integration, allowing users to support wildlife and gas conservation through the DeFi protocol. There is no doubt that the author's solution to those things will be able to add value to the Cardano ecosystem. Turning it into a tool or to protect species, metrics might better fit the configuration of the challenge. The author has also provided a powerful effective solution of the challenge.", "q0r": 4, "q1": "Proponents provide a detailed roadmap with specific goals for their project development. They gave clear timelines listing the to-dos for those times. A reasonable timeline to get their work done. The grant budget is $95,000, broken down by the author into clear categories appropriate to each item to be spent. The budget is divided into 3 parts: part 1 development resources is $15,000, part 2 project treasury is $50,000, part 3 DeFi Product development is $30,000. The content of the amount to be spent for each part is clearly listed by the author in the explanation. But here I do not see the author give additional budget estimates. I think it will be better if there is more money because if the project that is being refinanced has arisen, there is still money to spend. The group consists of 9 members, through the group's profile, I see that the author clearly lists the current work of the group and the number of years of experience of each member. All experienced Article members are clearly identified. With a lot of useful information that the author has been reported, I believe that if the project is successfully funded, it will come to them.", "q1r": 4, "q2": "Metrics are provided by the author on a monthly basis, making it easy to check their progress. The measure of the project's success will be based on how much we are able to contribute funding to our partner organizations from this group. The author has provided KPIs detailing the roadmap and pertinent metrics to audit progress, they have also provided the metrics needed to measure the success of this project. This project is a brand new project and is waiting to be funded.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Build an in-house platform, with NFT integration, which enables users to support wildlife and climate conservation through a DeFi protocol.", "experience": "Our core team is comprised of 8 members, and 3 advisors. We all share 2 passions: Conservation and Technology. Combined our team has 25+ years of programming experience, 5+ years of experience in Wildlife Conservation, and 10+ years of Marketing & Business Development experience."}