{"id": 404323, "author": "rsmolarz", "title": "STOR Token White Paper", "url": "https://cardano.ideascale.com/a/dtd/404323-48088", "category": 26438, "amount": 26250, "description": "We need a Web 3.0 Platform that will facilitate transactions between a coin base economy and tangible hard assets (self-storage facilities).", "funded": 0, "upvotes": 23491445, "downvotes": 22102980, "votes_result": 1388465, "votes_cast": 91, "f6_no_assessments": 6, "f6_rating": 2.6111111111111116, "videos": [], "media": [], "f6_assessments": [{"id": 413, "q0": "We note that the proposal in question aims to build a platform that, if successful, can facilitate obtaining credit to finance facilities, also including earning possibilities for various parties involved, creating a less bureaucratic, more democratic and transparent process. From what the proposal conveys about the recognition of the problems in this area and the facilities that would be obtained by using Cardano technologies to solve them, we note that the project in fact fits the goals of the challenge. The biggest impact in question, as stated in the text, would be the visibility given to Cardano's blockchain as a reference for optimizing processes in this area. We realized that the ideas that supported the concept of the proposal make a lot of sense, as the existence of many intermediaries in the area of ​​financing of constructions. By observing the project's Miro, we were able to perceive this line of thinking even more clearly than just observing the text of the proposal. Regarding the requested budget of $26,250, it seems consistent with the steps that will be carried out (with the exception that in the budget detailing some doubts arise, as we will see later).", "q0r": 5, "q1": "Despite all the positive points mentioned above, we see here that some points were not very evident. Clearly this is a very bold proposal, which seeks to have a significant impact on an entire segment. Therefore, we hope to have a very broad knowledge about the team behind the project. We even noted in the proposal that there is already a contracted team, but we realized that we were not able to easily find the curriculum of these professionals, or indications of projects previously carried out by them. Given the description of all the tasks that will be carried out, it would be interesting for us to obtain this information, at least in relation to the tech lead, which will play a very important role in the development.\n\nStill in relation to the tasks indicated in the project plan, we see that they make sense and that they have the function of, in general, creating a product that conveys well (even if not fully functional) the business idea. So much so that the last step (number 5) is aimed exactly at marketing to promote what has been built. But here we notice one more detail that hinders the general understanding of the project. Each of the steps described (steps 1 to 5) are accompanied by values ​​that appear to be the budget for each of them, but any of these values ​​would already exceed the amount of funding being requested. Thus, this would become a very expensive project given its current scope. However, it is worth mentioning that the basis of the project ideas is very good as mentioned in the impact section, perhaps a better adjustment of the feasibility plan will greatly improve the general understanding of how the project plans to take shape.", "q1r": 2, "q2": "We observed that the metrics established to verify the completion of tasks are consistent with what had been previously established. One of the main objectives was the establishment of the whitepaper and we see that this is already the first parameter indicated. But as the goal of the proposal is also to demystify transactions in this market, it would be interesting to add as one of the indicators of progress something like a survey to capture the engagement of people around this project, and also how likely they are to become frequent users of the product.\n\nRegarding the perception of success, it would have been nice to establish some numerical goals that would facilitate the perception of the project's impact for external people. Goals such as a to-be-achieved number of people wanting to trade installs on the platform, or a forecast of monthly user growth.", "q2r": 3, "assessor": "z_assessor_1146", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 974, "q0": "The objective of this proposal seems to be the creation of a new DEFI lending platform called STOR Token. It what wasn't easy to grasp but it seems like the main idea is to act as a lending platform for self-storage facilities buyers and real estate developers, with liquidity being provided (borrowed) by cryptocurrency holders. The idea seems interesting, although targeting the market of self-storage facilities seems quite niche.\n\nIn most cases, proposals that seek funding to write a whitepaper do no meet the standard of clarity and feasibility of Project Catalyst, and this proposal is no exception. Essentially the proposer is asking for $26k (or is it $32K ) to transform this idea into a tangible proposal which i believe is not acceptable. \nAll the details that you intend to explore in the whitepaper, such as System Architecture, Tokenomics, lending protocols, etc need to be presented as part of the proposal in order for us to properly asses it. \n\nIn summary, although the idea of the proposal aligns with the the challenge it doesn't  provide enough information to asses it's merits and whether or not it will add value to the ADA ecosystem.\n\n", "q0r": 2, "q1": "The proposer does not provide any evidence of his experience. The creation of a defi platform would require a good team of experience developers and the proposer mentions that he has \"contracted a development team\" but again no details on the identity or experience of these team members is presented, making it impossible for me to assess if they are skilled enough to undertake such project.\n\nA timetable with tangible steps is presented, although the timelines presented are not realistic at all i.e. going from having no Whitepaper to having and MVP in 4-6 months ? Most DEFI platforms being built on Cardano (Liqwid fincance, MELD, Maladex) are taking 1y+ to develop and they all started with mature Whitepapers.\n\nThere are no details on system architecture or technical aspects required to implement this proposal. The proposal mentions some risks to the project which seem relevant but given how underdeveloped the idea is difficult to assess the real risks at this stage.\n\nThe requested funds ($26250) does not add up with the budget breakdown  presented i the feasibility section.\n\n\n ", "q1r": 1, "q2": "The problem statements and solutions are not very clear. For example what does the proposer mean by \"coin base economy\", is a FIAT based economy or a cryptocurrency based economy (i suspect he meant the later). It also took me a it of reading between the proposal and Miro board to fully grasp the proposed solution. It would be helpful if the proposer would explain why he is targeting the self-storage facility market as its not clear. The proposer also mention real-estate several times in the Miro board but not in the proposal.\n\nRegarding Audibility, there are some tangible metrics presented such as Whitepaper completion, Token launch and TVL target. \"300 hours spent on the development\" is not a useful metric as we cannot keep track of that. Would have been more useful to share development progress either via Github or by periodical updates to the community .\n\n\n\n\n ", "q2r": 3, "assessor": "z_assessor_125", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 1400, "q0": "We often talk about using our resources wisely and creating awareness of all funded proposals and active projects to prevent doing the same research and projects many times without using the synergies and sharing resources. A proposal asking to undertake research into a token to fund self-storage facilities sounds like a good example how not to do DApps and Integrations. The target market is very specialized and should have a lot of common features with other types of commercial property or the sharing economy. I think joining some Telegram channels in the Catalyst ecosystem and finding people already doing similar projects in slightly different business areas that share common features is a better way to go about this. Then if necessary, write a whitepaper building on the existing experience and data (and possibly code base) in a category like Open Standards, and when everything looks like it is ready to deploy, move your follow-on proposal into the DApps category and instead of writing a whitepaper do the DApp straight away. This would be my advice to the proposer and hopefully justifies my rating which means \"neither agree nor disagree\" that this is a good match for DApps.", "q0r": 3, "q1": "There are some editing areas in this section and the budget breakdown did suffer from a mishap with 37,000 appearing for all itemized costs. I can also not access the Miro board as I do not want to have a Miro account. There is no LinkedIn profile for the proposer and a Google search for his name gets me to the same Ear, Nose and Throat doctor for the most popular search results. There is no timeline or roadmap for the proposal. This relatively sloppy presentation of the proposal makes me unsure if the proposal can be carried out successfully.", "q1r": 2, "q2": "The auditability section of this proposal is not very detailed and makes huge jumps leaving me puzzled over what kind of period and if post-proposal targets are included. \n1.) Whitepaper completion\nThis is easy enough and no targets for quality or feedback are set\n\n2.) 300 hours spent on the development\nAlso easy enough, spend the time if you get funded - does not seem to be a \"what success looks like\" goal.\n\n3) Token launch on or before September 1st.\nWhoa, whoa, whoa. We were doing a whitepaper, and now the token launches without any development? Maybe it was not so great to mess up the budget breakdown because now I think that maybe the funding amount asked for is the mistake, not the 37k times 4 breakdown.\n\n4.) TVL at or above 10 million by the end of the year.\nSorry, you lost me. People are pouring 10 million dollars into a Cardano token backing up storage facilities that just moved from whitepaper to minting their first tokens 2-3 months ago? How? Where is the marketing plan? Do you have investors lined up?", "q2r": 2, "assessor": "z_assessor_1357", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2049, "q0": "After reading, I was trying to understand how this token will help benefit the community. There should be a direct connection between the Cardano ecosystem and on how to improve it or to grow it. This is a project that appears to be requesting funds in order to fund their project in terms of developing the token and it's ecosystem. There are many ways of funding that are usually up to the team. Some rare forms of this is being funded in this process. However, most of the time, the funding takes place with either an ispo or coming directly from the teams funds. There should be a greater explanation on what the team has done so far for it's creation and why it needs these additional funds. Remember that this funding process is focused on creating Dapps that will help grow Cardano. Not the other way around. For this reason, I give this 2 out of 5 stars. ", "q0r": 2, "q1": "There doesn't seem to be much information listed here. At the top the experience listed is that the user has been in Cardano for 2 years. It would be useful to give more details on the team that has been hired because the reader doesn't know what the team consists of. It makes it easier to determine if the proposal will be implemented successfully if the team gives more information on who will be in charge and all the team members names and experience. This keeps them accountable for utilizing the funds in a way that will help benefit the community and bring more users to the Cardano Ecosystem. For these reasons, I give this 2 out of 5 stars until changes are made. ", "q1r": 2, "q2": "The most important information that has been received in this proposal is the Roadmap and detailed budget breakdown. I was able to see the the roadmap given and there was some good information that helped me understand as a reader. I still think that there could be a brief explanation on the proposal so that readers can get an idea without having to go to the link. The detailed budget breakdown gave a lot of information in regards to what areas the potential funds are going towards. However, without knowledge of who the team members are, I cannot verify that these funds would be in the benefit of the Cardano Ecosystem. There needs to be a change before advancing in the funding process. For this reason, I give this section 3 out of 5 stars. There is potential, the proposal just needs to be thought out more carefully and provide information where it is lacking. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2753, "q0": "The proposer is addressing the problem of facilitating transactions between a coin base economy and tangible hard assets. The solution is to bring investors and sponsors together to solve the problem of getting funded. The proposal is related to defi and swap solutions, thus fitting very nicely in the challenge of DApps and Integrations. I am giving this section four stars because I agree with the challenge that this proposal is under, however I would like to see the proposal clearly and individually articulate why the proposer chose this challenge and how they plan on bringing value to the Cardano ecosystem.", "q0r": 4, "q1": "The proposer includes a link to a whiteboard with tasks per phase that need to be completed in order to deliver on the proposal. I like the level of detail that is included in the whiteboard; however, the whiteboard does not provide a timeline and that lack of detail will make it harder for the community to make a decision. I would like to see these action items consolidated into milestones and then aligned to a timeframe as well as success criteria for each milestone, so the community can see the order of items needed to be completed and by what date to track how ahead or behind the development is.\n\nThe budget section of the proposal is grouped action items with a due date and an assigned budget value, which is much of what I wanted to see in the timeline section of the proposal. As for the budget itself, I would like to see more details as to how the proposer arrived at these figures--the proposal is requesting $26,250; however, the total of all of the milestone listed equates to $141,000. Please reevaluate how much funding is required for the success of the proposal or make clear what part of the requested funding will be applied to which parts of the proposal. Additionally, a break down of an hourly rate per skill helps the community understand how the proposer came to the requested figures.\n\nAs for the team, The proposer lists himself and a contracted team that has been hired. Included is a vague experience description in the space. With the information as it stands now, there is no visibility for the community to know exactly if they can trust the team to deliver. Please list all the names, skills and, experience of each team member that is working on the proposal as well as links to LinkedIn, CV's, published work, etc. I am giving this section two stars for lack of detail in budget and team.", "q1r": 2, "q2": "The proposer has plans to start a YouTube channel and podcast as a medium to inform the community of the progress of each milestone. I like this plan for communicating with the community, but I would also like to see a plan for a more concrete audit trail. The proposal plans for where and what, but I would like to see the when as well (e.g., information will be communicated after each major milestone is completed? On a bi-weekly cadence? Will there be consistent data points shared to track progress against? etc.) Please add that detail so the community has absolute clarity in what to expect and how to plan for it.\n\nThe proposer indicates what success of the project looks like with major milestones. I think the information listed in this section should stay in the proposal; however, this section of the proposal is for measurable metrics to show how successful the proposal is after development has been completed. Examples of this could look like, \"have X amount of users on the platform,\" \"have X amount of liquidity locked at a certain date,\" etc.\n\nI am giving this section 4 stars because it seems the plan of keeping the community in the loop as development is underway, but more detail is needed.", "q2r": 4, "assessor": "z_assessor_1576", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10430, "q0": "I appreciate the idea of platform for generating a pool of capital for investment into commercial real estate, in this case self storage facilities. I appreciate this is early days for the project but my concerns would be trust in the person/persons managing the capital effectively to generate a return and compliance with SEC regulations as mentioned by the proposer.  I am also unsure of the possible tax declaration difficulties for the user if they are not local taxpayers for the location of the investments, how would they be expected to declare it if it is income generated in a foreign country but realised through token value? It seems like a possible grey area or compliance issue that may limit the potential user pool and access to capital for the projects goal of at least $10m TVL. Overall project goal does align with the challenge although the output of this funding round is a whitepaper and token launch, not a Dapp. The challenge brief indicates that proposals without a whitepaper should be expecting to receive in the region of $10k which is significantly lower than the amount requested by this proposal", "q0r": 2, "q1": "The budget breakdown in the proposal indicates a total budget required of $178k but the proposal is for just over $26250. There is no obvious mention of where the remaining budget is to be generated from. The auditability section indicates the expectation is to spend 300 hours on development but the Miro board indicates that the budget has been derived from 200 hours of work. The budget also indicates a pay rate of $125/h which feels very high, the proposer has 5 years experience in commercial real estate and to be on an equivalent annual salary of over $200k at this point does seem reasonable. Also for this pay rate I would expect evidence of the proposers credentials to be provided.", "q1r": 2, "q2": "Metrics proposed are easily trackable however these are inconsistencies in the expectations between the proposals and the Miro board attached.", "q2r": 3, "assessor": "z_assessor_902", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "STOR Token is a lending defi platform that allows buyers of self-storage facilities and developers to borrow money to fund these projects. ", "experience": "I have been in CRE for 5 years after completing my MBA and have been a part of the Cardano ecosystem for about 2 years. I have hired a reputable dev team to help develop the platform. I have a multiple teams that do acquisitions and development for self-storage."}