{"id": 404617, "author": "dao.coders", "title": "DAO-NET: Voting Dapp", "url": "https://cardano.ideascale.com/a/dtd/404617-48088", "category": 26438, "amount": 45000, "description": "DAO Net provides meaningful incentivized participation in the Cardano ecosystem however it requires an easy to use voting wallet Dapp.", "funded": 1, "upvotes": 45622530, "downvotes": 13209694, "votes_result": 32412836, "votes_cast": 202, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 250, "q0": "DAO Coders’ proposal to develop an open source voting client dapp to complement funded proposals from Fund 7 fits the user-facing aspect of the challenge. The overall ecosystem described in the proposal is expected to attract both end users and the development of future projects on Cardano.\n\nThe intent to collaborate with and add features to an existing wallet is an efficient and durable solution to the problem. If this avenue of development is successful (alternatives are considered and discussed in the proposal), exposure to an existing user base will come with any wallets which collaborate with the team.\n\nThe big-picture general discussion of DAOs aligns with the goals of Cardano broadly, the challenge, as well as Project Catalyst itself. Parallel innovation in decentralized governance alongside Catalyst is likely to encourage robust diversity in problem solving. The proposers' intent to keep their IP open and shared boosts confidence in this regard.", "q0r": 5, "q1": "The proposal outlines multiple paths development may take. Understandably, no specific wallet has been identified to collaborate with, and no existing agreement is described, necessitating flexibility in the plan to implement the proposal. This includes discussion of how the budget might be used to hire additional developers directly in lieu of collaboration if needed; therefore, we have indication that the success of the proposal is not dependent upon collaboration with an existing wallet. This does require leaving some detail open, however.\n\nThe shared credentials and identities of the team highlights their capacity to seek collaboration or improvise if needed.", "q1r": 4, "q2": "The specific criteria listed and the indicators described offer a picture of how the project may be tracked if funded. Tracking via Github is discussed which provides a high degree of transparency into ongoing development. Planned weekly team meetings provide further assurance. The monthly timeline laid out sets reasonable expectations.", "q2r": 5, "assessor": "z_assessor_1117", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 329, "q0": "This great proposal is within the challenge goal, because I think this implementation will be a need for the Cardano governace and it will help many people to increase their participation in voting application for Cardano community projects and organization.\nThe proposal want to integrate existing products including DAO-NET itself and ADA wallets, the value for end users will be the ability to manage DAO-NET voting and tokens using a decentralized application.\nThis proposal is clear and concrete, based on previous the DAO-NET suite founded in fundt7, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.  This is an important proposal to attract many new users to the Cardano ecosystem while voting on the funding the development of many new applications.\nThe proposal clearly articulates the contest, the problem, the challenge and how it will add value to the Cardano ecosystem and for all of the stakeholders..", "q0r": 5, "q1": "This proposal is well written and clearly demonstrate the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.\nThere are links in the proposal, which allowed me to verify the product manager Dwayne Collard and the lead developer Jude Ben and their credentials. \nThe proposer team is well skilled about the whole context of the proposal (Manager, full stack developer, front-end, etc..), but the unique point of attention is the lack of the wallet developer, but the proposer promise to hire and there is the skill job.\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…). There is a too simple cost worksheet, that doesn’t contain all costs (eg. Infrastructure, cloud license, etc.)\nThe plan for implementation could have been a bit more specific, but as it is now it's good enough as well. The proposal doesn't go into too much detail into the technical aspects like architecture, language and technologies for the implementation. The proposers have not mentioned some potential challenges and how they plan on solving them.", "q1r": 4, "q2": "The auditability here is good, because the author of the proposal outlines some KPIs that serve to monitor the direct results of the platform: number of github metrics and agile methods ...\nThe way to misure success is based on developers adoption of DAO-NET and this proposal is a member of the DAO-NET suite of proposals originally submitted in Fund 7 and continued in Fund 8\nI miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…)\nAlso the proposer has not mentioned possible difficulties about market competitors.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2970, "q0": "The proposal in its entirety looks promising. The proposer addresses the problem of \"A lot of the community members no voting because of the complexity or illiterate about the voting procedure\". There are a lot of CA and VCAs who would want to go past the assessment state and vote for their favorite proposals, also go through others' reviews and see what they have been missing and on what areas they could improve on. This proposal could add a lot of value to the Cardano chain and also to the individual community members. The quality of reviewing and also the quality of proposals are eventually going to improve. This proposal addresses a lot more issues than the ones in the current campaign's brief. It tries to improve the community advisors, also induce a lot of responsibility in community members and their wallet itself could act as a community hub to share important notifications and updates to the users.", "q0r": 5, "q1": "As strong the initiative is, the action plan also looks solid. However, the milestones in the manifesto look a little feeble even though they are pretty sleek. The proposer keeps his/her game plan very compact abstracting a lot of unnecessary detailing. But for some readers, it might be underwhelming, and would have liked a little more information on what is the kind of technology the team is using and the amount of groundwork or preliminary coding already done, this would have added some points to the team's credibility. But nonetheless, the points are pretty self-explanatory. The same applies to the budget breakdown too. A minute detail justifying the amount assigned to each sub-topics such as \"Wallet Development Contract\" would have been useful. In spite of all the above indications, the team put together looks very strong on paper along with the skills they are expected to fulfill. Hence, I think a score of 4 out of 5 would the necessary justice.", "q1r": 4, "q2": "The proposer provides the community with the necessary tracking mechanisms required to keep an eye on the development process of the project. The usual git commits and reports from the weekly meetings should suffice to track the implementation activities. The success criteria are also crafted excellently keeping in mind only the campaign's expectations and the kind of issue the team is trying to solve. All the success metrics look transparent and on point. The A2T proposal submitted in the Gamers on-chained (if funded) would add a lot of new capabilities to the product and in turn increase its success. Other features such as multi-browser and multilingual support are triumphant features to look forward to. The proposal coming into this round with a lot of modules already funded and prepared, along with many proposals submitted in this funding round can sure make a collective impact and the team since is a proven member of the society, there is no doubt that it will provide all necessary assistance to make sure the auditing process turns out to be smooth and prolific.", "q2r": 5, "assessor": "z_assessor_1594", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6624, "q0": "This proposal aims to create a wallet voting dapp for  DAO (decentralized autonomous organization). At the moment there are many daos in the cardano ecosystem and I think that there are more to come with more adoption and more projects building. Having a set of tools like this one will make it easy for other projects to focus on other areas of their projects, instead of each one building their own tools. I think that in that regard, it a good idea and it will be very valuable to cardano ecosystem.\n", "q0r": 5, "q1": "The proposers want to use an open source wallet as a base layer to build the functionalities they need. There are many wallets built on the cardano network and I think that they should not have issues finding a partner. That said, the proposers have done a good job providing a timetable to complete the work and launch the voting wallet. Furthermore, they have broken down the budget which looks reasonable. However, I recommend breaking down the wallet development contract into smaller items. Other than that, the proposers have done a good job building confidence in a successful implementation of this proposal.\n", "q1r": 5, "q2": "The proposers have provided metrics to track the progress of the proposal such as github commits and errors fixed. I recommend to the proposers to add weekly updates and monthly reports on the progress of the development. The KPIs they have included are pretty strong as well. So I have a healthy amount of confidence in the auditability of this proposal.\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Create a voting DApp for DAO-Net processes that integrates with previously funded DAO-NET suite and existing wallets.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals."}