{"id": 404949, "author": "educhainment", "title": "Aedou, Learn Languages Together (2)", "url": "https://cardano.ideascale.com/a/dtd/404949-48088", "category": 26438, "amount": 57600, "description": "Most blockchain-game concepts are highly exclusive and disliked. Games in general are usually associated with being useless/waste of time.", "funded": 1, "upvotes": 51782917, "downvotes": 16972392, "votes_result": 34810525, "votes_cast": 259, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=rD6HKOkjddo", "https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=33079"], "media": [], "f6_assessments": [{"id": 7250, "q0": "This is a proposal by Educhainment, an exciting company that aims to create learning based games on Cardano. Their current project is Aedou, the realm of languages, which will be a MMORPG type game, where players can interact with each other and with the environment in order to learn new languages. I find this to be a great idea as it will target not only crypto enthusiasts who want to play a game with blockchain components, but also young people. Over time, I can see this project becoming a popular game that parents give to their children to help them with language learning.\nThis proposal is one of several for this project and it is part of the DApps and Integrations challenge because it aims to integrate with Atala PRISM, to facilitate the creation of player profiles where in-game progress can be tracked and used for the game’s DAO, but also to protect against bots, as new players will be verified by existing DAO members.\nAnother very cool part of this project is that it is not one big monolith that depends on all its proposals being funded, but rather it’s built with modularity in mind, where the game is separate from the blockchain components. This way, progress can slowly be made towards its completion even in the unfortunate event where funding is not obtained everywhere.\nThe proposers have identified several risks here, for example that the game engine they use is in its alpha, meaning that it gets many updates and there are many changes to it frequently, but the team are experienced and know how to work their way around this. Another risk they identified is that without the scaling solutions Cardano is planning to add this year, the blockchain component would probably be too much of a hit on performance to integrate, but to mitigate this, they have planned the game in such a way that it is not dependent on the blockchain and will only be integrated after the scaling solutions are added.\nAll in all I think this is a fantastic approach to developing something new on the Cardano blockchain and with the detailed planning for social media engagement, game development and risk management, I think this proposal definitely addresses the DApss and Integrations challenge effectively. Score: 5.", "q0r": 5, "q1": "The proposers have provided a detailed timeline, outlining the milestones they plan to hit every month from March 2022, up to September 2022 and then an additional roadmap for what needs to be done in Q4 of 2022 and Q1 of 2023.\nThe requested budget is 57600 USD, which I think very reasonable for the amount of work that needs to be done here and by how many people there are working. There are 6 core team members working on development and the ask for them is only 1200 USD per month, well below the industry average of 6-7 thousand USD. The language teams are currently working on 14 languages and the ask for them is $600 per language, per month. Again, very cheap for this industry.\nThe team behind the proposal, as I mentioned above, are Educhainment and the person who started it all is Mike Dietrich, a Catalyst veteran who has been very active in the community and in this fund he is also a member of the Gamers On-Chained Challenge Team. There are social links, websites and githubs provided for him and each of his core team members.\nIn my opinion, the proposers have a detailed plan, a very well thought out and reasonable budget and all the necessary skills in order to successfully implement this proposal. Score: 5.", "q1r": 5, "q2": "For Auditability, the proposers have added a large number of key progress indicators, both for the short term and for the long term. Examples include: how many levels they add to the game, how many github commits they have, number of players who participate in play-testing once it is available etc. As a recommendation here, to make Auditability even stronger in the future, try to set targets for each of these KPI’s, at least for a short timeframe (for example, 5 levels finished by May), which can then be shown to the community easily to further boost trust in the project.\nSuccess here is defined as finishing the MVP for the game by August, which is a clear target that will be easy to verify. A bonus to this will be integration with Atala Prism elements in August as well, along with the start and formation of test DAO’s. In conclusion, I think the information provided here is sufficient to audit the progress and success of this proposal. Score: 5.\nAs mentioned before, I think this is a fantastic initiative by Mike and his team and they deserve all the support of Catalyst, as they are building something that will not only attract new people to Cardano, but will be useful as a learning tool in itself, regardless of the blockchain component. Keep up the good work and I hope you get funded! Can’t wait to see this roll out.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thanks heaps for the good words, and also for the great detailed and helpful feedback!! Took a note on setting targets on the KPIs as well, I seem to have overestimated their obvious character."}, {"id": 7456, "q0": "Excellent idea and that fits very well with the objectives of the challenge. This talks about a kind of game (it can also be inserted in the challenge of the worlds) that the objective is to learn some language through the exploration of spaces, which would be the games of the worlds. Each would correspond to a language, and the entire context would be adapted to the player's proficiency level. I find this interesting in several ways of flow, because as the proponents themselves say, traditional teaching often follows a pre-defined pattern, where the student has to adapt to learning. In this game, the opposite would happen. I would contribute to student engagement/games as progress would not be too many tasks and it would be too hard, in a fun and challenging way. An excerpt that can pretty much sum up how this all relates to the Cardano ecosystem is “all governed worlds and their contents are built, inhabited, owned and curated by independent DAOs consisting of first language speakers (L1-), language professionals and high-level players (the latter need to succeed in an assessment first)”. Or a lot, as our blockchain technologies are used in all parts of our blockchain, which is great for us as it will increase or increase the number of transactions of our blockchain and it is also an organic form of popularization. People would come to the game to learn the languages, not to get to know Cardano, but that would happen automatically. Furthermore, the proponents and the statement that “we are also integrating Atala PRISM DIDs into our DAOs to independently prove their learning progress, language and game proficiency by in-game VCs”. That is, more and more ways in which Cardano serialized. Next, the proponents go on to explain in very detail the game's universe, the game experience, which ones would be addressed, other questions about the project (such as who would have the active token that would be transformed to Adada) and so on. a video, a kind of trailer, through which we can have a very realistic view of the game set to come. I loved the idea and I think it deserves the funding. \n", "q0r": 5, "q1": "Like the previous topic, this part of the proposal is ideal. We know reasonably detailed information about the three main parts to be analyzed, the roadmap, the budget and the team. There is not much to say, but I will comment on each topic individually. Starting with the roadmap, the proponents indicate which activities would be developed each month, which allows us to solidly visualize the process. The only suggestion I could make is that this explanation could be more detailed in the sense that: we know exactly what would happen in each week of these months. Thus, we would have an even deeper understanding of what is to come. Regarding the budget, we are told that this proposal is a complement to the main proposal, in which the salaries of the professionals involved constituted the funding. Here, more money is asked so that they can dedicate themselves even more to the project. I believe we understand quite clearly how the total amount will be divided and used. Finally, speaking of the team, we know each of those involved very well, individually and in detail. We know their names, their professional areas, previous works and which of them have some kind of connection with Cardano, which are active members of our community. A valid suggestion would be that, ideally, everyone should attach their linkedin profiles or other sites (as many have done), so that we can get to know their previous experiences in practice and have proof of what is said. There is a lot of confidence in the ability of this team to successfully develop the project. So, one more topic getting full marks, but consider some improvements I suggested. \n", "q1r": 5, "q2": "The proposal is highly auditable, the proponents point out many KPIs (short and long term) that could be used as measurable objectives, to verify if the game was achieving partial results. Regarding the measurement of progress, I was just a little unsure how this data would easily reach all members of the Cardano community. We know what to monitor, but how will it be monitored? I believe that the team will periodically meet with the IOG coordinators, as this is the standard to be followed, but it would also be positive if they clarified how this information could reach the other members of the Cardano ecosystem. Other than that, I think the auditability of progress is very strong, due to the large amount of data we can verify. Talking about the success scenario, the proponents indicate some scenarios to be conquered such as “we intend to finish the base content of the game and iterate on the MVP”, and also “the finalization of the basic linguistic content for each language to define common bases and approaches for learning”, in addition to “we hope to include some first PRISM components and start the formation of test-DAOs”. My view is that there is a situation similar to the auditability of progress, we have a lot of information about what would have to be obtained, but there is not so much clarity on how to bridge the gap between this team and the Cardano community. My suggestion here is that they participate in some Town Hall or moment after this meeting, because I think this project is super interesting and could prove to be extremely beneficial for Cardano, deserving a space in the most important meeting of our community. In this way, a summary could be made of the advances achieved with the financing, whether the desired scenarios were achieved, etc. Therefore, I will give it 4 stars, because I think the auditability is good, but it could be improved by making it clearer how everything will reach the active members of our community. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2, "reply": "This was great feedback, thank you!"}, {"id": 6399, "q0": "The proposal deals with two huge and powerful points: languages and games. In a globalized world like ours, is each time more important to learn different languages. In addition, more and more people are starting to play some kind of game online. Because of that put the two things together is a brillant idea and bringing the NFT world with it is even better. This proposal impact can be huge due to the amount of languages that the proposers aim to reach. The goals and metrics are clear enough.", "q0r": 5, "q1": "The experiences and knowledges of the members justify the work to be done. The budget could have been better explained because it seems to be missing other points beyond the payment for the members. Also, there is a mistake in one part: 6 members * $1200 = $7200 and the proposers exposed that the result would be $6000. I highlighted this mistake because it made the final budget wrong. ", "q1r": 3, "q2": "The proposers exposed well the KPI's and goals they aim to reach. The deadlines and milestones are very clear and the proposers mencioned the past projects that started to happen in the past funds. The project is easy and intuitive to audit.", "q2r": 5, "assessor": "z_assessor_409", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thanks for the feedback and for pointing out our minor calculation error. We are indeed only 5 people in the core team at this point, and the 6th person is only there to assist our main Godot-dev with some tasks, so it's not too bad. And we will also use some of our own received funding + use leftovers from last fund to mitigate our mistake."}, {"id": 6626, "q0": "I like the idea of the gamification of learning languages. Often, learning a new language on your own can be boring and difficult to grasp certain nuances. With this dapp, I think that learning experience can be fun and efficient. I think that this dapp will be a good addition to the cardano ecosystem. There will be much value brought to the ecosystem if the proposer can successfully implement this idea.", "q0r": 5, "q1": "Since this is part 2 of a proposal, I guess I will give it the same note which is a high rating. The proposer has provided the necessary information for the execution of the project such as a roadmap and a budget breakdown. Altogether I have good confidence in the feasibility of this proposal.\n", "q1r": 5, "q2": "This proposal is auditable because it includes the information necessary to track its progress. They have provided a roadmap since Q4 2022 when they will launch the public Alpha and perform an audit of their smart contract. Furthermore, the metrics they have provided to measure the success of the proposal are strong.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thanks for your feedback!!"}], "solution": "Aedou is a new, inclusive & meaningful distributed multiplayer game for language acquisition and to enable/strengthen global communication.", "experience": "Educhainment Collective (funded in Fund 6 & 7)\n\nFirst-Cohort Plutus Pioneer\n\nFull-Stack & Godot Game Dev\n\nProtonGraph-Creator, an FOSS procedural 3D-generation tool\n\nFrond-End-Dev\n\nSound/Visual/Generative Artists\n\nUX/UI\n\nCultural Scientist (game-based learning)\n\nSocio-Linguistics"}