{"id": 405213, "author": "revelar", "title": "Fiat Payments for NFTs - Revelar", "url": "https://cardano.ideascale.com/a/dtd/405213-48088", "category": 26438, "amount": 162400, "description": "Buying a Cardano NFT requires several steps to acquire ADA before a potential buyer can buy. This limits accessibility to small businesses.", "funded": 1, "upvotes": 35613075, "downvotes": 23982574, "votes_result": 11630501, "votes_cast": 179, "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 1649, "q0": "The problem statement and the proposed solution are compatible. The proposal in the impact section is very detailed, explaining both the solution and some of the challenges foreseen and how they intend to mitigate for them. There is some concern that partnering with the likes of Circle and Stripe might exert influence on product solutions directions but that far out weights the benefits of such a successful parentship solution that fiat payments would bring. \nI like how the team is technically strong in the Cardano ecosystem, includes Plutus Pioneers. \nThey look to have a very good understanding of software development cycle and will be focusing on the app delivery while were possible leveraging out of the box solutions proven to already work. There is a concern however that this methodology will provide a closed solution without future advantage to the community of coded solutions via say GitHub, the proposal suggests the code will be shared some time in the future but with no timeline. \nThe team seem to already have web sites up and running, an NFT market place operational, I believe this project if funded would achieve its set out goals. ", "q0r": 5, "q1": "The Team members identified is a good mix with deep experience in project execution and delivery of software related products, including both managerial as well as technical depth. Additionally and most advantages the teams have previously been Cohorts or are currently enrolled.\nThe proposal lists out key deliverables and further well lays out a plan of execution as sprints for the project to attain them. The stages of the project have been well laid out noting which parts will be executed by partners and which by the project in house core team.\nThe project is ambitious but well laid out and with a good team backing it and if funded I believe would achieve its goals in the time scale promised.", "q1r": 5, "q2": "The project has laid out well-documented KPI’s, those where well documented/listed in the feasibility section. \nThe project team has a dedicated domain for all of their Catalyst proposals and will be using the same to track and show the progress of this project against the deliverable / KPI’s. The reporting will consist of reports as well as a bi weekly demos. This I feel fully support auditability and ensures a project keeps on track or road bumps are communicated earlier so no surprised or major divergences occur later or in closing phase of project.", "q2r": 5, "assessor": "z_assessor_1395", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10817, "q0": "This proposal aims to create an MVP of a “fiat on-ramp” to buy NFTs directly, without having to convert to ADA first. The scope is to test this out with six (unnamed) gaming projects before making the solution generally available. The most disappointing part of the proposal is this: “this won’t be an open source code base”. Although understandable coming from a business who tries to create competitive advantage, the closed source approach hinders the applicability of the solution outside of Revelar’s own use cases. It’s a pity that the use of the solution requires a Revelar account. Such a Fiat-NFT gateway could have many use cases, far and wide, even outside the Cardano ecosystem.", "q0r": 3, "q1": "The $162,400 ask sounds like a lot but it’s only 6.5% of the entire challenge budget. The entirety of that sum is spent on salaries (Senior Lead Engineer, Full Stack Developer, QA Engineer, and Project Manager). Who these people will be is not discussed in the proposal. Costs related to Circle / Stripe are not considered in the budget. Whereas the general idea is sound and the overall plan divided in sprints makes sense, both the plan and the budget are still on a very general level. It would be a much better proposal if it was shown what the people will be working on, how they will use their time and what kind of deliverables can be expected on technical terms. Now we are expected just to trust their word and hope for the best. Revelar got 5 proposals through Fund7. Now they are applying for funding for 14 proposals altogether (5 of which are translations).", "q1r": 3, "q2": "I really like the Revelar’s Gitbook (https://catalyst.revelar.co/) approach to report the progress. They are promising both written and video documentation of progress monthly. The team also arranges sprint demos but it’s not entirely clear whether they will be open for public “as applicable” (as stated) or after each sprint (every two weeks). While all this sounds nice, I can’t help but think that for a $162K ask there should be more meat around the bones.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10827, "q0": "While the idea behind the proposal of making buying of NFTs is great, the proposal does not really make it as easy as promised as it will include KYC as a requirement, which can still be a high entry barrier in countries that have no compatible identity solutions. In addition to this, the budget and the hourly rates seem a bit high fir this kind of proposal regarding the ROI. Still however I think it will be of benefit towards the Cardano ecosystem, and it sure will be scalable.", "q0r": 4, "q1": "The proposer team is competent and has already performed similar tasks in the past. The implementation plan is detailed and the budget is defined, however it seems a bit high considering that relatively high industry rates are charged when asking for funds. However, the budget at least has a rationale. A good, credible contingency plan has been made and the details of implementation have been described sufficiently.", "q1r": 4, "q2": "Considering the track record of the proposers, I have no doubt about the proper auditability of the proposal. However, as for the assesment criteria: In my opinion the problem and solution description are clear, and the sprints serve as good milestones. The KPIs are sufficient and measure the success of the proposal well. Good job.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10831, "q0": "This is a proposal by the experienced company, Revelar. They have had multiple ideas funded in previous Catalyst funds and in this proposal they want to build a FIAT payment gateway for NFT’s on Cardano. As is usual with Revelar proposals, they have a very strong action plan where they describe how they will do this and how this would impact Cardano (making it easier for people to get into NFT projects will obviously boost adoption by drawing in new people to the blockchain and by encouraging developers to keep building better products).\nThe technical plan is simple enough: basically the end product would be a checkout system which developers can integrate on their website, so that any person can add an NFT to their cart and then just pay for it with USD, EUR etc. The only thing I’m missing here is where the NFT would be sent after it’s purchased. Are you required to add a wallet address before you purchase it? That would make sense, except if we’re already talking about people who have a crypto wallet, I feel like we’re already talking about people who own crypto so they can just buy their NFT’s like we currently do. I would have liked to see more details on this aspect, but it’s not really a problem.\nThe proposers were very thoughtful in what regards risks, as they identified 3 valid ones, along with ways to mitigate them: growing too fast and running into software issues that decrease trust if something breaks, regulation changes (buying NFT’s with FIAT would of course be subject to some regulatory scrutiny) and software delays (this, of course, is a risk for any software project out there). As mitigation to these, they propose to load test their payment solution before taking it to the general public, to partner with FINCEN approved entities Circle & Stripe to make sure they are in good legal standing with their approach and lastly to use already existing API’s and other tools in order to reduce development costs and overhead.\nAll in all, a solid proposal that I completely agree effectively addresses the challenge. Score: 5.", "q0r": 5, "q1": "The proposers outline that the deliverable here is an MVP Payment Page and account management system, which will be able to process customer KYC, payments and delivery of NFT’s. Very clear and precise, as expected of a company with a serious project plan.\nThe timeline is *very* properly outlined through something that as a person with over 7 years of experience in IT I love to see: sprint planning. We are presented with the tasks for the next 12 sprints (2 weeks each for 24 weeks in total) and again, due to my experience, I feel like they are very properly planned. For example, they estimate they will complete the front-end of the gateway in 4 weeks, but the integration with the backend is then estimated to last for another 8 weeks (and that is correct because the hard part begins when you actually can start processing payments and you need to do multiple rounds of testing and bug fixing, not when building the UI of the application!).\nWe are given a very good breakdown of the budget in weeks and cost per hour. For example, the Lead engineer’s cost will be 135 USD per hour, for 12 weeks (assuming an 8 hour working day), for 65000 USD. These are realistic prices for top end developers, especially in the blockchain space. My only question here is why the costs are only calculated for 12 weeks (half the time needed to complete the proposal)? I will assume that the rest is covered through other funding methods available to the company, as they have multiple projects ongoing and presumably paying clients. I would recommend that the details here be explicitly stated, however, to avoid any confusion. I will also mention that even though the entire requested amount is large (162400 USD), it’s less than 10% of the DApps and integrations total available amount and I find it completely reasonable for the tasks they are undertaking.\nRegarding the team, we are provided with proper descriptions and social links for the company’s CEO, CTO and CCO. The fact that we are not given the profiles of the developers should not be concerning in my opinion, because it’s up to Revelar to do resource allocation based on their workload and which projects get funded, etc. It’s a common practice for companies (note: *companies*, not small projects and initiatives) to not name specific developers in Catalyst proposals (other examples include Five Binaries and dcSpark.\nTo sum up everything I analyzed above, I am fully convinced that Revelar is highly likely to complete this proposal successfully, if funded. Score: 5.", "q1r": 5, "q2": "For Auditability, Revelar provides their website (https://catalyst.revelar.co), where they regularly post updates on all Catalyst proposals. Along with these, they commit to providing demos of their progress as well (which goes hand in hand with Agile development - usually teams are required to demo their progress at the end of every sprint). We are not given a list of KPI’s as with other projects, but we are given clear success metrics, namely at least 6 unique teams using the payment gateway during the Launchpad (sprints 10-11) with at least 200 transactions per project or a total of 250000 USD in transactions across all 6 teams. I personally think this project is very well thought out and will be easily auditable by the community, especially since Jason Toevs is very active and can easily be contacted by anyone in Catalyst interested in these projects. Score: 5.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10844, "q0": "At this point in the adoption of blockchain technology, no one can deny that NFTs are one of the use cases which have reached users outside of already existing users. The proposer explains the context and justification of the problem extremely well, and I see a clear alignment between both the proposal and the challenge. As a whole, I believe that this proposal has the potential to break through the \"crypto\" barrier that prevents many people from experimenting within the NFT ecosystem.", "q0r": 5, "q1": "Having read the proposal, I am impressed by the level of expertise that the team, including the Plutus Pioneers, possess regarding the Cardano ecosystem. They seem to have a deep understanding of the application development lifecycle requirements. However, this process may result in a proprietary solution without benefiting the Cardano development community. The proposal indicates that the code will become available in the future, but does not specify when it will be available. The team manage to identifies major outcomes and presents a comprehensive plan for achieving them indicating roles and responsabiliies from each colaborators with for me adds up in terms of feasibility. Ideally, the core team should have included a member with experience dealing with legislation related to the Fiat switchover on a global basis. Fiat is well known for its highly regulated nature, as it is subject to an extensive array of international regulations.", "q1r": 5, "q2": "Because of the nature of the project, there is a certain level of complexity that requires the team to provide adequate evidence in terms of auditability, so that the community can feel confident during the voting phase. And I believe that a lot of effort has been put into this. All KPIs have been explicitly defined and documented. A website will be used by the project team to track and present the project's progress in relation to the planned deliverables and metrics. The website will also contain reports and demonstrations. The use of this approach ensures that they remain on track or are able to address any roadblocks immediately.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10885, "q0": "For starters, what is \"fiat\"? Proponents explain in the excerpt \"Fiat's ramp payment solutions are critical infrastructure for B2B and B2C models who are choosing a blockchain to build their DApp\", but it's still not very clear to me what it's all about. I would like the concept to be better explained and in a more accessible language. Starting with the idea of ​​the proposal itself, it is about creating a checkout page aimed at new NFT buyers. The contextualized problem is that it is not easy for people who are not used to this process to carry out all the steps, there is a lot of giving up due to work and possible difficulties. So the intention of the proponents is to speed up and make such action more ergonomic. I think it's something really useful and can help bring new active members into the community, thus fulfilling one of the specific goals of the challenge. But I would like the technologies involved here to be explained in a simpler and clearer language, accessible to everyone.", "q0r": 4, "q1": "The script presented is a bit messy. We know what would happen in the project development process, but at the same time, such actions are not well situated in time. We can make the order they would happen but not exactly how long each of them would last, which creates an obstacle in the total understanding of the process. Talking about the budget, the asking amount is really high, I think it's up to the whole community to decide if it's worth investing so much in the project. But in terms of explaining how the budget would be used, that part is fine. These are basically the salaries of those involved. We know which professionals would work for how long and the price of their working hours. In this way we were able to understand very well how the amount would be distributed. The presentation of the team members is very appropriate, as there is a very specific detail about everyone. We know their names, resumes, linkedin profiles and how they fit into our community. This conveys a lot of confidence. In other words, the only part that deserved an improvement was, really, the script part (a clearer organization).", "q1r": 4, "q2": "Proponents explain how progress would be measured – through reports, consisting of content such as: recorded videos + a written version of updates on our dedicated website above + applicable demos of our projects after each Sprint. It seems to me that it would be a very broad coverage of the different activities of the process; but it is unclear how these reports would reach our community members. Would it be through the telegram and discord channels, perhaps? The ultimate success is very much geared towards the success of the project. I would like proponents to think of measurable ways to understand the impacts of all this for Cardano, if the specific objectives of the challenge are met with this proposal. Therefore, the auditability is good, but it can still improve in some points.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a simple checkout page connected to existing fiat payments (Credit/Debit card, Bank account, etc) to purchase NFTs.", "experience": "The Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds. We have a growing team of experienced software architects & engineers from around the world, Plutus Pioneers, & startup experience to manage a bootstrapped project. "}