{"id": 382646, "author": "carnivilla", "title": "QR Code NFT Distribution Tool", "url": "https://cardano.ideascale.com/a/dtd/382646-48088", "category": 26250, "amount": 10000, "description": "Маркетинговые, онбординговые и игровые системы, узкие места в текущей системе транзакций.", "funded": 0, "upvotes": 15614848, "downvotes": 22564062, "votes_result": 6949214, "votes_cast": 99, "f6_no_assessments": 5, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal could benefit the Cardano space, but since the proposer of the project is looking for a developer with whom to evolve it, the direction and problem solving are not fully understood and developed. I would highly suggest a resubmission of the proposal, after the proposer finds a technical partner who can better guide and explain the possibilities and potential of the entire project.", "q0r": 2, "q1": "Since the proposer has noted that he is looking for a developer with whom to build this d'app, as it stands at the moment the team is not skilled enough to successfully implement the idea. Therefore, the plan is also not detailed and the budget is not clearly defined, thus making it hard to assess if it would be enough for a skilled developer to build it with the requested amount. ", "q1r": 2, "q2": "The proposal does not contain a detailed plan, any metrics, KPIs, timeline or roadmap, as such the proposal's progress cannot be evaluated. I understand the team does not have the necessary skills and training to have all these explained properly, that is why I have suggested, that for a resubmission, it might be of great help to find a technical partner before submission, making sure at the same time, that the requested budget will be sufficient to pay the needed personnel.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "For an outsider (regular user) is difficult to understand what the concept is able to solve. Also is unclear what some of the features are doing - \"Sender/Receiver Pays transaction switch\" - what a switch is and does? - \"Limit per address feature\" - why a limitation is a feature?\r\n\r\nThe problem and the solution to the problem are presented in a vague manner making hard to identify who is the target audience for the developed app.", "q0r": 2, "q1": "There is no team assembled as the proposer stated that is looking to hire a developer to help with the project. (what skills are required for this position?)\r\n\r\nThe budget is not clearly outlined and broken down into identifiable items and the proposer is not aware of the necessary resources for the project.\r\n\r\nThe proposal doesn't offer a realistic timetable to complete the work. (time frame should be at most 3 months to deliver a working product and milestones are mandatory to emphasize the intermediary phases completion.)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (what are the constrains for this project?)\r\n\r\nThe proposer has not provided enough and relevant information about this project to evaluate its feasibility.", "q1r": 2, "q2": "No KPIs/metrics are defined to measure the success of the proposal implementation. (how many users are expected to use the app? what is the estimated volume of ADA involved in application transactions? etc.)\r\n\r\nThe proposal reads very poorly and it needs more editing/reworking so that it can be assessed properly given its direction. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 19, "ne": 3, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "QR codes to distribute NFTs is a good idea, however the proposal does not show clearly how the project is close to completion and how there will be a usable product in 90 days. In my opinion, the proposal does not address the challenge because the proposal does not clearly show a path to a product useable by end users.", "q0r": 2, "q1": "I would like to see more information on the current state of the project development and additional information on the team and background.. I would like to see the team expand on the plan to have the project ready for market in 90 days. ", "q1r": 2, "q2": "I would like to see the team develop a simple 3month roadmap to connect the funds expenditure with the success of the proposal. I would like the team to develop KPI's to help track performance, example create 10000 qr codes in month1 of launch. I feel the information provided is not sufficient to audit the progress and success of the proposal.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "The current transaction system is slowed down which is affecting Gaming systems, marketing and onboarding. The proposer wants to develop a QR Distribution tool where user are able to distribute Non-fungible token by verification, with unique addresses and funding options. This does help to reduce the burden on transaction system but doesn't resolve it thus somewhat addresses the issue", "q0r": 4, "q1": "The proposer doesn't have the experience and team to make this tool. They haven't given any plan to implement this proposal and they want someone else to develop this tool.\r\nTherefore it's very unlikely this proposal will be applied successfully", "q1r": 1, "q2": "The proposer hasn't mentioned any roadmaps or definition of success or Given any KPI or detailed budget breakdown therefore info provided isn't enough to track the proposal successfully ", "q2r": 1, "assessor": "z_assessor_419", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This is a draft proposal. Relevant information about the impact of this proposal is missing. This proposal is not executable nor does it provide information on how this idea will create value to the Cardano Ecosystem.", "q0r": 1, "q1": "The proposer doesn't provide relevant information on how to implement this idea. The idea is not clear described. A plan is missing. Also we don't find any information about the proposer.  ", "q1r": 1, "q2": "No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 24, "ne": 0, "ng": 14, "nfo": 10, "vca_o": 1}], "solution": "Создать инструмент QR Distribution, с помощью которого пользователи смогут распространять НФТ с помощью верификации, уникальных адресов, ограничений по времени и вариантов финансирования.", "experience": "Команда использует реальную среду NFT для подключения пользователей. Текущие системы транзакций не обеспечивают гладкий процесс для персонала и игроков."}