{"id": 384570, "author": "linconvidal", "title": "CardaBot: telegram bot with tipping", "url": "https://cardano.ideascale.com/a/dtd/384570-48088", "category": 26250, "amount": 10000, "description": "Связанные с карданом боты Telegram нацелены на мониторинг. Не существует способа подсказать ada другим пользователям, особенно при неофициальном подходе.", "funded": 2, "upvotes": 94980369, "downvotes": 2070922, "votes_result": 92909447, "votes_cast": 207, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal provides a low budget and quick turn around implementation of an integrated bot on Telegram. Telegram is a place where a large blockchain community communicates, and the bot provides value to cardano users in many ways.", "q0r": 5, "q1": "They already have an informational bot that is operational and plan to implement the tipping feature to a working product. Their roadmap gives timeframes, but considering this is a fast turnaround projects theres not much more detail to provide. They have target dates which are achievable as well.", "q1r": 5, "q2": "They have provided KPI metrics and roadmap markers to audit the success and progress of the proposal. They have laid out achievable goals in the proper parameters for this challenge. ", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "I believe, this proposal will take a huge impact to Cardano's Network. As the famous Lightning Tip Bot usage for the Bitcoin community, the bot can attract their community to make transaction in Bitcoin network. Love the proposer's thoughts about this. The Lightning Tip Bot have advantage with their Layer 2 solution, so users can tip someone with low / almost zero fees. With Cardano is still not have any exact launch date of Hydra (Layer 2 solution), this bot will take 0,17 ADAs as fees (like normal transaction). What if ADA going to the moon ($10 for example), it will cost $2 for just tipping a person.\r\n\r\nI like this idea, but needed some improvements of their model (as long Hydra is not launch yet). If this proposal approved and get funding, I suggest the author should consider put some revision in your \"Main Flow of the Tip Process.\" If bot can make invoices, it would be great. What I mean: John /tip to Jane on Dec 1st, Dec 10th and Dec 25th → each tip, bot will inform in group chat that John tipped Jane → make \"/invoices\" command in the bot's chat, if John ask for /invoice, bot will reply with external link to send total amount of ADAs the John tipped to Jane. But, if John doesn't ask for invoices within a certain times, bot will inform Jane.", "q0r": 3, "q1": "Team's qualifications are enough to make this project running and finish with their target, since they already start the CardaBot in Telegram, they just need to develop the tipping model. Resources, articles, and other information are clearly written in the proposal, make the public easy to reach what informations the proposer want to tell. Proposer aware and already tell us about  their limitations with the bot, that's a nice thing! The financial budget is very clearly allocated and reasonable to set up the actionable steps that are provided through a very clear roadmap with milestones.", "q1r": 5, "q2": "Love the author's determine to explaining the project with a clear and understandable explanation about the problem and the solution they want to solve. Realistic roadmap milestone the proposer explained are plus one, it is easy to understand what will they do after get a funding.\r\n\r\nBut, key metrics can not auditable publicly. How do I see CharaBot usage reach the target set by the proposer? Telegram did not show how much user are using the bot. I try to find total users on their website, but it's only a general explanation about CardaBot (and their other projects). If the proposer can make it visible to public, I will easily say that this proposal is auditable.", "q2r": 4, "assessor": "z_assessor_639", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies the inability to tip with ada tokens in Telegram. \r\n\r\nThis feature could encourage interactions in Telegram; trivia games can be held, helpful contributors can be rewarded, and newbies interested in Cardano can get a bit ada, for example. \r\n\r\nHowever, after frequenting a few Telegram groups in VeChain, BSC, Avax, and Cardano ecosystem, I have never seen tipping being done. The only place where I saw tipping used in a major way is in the WAX blockchain NFT scene on Discord. \r\n\r\nThis proposal does correctly notice tipping as a new feature being built for Twitter and TikTok. Hence, tipping could be a new norm for online interactions in the future. \r\n\r\nIntegration with Nami wallet could pose a challenge currently, as it is only available as browser extension and not on mobile, and Telegram is mostly used by mobile users. \r\n\r\nI would be interested to know if all native tokens on Cardano will be supported. Memecoins like $HOSKY and $CHEDDA can greatly boost the number of transactions executed by CardaBot, in my opinion.\r\n\r\nThis proposal breaks down the budget well. I would like more information on how it will scale. If infrastructure costs $2000/year, how will Cardabot be funded if usage of the bot becomes popular?", "q0r": 3, "q1": "The proposer has laid out definite numbers for the team and budget. A team member has built on Cardano and the team as a whole have strong programming experience. I am not knowledgeable on programming however, so I cannot comment much on that.\r\n\r\nThe budget seems realistic, judging from salary.com's average salary of software developers. \r\n\r\nI am not an expert on budgeting for projects, so more details on the infrastructure and marketing aspect would be helpful. How will the $800 on marketing be used? Paid ads/promotions/designing infographics? I assume(humbly) that reaching out to Telegram channel admins and having an active Twitter profile would be enough for the widespread adoption of Cardabot.\r\n\r\nThe proposal has a detailed, implementable plan and a clear roadmap on how to get there. I feel confident that the proposer will deliver, because of their experience; having already built a Cardabot with the ability to check epoch status, stake pool information, stake status, and Cardano reservations; and the realistic number of users/transactions.\r\n\r\nHowever, it is mentioned in the proposal that some of the existing Cardabot features have been removed in order to reduce operating costs. A breakdown of operating costs would benefit the proposal. If Cardabot becomes widely used, what is the projected operating costs be and what is the team's plan to cover these costs?\r\n", "q1r": 3, "q2": "This proposal was very well-written and has provided a realistic roadmap and time horizon. The KPI makes sense and provide a simple metric to quantify success. The proposer/team also has a website and Telegram channel. EveryBlock Studio shares updates on what they're working on quite frequently. The community can peruse these channels to track the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_948", "no_vca": 20, "ne": 2, "ng": 10, "nfo": 8, "vca_o": 1, "reply": "Scoring in Feasibility does not match the comment (\"I feel confident that the proposer will deliver\" and 3 stars)."}], "solution": "Функция опрокидывания для CardaBot, позволяющая пользователям Telegram выполнять транзакции ada непосредственно с помощью бота, не прибегая к опеке.", "experience": "У нас уже есть работающий продукт; оператор кол пула +1 год; +6 лет разработки на Python; опыт управления проектами."}