{"id": 380949, "author": "wvalthar", "title": "@chain-lib Cardano API Plugins", "url": "https://cardano.ideascale.com/a/dtd/380949-48088", "category": 26251, "amount": 5214, "description": "O atual alicate/cardano-api em cadeia só permite que os usuários utilizem o blockfrost. Um sistema de plugins deve ser feito para permitir que qualquer pessoa modifique o programa conforme necessário.", "funded": 2, "upvotes": 28183832, "downvotes": 11163907, "votes_result": 17019925, "votes_cast": 105, "f6_no_assessments": 5, "f6_rating": 2.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "O proponente está construindo uma carteira javascript api e componentes prontos para aplicação na web para o cardano API. Mantendo-se alinhada com o resumo do desafio, esta biblioteca ajudará os desenvolvedores a fazer uso da cadeia de bloqueios cardano. O impacto para os desenvolvedores e por extensão a Dapps será grande. O apoio a esta solução apontará a comunidade para a descentralização. A proposta deixa claro que ela tem um lugar de valor quando se fala de contribuição para a comunidade. A maioria dos projetos que ainda são novos para o espaço beneficiarão as implementações de sucção. Os objetivos das propostas se alinham perfeitamente com o desafio. Nenhuma menção à escala é mencionada, então suponho que o proponente trabalha sozinho, o que é bom por algum tempo, mas com escala eu sugeriria começar a pensar em uma equipe, porque não é uma pequena proeza fazer uma biblioteca tão básica. A proposta carece de estratégia técnica de execução, o que é importante, especialmente quando o trabalho futuro pode crescer. Atualmente há uma grande necessidade de tais bibliotecas e estrutura, porque o ecossistema desenvolvedor de cardano ainda é muito jovem e ainda não amadureceu, para ter todas as bibliotecas e guloseimas desenvolvidas e prontas para uso.", "q0r": 5, "q1": "O proponente, obviamente um desenvolvedor afirma habilidades significativas, mas infelizmente não pude verificar nenhuma delas, pois não restaram links ou credenciais na proposta. Embora eu respeite a necessidade de privacidade sendo um operador de pool estadual, é muito importante para qualquer proposta ter pessoas com seus nomes por trás de um projeto, porque aos olhos dos eleitores isso traz grande credibilidade para o autor e para a proposta. Ainda não tenho certeza sobre todo esse trabalho ser feito em tão pouco tempo por uma única pessoa, porque nenhum outro plano para os membros da equipe foi mencionado. Um item que me faltou foi um pouco um marco claramente delineado e tarefas técnicas que deveriam ser concluídas a fim de levar o projeto a bom termo. O proponente menciona algo sobre reescrever o sistema de plugins por 60 hrs. Como desenvolvedor, eu mesmo acho isso muito difícil de acreditar e essa linha do tempo me parece tão longa, mas vamos esperar que o autor tenha uma equipe em mente para esta reescrita. Falta também um plano passo a passo para todo o projeto, não apenas para a parte técnica, mas também para o crescimento futuro do projeto, autofinanciamento e assim por diante, porque tais bibliotecas precisam ser mantidas a fim de permanecerem relevantes e serem utilizadas. Existe um orçamento, mas não os recursos / mão-de-obra específica que será necessária para construir o projeto, então eu assumo que é 1 homem. Eu teria ficado feliz em ler mais sobre implementação técnica, detalhes e planos, porque isto poderia ter despertado o desejo de ajudar na implementação, mas como está agora, não tenho certeza sobre o plano exato. Mais uma coisa que encontrei em falta na proposta são desafios futuros que podem surgir durante a implementação como: o rápido crescimento do uso dos plugins, o apoio contínuo e atualizações dos plugins e assim por diante. Sugiro ao autor que procure outros criadores de plugins e junte forças para maximizar a utilidade para o ecossistema. Nós somos fortes quando estamos juntos. Há muitas propostas semelhantes a esta - estrutura de construção para uso futuro.  Apesar de tudo isso, acredito que é um bom projeto e que vale a pena o tempo e o voto.", "q1r": 4, "q2": "Como há um github ligado, eu esperaria que cada membro da comunidade cardano que está interessado no progresso e desenvolvimento desta proposta pudesse acompanhar dentro do repositório ligado na proposta. Os KPIs estavam faltando e a IMO é importante para qualquer projeto e ajudar a comunidade a acompanhar e se empolgar com o projeto. Uma métrica simples como os downloads por semana é uma ferramenta de marketing simples, mas excelente. Eu estava procurando por um roteiro de horizonte mais longo, mas não encontrei nenhum.   Sinto que o autor tem uma boa noção do que precisa ser feito, mas ainda não chegou à prática do \"como\".", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The problem in the proposal is within this challenge. At my point, this project will help to scale up the Cardano ecosystem faster if it is successful. But there is just a general introduction about their finished components and a short brief about their solution. \r\nThe team doesn't have key metrics for this project to know how they care about this challenge given. My recommendation to them for this proposal is that can be number of partners will use their API, traffic...", "q0r": 2, "q1": "Can't score the feasibility of this project. The team provides a GitHub but I don't know what it will be used for. Even they describe in the overview but it's not enough info about how they will and the timeline for implementing the idea.\r\nMoreover, they don't have a roadmap and KPI to show their detailed step-to-step of developing this project. So, it is hard to assess that their budget is reasonable.  ", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "Proposer provided a clear and concise description of the issue also offers a solution. This proposal has a positive impact on the Cardano ecosystem and clearly articulates how it will add value to the Cardano. Because there are no KPIs, it's hard to compare KPIs with challenge setting and this proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "In the proposal we have a link to Github which indicates to us that there is experience and skill that are necessary to deliver on the proposal. Unfortunately, we do not know who is behind the idea. It would be good to have more information about the team or individual who is working on this project. The proposal does not show records of relevant knowledge, skills and experience needed to implement the proposal. The budget is realistic and clearly presented and it's broken down into identifiable items. There is not a detailed implementable plan and no details of actionable tasks and order of execution. In the proposal we have a clearly defined time frame within which the work will be done but we do not have the necessary resources to implement this idea. Proposer explains the technical aspects that are needed for implementation but does not list possible risks nor is there an idea of possible risks.\r\n\r\n\r\n", "q1r": 2, "q2": "It would be good if the roadmap with milestones and a time frames for achievement were explained in more detail. Unfortunately, the proposal does not list KPIs that define the success of the proposal. This proposal and its success cannot be monitored in any way by the community.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "To me, this project will not bring any value to the Cardano ecosystem because there is no detailed plan and info to show about that. The proposer only shows their GitHub with a few words of introduction. And even doesn't have key metrics for their project. So I rate for 1", "q0r": 1, "q1": "There is only a short over about the solution this proposal wants to show and an introduction about already-made open-source of the team that can't understand how it can help this project. My advice for this team is to have a good proposal and enough materials for assessing the feasibility they must give info about a detailed plan they will do, roadmap that with a clear timeline of activities will get instead of just 2 milestone of 6 months and 12 months, clarify team member info for more trust, the budget that is reasonable with the plan and roadmap, risk-relevant that team will face off. Technically, this idea of the project will have a lot of technical stuff but they don't describe any of them, including smart contract, protocol... even more in the user point of view including UX/UI, user cases... ", "q1r": 1, "q2": "The proposer provide nothing in this proposal to audit it. \r\nNo plan, no roadmap, no key metrics in this proposal.\r\nThere is also no info about the problem explanation and no info to say how the solution can help to solve the problem.", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 21, "ne": 0, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "This proposal is about creating a plugin system for chain-lib/Cardano-API, starting with a way to get off-chain data, with blockfrost being an official first plugin. The problem [Current chain-lib/cardano-api only lets users use blockfrost] is clearly described, and explained in detail. The solution is defined, with potential impact in certain aspects. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "The Chain-lib team's profile is provided and described enough for understanding with suitable skill and experiences for implementation. However, I find it hard to define and verify the ability as well as experiences of each member of Chain-lib. Information on similar works done by this team should be added. The budget is clearly provided with a simple structure of items and explanations of the calculation base. However, KPIs and Risk (and mitigation) were not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lack of information: (1) Chain-lib member's profile and external links for verification [how can community know chain-lib members and their ability easier ?]; (2) KPIs, (3) Risk (and mitigation). The current definition of success [the plugin system will be completely rewritten with the two base plugins working; multiple plugins not written by chain-lib are created]  is quite qualitative, not quantitative/measurable enough. Besides, there is no information on demo/pilot/similar works done by this team. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Crie um sistema de plugin para o alicate/cardano-api em cadeia, começando com uma forma de obter dados fora da cadeia, sendo o blockfrost um primeiro plugin oficial.", "experience": "Novella / Cardano Keys Developer, SPO, Alanzo Purple tester, Plutus Pioneer 1, e já construiu vários componentes dentro do repo github."}