{"id": 381012, "author": "matthiasksieber", "title": "Blace.io: Marketplace Creator ⚡", "url": "https://cardano.ideascale.com/a/dtd/381012-48088", "category": 26251, "amount": 97000, "description": "À medida que os mercados estão sendo construídos, repete-se o trabalho, cortando a eficiência geral dos desenvolvedores.", "funded": 1, "upvotes": 51226590, "downvotes": 24056593, "votes_result": 27169997, "votes_cast": 209, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=18945"], "media": [], "f6_assessments": [{"q0": "Este projeto será enorme se for bem sucedido. A proposta está tentando diminuir a maioria dos trabalhos duplicados pelos desenvolvedores, construindo uma ferramenta de mercado em um lugar reutilizável. Isto permitirá que outros desenvolvedores da Dapp se concentrem apenas nas diferentes características e aspectos de sua própria Dapp. Como desenvolvedor, eu mesmo adoraria tal ferramental. O cenário do desafio está em linha com a proposta. Este projeto agregará um enorme valor ao ecossistema cardano, devido à rapidez e à atualização da consistência se todos os futuros mercados tiverem os mesmos ossos.  Esta é uma grande equipe, que será capaz de escalar com qualquer desafio de furúnculo que possa surgir. Ao contrário de muitas outras propostas semelhantes que eu já vi, não faltam elementos nesta proposta. Neste momento o ecossistema do dev está faltando tais ferramentas, e ele desempenhará um papel vital no futuro.  ", "q0r": 5, "q1": "A equipe é bastante grande e isso me garante que o trabalho será feito conforme descrito no roteiro. Eles têm todas as habilidades de software necessárias para levar este projeto a uma conclusão. Eles deixaram seus perfis interligados, e assim estão trazendo legitimidade ao seu trabalho. O orçamento é bastante grande e teria sido bom ter uma discriminação dos custos reais que estão planejados no roadmap. Eu sugeriria aos proponentes deste projeto que pensassem realmente em uma tabela de repartição do orçamento. O fato de eles já terem identificado os números específicos da equipe e o conjunto de habilidades é surpreendente, mas o que é ainda mais surpreendente é que eles já formaram uma equipe pronta para trabalhar.  Há uma tabela de tempo realista e sensata para completar o trabalho. Os proponentes mostrarão não apenas quando, mas como o trabalho é feito, quando eles abrirem os blocos de construção.  Os aspectos técnicos da proposta são bastante simples... escrever código para que outros desenvolvedores possam usar o código. Como desenvolvedor, fiquei impressionado com o fato de que a CLI (interface de linha de comando) será feita usando Haskel, que é a escolha original de linguagem para o ecossistema cardano. A equipe mebers tem uma grande maioria de habilidades e habilidades, então me sinto confiante em sua capacidade de enfrentar desafios no caminho. Os projetos futuros teriam que sincronizar-se com esta IMO para promover um desenvolvimento mais rápido.  ", "q1r": 5, "q2": "Qualquer pessoa interessada no trabalho de código aberto poderá acompanhar o progresso desta proposta, exceto a ferramenta CLI, que será de código aberto assim que o projeto for implantado. Isto torna a auditabilidade da proposta bastante fácil. Não há KPIs listados, o que é um pequeno problema, eu recomendaria que algumas métricas de adoção fossem adicionadas para projetos futuros.  O roteiro e os marcos do projeto são claramente definidos e realizáveis. Há uma descrição clara e compreensível do problema visado, e os proponentes estão fazendo todas as perguntas certas. É fácil de ver, eles realmente pensaram bem antes de fazer esta proposta e estão realmente investigando os problemas comerciais e de desenvolvimento do estado atual do ecossistema.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 4, "nfo": 2, "vca_o": 2}, {"q0": "The proposal is addressing one of the most critical requirements of the Cardano open source ecosystem. This proposal is an example of why this fund stream was created. This proposal has the potential to lower the entry-level for a large number of innovative market makers and boost the complete ecosystem in a substantial manner. ", "q0r": 5, "q1": "The proposal is being made by a strong team of innovators with established credentials in the Cardano community.  The project site list 9 international members. The countries that are represented in the team just exemplify the spirit of Cardano and the power of open source to bring people together. I would like to stick my head out and go on to say that it is one of the best teams we have seen in the Cardano proposals. ", "q1r": 5, "q2": "The proposal is clear and has a well-defined functional point that is aimed to be developed. Their output will be open domain and the progress can be monitored. The proposal is highly auditable and the success can be measured based on the number of forks/use of the web market. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal intention is to build infrastructure that makes it easier to create a marketplace within the Cardano ecosystem. The core components are listed that are common to a marketplace and that are often shared pieces of logic and functionality between systems. As identity and payments increasingly utilize blockchain we can expect to see an increasing demand for marketplaces for both services and products. Marketplaces represent some of the biggest companies in the world and due to that there is a big opportunity for this proposal to lead to high impact marketplaces if executed well.", "q0r": 5, "q1": "The proposal team are listed in a separate link with their LinkedIn profiles added. The team has a strong background in software development which will be important for feasibly executing this proposal. A budget breakdown is not provided which makes it difficult to know exactly where the funds will be used. The teams background makes this proposal feasible but to further improve the rating more information would be needed for a budget breakdown and also potentially more information on the core features and how they would be implemented as they are non trivial. Some of the features could have been marked as high priority and released in stages as they are completed.", "q1r": 4, "q2": "A roadmap is presented with the key areas of focus. No KPIs or success objectives have been added. As an area of improvement the core components listed are likely non trivial to implement, it would have been good to see some groupings to state which ones will be implemented first so they could be released and shown to the community, ideally open source. This would make it easier for the community to audit and provide feedback as the proposal progressed through the initial implementation. Better clarity on the budget break down would also be valuable so it's easier for the community to audit where the funding budget was spent.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Fornecer aos desenvolvedores uma funcionalidade de mercado em camadas básicas, para que possam se concentrar nas especificidades de seus produtos e serviços.", "experience": "Uma equipe experiente de desenvolvedores, pioneiros de Plutus, especialistas legais, gerentes de projetos e CTOs."}