{"id": 382199, "author": "highlander", "title": "Smart Contract Library - Phase 1", "url": "https://cardano.ideascale.com/a/dtd/382199-48088", "category": 26251, "amount": 45000, "description": "Cardano não possui uma biblioteca de contratos inteligentes de código aberto que os desenvolvedores possam utilizar para a prototipagem rápida.", "funded": 1, "upvotes": 47711176, "downvotes": 17707950, "votes_result": 30003226, "votes_cast": 200, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Este projeto quer criar e abrir um conjunto de modelos de contratos inteligentes para acelerar o desenvolvimento geral do cardano. Isto será uma grande contribuição com um impacto ainda maior se isso acontecer, devido ao impulso que dará a qualquer desenvolvedor para testar e conhecer o ecossistema cardano e a forma como as coisas funcionam. A proposta identifica um problema adequado para o cenário do desafio. Há uma idéia clara de como isto irá imbuir o ecossistema cardano descrito. Não há nenhuma métrica chave para falar que se alinhe com as configurações de desafio esboçadas. Acrescentar isso seria meu conselho para propostas futuras. Tenho em mente que os autores desta proposta têm experiência séria e relevante na criação de contratos inteligentes em etéreo e estou confiante de que eles serão capazes de aceitar quaisquer desafios futuros que venham a surgir.  Se esta proposta for implementada, acrescentará muito ao ecossistema em termos de modelos de contratos inteligentes reutilizáveis, o que é necessário em comunidades em crescimento como a de cardano.   ", "q0r": 5, "q1": "O plano é contratar um desenvolvedor pioneiro de plutus aberto que tenha experiência em contratos inteligentes, mas que ainda não tenha acontecido, de modo que nenhuma credencial possa ser dada ou vinculada, o que é um obstáculo, já que uma pessoa concreta que pudesse comprovadamente fazer o trabalho traria credibilidade a esta proposta. O orçamento é bastante simples, basicamente pagando a um cara um salário para fazer o trabalho. O cronograma poderia ser melhor, já que não há nenhum marco, exceto o lançamento de uma versão beta. A viabilidade do projeto dependerá se a equipe pode ou não encontrar um desenvolvedor para fazer o trabalho ou não. O bom é que há um entendimento claro e um plano para quantos membros da equipe serão necessários para a implementação da proposta. O orçamento é enogh claro, compreensível e dividido em partes a fim de descrever os passos necessários para alcançar o objetivo. Pode haver necessidade de mais tarefas técnicas e marcos ao longo do caminho. Há um cronograma realista e se os proponentes o seguirem, não deverá haver problemas na implementação do trabalho como planejado. Há uma descrição dos itens necessários para implementar, mas não há um roteiro que explique claramente as tarefas sequenciais que serão trabalhadas, o que pode ajudar os apoiadores deste projeto a implementar.  O que eu esperava como desenvolvedor era ver qualquer tipo de arquitetura ou plano para as tecnologias que vão ser utilizadas. Isto teria me ajudado a ter acesso a como seria fácil encontrar uma pessoa para fazer o trabalho. Sem detalhes específicos, não sou capaz de dar uma estimativa adequada do sucesso com base no que é descrito na proposta. Os proponentes têm uma experiência significativa com o desenvolvimento de contratos inteligentes sobre o etéreo que serão benéficos mesmo que o ecossistema e os paradigmas sejam diferentes no cardano.  Pode haver espaço para colaborações entre este projeto e outros que eu vi no desafio do Ecossistema do Desenvolvedor.", "q1r": 4, "q2": "Como a equipe planeja que todo o código seja de código aberto em um repositório, eu não imagino que haverá um problema para qualquer pessoa interessada em acompanhar o progresso do projeto. Nenhum KPI é fornecido e isso ajudaria qualquer membro da comunidade a medir o sucesso da proposta. Seria minha sugestão acrescentar um KPI mais concreto e talvez quebrar a proposta em várias tarefas diferentes que seriam implementadas em vários fundos.  Um roteiro é uma sugestão definida para futuras propostas de fundos, é apenas uma parte integrante de qualquer bom projeto.  Poderia ter havido mais explicações sobre o lado técnico das coisas, mas no geral eu acredito neste projeto!   ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a brilliant and game changing idea to have a smart contract library available to help speedup the developments proocess on the cardano ecosystem. This is game changing it will help speed up the process of application development on the cardano blockchain since developers can easily use already build open source templates which will ease their burden of having to start writing smart contracts from the scratch.", "q0r": 5, "q1": "The team have the required expertise to execute the project. The budget sits well though not so detailed but it is reasonable to guarantee a successful project execution.", "q1r": 4, "q2": "The proposer has outlined a timeline for project execution but has failed to include key metrics/KPI's, which is key to be able to help audit the progress and success of the project when funded. ", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly and concretely answers the most important guiding question of this challenge, “How can we ensure future developers benefit from the work that is funded today?”. Its plan is simple to describe and understand, but its impact could be substantial, not only for existing Cardano smart contract developers, but also it could prove a great resource for attracting new developers to the platform by making their transition much easier with a prebuilt library of smart contract templates, which is the aim of this project. Overall the proposal could have a big impact on the ecosystem if properly executed as it could make the experience of smart contract developers on Cardano much smoother.", "q0r": 5, "q1": "The team clearly has experience with building blockchain related applications, as is evident from their website, which hosts multiple NFT related mini-games. But, from the looks of it their current smart contacts run on the Binance Smart Chain & Ethereum and it’s unclear if they have Cardano specific experience, as that’s not mentioned in the proposal. However this may not have a great impact on the feasibility of the proposal as their plan is to hire an external developer part-time to write the Cardano specific smart contract templates, in fact this is where most of their requested budget is allocated towards (40 out of 45K).\nTheir goals are realistic, the proposal is written in a very down to earth manner and the requested budget seems feasible. The very reasonable amount of $30/h is given, and a full year of part-time development is factored in.", "q1r": 5, "q2": "The audibility section of the proposal is the only one that leaves a few things to be desired, like a clear description of the KPIs and of the exact intended launch dates. However these can be easily deduced from the proposal, as they are mentioned. Thus the progress of the proposal according to the given timeline, as well as the completion of the smart contract templates could be easily monitored and verified by the community auditors. However if a future submission of the proposal will be required I would recommend including these elements.\nI would like to mention that in the case of this proposal specifically the community would need to audit the quality of the technical output as well as the overall completion of the project. We certainly want to be vigilant about wasting community treasury funds, but perhaps in this case it would be even more important to assess the quality of the smart contract templates generated by the project. It would be far worse to release a set of flawed smart contracts in the community carrying the stamp of approval of project Catalyst.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is clear and concise which aims to build and publish a series of smart contracts templates, similar to Ethereum's Open Zeppelin which Cardano developers can use. Laudable idea and it addresses the challenge effectively.", "q0r": 4, "q1": "The team is behind the Highlander platform and they have written smart contracts on Ethereum already, and are capable of implementing the project. The plan depicts that they aim to build an introductory series of smart contract templates for token issuance, NFTs, and governance protocols. They will then release the contracts to the public and refine thm based on user feedback. The team can successfully implement the project based on the valid facts in the proposal.", "q1r": 4, "q2": "The budget is well broken down and timeline clearly showing 3, 6 and 12 months. The amount requested is also reasonable for the project.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}], "solution": "Construir e publicar uma série de modelos de contratos inteligentes, similares ao OpenZeppelin do Ethereum, que os desenvolvedores Cardano podem utilizar.", "experience": "Nós somos a equipe por trás da plataforma Highlander. Chris é nosso principal desenvolvedor e tem vasta experiência na redação de contratos inteligentes sobre o Ethereum"}