{"id": 384330, "author": "smarlex", "title": "Glow on the PAB", "url": "https://cardano.ideascale.com/a/dtd/384330-48088", "category": 26251, "amount": 63000, "description": "A linguagem e a cadeia de ferramentas Plutus são difíceis de usar.", "funded": 1, "upvotes": 54824762, "downvotes": 18655442, "votes_result": 36169320, "votes_cast": 195, "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Glow is expected to provide a secure and easy option for writing smart contracts in Cardano. The proposers have presented a POC of Glow over EVM a year back and the current proposal will enable direct adoption of Glow bypassing the requirement of EVM. This has the potential for shifting a large developer base to Cardano and it's an important initiative. Therefore it can be reliable said the proposal is addressing one of the major challenges. ", "q0r": 5, "q1": "The proposers have built Glow programming language which simplifies smart contract writing and now has a POC working over EVM. They are proposing to make the necessary amendment so that the same can be run through PAB rather than using the EVM route. This will improve security and also reduce the requirement for EVM altogether. The proposers are very capable and will be able to complete the task based on their demonstrated credentials. ", "q1r": 5, "q2": "The three major steps that are planned are 1. Glow is able to send transactions to the Cardano blockchain. 2. Deploy on-chain code and share data with other users and 3. Watch for and respond to blockchain events as contracts run. These three tasks are to be carried out using PAB. These steps are atomic and can be audited and success measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "Glow is a language to write safe Dapps interacting with cryptocurency blockchains. Right now it uses the Etherium virtual machine to work, and the proposers want to make  it work with the PAB(plutus application backend). The proposal is in the right challenge setting. It identifies that developers struggle to write code that is safe which is normal, because all devs are quite new to the programme. There is a clear message on what the proposers will do to add value to the cardano ecosystem: mainly porting their product to work with iohk given application backend for plutus. I didn't see any planned metrics for this project like adoption rate user downloads or anything that would help the team monitor the adoption of their language. I am confident the authors of the proposal will be able to scale because they've planed for the future year of development already.  There's a big opportunity here to do something great. Many proposals arise trying to provide safety when developing Dapps, and as a developer I believe this is one of the more stable and further along the way sensible projects done. My only fear is that people wouldn't understand all the terminology and it would have been of great benefit to explain things in a more simple manner.", "q0r": 5, "q1": "The proposers have stated all the skills necessary to bring this project to an end and have the verifiable links to prove it. They're part of an organization called Mutual Knowledge Systems, which has done some heavy development. The proposers have a clear view on the work that needs to be done and the people to do them. They have already planned for the people that they'll need to do the job, and have them on hand. The budget is clear and the work for the money paied is explained as well in a simple manner. There are 3 months of rapid development planned alongside the actual goals that need to be reached like milestones along the roadmap.  The proposers show how the process is going to work, and they explain the \"how\" which is rare and needs to be appreciated. The project resources are described, although a abit more complicated way than necesasry. For example, I'd suggest to add explanation to the abriviations, because no reading their proposer would be a developer like me and wouldn't understand what EVM and PAB means, without a 10 minute googling frenzy. The technical aspects like architectures were not mentioned in the proposal, but the proposers have documentation for the glow language, roadmaps and so on, so I don't feel this is an issue. The proposers have considered challenges that might come along the way, and are prepearing for them before they even start development of the current implementation which is a goo sign that they plan ahead for unforsean circumstances. ", "q1r": 5, "q2": "There is a github project (repository for code) that holds all the effors and work being done in the project. The fact the project uses the Appache 2.0 license is a clear indicator of an open source solution so all interested community members will be able to follow along the progress of the project through github. The thing that is missing in this proposal are KPIs. Metrics of success should not be neglected as a process that is not monitored can not be improved over time. And considering the 1 year plan the proposers have planned, the sooner they start to use metrics the better. Despite no KPIs I think the proposers do monitor their process and development, but they've just not added those metrics in the proposal. Definition of success is important and should be present in every proposal. A roadmap with milestones is set and 3 months of exact work that needs to be done is planned out and segregaated into tasks. There's a clear understandable description of the problem that needs to be solved and clear steps, description and planned out tasks are in place for the solution.   Best of luck to you, I hope your project will be voted in. I'll be following along with the project progress and plan on using it when ready!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "First, the author should clearly explain the impact of the project in your proposal and possibly underpin the result of your project once it is finished. What benefits for the open-source development community based on the Cardano ecosystem and Plutus?", "q0r": 3, "q1": "Let the CAs have confidence in your delivery project ending. At least explain the terms used in the submission. For instance, EVM (error vector magnitude) or (EVM) Ethereum Virtual Machine, which I should refer to because there is no such reference or abbreviates on this used term. If you're going to be re-written and resubmit this proposal in similar concepts, I believe you should highlight the development environments you may select for a run on -on-chain or off-chain (Docker and Kubernetes).", "q1r": 2, "q2": "The proposer requested US$63,000 and with – extracted from the submission \"The length of this project will be 14 weeks total (a bit more than three months). We anticipate that after three months, it will be ready for testing. After six months, it will be ready for commercial deployment, and after 12 months, it will have a significant number of smart contracts deployed.\" And no other effective or highlighted information for the community or the challenge team in this Fund 7 to audit the project efficiently.", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly demonstrates how they aim to meet the defined problem of a difficult toolchain within the ecosystem by implementing Glow onto Cardano via the PAB. Which if successful will make end user experience greatly simplified.", "q0r": 5, "q1": "The team is well know within the community and as a proof of concept has already been completely the feasibility of this proposal is good. The timeline is well defined and the requested funds align correctly with said timeline. It would be great to see potential risks/concerns highlighted and addressed in future\r\n proposals.", "q1r": 5, "q2": "The deliverables are clearly defined and easily measured. However they only provide a final result. Intermediate check ins a progress reports are needed due to the scale of the project and the funds requested.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is well thought out, and effectively addresses the open source developer ecosystem. ", "q0r": 5, "q1": "I believe the proposal provides a clear roadmap and a clear understanding of deploying dapps. I would advise a small section that gives a personal reference to lend the project a personal bit of credibility. I think before the PAB is publicly released, plans of implementation could be met with some skepticism and could postpone your approval until a later round.  Using Nix to setup your environment can be a very time consuming experience and often could dissuade a new developer from trying glow out. Have you considered alternate ways to deploy? ", "q1r": 4, "q2": "While there is a comprehensive breakdown of the intended steps needed to bring the project to life, there is little detail in what the 21000/month will be spent on. Will the Senior engineer be working on other projects? Will there sole focus be on creating 'Glow on PAB' during the 3 months? ", "q2r": 3, "assessor": "z_assessor_970", "no_vca": 26, "ne": 3, "ng": 18, "nfo": 5, "vca_o": 1}], "solution": "Glow simplifica o desenvolvimento do DApp, mas neste momento precisa da EVM. Propomos portar o Glow diretamente para Plutus usando o PAB.", "experience": "Construímos Glow na KEVM, e temos uma prova de conceito para a PAB."}