{"id": 384450, "author": "eli.j.selkin", "title": "PAB Container Log Processor", "url": "https://cardano.ideascale.com/a/dtd/384450-48088", "category": 26251, "amount": 3500, "description": "Atualmente, o PAB tem apenas os retornos da unidade Haskell () (retornado como [] em JSON). Este valor é irrelevante para qualquer frontend.", "funded": 2, "upvotes": 71945722, "downvotes": 9394903, "votes_result": 62550819, "votes_cast": 216, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "O proponente quer adicionar um processador de toras ao backend da aplicação plutus, para poder refazer a toras mais facilmente e ajudar com questões de compreensão, e trazê-la para um formato compatível com o formato json. IMO como desenvolvedor, esta é uma solução valiosa para um problema, talvez não complicada, mas certamente necessária. Ela se concentra na praticidade do desenvolvimento com o PAB. Há uma explicação clara sobre o valor que ela trará para o ecossistema cardano. Ele irá acelerar o desenvolvimento através da compreensão do que está acontecendo no PAB. Há métricas-chave alinhadas com o cenário do desafio, que qualquer um será capaz de seguir publicamente. O projeto estará pronto para escalar, utilizando a infra-estrutura de doca e kubernetis prontamente disponível, o que aliviará a maioria dos problemas ao escalar tais soluçôes com busca elástica. Não vejo nada em falta nesta proposta. Há necessidade de uma maneira simples de entender o que está acontecendo no PAB sem olhar para os troncos de haskel convolutos.   ", "q0r": 5, "q1": "O proponente tem todas as habilidades necessárias para levar o projeto até a sua conclusão. Há uma clara abordagem científica adotada. O proponente tem uma conta vinculada que fala muito. Assim, as credenciais são verificadas com distinção. Nenhum membro da equipe foi mencionado, mas com a linha do tempo dada, eles não serão necessários para o sucesso. O orçamento está claramente delineado e os passos dados podem ser seguidos publicamente por qualquer pessoa interessada. Os usuários podem acompanhar o progresso no reporte vinculado na proposta. Há um cronograma realista para completar o trabalho descrito e, como desenvolvedor, acredito que seja razoável. Há uma explicação muito detalhada sobre quais serão as ferramentas exatas utilizadas e a combinação de tecnologias para levar o projeto ao sucesso.  Os aspectos técnicos da proposta são explicados de forma simples e clara e isso é um passo importante que falta em muitas outras propostas. O proponente considerou desafios e soluções similares e planejou desafios futuros, fornecendo a si mesmo tempo para fazer as pesquisas necessárias para que não seja necessário retroceder. O projeto está em sincronia com o que já foi feito e seria um grande bloco de construção para o ecossistema cardano.  ", "q1r": 5, "q2": "Haverá um reporte do github com todas as especificidades de implementação, para que qualquer um possa acompanhar o progresso do projeto. Há métricas e KPIs definidos e este é um dos poucos projetos que os tem. Sou um forte adepto de que o processo esteja sendo otimizado através da análise dos dados anteriores. E não se pode fazer isso sem uma métrica e uma definição de sucesso válida. Há um roteiro com marcos montanhosos definidos, que pode ser rastreado pela comunidade. Há um problema claramente simples descrito que tem uma solução clara e não tão simples. Bem pensado.  O proponente tem claramente experiência com o PAB e está tentando ajudar os outros projetos a não terem que enfrentar os mesmos problemas para que ele possa ajudar o ecossistema do projeto, que é exatamente o que os cenários de desafio indicam.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The aim of the proposal is to log the diagnostic messages generated by PAB in a fast searchable manner without using the DB sync and other heavy tools. This can help in debugging code and also to see the state of execution of Plutus scripts. There are other ways currently to achieve the same result however this method is likely to result in few adoptions and might spinoff a few other useful tools for automatic deployment of PAB. ", "q0r": 5, "q1": "Gimbalabs PPBL developers are building an ecosystem in which a core group of Plutus developers is gaining valuable experience and producing code useful for the community. This initiative is also funded by the earlier Catalyst funding rounds. Therefore with the credentials and the work of the author as seen in Github it is likely they have the potential to complete the project. ", "q1r": 5, "q2": "The development will be hosted in opensource and the plan given by the team spans 6 months to be completed in Apr. The work can easily be audited based on the progress in the code repository. The amount of funds requested is very reasonable and the success can be measured based on the activity in the repository. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is adherent to the goals of the campaign. If the team is able to build a set of tools to parse logs from the FAB making them queriable then they are creating value to the Cardano environment because it is a common goal to lots of projects in the Cardano community. Later if they were used for a relevant number of projects, it would mean the Cardano environment is more resilient because its new Dapps will be less dependent on private SaaS solutions. One point the team could have further explored is the question of scalability their tools will be able to provide. This is extremely important because the robustness of the proposed solution is proportional to its scalability.", "q0r": 4, "q1": "The authors seem to have more than enough skills and experience to conduct the proposal successfully from what is outlined in the Relevant experience section, but they could have linked their Linkedin profiles or at least described their past project experiences in the proposal. Also, they haven't described how many team members or which positions will be required to perform the tasks of the project. As per the budget, the total amount is pretty reasonable, but it was not broken down into identifiable items other than the cluster costs. The timetable seems to be achievable if there is no setback along the way. To enrich the proposal and make it more solid the team could have not only stated what will be done each month but also how they are planning to do it.", "q1r": 2, "q2": "The roadmap proposed has clear milestones. The metrics defined are aligned with the milestones proposed and they represent a good way to check if every milestone was achieved with a success or not. The only drawback is the team could have used more objective and measurable KPIs. For example, they could have defined what they consider reliable enough for the April metric. Also, the time horizon proposed is realistic, but I believe they could have left more room for unforeseen circumstances. Finally, a fair description of the targeted problem was given in the beginning.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 22, "ne": 5, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "Desenvolver um conjunto de ferramentas para analisar os logs do PAB, de modo que eles possam ser consultados a partir do frontend para determinar o estado após as transações.", "experience": "Eli Selkin - PPP 2ª coorte, desenvolvedor Gimbalabs PPBL, usuário frequente de PAB, CTO da Loxe inc. (numerosos projetos financiados pelo Fundo 6)."}