{"id": 384527, "author": "vivek", "title": "Dataset - Stake Pool Analytics", "url": "https://cardano.ideascale.com/a/dtd/384527-48088", "category": 26251, "amount": 10080, "description": "Conjuntos de dados históricos completos para análise e aprendizado de máquinas não estão atualmente disponíveis através de exploradores de blocos ou sites existentes", "funded": 2, "upvotes": 54808984, "downvotes": 15076497, "votes_result": 39732487, "votes_cast": 143, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Ferramenta que obterá dados de múltiplas fontes de dados na cadeia e externas que fornecerão análises sobre vários tópicos relacionados à operação do pool. A proposta é correta para os cenários de desafio, oferecendo educação e crescimento para a comunidade e SPOs a serem percissivos. Há exemplos claros de como o projeto agregará valor ao ecossistema cardano ao trazer mais pessoas para serem SPOs, educando-as sobre a credibilidade de toda a operação. Faltam KPIs e métricas para medir o sucesso, o que é estranho considerando que os proponentes estão fazendo uma proposta analítica. Como desenvolvedor, eu mesmo acredito que este projeto seria capaz de ser bem dimensionado com potencial de crescimento (tecnicamente falando).  Esta é uma peça que estava faltando no ecossistema, e muitos dos SPOs atuais tiveram que descobrir coisas por si mesmos, o que é difícil e nem todos o fariam.   ", "q0r": 5, "q1": "São mencionadas habilidades concretas e pessoas que fariam o trabalho. Encontrei-os ligados e eles parecem legítimos em todas as credenciais e habilidades que correspondem às descritas na proposta. Um caminho claro para a implementação da proposta é mostrado. Uma ressalva seria o elo que faltava a um reporte de github mencionado na proposta (para onde todo o código irá). É um pequeno esforço para fazer um reporte vazio, mas vale a pena. O orçamento poderia ser descrito melhor. Há alguma falha por tarefa a ser feita, mas nenhum raciocínio é dado por trás das somas específicas. Eu esperava taxas horárias para o desenvolvimento como qualquer outra proposta, porque faz sentido. É um pouco estranho dar um preço para o desenvolvimento de qualquer outra forma porque é difícil provar que uma característica pode ser mais ou menos cara em comparação a outra. Há um cronograma realista, com certeza. Não tenho dúvida de que os proponentes conseguirão com o horizonte de tempo atual. Eu esperava algum tipo de documento técnico sobre a implementação, mas não é um grande problema se eles não tiverem um. No entanto, isso ajudaria para geeks como eu.  Os aspectos técnicos são um pouco confusos para mim e eu estaria interessado em ajudar se eu soubesse qual era o plano. Essa é a beleza do open-source. Os autores não mencionaram nenhum tipo de riscos ou desafios esperados, então acho que ou é bastante direto ou não pensaram sobre isso.  ", "q1r": 4, "q2": "Falta um repositório github ou um único lugar para acompanhar o progresso do projeto, mas em todas as feiras os autores mencionaram que eles vão fazer um repositório github. Não tenho tanta certeza de onde eles vão postar seu repositório github e como eles vão disponibilizá-lo para a comunidade de financiamento postal? Estas perguntas poderiam ser evitadas simplesmente ligando um repositório github vazio na proposta. Sem métricas e KPIs, o que é um pouco decepcionante considerando o tipo da proposta. Há um roteiro claro e marcos para o tempo planejado, portanto não se preocupe. A descrição é clara e compreensível também para pessoas não-técnicas, o que é bom. A solução também está bem escrita.  O projeto beneficiaria muito a comunidade cardano se fosse feito com o nível correto de inclusão da comunidade. Boa sorte!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Availability of ready-made chain datasets will encourage ML researchers to develop insights and promote Publications on Cardano. This also has the potential to be out the superior technology of Cardano. The direct impact is debatable, and data updating will also be necessary. \r\nHowever, the data is currently available in PostgreSQL and is relatively comprehensive for meaningful research. The proposal will build a snapshot of the current state, and the proposers have not included details regarding will they maintain the dataset for a specified period. ", "q0r": 3, "q1": "The proposers are SPOs and have more than 15 years of software experience. The task is relatively simple and does not have significant risks. Therefore they should be able to do it. ", "q1r": 5, "q2": "The task analysis is fairly comprehensive and it requires the effort of two programmers with ML/Deep learning backgrounds for at least a month. The amount requested may be fair and comes to about USD 5000, which can be considered marginally higher. However, data science is a high-paying area and the talent required to satisfy community requests might justify the fund requested. More details on the baseline of the data source would have added clarity to the proposal. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The challenge asks for open source projects and they are going to develop a public data set for pools so, this will be very useful and is exactly open source for developers this addresses perfectly the challenge", "q0r": 5, "q1": "The plan is well detailed and divided into steps, for each one they have the budget needed so this shows that they have very well planned each part and what the development of this will suppose. About the team, they provide their names and explain their experience in the field so reading it conveys a good feeling that the project will be carried out", "q1r": 5, "q2": "They do not provide any information to audit the progress. The success is not measurable by any indicator provided so will be very difficult to audit the succes. There are not even performance indicator so I cannot give a good mark here.", "q2r": 2, "assessor": "z_assessor_547", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This project will develop an open-source code for generating an analytics dataset then showing off a full historical stake pool dataset for targets who wants to analyze it. This project will help to the development of a stake pool in Cardano more effectively, and means will help to grow the Cardano community a lot because the staking pool is one of the key development models in Cardano network. But the proposer should add some more info about key metrics to measure the project success. ", "q0r": 3, "q1": "The proposer shows a very detailed roadmap that clarifies all the work that has to do, even this project is very simple to compare to others. Hence, their budget is fit with the roadmap \r\nWith the experience of the team that the proposer show in the proposal, I think they can do it. ", "q1r": 5, "q2": "The proposer provides a detailed roadmap for auditing the development progress easily. But the proposer doesn't add some key metrics to help people know what success will be looked like when this project goes public. \r\nAbout the problem and solution, the proposer made a good detailed explanation about that. The proposer also listed some questions that help me understand why users need the solution of this project. \r\nLast but not least, I think the proposer should show some potential risks that this project can meet in the implementation plan, that will help them have some backup from problems. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "There is so much hidden valuable information stored in the Cardano blockchain and at the same time the open source developer ecosystem strongly needs contributions in the analytics domain.", "q0r": 5, "q1": "The experience and track record is present and strong. I see a small risk (what may not have to realize), when the plan includes 'collaboration with community on requirements' - is there enough resources planned for that? Currently the community only has to hope that the experienced team comes up with nice result, but the proposal does not present the actual plan in sufficient detail. ", "q1r": 4, "q2": "Would have been full score if there would have been some KPI or indication how many views or queries will be resulted. Six specific queries included in the proposal can be verified easily, but by themselves might not justify the 8 weeks.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Repositório de código aberto para gerar um conjunto de dados analíticos a partir de uma mistura de dados db-sync em cadeia e fontes de dados externas", "experience": "Fundadores da Cardano Canucks e da Canuckz NFT com mais de 30 anos de experiência em infra-estrutura de dados, análise e visualização para empresas."}