{"id": 385056, "author": "titan", "title": "Transaction Editor & wallet", "url": "https://cardano.ideascale.com/a/dtd/385056-48088", "category": 26251, "amount": 16400, "description": "O cardano CLI é para ser utilizado em transações grandes e complexas", "funded": 2, "upvotes": 142629562, "downvotes": 9374330, "votes_result": 133255232, "votes_cast": 664, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Uau ... apenas waw! O proponente quer introduzir um edditor de transação que seja mais utilizável para substituir o cardano CLI(interface de linha de comando). Como desenvolvedor eu mesmo posso me relacionar com o problema descrito na proposta e verificar se ela atende ao desafio definido. É claramente articulado como isto trará valor e alegria aos desenvolvedores no ecossistema cardano que eu incluo! As principais métricas são relevantes e é claro que o proponente pensou muito na proposta real nada menos que a própria ferramenta. Certamente haverá desafios, mas não tenho dúvidas, considerando a experiência dos autores e a gestão do tempo, de que os desafios serão enfrentados sem problemas! Não há absolutamente nada faltando nesta proposta, o que é raro. Este projeto vai acrescentar algo que falta no ecossistema: uma maneira fácil de trabalhar com transações sem ter que sofrer. Não há nenhuma preocupação de minha parte. Este projeto terá um grande impacto na comunidade se for financiado e eu encorajo as pessoas a votarem a favor disto como eu votarei totalmente!", "q0r": 5, "q1": "Há tantas credenciais e habilidades listadas que levei um tempo para ler e verificar todas elas. O cara é Ph.D. em Física Teórica desenvolvendo simulações para sistemas de elétrons correlatos (queda do microfone). Há um plano de execução claro e ele conhece o trabalho que precisa ser feito e o tempo e processo para fazê-lo. O orçamento é claro e dividido o suficiente para ser sensato para atingir os objetivos estabelecidos, dos quais são muitos e ambiciosos. Há um cronograma realista para completar o trabalho, mas estou vagueando se uma equipe não seria mais benéfica, mas posso respeitar o homem que quer construir uma ferramenta no mannar adequado e ter membros de equipe nem sempre é o caminho a seguir (pelo menos no início). Uma explicação detalhada é dada não apenas sobre o \"o quê\", mas também sobre o \"como\", o que é raro e precisa ser apreciado. Os recursos necessários para o desenvolvimento do projeto são claros. Os aspectos técnicos, como o editor e as funcionalidades já presentes e planejadas para o futuro, são todos descritos e significativos como marcos. O proponente considerou desafios e riscos relevantes para uma implementação bem sucedida e, além disso, analisou o impacto dessas decisões. O projeto está em sincronia com o que já foi feito, e isto será um bloco de construção no futuro, creio eu. Um trabalho absolutamente estelar de uma proposta! Boa sorte! Espero que você seja financiado! Votarei a seu favor!", "q1r": 5, "q2": "Tendo que falar de rastreabilidade, o autor já tem um cronograma muito específico e planeja como incluir testadores beta da comunidade para ajudá-lo no ciclo de trabalho, bem como planos para documentação e deixar a comunidade saber as características que estão sendo disponibilizadas. Não vejo nenhum problema em deixar as pessoas saberem o que está sendo feito e desenvolvido. As métricas e os KPIs também estão em igualdade com o resto da proposta e isso raramente acontece em muitas outras propostas. Um roteiro com marcos e todos os sinos e apitos estão lá, assim como um cronograma que considera os desafios e tem um amortecedor para eles. Um problema claro e compreensível e uma solução de corespondência estão presentes e bem escritos por vezes, um pouco técnicos. A solução 100% é uma solução para as lutas do engenheiro de software do dia-a-dia regular.  Boa sorte!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Currently the tools available for developing an app on Cardano (on low level) is still far from perfect. Using cardano-cli would still make developer struggle and have trouble, as what the proposer mentioned that there are a lot of people asking and looking for answers on Discord and Cardano forum. This proposal would build a tool to make it easier to use cardano-cli in a declarative way, means you declare what you want and the tool will handle the command for you. E.g for creating wallet, looking UTxOs addresses, balance, etc. By having this tool, it will greatly help the developer community building on Cardano, and further attract more developer to not get intimidated into getting started.", "q0r": 5, "q1": "Oscar (the proposer) have proven the experience in building these various tool, from the growing open-source Scientific Python Project until it became the open standard, to having a Ph.D. in Theoretical Physics developing simulations for correlated electrons systems. Looking at the Github repo, it has a comprehensive documentation, with already working feature such as: token mints, metadata, delegation certificates, unlocking of Plutus Smart contracts. Although, it would be better if Oscar could provide his Linkedin too for further verification. Reading through this proposal, Oscar could articulate clearly on what the problem, how he came up with the solution, and how to implement that solution with working example already provided. The 10-week action plan he provide is clearly described in details, and shows what to achieve on every week. Overall, this proposal have a high chance of success, considering the amount of experience he had. ", "q1r": 5, "q2": "The roadmap, the goals / achievements, and metrics/KPIs is very well defined in details (10-week plan). It is highly auditable considering this is an open project and we can track the progress through Github commit. The proposer have a clear understandable description of the targeted problem, and also able to articulate the solution in details, i.e using Emacs and specify why he choose it, why it would help developer community in Cardano, etc. ", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 21, "ne": 10, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The team pointed out the dead point of user experience and made a great way to fix it. This idea will save a lot of time and advance the risk when performing transactions in the node. In addition, the team also has detailed content to explain how it impacts and the target. \r\nMoreover, the KPIs are promising for people in Cardano communities. ", "q0r": 5, "q1": "The team has experienced how to perform their plan well, moreover, they did it since fund 6 and there is a video to visualize how this idea happen. The team also provides full of content to explain what they gonna do from point of view of users, and also with the technical explanation. Everything is clear and easy to understand. Moreover, there are many attached links in the proposal that can show how great this team did for the Cardano ecosystem. ", "q1r": 5, "q2": "They have a detailed roadmap in weeks and good KPIs for easily auditing their progress. \r\nThey also have a good explanation about the problem, and that's why their solution can address the problem very well.", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor will be a helpful tool since it solve the problem of the cardano CLI. ", "q0r": 5, "q1": "He's a skillful developer with relevant experience and he explain very well what he plan to do. All information is very transparent: the time he will spend on the project, a detail timeline and KPI etc. Moreover he also demonstrates what the expect outcome will be with examples. ", "q1r": 5, "q2": "The metrics to audit the progress is well-thought. We can easily track the progress of the project because he's very transparent and the timeline is in detail plan.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Um editor de transações de alto nível, declarativo, que se integra totalmente com sua carteira, cardano-node e seu editor de texto.", "experience": "Protótipo de trabalho para as transações, com fichas de menta e desbloqueio de scripts de Plutus. Vencedor do prêmio no desafio Plutus Pioneer Capstone."}