{"id": 383469, "author": "dcspark", "title": "Gaming dApp Hackathon", "url": "https://cardano.ideascale.com/a/dtd/383469-48088", "category": 26241, "amount": 50000, "description": "Многие разработчики Ethereum не знают, что могут развернуть свой контракт на Cardano через Milkomeda", "funded": 1, "upvotes": 34805375, "downvotes": 12730916, "votes_result": 22074459, "votes_cast": 216, "f6_no_assessments": 4, "f6_rating": 2.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "It apppears that dcSpark would like to host an event which it will claim up to 10% of the proposals funds without identifying what the benefit to the Cardano community will be.\r\n\r\nAs a former pro-am gamer, award winner of multiple hackathons, and former game developer, I can say with confidence that this proposal does not effectively address the challenge. The proposers specifically target Ethereum developers but fails to link this to the challenge setting.\r\n\r\n", "q0r": 1, "q1": "No detailed plan of the event is presented. It is not clear that the proposers have any experience in running proposed type of event. Because of the reviewers extensive experience in participating and hosting of hackathons, the 1-star rating seems approppriate.", "q1r": 1, "q2": "\"First half of 2022\" is the only identifiable information relating to a time horizon. No roadmap, metrics, kpis, nor information how the community could track progress is provided. Thus, the only appropriate rating here is 1 star.", "q2r": 1, "assessor": "z_assessor_22", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "Supposedly the proposal will be responsible for making a hackaton based on blockchain games, in this way the participants must have knowledge of developing games on chain so it fits the challenge", "q0r": 5, "q1": "They do not provide information to check if they really are who they say they are. No names no portfolios... They also do not explain how they will propose this competition or how it will be developed or any type of detail", "q1r": 2, "q2": "There is no type of success indicator, there is no roadmap to follow the development of the proposal or estimated times for each step of it. In addition, there is no way to audit if it is being developed correctly. Impossible to give a good score in this section", "q2r": 1, "assessor": "z_assessor_547", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about hosting a virtual hackathon for individuals & companies in the blockchain games domain and sharing our knowledge about Cardano & Ethereum. This idea is meaningful and makes a lot of sense. The problem is clear, matching the challenge presented, however, the proposed solution is still very abstract [no roadmap, budget division, KPIs, ...]. Therefore, based on the given information, I do not agree with the impact of this proposal, I can rate it with a score of 2", "q0r": 2, "q1": "Team profiles are described as composed of well-known ex-Emurgo and ex-IOHK employees, but without references/evidence to verify. So I can not see proof of feasibility from the team's profile. In similar, the plan did not well-prepared. The budget structure is not provided, without any roadmap/milestone. In addition, risk management is not identified. Therefore, based on the given information, I disagree on the feasibility of this proposal, I can rate it with a score of 2.", "q1r": 2, "q2": "For better auditability of the plan, the proposer should consider adding the missing information: (1) Team profile with link for verification; (2) Budget distribution (with explanation for each item); (3) Roadmap (with KPIs/ Metrics); (4) Risk/challenge analysis Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This proposal creates a virtual hackathon for individuals & companies in the blockchain games domain and share knowledge about Cardano & Ethereum.\r\nCreating a virtual hackathon based on dcSpark & Milkomeda (dcSpark is a crypto ecosystem builder company, Milkomeda is a protocol to give EVM capability to Cardano through a sidechain with ADA as the base asset), I think this is a very good idea or, it will certainly attract many individuals and organizations to participate.", "q0r": 4, "q1": "While the team has shown sufficient evidence to demonstrate the skills and experience needed to implement the proposal, it would be interesting to know the profile of the people involved. It is also important to have more detail regarding the number of people involved, estimate hours and allocated budget to the different work packages for project implementation.\r\nProposers have not provided a complete road map, determining what to do in certain time periods is extremely important.", "q1r": 2, "q2": "I think the information provided is incomplete. There is no roadmap with milestones. There are no metrics or KPIs, nor is a description of the success of the project clearly articulated. As no clear plan is provided regarding what the funds would be spent on, it is rather difficult to imaging auditing the progress and success.\r\nAsking for a budget of 50000 dollars, however people do not know how this money will be used.\r\nSince the proposal does not detail how the project can be sustainable over time, it would appear that budget allocation would be necessary in the future, however, there is no mention regarding this in the description.\r\nHow will the marketing and attracting people to the virtual hackathon be done?\r\nIn conclusion, the idea of a team of teams is attractive and could be powerful. More specifics regarding metrics, tasks, and objectives would be helpful.", "q2r": 2, "assessor": "z_assessor_862", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Мы проведем виртуальный хакатон для частных лиц и компаний в области игр на блокчейне и поделимся нашими знаниями о Cardano и Ethereum.", "experience": "Наша команда состоит из хорошо известных бывших сотрудников Emurgo и бывших сотрудников IOHK, которые создавали экосистему Cardano в течение последних нескольких лет."}