{"id": 382089, "author": "t", "title": "Cardano Risk Assessment Tool", "url": "https://cardano.ideascale.com/a/dtd/382089-48088", "category": 26233, "amount": 68000, "description": "Рынки DeFi требуют метода оценки надежности кошелька, запрашивающего средства.", "funded": 1, "upvotes": 103705959, "downvotes": 9497496, "votes_result": 94208463, "votes_cast": 523, "f6_no_assessments": 8, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Описанная проблема имеет смысл, так как автор идеи разместил статью Decrypt's о том, что в 2021 году пользователи дефи (в основном на Ethereum) потеряли $10.5B из-за краж и мошенничества. Я согласен и поддерживаю эту идею, потому что мне, как энтузиасту дефи, иногда нужно проделать много работы для оценки платформы дефи, прежде чем разместить свои активы.\r\nРешение и образец снимка вашего инструмента оценки рисков предназначены для оценки кошельков, а не платформы, потому что я вижу \"addr1hy59x...\" в качестве адреса кошелька. Может ли этот инструмент оценить платформу defi тоже? Если этот инструмент сможет масштабироваться для оценки платформы defi, то будущее влияние этого предложения будет огромным в сообществе Cardano DeFi. Ваша надежда на то, что этот инструмент будет использоваться для добавления измеримого уровня уверенности и доверия для всех сторон, вступающих в транзакцию Cardano DeFi, будет успешно достигнута.", "q0r": 4, "q1": "Поскольку бюджет этого предложения хочет получить 13% от общего финансирования в $500,000 от Boosting DeFi challenge, я должен сначала убедиться в стоимости вашего разработчика. Выводы: Я одобряю это. Потому что это разумно для средней зарплаты в вашем регионе (дважды проверил это на payscale.com). Навыки и опыт команды великолепны! Это подтверждается их профилем на linkedin. Предложение также предоставляет реалистичный график! Для меня, так как я не работаю в сфере пропозиций, они очень хорошо описали дорожную карту. Proposer знает о рисках и трудностях этого проекта, но они предложили альтернативные способы их устранения.", "q1r": 5, "q2": "Очень хорошо объяснено. Благодаря всей предоставленной информации, мы можем иметь полное представление о том, что они производят, каково назначение этого инструмента и т.д.. Я считаю, что ревизия проведена идеально, нет необходимости критиковать. Но есть одна вещь, которую я не нашел в этом предложении. Как убедиться, что сообщество Cardano использует этот инструмент оценки рисков? Как вы продвигаете этот инструмент? Может быть, какое-то партнерство? Если команда сможет предложить новым DeFI dApps использовать этот инструмент, это будет здорово. (Не забудьте обновить свои KPI, если вы об этом подумаете).", "q2r": 4, "assessor": "z_assessor_639", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The performance of the tool will be dependent on training data and possibly community input. There is also a need to validate the theory that based on past transactions a wallet with tendency to commit fraud can be detected since there are no restrictions in creating a fresh wallet to cover and reset tracks. ", "q0r": 4, "q1": "The proposal is from a solid technical team and is likely to be implemented. The concept may need more tuning and may have some false positives and false negatives. Still, there is a need to experiment to arrive at the possible best-case scenario. ", "q1r": 4, "q2": "The budget is primarily for the developers including the ML scientists and the output of the proposal has a well-defined end state. The proposal has a fairly reasonable time plan with defined outputs therefore it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This challenge is aligne to the challenge. Detecting the fraudulent wallets will assure people to trust the Cardano ecosystem by reducing  the risks while using it.", "q0r": 5, "q1": "This proposer is submitted by a team of people who have been involved in the catalyst for a long time, and who have expertise in the field of Data Science and Machine Learning professionals working in credit and fraud risk, for numerous credit bureaux and credit providers. Their work experience all of them understand the importance of having a system which secure, which is guarantee of trust from the community.\r\nThe issue addressed by this proposal it's a real concern for everyone using the Blockchain & DeFi, and unfortuntelly the risk keeps increasing.The implementation plan of this proposal is detailed with the timeframe and a budget well defined.", "q1r": 5, "q2": "The activities to be carried out under this project have been described and the dates set. \r\nChallenges that the proposal may face have been pointed out by proposers and taken into consideration. KPI and metrics listed.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This project will develop a Risk Assessment Oracle, a service that I think Cardano ecosystem will need to use to prevent the fraud risk of a given wallet if it belongs to a fraudster. In my point of view, it's absolutely needed for our ecosystem especially in the next phase of development when governance voting will be the future. \r\nAs the detail of the context and solution that they will solve in the proposal, with key metrics that they put, I think the team really consider how their project can help to improve the Cardano ecosystem and align to the challenge settings. ", "q0r": 5, "q1": "The team showed us an outline of their detailed plan in days, hence their budget breakdown is reasonable with that plan. \r\nThey also have a detailed explanation about how their system work, standing as a normal user I think people can understand how it can help to solve the problem. \r\nMoreover, there are some risks and challenges that directly come from the problem and technical that they're awarded and showed how they will face to them clearly. ", "q1r": 5, "q2": "They have a good roadmap with a realistic timeline for executing, they have clear key metrics that definitely align and can help to develop the Cardano ecosystem, not just enriching end-user but helping a lot of development partners to grow in Cardano ecosystem. \r\nAnd again, as I said before, their detailed explanation is sure enough for normal users can understand and trust their solution. \r\nTherefore, their provided proposal is completely enough materials for auditability. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 15, "ne": 5, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "DeFi needs risk assessment tools, so the proposal is exactly to the point with \"boosting cardano's DeFi\" challenge. In my opinion, the long term success of DeFi is dependant in finding other risk management methods than collateralized loans. DeFi default scoring and risk assessment tools are potential keys to unlocking that future. Which, of course, having uncollateralized loans is full of even more and new risk. But this is how innovation goes. Very strong project!", "q0r": 5, "q1": "Strong track record of experience, so it is very likely that it will be implemented successfully. Project plan/roadmap/scope is very well thought-through and convincing. The project itself has identified risks, which is a good sign. I would personally add \"cardano-db-sync changing the schema during the project\" as a relevant risk to the developer side, but I assume that they have counted that in to the budget and it in itself will not affect the likelihood of project success.", "q1r": 5, "q2": "Project scope is presented in very good detail, which allows to monitor the progress. Metrics/KPIs, which are presented, are relevant and convincing, and provide sufficient information to audit both the progress and the success.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "There's no DeFi without trust and this project adequately addresses this problem. With Atala Prism in the mix, we have good use of the DIDs which is necessary for people to identitify the wallets they choose to have a transaction with. ", "q0r": 4, "q1": "The experience on the team is commendable. Being proposers in the previous funds, it's a case of resilience and persistence at this point. Learning as you go. Asides that, the credentials of the proposers are relevant to the project. Having also participated in both Plutus and Atala pioneer programs is a bonus. ", "q1r": 5, "q2": "YES! The Key Performance Index is placed in a way that highlights each achievement with actionable steps in the roadmap. It's a very important project that is taken as such. ", "q2r": 5, "assessor": "z_assessor_700", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal effectively underlines security risks referenced in the challenge brief. However, the solution doesn't seek to address/alleviate the risks associated with smart contract exploits (where user assets are aggregated), but instead focuses on custodial wallet exploits. ", "q0r": 3, "q1": "The team's experience can allow for successful implementation. However, the plan presented has many unknowns that should be clarified. To better assess a real value add, the plan could have elaborated on how \"fraud\" will be defined and with what parameters (beyond the \"phishing bot\" eg),. \"Fraud\" parameters should be clearly and sufficiently scoped and defined for the community to determine logical outgrowth and the potential for unintended consequences. \r\n\r\nAdditionally, it's not clear how the scoring method would apply to deposit accounts held in smart contracts. \r\n\r\nThirdly, raising awareness on the risk profile of a certain address doesn't necessarily solve the problem. Fraudsters can create new wallets using the same \"fraud' once profiled. \r\n\r\nFinally, assessor believes that metadata and transaction behavior are too abstract and not the most relevant inputs for individual, custodial wallets given that many instances of fraud are unintentionally \"permitted\" and therefore technically valid. It may seem arbitrary, but with the right parameters consumers could be entrusted with scoring. The solution should capture prevalent \"types\" of fraud and raise community awareness. ", "q1r": 2, "q2": "The proposal gives the duration or amount of time specific tasks will take, but it's not clear whether they can be pursued concurrently, where there are interdependencies, and how long the overall project will take to complete. ", "q2r": 3, "assessor": "z_assessor_716", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "An innovative idea that would create a paradigm shift in Defi space if well implemented, the proposer outlines exactly the role of such a solution in Cardano's space and its positive effect on the community and mainly other projects.", "q0r": 4, "q1": "The team provided links to Linkedin pages of the main members and a link showing that they have been part of the PLUTUS first cohort. They also present a clear roadmap with specific goals and outlines to what needs to be done. Furthermore, they added a Faq section that talks about questions the voter might ask themselves. On the other, the technical specifics of the protocol were not shared or explained in detail.", "q1r": 3, "q2": "The team prepared a very detailed list of the needs of this project and its budget allocations. They also prepared a roadmap with different milestones that are clear and will allow the community to assess their development.", "q2r": 4, "assessor": "z_assessor_768", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Разработать Оракул оценки рисков. Публичный веб-сервис для прогнозирования риска мошенничества для данного кошелька, т.е. принадлежит ли он мошеннику.", "experience": "Пионеры Plutus, пионеры Atala PRISM. Создал и разработал расширения для сайта croesus-blockchain.com для успешных предложений Fund 5 и Fund 6."}