{"id": 383400, "author": "christophe.hoche", "title": "Real Estate Fractional Ownership", "url": "https://cardano.ideascale.com/a/dtd/383400-48088", "category": 26233, "amount": 25000, "description": "Недвижимость является крупнейшим классом активов в мире. Но большие объемы и низкая ликвидность объясняют, почему доступ к \"лестнице недвижимости\" затруднен.", "funded": 0, "upvotes": 22547735, "downvotes": 22369682, "votes_result": 178053, "votes_cast": 312, "f6_no_assessments": 5, "f6_rating": 2.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "Здравствуйте, избиратели Ады! Прочитав предложение и изучив сайт https://www.the-entr.com/, я думаю, что идея дробного владения недвижимостью, приносящей доход, и возможность использовать свое дробное владение, оставаясь в помещении, является идеей, которая, несомненно, станет Boost Defi на Cardano! Это потому, что недвижимость - это лего в финансах, которое богатые люди использовали для поддержания и увеличения своего богатства на протяжении всей истории. Дробное владение, как указано в предложении, облегчит каждому участие в этом удивительном средстве создания богатства. По моему мнению, в этом предложении может не хватать определенных областей, однако его влияние может стать действительно экстраординарным вариантом для предложения на блокчейне Cardano! Я хочу обязательно отдать должное этой идее, особенно видя, как они обратились к слону в комнате, когда дело доходит до фракционирования недвижимости, а именно к проверке личности. Сотрудничество с Cardano для использования призмы Atala является ключевым в том, чтобы сделать недвижимость действительно доступной для масс.      ", "q0r": 5, "q1": "Что касается опыта команды разработчиков предложений и членов команды, я уверен, что у них есть все необходимое, чтобы сделать то, о чем они говорят, как указано в их плане здесь - \"Следующим шагом будет создание ликвидности, и для этого мы хотим построить вторичный рынок. Технология блокчейн\" Но что лишило их уверенности, так это то, что они указали, почему создание вторичного рынка и ликвидность важны, но они не вдавались в технические аспекты того, как будут использоваться средства для этого, и мне было неясно, будут ли средства использоваться только для ликвидности или они будут использовать часть средств для создания рынка? Я думаю, что важно иметь больше прозрачности в отношении времени, которое потребуется, чтобы увидеть готовый продукт, и того, куда будут направлены средства. Также было бы полезно получить некоторую информацию о команде разработчиков предложения и их роли в этом, чтобы представить, как это предложение будет реализовано.", "q1r": 3, "q2": "Что касается возможности провести аудит предложения, то у нас нет четких временных рамок или мильных камней для проведения аудита предложения. Возможно, я что-то упустил, но мне план показался больше похожим на презентацию, чем на план. Если я действительно что-то упустил, я надеюсь, что этот обзор будет отмечен, поскольку я очень высоко оцениваю влияние этого предложения, но нахожусь между молотом и наковальней, поскольку моя работа заключается в том, чтобы быть беспристрастным в этих обзорах и быть верным избирателям. Я бы хотел, чтобы автор добавил больше информации о проверяемости этого предложения, потому что, к сожалению, единственное, что мы можем проверить, это возможность создания рынка, и у нас нет четкой временной линии, когда это произойдет, поэтому я должен поставить этому предложению оценку 2 по причинам, которые я указал выше.", "q2r": 2, "assessor": "z_assessor_766", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal focuses on fractional ownership of the fully managed real estate to lower the entry amount, remove non-monetary friction and facilitate liquidity. Since the detailed plan was not well-prepared [no goal, no roadmap, no KPIs/metrics, no risk, and mitigation]. As a result, potential impact can not be seen. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1. ", "q0r": 1, "q1": "There is not much information provided, as mentioned, there is not much proof of feasibility to evaluate. As the proposer said that \"This is a complex project with multiple components\", and fractional ownership in the real estate required more detail [in the plan] than this. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "As mentioned, since this proposal is incomplete [no profile description and links for verification, doesn't have any roadmap or KPIs, the budget structure is not defined, and the risk is not defined], transparency is at a low level, especially for a complex topic of there is not much proof of feasibility to evaluate. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Real estate fractional ownership and crowdfunding real estate future is definitely a future trend and cryptocurrencies may play a big role in there. Decentralized finance may also play a big role, but unfortunately the proposal does not clearly explain how the plan addresses this specific challenge.", "q0r": 3, "q1": "The team has proven track record in the \"fractional ownership\" business, but unfortunately technical competence is not sufficiently presented in the proposal.\r\nThe plan is very generic and not detailed enough to assess the likelihood of the proposal to be implemented successfully. It is not explained sufficiently how the budget will be spent.", "q1r": 2, "q2": "Information to audit the progress and the success of the project are not presented in the proposal.", "q2r": 1, "assessor": "z_assessor_685", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposer has a background in real estate agent management from Paris. The proposal is to have a brilliant idea to apply Atala PRISM for DID and based on the Cardano blockchain. The real estate buyers will share a portion of an actual real state, and there is a platform going to manage to collect the rent and manage the rental's maintenance. The reality is that real estate in the top 10 cities worldwide is highly unaffordable for most average income earners in those cities. If the project formed a more explicit correlation between ADA holders and real estate businesses and streamlined the earning and assurance module, then the project model would ultimately be a high-value use case project.", "q0r": 4, "q1": "I believe the proposer a bit rush in writing the proposal to submit. Therefore, the deliverable elements are not provided clearly and are close to being omitted. I provide two quick links below that might help you rewrite and do more research and comprise data for next month if you wish to carry on with your journey.\r\n(Short version) https://t.me/ProjectCatalystChat/60411 or (extended version) https://cardanocataly.st/en/proposers/ \r\n", "q1r": 1, "q2": "With a $25,000 project requested, there is no information on how the project could be carried out and who is going to be involved. It is genuinely impossible for the community to view the challenge team to monitor and report your project progress. Should you refer to the two links provided in the feasibility box if you ever wish to rewrite and resubmit in the future fund rounds.", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies an avenue to boost cardano's defi through fractionalizing real estate. The goals align with the challenge however the goals  are not clearly defined and so it is difficult to determine exact aligment.", "q0r": 4, "q1": "The team appears to have good experience in real estate however there is no reference to experience with plutus, smart contracts or fractionalised tokenisation and so that coupled with no comprehensive breakdown of funds makes the feasibility of this project low.", "q1r": 2, "q2": "No roadmap, KPIs or defining of what success looks like makes this project impossible to audit. ", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Мы предлагаем дробное владение полностью управляемой недвижимостью, чтобы снизить сумму входа, устранить неденежные трения и облегчить ликвидность.", "experience": "Обширный опыт в области финансов и права, накопленный за более чем 25 лет работы в банках, и личный опыт инвестиций в недвижимость в разных городах"}