{"id": 383622, "author": "austin.m.negron", "title": "anetaBTC, decentralized wrapped BTC", "url": "https://cardano.ideascale.com/a/dtd/383622-48088", "category": 26233, "amount": 45000, "description": "Для полной оптимизации потенциала Cardano DeFi мы должны иметь протокол, который разблокирует ценность Биткойна на Cardano.", "funded": 1, "upvotes": 96594383, "downvotes": 12247294, "votes_result": 84347089, "votes_cast": 822, "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Предложение направлено на реализацию решения для обертывания BTC, которое получило название anetaBTC и может использоваться на блокчейнах Ergo и Cardano. Биткойн в настоящее время является крупнейшей блокчейн-сетью на рынке, и многие блокчейны первого уровня выпустили обернутые версии биткойна, чтобы его можно было использовать в этих экосистемах. Из-за популярности и вариантов использования в DeFi решение, позволяющее легко использовать Bitcoin в экосистеме Cardano и Ergo, вероятно, будет иметь большое влияние. Команда разработчиков предложения упомянула и рассмотрела другие протоколы Bitcoin, такие как wBTC, который в настоящее время используется на Ethereum. В своем техническом документе они описывают некоторые ключевые различия, главным из которых является то, что anetaBTC не является кастодиальным, что помогает предотвратить риск третьей стороны. Такое понимание рынка и сильные стороны их решения по сравнению с существующими помогают предоставить дополнительные доказательства потенциального влияния и принятия этого решения.", "q0r": 5, "q1": "Команда не указана в их предложении, однако если вы посетите их сайт, то сможете найти команду, причем у некоторых из них добавлены профили в LinkedIn - https://www.anetabtc.io. Не предоставлен ни бюджет, ни список задач и временных затрат на каждый этап реализации. Некоторые из профилей технических специалистов дают умеренное представление о том, что они обладают достаточным техническим опытом. В предложении или на их сайте нет Github или репозитория кода, что было бы неплохо увидеть для подтверждения их опыта в данной области. В предоставленном документе подробно описаны сравнения между wBTC и anetaBTC и объяснены некоторые архитектурные особенности, что помогает доказать компетентность команды. Для получения более высокой оценки было бы неплохо получить еще более подробные сведения о биографии команды или репозитории кода, чтобы быть уверенным в том, что это предложение выполнимо, так как предложенная сложность предложения высока. Также необходимо было бы представить разбивку бюджета, чтобы показать, на что идут ассигнования.", "q1r": 4, "q2": "Ясность предложения соответствует хорошему стандарту благодаря предоставленному информационному листу и пояснениям в самом предложении. В предложение не были включены цели успеха или KPI. Команда разработчиков предложения пишет статьи в блоге, делясь информацией о проекте по мере его реализации, что облегчает поиск информации о том, что происходит в команде проекта. Было бы хорошо добавить больше информации о том, какие части проекта будут с открытым исходным кодом и когда для этого проекта, чтобы сообщество могло провести аудит технической реализации. Некоторые KPI, специфичные для того, где anetaBTC может быть впервые интегрирована, также дали бы больше уверенности в том, что сообщество сможет провести аудит влияния этого предложения после его завершения.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of bringing the value of Bitcoin to the Cardano ecosystem. They will ad value to the Cardano ecosystem by enabling Bitcoin holders to bring their BTC to Cardano Defi. Their key metrics align with the challenge in the sense that they will drive BTC holders to Cardano Defi. The proposal is able to scale as wrapped BTC is essential in Defi.", "q0r": 5, "q1": "The relevant skills and team has been provided in a linked medium article. It's hard to track some of them down. It would've been beneficial to ad linkedIn or Github pages to make that process easier for the reader. They have been bootstrapping up until now so 100% of the budget will go to the research and engineering team. The release of version 1 is Q1 2022 which is around the corner and sensible. They provided a link to a lite-paper on Medium that delves into the technical details of how and what is getting built.  They haven't provided a list of risks considered, but since the community will be able to vote on protocol changes they will be quite resilient to anything that surfaces in the future.  ", "q1r": 4, "q2": "They provided a roadmap with milestones in the linked document. They have KPIs in their Roadmap as well as a section where they list future tasks and additions making it very easy to track the performance and progress of this project. The problem they address is bringing BTC value to Cardano Defi and they solve it by building a wrapped BTC product that enables users to unlock their BTC value in Ergo and Cardano.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 27, "ne": 3, "ng": 24, "nfo": 0, "vca_o": 1}, {"q0": "This proposal matches the challenge brief very well in that it would use a bridge to enhance cross-collaboration and usecases across different protocols.", "q0r": 5, "q1": "The team provides an active twitter account that has a decent following and can be used as proof of prior work and to see if the team has an active following, which it seems they have. They also provide references for prior work and a very good overview on their base principles and how their skillsets as a team is distributed between engeneers and researchers. The way that the team is able to describe the technical information for the assessors and voters is very well thought out which I find very important. I find that it is highly likely that this team and this proposal would be a great addition to the Cardano DeFi network.", "q1r": 5, "q2": "Team has provided enough and important information about their related skillset, their prior work and the technical relation and reasoning for this project. The roadmap and actionable steps can be found through the provided link on Medium, which is where the team provides additional information on their protocal, team and progress of the project. I´m deducting one star of the rating, because the budget itself is not broken down. This is necessary for this community, even with a promising project so that new as well as established community members provide transparency and trust within our community for future funding rounds.", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "The Cardano ecosystem really needs a protocol to unlock the value of Bitcoin on it as the problem in this proposal mention. And as the solution and its detailed explanation, I think it can help to make it. \r\nBut the proposer needs to show some key metrics or KPIs that the team will focus to complete. \r\nBy the way, the idea is very simple and clear, that's the reason why I rate 3 out of 5 even not having key metrics. ", "q0r": 3, "q1": "As their technology explanation, it's not too simple to estimate what their work will do. Hence, wish that they can add a more detailed roadmap to the proposal to help us assess whether the required budget is reasonable or not, and the feasibility of their implementation plan. \r\nMoreover, there is no info of the team attached to the proposal, except the interview video. As a normal user that not familiar with the founder, we cannot measure how much we can trust him and his team. So, my advice is the proposer should provide some team info. \r\nEven it a vital idea, but lacking of a lot of above info, so I have to rate 2. ", "q1r": 2, "q2": "The proposer does not provide enough materials for auditing the project, including a detailed roadmap of implementation, key metrics, or KPIs. \r\nMoreover, the proposer didn't provide any relevant risk to their project.\r\nAbout the problem and solution, the proposer shows that their team has well aware of the market context and their solution can help us explain clearly and clarify what will help to solve it.\r\nTo me, I really need to see this idea come real, but the proposal lacks a lot of info for having a high rate. ", "q2r": 2, "assessor": "z_assessor_671", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aims to trustlessly (through smart contracts) wrap bitcoin for availability for use on the Cardano and Ergo blockchains. This proposal clearly identifies a problem that would be very beneficial for the Cardano defi ecosystem; to be able to tap into liquidity from the Bitcoin blockchain, this would be a major kickstart for migrating and gaining TVL on chain for the Cardano defi ecosystem as a whole. I feel like this proposal aligns very closely to the challenge of \"Boosting Cardano's defi\".", "q0r": 5, "q1": "The team that is listed on the whitepaper is clearly qualified to undertake the task set forward in this proposal, the proposer clearly outlines the individuals involved with the project and provides references as to current and previous academia.\r\nThe asking budget seems very reasonable for the task at hand, however a more detailed breakdown of the funds is lacking. All in all I feel the timeline given for the tasks to be completed is also very realistic and achievable. ", "q1r": 4, "q2": "The proposal does have a fairly detailed roadmap in the form of an image, and all the time lines given seems reasonably achievable. Although KPI's would be a valuable gauge in progress which currently aren't listed. In conclusion this proposal very clearly understands the problem at hand and seems to have a viable and achievable solution to the problem. ", "q2r": 4, "assessor": "z_assessor_858", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Because of the references (Xclaim, Ren, Interlay) this proposal does effectively address the challenge of the proposal. Technical proposal updates have provided insight into progress (80% renVM protocol integration with native ERGO assets). It would be nice to have more of a gnatt chart style roadmap with milestones and technical progress and would hope this is planned later in development. ", "q0r": 4, "q1": "Due to the merit of the team and the work done so far I agree that the proposal will be implemented successfully. There should be a more detailed whitepaper soon (before 2022) if the public $NETA sale is supposed to take place Q1 2022. ", "q1r": 4, "q2": "The information provided is too high level to be able to audit and, progress is not reported in a systematic way but the team and references included inspire confidence in the project. (The technical updates have shown roughly what team members are working on but with no timelines, it would be nice to have a team breakdown with topics they are dealing with in a table)", "q2r": 3, "assessor": "z_assessor_950", "no_vca": 21, "ne": 3, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "anetaBTC - это децентрализованный, полностью внутрицепочечный, обернутый BTC продукт, который позволяет пользователям беспрепятственно разблокировать свою ценность BTC на Cardano и Ergo.", "experience": "anetaBTC - это протокол, основанный на исследованиях, как и Cardano и Ergo. anetaBTC разработан докторами наук по CS из Массачусетского технологического института, Хельсинки и Москвы."}