{"id": 384797, "author": "realjosiah", "title": "DeFi Crowd Lending & Savings", "url": "https://cardano.ideascale.com/a/dtd/384797-48088", "category": 26233, "amount": 23600, "description": "Решения DeFi должны учитывать уникальную африканскую экономическую экосистему. Решения DeFi не делают достаточно для улучшения финансовой инфраструктуры.", "funded": 2, "upvotes": 145143963, "downvotes": 21968558, "votes_result": 123175405, "votes_cast": 914, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is aligned with the challenge as it's an opportunity to boost &  promote the use of the Cardano, and the DeFi.\r\nIt's also a second phase of a proposal that was funded in previous funding cycle. The first phase was focused on Staking, and now it's the the lending stage.", "q0r": 5, "q1": "Well explained, the objective of the proposal are defined and the system the Crowd lending will work/run. The challenge pointed out by the Proposer is concerning, but meantime they are suggesting solutions. The budget, the timeframe and the team experience combine together allow to think of the success of this current proposal.", "q1r": 5, "q2": "The KPI are stated, while the risks taken into consideration for the success of the project.\r\n", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This proposal very effectively fits the challenge criteria of boosting usage of cardano's defi. I would like to see a little more specifics about which \"stable currencies\" would be used i.e. djed or AGEUSD? Other than that I believe this proposal is very suited for this funding round and challenge.", "q0r": 4, "q1": "The team appears to be more than qualified to successfully implement this proposal given the previous projects the team has worked on, including funded catalyst proposals themselves. \r\n\r\nThe team has demonstrated plenty of experience working with Plutus, and has experience with finance and defi products.", "q1r": 4, "q2": "Love the roadmap, I think the milestones are both reasonable and fit the criteria I would expect from a successful proposal. PAB integration and a completed transaction will be crucial as a KPI. I would like a little more detail from the other milestones but other than that this proposal is very auditable.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The problem of this project lies in this challenge, and I think that its saving and lending model will help a lot to the unique African economic ecosystem as the proposer mentioned in the problem statement. The info about why they built this idea on Cardano blockchain with their key metrics also proves that the proposer really understands the challenge setting and helps their idea to come with it. \r\nIn addition, after one step of following their old proposal in fund6. I think this idea will strongly impact the Cardano ecosystem and be good for investing in. ", "q0r": 5, "q1": "The proposer detailed roadmap for the MVP product that will run in 6 months that includes UX/ UI design, development but their required budget is only for developers. I'm really concerned about how they can solve the UX/UI design because if you want good design, it can cost a lot of money. \r\nThe good thing is that the team is running their other proposal in the fund6. This can make us believe in their ability - with the team profile included. ", "q1r": 5, "q2": "For the scope of this proposal, I think the detail is enough for audibility. Including the detailed information of the roadmap, the KPIs. Moreover, the proposer also has detailed info about the solution and problem that met, which can help us visualize how it works and assess tasks in the roadmap. \r\nThe proposer is also aware of some technical problems that they will meet and provide solutions for them. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 13, "ne": 3, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Excellent proposal, I hope to see it implemented. I think you are trying to solve a real problem using DeFi and you are within the challenge. If implemented and successful, it would generate a significant impact. Although the proposal is focused on Africa it could clearly be extended to the rest of the world.", "q0r": 5, "q1": "I understand that the proposal is very likely to be successful. Provides detailed information on the main members of your development team. I can infer that there is a serious and experienced team. It is a realistic proposal and the budget is reasonable. I wish I could see it working.", "q1r": 5, "q2": "The information is relevant and detailed, the proposal is very good, although the work plan is not clear, it mentions a phase 0 in 6 months ... then? .... How can we audit or follow up on your proposal. In other words, I believe that a more detailed roadmap is necessary.\r\nI hope these little tips help your project to be successful.\r\nGreetings", "q2r": 4, "assessor": "z_assessor_743", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "DeFi Wallet, который предлагает ассистент сбережений и крауд-кредитования (Ajo) для получения кредитов через стабильные активы на основе валюты, сохраняя при этом капитал.", "experience": "Наша команда имеет совокупный 35-летний опыт работы в области блокчейна, финансов, бизнес-аналитики, африканского бизнеса и создания масштабируемых приложений."}