{"id": 385142, "author": "appliedblockchain", "title": "Confidential Computing Oracle", "url": "https://cardano.ideascale.com/a/dtd/385142-48088", "category": 26233, "amount": 50000, "description": "DeFi ограничивается собственными активами в сети. Интеграция активов вне сети требует доверия к людям и обмена конфиденциальной информацией.", "funded": 1, "upvotes": 70540459, "downvotes": 7507861, "votes_result": 63032598, "votes_cast": 410, "f6_no_assessments": 8, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The application of blockchain tech \"silent data\" addresses at least at the outset an established area of business finance - factoring of commercial invoices. A big source of liquidity for many companies. From that starting point, the proposers Applied Blockchain can extend the oracle to other off-chain assets. Extending the impact. Getting Cardano into this aspect of oracles and by extension smart contracts can have big impact on adoption", "q0r": 5, "q1": "That Applied Blockchain has at least two major clients Lloyds Register and by video evidence satisfied customers, and SHell's investment in the company, there is strong reason to believe their claims \"We've deployed 100+ blockchain smart contract DApps: NFT marketplaces, DeFi protocols, project launchpads, derivatives trading platforms.\"", "q1r": 5, "q2": "Deliverables are clear and can be audited. \"Successful technical integration and deployment of SILENTDATA confidential computing oracle with the Cardano testnet and mainnet.\"\r\n\r\n\r\n\"Successful onboarding of Cardano liquidity pools and providers to finance off-chain assets presented through the SILENTDATA confidential computing oracle.'\r\n\r\n\"Great success will mean achieving 2 and 3 in large numbers.\"\r\n", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 24, "ne": 6, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The is a great idea, the proposal clearly articulates how their project addresses the challenge goals and how the project will add value to the cardano DeFi ecosystem. SILENTDATA seems like a promising development that will enable a new level of transparency into the finances behind our favorite DeFi projects. Potentially opening new markets to DeFi, with this proposal's method  to verify ownership of off-chain assets. I look to following the progress of this proposal. ", "q0r": 5, "q1": "The road-map is aggressive and plan to bring their product to market with in a reasonable time frame. The proposers seem to have abundant wealth of experience with DApp development and with their detailed development plans shows that the proposal is highly likely this proposal will be implemented successfully. But the budget breakdown is weakly described and should be more detailed discussing to the funds will be used", "q1r": 4, "q2": "The proposal's well defined timeline and KPIs that the community can used to measure the success of the project, but the definition of success for the proposal is broad and could be refined to describe more definitive milestones for success. The proposal clearly intends to maintain transparency with the community and the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_338", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Expanding the DeFi to off-chain assets may help boost the use of Cardano's DeFi as it'll grant access to new types of people.\r\nAs such, I agree that this proposal aligns with the challenge.", "q0r": 5, "q1": "The proposal plan seems realistic as presented. The budget doesn't give much details beyond the two budgets lines presented by the proposer. Would it be possible to draw explain on what some numbers will used for? So, it may help even people who are not familiar with the technics used, to at least understand the use of the requested funds.\r\nAlso, I support some comments brought up by other people who read this proposal as they question: ''Can NFT's be used to prove ownership of off chain assets? Maybe I'm reading this wrong but wouldn't the NFT have to be recognized as legally binding proof of ownership? Say I use a NFT proof of  ownership of an off chain asset for collateral for a loan. Once I have to loan what would stop me from selling the off chain asset? \r\nFor example, if factoring receivables, how would a DeFi lender know that the issuer hasn't already pledged the assets to someone else?''\r\nProvide elements to those questions may give a great insight about the proposer.\r\nNothing is mentioned about the team. Are you taking this on yourself?", "q1r": 3, "q2": "I think the auditability of the proposer would be done as people will start using the system, but a progress follow up is till important, so the community would be aware on what's taking place. This is not mentioned in the proposal.\r\nThe potential risks related to the implementation of this system would be necessary to be revealed.\r\nKPI, roadmap are clear.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal wants to generate off-chain proofs of private data, which will allow this sensitive information to be issued as an NFT and be onboarded onto cardano. Defi should not be limited to on-chain assets and this proposal very successfully addresses the goals of this challenge given the company already has a working API on their website with documentation.", "q0r": 5, "q1": "The company SILENTDATA appears to be legitimate from their website, although I would like to see some links to the team behind it in the proposal and what technical backgrounds they have to deliver on the roadmap specified.\r\n\r\nA few social media profiles would help greatly with this effort!", "q1r": 3, "q2": "The proposal has included a detailed roadmap with specific KPIs posted for month 2,4,5,6 milestones and I fully agree with the success definitions laid out by the proposal as written. Onboarding off-chain financial assets will be mission critical as most of the financial world is still off the blockchain and would be integral to determining the success or failure of this proposal.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This project will help enable DeFi protocols to finance off-chain assets without sharing any sensitive data that will help to solve the limitation of DeFi to native on-chain assets. And this is within the challenge. \r\nInstead of having a specific part for describing how this project \r\n will help to grow Caradano ecosystem, the proposer includes it in the \"Definiting success\" part of the proposal. And all these tell that it will strongly impact the Cardano ecosystem if the project succeeds. Moreover, all of these successes are aligned with the challenge settings. ", "q0r": 5, "q1": "The proposer provides a short roadmap with single lines with every single milestone that I think they should outline in more detail for helping us to assess the reasonability of the budget breakdown. Moreover, the budget also should be more detailed instead of just total numbers for group tasks.\r\nProposer provides a detailed explanation about their feature and technology under, hence we can well understand that they have well understood about what they will do. \r\nLastly, there is no referral link to share the info of the team member.", "q1r": 3, "q2": "The proposer shows a roadmap with a timeline that I think is realistic to develop. And their success definition also helps us to audit the project. I just hope that they can have a more detailed roadmap to show. \r\nThis is an essential idea for the development of DeFi in Cardano ecosystem, and they've also described in detail their solution in the above part of the proposal that I believe is clear enough to help us assess their goal. \r\nLast but not least, as their experience in blockchain development, I think they can aware of some risks to show but there is not in this proposal. Hope that they can control to overcome any incoming risks. ", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 14, "ne": 6, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Decentralized finance clearly needs this kind of infrastructure innovation. And while the actual user base will define which of the idea ultimately wins, this specific data oracle idea is definitely worth experimenting and trying. It addresses the challenge very well.", "q0r": 5, "q1": "Both the team and SILENTDATA concept has a good track record. Cost breakdown could be in better detail, but the roadmap is convincing and idea is clear.", "q1r": 5, "q2": "The information to audit the success is very evident and clear, based on the specifics and expectations of this project.\r\nHowever, the information to audit the progress is not presented in sufficient detail. The lack of in-progress auditability information is also reflected in the cost breakdown, which could be in more detail, which in turn would make the progress better verifiable.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Hi!!...In this case, the challenge is to boost DeFi on Cardano. This proposal is within the objective and is a GREAT IDEA!!!, clearly trying to solve a problem that is within the challenge.\r\nAs a recommendation, I would say that although the problem statement is concise and precise, in the solution of the problem it is not very descriptive, you speak of SILENTDATA but perhaps you should describe this project a little better; mention its URL to better understand the project, also include images and graphics if possible. In the description you must mention that SILENDATA is an Applied Blockchain product and its URL. These are just a few suggestions that I hope can help you.", "q0r": 5, "q1": "In my opinion, it is important to know that it is a project with a lot of progress, that is, with good prospects for success, large companies and organizations appear on its website, as well as awards, recognitions, etc. Very interesting.\r\nAlthough all this is not mentioned here.\r\nThe proponent does not mention enough information, although it exists but needs to be investigated.", "q1r": 4, "q2": "The deadlines established in the roadmap seem achievable.\r\nThe budget mentions two items of $ 25,000 but I think it could be more detailed, more disaggregated.\r\nI recommend that you provide project progress information on your website or some way to track progress.\r\nGreetings", "q2r": 3, "assessor": "z_assessor_743", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Offchain asset is very important for Defi and the proposers have correctly identified the need and try to address that. So Oracles are necessary and that too privacy preserving Oracles will be the future. This is mainly because certain regulatory requirements might mean that the offchain entity cannot share data without privacy grantees. Chainlink is also into this space.", "q0r": 5, "q1": "The plan is very high level and no details about the patent filed. SGX based trustless key generation in cryotography is very well known, so need some details there.\r\nAlso how privacy is going to be guaranteed and wht kind of ZKP will be used is missing in the proposal. Expecting more implementation details. ", "q1r": 3, "q2": "Unfortunately the budget asked and the details provided cannot guarantee auditability. More details will be helpful in understand how the success metrics will be met  ", "q2r": 3, "assessor": "z_assessor_849", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "SILENTDATA - это оракул конфиденциальных вычислительных данных, позволяющий протоколам DeFi финансировать внецепочечные активы без обмена конфиденциальными данными.", "experience": "Мы развернули 100+ блокчейн смарт-контрактов DApps: NFT-рынки, протоколы DeFi, стартовые площадки проектов, платформы для торговли деривативами."}