{"id": 382225, "author": "fhilip.k", "title": "Already Approved Project Challenge", "url": "https://cardano.ideascale.com/a/dtd/382225-48088", "category": 26257, "amount": 250000, "description": "Que peuvent apporter de plus des projets qui ont déjà été approuvés et qui ont réussi à apporter de la valeur à l'écosystème avec un financement supplémentaire ?", "funded": 1, "upvotes": 25461661, "downvotes": 19081337, "votes_result": 6380324, "votes_cast": 176, "f6_no_assessments": 4, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis objective not only does not support the strategic objectives of Fund 8, but also could contradict the objective of growing the number of contributors: preferentially funding already funded means less opportunities for new contributors.\r\n\r\nIn addition, the objectives of the community can be changing from Fund to Fund, for this reason, giving a preference to funded projects could lead to misalignment.\r\n\r\nMoreover, such decision approach could be an example of wide spread decision error - the sunk costs fallacy: https://en.wikipedia.org/wiki/Sunk_cost\r\n\r\nLast but not least, the previously funded proposal can participate in each fund's challenges and have equal rights of participation, so, in the case where supporting them provides high ROI to the community, they can be funded with the current process.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point increasing the risk of misaligned objectives.\r\n- 1 point for the risk of negatively impacting Fund 8 objectives.\r\nMy rating is 1.", "q0r": 1, "q1": "Given that the objective of the proposal is simplify access to funding for previously-funded projects, the Catalyst community is well positioned with regards to skills to address that.\r\n\r\nAt the same time, the fact of the additional funding by itself, doesn't guarantee the additional ROI for the community (one of the assumptions of the proposer).\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discussion about the ability of this approach to create positive impact for the community.\r\nMy rating is 4.\r\n", "q1r": 4, "q2": "The set metric (number of already-funded projects that get additional funding) can track some progress with regards to formal activities.\r\n\r\nHowever, the metric is fully insufficient to track the progress towards the implied problem (ensure more impact from funded projects). To make the proposal stronger, I'd suggest considering the following metrics and ideas:\r\n1) the community ROI of investing in completely new vs previously funded projects.\r\n2) the % of funds distributed to funded vs new projects.\r\n3) the satisfaction of the community with the process in comparison with alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 24, "ne": 7, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "The alignment of this challenge with the Fund 8 Strategic Goals defined to achieve Cardano's mission is a little weak due to the generic nature of the challenge. ", "q0r": 4, "q1": "The funding request is moderate compared to the total budget however previously funded projects generally have multiple challenges in which they can get additional funding. I have my doubts that the Catalyst community has the capacity or desire to give special advantages to entrenched interests which seems to be a step towards centralization instead of a decentralized level playing field. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The metrics and success criteria are adequate to measure progress,", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The idea to have a challenge for already approved project is great to give opportunity to broaden the potential of these project to the fullest. Currently there is litlle space to support the funded team to develop their project more. It's kind of wasting.", "q0r": 5, "q1": "Absolutely, currently there are many team that already funded in previous Fund continue to join the challenges but they have to compete with new commers.", "q1r": 5, "q2": "Beside the criteria \"Number of already funded proposals that are given funding and fullfill their specific metrics\", the challenge need to add some metrics about the next plan or what the project team will to do to continue their success.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I think this challenge is not necessary for Catalyst since funded proposals can continuing submitting their proposals (with additional content/ goals) to the categorised challenges as usual. And if these proposals really stand out in the crowd of new proposals, they will be funded (and we know they are the real deals).", "q0r": 2, "q1": "I don't think this challenge is feasible to implemented because the more Funds will be holding in the future, the more old proposals need to be submitted here - meaning this challenge will change the Catalyst proposing system. ", "q1r": 2, "q2": "Success criteria are not clear here since it just mentions the ending receiving fund again. And key metrics should be added more since it is exactly the same as success criteria.  ", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "importance": "Les projets qui ont déjà été financés doivent à nouveau se distinguer dans la foule des nouvelles propositions. Les projets éprouvés peuvent apporter davantage.", "success": "La réussite est que les projets de qualité reçoivent le financement supplémentaire dont ils ont besoin pour poursuivre ou finaliser leur vision."}