{"id": 383633, "author": "raz", "title": "Film + Media (FAM) creatives unite!", "url": "https://cardano.ideascale.com/a/dtd/383633-48088", "category": 26257, "amount": 150000, "description": "Le marché mondial du divertissement et des médias représente 2 000 milliards de dollars. Un réseau FAM décentralisé pour produire des médias de qualité pour la communauté Cardano est vital mais absent.", "funded": 2, "upvotes": 89066057, "downvotes": 13491556, "votes_result": 75574501, "votes_cast": 460, "f6_no_assessments": 5, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge seeks to onboard a new group of contributors to the Cardano ecosystem with aligns with the Cardano mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The budget is small compared to the total budget and there have been a number of proposals for film and media in past funding rounds so the community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Many proposals join Fund 7 challenges with solution related to film and media, which means Film and Media is already an undeniable ways to develop Cardano community. So far there is no challenge for only videos and media content, this has led to potentially impactful projects struggling to find their place in Challenge that are not quite the 'right fit'. Plus, videos and media is the king of content in current marketing world. If we want to attract more attention and people to join Cardano community, we can not skip the need of pushing videos and media creation.", "q0r": 5, "q1": "The Catalyst community already has many projects on previous Funds that include video and media. So we have experience and people who are pottentially interested in this challenge if it's chosen to be in Fund 8.", "q1r": 5, "q2": "The key metrics are not too detail but quite enough to measure since the topic is not too strange or creative.", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": " \nThe problem needing to be solved has been identified and articulated namely A decentralized FAM network to produce quality Cardano community media is vital yet absent.Also A challenge category for creatives has been absent so far. Diversity + human creativity in the arts can enrich the Cardano ecosystem + more\n \n \nThis is a challenge setting proposal.\n\n \nThis will clearly  add value to the Cardano System\n \nKey metrics and goals of the proposal been stated clearly namely\n# of multimedia projects \n\n# of multimedia platforms\n\n# of multilingual teams\n\n# of decentralised film crews\n\n# of decentralised news teams\n\n# of decentralised content creation teams\n\n# of decentralised multimedia projects sharing resources (eg RAW footage) to avoid unnecessary costs and CO2 emissions from travelling to shoot footage on site\n\nKey metrics and goals of the proposal fall within the scope of the challenge. These include \n\n \nThe proposal can be scaled to address future challenges because more and more film companies, media outlets will get involved.\n\nThis project may have a positive impact on Cardano system. It may also have a negative impact on the environment as film companies are notorious for not caring for environment both on location or in transport of people up and down from locations. Their vehicles are never hybrids and do as many trips as possible rather than pooling, in order to maximise revenue on the transport budget.\n\n", "q0r": 5, "q1": "The basis of the challenge is reasonable and its feasible. Budget is also reasonable. In fact i would increase it to 500,000 - 1000000 at least. Team members are not necessary and neither are profiles since this is a Challenge setting not a proposal per se. Hence I have given this a 4 rating as nothing is lacking on this basis. had this been a proposal of course the above mentioned would in fact be necessary", "q1r": 4, "q2": "\nTHere are clearly defined Metrics/KPIs \n # of multimedia projects \n\n# of multimedia platforms\n\n# of multilingual teams\n\n# of decentralised film crews\n\n# of decentralised news teams\n\n# of decentralised content creation teams\n\n# of decentralised multimedia projects sharing resources (eg RAW footage) to avoid unnecessary costs and CO2 emissions from travelling to shoot footage on site\n \n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 4, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Almost every single human being is now used to watch online contents, mostly videos . Media companies are moving fully on the interwebs, although, there is a clear need for decentralized multimedia organisations. Centralized company's always lead to some sort of censorship, conflicts of interest, and a total lack of transparency in regards to minor shareholders & employees. This is why this challenge could have a great impact and bring many people from the entertainment and creative industry.  \nThis challenge could inspire and trigger creativity in a very good way, and it could definitely increase knowledge and adoption of Catalyst and Cardano in the long run.", "q0r": 5, "q1": "We can't be sure if there is a significant number of people from the entertainment industry in our community at the moment, but we are pretty sure there are many youtubers ! The budget could seem a little bit too low compared to entertainment industry standards, but I have trust in the Catalyst community to try the challenge and beat it. Constraints force us to be creative, and , in addition, almost every traditional media is now attracted to blockchain and NFTs. This is the \"zeitgeist\" now !", "q1r": 4, "q2": "Results should be easy to track and some key metrics have been established for us to audit future projects. Although the only constraint for creativity should be: no constraint at all. Creation is not about numbers; let it roll !", "q2r": 5, "assessor": "z_assessor_146", "no_vca": 20, "ne": 4, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Notwithstanding that some of the goals and objectives of this challenge setting has already been addressed within Catalyst in other categories, any challenge that poised to expand the utility and increased adoption of cardano ecosystem is a welcome development.", "q0r": 4, "q1": "The community comprises members with diverse knowledge, skill and experience to tackle and provide solutions that will meet the needs and objectives of this challenge.", "q1r": 5, "q2": "The success metrics proposed by the challenge is adequate to reasonably monitor and assess the success of the challenge.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}], "importance": "Une catégorie de défi pour les créatifs a été absente jusqu'à présent. La diversité et la créativité humaine dans le domaine des arts peuvent enrichir l'écosystème Cardano.", "success": "Des équipes collaborant équitablement pour produire des contenus multimédias inclusifs et de haute qualité + des plateformes = accroître la connaissance et l'adoption de Cardano."}