{"id": 383995, "author": "catalystadmin", "title": "Catalyst Accelerator & Mentors", "url": "https://cardano.ideascale.com/a/dtd/383995-48088", "category": 26257, "amount": 500000, "description": "Comment Catalyst peut-il exploiter la puissance de feu des professionnels pour créer un environnement d'accélération qui amplifie et commercialise les projets financés ?", "funded": 1, "upvotes": 46633649, "downvotes": 14071907, "votes_result": 32561742, "votes_cast": 227, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposal aims to create additional support vehichles for funded projects. This supports well the Fund 8 goals: grow contributors, grow dev and app ecosystem.\r\n\r\nAt the same time, this initiative can pose a conflcit of interests with the Fund 8 goal of making Cardano into an open-source projects, because commercialization of open-source projects is precieved by investors as having a low ROI. This proposal would be stronger, if it included a specific analysis or plan for how to mitigate this issue.\r\n\r\nI have made the following deductions:\r\n- 1 point for the potential conflict of interests, which could constrain the impact.\r\nMy rating is 4.", "q0r": 4, "q1": "Given the proposed budget of $500k, it is definitely possible to bring new advisors into the ecosystem.\r\n\r\nAt the same time, aiming for professional-grade programmes can be a limitation: the professional programes have a pre-developed pipelines and work methods aimied at maximizing financial output that might not be perfectly aligned with the cardano's mission.\r\n\r\nIn my opinion as a person who worked with a number of mentors and founders who went through acceleration, the proposal can be made stronger by reformulating it more flexibly, such as: make it easier for the funded projects to find skilled advisors or financial resources. This way a broader solution space can be considered and solutions such as an Advisor Marketplace, etc. fit in, leading to more projects and teams finding support.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of analysis of alternative ways to bring knowledge and financial resources to catalyst projects.\r\n- 1 point for the lack of discussion of the sufficiency of funds to provide change for a noticeable % of projects not just few.\r\nMy rating is 3.", "q1r": 3, "q2": "The metrics that the proposal suggests (the number of projects, the number of programmes and investors) can track activities related to the initiative.\r\n\r\nAt the same time, the proposal can be made stronger if it includes metrics tracking the progress on its intent and Cardano community's objectives, such as:\r\n1) the growth rates (users, revenue) of projects that underwent acceleration vs others.\r\n2) the % of Catalyst-funded projects that match the internal criteria of accelerator programmes.\r\n3) the % of open-source projects in accelerator programmes.\r\n4) the % of projects focused on building tools for the developer/app ecosystem of cardano.\r\n5) the sastifaction of the project swith the acceleration in comparison with alternative approaches.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the impact on Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 21, "ne": 5, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This challenge supports the Cardano community objectives as it creates a platform for Cardano startup innovation and blockchain technology co-creation.\r\nAn access to financial, human, and intellectual capital to fuel the success of Cardano and further growth of Catalyst ecosystem.\r\nI Strongly agree for this Challenge to be in the Fund 8 of Catalyst.", "q0r": 5, "q1": "As stated in challenge brief, more needs to be done to provide for the best breed of Catalyst-funded projects by providing pathways into professional business support, investment and mentoring programs. \r\nThe complexity in Catalyst is rising, and this challenge is needed to support this growth. Experiencing Catalyst project for almost a year, I strongly agree that this challenge will spur new creative ways to nurture great collaboration.", "q1r": 5, "q2": "The success criteria and suggested metrics are clearly defined, with four key metrics to easily measure the projects success. Very well explanation is provided under challenge brief, with emphasis on the alignment of the proposal to the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 3, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "This challenges meets the contributors to the Cardano ecosystem aspect of the Cardano mission strategic goals in Fund 8. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "This challenge already exists in Fund 7 with a challenge team which shows that the community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "In general a good challenge proposal. It is pretty clear that the Cardano ecosystem and Catalyst will benefit from mentoring. The societal impact would be bigger if this proposal did not only focus on businesses.", "q0r": 4, "q1": "As the proposer is the Catalyst Admin, I am sure a challenge team is available. The metrics are sufficient, however they could focus on more than just businesses to provide a wider variety of solutions. It can be expected that solutions will be provided in a timely manner. Overall the Catalyst community should have a good capacity to adress this challenge.", "q1r": 4, "q2": "The metrics are okay and sufficient to provide space for auditability.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "If I read this proposal correctly, it's trying to connect successful proposals to sources of continued revenue and other resources that would help them further develop their projects. I would presume that would mean marketing, or networking, or both, so that they get plugged in to various existing programmes outside of Catalyst. This could work out well for our best proposers and greatly enhance the visibility of Catalyst and Cardano both. I don't know if I'd quite say it's critical, but it's a suitable aim.", "q0r": 4, "q1": "This is a little more complicated and there's much more uncertainty here. Proposers are here, in Catalyst, because it already is a source of funding and community support. While it's agreeable to connect the work done here to the outside, I'm not sure this is something a challenge is best suited to address. We need to ask the question first: Is the goal here, specifically, to do targeted marketing to potential funders? If not, what's the idea exactly? Without questions like this better defined, this challenge could be interesting but I can also see how this might spend a lot of money going nowhere.", "q1r": 3, "q2": "I'd have liked to see more from the metrics here. A question that comes to mind for me is, \"How are we measuring 'quality and strength'?\" Also, how much capital are we hoping to funnel in to Catalyst-generated projects from the outside? Do we want to see projects double their investment? Triple? Or receive anything just so they can say they received anything? Setting well-defined goals can be intimidating because they are a commitment, but to truly gauge the success of a project they are very helpful.", "q2r": 2, "assessor": "z_assessor_853", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}], "importance": "La connaissance est un pouvoir et permettre aux projets d'accéder à un réseau distribué de mentors permettra aux entreprises de se développer plus rapidement.", "success": "L'accès au capital financier, humain et intellectuel pour alimenter le succès des projets financés par Catalyst."}