{"id": 383978, "author": "catalystadmin", "title": "Accelerate Decentralized Identity", "url": "https://cardano.ideascale.com/a/dtd/383978-48088", "category": 26257, "amount": 500000, "description": "Quelles solutions pouvons-nous développer et mettre en œuvre avec Atala PRISM pour avoir l'impact le plus positif et les opportunités de croissance rapide de Cardano.", "funded": 2, "upvotes": 104310346, "downvotes": 6823911, "votes_result": 97486435, "votes_cast": 347, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nDecentralized Identity is a key use case for blockchain and supporting it is fully aligned with the strategic goals of Fund 8: grow the number of contributors and grow dev and app ecosystem.\r\n\r\nHaving said that Decentralized Identity challenge can be also viewed as part of the overall Developer Ecosystem. The proposal would be stronger if it included a detailed rationale why making a dedicated challenge (reducing the potential impact) can have a higher ROI for the community in comparison with a broader challenge, such as Dapps and Integrations.\r\n\r\nI have made the following deductions:\r\n- 1 point for the potentially constrained impact in comparison with broader challenges.\r\n- 1 point for the lack of discussion of success stories to help just about the ROI of the initiative.\r\nMy rating is 3.", "q0r": 3, "q1": "Given that this proposal is based on a known in the community Atala PRISM project and it has defined three specifc areas for proposals (Interoperability between Cardano and Indy anchored DIDs/VCs, Self-governance of Emergent Communities, and Circular Supply Chain), it is generally feasible to implement.\r\nMoreover, because \r\n\r\nAt the same time, because the topic of identity is interrelated with the topic of personal data, which is hyper-regulated in some regions (EU, UK, etc.), providing a brief overview of compliance/regulation reguirements would help understand if a small tech team (without a legal/gov-relations department) can be successful with successfuly completing some of the integrations. At the moment, given the proposal's requested funding of $500k this looks as a noticeable risk for me as a person who has experience working on some digitalization projects with municipal offices in Germany.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of discussion of the impact of regulations on the feasibility.\r\n- 1 point for the lack of historical success stories, helping to judget which resources are needed/sufficient to achieve a noticeable impact.", "q1r": 3, "q2": "The proposal defines some metrics that can help measure the progress (the number of issuers, verifiers, etc.), but some of them are very ambiguous: \"The sum of realized production pilots or launches in 2022\", \r\n\"Discovery of repeatable patterns in use-cases\", etc. For example, how do we define a pilot? What should be considered it value? What should be considered as a repeatable pattern?\r\n\r\nIn addition, the proposal could be stronger, by considering metrics that can help justify the imapct of the challenge on the community:\r\n1) The % developers working with Identity out of all Cardano developers.\r\n2) The % users that are exposed to Cardano through identity solution out of all cardano users.\r\n\r\nAlso, some metrics helping to judge the competitiveness and the developer/user satisfaction of the solutions could help:\r\n1) The developer/users satisfaction with the identity services provided in comparison with competitive solutions.\r\n\r\nI have made the following deductions:\r\n- 1 point for the ambiguity in the metrics.\r\n- 1 point for the lack of metrics to evaluate the relative impact on the community.\r\n- 1 point for the lack of metrics evaluating the user/developer satisfaction and the competitiveness of the solutions.\r\nMy rating is 2.", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 19, "ne": 4, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "The challenge is an extension of Atala PRISM Program and evolutionary step in the mass decentralized identity (DID) development. \r\nIt's success is critical for Cardano mission.\r\n", "q0r": 5, "q1": "An extensive list of focus areas for new ideas are written  to be developed under this challenge. Today's difficulties, in different areas, are stated and explained for better understanding of the challenge. \r\nThis challenge can help pair creative ideas with good experience and expertise. ", "q1r": 5, "q2": "Key metrics are well outlined, for the challenge itself as well as for individual projects. Primary objectives for future projects are defined as three key areas for faster refinement. \r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The challenge meets 2 or the 3 Fund 8 strategic goals and Atala Prism DID adoption have been identified many times as a cornerstone to Cardano's mission.", "q0r": 5, "q1": "The lack of Atala Prism still not going live for the general public despite funding for this challenge for the last 2 rounds is an issue however access to the platform has been provided to funded proposals so the community can address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}], "importance": "En identifiant les qualifications de grande valeur, nous pouvons établir des fondations de cadres de gouvernance pour lancer des programmes pilotes et stimuler la croissance.", "success": "Découvrez des modèles reproductibles qui nous permettent d'exploiter l'infrastructure décentralisée de Cardano. Identifier les informations d'identification de grande valeur."}