{"id": 384227, "author": "wadalliance", "title": "Grow Africa, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/384227-48088", "category": 26257, "amount": 250000, "description": "Comment continuer à faire germer et croître Cardano en Afrique en 2022 ?", "funded": 2, "upvotes": 108198356, "downvotes": 10641759, "votes_result": 97556597, "votes_cast": 465, "f6_no_assessments": 7, "f6_rating": 4.476190476190476, "videos": [], "media": [], "f6_assessments": [{"q0": "The objective of this challenge - to grow the adoption of Cardano in the region with a population of more than 1.2 billion people - is fully aligned with Fund 8 strategic goals: prepare people willing to make contributions and grow the dev & app ecosystem.\r\n\r\nAt the same time, the proposal would be stronger if provided an overview of recent success stories and a list of use cases that can be the high impact targets (regulatory readiness, demand, readiness of tech infrastructure, etc.) of growth for the Cardano.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discusion about the ability to achieve a noticeable impact.\r\nMy rating is 4.", "q0r": 4, "q1": "The Catalyst community is well positioned to onboard new users and developers into Cardano ecosystem, so the challenge is feasible.\r\n\r\nAt the same time, the proposal could be stronger if it provided an analysis of historical success case to help estimate the impact possible for the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific growth use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal names some metrics (the number of developers, user activity, etc.) that can help track progress.\r\n\r\nAt the same time, the proposal could be stronger if it considered some of the following metrics to track the impact on the Cardano ecosystem:\r\n1) the % of users in cardano ecosystems coming from Africa.\r\n2) the % of developers in cardano ecosystems coming from Africa.\r\n3) the % of users of app developed by developers from Africa.\r\n4) the satisfactions of users onboarded through this initiative vs alernative channels.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 5, "ng": 8, "nfo": 10, "vca_o": 1}, {"q0": "This project could be the game changer for the expansion of Cardano operations in Africa, especially when the expansion process is mainstreamed into the development agenda", "q0r": 5, "q1": "There is an aggressive cadre of young people in African yearning for change from business as usual. This motivation is good leverage for mobilizing youth action for change from the local to national governance processes ", "q1r": 5, "q2": "The proposed metrics are very good indicators. They are specific, realistic and can be measured to monitor progress of success.", "q2r": 5, "assessor": "z_assessor_1018", "no_vca": 30, "ne": 3, "ng": 16, "nfo": 11, "vca_o": 1}, {"q0": "This challenge has already occurred in Funds 5 and 6 plus there was a \"Defi and Microlending for Africa\" challenge also in fund 6. A number of good proposals have been funded (and re-funded) during these challenges and the teams created should be able to compete in non-regional challenges such as \"Boosting Cardano's DeFi\" and \"Community Events\". So although Africa is a critical region for Cardano to develop i don't believe it needs this specific challenge to happen again.  ", "q0r": 3, "q1": "The community has already demonstrated that they can address this challenge with a number of successful proposals relating to Africa being funded in previous rounds. ", "q1r": 5, "q2": "A number of relevant and measurable criteria is proposed. Given this would be the 3rd iteration of this challenge, perhaps some new metrics should be added e.g. Increase in users of live projects", "q2r": 4, "assessor": "z_assessor_125", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The challenge brings African contributors and developers to the Cardano ecosystem which achieves the Cardano mission and two strategic goals.", "q0r": 5, "q1": "There is an active Cardano community in Africa which has the capacity to address the challenge and the fund request is moderate.", "q1r": 5, "q2": "Success criteria and metrics are reasonable should include number of new users onboarded in addition to developers. Sort of alluded to in local impact but not specified.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "As with the other localisation challenges, this challenge is very important  for Cardanos mission. It is vital to continue this challenge to support ongoing efforts. Feedback @WADA: I understand you do not want to apply for funding being afraid of the proposal not being voted on, however I hope with the growing size of the funds, as what you are currently demanding is less than 2%, which should be less than enough for an entire continent. This challenge will also have a huge societal impact.", "q0r": 5, "q1": "The local Cardano Community has shown more than once that they are able to adress this challenge with high quality proposals. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 5, "q2": "The metrics are well-set and should enable good, qualitiy proposals in this challenge that are verifiable.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Focusing on Africa is part of Cardano's mission. Therefore, I agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 4.", "q0r": 4, "q1": "Community members who come from Africa are increasing through time. As a result, the Catalyst community has the capacity to address this challenge, as result, many potential challenge teams are ready, I suppose. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "I was convinced by the proposed suggested directions and metrics that are logical to measure progress in addressing this challenge. Therefore, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "This is a good challenge that addresses the issue of cadano adoption in Africa, in my opinion.\r\n\r\nExcept for fun6, this challenge has received financing and votes in the past, and I don't think that should be the end of it because Cardano's purpose of assisting in the development of Africa has not yet been fully realized.\r\n\r\nIf this challenge is approved, I believe it would pave the road for future African project submissions, as well as the adoption of Cardano in various African countries. ", "q0r": 5, "q1": "When this challenge was voted on in the past, the cardano ecosystem and project catalyst attracted a significant number of African proposals.\r\nAs a result, it's a clear indicator that, once voted on, this challenge can be addressed by the community, as there are still some African proposers with recommendations for Africa's development in the ecosystem. ", "q1r": 4, "q2": "The essential metrics are correctly set to track progress in addressing the challenge.\r\nThe amount of new African projects, as well as other indicators, can be watched by the community.\r\nI don't believe these measures are difficult to track. ", "q2r": 5, "assessor": "z_assessor_933", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}], "importance": "Le défi \"Grow Africa\" est au cœur d'une initiative clé de Cardano, l'expansion en Afrique. Permettez à Catalyst de soutenir également cette initiative.", "success": "Cardano est la blockchain de choix en Afrique d'ici 2023.\nLes projets et les développeurs en Afrique ne seront pas isolés, mais en réseau et en croissance."}