{"id": 384502, "author": "joey.chessher", "title": "Reaching the Business Community", "url": "https://cardano.ideascale.com/a/dtd/384502-48088", "category": 26257, "amount": 200000, "description": "Comment influencer la communauté des affaires pour qu'elle utilise la blockchain Cardano, ses produits et ses ressources pour le prochain projet ou produit de l'entreprise.", "funded": 1, "upvotes": 37427098, "downvotes": 22309651, "votes_result": 15117447, "votes_cast": 182, "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nA broader adoption of Cardano among businesses can increase the number of developers and apps and thus support the Fund 8 strategic goals: grow the number of contributors, grow the app and dev ecosystem) \r\n\r\nAt the same time, the proposal does not provide a rationale, why a dedicated focus on business applications in comparison to consumer or government would provide a higher ROI to the community.\r\n\r\nIn addition, it is not clear if the proposers considered the intersection with other proposals, such as Business Solutions.\r\n\r\nLast but not least, it is not clear if the same activities cannot be done as part of regional-growth focused projects (grow LatAm, grow India, etc.)\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discusion about specific use cases and their impact on Cardano ecosystem.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community has relevant skills and experience to provide additional support to the business community.\r\n\r\nAt the same time, the proposal does not provide a clear vision of the most attractive use cases nor examples of recent success stories to help estimate potential impact from the funds requested. \r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.\r\n", "q1r": 3, "q2": "The proposed metrics are very ambigous (a developed process, adoption by business institution), making it hard to precisely and regularly track the progress of the initiave.\r\n\r\nIn addition, the measures focus on activities rather than on the desired outcomes. The proposal would be stronger if it considered some of the following metrics/approaches:\r\n1) the % of cardano users relying on apps developed by businesses.\r\n2) the volume of transactions coming from apps developed by businesses.\r\n3) the user satisfaction of apps developed by businesses in comparison to alternatives.\r\n4) the number of apps created by business as a direct consequence of this initiative.\r\n\r\nI have made the following deductions:\r\n- 1 point for the ambigious definition of metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 2.", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 3, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "Onboarding existing businesses to Cardano can bring a lot of new people to the  ecosystem. These businesses can be inspired by Cardano. This will certainly help Cardano achieve it's mission. It's not necessarily critical though and some businesses might have to change the way they do business to better fit in with the Cardano mission. Cardano will taint it's mission by onboarding businesses that are/become counter productive to the mission. Not something that is likely to happen, but still a possibility. This challenge setting is also not entirely aligned with the Fund 8 Challenge setting strategic goals. Like Making Cardano open source, evolving developer and app ecosystem and getting more people willing and able to make contributions to the ecosystem.", "q0r": 2, "q1": "The Catalyst community come from all different paths of life and there is a lot of entrepreneurs in this space. Therefore the community definitely has the capacity to address this challenge. This proposal also has a team representing this challenge setting, which will help it get started from the get go. It would have helped to state that they intend on taking ownership of this challenge should it get selected as in the past some proposers never took ownership of their challenge.", "q1r": 4, "q2": "Not a lot of success metrics have been provided which will make it hard to compare the proposals in this challenge to the challenge itself. The two metrics that were provided are very measurable and it would've been nice to see a list of similar metrics. The success criteria involves getting all financial businesses that are exploring blockchain, into using Cardano.  What about the other businesses. Financial businesses makes sense, but you only mention financial businesses in the success criteria, but in the other sections you speak of any business.  So what are the success criteria that involves the other businesses? Providing all the necessary metrics will give proposers a better idea of what they need to aim for.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 21, "ne": 8, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Bringing financial businesses into the Cardano ecosystem aligns with an aspect of Cardano's mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The most obvious type of proposal to address the challenge would be the creation of marketing, advertising and business case material that targets financial businesses. It is a little difficult for community members to represent Cardano as a whole (that is a job for the Cardano Foundation) rather than their specific solution but for the most part the community should be able to address the challenge.", "q1r": 4, "q2": "Key metrics are not worded as measurable items and should be more comprehensive. To improve challenge: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The challenge proposal does not have a big societal impact compared to other proposals. Businesses are already onboarded to Cardano, and what added value this proposal brings to the Cardano ecosystem or how it relates to Cardanos mission remains unexplained. In general, the challenge proposal is far to vague and undefined.", "q0r": 2, "q1": "The challenge proposal is far to vague and undefined to provide room for concrete solutions, as it does not provide enough metrics. This also will negatively impact the variety of solutions that can be provided, as there are just 2 metrics presented. The challenge team is not transparent about who they are.Apart from these deficiencies, it should be possible to expect proposals being delivered in a reasonable time.", "q1r": 2, "q2": "The key metrics are there, however they are very vaguely defined and in general, more key metrics could have been provided", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Great idea but it would be better if you put more details in this proposal since there are several other proposals that sounds very similar to this one, so more details would help the community to determine better. Besides, I personally think this idea can go beyond merely introducing Cardano, it could include creating products/services to strengthen the importance of Cardano in Business Community as well.", "q0r": 3, "q1": "Business Community is one of the communities that desperately need blockchain technologies to clarify and consolidate their business practices. So I'm sure there'll be lots of people/organizations willing to devote their ideas into this challenge.", "q1r": 4, "q2": "Key metrics are still a little vague to me. Perhaps the proposers should provide more detailed metrics like the number of business being approached, number of partnerships created, revenues deriving from these partnerships, etc. Also, it would be nice to clarity uses of the requested fund.", "q2r": 3, "assessor": "z_assessor_936", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}], "importance": "L'expansion dans la communauté des entreprises est essentielle à la croissance. Les entreprises doivent penser à Cardano lorsqu'elles créent leurs prochains produits ou services.", "success": "De nombreuses entreprises financières ont des équipes qui explorent la blockchain.  Le succès serait que ces entreprises utilisent la blockchain Cardano pour leur développement."}