{"id": 381585, "author": "rodes", "title": "ADA 4 Science", "url": "https://cardano.ideascale.com/a/dtd/381585-48088", "category": 26248, "amount": 200000, "description": "科学界の汚職と資金調達により、公共政策や法律は高いレベルで偏った調整された政策を強いられています。", "funded": 0, "upvotes": 15586089, "downvotes": 23639594, "votes_result": 8053505, "votes_cast": 96, "f6_no_assessments": 8, "f6_rating": 2.208333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "ブロックチェーンの分野で研究や論文・出版物の作成に協力したいと考えている研究者をつなぐ場を作ることで、世界中の研究者をつなぎ、この分野の研究の再現や、出版物へのアクセスを容易にすることができます」と述べています。しかし、彼のソリューションでは、政府は政策において科学に依存していると述べていますが、これは通常、国内外で高く評価されている雑誌に掲載されている査読付き論文か、政府の内部論文を指しています。ですから、科学が政府の意思決定にどのような影響を与えるかという彼のビジョンに、彼のソリューションが合うかどうかは疑問です。また、このページがピアレビューを行った学者に報酬を与えるのかどうか、オンボーディングプロセスがどのように機能するのか、この提案者がプラットフォーム上で研究者のデジタルアイデンティティを作成し、他の研究をピアレビューするのに適しているかどうかを検証するのかどうかも不明である。", "q0r": 4, "q1": "提案者は、資金調達後にチームを立ち上げたいと考えています。つまり、現時点ではチームがなく、提案者自身も必要なスキルセットを持っていないため、実現可能性は評価できません。私は7年以上の経験を持つ研究者で、自分の論文が学術雑誌に査読されて掲載されるまでに何度か経験しており、私自身も学術的な査読者でもありますが、実際の科学論文の査読プロセスについてあまりにもカジュアルであることに問題を感じています。学術雑誌の査読プロセスは一般的にブラインドで行われるため、査読者は論文の著者を知りません。匿名のネットワーキング・プラットフォームでは、論文が投票でつながっていくため、汚職やバイアスが生じる可能性が高いと思います。私は、科学に「upvoting」が必要だとは思いませんし、これこそがバイアスの原因だと思います。また、「Researchgate」という世界的にアクセス可能なオープンアクセスの研究プラットフォームもあり、この提案者が設定しようとしていることのようなことができます。問題は、なぜこのソリューションが既存のものよりも優れているのかということであり、もう一つの問題は、暗号分野の研究者のために特別なスペースを設けることが有用なのかということです。また、このネットワークサイトに掲載された論文は、どのようにして出版されるのでしょうか。研究者が論文を発表して引用されたり、学術的な検索エンジンに掲載されたりするための学術雑誌と、このページをどのように結びつけるのでしょうか。つまり、ある分野の研究をネットワークサイトから排除することで、結果的にその研究は通常の科学データベースに掲載されないため、実際には目につきにくく、つながりにくいものになってしまうのです。私が言いたいのは、提案者は、研究の発表に伴うほとんどの問題を考慮に入れていないということです。そして、なぜこの分野の研究者のための特別なリポジトリやソーシャルメディアが必要なのか、どうすれば小集団のバイアスを避けることができるのか、どうすれば科学の品質基準に影響を与えないようにすることができるのかを明確にすることにもっと力を注ぐべきです。", "q1r": 3, "q2": "このプラットフォームを作るためには、提案者が科学を扱う際のリスクについて言及する必要がありました。ただ何かを変えたいというだけでは成立しません。学術研究の査読プロセスでは、この分野の特定の知識を必要とし、研究デザインの分野では、査読者は内部および外部の妥当性の問題を検出できなければなりません。科学コミュニティのメンバーのデジタルIDについては一切言及されていないため、プロジェクト自体の監査可能性は困難です。監査可能性に関するその他の問題としては、予算配分が3つのカテゴリーに対して30%/40%/30%だけであり、何の仕様も示されていないことが挙げられます。これは、提案者がこの課題の全資金を要求していることに関連しています。また、チームがなければ、関連するスキルセットを評価することができないため、監査可能性も難しくなります。リスクにも対応していない。", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal lacks an understanding of the problem (there's no such thing as \"objective of UNBIASED Sciences\", as any research in sociology of science has been discussing since a long time ago) and the solution is actually a statement and not a concrete solution. ", "q0r": 2, "q1": "The budget is unreasonable and has no information on how it will be distributed within the project. No experience from the team was given. \r\nTo improve the proposal, I suggest following the guidelines at: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit ", "q1r": 1, "q2": "Roadmap and deliverables are not clearly presented to the community. And as the proposal needs to be improved as a whole (specially in how the solution impacts the community or Catalyst), it is hard to be audited. ", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal \"ADA4Sci is a platform where scientists can get together and develop a paper from the debate of ideas and perspectives\" is vague and leaves a lot of scope for interpretation. It is difficult to estimate the effectiveness when the aim/end state is vague. ", "q0r": 3, "q1": "The proposer claims to be a research scholar. The proposal does not seem to have any references to past contributions or publication to substantiate his experience. ", "q1r": 2, "q2": "The proposal's budget of 200K is not justified in the proposal. The proposer allots 40% of the budget that is $80K to \"start working on the platform after a brainstorm of ideas\". This to my mind is not justified. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The impact of this project, in terms of creating a space for international information sharing and vetting, is very promising. The solution statement didn't make sense as a solution statement, however, in the context of the project. Beyond the mention of marketing, it's unclear how this proposed site will attract eminent scholars.", "q0r": 4, "q1": "It is not clear to me that anonymous peer review on a social media style site would have less bias than the traditional peer review process. Additionally, social media incentives and ingroup biases could make these problems worse, and it's not clear to me that the proposer has considered these problems. The proposer has a set of credentials but no direct links to their work, nor do they have a team yet, which would be invaluable in assessing feasibility.", "q1r": 3, "q2": "There is not a communication channel or existing team, nor any links to prior work done so far. This makes the proposal difficult to audit now and going forward. The budget in the roadmap does not have clearly itemized or auditable actionable steps. The proposer is asking for the full sum of this challenge fund, which if approved, would mean no other miscellaneous challenges could be accepted. ", "q2r": 3, "assessor": "z_assessor_501", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "\"I have read this proposal carefully, but I still don't understand if the platform the team wants to build is a website or a dapp or a community. If it's a dapp, I think the dapp challenge will be more suitable for this proposal.\r\n\r\nIn addition, the proposer mentions the impact of this proposal as \"\"Most of the impact from this project will be from marketing associated with a successful project hatched by the ADA community. however, it will also be involved by the science generated which is related to blockchain policies, research, and investigations developed within the ADA4Sci platform\"\". This impact is very general and doesn't specify what the problem the proposal really wants to solve.\"", "q0r": 1, "q1": "There is no way to determine the proposer's experience as there is no additional information given. All are just ideas, even the proposer needs to spend 3 months brainstorming ideas and planning for the proposal. This means that currently this proposal is just an idea without a specific plan", "q1r": 1, "q2": "There is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The problem statement convinces me very much [as a public policy researcher], however, this is not explained in detail. I think this is a great and interesting idea, after all. The solution is clearly showing what the proposer intends to do for solving the problem.\r\nTherefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Proposer profile [with professional experiences as Engineer, MA, MSc, and Ph.D. (Cand.)], as well as his networks, are described as a great benefit for this proposal, however, there is no proof/links for verification. The roadmap is clear, however, the budget breakdown and risk are not provided.\r\nTherefore, based on the given information, I disagree with this proposal's feasibility, I can rate it with a score of 2", "q1r": 2, "q2": "As mentioned, this problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Profile with reference/proof (documents/links,...) for verifying; (2) Budget structure; (3) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The project is just an idea with no clear view on how to perform it. The investigator doesn't know how to create an \"unbiased science\" and expects to come up with the answer after brainstorming for three months. The science community already has a peer review system to produce reliable knowledge. While the system is not perfect I don't see in this proposal the added value, beside saying it will create 'true unbiased science'", "q0r": 2, "q1": "Science is a vague topic. to goes from engineering sciences to natural and social science. this proposal is just vague with ne clear KPi's or metrics. there is no team in place besides the Principal investigator that  only have expertise in engineering. it is very unlikely this proposal will be successful, due to lack of expertise and knowledge about the challenges ahead and solutions to overcomes these challenges. For instance, how will you compete against the peer review system that already exits and researchers needs in order to obtain funding and recognized among their peers. How will you deal with intelectual property?", "q1r": 1, "q2": "The proposal is just an empty proposition. the funding asked is very big but no clear budget or roadmap or KPI's metrics is in place to provide sufficient information for an audit.", "q2r": 1, "assessor": "z_assessor_761", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Since the challenge opens the way for proposals with different ideas from the other challenges, this proposal fits right for this challenge. ", "q0r": 5, "q1": "I as I read through the proposal, even if the author tried to explain the plan it lacks a detailed explanation.  Having a detailed implementation plan helps proposers identify more about what they want to propose and keeps expectations realistic and in this case, I felt the thought and time spent on this proposal don't show successful implementation potential.", "q1r": 2, "q2": "Having a proposed idea with such a vast timeline has to be well equipped with all the information needed to anticipate the progress of the proposal. But this fails to demonstrate further insights for readers to audit the progress in the futre.", "q2r": 2, "assessor": "z_assessor_762", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "科学は、政府や専門家が公共政策を策定する際の最も重要な証拠資料となりつつあります。", "experience": "私の個人的、職業的な経験やネットワークは、このプロジェクトにとって大きな利益となります。\nエンジニア、MA、MSc、Ph.D. (Cand.)"}