{"id": 383467, "author": "jtrube", "title": "Candy Pop-Up Campaign", "url": "https://cardano.ideascale.com/a/dtd/383467-48088", "category": 26248, "amount": 15000, "description": "何気なくカルダノを知っていても、コミュニティに積極的に参加していない個人という未開拓の大きな資源があります。", "funded": 1, "upvotes": 26597490, "downvotes": 15239546, "votes_result": 11357944, "votes_cast": 93, "f6_no_assessments": 4, "f6_rating": 3.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A  pop-up shop in Cardano theme can improve the visibility of Cardano. WIth the added aim to create transactions using ADA will improve the adoption of ADA. Japan with improving crypto friendliness is the right place for these initiatives. ", "q0r": 5, "q1": "The proposers have claimed an impressive array of clients and showcases some very good digital marketing initiatives. With the establishment in Doha and in Japan, they must be capable of performing what is clammed in the proposal. ", "q1r": 5, "q2": "The budget is for 15K USD and the breakup looks very reasonable. The aim of having 100 transactions in Cardano in three months is also a conservative aim. Assuming the 100 transactions onboard about 100 persons into the Cardno ecosystem, it is cost-effective and a good initiative. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Due to strict regulations in Japan, community are left behind with neighboring countries regarding cryptocurrency adoption. The author aware about the condition of this crypto adoption in Japan and tries to convey the idea of the Candy Pop-Up Campaign will increasing japan community to participate and contribute in Cardano's ecosystem. But.. Why pop-up shop? Is there any research that shows us the Pop-Up Shop is the most popular campaign and has the most impact in Japan? If the proposer can provide information why we should use Pop-Up Shop for Japanese community, it will be a plus star.", "q0r": 3, "q1": "Proposer provide their portofolio website and it is enough to explain their experiences in this area (brand experience agency). But it will be nice if Proposer attach their LinkedIn profile to trace their credibility. The 12 months timetable they provide are realistic and I personally believe this project will run smoothly with proposer experiences.", "q1r": 3, "q2": "Author written that their KPI only have one (primary) key metric: number of transaction. Is there any correlation about pop-up shop and transaction in Cardano Blockchain? Also, how can us audit the number of transactions within 3-9 months after pop-up shop launched?\r\n\r\nMyself personally, still needs further explanation about the web development & NFT commission budget. Why would pop-up shop campaign need that budget? Is it a virtual pop-up shop? Or an offline pop-up shop? Because, based on the proposer's experiences are make offline events for the campaign.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "An interesting idea of building value by helping build adoption. The proposal's plan is to use every-day branding strategies, along with an NFT style, to build involvement from those aware of this ecosystem, but not active in such.", "q0r": 4, "q1": "The experience is mostly related to PR activities, branding and such, outside of the blockchain technology. The team will need a team member familiar with the Cardano environment.\r\nThe plan is rather broad in nature. Also, it suggests that the goals will be to process at least 100 transactions within 6 months, and 250 within 12 months. With the millions of transactions happening daily on the Cardano blockchain. There seems to be room left for improvement in this area.\r\nThe budget is broken down per category and is sound for the project.", "q1r": 3, "q2": "The number of transactions and the launch of the \"pop-up\" shop are the key metrics seen to be feasible. While limiting in the amount of KPIs, these do make sense for the project at hand.\r\nThere is a list of clients (attached as a PDF), that while it could not be determined if these are current or prospective clients, is another possible measure.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is a somewhat unusual, and perhaps indirect solution to the challenge, but is nevertheless convincing. However, the problem it solves seems to be rather the awareness or initial interest rather than conversion into engagement. At the same time, this proposal would benefit the image of Cardano as being not only about software but as having a relevance in society overall, communicated through art.", "q0r": 4, "q1": "The experience and plan presented indicate a solid background of the proposing team, paired with the high level of effort made on the proposal indicate that it is likely to be implemented successfully.", "q1r": 5, "q2": "This proposal would benefit from adding KPIs to better audit the progress and success to outsiders.", "q2r": 3, "assessor": "z_assessor_942", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "アート、NFT、グッズなどを使った日本発のオリジナルブランドキャンペーンを開発・展開する。", "experience": "10年以上にわたり、Google、Porsche、Ralph Laurenなどのクライアントのために、日本市場でイベント制作やコンテンツ制作を行ってきました。"}