{"id": 383705, "author": "despas.damien", "title": "ADAGLASS Data Intelligence Platform", "url": "https://cardano.ideascale.com/a/dtd/383705-48088", "category": 26248, "amount": 28525, "description": "カルダノのステークホルダーが、エコシステムのパフォーマンス、成長、機会をモニターし、可視化するためのプラットフォームがありません", "funded": 1, "upvotes": 27701499, "downvotes": 18772501, "votes_result": 8928998, "votes_cast": 93, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=10531"], "media": [], "f6_assessments": [{"q0": "私自身、データアナリストとして、十分な情報に基づいた意思決定を行うためには、質の高いデータが重要であることを理解しています。カルダノのエコシステムのパフォーマンス、成長、機会を監視し、視覚化するプラットフォームがないため、ユーザー、SPO、Delegatorが自分の行動から最適な結果を得ることができません。本提案は、カスタマイズされた堅牢なプラットフォームでこの問題に対処します。このプラットフォームは、コミュニティ全体にとって有益であるだけでなく、Auditabilityに意味のあるデータを提供し、新しいSPOを誘致するための実用的な洞察を提供することで、「Auditabilityの向上と成長」と「新しいSPOのビジネスチャンス」の課題の解決にも役立ちます。サブスクリプションプランによる利益の可能性は、コミュニティにさらなる価値を与え、プロジェクトの経済的持続性を高めます。また、インフラへの投資を通じて、ユーザーベースとエコシステムの指数関数的な成長を包含するように、プラットフォームをスケールアップすることも可能です。", "q0r": 5, "q1": "このチームは、エンドツーエンドのITおよびデジタルサービスを提供してきた20年以上の経験を持ち、提案を成功させるための十分な背景知識を持っていることは明らかです。彼らのスキルセットによって、セキュリティとアジリティを持って実施できるはずです。必要なチームメンバーのタイプは明記されていますが、必要な数とそのメンバーをどうやって見つけるかは明記されていません。予算は合理的で、特定の項目に分けられていますが、それぞれの項目についてどこが提供者になるのかは明確ではありません。クラウドファンディングや提案者の初期投資によって追加資金を獲得することになっており、提案を実行する意欲と自信が感じられます。実施計画書には、すべてのタスクが記載されていますが、それぞれがどのように行われるのかは詳しく書かれていません。タイムラインは現実的で、1年以内に完全に実施することを予測しています。引用されている点について、より詳細な記述があれば、提案の実現性は高まるはずです。", "q1r": 3, "q2": "各四半期には、進捗状況を把握しやすくするために個別に期限を設定できるタスクがいくつかあります。3ヶ月、6ヶ月、12ヶ月のマイルストーンは、測定可能な指標を示していますが、「コミュニティでの有名なブランド」は曖昧で、コアチームの規模と質が明記されていません。とはいえ、記載されているステップを見れば、進捗状況を十分に把握できるはずです。", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 23, "ne": 12, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The end-to-end data and intelligence platform with community-provided data can bring out the health of the ecosystem and identify opportunities for new entrepreneurs. Business intelligence is crucial for value commitment and to generate analytical frameworks to handle projects. Considering these points if feel the proposal is addressing a challenge. ", "q0r": 4, "q1": "The proposer team has a strong foundation in the technical domain with the required education. The sustenance of the initiate by stake pool is not very clear. In the present-day competition in the SPO community, there is a need to estimate the staking requirement for any meaningful profit to finance a data aggregation company. More clarity of the subscription model for revenue generation also was required. ", "q1r": 4, "q2": "The fund requested is reasonable for the activity as mentioned in the proposal. However, for sustenance and growth, a viable business model will be a critical requirement. The proposal would have been more auditable or verifiable if it includes tokanamics and more info on the stake pool operation.  ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 17, "ne": 0, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "As there does not seem to be another challenge within this proposal fits the proposal is correctly placed here. The proposal accurately  identifies a problem and provides a solution of a data Intelligence platform. It clearly highlights the benefit it will bring to the ecosystem if correctly implemented.   ", "q0r": 5, "q1": "The team appears to have the requisite experience with external links provided. The funds requested are in line with the time frame and scope of initial work as the proposal states it will be also generating funds through a token launch. It would be great to see possible challenges and risks to the project with specific regards to security defined in future proposals.", "q1r": 4, "q2": "The project has defined a very ambitious roadmap and metrics with which to measure success. However it would be great to see KPIs directly related to the requested funds and not the project as a whole as without this it is difficult to determine the audibility of the proposal", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "データを観察し、方向付けし、共有することで、e2eの可視性、偏りのない実用的なインサイトを実現するデータ・インテリジェンス・プラットフォームを導入する。", "experience": "官公庁や民間企業にCX、クラウド、サイバー、データなどのE2E ITおよびデジタルサービスを提供してきた20年以上のチームの経験"}