{"id": 384082, "author": "sikaffy27", "title": "blockchain based Dating App", "url": "https://cardano.ideascale.com/a/dtd/384082-48088", "category": 26248, "amount": 19000, "description": "オンライン・デートが当たり前になっていますが、中央集権的なデート・アプリでは、人々が適切な恋愛相手を見つけることができません。", "funded": 0, "upvotes": 20248974, "downvotes": 22201814, "votes_result": 1952840, "votes_cast": 96, "f6_no_assessments": 8, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "While this is a very interesting idea, this proposal is lacking some key information concerning privacy, risks, actionable steps for this project and KPIs. Connecting people through staking and a social platform seems great but with sensitive data being collected and shared and the crypto space still being mostly male dominated, a dating platform might be a difficult task for this space.", "q0r": 4, "q1": "Feasability is low since the proposing team does not provide references for the team members or a roadmap. The proposal gives an overview on the tocenomics and on the way that the AI will be used to match partners. The team should elaborate about the risks of connecting staking to dating and collecting as well as giving out sensitive information to it´s users. (1) How can we be sure that the members are not going to use my information as phishing or social engeneering or scammers? (2) The ratio of men/women/diverse in the crypto community would not support the idea of a dating platform. How do the members chat with each other, which data do I have to provide to be able to communicate on this platform? The requested funds are humble in general.", "q1r": 3, "q2": "While this is a very interesting approach, the team does not provide enough auditable information - there is no references to skillset of the team members, to prior work, the proposal does not include any actionable steps or a roadmap, the budget breakdown is very broad and the measures of success are missing. It is not quite clear where the team stands at the moment with the idea and what the next steps are, that would be funded by the community.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 6, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Sometimes you come across blockchain solutions that don't really need to be built on blockchain. This is one of those.", "q0r": 1, "q1": "There is no extra value created by running this on Cardano. There are traditional dating sites like OkCupid (www.okcupid.com) that are really good in that matchmaking function and probably some others also have loyalty points and gamification elements, too. Complicating things with the SXY token (is that what it was called) doesn't add anything to the user experience. Dating profiles as NFTs might have some value but unfortunately they are not explored in any more detail.", "q1r": 2, "q2": "Roadmap, milestones, KPIs are largely missing. The budget is not realistic if you want to develop a \"host of artificial intelligence features\".", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 25, "ne": 1, "ng": 14, "nfo": 10, "vca_o": 1}, {"q0": "This project starts from the premisse that dating apps have a lot of fake profiles but it would be nice to see some research/statistics on it to prove wheter it is indeed a true problem or not. The datings apps (like tinder) are global and if this problem is bases solely in the proposer local experience I'm afraid the reach of it may not be so high.\r\n\r\nOther problem stated is in the current failing to find the romantic partner and that it could be solved using AI in blockchain with many attributes. However, it's possible also to solve this using AI without blockchain support, that any existing app can implement (if they dont already do it). Whatsmore, finding a sutiable romantic partnet can be quite subjective and linking it to attributes may also not be the answer - sometimes people get well along together being so different but the talk was enough to make them like each other.\r\n\r\nFurthermore, this market is really competitive (there are plenty of dating apps already) and with low ehave ADA (or create a walltet for ADA) just for using the date app, I see complex \"sign up\" process and the use of the app would be limited to those who already have ADA. I also wonder how would be the communication with people outside Cardano - because first it would be needed to explain what is a blockchain and only then present the app.\r\n\r\nAll in all, I see a limited potential of this app, with a high competition in the market.", "q0r": 2, "q1": "The experience of the team is quite vague and there's no way to verify it. It just mentions their expertise but it could also state their past experience. There could be linkedin links also.\r\n\r\nIn regard to the plan, there's no development/implementation timeline. It could state which are the development steps in a time-framed manner, with a beta launch/validation phase.\r\nBudget breakdown is clear but project seems quite expensive.", "q1r": 3, "q2": "There's no proposed metrics or milestones -specially becuase there's no implementation plan.\r\nAs metrics, it would be imporant to measure how many people join the app and how much time they spend on it. Also, the number of successful matches.\r\nAs milestones, I'd consider the launch of the beta version and the launch of the final version as the main one.\r\n\r\nThere's no risk mitigation strategy in regard to communication outside cardano community and competition with existing apps.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 23, "ne": 11, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is well thought out and clearly addresses the problem of people not able to find suitable romantic partners through centralized dating apps. This proposal wants to create an AI-powered blockchain platform that helps people find suitable romantic partners by connecting profiles sharing high levels of complementary attributes and commonalities", "q0r": 5, "q1": "The team is very diverse and seems to have the necessary experience and expertise to develop the platform but the mention of previously worked AI-powered projects would have helped a lot. The proposal consists of a well laid out plan and a clear explanation of all the steps needed to develop this platform therefore it's likely this proposal will be successfully implemented", "q1r": 4, "q2": "The proposal consists of a complete break up of funds which will be helpful to audit but if they would have mentioned KPIs, Definition of success of required months, and a complete roadmap with a timeline all this info would have been enough to track the success of the proposal", "q2r": 3, "assessor": "z_assessor_317", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "There is a need for decentralization in this online Dating apps industry which will provide the necessary control over user data. Blockchain may provide the necessary security controls to control the use of private data. Therefore scope and utility exist. The proposal may require Atala for identity and user data control. ", "q0r": 4, "q1": "The proposer list the support of a balanced team that may have the necessary capability to implement the proposal. There is no major technical hurdle., however, marketing and many other factors will influence the adoption of the system.. Reference to the past work of the team members would have added value. ", "q1r": 4, "q2": "The proposal has a simple strategy and the development aim has been provided. The fund requested is very reasonable and the output can easily be measured. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal fits the challenge well in that it addresses a very unique problem.", "q0r": 5, "q1": "The proposer does not mention or grapple with the risks inherent in trying to create a (presumably predominantly heterosexual) dating site in a very male-dominated space. This could conceivably be mitigated somewhat with a savvy onboarding plan, but the proposal does not flesh that out. Additionally, the cost and feasibility of collecting and protecting many of the chosen compatibility metrics is a serious undertaking that the proposal doesn't do enough to reassure me that it's being taken adequately seriously.", "q1r": 2, "q2": "The BSX Token is very earnestly considered and fleshed out I think, but I don't see that embedded into a roadmap with specific measures of success that can be audited. This should be added.", "q2r": 3, "assessor": "z_assessor_501", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "What a beautiful and romantic idea! An idea from good intentions with people looking for a partner. World improvers actually! In my opinion, the app will be developed for a specific and perhaps rather limited target group, but there is nothing wrong with that.", "q0r": 5, "q1": "I am a bit afraid that people are not yet familiar with the BSX tokens and this can be a barrier for many potential users to join the dating app. Very stereotypical mindset maybe, but, it will deter even more female users and thus create an imbalance in the users, which will make matching more difficult. The app is less accessible due to the large amount of very personal (!) information that the user has to share and make available.", "q1r": 3, "q2": "No planning has been worked out yet, this can certainly be added to the project to make it more transparent. The budget is divided, almost a little too simple, but the main resources will initially be used for these parts. Few or no KPIs to measure success, this can be worked out even better.", "q2r": 2, "assessor": "z_assessor_667", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This is a fairly creative project with strict regulations, solving the negative aspects of using the dating app nowadays. Moreover, the project also contributes to the development of the Cardano ecosystem.", "q0r": 4, "q1": "While the team has shown relevant experience to demonstrate the skills needed to implement the proposal. However, I would suggest you ad more info and evidence regarding your experience. Like past projects you worked on or a profile site. It is also important to have more detail regarding the number of people involved, scope of each member, estimate hours and allocated budget to the different work packages for project implementation.", "q1r": 4, "q2": "This proposal is quite clear about the operation and feasibility of this dApp, but no roadmap or KPIs are given. It would be beneficial to have a more detailed roadmap that allows the community to know the level of progress of the project in the townhalls. The proposer needs to add: Number/growth of application output Number/growth of application transactions Total volume of Ada involved in application transactions Total/growth of resource usage by applications Additionally, the financial budget needs to be allocated to specific actionable steps that connect to the roadmap. The roadmap itself should provide information on what the team is planning to do. Partners should be disclosed. Documentation to the community should be provided.", "q2r": 3, "assessor": "z_assessor_792", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "補完的な属性や共通点を持つプロファイルを結びつけるAI搭載のブロックチェーン・レジストリ＆エンジンを構築します。", "experience": "マリオ・ムラレス - エコノミスト\nDanish Hameed - フルスタックデベロッパー\nDaniel Golman - javascript開発者\nSteven clarke - ラスト開発者"}