{"id": 384605, "author": "newmindflow", "title": "Showcase Film Industry Use-Case", "url": "https://cardano.ideascale.com/a/dtd/384605-48088", "category": 26248, "amount": 49400, "description": "映画業界は、ブロックチェーン技術を主流にする上で、非常に強力な味方になる可能性があります。どうすれば意思決定者に興味を持ってもらえるのか？", "funded": 1, "upvotes": 66957210, "downvotes": 7262565, "votes_result": 59694645, "votes_cast": 143, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is about showcasing a successful example of blockchain-enabled film distribution to attract the attention of key players in the industry. This is a great and interesting idea. The problem convinces me and it is clearly described, and explained in detail so that it addresses this challenge. The proposed solution is clearly defined, fits the challenge, as a result, a clear impact on the Cardano ecosystem as a whole in the short term and long term can be seen. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of 02 very active members of the Film industry, and their profile shows suitable skills and experiences for implementing this kind of work. This is proof of feasibility from the team profile. The budget is clear and logical. Risk is clearly [that is no risk forseen].\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I would rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a lot of meaningful information, with external links for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "Arguably this NFT proposal could have been included in the Dapps & Integrations challenge, but I see the case for including it in the Miscellaneous challenge. \n\nI agree with the proposers that blockchain solutions to help the film industry are a good idea, and doing so with some kind of NFT solution seems a good idea. So I think this proposal is on the right track.\n\nHowever, a couple of concerns. First, the idea of tickets as NFTs does not make sense to me. Tickets are generally fungible items, and the proposers do not make clear what the special ownership rights are that would make these into NFTs. Second, the proposal is fairly complex, and there is a disconnect between a focus on one existing film and making of new films. I would encourage the proposer to focus their efforts on a simpler and clearer starting proposal.", "q0r": 4, "q1": "The plan for this proposal is rather complex, with various steps (e.g. re-editing the film, making a \"making of\" documentary) that seem only loosely connected to the central NFT idea. Although the proposers seem to have some relevant experience, they do not include a detailed plan for achieving all of these tasks or identify the resources that would be used to do so.", "q1r": 3, "q2": "The proposers offer a reasonable set of KPIs. These do not match up particularly well to the very complex set of tasks involved in the proposal, but would be good measures if the proposal can be successfully executed.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This is the miscellaneous challenge and I agree that this proposal doesn't fit into other categories. The proposers seem to have both the network and the technical expertise to realize the goals. They obviously put a lot of thought into the proposal. As far as the impact it would have, this is harder to gauge, as it depends on audience and industry interest. If the making of documentary gets into a festival circuit, this would certainly bring attention to Cardano. The proposal requests about 25% of the miscellaneous challenge allocation. Since the challenge includes 98 proposals, this will seriously limit the number of funded challenges. ", "q0r": 4, "q1": "The proposers seem to have the skills necessary to execute the given roadmap, But I'm less convinced they will be able to generate the public/industry interest necessary to make the project a true success. More details about the distribution of the NFTs would be helpful. ", "q1r": 4, "q2": "The roadmap is very detailed and the budget is broken down in a way that seems realistic. Some of the KPIs are subjective or difficult to count, but overall I believe it will be easy to judge the success or failure of the project.", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "They seek to establish a block chain enabled film distribution to attract the attention of key players in the industry. They explained that the film industry is currently in challenging times and so they want to launch the use of NFTs as movie tickets. This is quite good in my opinion. Challenge is well addressed.", "q0r": 4, "q1": "The team have over 30 years experience in film, TV, apps and games production; also creators of successful CNFT projects called Trybbles and Icons. The detailed plan in the proposal mentioned, among others, the building of small scale practical showcase; use of NFT base authentication service such as NFT key. All the detailed facts can lead to successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clear showing details of work schedule for 12 months and 24 months.  KPIs are detailed, mentioning a few here as number of people from inside the film industry, number of people from outside, etc. The budget breakdown is detailed and clear for easy auditing. Recommended.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 21, "ne": 1, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The proposer argues that the traditional film industry is struggling to navigate the new, digital marketplace and is experiencing pressure and high competition from streaming services in regards to distribution.  This is an interesting and relevant problem that has the potential to benefit from implementing blockchain technology. The proposers also makes it clear how the solution benefits the Cardano ecosystem, as venturing into a billion dollar industry with far reaching influence could very well increase the adoption and awareness of Cardano by the average consumer.\n\nHowever, to achieve a 5 star rating I would recommend the proposers to more thoroughly discuss the underlying market forces and consumer needs that are driving the mentioned industry change. A better understanding of this would make it clearer how the proposal delivers value, not just to the Cardano ecosystem, but also to consumers and the film industry. As of now it is unclear to me how the NFT distribution model differs from other digital marketplaces, such as Amazon.\n", "q0r": 4, "q1": "It seems very likely that the proposers will be able to successfully implement their proposal. They have relevant experience within both the film industry and tech world, meaning that they have both the knowledge and human resources to achieve their goals. Their credentials are easily verified through LinkedIn and IMDb, and they provide concrete evidence of their experience within the field.The proposers give a clear timeline and a comprehensive budget that assures me that they have put a lot of though and effort into the project idea. The fact that the proposers either own the IP or have easy access and rights to the material of the film they intend to use in the project further strengthens their feasibility score.", "q1r": 5, "q2": "The proposers provides a step-by-step plan for the implementation and completion of the project with a clear and efficient time plan. The goal of the proposal is to attract attention of key players in the industry and demonstrate a working distribution of a movie using blockchain technology. Therefore, many of the KPIs are related to consumer and industry awareness of the project, which is good. To achieve such KPIs different marketing efforts is required. The proposers want to host a launch event and enter the “making-of-documentary” in different film festivals, which seems like good choices to increase awareness for industry participants. However I do question whether these marketing efforts are limited to a narrow segment, and might fail to reach the end consumers that would be interested in buying the NFT-tickets. I would suggest a general outline or description of the marketing efforts targeted at the intended customers of the NFT-tickets.\n\nAll the KPIs clearly aligns with the project objective and accurately describes the success of the project. While most of the KPIs are good, I question the measurability of the first two KPIs. The proposers wish to measure a hopefully increased awareness of the Cardano NFT distribution model in both industry actors and consumers. However, I would argue that such KPIs are difficult to measure and would require a questionnaire or similar market research to take place both pre-implementation and after the fact. To achieve a 5 star rating I would recommend the proposers to either add some explanation as to how they would measure these KPIs, or reevaluate them to make them easier to verify.\n", "q2r": 4, "assessor": "z_assessor_139", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "ブロックチェーンを活用した映画配給の成功例を紹介し、業界のキープレイヤーの注目を集める。", "experience": "New Mindflow - 映画、テレビ、アプリ、ゲームの制作に30年の経験を持ち、2つのCNFTプロジェクトを成功させたクリエイター。TrybblesとIcons"}