{"id": 367328, "author": "", "title": "Entrepreneurs/Developers Community", "url": "https://cardano.ideascale.com/a/dtd/367328-48088", "category": 26105, "amount": 20000, "description": "Little outreach to entrepreneurs and developers outside the blockchain world, losing projects with high business value for the ecosystem.", "f6_no_assessments": 2, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "this will atract huge amount of entrepreneurs and developers to the ecosystem, they will be able to work together and create interesting projects for cardano, so it fixes in the challenge", "q0r": 5, "q1": "the project has been started months ago without the funds, they have a team with several people developing more things in the platform so probably this will be implemented succcessfully", "q1r": 5, "q2": "at the end of the proposal its clear how to see those indicators. It is detailed how to see the success of the proposal and also a list of KPIs", "q2r": 5, "assessor": "z_assessor_300", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "the proposal itself is not suggesting a new platform, rather consulting, fostering users, and marketing over social media. \r\n\r\nThere are projects which are proposing a brand new platform, with key features with a similar budget.\r\n\r\nIn this case, I am afraid that the results will not be so effective as expected.\r\n\r\nAlso, it would be better to create a stable/basic/ground floor platform, rather than having different discord groups. ", "q0r": 2, "q1": "1. discord group exists\r\n2. telegram exists\r\n3. social media facebook,twitter,IG exists\r\n4. relevant experience stated, yet some link is missing\r\n5. I think the budget is not well-designed, because you will need to raise over constant posting, and that is what will cost the most money. ", "q1r": 3, "q2": "1) The number of verified members in the community. - I think only members of the community are enough - how would you scale up \"verification\"? \r\n\r\n2) Proposals submitted to Catalyst have arisen from the Innovatio community. - how would you find it out? (survey, hashtags?)\r\n\r\n3) The number of mutual collaborations fostered by the community.  - how would you find it out? (survey, hashtags?)\r\n\r\n4) Proposals that have achieved success thanks to the support of the community.how would you find it out? (survey, hashtags?)\r\n\r\n5) Interaction and visibility of content on social networks and YouTube. - views, likes, followers\r\n\r\nit can be audited, but I have my reservations at points 2-4\r\n\r\n ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "1) The assessor does not answer any of the questions in the CA Guideline statement, does not mention whether the proposal is presented and developed in accordance with the objectives of the challenge, the assessor has answered anything except what has been asked in the CA Guideline, this shows a clear lack of interest in finding out how it should give the assessments statements as CA. For this reason, the rating of 2 does not have any objectivity or criteria.\n\n2) Again, the assessor does not respond to the viability statement presented in the CA Guideline, he simply responds very vaguely to the social networks that have already been created and gives a totally subjective opinion of the budget, out of all logic under his role as CA The assessor never explains in the least how viable the proposal is or not, so the rating of 3 does not correspond, neither with the allegations, nor with the CA Guideline.\n\n3) The assessor asks 3 times how we would discover the 3 points mentioned above, it seems that the assessor does not take into account that all the proposals can be sent to Catalyst, indicating which user has helped to send this proposal to the ecosystem, for this reason and the previous points mentioned, this assessment should be removed."}], "solution": "Attraction and adoption of blockchain technology for business models and a practical guide from the Cardano community.", "experience": "Project with more than 10 months of experience, development and importance.\n\nKnowledge in Branding, Engagement and Digital Marketing."}