{"id": 368238, "author": "", "title": "GovWorkCenter Platform", "url": "https://cardano.ideascale.com/a/dtd/368238-48088", "category": 26105, "amount": 100000, "description": "small business are at a disadvantage with working for the US government.", "f6_no_assessments": 4, "f6_rating": 1.75, "videos": [], "media": [], "f6_assessments": [{"q0": "Even though the proposal is a good idea, the proponent indicates he is knowledgeable about the issue of his interest, and, I believe, the proposal is a good idea for Cardano to support and pursue, I believe, the idea is out of place in this challenge and it would do better in a different place. Unfortunately, this suggests the proponent did not understand the challenge or did not pay enough attention to formulate a proposal that demonstrates how it is a response to the challenge. To be clear, this proposal does not effectively address the challenge it was signed on. This proposal was included in the \"proposer outreach\" challenge. The goal of this challenge can be summarized as [to] \"attract the brightest entrepreneurs from across the globe and encourage them to submit ideas which will have a positive impact on the ecosystem\" (from the challenge brief). Success in this challenge is identified as \"Bright entrepreneurs, and specialized firms from across the globe learn about Catalyst and submit high impact proposals\" (idem.), which is not the goal of the proposal. This proposal may do better in the following challenge or in similar challenges in future funding rounds: \"Dapps and integrations\". Because the idea and the proponent are promising I strongly suggest it is further developed and introduced in a future funding round.", "q0r": 2, "q1": "The proponent indicates they have extensive experience on the issue, this brings clarity and know-how to the proposal. From the information provided, it seems that the proposal would benefit from the formation of a team with strengths in Dapp development and integration with the Cardano ecosystem (Cardano stack), blockchain technologies more generally, and blockchain markets. The proposal suggests that it could correspond to a very valuable Dapp or a DAO, that is, if 1. the need has been adequately identified, and 2. there is clearly a need for this application. The former could constitute a new company or a social enterprise which would capitalize from the satisfaction of the need and gain value by allowing small business to participate in governance, further capitalizing form the expansion of the Dapp (including more business and, in the future, more governments). Unfortunately, the fact that the proposal was inadequately listed, the absence of a team, and lack of technical detail in the proposal (roadmap, milestones, detailed budget) impede a better suggestion of success in the near future while it clearly shows potential to be further improved.", "q1r": 3, "q2": "Unfortunately, the proposal did not provide information for auditing its progress and success, Roadmap, milestones, team description, technical detail (software development, Cardano integration, governance, and marketing), deliverables, the definition of success, are all missing. Nevertheless, I will insist that there is still a great business/platform/Dapp idea here with the potential to bring significant value to the Cardano Ecosystem, I strongly recommend that this idea is further developed with the collaboration of the community, take advantage of Cardano's media outlets and Project Catalyst to improve the project, even if you don't end up doing it, somebody should. All of the previous (in my three assessment notes), is true if there is a proposal for development within Cardano/Catalyst here, and if this proposal is not only a mechanism for the entrepreneur/company to onboard additional clients to their existing/as is platform/business. If the case is the latter, then this proposal should simply be dismissed by Catalyst/Cardano, as it represents an attempt to take advantage of the community for private gains.", "q2r": 2, "assessor": "z_assessor_183", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\nYes it has.\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nYes it does.\r\n \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nIt doesnt. In theory the idea is good but the proposal does not show clearly\r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nNo they havent\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nNo metrics are specified.\r\n\r\nCan the proposal scale to address future challenges?\r\nIt is not adequate to determine this\r\n", "q0r": 1, "q1": "\r\n\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNo team members are specified\r\n\r\n\r\n\r\n \r\n\r\n\r\nAre these links sufficient?\r\nNo. It is a basic site which shows no proof of capability of proposer.\r\n\r\n\r\n \r\n\r\n\r\nHave you the CA visited these links and contacted the relevant people?\r\nYes I have visited the site\r\n\r\n\r\n\r\n \r\n\r\n\r\nHave you been able to assess their level of competence?\r\nThere is no way to assess this\r\n\r\n\r\n\r\n \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo team members are specified.\r\n\r\n\r\n \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\nIS budget reasonable to achieve the set goals?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\nHave you verified this plan?\r\nNothing to verify\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nNo\r\n\r\n\r\n\r\n \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nNo\r\n\r\n\r\n\r\n \r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo\r\n\r\n\r\n", "q1r": 2, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo\r\n\r\n\r\n\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n\r\n\r\n\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nNo. A theoretical solution is given but no proof, plans or details are given\r\n\r\n\r\n\r\n\r\n\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo\r\n\r\n\r\n\r\n\r\n \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo\r\n\r\n\r\n\r\n \r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo\r\n\r\n\r\n \r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "the proposal is focusing primarily on small businesses and their work with the government. \r\n\r\nOnce you have a business, we can assume that you already managed to realize your idea. \r\n\r\nThis section is focused on proposer outreach =  how can we increase the number of proposals and proposers in the next two funds = I think that this proposal is focused on something else, and is missing the objective. \r\n", "q0r": 2, "q1": "relevant experience stated, yet no links were provided. From this perspective, it feels quite anonymous. \r\n\r\nMore information requried.", "q1r": 2, "q2": "no metrics were provided.\r\n", "q2r": 2, "assessor": "z_assessor_54", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I think that this project may not be in the right category. It is unclear how this proposal will attract entrepreneurs to the ecosystem or support wider adoption of proposers. I think the idea is interesting but in its current form, and under the proposer outreach challenge, is insufficient for a higher score. ", "q0r": 1, "q1": "It is unclear how this proposal could be implemented. While the idea is present, there aren't any real plans provided that indicate to voters whether or not it could be implemented successfully. \r\nThe proposer should also provide more details on their experience. \r\nThe budget is way too high without any information being provided. How did the $100K budget get reached? What will it pay for? Is this a one-person job or will others be hired. Significantly more details are necessary to get a higher score. ", "q1r": 1, "q2": "This proposal does not provide sufficient information to audit the progress and success of the proposal. There are no milestones provided, no budget breakdown, no deliverables, and it will be hard for voters to know what success looks like after the fact. While I fully support the idea of the proposal, there needs to be many more details to get a higher score. ", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A Platform the help with record keeping and funding of startup cost using small contracts base of \n\nsigned government 1449 contract awards.", "experience": "15 years as a SDVOSB with over 86 awarded contracts , I fully understand the day to day problems small business have \n\nwith startup cost."}