{"id": 368414, "author": "", "title": "Competition (Top 40 under 40)", "url": "https://cardano.ideascale.com/a/dtd/368414-48088", "category": 26105, "amount": 25500, "description": "How do we get bright entrepreneurs to submit innovative proposals to the Catalyst program.", "f6_no_assessments": 6, "f6_rating": 1.3888888888888886, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal does nor define how it will attract new proposers on catalyst. It talks about creating another competition which awards entrepreneurs for their ideas. It seems the proposal is re creating catalyst in a smaller scale. I personally do not actually see value in this idea beyond what Catalyst is already offering (grant money for proposals which win the 'competition'). The proposer also lacks to define the success of the project and how the project will be advertised, who would judge the participants and the breakdown of the funds requested.", "q0r": 1, "q1": "The proposer is an entrepreneur who took part in a similar competition as the one proposed. This does not really show the capabilities of the proposer to actuate such a competition. Furthermore, the plan itself is very brief and lacks detail. It does not give confidence to its success.", "q1r": 2, "q2": "The proposal lacks identification of specific goals and therefore un-auditable. In the ambit of the challenge goals in general, it also fails to deliver or offer added value.", "q2r": 1, "assessor": "z_assessor_281", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Hi - the underlying ide is good but you dont adress the challenge: how to bring entrepeneurs from OUTSIDE the cardano community to submit proposals.\r\nYou should be more precise on:\r\nWhere to find the entrepeneurs, how to target them. Your solution only adresses the problem in finding good ideas - but we need to broaden the reach of cardano..", "q0r": 2, "q1": "As states above you are not adressing the goal of this challenge. Hence successful implementationnis unlikely.", "q1r": 2, "q2": "Although i loke the idea on finding good prposals out of a given pool - finding the pool itsself is the real challenge.", "q2r": 2, "assessor": "z_assessor_286", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The idea is great but there is no substantial information on how it is to be carried out. it gives no real information.", "q0r": 2, "q1": "The proposer knows about the idea but seems to not know how to plan r organize such a project.", "q1r": 2, "q2": "There is not enough information given on how funds are going to be used and no timeline for progress of project.", "q2r": 1, "assessor": "z_assessor_292", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The proposal could have been clearer about how the competition would atract more entrepreneurs to impact Cardano Ecosystem. Thinking about Project Catalyst, the path is the same of the competition: the best proposals are sponsored by the Project to enable the proposer to make the idea real. In short, the entrepreneur that has the best idea earns funds in Cardano. If this logic doesn't atract the entrepreneur, why would a competition with the same train of thought do? \r\n", "q0r": 2, "q1": "The budget could have been better explained and broken down into identifiable items. The roadmap also could have been better explained. It's missing a plan or a scheme to cite the resources that would be necessary: how many people, how much time to plan and create the idea competition and to design it in reality, etc. \r\n", "q1r": 1, "q2": "There aren't enough details in the proposal to afirm that there is a clear way to audit it. Some important information are missing like: a time horizon to the competition, roadmap, milestones, metrics and KPI's. Therefore, it's impossible to know how audit this proposal success. \r\n", "q2r": 1, "assessor": "z_assessor_409", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement doesn't present a problem. There is a rationale related to the challenge, but the proposal is only a draft. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\nYes. Its not stated as a problem in their statement but it is identified implicitly. \r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nYes\r\n \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nSomewhat\r\n \r\nHave key metrics and goals of the proposal been stated clearly \r\nNo\r\n \r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nNone mentioned\r\n \r\n\r\nCan the proposal scale to address future challenges?\r\nIf done properly\r\nNo as the proposal is inadequate. If the proposal were completed properly the idea can be executed\r\n\r\n", "q0r": 1, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNo. He has provided a web site of a health food supplement in South Africa. There is no FB or Linkedin profile, no Youtube channel or any other proof that he can do this proposal\r\n\r\n\r\nAre these links sufficient?\r\nNo\r\n\r\nHave you the CA visited these links and contacted the relevant people?\r\nYes I visited the site. No team members mentioned\r\n\r\n \r\nHave you been able to assess their level of competence?\r\nNo\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNone mentioned\r\n\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nNo\r\n\r\n\r\n\r\nIS budget reasonable to achieve the set goals?\r\nNo\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo\r\n\r\n\r\nHave you verified this plan?\r\nNo\r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nNo\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nNo\r\n\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nNo\r\n\r\n \r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nNo\r\n\r\n \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo\r\n\r\n ", "q1r": 1, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo\r\n\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nNo\r\n\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nNo\r\n\r\n\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo\r\n\r\n \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNothing mentioned\r\n\r\n \r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo\r\n\r\n\r\n \r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Very Easy... We will Orachstrate a competition where we will screen for top 40 business ideas under the age of 40 and live stream.", "experience": "I've taken part in a similar competition and made it to top 10 the budget was 20 million Zar \n\nI'm an entrepreneur myself for 13 years"}