{"id": 369251, "author": "", "title": "Catalyst Infosession at Tech Events", "url": "https://cardano.ideascale.com/a/dtd/369251-48088", "category": 26105, "amount": 6300, "description": "People outside the community are not getting information about Catalyst in Ethiopia", "f6_no_assessments": 2, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This a short but clear proposal with a clear goal in improving Cardano visibility and outreach.\r\n\r\ni agree.", "q0r": 4, "q1": "The proposal did not provide a verifiable link to given experience but presented a well written implementation plan with cost breakdown but also lacks timelines and milestones.", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposal solution.\r\n\r\ni disagree", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "the proposer outreach will be relatively small, and eventually, it will end up that it will provide more general information, rather than being solely focused on proposers. it is a good idea to spread the news, also, all media should be used\r\n\r\nsocial media\r\nprovide information in person\r\nadvertisement\r\nnews\r\n\r\nmy point is, that you can find many people having their profiles, or yt accounts focused on cardano, yet they have low views, so the impact is very low, also, providing information in person can result in similar outcome", "q0r": 3, "q1": "the provided qualifications could be written better \r\n\r\npossibly some proof of the previous experience would be nice to have to verify the statements.\r\n\r\nfor publishing papers or news, there is no qualification provided", "q1r": 3, "q2": "I can not come how to measure proposer outreach\r\n\r\nyet, we can measure how many people attended, somehow we can estimate involvement of people in actions and possibly some other outcomes, yet, it is not very well designed for auditability, except that something has happened", "q2r": 2, "assessor": "z_assessor_54", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Publications in local magazines, taking part in tech events by renting booths and organizing hackathons", "experience": "My background is in Urban planning and I have organized several info-sessions, project-planning and marketing at Booths before."}