{"id": 369960, "author": "", "title": "Community Bond - CRM tool for SME", "url": "https://cardano.ideascale.com/a/dtd/369960-48088", "category": 26105, "amount": 7500, "description": "Connecting all things local. Empowering local businesses & communities to increase loyalty on a digital platform using virtual coins.", "f6_no_assessments": 7, "f6_rating": 1.1904761904761905, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers have a social business product they want to build and have added a document to the attachments. They have submitted the same thing into 6 categories, all with the same limited information and most with the same text. Please apply with a project which explains how your product fits with Cardano and how it addresses the challenge.\r\n", "q0r": 1, "q1": "There is no plan on what will actually be made and how it will aid proposer outreach. Please provide a project plan on what you will produce and what the funds will be used for.", "q1r": 1, "q2": "\r\nThere is no detailed plan of what the funds will be used to produce which can be assessed against. Thus progress and success cannot be measured. It is not clear what, if anything has already been built.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Propose does not understand scope of challenge.\r\n-Does not define how it will attract new proposers \r\n-Does not define how it will result in new proposal on Catalyst\r\nIt seems to be a reward based platform built on the blockchain with rewards being distributed to the wallet.\r\n", "q0r": 1, "q1": "It is unclear how implementation looks like. They are still looking to employ a developer which means the proposal is just an idea. Nonetheless, it ahs nothing to do with attracting new proposers.", "q1r": 1, "q2": "Proposal lacks many details and goals are very vague. The linking of the proposal with actual results in very difficult. ", "q2r": 1, "assessor": "z_assessor_281", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "First of all, you submitted it into the wrong challenge, you should submit it to \"F6: DApps & Integrations\". So please check the challenges in the Future Funds and select it appropriately.\r\n", "q0r": 1, "q1": "The proposer states to have 15 years in startups, platforms and marketplace, but there are no details. Moreover there are no details on the project and it's not clear even on this site and video, are they related to prosper or he puts them as an example. If the proposer just forgot to write a detailed plan, let's hope to see more details in the future challenges. \r\n", "q1r": 1, "q2": "There are no details neither on the funds nor on the plan how they will be used. Therefore audit won't be possible\r\n", "q2r": 1, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal does not address the challenge. The problem it tries to solve is not clearly stated. For me it is difficult to see any impact of this proposal on the cardano community. ", "q0r": 2, "q1": "This proposal doesn't include enough informations to qualify as a executable project. I think that in order to juge that if a project can be implemented, it has to have a clear goal. Unfortunately, this proposal can't be implemented.", "q1r": 2, "q2": "This proposal cannot be audited because it lacks all the informations needed to evaluate it's progress. The is no clear goal, no detailed budgets and  no kpi.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n There is no problem stated. There is a statement which is not defined as a problem.\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nNo\r\n \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nNo \r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nNo\r\n\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nNo \r\n\r\nCan the proposal scale to address future challenges?\r\nNo as there is no proper proposal ", "q0r": 1, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNo team members or profiles are listed. Proposer mentioned that he has 15 years in startups platforms and marketplaces which does not give much information\r\n \r\nAre these links sufficient?\r\nNo \r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\n None to visit other than one site which I visited\r\n\r\n\r\nHave you been able to assess their level of competence?\r\nThere is no way to asess this \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\n None listed\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo \r\n\r\n\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nNo only a single figure of 7500 is given\r\n\r\nIS budget reasonable to achieve the set goals?\r\nUnknown \r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo \r\n\r\nHave you verified this plan?\r\nNothing to verify \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nNO \r\n\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nNo\r\n\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nNo \r\n \r\n\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nNo \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo \r\n \r\n ", "q1r": 1, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n\r\n\r\nIs there a clear understandable description of the targeted problem?\r\nNo\r\n\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\n\r\nNo\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo\r\n\r\n \r\nHow does the proposer plan to deal with these difficulties?\r\nNo plans given\r\n \r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo\r\n\r\nThere are no details on the proposers plan or solution therefore I cannot recommend this proposal at all. It has no team members, no plan, no roadmap, no budget other than a single figure.", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "As the other community bond related proposals, this proposal mainly consists of placeholders and is unfinished.", "q0r": 1, "q1": "No plan and no proof of qualification are presented.", "q1r": 1, "q2": "No milestones or metrics are presented, so the proposal cannot be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I find it hard to believe that this proposal would somehow increase the number of new proposers. \r\n\r\nAn app to promote products/businesses and increase the customer base based on \"loyalties\". ", "q0r": 1, "q1": "given experience:\r\n\r\nthe app is running, yet it is completely off topic\r\nno link of bio posted\r\n\r\ngiven plan:\r\n\r\nif the outcome is to have an app that is already running, then yes. It can be implemented. \r\n", "q1r": 2, "q2": "no key metrics stated", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "SME's and local businesses have limited resources, skills and time to manage their customer loyalty and marketing. Bond automates that.", "experience": "\\+ 15 years in startups, platforms and marketplaces. Social media and other international marketing experience."}