{"id": 366840, "author": "", "title": "Strengthening Stake Pools in Africa", "url": "https://cardano.ideascale.com/a/dtd/366840-48088", "category": 26117, "amount": 22000, "description": "アフリカのステークプールは、SPOが直面する一般的なリスクに加え、停電やインフラの問題にさらされている", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Although this proposal would fit into more than one challenge, it does support a group of SPO´s in learning how to avoid possible challenges in their role and provides support and empowers SPO´s to develop their skills. I would recommend that the proposers partner with a platform or group to provide the material that they researched to the general community and that they document possible threats that have been discussed to one of the groups that document in Catalyst in addition to having it on the WADA website.", "q0r": 5, "q1": "WADA is already an active and successful part of the Cardano and Catalyst Ecosystem. The milestones provided are very feasable and the budget is transparent, though it is somewhat broadly split up in categories. It is very likely that the intended outcome will be delivered and support overall security measures for SPO´s.", "q1r": 5, "q2": "Since the milestones are very step by step and the partnerships and team already work together successfully, it is going to be easy to audit via their website, the dashboards, the documentation and reports.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposer outlines unique challenges that are faced by SPO's in Africa. The peer to peer knowledge sharing means that SPOs can support each other through the learning process through sharing of ideas and challenges", "q0r": 5, "q1": "The proposer has identified specific countries where the project will be carried out. The process of carrying out the project is well outlined focusing on different things from infrastructure to governments .", "q1r": 5, "q2": "The proposer has clear goals and clear outcomes to measure success of the project. This includes the number of SPOs onboarded as well as rick scores.  ", "q2r": 5, "assessor": "z_assessor_271", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "I don't see the inherent limitations of operating SPOs in Africa as disasters but as recurrent conditions, largely due to local infrastructure. But regardless of whether this situation is commonplace or an eventual disaster, I believe the main idea is to ensure the resilience of the SPOs, so there is a relationship with the challenge.\r\n\r\nThe proposed solution is within the items established in the challenge brief.\r\n\r\nI believe the number of 5 SPOs is a small sample to identify bottlenecks and problems on the African continent. If the idea is to carry out a comprehensive local assessment, I believe that the number of participating SPOs should be greater.\r\n\r\nI understand that the stage of data collection and monitoring of SPOs specifically in Africa is desirable to understand local risks and particularities, but the results of this will be public and may benefit SPOs in situations analogous to the African continent, so I think it would be more advantageous to expand participation in the post-monitoring phases to enable a collaborative effort by the entire community.\r\nSeveral places around the world have infrastructure problems similar to those seen in Africa and I believe they could also benefit from this proposal. The tools, data and reports in this proposal could be used by SPOs in similar infrastructure conditions to that observed, both in Africa and on other continents with similar conditions. Limiting the proposal's scope in Africa decreases the proposal's potential impact on the community.\r\n\r\nThe goals established in the roadmap are relevant to the challenge and the metrics are good impact indicators. I would recommend including KPIs and considering that reports, tests and tools will be produced, these items could be used to estimate KPIs and improve the impact assessment.", "q0r": 4, "q1": "Proposers described experiences relevant to the proposal's implementation. The experience of an SPO + the expertise of WADA in several projects in Cardano indicate feasibility for implementation.\r\n\r\nThere is a budget breakdown, but I would recommend including more detail on the work that will be carried out in the different stages for a better feasibility assessment.\r\n\r\nA reasonable timeline was provided for conducting and delivering tests, delivering reports, data and tools.", "q1r": 4, "q2": "The problem, solution indicates alignment with the challenge, but I see the proposal more as something related to improving the infrastructure than a disaster solution.\r\n\r\nThere is a roadmap with objective goals and several metrics relevant to auditability, but no KPIs were included.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The challenge is that stakepools in Africa are subject to outages and infrastructure issues on top of the general risks faced by SPOs. This proposal aims to design a support system specifically for the unique challenges of running a stakepool in Africa and create a learning hub for African SPOs. Given the proposal, it does credibly addresses the challenge.", "q0r": 5, "q1": "The team for this proposal is experienced and has an SPO with the first Cardano relay node based in Ghana, and has peer-to-peer collaboration portal within the WADA membership program. The plan aims to create an environment where African SPOs can connect, learn from each other and share best practices. This team is very well experienced and the plan they plan to implement is highly likely to succeed.", "q1r": 5, "q2": "Based on the proposal and the 3-month interval milestones implemented. The primary deliverable is that within the first three months that the SPOs have all completed their reporting and contributed significantly to the documentation. This project has sufficient information to audit the progress and ensure success.", "q2r": 4, "assessor": "z_assessor_431", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "アフリカでステークプールを運営する際のユニークな課題に特化したサポートシステムを設計し、アフリカのSPOのための学習ハブを構築する。", "experience": "ガーナに拠点を置く初のカルダノ中継ノードを持つSPO。SPOのためのメンバーシップとピアツーピアの学習プラットフォームのためのWADAとのパートナーシップ"}