{"id": 369921, "author": "", "title": "SPOCRA: Re-location Fund for SPOs", "url": "https://cardano.ideascale.com/a/dtd/369921-48088", "category": 26117, "amount": 80000, "description": "敵対的な規制が法制化されることで、これまでの合法的なSPOビジネスができなくなることが現実味を帯びてきています。", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": ["https://youtu.be/dIwx6LaUgM0"], "media": [], "f6_assessments": [{"q0": "The proposal communicates clear that a global operation in the midst of market adoption and legislative forces/ governments are starting to take action against DeFi operations as we´re seeing for instance in the US, where the SEC is making many adhoc uninformed decisions that cannot be forseen at the moment. It would be vital to protect BEFORE any action against one of the most important measures of success of Cardano - the voting - might be impacted.", "q0r": 5, "q1": "SPOCRA is already operating and it makes sense that they develop and prepare for these szenarios. The milestones are reasonable and necessary to support the existing structure of SPO´s. The budget is very broad at the moment. The budget for educational purposes should be reassessed and split up - relocating SPO´s should not be considered an educational program, so these costs should be taken out of the recovery fund, not the educational fund. In general, it would be necessary to get more into detail, what options for SPO´s there are and use the funds to create educational material from as many countries and provide them ot SPO´s and set up troubleshooting channels to support SPO´s that face legal challenges. I suggest that the financial plan and actionable milestones will be made more transparent as this project claims more than 50percent of the allocated funds for this challenge.", "q1r": 3, "q2": "Yes, it can be audited in that communication channels will be set up, material about government crypto regulations for DeFi will be provided and that a treasury for legal help is available for SPO´s that are in need of assistance. It would still be good to have more concrete milestones. The website could be used to store the educational/legal material.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "As an SPO myself I know that the biggest threat is not hackers, a data center being burned down, a weakness in our dear blockchain or even quantum computers... It's stupid regulations made by ill-advised old people that can turn you into a criminal over night because it pleases certain lobbyists.\r\nThe threat is very real as seen in the US where laws can get passed despite not making sense and hurting the future of the country.\r\nBeing prepared for such an eventuality is necessary to retain our resilience.\r\nSo regulatory troubles must be anticipated for the good of the community. In this way this proposal will provide funding to do preemptive legal research as well as providing an emergency fund that could be used by certain \"key community\" SPOs to help them relocate to a better country so as to protect the network efficiency. I'm a little bit concerned about the relocation fund for key SPOs because if they are key, they already have the means to take care of themselves don't they? (of course this is given from the perspective of a \"small\" SPO).\r\nDespite this, this proposal is a perfect fit for this challenge so I give it a rating of 5 in this impact criteria.", "q0r": 5, "q1": "SPOCRA was one of the very first SPO representative entity so they do seem well equipped to reach this proposal's goals.\r\nHowever they do not detail any clear path toward their objectives, they don't mention any lawyer firm they could already be in contact with that would be interested to work with them on the matter.\r\nNo next concrete actions is planned out in their proposal. We could imagine that they will research what to do once funded but it would have been more correct to have the path and the actions laid out clearly before being funded.\r\nThere is also no clear member experience mentioned anywhere, regulation is a very special topic where improvisation is quite limited. More assurance would have been useful to establish the feasibility of this proposal.\r\nThe budget is not very detailed either, a better estimate with maybe some quotations from lawyer firms would have been useful (like counseling cost per hour and number of hours, etc...).\r\n\r\nI often talk about the GTD method to my friends (Getting things done) where it is explained that the only way to do something is to define the very next concrete actions that will make a project move towards its completion in reality. This proposal clearly lacks this and therefore may not go very far.\r\nI prefer to give them the benefit of the doubt because, 1st, it's SPOCRA and 2nd, this topic is very important and needs to be addressed so any progress would be useful but this proposal could have been much better...\r\n\r\nSo although really needed I can only objectively give a rating of 3 out of 5 to this feasibility criteria as the plan is lacking in concreteness...", "q1r": 3, "q2": "This proposal mainly contains 2 parts:\r\n- An emergency fund\r\n- A research and legal fund for regulation research and law firm fees\r\n\r\nIn the proposal it is said that one can monitor the use of funds through an explorer. It is true of course, but seeing that the fund are spent or not is not all auditability is about.\r\nThere is a lack of clear actions in this proposal. The end goals are nice but the intermediate concrete steps (with KPIs) to get there are vague or completely missing which will make this proposal difficult to audit.\r\n\r\nFrom what they wrote, we can only expect that they will hire a lawyer and the following:\r\n- Create some documentation of some sort to clear the fog in the US concerning SPO regulations and have an influence somehow on the laws being made in the US.\r\n- Research other countries regulation to find where an SPO could eventually relocate themselves.\r\n- Create a legal representative presence to embody the needs of SPOs and do some lobbying (not mentioned directly but a logical consequence)\r\n\r\nSPOCRA does require funding to do its work and provide its services to the SPO community maybe they could have been clearer about that need and even asked for more with concrete budget allocation and detailed expected operation costs.\r\n\r\nThe relocation fund is not very convincing and would be better used for legal researches and lobbying in general in my own personal opinion.\r\n\r\nGiven all that I can only give them a 3 on 5 concerning auditability.\r\n\r\nI do want to mention that I will vote yes to this proposal despite the mitigated ratings I give them in feasibility and auditability because I do feel in danger from the regulator as an SPO and need entities like SPOCRA to exist and grow... A mitigated solution as the one they offer is still better than none!", "q2r": 3, "assessor": "z_assessor_40", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The problem description and solution are reasonable and within the scope of the challenge.\r\n\r\nThe recent decision by the US Senate to pass a trillion-dollar infrastructure bill ended up including uncertainties for the crypto market, serving as a wake-up call, context:\r\n\r\nhttps://www.cnbc.com/2021/08/11/crypto-lawmakers-fought-over-the-infrastructure-bill-heres-whats-next.html\r\n\r\nGovernments have been creating increasingly restrictive regulations for the crypto market. The Chinese government recently tightened its grip on miners and forced a massive migration of miners that impacted a large percentage of hash power.\r\n\r\nThese are troubling signs that have caused a stir throughout the ecosystem. Tough regulations compromise blockchain resilience and put SPOs at risk, having an internationalization plan for SPO migrations is an excellent way to address the challenge.\r\n\r\nRelevant and reasonable targets have been set. I would only recommend the inclusion of metrics/KPIs that allow us to quantify the impact in a more comprehensive way.", "q0r": 4, "q1": "The SPOCRA team is composed of several SPOs widely known in the Cardano community and with diverse contributions to the Cardano ecosystem. Considering that much of the proposal's content is about establishing a plan that takes into account many legal aspects in different jurisdictions, I would recommend indicating who would be responsible for providing this assistance/consultancy, as there are few professionals who understand the different nuances and facets of cryptocurrency/blockchain/legislation markets at the same time. This would also be important for a more precise definition of the lawyer's consulting services.\r\n\r\nThere is a budget breakdown with rationales for resource allocation, but I believe that more accurate estimates and examples of resource utilization could be established. Basically half of the budget would be allocated to a treasury that would be used in cases of need for relocation of SPOs, but it is not clear how much would be allocated in these cases and what amount. What exactly would relocation involve? Pay for operators' flights to another jurisdiction? To cover part of the costs? Who will be able to claim these resources? If there is a crackdown in any country where there is relevant SPO participation, $40,000USD would only serve as partial coverage.\r\n\r\nThese questions are not so much towards the aspect of trust with the administration and allocation of resources, but more about  the logic and feasibility of the idea.\r\n\r\nA reasonable timeline and solid goals were presented.", "q1r": 4, "q2": "There is clarity in the problem, the proposed solution and their alignment with the challenge.\r\n\r\nA roadmap with reasonable goals was provided, allowing betteraudititability, however there are no metrics or KPIs that would improve auditing.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I'm in full support of an independent trade organisation that is member based and represents the interests of members. On that basis, paying members of the SPOCRA should be advocating that the SPOCRA setup and allocate these funds aside. I'm not really sure this is a good use of Treasury funds. ", "q0r": 1, "q1": "The team seem very experienced so if this is funded I'm sure they are able to put those funds away and use them for the desired purpose. ", "q1r": 5, "q2": "The inspectable and auditable deliverables are a bit loose and could do with more definition. It would of course be easy to inspect the wallet addresses that hold the funds. Some more information on the 3, 6 an d12 month milestones and what will actually be delivered for audit would improve this proposal.", "q2r": 3, "assessor": "z_assessor_493", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "この現実的な災害の脅威に対するSPOCRAの危機管理計画は、再配置のために用意された資金で主要なコミュニティのSPOをサポートすることです。", "experience": "SPOCRAは、経験豊富なステーク・プール・オペレーターで構成されており、そのスキルは多岐にわたります。"}