{"id": 382940, "author": "mr.mietrich", "title": "Build out 14 Digital Language Hubs", "url": "https://cardano.ideascale.com/a/dtd/382940-48088", "category": 26244, "amount": 17500, "description": "There are not enough digital hubs which serve as a starting point for new people. These are lacking resources to provide active engagement.", "funded": 2, "upvotes": 61006734, "downvotes": 4375759, "votes_result": 56630975, "votes_cast": 120, "f6_no_assessments": 5, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This team particularly addresses the challenge by building more 14 digital hubs in 14 languages that help to spread the Cardano info, therefore, that is what we need now for developing the Cardano ecosystem faster and diversity. \r\nMoreover, their KPIs is aligned to what the challenge outlines. \r\n", "q0r": 5, "q1": "The team has their experience with the attached links that show they have outstanding ability to execute this idea. \r\nThis idea of the project is simple, so their explanation about the Hubs is enough to clear what they gonna do. Therefore, it helps to clarify their detailed roadmap and budget breakdown are all reasonable and realistic. \r\nBut I hope that they can provide more detail in content about which topic, content sources, activities, infos... that they will provide for the hub. And more is risk/ challenge that they can be meet when implementing this idea. ", "q1r": 4, "q2": "The team has shown the detailed roadmap and KPIs that are just enough for admitting their progress.\r\nThe solution explanation is enough to address the standing problem, but I hope that team can give some more info about their implementation plan, it will help us assess the feasibility of this project better. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This is an interesting idea put up by the proposer, great job. The proposal is quiet interesting and effectively addresses the challenge. this project has the potential of onboarding citizens of different languages unto the cardano ecosystem in the digital space.", "q0r": 4, "q1": "The proposer's team per the link he provided and what they are building have what it takes to execute the project. The budget is moderate and will be able to execute the project. The proposal doesn't present a detail plan and structure on how the implementation process will be what resources will be needed at which point in time etc.", "q1r": 4, "q2": "The proposer has a roadmap in place but not detailed for easy tracking of activities. The proposer has stated the KPI's and further stated how success will look like when the project is successful. The proposer has not stated the likely risk that can be associated with the project which i think is key.", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "Digital hubs are an efficient and appropriate way to scale the Cardano ecosystem on this modern days. However, this idea is not very creative or new. The strength of this project is that they create a close-knit community (they participated in this fundraising round with many proposals and also previous fundraising rounds). This is very beneficial for building a strong and sustainable community because there are strong links. In addition, the selected languages ​​are also popular languages, so it promises to attract more people who use that language to the Cardano ecosystem.\r\n", "q0r": 4, "q1": "Currently, the project team has available resources (implementing the project from the previous Fund), so it is highly likely that the team will develop successfully when taking advantage of that resource. The proposal also includes detail plan with the roadmap. The expected fund is reasonable and well-explained.", "q1r": 5, "q2": "The proposal includes clear roadmap, which make it easy to track their progress. However their KPIs is lack of quantity number for each goal, which will help the project's success become more measureable.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is touching the need of this challenge since it wants to build 14 digital language hubs (websites). However, I don't think its impact is high because its target audience remains unclear, just \"new people\". Whilst there are many funded/ proposing projects like this but having with more specific goals. I concern that what are the different values this proposal could bring to Cardano community?", "q0r": 3, "q1": "- This proposal should add a development plan since it's lacking. \r\n- I couldn't see the how the team collect information about Cardano, or select from which sources?\r\n- Since translation documents is the most important work, I can't find it in the budget. I advice team to break down budget into more specific scope of works.\r\n", "q1r": 2, "q2": "Roadmap is clear but KPIs remains blank, I suggest team to spend more time working on it and define a key metrics to success also. Since this proposal doesn't give me sufficient information to assess, I rate 2 for its auditability.", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This is a potential proposition, it creates 14 digital hubs and provides some resources supporting materials and people in precarious situations, to strengthen existing community projects that are forming hubs for access and information about the Cardano blockchain in other languages then English .", "q0r": 4, "q1": "Although the team has provided sufficient experience, knowledge, and previous projects of the team, it is the basis for the successful implementation of the project. However, it would be great if such information is verified (proposers can provide more profiles of relevant people, linked in,...)\r\nRoadmap and budget allocation provided. However, it is necessary to clarify the indicators of success (specific data should be provided).\r\nThe proponent mentioned the projects done in Fund6 and related projects in Fund7, I have looked through them, I think this project will be implemented successfully.", "q1r": 4, "q2": "The information provided is not exhaustive, but we can still judge its success. I appreciate that you have created Educhainment, and it is self-sufficient based on its own funding. The person to export needs to add the same information as I mentioned in the previous section. Besides, identifying the difficulty-challenge as well as how to solve that difficulty-challenge is also extremely important. This is a good proposal, if it is implemented, I am sure it will bring a lot of value to the community.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Leverage existing projects to create 14 digital hubs and provide some assisting resources for materials and people in precarious situations.", "experience": "Educhainment team, which is currently building language based digital hubs to collaboratively create a language database + L2-learning game."}