{"id": 383983, "author": "adenan44", "title": "Cardano to the Every Ghanaian", "url": "https://cardano.ideascale.com/a/dtd/383983-48088", "category": 26244, "amount": 25000, "description": "How will Cardano become a household name in Northern Ghana?", "funded": 1, "upvotes": 51791321, "downvotes": 9752214, "votes_result": 42039107, "votes_cast": 134, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assess proposals in this challenge. The proposal identifies an interesting place for a Cardano community hub. Further extending the outreach of DLT technology and Cardano can only be beneficial for both local people and the Cardano ecosystem. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nOff course, by disseminating knowledge and engagement regarding Cardano into new territories will also help with future scalability.", "q0r": 5, "q1": "The proposers credentials and organisation seem credible, so I am of the opinion that it's highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and is in general very detailed. A great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This team wants to make Cardano become a household name in Northern Ghana by putting Cardano at vantage points to catch people's attention easier, it will be a training center and do some marketing... the team states out their plan into actions, activities, and materials that we can appreciate their try to make Cardano effect to communities in Ghana. Therefore, this project impact strongly the development of Cardano community. \r\nIn addition, All of their key metrics and output are absolutely aligned with the challenge mission and I believe that with their vision, this will help to scale up the Cardano to every house.", "q0r": 5, "q1": "The members of the team are all outstanding to succeed this project, more than that their implementation plan very details to clear every part from event organization, people, activities, deliverable to people and Cardano... but they don't provide a roadmap for showing their way to develop this idea. I think the team should have, activities in some first months that are very different from regular activities when it is stable. And when having a detailed roadmap of development, they can be aware of the potential relevant risk and get rid of them. \r\nAlthough don't have the roadmap but their budget is reasonable for organizing everything in one year. ", "q1r": 3, "q2": "There is no roadmap in this proposal, so it's hard to audit the project. Even the team has a detailed plan about what they will do regularly but I think that is in the stable phase of the project, maybe starting from the 3rd month to the end of the year. \r\nThe team has experience with the problem and its context, hence that is the reason why they have a detailed implementation plan that's perfect for developing their idea. \r\nHope that they will make it come true", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 3, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is about setting up the Cardano hub in Northern Ghana, which is clearly in line with the challenge - Community Hubs. A number of educational and marketing activities are proposed, with the key metrics and expected results.", "q0r": 5, "q1": "The team looks fairly competent with a good mix of marketing and financial professions. However, proof of skills&experience is not clearly presented so I will deduct a point here.  \nThe budget is clear and covers the cost of personnel, equipment, space and activities. I estimate that the rates are fair for the purpose and country.\nThe action plan proposes concrete metrics such as people trained or conferences organized inside 6 months which will be easy to monitor but possibly ambitious.", "q1r": 4, "q2": "A roadmap with milestones including the timeframe is presented. Metrics needed to measure the success are also included.\nOverall, the proposal is in line with the challenge and is clearly formulated. ", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Put Cardano at vantage points that will catch the attention of the people. A center for training, Social Media invasion, target marketing et", "experience": "As a College ICT Tutor, ii have trained many in the area of ICT."}