{"id": 383191, "author": "nvhieu", "title": "Simplify SPO operations in Vietnam", "url": "https://cardano.ideascale.com/a/dtd/383191-48088", "category": 26246, "amount": 19670, "description": "La plupart des pools d'enjeux fonctionnent sur des fournisseurs d'hébergement communs (AWS, GCP, Azure). Nous avons besoin d'un réseau autonome plutôt qu'il ne l'est actuellement.", "funded": 1, "upvotes": 42251770, "downvotes": 13787296, "votes_result": 28464474, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition répond très bien à l'objectif du défi, qui est de contribuer à la décentralisation du pool d'opérateurs de Cardano. Initialement, lors de ma première lecture de la proposition, j'ai pensé que la décision du proposant d'opter pour une solution double (a. simplifier l'installation et fournir des guides de pool de piquets et b. fournir un kit de produit de pool de piquets à énergie solaire pré-installé à commercialiser) pourrait être exagérée. Mais en fait, à bien y réfléchir, il y a beaucoup de valeur dans une approche combinée et cela ouvre également la porte à des synergies qui sont naturelles. Je dirais également que la proposition est bien étoffée en termes de plan de mise en œuvre et j'ai l'impression générale qu'elle sera rentable si elle est bien mise en œuvre. J'ai été impliqué dans le projet Catalyst depuis le tout début et j'ai été CA et vCA. J'ai également assemblé un Raspberry Pi et l'ai utilisé (en tant que non-technicien), et j'ai travaillé à la mise en place d'un stakepool pendant les journées ITN sur une machine Ubuntu (non Raspberry Pi) à la maison (je ne l'ai pas finalisé, malheureusement). Je serais probablement un exemple de personne qui pourrait bénéficier (si j'étais vietnamien) d'une proposition de ce type. Donc, ce que je pourrais considérer comme un léger problème, c'est que l'énoncé du problème dans cette proposition identifie correctement que \"l'exécution des pools de pieux sur les principales plates-formes de nuage offre la commodité ... donc la plupart des pools de pieux sont exécutés sur 3 grands fournisseurs de nuage (GCP, AWS, Azure)\". Cependant, une partie de la solution proposée consiste à déployer un système de pool sur le cloud à titre d'exemple, puis à enregistrer les étapes sous forme de vidéos. Il semblerait plus logique de déployer le système de pool sur un Raspberry Pi à titre d'exemple (ce qui fait déjà partie de la proposition) ou au moins sur un serveur physique Linux - afin de mieux répondre aux problèmes réels auxquels un non-technicien serait confronté. La proposition elle-même indique qu'elle vise à simplifier la configuration pour les non-techniciens, donc - ma suggestion serait de se concentrer sur le déploiement non-cloud comme exemple, et d'enregistrer des vidéos de ce processus qu'un non-technicien avec un Raspberry Pi ou un ordinateur personnel sera en mesure d'apprendre davantage. En fait, ce serait une bonne idée de changer l'ordre, de sorte qu'au lieu de commencer la mise en œuvre par \"créer des instructions simples, des vidéos et des scripts d'installation et d'exploitation en vietnamien\", cela pourrait suivre après la création et le fonctionnement du kit Bare-metal de piscine à énergie solaire. Ce n'est qu'ENSUITE qu'il faudrait créer un ensemble complet d'instructions, de vidéos qui traiteraient également des questions spécifiques à ce kit de SPO solaire et à d'autres similaires, ainsi que des questions générales de configuration du pool de piquets. Cela aurait un impact plus important, car le kit et les instructions seraient parfaitement alignés et compatibles.", "q0r": 4, "q1": "Le proposant a fait un bon travail en décomposant le budget en éléments plus petits et, pour une proposition dont l'horizon est très visible, cela aide également à visualiser le projet. Lorsque j'ai additionné les composantes du budget, les coûts totaux ne s'additionnaient pas de la même façon que le proposant [(1)+(2)+(3)+(4)+(5)+(6)=750+650+600+350+15820+1500=19 670$] les a additionnés. Mon calcul a donné un total différent, basé sur la ventilation du budget que le proposant a fourni. Cependant, la somme à laquelle j'ai abouti était de 19 570 $, ce qui constitue une erreur de frappe sans importance de la part du proposant. Il n'est peut-être pas nécessaire de configurer deux fois un pool de piquets (sur un nuage et sur un métal nu) si l'idée est de promouvoir des configurations SPO non nuageuses - cependant, le proposant peut avoir une raison valable et je ne lui retire pas de points pour cela. Je serais intéressé de savoir si une batterie de 150 $ et un stabilisateur de 100 $ seraient suffisants comme sauvegarde pour un pool de pieu alimenté par l'énergie solaire (ou peut-être seulement pour le producteur de blocs, pas les relais aussi ?) Si oui, ce serait une solution étonnante. Par conséquent, je félicite le proposant d'avoir inclus dans le projet un composant conçu pour calculer la consommation d'énergie pour Raspberry Pi exécutant un pool de pieux Cardano. L'équipe qui propose le projet a fait preuve d'une grande transparence en ce qui concerne ses compétences de base et a participé à la création de stakepools vietnamiens. L'un d'entre eux est - selon son profil Linkedin - compétent dans la conception et la fabrication d'équipements (Python, C#, codevision, lampes solaires à LED, lampes de pêche à LED) et, depuis 2018, a été impliqué dans la recherche sur la blockchain et Haskell, avec un master en électronique et ingénierie électrique. La faisabilité semble être une évidence. Ce que je recommanderais, c'est que l'équipe essaie de se mettre à la place d'une personne non technologique, car ils font toute cette proposition pour de tels \"consommateurs\". En fait, il serait vraiment bon - si cette proposition ne passe pas ce fonds - de la soumettre à nouveau avec un ajout à l'équipe. Qui ? Une personne non technique ayant une faible familiarité avec Cardanoi. Cette personne non technique ferait partie intégrante de l'équipe, en signalant ce qui n'est pas compréhensible et ce qui doit être mieux expliqué. Le budget pourrait être augmenté en conséquence, pour couvrir l'engagement de la personne non technique (que l'on espère enthousiaste) (mais avec un taux horaire inférieur) - comme un \"cobaye\" aidant à garantir que les guides livrés sont vraiment compréhensibles pour une personne non technique. L'équipe a identifié certains risques, tels que les difficultés de déploiement d'un pool de pieuvre bare-metal sur Raspberry PI - je pense que les solutions possibles auraient dû être analysées de manière beaucoup plus détaillée dans la proposition (et étoffées en plus de quelques mots) - car cela est crucial pour le succès d'un pilier clé de cette proposition.\n", "q1r": 4, "q2": "L'équipe a fourni une très belle feuille de route générale pour les activités prévues. Les métriques/KPIs semblent être un peu inachevés. Il aurait été bon de mesurer le temps nécessaire à une personne qui n'est pas un technicien pour mettre en place le pool d'enjeux final avec 2 relais et 1 BP sur Raspberry PI avec de l'énergie solaire - SANS aucune aide du proposant. Cela permettrait également d'identifier les points faibles avant la proposition de suivi prévue pour le prochain fonds - ce qui conduirait à identifier au moins 5 FS vietnamiens pour prendre part au déploiement. Certaines étapes semblent un peu trop difficiles à vérifier, car nous n'avons pas de format de livraison proposé. Par exemple, \"l'emballage physique du kit de mise en commun des pieux\" est une définition du succès après 6 mois. Cependant, nous n'avons aucune information sur ce qui serait un \"emballage physique réussi\" et ce qui est un \"emballage physique non réussi\". Ou \"redimensionner la configuration matérielle. Fournir une construction optimisée des matériaux et des spécifications\" - cela semble être un objectif, mais comment cela sera-t-il fourni ? Un livret/manuel dans l'\"emballage physique\" ? Ou autre chose ? Comment quelqu'un vérifiera-t-il ces étapes ? Voici un autre exemple de définition de la réussite après 4 mois : \"Faire fonctionner une piscine à piquets avec 2 relais et 1 BP sur Raspberry PI en utilisant l'énergie solaire\". Ma question est la suivante : est-ce que cela signifie l'alimenter et le faire fonctionner pendant 5 époques ou est-ce que cela signifie faire fonctionner le stakepool avec 2 relais et 1 BP sur l'énergie solaire pendant 6 mois (puisque la proposition demande 3 IPs*6mois ~ 250 USD) ? Il serait bon de donner un calendrier précis, afin que le succès puisse être clairement vérifié. Quelle est la probabilité qu'un autre objectif de réussite soit atteint (\"Le premier bloc est frappé sur le kit de mise en commun de l'énergie solaire.\") après quatre mois ? Si nous savons que la frappe de blocs dépend en grande partie de la délégation des enjeux et que la Fondation Cardano pourrait décider de ne pas déléguer une partie de ses enjeux au nouveau pool ? L'utilisation d'une incitation de 1 500 $ pour attirer les délégués pourrait sembler être une utilisation inefficace des ressources - et je ne suis pas sûr que cela fonctionnerait vraiment pour remplacer une participation de la Fondation Cardano (vous pourriez donc peut-être fournir une ventilation de l'utilisation spécifique des 1 500 $). D'autres produits de la proposition \"Calcul du retour sur investissement\" (16 heures de travail) - semblent peu clairs en termes de livraison. À qui sera-t-il remis, comment sera-t-il présenté, sous quel format doit-on s'attendre à le voir ? De même, \"Partager comment créer une piscine à énergie solaire\" - cela semble un peu trop vague... encore une fois, il serait utile pour la vérifiabilité et la clarté de la proposition de préciser quel type de matériel sera partagé, où, quand et si ce composant sera un guide vidéo, un document électronique, une brève page en dix étapes ? Si la proposition n'est pas approuvée par ce fonds, il serait bon d'être très précis au moment de la soumettre à nouveau - afin de fournir des étapes plus claires et plus vérifiables. J'ai l'impression que toutes ces informations sont déjà disponibles dans l'esprit de l'équipe chargée de la proposition, alors mieux vaut mettre sur papier l'ensemble du plan impliquant les éléments livrables. Le fait que l'équipe reconnaisse qu'il pourrait y avoir des difficultés pour le déploiement d'un pool de pieuvre bare-metal sur Raspberry PI - signifierait probablement que le budget devrait refléter les coûts possibles impliqués dans la recherche d'alternatives (il y a une réserve pour les risques dans le déploiement, mais comment a été obtenue cette somme de 1500 $ ?) - ou expliquer comment cela affecte la solution proposée.\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "Great Idea and necessary for Vietnam.", "q0r": 5, "q1": "This proposal is so clear and detailed. Member in this team also have experience. I believe that this idea can successful. In other side, I wonder that are you sure that need so more money like above? $1 USD = 23,010 VND, $19670 is so much for one project in Vietnam. Moreover, $70/ hour is too much and did not appropriate.", "q1r": 4, "q2": "The information provided clear and detailed. Have left a lot of personal information to prove the authenticity of the project. The people who carry out the project are experienced, well qualified. I am also a student of Vietnam National University, Ho Chi Minh, although not in the same city, but in the same training place. I know better than anyone to be a lecturer in this environment is very difficult, must be really nice. ", "q2r": 4, "assessor": "z_assessor_756", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree this challenge is critical to achieve Cardano's decentralize mission. \r\n\r\nThe proposal addressed the key concern of of Vietnamese communitive. The more stake pool operates, the more decentralize the network will be. Bringing the renewable energy sources to operate the stake pool also great idea for sustainable development.\r\n\r\nIt would be great if proposer provide more information about how many percent of stake pool in Vietnam as compared with cardano's total stake pool then voters can image how can this proposal can impact to Vietnamese community.", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. The proposers are currently Stake Pool Operator then they have all the experience in running it. \r\n\r\nThe budget is clear and reasonable for each items. The milestones are realistic and feasible. \r\n\r\nThe only point I would add is a deeper analysis about the solar solutions: ie: the average of energy consumption for each stake pool per month. If it is a big amount then the solar energy can help, bare in mind that the solar panel and battery are also not environment friendly.", "q1r": 5, "q2": "\"The proposal includes a roadmap with targets and a plan extending to June 2022 and the mass adoption will be consider in next fund which show a carefull approach of proposers. \r\n\r\nThe proposal shows detailed steps, milestone and deliverables that will be simple to check if the project is running on schedule. \r\n\r\nOn the material to run SPO in Vietnamese (including the documents as well as the video), i would suggest proposer provide KPIs for the audience reach (ie: subscriber on youtube channel, website visitor increase...)\"", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion this proposal could improve the stakeholder participations in the Cardano community Stake Pool Operators and the developer work on cardano blockchain.\nThe proposal have the correct mix from building and deploying a new kind of stake pool (bare metal vs cloud), ecological solar power, passion for creating educational contents…\nHowever the objective of the proposal is interesting and it’s good for growth the Vietnamese community, but I think it's important to enrich the proposal with other kind of support for SPOs, because only building a new stake pool doesn’t enough to improve economics for Vietnamese communities.", "q0r": 4, "q1": "The proposer team has very good experience, because they are very well experienced Stake pool operators member. \nThe metrics for the assessment are given, so it’s possible to assess what the proposer wants to do and the success of his actions. Roadmap and milestones are described (date, actions, kpi).", "q1r": 4, "q2": "Roadmap and milestones are basically described. The budget’s information provided is described. There aren’t a lot of KPI to identify the proposal goal, but only deliverables. There are some details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution. Futhermore there are basic information to asses.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Simplifier les guides d'installation et d'utilisation des piscines à piquets pour que les non-techniciens puissent le faire. Fournir au marché des appareils pré-configurés pour les piscines à énergie solaire.", "experience": "Nous sommes des OSP, des modérateurs de débats de l'Est, des experts en technologie blockchain, en électronique et en automatisation."}