{"id": 383285, "author": "skryptlabs", "title": "Cardsec 🔒: SPO Self-Audit Toolkit", "url": "https://cardano.ideascale.com/a/dtd/383285-48088", "category": 26246, "amount": 20500, "description": "Il est nécessaire de disposer d'un guide de sécurité pour les pools de piquets et d'outils d'auto-vérification pour les opérateurs de pools de piquets et les développeurs exploitant des nœuds Cardano.", "funded": 1, "upvotes": 67326596, "downvotes": 7556263, "votes_result": 59770333, "votes_cast": 145, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing basic security tools and guides is essential to building a sustainable Stake pool operator ecosystem for cardano. improving SPO security from the start would add tremendous value and definitely benefit cardano.", "q0r": 5, "q1": "Although the team states they are cyber security enthusiasts with great understanding of the cardano ecosystem, this proposal would benefit from providing more details on their relevant experience that they will apply to this project along with what qualifies as a deep understanding of cardano infrastructure.", "q1r": 3, "q2": "This proposal does provide a timeframe for the phases, details on each phase of the project, as well as KPIs to audit the progress and success. The proposal would benefit from providing a more detailed breakdown of the budget and how the funds will be spent.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This is a support tool for SPOs about self-auditing tools. Having errors in the pool operation is quite common, which can seriously affect the pool operation, closing the transaction confirmation block on the network. Therefore, I think this is a practical and necessary tool for SPOs.", "q0r": 3, "q1": "The team showed seriousness in the proposal. The team has experience in programming techniques, system security, and has clear goals, so the feasibility of this proposal is highly appreciated.", "q1r": 4, "q2": "Testing the performance and benefits derived from this tool is fairly easy to check through the community of SPOs. The code is public, censored, the number of people using the support tool can be counted.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This SPO cybersecurity focused solution could help harden the setups for SPOs run on cloud servers. The proposal is in line with the challenge to grow global sustainable independent SPO layer.", "q0r": 5, "q1": "The plan includes a detailed roadmap, and outlines the portions of the system funded in previous round/under development as well as future components. The team is already catalyst backed from fund 6*", "q1r": 5, "q2": "The information in the roadmap, plan details and GitHub repos are sufficient to audit the progress of the project.", "q2r": 5, "assessor": "z_assessor_931", "no_vca": 20, "ne": 1, "ng": 10, "nfo": 9, "vca_o": 1}], "solution": "CardSec élabore des guides et des outils de test open-source conviviaux adaptés aux serveurs exécutant des nœuds Cardano.", "experience": "Proposants financés par Fund6 ayant une connaissance approfondie de l'écosystème et de l'infrastructure de Cardano. Passionnés de cybersécurité et de renseignements sur les menaces."}