{"id": 381523, "author": "bmoore", "title": "ReWILD! : Bison Ranching in AR", "url": "https://cardano.ideascale.com/a/dtd/381523-48088", "category": 26241, "amount": 65000, "description": "Les jeux sur ordinateur peuvent être une activité sédentaire aux conséquences physiologiques et psychologiques potentiellement négatives.", "funded": 1, "upvotes": 27322727, "downvotes": 22558097, "votes_result": 4764630, "votes_cast": 146, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": [], "media": [], "f6_assessments": [{"q0": "Le jeu est très intéressant, je crois que c'est la première proposition que j'évalue dans ce défi qui cherche un moyen de jouer en plein air, une sorte de pokemon go (ce jeu était une fièvre là où je vis) de buffles, dont l'objectif est de capturer ces animaux (qui seront des NFT) et de les élever. La relation du jeu avec notre blockchain est précisément que ces buffles sont sous forme de jetons, et tout ce qui les concerne est une transaction monnayée dans la blockchain Cardano, par exemple : leur maturité, leur localisation géographique et leurs caractéristiques, comme la température, le poids, etc. C'est une idée très originale, à mon avis, et elle peut très bien fonctionner, je pense qu'elle est très attrayante pour ceux qui s'intéressent à ce type de jeu, étant un mélange de jeux où nous pouvons gérer des environnements (par exemple, des jeux de ferme, mais dans ce cas totalement axés sur les buffles) et aussi des personnages de chasse comme le pokemon go. Je vois du potentiel dans cette initiative, et je crois que le fait d'avoir toutes vos informations frappées dans notre blockchain profiterait grandement à l'écosystème Cardano. Je voulais juste mieux comprendre comment cette question de réalité augmentée fonctionnerait : les joueurs téléchargeraient l'application sur leur téléphone portable, mais comment le jeu serait-il lié à l'environnement ? Et à quoi cela ressemblerait-il pour une personne équipée de lunettes de réalité augmentée ? Comme il s'agit d'une idée très originale et quelque peu complexe, il serait bon que les auteurs incluent dans la proposition une courte vidéo expliquant précisément comment le jeu fonctionne en pratique, de manière simple, afin que les personnes qui ne sont pas issues du domaine technologique puissent également comprendre pleinement comment ce projet se déroule. En dehors de cela, je pense que l'idée a beaucoup de potentiel et qu'elle dialogue directement avec ce que le défi demande. Sans parler du fait qu'elle pourrait encore être bénéfique pour la santé physiologique et psychologique des joueurs, comme le soutiennent les auteurs, qui prouvent ces lignes à travers les liens joints à la fin de la proposition, car elle les sortirait de leurs pièces ou lieux habituels.", "q0r": 4, "q1": "L'équipe semble très compétente, puisqu'elle 1) expliquent les caractéristiques techniques du jeu de manière très approfondie 2) mentionnent brièvement leurs domaines de connaissance au cours de la proposition, ainsi que leurs niveaux d'expérience 3) joignent leurs profils depuis linkedin à la fin de la proposition, où nous pouvons mieux les connaître et voir certaines de leurs expériences passées. En ce qui concerne le scénario, cette partie de la proposition est malheureusement pratiquement inexistante. Les auteurs nous fournissent une explication détaillée de ce que serait le jeu, des technologies qu'il impliquerait, de l'idée générale, mais ils n'expliquent pas clairement quelles seraient les étapes nécessaires pour construire tout cela. Il était important pour nous d'avoir une définition des phases à suivre pour aboutir au produit final. Les auteurs disent que le développement complet du jeu pourrait prendre des années, ce qui est inquiétant, nous ne savons pas exactement comment l'argent du bénéficiaire de la subvention prendrait en charge les premières étapes. En d'autres termes, quel pourcentage de ce projet les 65 000 dollars couvriraient-ils ? Il est nécessaire pour nous d'avoir une vision solide de l'ensemble, investir dans quelque chose d'incertain est un peu angoissant, j'aimerais beaucoup que les auteurs aient pensé à la trajectoire totale et l'exposent ici pour voir dans quelle mesure l'argent de ce tour de financement pourrait aider à faire avancer les choses. J'ai beaucoup aimé l'idée du jeu et je n'aime pas pointer ces défauts, mais il est nécessaire que nous comprenions l'ensemble avant d'investir. En ce qui concerne l'argent, plus précisément, le montant total est divisé en plusieurs parties, mais chacune d'entre elles aurait pu être plus détaillée, à mon avis. Comment serait cette modélisation 3d ? Comment ce genre de chose est-il construit ? Et comment 10 000 dollars seraient-ils utilisés pour cela ? Cela dit, je pense que le plus gros défaut de l'équipe était en fait le problème du script, qui, s'il est résolu, contribuera grandement à rendre la proposition plus propice au financement.", "q1r": 3, "q2": "Cette équipe est différente à partir du moment où elle propose de préparer des rapports mensuels et de les fournir au groupe qui gère ce défi de jeu. De cette façon, l'auditabilité sera faite de manière claire et directe, donc je crois qu'il n'y a pas beaucoup à commenter dans cette partie de la proposition. L'auditabilité est prête une fois que l'équipe s'engage à apporter ce retour d'information à la communauté, donc ce sujet d'analyse est entièrement traité.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims to deliver a mobile game for Android/IOS devices. \r\nThe game is centered around real bisons which identity and main trait is recorded live into the blockchain. The users will be able to interact with the 3D model of the bison via a VR device and/or with their smartphone.  \r\nThe game aims to reduce the sedentary aspect of gaming, via introducing necessary movements of the user to enjoy the gaming experience. ", "q0r": 5, "q1": "The team is well experienced and the realization of the NFTs seems totally doable. However some key details are missing to evaluate the real success of the proposal implementation (see section below)", "q1r": 4, "q2": "The information given are complete in terms of budget breakdown, however a detail roadmap is missing, as well as key metrics to be measured along the project development.\r\nMoreover, the tokenomics of the token NCKL is not explained, as well as the utility of the token within the game: only a comparison to already existing games is made (e.g. Axie Infinity).", "q2r": 2, "assessor": "z_assessor_530", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This is a big and fantastic way to develop and spread the NFT games. AR is developing and with this idea, I think it will go widely in the future. Moreover, as the team explains inside the proposal, their product will show how powerful Cardano blockchain be and will inspire other developers. ", "q0r": 5, "q1": "Their required budget is reasonable for what they explain that need to do for the idea. But I think they should provide a more detailed roadmap and some key metrics to help us assess the feasibility. \r\nBut their team and goals, especially their demonstration about their AR product that they put in the proposal I think they know what they are doing. ", "q1r": 4, "q2": "The team has a clear vision for what they want to do and clarifies their work in detail, which is close enough for everyone in Catalyst community to audit their progress. Their explaination about how the game work and technology can help us easily understand how they solve the problem. One more time, they should give us some key metrics to help communities more clearly for what they will aim to. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The problem is within the challenge, and proposal's detail solution can help to solve that problem. \r\nAnd the idea of using AR to connect vitual life and real life can attract and drive a lot of user to the game/ and Cardano communities. .\r\nBut the proposal lack of some below that I think they should provide\r\n- Info to show that it will impact to the Cardano ecosystem \r\n- Key metrics of the project to help community assess that is its direction align with the challenge setting or not and how much it will impact ", "q0r": 3, "q1": "The team have skill and knowledge that need for the development of the project. They're also have clip of their AR product but in other character, it can help us clarify about their ability. \r\nBut lack of roadmap, goal, KPI and key metric in the proposal is making us hard to assess its feasibility and I think that's the basic thing that they should provide for the better assessment. \r\nMoreover, this project is a bit complex and harder than others in technology, marketing activities... so I think that they should provide some risk and how they can control it. ", "q1r": 2, "q2": "Lack of roadmap, milestone and key metrics will make it hard to audit, they should provide these detail. It's also help the communities assess the feasibility the project better. \r\nOne better thing they have is that it have very detail explanation about how the game will work to solve the problem in the proposal. ", "q2r": 2, "assessor": "z_assessor_670", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "One of the famous and attractive projects that mix virtual and physical activities that I know is Pokemon Go. They have had a big community for years and that still developing now. I think the idea of ReWILD, will have better results for not only the game but also the development of Cardano communities. \r\nI just only recommend that proposer should give us some key metrics that would help us to know and track how much this project impact Cardanor ecosystem. ", "q0r": 4, "q1": "I think this project will be successfully deployed by their professional and experienced team. They even have a prototype in the clip that they attach to the proposal, so we can believe that they can make these AR ideas come true. \r\nThey are also clear about which field their budget will use for, or some ways to get rid of their capital risk. \r\nBut I think they should have a detailed roadmap for helping the assessment be more realistic. ", "q1r": 4, "q2": "This proposal has a very detailed explanation about how they help to solve the problem, and the detail is, including in gameplay, in-game materials, and technology. This can help clarifier about their targets. \r\nBut better be more detailed about the roadmap and their key metric that they will focus on as I said before will help everyone to audit the project better. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is a cool spin on the classic NFT game as it makes large use of Augmented Reality to encourage users to play outdoors (similar to Pokemon Go). The team has experience developing mobile apps with AR technologies.", "q0r": 5, "q1": "The team includes sufficient documentation covering their relevant experience (LinkedIn for entire team) and the Light paper covers their plans to implement ReWild! in great detail. ", "q1r": 5, "q2": "The documentation provided is sufficient and the team's experience is verifiable but there is only a budget and roadmap with no KPIs or metrics included. The inclusion of the light paper is my reasoning for 4 stars. ", "q2r": 4, "assessor": "z_assessor_837", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Encourager une pratique plus active du jeu sur ordinateur en extérieur grâce à la tokenisation sur la chaîne des objets de jeu en réalité augmentée.", "experience": "Les membres de l'équipe ont une expérience commerciale dans le développement et le marketing de jeux en réalité augmentée pour plusieurs équipes de la ligue mineure de baseball AAA."}