{"id": 382216, "author": "victorcorcino", "title": "Terra Cognita: AI+Blockchain Gaming", "url": "https://cardano.ideascale.com/a/dtd/382216-48088", "category": 26241, "amount": 54000, "description": "Il y a un manque de jeux passionnants et innovants fusionnant les concepts d'IA et de Blockchain dans l'écosystème Cardano.", "funded": 2, "upvotes": 149791899, "downvotes": 6220525, "votes_result": 143571374, "votes_cast": 754, "f6_no_assessments": 8, "f6_rating": 4.875, "videos": [], "media": [], "f6_assessments": [{"q0": "Le jeu présente une idée très originale, où les joueurs seront les explorateurs d'une terre inconnue et devront relever des défis au cours de leur périple. Je trouve génial que les auteurs se soient souciés de contextualiser de manière très narrative le déroulement de ce projet, car un jeu est avant tout une forme d'immersion dans de nouveaux univers, et l'équipe semble tellement capable de le faire qu'elle commence, déjà par la description de la proposition, à nous impliquer, nous les CA et les joueurs potentiels. Il est également positif que le jeu soit dans le style RPG, quelque chose qui a beaucoup de succès, mais qui, en même temps, a déjà plusieurs projets et quelques récits bien usés - ce n'est pas ce qui se passe ici, nous avons une proposition différente de ce que nous avons vu jusqu'à présent. dans l'univers RPG. Il est connu de tous que cette modalité est très agréable pour les joueurs, étant l'un des innombrables signes de succès que ce projet nous présente. L'idée d'utiliser l'intelligence artificielle est également très cool, elle donne aux joueurs une certaine part - non totale - de contrôle pour leurs personnages. Je vois cela comme un moyen de captiver les joueurs, de les enfermer, d'une certaine manière, car cela finit par devenir quelque chose avec un soupçon de jeu (quelque chose qui est aussi indéniablement aimé par la communauté des joueurs). Un autre point positif est que le jeu se déroule dans des tours qui se rapportent au temps dans le monde réel, ce qui génère plus d'engagement, car il mélangerait la vie avec le jeu, en plus du fait que le jeu adopte le mode \"jouer pour gagner\", quelque chose qui attire beaucoup le public - habituellement les gens ne veulent pas investir de l'argent dans les choses immédiatement. L'équipe s'attache à étudier très précisément les caractéristiques des personnages, rendant leur visualisation très solide. Ils soulignent également les risques possibles, en proposant déjà quelques solutions, ce qui témoigne d'une grande prudence et d'un sens des réalités. Quant à la façon dont le projet bénéficierait de l'écosystème Cardano, je pense de plusieurs façons. Au départ, chaque personnage serait NFT, ce qui augmenterait directement l'adoption des technologies de l'écosystème Cardano, car de plus en plus d'acteurs s'impliquent ici.", "q0r": 5, "q1": "En ce qui concerne le scénario, l'équipe s'attache à définir les activités qui se dérouleraient en fonction des trimestres. Elles sont classées par thèmes et nous permettent de comprendre qui fera quoi au fil du temps, ce qui donne une vision très claire du processus. L'équipe est sans aucun doute apte à mener à bien ce projet, à commencer par les membres du groupe AIM impliqués ici ; ils ont déjà introduit quelques projets très utiles à notre communauté, tels que CA tools et vCA tool, démontrant ainsi leur capacité technique. Ils se préoccupent de fournir les noms et les rôles (en plus d'une ventilation qui inclut dans certains cas quelques expériences antérieures) de chaque participant. Victor et Lucio semblent être des personnes extrêmement compétentes : le premier est bien reconnu dans la communauté Cardano pour plusieurs réalisations, ayant une formation d'ingénieur et s'intéressant aux jeux, en plus d'être quelqu'un de toujours présent à l'hôtel de ville et pleinement actif dans la communauté. Lucio semble être très préparé grâce à son temps de travail, en plus il sait programmer en plusieurs langues, ce qui est quelque chose de rare (à mon avis). Le reste de l'équipe semble tout aussi pertinent pour le projet, il s'agit de personnes issues de différents domaines professionnels, et pas seulement des parties techniques. Nous avons également des designers, qui sont d'une importance capitale pour la réussite du projet, tant au niveau du design des personnages que de l'ambiance, de l'UI/UX, etc. Et enfin, en ce qui concerne la répartition monétaire : ils divisent le montant total, qui est assez élevé, mais justifiable, en thèmes. Chaque thème est expliqué séparément, et il s'agit essentiellement des salaires des professionnels impliqués. De cette façon, cette partie de la proposition est également très compréhensible et nous fait comprendre pourquoi ce montant a été demandé.", "q1r": 5, "q2": "En ce qui concerne le suivi du jeu, je crois que l'équipe nous fournit suffisamment d'informations pour effectuer un suivi détaillé, non seulement des résultats finaux mais aussi du processus. Je dis du processus parce que nous savons qui fait quoi et quand, de cette façon nous avons pu maintenir un contact direct avec les professionnels impliqués pour parler et suivre l'évolution de chaque partie. Et en ce qui concerne les résultats finaux, il s'agit essentiellement de savoir combien de modèles ont été créés, de NFT vendus et d'utilisateurs jouant dans les premières versions du jeu. Je suggère que l'équipe elle-même surveille ces données et rassemble tout dans des rapports graphiques, afin de montrer ces informations au reste de la communauté. Cela pourrait être fait lors d'une salle de l'After Town Hall, un projet promu par le groupe Catalyst Swarm, dans le but de promouvoir le débat sur les projets déjà financés (le cas ici) et ceux à venir. Par conséquent, je pense que nous disposons de suffisamment d'informations pour exercer une auditabilité correcte du projet.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 22, "ne": 17, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Love it. Sounds like an awesome NFT/AI/Metaverse experience. Much more fun than crypto kitties to have your NFT evolve over time under Reinforcement Learning simulation. This could be really cool, lets make it happen.", "q0r": 5, "q1": "The proposers have some good programming and ML experience and are highly involved in Catalyst. They have sketched out a plan of what they want to do. There are definite execution risks, especially on the scalability (that they have mentioned), but this is the sort of project that could really kick off and draw interest across the blockchain world. Its worth taking a risk on.", "q1r": 4, "q2": "The proposers have provided a clear roadmap for delivery against which progress can be audited. They have also provided a number of KPI's against which success can be measured. It would be nice to add some goals to these KPI's, but in the end these types of projects have a long tail. It either won't really get picked up and fade away, or if it does, the numbers would be explosive. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 32, "ne": 2, "ng": 25, "nfo": 5, "vca_o": 1}, {"q0": "I waited for this game genre for a long time, the idea of bring AI into game - even only helping players to build their civilian like this game  - will help the game industry to new era, therefore, it will make some different in Cardano ecosystem to other network. The idea look like huge and hard but this professional team have a very detailed description about their game materials and environments, then the gameplay that will make player eager to wait, and their technology strategy on developing the game...\r\nMoreover, their detailed KPIs and key metrics show that this game is a perfect pitch for the challenge given. ", "q0r": 5, "q1": "It's not only perfect vision and strategy, the proposal also could perfectly shows that they can successfully get their goals. There is a detailed roadmap outlined to detail activities that you can get them by reading the detail information inside the proposal, including the game info and the technology that they will use for advancing the game system. \r\nIn addition, their budget breakdown is clearly for part time position, and as they said it just enough for developing some first phase. But they also describe about how they will solve that problem in their risks and challenges. \r\nI think this team will make the idea come true soon as they set on their timeline. ", "q1r": 5, "q2": "They have a perfect proposal that can show how the game strongly impact to Cardano ecosystem, how they can successfully launch their game by their realistic time, and full of materials for auditing their progress so far. \r\nRoadmap and key metrics, KPIs in this proposal are clarify for Catalyst community tracking their commitment to us and I believe that they're all will support to their success. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Terra Cognita: AI + Blockchain gaming proposal address the challenge by creating RPG Game with the players set AI/ML characters to explore the new world. It is an ambitious project and fit wells within the Gamers on-chained challenge.", "q0r": 5, "q1": "The proposer team is comprised of members with strong technical ability (not in game development)but in AI and web/mobile development. The proposal has laid out what to be expected in term of user experience. There are clear roadmaps and risk/challenges have been addressed. They will get full score should they give KPIs in quantifiable term. ", "q1r": 4, "q2": "The information provided in term of roadmap, game development and team background are very detailed. The KPIs could include numbers so that it's quantifiable and easier for community members to track the progress.", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Unlike most of NFT games, this game will use AI with machine learning to help player develop their activities. With that type of mode I think people will be attracted to join and play because it can save a lot of time and they do want to see what AI can help them to build their things. \r\nThe proposal has a detail info about how their game will run and its key metric/ KPIs prove that the team concerns seriously to the challenge. \r\nMoreover, they also explain about their advantage on scaling the game very detail, so I think the game will make big impact to the Cardano ecosystem. ", "q0r": 5, "q1": "The proposal has detail roadmap into position that the team will pay for, it can help us assess that their required budget is reasonable.\r\nIt also has detail explaination about the tech and game development that it will use for developing and advancing the performance, scalability of the system. \r\nIn addition, their timeline of implementation and development is realistic and can help them to prevent their outlined risks well. ", "q1r": 5, "q2": "It don't have detail explaination or case study for the problem, but it has very detailed explaination about the gameplay and development to help. And those info concentrate with their detail roadmap and KPIs/ key metrics of the game. \r\nThis proposal is fulfilling things for auditability", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "In my opinion, this proposal is completely reach the challenge given. Even more, their detailed explanation can show how much benefit that players will be received from their game, not just only finance profit but also time and experiencing of AI development.\r\nMoreover, I'm very appreciate to their way to open source all of their game code to community, this will passionate and help a lot of other game developer make a new age of on-chain gaming genre. Currently, most of the game is bored: card game, turn-based game. ", "q0r": 5, "q1": "As my experience, their budget for employee is little bit lower than I know, and all the budget is for part time position, so I do want to know how will they solve if they can't find the right people to keep the project running on time. \r\nThat's my only risky concern to this proposal. On the other things, they made all perfect. Their budget is reasonable, and they have a cleared roadmap. All the essential game info and technology information were described so detail and can help me estimate their work easily. \r\nThey even show some relevant risks and solutions for them, I saw all make sense. ", "q1r": 4, "q2": "For auditing this project, I think proposer give us full of essential info, including very very detailed roadmap, success metrics that the project being lead to and KPIs that the team will show us on the needed time. \r\nMoreover, they also have perfect explanation about solution to solve the problem in the part of game description and development. \r\nAfter all, I hope that this game will be fund and successfully deployment. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "RPG game seeking to let players experience a whole new world. Proposal mentioned that players would create their own NFT based characters, explore and play, learn, evolve and conquer a whole new experience.\r\nEach minted NFT character is therefore attached to an artificial brain that will evolve and perform better over time. This idea promotes cardano as the best for gamers on block chain.", "q0r": 5, "q1": "The team experts have experiences in game architecture, developer, front end designer, data science engineer which all make the proposal an ideal one for successful implementation.", "q1r": 5, "q2": "The timeline is very detailed and clear showing the breakdown of 3, 6 and 9 months of different tasks which can be audited effectively. The budget has a detailed breakdown of different tasks and cost. This can be audited effectively. Progress of work can be monitored effectively given the details shown in different phases. Good proposal. I recommend for funding.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I am already encouraged by the professionalism shown in this proposal and the graphics provided. The team looks incredibly capable of delivering this product which fits the challenge goals.", "q0r": 5, "q1": "The team has experienced software developers and game architects. This proposal also includes all the necessary information and more (project roadmap, budget breakdown, KPIs, team experience, and technical details.) This shows that they have clearly discussed and planned this project's progress.", "q1r": 5, "q2": "As mentioned above, this proposal offers all of the needed information to audit the project's progress (project roadmap, budget breakdown, and KPIs.) This is the information that will act as a baseline to judge their success.", "q2r": 5, "assessor": "z_assessor_893", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "Terra Cognita, un jeu en ligne, coopératif, de stratégie et de RPG, où les joueurs créent et paramètrent des personnages basés sur l'IA/ML pour explorer un tout nouveau monde.", "experience": "Développeurs expérimentés, pionniers de Plutus et AtalaPRISM, chercheurs en apprentissage automatique, concepteurs, passionnés de Cardano et de jeux, équipe AIM."}