{"id": 382547, "author": "igor", "title": "Bears Club - Club Simulation Game", "url": "https://cardano.ideascale.com/a/dtd/382547-48088", "category": 26241, "amount": 40000, "description": "L'écosystème des crypto-monnaies manque de jeux dotés de fonctions sociales, où les gens peuvent jouer et se rencontrer en même temps.", "funded": 1, "upvotes": 24844980, "downvotes": 14917753, "votes_result": 9927227, "votes_cast": 134, "f6_no_assessments": 5, "f6_rating": 3.4666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée en soi est bonne, mais la proposition est plutôt superficielle. Il s'agit d'un jeu qui, selon l'auteur, fusionnerait le monde des NFT avec la socialisation, quelque chose qui, selon lui, fait défaut dans l'univers des crypto-jeux. D'accord, mais à quoi ressemblerait cette socialisation ? L'auteur explique que des clubs seraient créés dans les forêts, d'après ce que nous pouvons comprendre, les personnages seraient des ours (probablement des NFT frappés en Cardano). Mais que se passerait-il dans ces clubs ? Quelles missions seraient la base du jeu ? Comment les joueurs pourraient-ils mettre en valeur leurs personnages ? Il n'est malheureusement pas possible de comprendre en détail ce qui se passe ici. Un site web est joint, où l'on trouve quelques illustrations (j'ai adoré la projection 3d des ours) et un peu d'informations sur l'histoire, le scénario et le contact avec l'équipe. J'ai trouvé le site très beau, visuellement, mais en termes de contenu, il n'apporte pas grand-chose. Le livre blanc n'est pas non plus différent du site web (il s'agit peut-être d'une erreur, mais lorsque j'ai entré le lien donné, c'est ce que j'ai vu). De manière générale, l'impact ici pourrait être mieux mesuré si le promoteur était entré plus en détail dans le jeu lui-même, comment le NFT monnaye, la socialisation entre les joueurs, la construction de l'univers, etc.", "q0r": 3, "q1": "Nous avons un script ici, mais il est assez sommaire. C'est-à-dire que les phases ont peu de détails. Par exemple, au Q1 2022, le seul sujet est \"Airdrop Bears Club 3D NFTs\". De quoi s'agit-il exactement ? De la construction de ces personnages ? Les tâches prévues pour 2021 ont-elles été réellement accomplies ? Si oui, j'aimerais voir les résultats. Le détail n'est pas absent, mais il est insuffisant. Il ne permet pas d'avoir une vision très claire de ce qu'il faudrait faire pour que cette idée devienne réalité. Sur le site web ci-joint, le même scénario est disponible, de manière mieux schématisée, mais aucune information supplémentaire n'est donnée. En ce qui concerne le personnel et le financement, il y a également un manque de détails ici. En commençant par la ventilation monétaire, celle-ci est très peu précise. L'auteur indique que 70 % du financement serait consacré au développement du jeu. Explication très vague. Au sein du développement, nous avons plusieurs activités, comme le design, la programmation, la narration, les smart contracts..., bref, plusieurs choses. Il serait nécessaire de comprendre comment ces 70% seraient distribués. Il dit aussi que des actions juridiques et marketing seraient nécessaires, mais c'est aussi très vague. Tout est vacant, malheureusement. Il ne consacre aucun espace dans la proposition pour présenter une équipe responsable des différentes fonctions du jeu, comme je l'ai mentionné précédemment. Il prétend avoir de l'expérience en programmation et dans les jeux impliquant la cryptographie. Mais qu'a-t-il fait dans ces domaines ? Quel type de relation a-t-il avec l'écosystème Cardano ? Quant aux concepteurs qu'il a l'intention d'embaucher, à quoi ressemblerait cette sélection ? Malheureusement, il y a beaucoup de doutes dans l'air, ne donnant pas un sentiment de sécurité dans la capacité de son équipe à réaliser la proposition d'une manière garantie.", "q1r": 3, "q2": "L'auteur de la proposition établit certains indicateurs clés de performance (ICP), qui se rapportent aux résultats attendus pour le passage du temps compté en mois. C'est une bonne façon d'auditer la proposition, en parlant des résultats finaux. Cependant, ces KPI ne peuvent pas, à mon avis, couvrir toute la complexité du projet. Les jeux sont toujours (presque toujours, peut-être) assez laborieux, difficiles à créer. Pour cette raison, j'aimerais avoir plus de détails. Un autre moyen que je trouve ici pour faire l'auditabilité serait à travers le script. A travers lui, il est possible de suivre le développement du jeu. Mais comme il s'agit d'un script superficiel, ce suivi serait probablement aussi superficiel. En d'autres termes : oui, la proposition est auditable, mais pas parfaitement. Je suggère que l'auteur s'investisse en détail à la fois dans la partie métrique et dans la feuille de route elle-même, afin que nous ayons des informations plus précises à suivre. Il serait intéressant pour lui de rassembler les données, les résultats partiels de chaque étape, en les apportant au reste de la communauté Cardano. Cela doit concerner tous les aspects du jeu : marketing, conception, NFT, etc. De cette façon, nous aurions une grande confiance dans le fait que le projet est mené en conformité.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 25, "ne": 14, "ng": 11, "nfo": 0, "vca_o": 2}, {"q0": "This proposal's problem statement and solution addresses the objectives laid out in the challenge. The proposal's aim to add value to Cardano by creating a social network platform with play to earn ability through gaming. Furthermore, its key metrics and goals are aligned with the challenge. However, the proposer did not mention on its ability to scale to cater future market demands. Can the game be able to serve more than 10000 bears? Think of millions of bears that want to join game and use it as a platform to connect with other users. Also will it only focus on bears? Will there be other form of character that will be added in the future? Another question on scalability is will the game only be available on browser or will it be available on mobile as well?", "q0r": 4, "q1": "The proposer did not provide any verifiable link to their profiles. Please provide verifiable evidence of your relevant experience and skills to successfully implement the proposal. Also please provide in details on the required manpower to implement the project. How many web designer, 3D artist and illustrator are needed? In addition, the proposer did not provide a clear budget breakdown on how will the funds be used. Provide detail budget breakdown, eg. 10000usd will be used for marketing in a span of 5 months (2000usd x 5 months) etc. Moreover, there are no risk management plans in the proposal. If there is additional funding required due to unforeseen circumstances , what will be the contingency plan? Furthermore, this proposal did not explain the technology that is used behind this game. Please provide information such as what engine will it be run on? eg. unity, unreal 5, etc.. How will your game interact with the blockchain? What wallet will be used?", "q1r": 3, "q2": "This proposal provided roadmap with milestones and a time horizon for achievement. Moreover, this proposal has presented a link to their website and social media for voters to keep track of the progress of their work. Furthermore, this proposal also provided the metrics and KPI that define the success of the proposal. However its metric is too focused on the delivery of the game. What about the estimation amount of people that the game aims to bring onboard Cardano? Is it 10000 new users? 5000? Therefore, I rate audibility with a score of 3", "q2r": 3, "assessor": "z_assessor_357", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This is a very good proposition. A social and fun play-to-earn game where you can interact with your friends, visiting their clubs, visit popular places in the Cardano Forest where people will be with their favorite bears interacting with each other.\r\nI think it will attract gamers, especially those who love animals, want to be in harmony with nature.", "q0r": 4, "q1": "While the proposer has shown sufficient evidence to demonstrate the skills and experience needed to implement the proposal, it would be interesting to know the profile of the people involved. It is also important to have more detail regarding the number of people involved, estimate hours and allocated budget to the different work packages for project implementation (this has been provided, but it's too sketchy: \"Game Development - 70%,Legal\" Consulting - 10%, Marketing - 20%\" )", "q1r": 3, "q2": "The proposal provides a club simulation game that follow the play-to-earn business model, it will have an open economy and offer financial benefits to the players, like agriculture simulation genre found in for example Plants vs Undead, Farmville, Wanaka, etc. However, it would be beneficial to have a more detailed roadmap that allows the community to know the level of progress of the project. Ask for a budget of $40000, how this money will be used, e.g. proposer needs to provide total hours worked, pay for each of those jobs,...\r\nThis is a very good idea, providing more information would be helpful.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposer presents the Bears Club project with the goal of offering a 3D browser game with many social features while still offering everything a crypto game needs. Although it is not specified what a crypto game would need accourding to the proposer vision, this project seems to fully address the challenge by providing a play to earn game. ", "q0r": 5, "q1": "It is quite difficult to evaluate the potential success of the project as the team still needs to hire a Web Designer to improve the website, 3D artist to handle the game 3D assets, and a illustrator to work on the game UI and miscellaneous art material. \nMoreover, the proposer did not share any proof of experience, with the exception of a youtube video linked to the webiste shared in the brief.\n\nMoreover, the Descord group counts as of today about 400 members, which could be a good pool for a demo, but certainly not to assess the game once completed. \nIt's reasonable to think that the marketing funds will be used to increase the number of potential users stated above.", "q1r": 3, "q2": "Apart from the lack of proof of experience, the proposer provided a base webiste which encloses not only the project roadmap, but a faq section, and project story section\nFunds allocatiion is mentioned, although it could have been itemized introducing some sub items as done for the roadmap. \n", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 25, "ne": 3, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "Problem aimed to achieve with This proposal somewhat addresses the challenge. Gamers in the Cardano community can benefit from the launch of the proposal. I think focusing on the The social aspect of gaming is represented in the proposal is important. The story on the website https://bearsclub.io/ is interesting and it may create a synergy around the climate change-related issues so perhaps increase awareness about nature literacy.  I could not find a connection with the video presented on the youtube channel   https://www.youtube.com/watch?v=RkqlUjyv4vs\nIt will be good to present how the proposal can scale to address future challenges of creating social media with fun and some purposeful activities achievements for enhancing the user motivation.\nHowever, I think the Bears Club should be given a chance to build inside Cardano forest, so the bears gather and we can interact with our friends, visit their clubs, visit popular places in the Cardano Forest. Please consider some of the purposeful activities such as transforming behaviours to overcome challenges of climate change.", "q0r": 5, "q1": "Unfortunately, Igor seems alone for the moment. I suggest finding other members of the community.  It is not so likely this proposal will be implemented successfully. Just like the social aspect of the game is highlighted it is important to establish a team from the beginning of the project. There are some members in the Cardano4Climate group with an interest in gamification in climate-related issues. Perhaps this can be a good way to get support and cooperate. Proposer’s 7 years of programming experience with extensive knowledge about crypto games is a great asset for our Cardano community. Besides proposal needs to involve other community members to ensure a better plan and budget for the task described. ", "q1r": 2, "q2": "It is possible to assess progress in terms of general goals and the roadmap provides milestones. However, the definition of success needs to be further detailed. Including the possible challenges and assumptions. There is only general information about the use of the budget. It is better to identify the use of budget in relation to the different challenges of short, middle and long term success. \n", "q2r": 3, "assessor": "z_assessor_747", "no_vca": 25, "ne": 5, "ng": 19, "nfo": 1, "vca_o": 1}], "solution": "L'objectif du projet Bears Club est de proposer un jeu par navigateur en 3D avec de nombreuses fonctionnalités sociales tout en offrant tout ce dont un jeu de crypto-monnaie a besoin.", "experience": "Le jeu est déjà en cours de développement par un développeur qui a 7 ans d'expérience en programmation et une connaissance approfondie des jeux de crypto-monnaies."}