{"id": 385054, "author": "rcmorano", "title": "Gamify LacedWhales Twitter bot", "url": "https://cardano.ideascale.com/a/dtd/385054-48088", "category": 26241, "amount": 4000, "description": "La conduite de l'ADAption par Twitter au-delà de parler du prix n'est pas habituellement fait et il peut être un grand viral, amplificateur.", "funded": 2, "upvotes": 44600832, "downvotes": 4380855, "votes_result": 40219977, "votes_cast": 187, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal aims to gamify a twitter bot with a whale hunting game that utilizes the GameChanger Wallet for Cardano so this does fit into the challenge. I would suggest perhaps modifying the game theme as the idea of gamifying the hunting of endangered species might leave a bad taste in some. ", "q0r": 4, "q1": "The proposer has a broad range of experience leading development projects; they also state that the project is already partially done and outline what remains to be accomplished. The budget and timeline seem reasonable for the work that remains and it looks like it would be feasible to accomplish in the outlined timeframe", "q1r": 5, "q2": "The proposal lays out a clear timeline, what the goals are and some performance indicators goals to denote success. The short timeframe also makes it easier to audit the status of the project.", "q2r": 5, "assessor": "z_assessor_142", "no_vca": 24, "ne": 2, "ng": 16, "nfo": 6, "vca_o": 1}, {"q0": "the problem was defined precisely. the experience described corresponds to the quality of the explanation. the impact is global, but limited to twitter. in addition, the game described is aimed at people who are already active in the cardano ecosystem. it should be additionally explained how to recruit people without crypto knowledge. the proposal does not address the challenge effectively, but has added value for the cardano ecosystem", "q0r": 4, "q1": "according to the budget and schedule, the project can be implemented within one month. the already existing twitterbot facilitates the understanding of the final product. the described experience should be confirmed by a linked.in profile or similar. according to the description, the experience should be sufficient to implement the project. the budget and schedule are well described in relation to the required funding. ", "q1r": 4, "q2": "the KPIs are sensibly structured and the delivery dates clearly defined. the community could check the progress of the project via the twitterbot, provided the applicant sends regular updates. unfortunately there is no info on this. possible risks are not described and should be mentioned. also possible solutions for this.", "q2r": 3, "assessor": "z_assessor_260", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "I actually think that this is a very novel idea and have not seen anything like it yet. That doesn't mean I'm convinced the idea will catch on, but I think that there's a chance that it will and should that happen I think given the highly engaged community on crypto twitter I would definitely be willing to admit that this proposal would indeed onboard many users to Cardano.", "q0r": 3, "q1": "The proposer states that the bot is actually up and running already which gives me confidence that the proposal is serious and engaged, this proposal is mainly seeking funding for the additional smart contract functionality controlling the gamification and rewards which would be distributed as a CNFT. The proposal also does not seek that much funding at all, and given the fact that most of the groundwork is laid I believe this proposal will be successful and deserves a full 5 stars.", "q1r": 5, "q2": "Although the roadmap is lacking, it is basically justifiable given most of the legwork is done, and the KPIs listed cover most of the remaining work to be done. I feel what we have here is more than enough to successfully audit this proposal, should it be funded.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Le porte-monnaie GameChanger permet d'interagir avec Cardano via des liens HTTP. Nous proposons de gamifier ce robot en l'utilisant pour tenter de devenir viral sur Twitter.", "experience": "Défenseur de DevOps avec plus de 15 ans d'expérience. Ex-Emurgo DevOps Lead. Cofondateur de Gimbalabs. Fondateur et opérateur de Dandelion. Dév. de LacedWhales."}