{"id": 382073, "author": "jeffyang1", "title": "Token Minting Service", "url": "https://cardano.ideascale.com/a/dtd/382073-48088", "category": 26245, "amount": 25000, "description": "Малому пулу нужно предлагать больше стимулов для делегатов, чтобы развивать свой бизнес, потому что люди просто хотят получить наибольшее вознаграждение.", "funded": 0, "upvotes": 15714205, "downvotes": 21430994, "votes_result": 5716789, "votes_cast": 106, "f6_no_assessments": 3, "f6_rating": 2.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment, which also applies to decentralized and partially mission-driven stakepools, especially regarding the economic part. This knowledge and my knowledge about mission driven stakepools enables me to provide valuable insights for this challenge. The proposal identifies a good approach to supporting mission driven stakepools, which will add value to the Cardano ecosystem if implemented correctly\r\nMore concrete Key Metrics are however not adressed. The proposal has the potential to be scalable.", "q0r": 4, "q1": "the acclaimed skills of the proposer will aid him in approaching several types of problems, however the proposer does not further define  the type and number of team members required to implement the proposal. The budget is not diversified or explained, hence it cannot be told that it's reasonable. Neither is a plan for the need of additional funds or the occurence of potential risks implemented. The neccessary resources or the technical details are left unexplained and no timed schedule or implementation plan is presented. Sadly, while the proposal has a lot of potential, it is not planned properly. Feedback: Rather plan less proposals and formulate them properly to present something feasible that indicates that the concept was properly planned.", "q1r": 2, "q2": "While the problem statement is valid and the solution matches it and is something defined, no further milestones, KPIs and Metrics are presented, which still makes it difficult to audit this proposal.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Cardano's problem of growing small pools is one that Cardano still has no solution to other than limiting the amount of staking to large pools. If there is a solution that can help encourage people to staking into small pools to ensure the decentralization of the system, it is a great solution. But with the share of the proposer about the solution in this proposal, I still have not seen it can really solve this problem. Not to mention, this is just an idea, there is no specific plan", "q0r": 1, "q1": "\"Proposer has a lot of problem-solving skill sets, and I am adaptable. What skill? How to verify that? Is it suitable for this proposal?\r\nProposer also claims that he/she is an engineer at SpaceX. I can't find any information about that. And it seems not relate to this proposal.\r\nBy the way, this is just an idea, proposer and the team should spend more time for the plan and the solution\"", "q1r": 1, "q2": "Unfortunately, there is nothing to assess at this proposal as it lacks to provide crucial information for the plan to implement it. (resources, buget break down and allocation, timetable, risks etc.)", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 19, "ne": 0, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal presents an interesting use case in helping scale smaller stake pools, it effectively addresses the new SPO business opportunities challenge. ", "q0r": 3, "q1": "The developer behind this proposal comes from an engineering background and is a Cardano SPO however the technical detail required to validate this business model is not fully understood from the included project plan/overview section. ", "q1r": 3, "q2": "While the proposer provides technical information on their engineering/SPO background there is not enough technical information included to fully validate the token minting service business model. In addition budget breakdown and roadmap sections are not included in the proposal.", "q2r": 3, "assessor": "z_assessor_881", "no_vca": 21, "ne": 2, "ng": 15, "nfo": 4, "vca_o": 1}], "solution": "Я думаю, что решение заключается в том, чтобы помочь другим операторам пулов разработать стратегию токенов сообщества, а также помочь им выпустить токены, чтобы стимулировать их принятие", "experience": "Я работаю инженером в компании SpaceX, поэтому у меня много навыков решения проблем, и я легко адаптируюсь.\nЯ также хорошо разбираюсь в психологии"}