{"id": 384033, "author": "reginawills", "title": "SPO & trading in Cardano ecosystem", "url": "https://cardano.ideascale.com/a/dtd/384033-48088", "category": 26245, "amount": 30000, "description": "Помощь соотечественникам из Восточной Африки в поиске разнообразных инвестиционных возможностей в экосистеме Cardano", "funded": 0, "upvotes": 16143207, "downvotes": 21246169, "votes_result": 5102962, "votes_cast": 107, "f6_no_assessments": 3, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem in the proposal is within this challenge. Their success metrics also fit with the challenge setting. But I need to know more about why their solution can solve it in detail and why is it impact the challenge, the Cardano ecosystem, and especially SPO development. There are some links that the team attached about their past activities but I cannot understand because they're not in English, through their brief these clips is about the current activities that relate to this idea, but barely explain what they want to do in this scope of the proposal. ", "q0r": 3, "q1": "This is a community activity, and for developing this type of activity the organizer has to make a well-prepared plan that has documents for training, event organization skill, category of activities... or else that can show their value proposition. But this proposal only shows the idea, the introduction of the team... there is no implementation plan to show what and how they will do, and there is no roadmap for assessing the feasibility. \r\nThey have the success metrics but they cannot be used when don't have a roadmap or plan to evaluate those key metrics. \r\nTherefore, the budget is also hard to assess that is it reasonable or not for this idea. ", "q1r": 1, "q2": "For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is sufficient for their team to make it come true. This proposal doesn't have these things, that's the reason why this proposal is imauditable. \r\nAnd for support the auditing progress, the team also needs to provide the detailed explanation about the problem, which can help CA assess that the team really gets the context of the problem and make the best solution for it. Both don't have in this proposal. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 18, "ne": 4, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The SPO & trading in Cardano ecosystem proposal helps to find diversity of investment opportunities for fellow East Africans through staking and training. They would get a better rank if they explain how it could benefit the whole SPOs community.", "q0r": 3, "q1": "The proposer team members have strong skill sets to implement the proposal (public launch in mid Feb). The budget breakdown is available along with KPI members. They haven't addressed risk & challenges though.", "q1r": 4, "q2": "The budget breakdown gives an indication of what the proposal intends to do (stakepool and meetup). The community members can track their progress and see if it delivers a bigger impact to the SPOs", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "There is a good relevance for the challenge. The problem could be explained in more detail as it is not very clear. And how the problem and solution relate to the challenge, for example In what way this proposal will make the SPO more economically attractive? At the same you are building a new SPO and trying to educate a market, it might fit more the other SPO challenge. To understand the impact on the challenge, it will be good to provide more information about the market opportunity and show how your proposal is starting to penetrate this market", "q0r": 3, "q1": "Looks like a great team and some involved in the catalyst community. LinkedIn of all members would be helpful. Also, a link to the consultancy company would be helpful, and specific some related work and success stories will add more value.  Any experience with SPOs will be important to add as well. The roadmap could be also more specific about what you will do in month one, two…\nIt is not clear how you are going to reach out to over 20000 Swahili speaking and how you will use the stake pool rewards for education and empowering people. What is the budget required for it and what will be the activities? As a mentor for startups, I saw many plans and this one seems a bit generalized. Having more details is important. The budget is detailed but it is not clear for how long it will be sufficient and more detailed info will be helpful. Also the main budget item will be used as a treasury for the stake pool? It is not very clear and if yes, it will be good to specify more why it is needed. Challenges and risks are missing as well. I.e. amount staked might be to low for significant rewards.", "q1r": 3, "q2": "A clear launch date is specified. Clear KPIs are specified as well which could be audited. However, as an SPO not only the number of wallets are important but also the amount staked - this will be easy to audit as well. ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 23, "ne": 3, "ng": 20, "nfo": 0, "vca_o": 1}], "solution": "Создание пула коллов и обучение рынка тому, как делать разумные инвестиции в экосистему Cardano", "experience": "Операционный менеджер, тренер, трейдер и финансовый аналитик"}