{"id": 384955, "author": "gargiulo.gianni", "title": "Beyond ISOs: SPO-driven Funding", "url": "https://cardano.ideascale.com/a/dtd/384955-48088", "category": 26245, "amount": 35300, "description": "Существующие модели финансирования проектов не обеспечивают достаточной поддержки SPO в их роли финансовой основы и основы безопасности Cardano.", "funded": 2, "upvotes": 162107576, "downvotes": 8788906, "votes_result": 153318670, "votes_cast": 726, "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=23919"], "media": [], "f6_assessments": [{"q0": "Я рассматриваю проблему централизации коллов, возникающую в FISO, ISO и ISPO, как \"хорошую проблему\", свойственную Cardano. Благодаря механизму насыщения пула (коэффициент K), который заставляет увеличивать количество пулов, работающих регулярно, чтобы способствовать децентрализации при создании блоков, доступно большое количество \"мест\", что стимулирует конкуренцию и возможность участия небольших SPO становится более ощутимой, чем в других блокчейнах.\r\n\r\nПосле нескольких месяцев тестирования концепции FISOs/ISOs/ISPOs стало ясно, что эта модель сбора средств является популярным и чрезвычайно полезным инструментом как для владельцев пулов, так и для делегатов. Несмотря на важность этого инструмента, существуют некоторые проблемы, которые он может породить, такие как централизация делегирования и регуляторные риски. Данное предложение призвано решить проблему централизации, сделать концепцию более устойчивой для небольших SPO и для децентрализации самой Cardano, а также разрешить опциональную интеграцию KYC через DIDs, что может помочь в решении регуляторных вопросов.\r\n\r\nТаким образом, существует ясность в отношении проблемы, которую необходимо решить, и предложение описывает модель, которая направлена на использование ISOs посредством некоторых улучшений, направленных на создание модели с лучшим UI/UX как для делегатов, так и для SPO. Интеграция Stakepad в платформу Stakeboard позволит улучшить коммуникацию между МОС, СПЦ и делегатами, посредством маркетинга, курирования, фильтрации (что позволит МОС и делегатам выбирать СПЦ, отвечающие желаемым критериям, например, СПЦ, поддерживающие различные социальные цели) и репутации СПЦ для сотрудничества в программах по сбору средств, что сделает МОС и СПЦ более заметными, и делегаты смогут легче их найти.\r\n\r\nЯ считаю, что предложение полностью соответствует задаче, ведь использование пулов в качестве инструмента для сбора средств уже является реальностью, и идея заключается в том, чтобы отшлифовать его, чтобы он стал более экономически устойчивым для SPO и более практичным для делегатов.\r\n\r\nВключенные метрики/KPI являются хорошими показателями успеха и воздействия для этой задачи и экосистемы Cardano.", "q0r": 5, "q1": "Команда имеет опыт в нескольких областях, важных для реализации проекта, таких как разработка программного обеспечения, управление продуктами, управление бизнесом, управление коммуникациями, ИТ, кроме того, некоторые участвовали в программе Plutus Pioneers Program и работают в пулах. Важно отметить, что данное предложение является инициативой Stakeboard и находится в разработке уже несколько недель, некоторые этапы были завершены еще до получения финансирования, что свидетельствует о приверженности и продуктивности.\r\n\r\nСуществует разбивка бюджета. Показатели нагрузки на фронтенд+банковскую разработку соответствуют требованиям, но другие пункты можно было бы детализировать, так как нет ясности в отношении требуемой нагрузки на UI/UX, DevOps, управление проектами и маркетинг.\r\n\r\nДорожная карта и основные этапы реалистичны, понятны и объективны. План Stakepad является разумным и содержит достаточно деталей, чтобы показать его осуществимость.\r\n\r\nБыла представлена концепция Stakestarter, которая намеревается создать альтернативную модель фандрайзинга, мне кажется, что намерение состоит в создании необязательного MVP, но неясно, будет ли Stakestarter результатом этого предложения. Судя по дорожной карте, это не похоже на это, но я бы рекомендовал уточнить это.", "q1r": 4, "q2": "Есть ясность в проблеме, решении и в их соответствии этой задаче.\r\n\r\nОписанные метрики и КПЭ представляются хорошими показателями для аудита эффективности и проверки успешности предложения.\r\n\r\nДорожная карта и этапы ясны и объективны, что облегчает проверку результатов и эффективности.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 18, "ne": 14, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Very strong and thorough assessment. And while I believe we did a strong job with the feasibility portion of the proposal, the CA's points of constructive criticism are valid points we'll consider in the future. "}, {"q0": "I am convinced that stakeboard will be a very successful platform and that the team is showing their skills and vision through the closed beta and this fund's Catalyst proposals. Stakepad will benefit from this success and potentially redefine the utility of ISO type funding for community type projects. The potential is huge. ", "q0r": 5, "q1": "The team has considered exhaustively the strengths and weaknesses of the ISO models we have seen thus far in Cardano. Their work on stakeboard shows their development talents. The roadmap for  stakepad is clearly broken down and I believe the team has all the skills and motivation necessary to achieve their goals. ", "q1r": 5, "q2": "There is a clear budget breakdown and road map for stakepad development. The given KPIs are meaningful and can be moitored from their stakeboard platform. It should be easy to judge the ROI of this project after 6 months. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 19, "ne": 3, "ng": 9, "nfo": 7, "vca_o": 1, "reply": "Succinct but helpful (and I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "There is a complete assessment of the problem statement and the current existing solutions around ISO models. In addition the scope of work is well described and thoroughly reviewed", "q0r": 5, "q1": "With several options provided and an in-depth review of the pros and cons. The team participating in this proposal illustrates strong knowledge and problem solving skills. \r\nThe scope of work or problem statement is a unique and highly in demand solution. ", "q1r": 5, "q2": "There are several key timeline and goals described. The team has laid out a detail roadmap. The key factors on the success of this project are easily quantifiable. \r\nEspecially that participating in 20 ISO. \r\nFinally the pricing or project is very conservative and seems within the appropriate needs of this project. I do think that there may be a need to increase the budget if issues arise ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "Succinct but helpful (and I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "This proposal absolutely addresses the challenge in providing a well-rounded and fair approach to making SPOs economically attractive and providing many of them more opportunities.\r\nThe main goal here is to take the existing ISO//FISO models (SundaeSwap/Minswap) and advancing the ideas and models by providing SPOs and delegators better opportunities. As well as providing everyone a central location for future ISO/FISO's.", "q0r": 5, "q1": "The team's information is public and accessible, as well as directly listed int the proposal. In reviewing that, they all show to have a diverse and solid experience portfolio. The plan has been well thought out and defined, with an extremely clear roadmap. There is a clear path laid out for the path forward.\r\nA piece of proof towards experience, is the Alice product the team already has launched.", "q1r": 5, "q2": "There is plenty of information to easily audit the goals and progress of this proposal. Within the body is a monthly roadmap as mentioned, along with KPIs that are understandable, and a cost breakdown that makes sense.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "This proposal clearly addresses the challenge, in a couple of areas, this includes:\r\nCardano scams and bad-faith players. In this particular case it is specific to SPOs.", "q0r": 5, "q1": "This team has demonstrated their capabilities in a very similar area with their 'Alice' project. I strongly believe that the team has the skills to accomplish the goals that they have outlined.", "q1r": 5, "q2": "The proposal clearly lists KPI's and timelines that are measurable. I would like to see a bit more of an explanation why Twitter impressions are a KPI when the proposal deliverable is a website (with Twitter integration).", "q2r": 4, "assessor": "z_assessor_977", "no_vca": 26, "ne": 4, "ng": 12, "nfo": 10, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}], "solution": "Stakestarter и Stakepad - новые модели финансирования, основанные на консенсусе proof-of-stake, - будут лучше служить SPO, делегатам и разработчикам Cardano.", "experience": "2 Технологические лидеры: CTO, основали несколько стартапов; SPO; Plutus Pioneers, Emurgo Academy\nСтарший дизайнер\nЛидер по развитию бизнеса"}