{"id": 369477, "author": "", "title": "Cardano Disaster Recovery Education", "url": "https://cardano.ideascale.com/a/dtd/369477-48088", "category": 26117, "amount": 12000, "description": "災害」への提案が足りない。すべてが危険にさらされているとき」。提案者は、資金不足ではなく、理解と認識の不足によって落胆している。", "f6_no_assessments": 4, "f6_rating": 3.2500000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "An education and awareness program would support the general knowledge base for SPO´s and might even help onboard new SPO´s if documentation and educational material is researched and presented in a high quality format. The problem statement that includes that there is a lack of proposals in this challenge points towards the need for more awareness and education on that topic for the whole community. ", "q0r": 5, "q1": "The website provided lists the team and experience and would point towards a high likelyhood of enough experience to implement this campaign. The milestones consist of research on, education and documentation of possible threats and providing this information to the community to support general knowledge of all and targeting SPOs specifically. It seems that this could support overall participation of community members. However, there is little information on how the team would want to implement outreach effectively - will they have their own communication and networking channels or bundle existing ones - and if so, through which repository would they communicate their links to SPOs and community members? More actionable steps would benefit this proposal to understand how they want to achieve outreach and SPO participation. Generally, looking up what exists and bundling those information would help SPOs to get access to critical information. However, some other proposals also want to provide information, it would be important that the funded teams connect with each other for the best results. The milestone to engage more community members to initiate proposals for this field is very relevant. The funding has a category that is not mentioned specifically in the proposal: \"Recovery Test Support\" so I´m not sure what that is referring to, since \"Compile all disaster recovery protocols and proposals\" is mentioned under \"documentation\". It would be good to specify actionable steps more precisely.", "q1r": 3, "q2": "Auditable is the goal to enhance participation through proposals, to document and to offer educational workshops. This would also be useful. However, information about how to reach SPO´s and community members as well as which repository or dashboard or channels will be used to document would be helpful as well as a timeline and possible cooperations to reach out to (Swarm, CA school, WADA, Gimbalabs...).", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 11, "ne": 8, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "This proposal identified a 'meta problem' since it states that the challenge doesn't have enough proposals, which is true, compared to the size of the challenge budget. The statement is not completely up to date since it mentioned there it Challenge only had 6 proposals, but more were submitted after that. But it really is a problem as mentioned. The proposed solution to create workshops and raise the awareness of the community about the topics aims at having at least 50 proposals in the same challenge in F7, but it does not take into consideration that the submission week is only a few weeks after the results of F6 are disclosed, which could lower the impact of this proposal. It also mentions some of the KPIs that would be tracked and they make sense to the Challenge, and since this would be a focused solution to a specific problem, there seems to be no need to mention something about the proposal's sustainability in the long term. Score: 3", "q0r": 3, "q1": "The proposer mentions his background experience and it seems to fit the desired skills to execute the proposed solution. Although, it does not mention if the solution would be executed by him only or by a team. This would also be important to evaluate the required budget since only lump sums are presented and it does not mention with more details how the money would be spent. Also, there is no roadmap presented, just some bullet points regarding the expected topics to be addresses after funded, and it seems like the proposer would have a very short period of time to deliver what he is proposing, since the submission week for F7 closes only a few weeks after the F6 results are announced, and this would make it very difficult to execute everything in time and to achieve the desired outcome. If the proposer has realized this, it should have been mentioned in the proposal itself. Score: 2", "q1r": 2, "q2": "The proposal does not include information about roadmap, milestones or a time horizon for achieving the desired outcome. As it mentioned that the goal is to increase the community's participation in the F7 'Disaster' Challenge, the time horizon would be very short, but it doesn't seem that the proposer has realized that. The proposer mentions some metrics and KPIs, which could help with measuring the outcomes of this proposal. The budget is briefly explained, but more details could be added in order to improve the proposal's accountability and how the money would be spent, what are the labor costs and what are other costs like website, platform, 3rd party tools and other general costs. Score: 2", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aligns perfectly with the Disaster: When all is at stake category. The current problem is well understood and articulated. The proposed solution, various forms of education and outreach, is simple and as such has few points of likely failure.", "q0r": 5, "q1": "The simplicity of the communication and outreach plan ", "q1r": 4, "q2": "The stated proposal outcomes are clear and well defined making monitoring of progress and success relatively straight forward.\r\n\r\nIn particular the success criteria are well defined, reasonable and if achieved would be valuable to the development of Cardano.", "q2r": 5, "assessor": "z_assessor_373", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposal offers a solution to the lack of other proposals in the challenge of disasters, having the Cardano Community as a target group. However, the proposal ignores the fact that there is awareness and tons of people working in this field, people just didn't come to Catalyst to get funding. Moreover, the proposal seems to put the issue of awareness in a simplistic way, which makes it difficult to assert that they will effectively address the issue. ", "q0r": 3, "q1": "Although the proponents have pointed experience working in engagement, they provided no information regarding experience in the field of disaster recovery or humanitarian help. Therefore, it's arguable that the campaign will raise the awareness needed in the Catalyst community. ", "q1r": 2, "q2": "The proponents provided enough success criteria in the proposal, however, they provide no roadmap with milestones and a time horizon for achievement. Additionally, the proposal is too audacious when it states that it will \"Document ALL disaster recovery tests and SPO participation\" and \"Compile ALL disaster recovery protocols and proposals\". \r\n", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "カルダノの災害復旧に関する啓蒙・教育キャンペーン。", "experience": "Bitcoin & Cryptoコミュニティを運営し、教育ワークショップやハッカソンなどを行ってきた8年間。"}