{"id": 414025, "author": "al.kc", "title": "Bringing Cardano to Cambridge", "url": "https://cardano.ideascale.com/a/dtd/414025-48088", "category": 26599, "amount": 4900, "description": "Cambridge is a global technology and pharmaceutical cluster including a top ten global university and thriving VC community. As yet Cardano has little consistent presence in this pivotal community", "f6_no_assessments": 19, "f6_rating": 3.999999999999999, "videos": [], "media": [], "f6_assessments": [{"id": 1155, "q0": "This proposal would involve some of the Cambridge students to participate actively to the Catalyst projects and getting familiar with the Cardano ecosystem. However, the challenge is set up to connect students with ENGINEERS to help them realizing their projects, hence, the students should be ALREADY be familiar with Cardano. \nOn the other hand, the team has already set up a business, who has already received funds to realize proposals in previous funds. This makes the team itself part of the group of students entrepreneurs ? no. the company Edify is formed by a team of experienced professionals.\nSo, why do I give 5 stars to the proposal ? because the team is actually trying to transform Cambridge in the physical meeting point for students and engineers to work around Cardano, and Cambridge seems indeed a good location as it is well known to be a hub for technology development. ", "q0r": 5, "q1": "As stated in the previous comment section, the team is well experienced and in particular has already took part to previous funding rounds, getting 5 proposals funded. Moreover the team has already connection within Cambridge university to organize meetups/conferences to facilitate the introduction of Cardano to the students", "q1r": 4, "q2": "I really dislike the fact that to have access to the Miro board I had to share my email. I feel the evaluation of this proposal is not anonimized anymore and the proposers should not complain about any critics by reaching directly the assessors. \nThe information provided is sufficient to assess the proposal as the brief contains a detailed budget breakdown.", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1, "reply": "thx for feedback - I agree with you about anonimity, we are still learning about using miro, hopefully it is fixed now, cheers @Harry.hellyer"}, {"id": 12105, "q0": "The proposal had major problems with Cardano's inconsistent presence in the VC and Cambridge communities. Where Cambridge is a global pharmaceutical and technology cluster that is included in the top ten global universities. Previously they had also sent proposals to the F7 and F8, which are currently ongoing projects. Creating several large communities with the aim of developing a Cardano based Blockchain is a good idea. The project involves Cambridge students and academics, Cambridge area businesses, Cardano and Catalyst and IOHK. by funding students and through major math and science community events at the university, it is hoped to increase awareness of the Cardano Blockchain within the Cambridge cluster.", "q0r": 4, "q1": "This project consists of teams who are already experienced in their fields. The author enters the data of the team who is the team leader by including the linkedin account link and explains in detail the profile of the leader. In addition he also wrote down the number of staff they have. Even though they didn't write down their names or staff profiles one by one, it was enough. The author also includes a reasonable and detailed budget for the costs of real-world events and online activities. However, for this community management fee, there is less detail for the breakdown. They should have described in more detail for transparency in the use of funds.", "q1r": 4, "q2": "They use Twitter to find out about project progress updates and also include links to track their projects. They also use KPIs to measure their performance but they do not write down the number of targets to become the standard of success of their project. The focus of this proposal is to increase Cardano's consistency within the Cambridge Cluster. The goals and solutions of the project are self-explanatory and supported by experienced staff, it will be easier for them to form a large community for consistent development of Cardano within the growing VC community and Cambridge.", "q2r": 4, "assessor": "z_assessor_3362", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 11689, "q0": "the project is well within the expectations of the challenge, targeting students from the University of Cambridge to be part of the cardano community. The university itself is well known to be of high quality, though not one of the ivy league members specifically. nevertheless, i believe in the queality of their education system and the graduates that they produce. in fact, when looking at QS rankings, UoC (University of Cambridge) is ranked number 2. with that, i can be confident that the students onboarded into the cardano ecosystem will have a higher likelihood of producing quality contribution to the ecosystem.\nIn terms of project sustainability, i believe that the project will survive in the longer term if executed well. marketing methods using word of mouth and with the value cardano can provide, i'm sure good word of the ecosystem will continue to spread waay after this round of catalyst. this is enforced by the fact that the team does not intend to come back for a future round of funding - this is a standalone project. \n\nthe proposal was very well written, with concise elaboration, and specific on the deliverables. for example, its clear to readers that the team does not intend to incubate student ideas across implementation. i appreciate the team being clear that the project is focused on increasing the number of Catalyst members coming from their community. from thereon, i believe they can do proposals and execute ideas from thereon. on the risks of the project, they were also well addressed. a brilliant proposal overall.", "q0r": 5, "q1": "being a proposal under this challenge setting, the budget asked for cannot exceed $5000. I am impressed with the budget breakdown from the proposing team, giving clear details of what each dollar will be spent on. This is refreshing, considering that many other proposal in other challenge settings asks for WAYY MORE money but cant even produce these details. the milestones were generally outlined in the proposal with no details. however, the team provided an external link with more details on specific timelines, which is appreciated. for the benefit of voters, the timeline for execution is across the first two terms of their academic year in the university, so starting from sep/oct timeframe.\nas for team credibility, i've no reason to have significant doubts that the team can deliver. the team behind this has a track record of being part of edifycolabs. they also have had proposals being funded in previous rounds of catalyst which is a bonus. the cherry on top of the cake is that Harry Hellyer himself also has quite an impressive track record to show for. \n\nmy only concern is that, how is the team executing on all the funded proposals from previous funds, plus this one? not a big hit, but somethign to take note of. ", "q1r": 4, "q2": "there are only 3 proposed KPIs by the team for a measure of success, namely Terms of reference established, Early adopters recruited, and Community up and running. The phrasing of these KPIs are… I would say… too simple for a proposal. They seem to be YES/NO types of KPI, rather than numbers based. at first glance, it does seem insufficient. however, zooming out at the proposal as a whole, their intent was not to deliver great numbers to say how many students they're reached out to. it was merely to introduce the good word of cardano in the UoC community. therefore...i would have to say it is acceptable, though i would have lked to see numbers attached to the KPIs to quantify impact. at these measures proposed, the team could simply recruit 2 students to understand catalyst and check off the KPI \"Early adopters recruited and Community up and running\"...\n\nthe team however, was able to state their medium of tracking their progress through twitter, which is helpful to hold the team accountable to, and we as the community get decent frequency updates, compared to monthly reports or worse, end of program reports. ", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11026, "q0": "Your Proposal: \"Create a community hub that includes the University of Cambridge, the Cambridge network and the VC community focused on developing Cardano-based Blockchain opportunities and development projects for students and technologists. monk\" . This is a very nice proposal to raise awareness of the Cardano blockchain in the Cambridge cluster, sponsor students and events through the main math and science societies in the university. This proposal contributes to making Cambridge University students and scholars more aware of the possibilities of the Cardano blockchain ecosystem; Businesses in the Cambridge area who will equally benefit from the value created by raising awareness of Cardano's capabilities; Cardano and Catalyst - will benefit from increasing awareness of Cardano in the academic and business communities centered around Cambridge University. The proposal identified a possible risk that was a difficulty in terms of time and money. The interpretation of reducing the risk I see as effective is not clear.", "q0r": 4, "q1": "I see that you chose Cambridge as the ideal place to make your proposal. Your target audience is very suitable: Students and scholars of Cambridge University, Businesses in the Cambridge region; Cardano and catalysts; IOHK. You have developed an implementation plan with a fairly suitable roadmap. In my opinion in the second stage: Building and implementing word-of-mouth campaigns with students and VCs and sponsored businesses, replacing word of mouth with different forms of communication: Face-to-face or online to can attract more students to participate. In phase 3, I think you should organize a series of real-world and virtual events that introduce the Cardano ecosystem and blockchain in an interactive form to create opportunities for speakers and students to be awarded. directly exchanged. I would like you to clarify how you support the business to benefit? The proposed implementation plan is not detailed, there are no timelines corresponding to the work to be done. The budget for the project is quite suitable, but there are some unspecified expenditures for example Program management, $20 / hour * 20 hours = $ 400 can be integrated with Community Manager $20 / hour * 50 hours = $1000 not necessarily spent in two items. Currently, the information about the people working on the project is not complete, you need to provide more for us to know their capacity.", "q1r": 4, "q2": "You have not provided specific information to measure project progress. The success of the proposal has not been clearly described, it is necessary to have data to support the specific results of the proposal after implementation. This is a new project, the purpose of the project is very good, but I think you need to supplement and adjust to make the project more complete. Good luck.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8816, "q0": "As Cambridge is one of the top cities for science and technology ,where top minds across the globe are seen in Cambridge , if people of this place are lacking the knowledge of cardano , then that would be a big disappointment.  Hence  to overcome such scenario a professor of University of Cambridge wants  introduce the idea of blockchain to the students, so that students can make maximum benefit out of it and they can even get funded for the projects , that students wants to build, so with this it can even widen the cardano ecosystem, hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The mentioned task is not a difficult to achieve , where proposer wants to set up community of cardano in the university of Cambridge, so that both students from university and people around can Cambridge can be aware about cardano, for this task to achieve the team just needs one good speaker to keep the students engaged with him, so this task can be achieved by professor himself who has more than 10 years of teaching experience and the Edify business team who has been contributing in cardano ecosystem  since fund 7 , so this team alone can share the experience to make the project a successful one, Hence  given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The audit has presented clear objective to create the awareness of cardano among the students of University of Cambridge, audit has even mentioned about the the team Edify where 5 professors are trying to create awareness of project catalyst among the students ,as well as people around Cambridge.\naudit has clearly mentioned on how their idea can counter challenges of students project funding, the proposed task has clear timeline to complete the project, it even has detailed budget breaking idea to complete the project, Hence with minimal risk involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 8335, "q0": "The University of Cambridge is a collegiate research university in Cambridge and is one of the most prestigious universities around the world and the students studying at Cambridge are very brilliant in academics as it is very difficult to get into such universities. Introducing a community hub in cambridge for spreading the knowledge of blockchain and cardano would be bringing in very brilliant minds into this technology and they will be getting the exposure and knowledge of this blockchain and is a brilliant idea. The proposer has identified the need for such a hub or a group of people to gain knowledge about cardano and its blockchain and provide assistance to them in building efficient proposals. By doing so, the proposal will benefit more numbers of young proposers who needs guidance and gain more users to the Cardano community which will in turn increase the value of cardano ecosystem and its users. The key metrics specified in this proposal defines the success of the proposal and is aligned to achieve the goal. The proposal can be scalable to address the future challenges as they can be implemented in such similar universities for the spread of knowledge about these future technologies.", "q0r": 4, "q1": "Since the proposer is lecturer at the cambridge and has been involved in the university he has the necessary knowledge and experience to complete this proposal. The proposer has provided enough information to support their experience required for this proposal but could have mentioned more about their teams experience. The proposer has not provided evidence by providing several reference links to support their proposal. The budget has been mentioned clearly which is 4900 USD and is reasonable for this proposal and has not provided the breakup cost in detail. The proposer also offers a realistic time to complete the proposal as they have the necessary resources for successful implementation. The proposer has also mentioned the challenges or difficulties faced during implementation of the proposal and has considered them and is prepared for the successful implementation of the proposal.", "q1r": 4, "q2": "The proposer has provided a roadmap with the steps for the completion of the proposal within the specified time and the provided information is sufficient to audit the progress of the proposal after the funding as they will be able to audit after every step mentioned in the roadmap. The key metrics mentioned in the proposal align with the proposed goal to succeed and also defines the parameters for success of the proposal. The proposer has identified the problem of introducing a hub at cambridge university to spread the knowledge of cardano to the brilliant minds studying there and has provided a solution that addresses the problem which is most likely to succeed. The proposer has provided all the necessary information and has analyzed the problem to be solved efficiently. Hence I feel the information provided is sufficient to audit the progress and the success of the proposal and I rate this a 4 star.", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8269, "q0": "The Cambridge environment seems to have a lot of potential to expand Cardano's influence, and the proposers seem able to taje advantage of that. I think the risks ae well thought out, but I also think it should be considered as a risk the possibility of students rejecting the idea due to a pre-conceived notion of cryptocurrencies. Other than that, I think the project can have an important impact on the Catalyst community.", "q0r": 5, "q1": "The Miro board is not shared publicly, so I can't access it, so I can judge only based on what it is written on Ideascale. Regarding the milestones, it seems a bit too simple, I would have liked more details about each step, but I suppose these details are on the Miro board. The budget is realistic and seems to consider the main activities. I think there could be some extra dedicated to unexpected expenses, as these are common in events.\nI believe the team member is very experienced, and seems to have already a strong connection with Cambridge.", "q1r": 4, "q2": "The proposal lacks specific numbers to measure the project's success. For example, how many students does it plan on reaching? Would the retention rate be measured? While tracking the milestones is important, I believe it is not enough to understand if the project is reaching its proposed goals, as there is the possibility of completing the whole project, but not having any impact. \nHowever, it is very positive that they added the SDG goals.", "q2r": 2, "assessor": "z_assessor_2971", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8049, "q0": "We understand that the proposal aims to facilitate the development of small projects, whose ideas come from student initiatives, which despite bringing original ideas, have few resources and little visibility within the Cardano system. The project intends to popularize knowledge about blockchain within the university. The idea of promoting the training of students in the area of Technology, so that they understand the ways of using blockchain technology to implement these projects seems to us to be quite adequate and effective, since from small projects there may be developments to larger ones, which come to provide decent work and remuneration for those who are entering the market, and who wish to develop their own projects, instead of entering the traditional financial market, where they would possibly not have opportunities to progress as in an independent project. Considering that innovative ideas can arise within the reality experienced by the student at the university, and that they can often be implemented by beginner developers, but who need financial support to start a project, the idea is to bring the basic knowledge of how the system works, to facilitate the proposal of projects based on Cardano blockchain. We also understand that due to the growing volume of proposals and proposers, it will be necessary to promote adequate training so that these students have the necessary intellectual resources to propose consistent projects, adequate to the reality of the university student, and that can be developed to solve not so grandiose projects, but that will favor the insertion of the use of the Cardano platform in the execution of these projects, which can be useful in various sectors of society, such as local commerce, exemplified by the proponent. We also consider that, due to the curious and investigative nature of the university student, the propagation of blockchain technology and its countless possibilities will be more successful than the attempt to make this movement among professionals who are already well adapted to the formal market. As for the application of the project, there is a lack of better detailing of steps to be carried out, in addition to a clearer schedule sequencing each step. And what will be covered in each. The proposer informs that the team already has knowledge in mentoring training within the University of Cambridge and Imperial College London. It remains to be seen whether the team that will promote the instruction of these students has the necessary training and knowledge about the Cardano blockchain system, for the success of the venture.", "q0r": 5, "q1": "As is natural, new information must reach a larger group of people through virtual contact initially, so that in a second stage, those who are really interested in and adapt to the work model can receive face-to-face training, and thus be able to develop improve your skills in relation to knowledge of new technology. Therefore, we consider the idea of investing initially, through groups already formed and accustomed to the university's internal communication, in the dissemination of the idea, in order to draw attention to the project. And the fact that the call comes from a team of people already engaged in communication work, and well known at the university, will bring credibility to the communication. In a second moment, the work with the interested parties, already in person, will reinforce the ballast of knowledge around the subject, building the mechanisms of knowledge construction, through sequenced expositions about the development work of a project developed by the blockchain system. Cardano, ensuring that its participants have enough knowledge to prepare proposals that fit the profile of blockchain technology. As for the cost spreadsheet, we consider that it was adequately explained and corresponds to the expectations of expenses with the activities listed. Divided into five stages starting in September or October, it aims to train students to enable them to build projects that aim to meet the needs of the community, using the Cardano blockchain system. As for the execution, it would be convenient to establish a period between the meetings, so that one can have an idea of the exact duration of their duration. It would also be interesting to establish some kind of evaluation method, such as an ideas workshop for the elaboration of projects, at the end of the training, to better solidify the teachings taught. Regarding the team, the formation of only one member was mentioned, citing that he works with five other people, but without specifying the formation of these others. It is worth remembering that, in addition to the technical knowledge of how to disseminate knowledge in the university environment, it will also be necessary to understand how much the team is trained to train students, in relation to the basic concepts of the blockchain system, and this point was not well specified in the proposal. For this reason, although they are already people involved with projects in Catalyst, it would be interesting to name them as well as specify their background, in this project specifically.", "q1r": 4, "q2": "For the auditability of the process, we consider that in addition to the established terms of reference, it is necessary to periodically monitor the engagement of Students graduated in the course, so that they can feed a database, informing whether they are effectively working on projects that involve the blockchain system. Cardano, and so that the extent of the work and its results can be measured more reliably. A suggestion would be to carry out periodic surveys, to feed this database if data, so that one would have an idea of the scope that the project reached, in terms of its final objectives. In addition to measuring recruitment and functioning, it will be necessary to understand how long they work, and if they were actually executed to their end goal. Finally, it is necessary to know the segment of work of each trained member, which projects they worked on, and for how long, so that it is possible to measure whether the commitment to training these students really determined the achievement of an objective in each project in which they were involved. ", "q2r": 4, "assessor": "z_assessor_2941", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12334, "q0": "The idea seeks to provide a solution that will contribute to the cardano ecosystem. The proposal seeks funding to establish a community hub in the cambridge region. As this will provide a platform which will elevate the attractiveness of the cardano ecosystem over and above other blockchain. This will allow students of the communtity who are passionate about our blockchain the opportunity to learn through the established hub. The education and knowledge about blockchain and cryptocurrency is not anything new to the the cambridge area. The proposal provides the need for the community to start a hub to on board the cardano blockchain which is in line with the challenge setting. ", "q0r": 5, "q1": "The team working on this project have many years of experience in this  area and have the potential to the its implementation. However, I'm not too sure about the budget cost of 4900 dollars. The stated amout is relatively too small for the intended purpose. If this will cater for the implementation, I dont think the stated amount will run through to be able ensure the sustainability of the hub. How will this project go a long to impact the community in the future, I recommend the budget be revised with a plan for its sustainability. There is detailed plan to the project in a link provided. I believe the project has provided the needed information for its implementation", "q1r": 4, "q2": "There is clarity of information in the project. The proposal has detailed what intends to do and how its going to execute its activities. There is a clear roadmap with milestones showing how the project is to be carried with the set timelines. There is a link that provides this to this effect.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 7586, "q0": "The problem described in this proposal is closely aligned with the challenge.The proposer has done well by putting the proposal in the right challenge.The proposal seeks to add value to the Cardano ecosystem by providing the edify team which has experience  in coaching and mentoring senior leaders and fellows in both the University of Cambridge and Imperial College London academic senior leadership to bring onboard many participants. The proposal also captures the key important metrics under the campaign breif to promote Cardano and the growth of a community hub which will increase the engagement of top quality students and engineers into Catalyst Innovation Hub. The proposal scales to ensure inclusive and equitable quality education and promote lifelong learning opportunities for all students and engineers", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in the proper execution of the project, from the links provided the team have the desired skills and experiences to be able to implement the project which I think is highly commendable. The proposal has also provided a detailed \na budget which has been broken down into identifiable bits on both real world events cost and online activities .The proposal also outlines the milestones  which includes the terms of reference established , early adopters recruited and community up and running activities among others. The proposer has also considered the main risk of identifying key influencers amongst the Cambridge technical and academic community and this will be mitigate d by using their existing networks in The University of Cambridge, Cambridge Network and VC network to bring together a team of early adopters for the project.", "q1r": 5, "q2": "The proposer and team has provided a clear outline on how to measure the progress of the project by the milestones provided.They have also provided information on how success of the proposal will look like should they be funded by elaborating on  growing community of interest, centred around the opportunities that Cardano presents to connect Cambridge students with the channels for project funding in the engineering, Tech and biotech community in the region to promote the Cardano ecosystem. The proposer has also indicated how their progress will be monitored and reported to the Cardano community by making  making reference to twitter channel  @edifycolabs for updates on project progress.", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5819, "q0": "This challenge solely targets students; how to onboard them and also educate them to come out with creative ideas that will better their lives and society’s and also help build the Cardano ecosystem. \nThis proposal addresses this challenge by creating a hub in Cambridge University that will serve as a training and awareness center for Cardano in the Cambridge cluster.\nThe establishment of this hub will lead to possible onboarding great academic brains from Cambridge University and the Cambridge cluster. \nStudent entrepreneurs will also get to present their ideas for possible funding in project catalyst. Some may also participate in project catalyst as PAs to help build an enviable ecosystem. \n", "q0r": 5, "q1": "The proposers have given a detailed plan in an attached file. The milestones are presented with allocated time and dates for performance. The proposes do well to outline anticipated risks and plans to mitigate these risks. The team presented is an outstanding one. Some team members are currently working on projects from previous funds. They have a team that is experienced and skillful to do this job. \nLinks to their relevant experience and other video attachments are given. \nThe budget is well constructed and I think the fund requested is reasonable for the project. \nI believe this project can be executed successfully if funded. ", "q1r": 5, "q2": "The KPIs presented by the proposers are measurable and easy to audit. Success metrics are elaborate and simple to understand. The proposal presented is clear right from the problem to final deliverables. I think this proposal is auditable.", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 5714, "q0": "This proposal puts forward a project that is totally student-based with students as the main focus group, which adequately adresses this challenge. I am excited with the idea that Cambridge students, a community filled with talented individuals and future leaders, will better aware of Cardano. If implemented successfully, this project would bring a pack of highly accomplished individuals to the Cardano community. The success of this project will tremendously benefit Cardano in future development.", "q0r": 5, "q1": "The proposer has already had resources and experience to implement this proposal successfully, including the time working at Cambridge and the relationships built there. Elite institutions, including Cambridge, are especially excited with new ideas and knowledge; therefore, this project's implementation in these schools is more than advantageous. The idea behind this project is simple yet effective. There is no doubt that if implemented successfully, this project will accomplish the challenge's ultimate goal - to raise awareness and participation of students in the Cardano community.", "q1r": 5, "q2": "Most parts of this proposal is adequately provided with helpful information. However, I would love a more in-detail description of the marketing plan for this project. They key objective of this project should be to advertise and obtain as many students to be stakeholders as possible, which highlights the importance of marketing. I understand that the author would utilize relationships for marketing purposes; however, it should be more than that, and detailed marking plan should be included in this proposal.", "q2r": 3, "assessor": "z_assessor_2741", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4767, "q0": "The proposer presents the problem, which is that Cardano has little consistent presence in the Cambridge cluster, and offers a solution in the creation of a community hub including the University of Cambridge. The entire section of Impact is elaborated in detail and the proposal key metrics are aligned with the outlined challenge settings and the proposal is able to scale to address future settings. In Impact itself, the proposer develops a plan for future sustainability in detail. ", "q0r": 5, "q1": "The proposal includes a link over LinkedIn, from which we can clearly see that this is a man who has the necessary knowledge, skills and experience needed to complete this project. The budget is reasonable and a detailed budget breakdown has been made. So that the community has an insight into what the money will be allocated to. The proposer made an implementable plan and the time frames within the project will start were mentioned. Possible risks as well as solutions are listed in this proposal.", "q1r": 5, "q2": "I would like a detailed roadmap to be made so that the community knows how the project will develop over the weeks, months, again Key milestones for delivering this proposal are presented together with KPIs so that the community can follow the development of this project without any problems. But as I mentioned, it would be great if we had time frames!", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3493, "q0": "Undeniably, the proposal presented offers strategic possibilities for the Cardano ecosystem.  The team that will be in charge of this proposal undoubtedly possesses the maturity and experience more than necessary to bring the project to a favorable outcome.  However, it is evident that the proposal is not being submitted by proposers with the profile that the Challenge \"Challenge & Scouted for Students\" has clearly stipulated. The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge, approved by the Catalyst community last fund, is to provide college and university students with a space completely separate from the regular Catalyst environment in which they can bring their projects to Project Catalyst and secure base funding, nothing financially ambitious. Clumsy projects, with flaws or weaknesses if any, but with a true innovative and creative student spirit, insolent and daring, that will lead their authors to find in our community a place to learn and get involved, a playground endowed not only with money, but more importantly, with the possibility to get hands on with the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it. That's just what this Challenge is trying to do: build a suitable habitat for students, designed primarily by the students themselves. \n\nBecause of my affinity with this Challenge (formal experience in education at school, university, company level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students.\n\nAs an educator and experienced Project Catalyst member,  I understand the intention behind the proposal and consider it completely valid. However, it is evident that it is not being proposed by the type of students that the Community decided to support through this Challenge, therefore it does not fit the parameters of the Challenge.  I quote (excerpted from the Challenge information): \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section). \n\nTaking into account the above reasoning, I must remove three stars from the final rating.   \n", "q0r": 2, "q1": "The information provided as the proposal implementation plan (Feasability and Miro board section) is sufficient to understand the scope of the project to be executed.  Based on my real world experience as an educator and entrepreneur, the numbers listed in the budget are in line with the type of project to be implemented.  The information provided on the work team is sufficient to establish their background and strength, in addition to the fact that some names are easily recognizable by their active participation in the community.  However, based on the reasoning provided in the Impact section, they are competing in a category that was not designed for them.  The Challenge guidelines are clearly stated.  Therefore, unfortunately, I must disagree with the appropriateness of the execution of this project and therefore proceed to remove three stars from the final rating.", "q1r": 2, "q2": "The KPIs provided by the proposal can efficiently accomplish the performance measurement tasks required.  In general, the project presents a feasible and measurable scenario.  However, proceeding to measure its performance would mean measuring the performance of a project that is outside the guidelines that were clearly given to the Challenge “Challenge & Scouted for Students” competitors.   Therefore, similar to trying to break a physical law, I see measuring the project as impossible.  Consequently, I must remove 4 stars from the final rating.", "q2r": 1, "assessor": "z_assessor_2462", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you for your excellent feedback - the depth of which is much appreciated. The submission relates as stated  with the context of buiilding relationships and expertise - of both business and blockchain: helping foster relationships between the students, educators, businessess and funders wihtin the cambridge cluster. The content of the sessions then would be a mixture of business coaching - as given in our F7 and F8 incubators, accelerators and scale up programmes - and student led sections explaining blockchain to businesses and funders. Outside of your role as a PA if you were interested it maybe that we can talk further about how this approach - which we know works well in other areas of tech and business could be adapted to support Catalyst and students better.   My conatct is in the proposal Thx again @Harry.hellyer"}, {"id": 3224, "q0": "Cambridge University is one of the most recognised in the world, a community hub which connects this university with Cardano and its opportunities might be the perfect place for revolutionary ideas to born, directly funded by Project Catalyst. Cardano could become the first choice blockcahin for some of the world's highest achieving students to develop their best idea and projects, thanks to the awareness spread by this proposal implementation. Therefore, I strongly agree this proposal addresses the challenge.", "q0r": 5, "q1": "Budget breakdown is accurate and reasonable, in accord to challenge settings, the plan to accomplish the proposal is well studied and detailed, there is only one simple KPI, that will determinate if the proposal will be successfull. The person who will work on this proposal is highly qualified on the involved sector, as stated in the proposal. My only concern is the lack of a proper timeline for the proposal implementation, all in all, due to provided information, I agree that's likely this proposal will be successfully implemented.", "q1r": 4, "q2": "I agree provided information are enough to audit proposal progress and success, the milestones are clear and public updates will be shared over Twitter, my only concern is the missing timeline, which makes difficult to check if the proposal is implemented in a reasonable time.", "q2r": 4, "assessor": "z_assessor_2419", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 3142, "q0": "In that they propose to implant at a university, network with students, academics, businesses and investors - yes, appropriate impact zone for this proposal. \nHowever, I am confused about WHAT they are actually proposing. Is it a physical HUB?  A conceptual community? Just a pair of events? The exact shape and scope of the project seems to wobble throughout the proposal.", "q0r": 4, "q1": "They specifically mention that they will pay students to do something, but there is no details about this, and I don't see any money earmarked for students in the budget.  The budget seems very lean for what they propose to do, and I don't see any time/money budget alotted for developing content for their events. It may be that content developing is happening under their other proposals, but that is just  a guess, and is not explained here. Their miro board which apparently contains the project plan is restricted-access and I was not able to view it. I will update later if I am granted access to view it.", "q1r": 3, "q2": "Apparently the auditability milestones are described on the project plan, which I cannot access. (Note that the proposal form specifically says not to do this - linked content is FINE, but all key proposal information needs to be included IN the proposal!) Beyond that, they say they will tweet about it, which is not an impressive auditability plan. I will update this review if I am granted access to the project plan document.", "q2r": 3, "assessor": "z_assessor_2404", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 1219, "q0": "Getting Cardano embedded in Cambridge University could help bring awareness to the the Univesity setting in the area and provide a resource to help with all things Cardano.  This proposal is limited to a single university setting, but the goal of the proposal is looking to connect, network, and build the Cardano community within existing known groups at Cambridge.", "q0r": 4, "q1": "Given the nature and setting of the environment within Cambridge, it is highly likely that some additional funding and resources spent on getting Cardano included in the Cambridge atmosphere will be highly feasible.  The proposer has a vast wealth of experience in business coaching along with his ties to Cambridge University.  The proposer is also linked with Edify Labs which is already native in the Cardano ecosystem.", "q1r": 5, "q2": "Communication of the project plan via the Edify Labs Twitter handle will help give updates to the project.  Project metrics described for the project are adequate in understanding the progress that is being made on the proposal.  In addition, a breakdown of the funds are listed giving transparency into how the funds will be spent.\n\n**NOTE: The success measures are not clearly demonstrated within the proposal and require a Miro account to be created to view them.  ", "q2r": 3, "assessor": "z_assessor_2219", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"id": 7084, "q0": "I am unclear of the proposal’s contribution because there is no explanation of how they would implement their events (what are the students going to learn? Who is going to teach them? How many times are the sessions going to be held? As for context, the proposer is planning to build a community hub at the University of Cambridge, which already has clusters and networks that promote the development of certain technologies. This is an opportunity to foster bright-minded students to collaborate and contribute to the Cardano ecosystem, perhaps by participating through Catalyst. By the end of the project, a community that consists of selected students who are interested in Cardano will be formed.\n\nThat being said, it is still hard to determine what their learning outcome would be. The proposer already mentioned that five events are going to be held. However, the information about what the students would do or learn at those events is still not present in the proposal. Thus, I suggest the proposer start from there. List the topics they would share, pick the speakers, plan the activities, and perhaps incentivize the students to get involved with Cardano or Catalyst.", "q0r": 3, "q1": "With the current plan, it is still hard to determine whether or not the implementation is executable. The budget is broken down into items, but it is tough to understand what those items are going to be used for. For example, what is the difference between event management, program management, and community management? Why do each of those three have different hours of implementation? I strongly advise the proposer to elaborate more on the budget item details as if they were explaining them to a random stranger. By doing this, not only could we approve and rationalize the budget request, but they could also stumble across things that might perhaps need additional funding or unexpected problems. For the same reason, I would also advise the proposer to change the use of academic terms (opting for months instead) and turn their implementation items into each span within the timeline, essentially turning them into milestones. It is unfortunate that I can’t give my support for this idea because the proposer does have relevant experience and they have been involved with Catalyst before, but, as presented right now, the proposal is missing a lot of crucial details, although they are definitely revisable.", "q1r": 2, "q2": "As of now, I disagree that we could audit the proposal for a number of reasons. First, the proposer provides the plan into phases, but it isn’t clear when each of those phases starts and ends. This could be fixed by determining approximately how much time each phase would take. Second, the proposer has listed the KPIs (which is very appreciated), but they are not measurable. For example, the proposer targets the adoption of early adopters, but how can we measure this exactly? One way to mitigate it might be to target X students to join, Y many events are held, Z many activities, etc. That being said, the proposer does provide a way for us to keep track of what’s happening through their Twitter. Although it would be better to post updates from the community hub’s Twitter account itself to increase visibility.", "q2r": 2, "assessor": "z_assessor_2878", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "thx for feedback, sorry cant relply to all comments pls see reply for assessor id 4288"}, {"id": 13393, "q0": "1.this proposal does not provide an answer to this challenge. The proposal is poorly designed, without a concrete work plan.  Only a detailed financial plan is listed, as well as the contacts of the persons responsible for the implementation of this proposal.  That is a completely insufficient amount of information to come to realization.  The goal is cooperation with Cambridge University, which is very useful.  However, considering that it is the most popular and successful university, with such a plan, this proposal would not go far. The proposal does not effectively affect the challenge, therefore it does not solve it.  to this project, but that is not enough.  Information on the motivation of the participants is needed, as well as a time plan for implementation.  The contacts are also written in detail, as well as the goal. The only concrete result of this proposal is the employment of around 50,000 people.", "q0r": 3, "q1": "2.The plan is incomplete.  The time organization for the implementation of the proposal was not mentioned. The financial plan is fully explained in detail and sufficient for implementation. It is not about impossible figures, but quite realistic numbers (1800 dollars).  The plan to motivate the participants, that is, the students, was also left out. And that represents in some way a problem of realization. Nevertheless, all this information is one of the key ones, which would help in realizing this proposal and meeting the challenges.  The motivation of students is very important, without it there would be no interest and the plan itself would fail. The measurement plan is another thing that has not been stated to the end, it has not been explained.  The goals are clearly set, but we should not stop there, because every goal requires an explanation. How do you get there?", "q1r": 3, "q2": "3. The proposal does not give us a sufficient amount of information at all. For such goals (cooperation with Cambridge University), the number of facts that are very necessary for realization is not sufficient.  Like the plan, the information is also incomplete. We received a large amount of information about the contacts of the persons responsible for this project. However, this does not meet our requirements, the requirements of a well-made proposal.  Sufficient amount of information about finances, but that's why the time plan is omitted. Information about student motivation is not emphasized in any context. The most highlighted information is about the goal of the proposal, cooperation with Cambridge University, a large number of interested students, a lot of employees.  There is no information listed anywhere for the implementation of this proposal.  Which represents one major drawback of the entire project.", "q2r": 4, "assessor": "z_assessor_3617", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Create a community hub including the University of Cambridge, the Cambridge Network and VC community focused on growing Cardano based Blockchain opportunities and dev projects for students & engineers", "experience": "Ten years coaching fellows and lecturing at the University of Cambridge, Imperial College London and University of East Anglia"}