{"id": 414271, "author": "benmahmoudyosr02", "title": "Cardano for MENA", "url": "https://cardano.ideascale.com/a/dtd/414271-48088", "category": 26599, "amount": 5000, "description": "The MENA region is under-represented in the domain of technology due to inaccessibility of information in arabic and the fund shortage which hinders students from developing innovative business ideas", "f6_no_assessments": 21, "f6_rating": 4.19047619047619, "videos": [], "media": [], "f6_assessments": [{"id": 11756, "q0": "Ideas are perfectly aligned with the challenge setting. The authors propose to build the first high-quality online education platform on blockchain and Cardano in Arabic, exclusively for university students in the MENA region. The aim is to \"universalize and enlighten\" about blockchain for Arab students who are passionate about technology, and create a community to learn and enhance their potential in the field of technology. Personally, I think this is a good, useful solution that solves an important problem of the challenge. That is to remove barriers, unlocking potential in the group of Arab students who love blockchain technology. By creating an ideal, safe space to study, Arab students here can exchange ideas and find opportunities in the vast blockchain world. The good news is that these opportunities are free (online education so anyone can attend), and easily accessible (in their mother tongue). I believe this is extremely important for students, as well as young people, in MENA – a region where, according to UNICEF, almost half of the population is under the age of 24 (https://www.unicef.org/mena/education). I endorse the 5 main roadblocks that the authors have raised: financial difficulty, lack of blockchain knowledge, lack of tutorials to get started, lack of background learning in Arabic, a plethora of resources data on the internet in English but scattered and not systematic. Among them, I found that the biggest barrier preventing Cardano from accessing students in the MENA region is the issue of financial constraints. In addition, another risk that the author has not mentioned is the expensive cost of connecting to the internet in Africa. In fact, MENA brings developing together countries, the majority of university students in the region face difficulties in paying tuition fees and do not have adequate financial conditions to access public knowledge resources. new technology. Not to mention, the cost of internet in Africa is always among the highest in the world, people have to pay an average of 10-20% of monthly income for internet costs. This risk will be a major barrier restricting students from accessing online learning tools. In terms of the overall impact of the solution, I personally think that giving Arab students more opportunities to learn and interact on free platforms like this proposal is also giving them the and motivation to start a business in the field of technology. From there, help them improve their living conditions, and fulfill their personal financial goals in the future. This is also the spirit of the challenge “Challenge & Scouted for Students”. Therefore, I personally believe that if approved by the community, this idea will make a useful contribution to the development of our Cardano ecosystem in MENA – a high population, culturally diverse area, are interested in digital assets (https://www.arabnews.com/node/2056231/business-economy). This is why I rate 5 points on the impact of this proposal.", "q0r": 5, "q1": "The project implementation roadmap is short and clear with a total time of 3 months, including 10 work items scheduled for weekly implementation. However, in my personal opinion, this roadmap is too short and can only produce a beta version. I hope, the authors do not stop at a mere knowledge-storing learning channel, but actually create a community of students who love blockchain technology in the region. Therefore, this educational platform should be supplemented with interactive features between learners and instructors, between learners. This has not been mentioned by the author in the implementation process. I suggest the authors connect with blockchain engineers and technology lecturers in the region to join together to create a Q&A forum, to answer the difficulties students face during online learning. In addition, activities to increase interaction among online learners should be enhanced. For example, organize online competitions with quick tests for students who complete each knowledge area, organize individual/team competitions according to learning themes (weekly/monthly), award prizes to the top 3 people. Cardano topics should be included in these sponsored contests to find excellent individuals and ideas after the online course. Personally, I think that the 3-month roadmap is just enough for the team to do the preparatory work and create a demo version with basic features. Still need another 3-6 months to continue to perfect and add the above additional features. The budget of the proposal is divided among the items but unfortunately there is no associated component unit price. For example, the $1500 payment to the instructor should be explained in detail: for how many instructors, how many months to pay? I myself am a website maker, with a website design category the author recommends $ 500, personal experience I would like to share: the cost of buying a domain (need at least $10-15, depending on the domain name will have a different price), hosting cost (average $30-50/month for traffic under 100,000 turns/month, suitable for the first 3 months of project development). The group also needs to have a plan to upgrade hosting monthly/quarterly if the amount of traffic at the same time increases, to ensure that there are no problems of congestion, network drops, or stopping access due to insufficient server capacity response. Regarding the team, the reference links to the individual profiles of the authors are exhaustive. The author himself is a second year computer science student at the Faculty of Science of Tunis, Tunisia. I believe, the authors will understand the difficulties MENA students face when approaching blockchain and Cardano. However, if possible, I need to add more convincing evidence to believe that the author is qualified to carry out this project. Therefore, I rate 3 points on the feasibility of this proposal, after deducting -1 point because it is necessary to add to the roadmap for implementing feature enhancement items for the web, -1 point because of the budget is not detailed.", "q1r": 3, "q2": "From an audit perspective, I think the team should have put more effort into describing to the community the auditable metrics in each category of work. The author mentions, success is when “accomplish the purpose of the project by introducing the largest number of students possible to programming and blockchain”. So I ask, what is the maximum number of students that can be here? I need the specific success number given by the team. For example, there will be 5000 students after 3 months of learning programming and blockchain, with an average learning time of 2 hours/day. I also need the author to give very specific related success KPIs. For example, platform traffic (per day/week/month), time spent on the interface (in days), what keywords or knowledge areas users search the most?… I consider this a well-thought-out and methodological proposal. However, the authors need to provide more specific and clear information and numbers. These are mandatory requirements so that the community can easily audit the achievable success of the proposal. I can only give 4 points, already -1 point for missing the above KPIs.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1040, "q0": "I find it valuable that the proposer has provided ample background information regarding the importance of implementation of his project in this specific region. There seems to be indeed a high need for resources to be translated and available, not just for students, but for everyone from the MENA region (the Middle East and Northern Africa), in order to start forming a community of developers and creators from that part of the world. \nFrom what I gathered throughout the proposal, the main language of education will be primarily Arabic, even though the MENA region covers a lot of countries that have a very diverse linguistic coverage. But for the first purpose of this project, Arabic is probably the most spoken and makes the most sense for a first edition. But I think this is an important factor that the proposer could have detailed further, especially since he mentions that one of the purposes is to “Spot ambitious students with innovative business ideas”, but I could not find a clear mention of where the students will be coming from, not just from which universities, but also from which countries in the region. \nWhat I would have liked to read more, not just through the impact section, but the proposal overall, is some more detail regarding the platform’s structure and content, so I could get a better sense of what the team is trying to build. But since I find the main focus of the proposal as benefitting to our ecosystem and consider that the impact the project could have is valuable, I will be giving this section a score of 4.", "q0r": 4, "q1": "While I have generally seen several learning platforms and I can easily imagine one and its possible functionalities, I would have hoped to gather more information about the activities and design for the one described in this proposal. Even though I agree in general about the importance of such a potential platform, the information provided is not enough to get a sense of the functionalities that will be offered, that will be the main pillars of the success for this project. The purpose of this platform is to teach students about blockchain and Cardano, as such, I imagine that the driving factor behind its development would be how that information can be delivered as fast, efficient and interactive as possible. If the team behind the project has a very clear sense of what they want to implement, I think they have to try and learn to better convey that information to other people.\nBecause of the lack of such vital information, I am put in a spot where I cannot judge the timeline provided, the budget described or the skills of the team members, no matter how well they were written.\nSpeaking of the budget, I find the numbers provided to be appropriate, but again, I would have liked to see a bit more information about the number of hours or other metrics needed for some of the operations, like developing the website, and editing videos or translating content. \nEven though I like the idea, I cannot estimate if, based on the information the proposer has provided in this section, that the project can be successfully implemented or not.", "q1r": 3, "q2": "I feel that the tracking measurements described by the proposer are the basic, general ways of keeping a team going and working on any project, and does not offer any specific insight into how the progress of this particular proposal will be tracked, and most importantly, how the Cardano Community will be able to track its development: “Establishing clear deadlines for every task”, “Setting specific goals and deliverables throughout the project” etc. The team should have posted clear metrics that they will use to check if the project’s progress is on track. As a quick example that comes to mind, tracking the number of students who enroll on the platform or the number of teachers willing to share their knowledge etc. would have made for some clear, verifiable metrics and the team only would have had to decide on where they would publicly track these. It could either be on a website, discord server, miro board or google sheet etc.\nGoing into the next section, the first answer to the success question is “Maintaining the fixed budget and not exceeding it”,  and even though I sense there is good intention behind it, I find it feels weird to read it as a success base for an entire project and casts doubt over the previous section of feasibility that contains the budget decided by the team as being sufficient. Combined with the fact that the proposal’s plan is not well defined, the budget is not detailed, and the KPIs are missing entirely, I feel like neither the Catalyst, nor the Cardano Community can easily audit the progress and success of the proposal as it stands at the moment. If not funded in this round, I hope the team can come back and resubmit the proposal with the missing additional details.", "q2r": 2, "assessor": "z_assessor_2192", "no_vca": 11, "ne": 3, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Auditability:\n-''does not offer any specific insight into how the progress of this particular proposal will be tracked, and most importantly, how the Cardano Community will be able to track its development''\n=> We will present monthly reports for the catalyst community considering our progress and we will make sure to receive constructive feedback from the community to improve our project's quality and based upon which we might adjust our planning.\nIndeed, Every phase of the project described in the Feasibility section will be fully visible to the community on our website https://www.explochain.com/.\n-Additionally, we aim to track the number of students enrolled in our platform and most importantly receive constructive feedback from learners to improve the platform's quality by arranging Zoom meetings to submit feedback and fill out surveys regarding their learning experience as we mentioned which will be the most accurate criterion defining the success of the project as we mentioned in our proposal.\n- As computer science students, we are eager to build opportunities from scratch to encourage the young generation in the MENA region to join the Cardano community. Supporting our initiative will, without a doubt, motivate students from various cultural backgrounds to learn about new technologies in their native language.\n\n\n"}, {"id": 13394, "q0": "The goal of this proposal is to expand Cardano in Arab countries. This region is underrepresented in the reach of technology due to unavailable information in the Arabic language. So they want to expand the Cardano platform that provides the Arabic language.  This challenge is well done because both sides are in the plus and have something from this. Cardano will expand and get new ideas and the new ones will have the opportunity to earn and develop some new technology in their countries.  The only bad possibility is that there will be very little interest from students, because a lot of students are not informed about this Cardano, so they cannot be aware of the possibilities that Cardano provides.", "q0r": 4, "q1": "This plan is quite enough to make this proposal come true. We have a new work plan, financial plan, goals of this project. We have a very good time plan listed.  As for the financial plan, the plan is to spend not a little too much money, the stake will be 5000 dollars. It will be done through online workshops that will be held on Zoom.  In order for this project to be considered successful, their goal is not to exceed the budget, then achieve the purpose of the project, etc. As for this plan, it also has some of its shortcomings, because there is a very high possibility that students will not apply for the project and instead  they all work with countries that are still developing, so the success of this project is not certain.", "q1r": 4, "q2": "For every good project, you should have enough information.  As far as this project is concerned, we have a sufficient number. We have a time plan, a financial plan, contact information about the people who will work on this project. We have been given the risks of the project as well as their solutions. We have given the goals and the monitoring of the progress of the project.  We were also given information about the programs in which this project will be carried out.  So this is a sufficient amount of information so that this project could be realized.", "q2r": 5, "assessor": "z_assessor_3617", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12946, "q0": "The proposal is about to educate students of the MENA region about Block chain technology and Cardano ecosystem . The proposal provides the content related to the blockchain and the Cardano ecosystem in the Arabic , so that it is easy to educate the students. By raising awareness about the new technologies in the Arabic university students we can empower them and we can increase their interest in the modern technologies. More real-time initiatives will be implemented in the Cardano ecosystem as a result.  This approach adds value to the Cardano ecosystem without a doubt. The proposal's main metrics and objectives line up with the described challenge circumstances.", "q0r": 4, "q1": "The roadmap for implementing the proposal has been provided in full by the proposer, along with a timeframe and important milestones. The proposer needs to work on the budget part, The clear  breakdown  of the budget is not provided . The details of the team is not described ,As in the links of their works and the skills needed to implement the proposal is not mentioned properly . The team looks very young and not that experienced . But the goal of educating youth of MENA region is great.", "q1r": 4, "q2": "The proposer have described that how we can measure the progress of the proposal in the description like by Establishing clear deadlines for every task will ensure team members are on track , Setting specific goals and deliverables throughout the project and  Communicating between teammates is key to ensuring the project runs smoothly and everyone completes their tasks on time.\nThe proposer have explained clear understandable description of the targeted problem and the solution to it. The metrices and the KPI's define the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11813, "q0": "Students are the future entrepreneurs and business minds. Many of them might have great ideas and plans that they want to implement but are not able to due to many challenges, of which one of the major ones in proper funding. The proposal when executed properly will give an opportunity to these students and encourage them to participate in future   project catalyst funding. Education is one of the most important , useful and  powerful tool to empower the masses. The block chain technology is relatively a new idea to many. Only 7% of the people are aware about crypto currency of which only 3% are aware about the underlying block chain technology. Spreading awareness about the upcoming technology will not only benefit the masses but as a community we are able to grow into bigger and healthier community, with inputs from the young minds. Especially the students and younger generation will be the most benefited from acquiring the knowledge about this block chain technology and its many uses. It would encourage the innovative young minds to come forward with their ideas and plans and would give them an opportunity to proceed with their projects and overcome many challenges.", "q0r": 5, "q1": "The team is skilled enough to create an online platform for blockchain education. Also they are supported by a German based software development company.  The challenges faced by the team during implementation could be the creation of the online platform and the content itself. With enough support the site development would not be  that big of a challenge. The team has requested $2500 for the same . \nA clear budget breakdown into identifiable items was given by the team.  A weekly roadmap was also provided by the team members. According to the given roadmap the content creation is to be held in the 10th and 11th week. A suggestion would b e to start the creation of the educational content from an earlier stage as we do not want to compromise on the quality of the content since the main purpose of the project is to spread awareness and knowledge about the blockchain technology to the masses. \nThe project is very likely to succeed , the team has indicated the key milestones clearly.\n", "q1r": 4, "q2": "The team has set key milestones and has given a weekly roadmap on how the plan is going to be executed. But I fail to see how he progress is going to be recorded. A suggestion would be to keep a monthly record on what all the team has achieved and how much the plan is in progress. This will also help in taking any crucial decisions or changes along the way. \nKeeping the records will also help in tracking the auditing the progress of the project. Kindly make sure you have described about the records of any kind in the future catalyst proposals and keep one for the current one if the team gets funded. \nWhat the success of the project looks like is clearly mentioned in the description by the tea and I believe the team is skipped enough and has enough support to pull off the plan as prescribed. \n", "q2r": 3, "assessor": "z_assessor_3284", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11372, "q0": "Cardano is a proof of stake blockchain platform founded on peer  reviewed research and developed through evidence based methods. It combines pioneering technologies to provide unparalleled security and sustainability to decentralised applications, systems and societies. With leading team of engineers cardano exists to redistribute power from unaccountable structures to the margins to individuals and be an enabling force for positive progress.To create first educational online platform which provides Arabic content about blockchain and cardano it is further dedicated to motivated students and future entrepreneur. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has provided detailed plan including timeline . The proposer provides evidence of relevant skills and experience needed to implement the proposal. The budget is outlined clearly and broken down into idenfiable items. It is reasonable to achieve the set goals. He offers a realistic timetable to complete the work and provides sensible and conductible plan for implementation that shows not only what is being done but also how. The people working with the project includes programming expert as project manager who promotes the project with skilled instructors.  Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress is tracked by measuring the deadlines for every task which will ensure whether team members are on track and by setting specific goals and deliverables throughout the project. By communicating between teammates will ensure the smooth running of project and helps everyone to complete the task on time . The project has objectives such as maintaining the budget and achieving projects purpose by introducing greatest number of students to programming and blockchain before training them for professional world. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 11231, "q0": "The proposal does effectively addresses the challenge. The target audiences are university students in the MENA region. This is indeed well needed for scouting in the said region as there is not sufficient information in Arabic as not all the university students are proficient in English and there are also many individuals there that are unaware of blockchain technology and in massive need of guidance. This proposal covers all those challenges. ", "q0r": 5, "q1": "The team has Oussama Benmahmoud, a Cardano community member and Plutus Pioneer, as well as his company PeakSoft GmbH, a software development company based in Germany. He is fully supporting the team. In addition, they also have Yosr Benmahmoud, a computer science student, and Manar Bennaceur, a Pre-engineering student at the Faculty of Sciences of Tunis. The team is in good hands (Oussama Benmahmoud) and should have no little difficulty in terms. As for the plan it is detailed and well planned. All stages of the plan are well throughout and they have everything that is needed. ", "q1r": 5, "q2": "The progress of the proposal is audited by establishing clear deadlines for every task will ensure team members are on track, setting specific goals and deliverables throughout the project and communicating between teammates is key to ensuring the project runs smoothly and everyone completes their tasks on time. All these are great ways to measure progress. As for the success, it would be audited by the team for not exceeding the budget, achieving the project purpose by onboarding students, getting constructive feedback and good ratings from website users, and creating a reputable and creditable platform. Overall the success of the process can definitely be audited by said means. ", "q2r": 5, "assessor": "z_assessor_3233", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10477, "q0": "\"    - As we all know, MENA is an area with a high level of economic development in the world and has huge oil and gas resources that contribute to the stability of the global economy. However, the MENA region is underrepresented in the technology sector due to the inability to access information in Arabic and a lack of funds that hinders students from developing innovative business ideas. With the idea of ​​bringing Cardano technology to MENA that the team proposed, I think it is a very good idea.\n\n  - Here the problem raised by the group is clearly defined. The MENA region is underrepresented in the technology sector due to the inability to access information in Arabic and a lack of funds that hinders students from developing innovative business ideas. I find the issue raised to be very relevant to the challenge. In the future, if the idea is scaled up, it will have a strong impact on the Cardano ecosystem, creating the first educational online education platform exclusively for students and businesses.\n\n   - The group solution description section has outlined the solutions that are. Establish a technology-related community, create a safe space for students, and spread blockchain technology to students. I find the solutions proposed by the group are very suitable for the challenge and the solutions that the group offers have specific evidences and studies.\n\n  - Regarding group risks, there are 4 risks presented in detail in the project. However, the group also came up with specific plans to deal with those risks in a reasonable way. I wish your project success.\"", "q0r": 4, "q1": "\"   - In the detailed presentation of the progress of the project. The team has indicated a specific timeline of about 3 months to complete the project. However, I think the team should divide those timelines into specific stages to complete the set tasks. Here I see the team has outlined specific goals. However, the progress of the project should be easily monitored by the community.\n\n   - Through the section providing detailed budget table. With a budget of $5000 and having broken it down into 5 different expenses, I find the splits to be reasonable. However, the team needs to make an estimate in case it needs to supplement the budget when needed.\n\n   - Regarding team members, I see that the group has listed a number of members and each member is assigned a specific job. However, the identities of the members have not been clearly verified. When asked If funded, would you return to Catalyst in a later round for additional funding?. The group answered Definitely yes, I am very satisfied with this answer of yours.\"", "q1r": 4, "q2": "\"   - In the description of the measurement progress, I see that the group has listed 3 specific indicators that are. Set clear deadlines, set specific goals throughout the project, communicate between team members. I find such indicators to be very relevant. However, the index is not easily measured and tested.\n\n  - With the successful description of the project, the team has identified 6 specific successes as presented in the project. I see the success of the project as related to the challenge of the campaign. Since this is a new proposal, it has not been tested and is currently at the concept level.\n\n   - Regarding funding, because this is a new proposal, it has not been funded yet. However, I see this proposal with high transparency, hope this project will be approved and successful soon.\"", "q2r": 4, "assessor": "z_assessor_3188", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 9292, "q0": "\"Blockchain technology is likely to have a huge impact on many industries and companies, potentially having a huge impact on the national economy. Your proposal is therefore essential especially for the under-represented MENA region in the technology sector due to the inability to access information in Arabic and the lack of funds that hinders students from developing new technologies. Creative business idea. By creating the first educational online platform that provides Arabic content on Blockchain and Cardano exclusively for active students and prospective entrepreneurs, MENA telecom operators can become the first pioneer in the field of blockchain, thereby realizing the ambition to become the supporters of the digital ecosystem of the region.\nThe proposed solutions your team came up with to address the challenge you submitted were very specific and detailed. I completely agree with what your group said. Hope this project will have a great influence and develop in the future because this is really necessary.\n\"", "q0r": 5, "q1": "\"Firstly, I realized that the team had an overview plan but needed to be more specific about the short time and expected amount to complete each specific work package.\nSecondly, about the detailed information about the members to complete the project is divided but there is no specific information about the members, only in general and there is no link to provide profiles. It is necessary to select experienced members to hold key positions that will increase the probability of success. The project promises to be implemented well in the future thanks to the members with long experience.\nThirdly, the budget table has listed but not clearly detailed. More detailed review is required.\n\"", "q1r": 4, "q2": "I see that the team has described what to measure to track their project progress however it is not clear to me how the team will measure these in the proposal. The level of success of the proposal is also detailed and specific, but it is necessary to learn from other projects when they come up with specific KPIs. The team should give more examples with links.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13440, "q0": "The proposal aims at creating a platform will educate and introduce Cardano blockchain technology and Catalyst to Arabic students in tertiary institutions, using Arabic. The implementation of this project will establish a community related to modern technology by empowering students to learn modern technologies and improve their potential in technology, using Cardano blockchain. This will in turn get more people informed about Cardano and will bring more people on board.", "q0r": 5, "q1": "The schedule set for executing the project is reasonable and the objectives set out in the proposal can be achieved in the given time frame. The set budget  is also feasible and has been laid out clearly. The team that will implement the project also includes a computer programming expert who will be instrumental to the success of the project.", "q1r": 5, "q2": " Main indicators for assessing the growth and  success of the proposal  are clearly outlined and attainable. The proposal also includes a realistic time frame for completion and a reasonable budget. From this, it can be concluded the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 9099, "q0": "This proposal raises the issue that the MENA area is an area with a large population but inaccessible to information in the field of technology in Arabic. Therefore, this proposal offers a solution to establish the first educational online platform that provides Arabic content on Blockchain and Cardano, which is dedicated to motivated students and future entrepreneurs. They are not keeping up with the huge opportunity presented by Blockchain, especially Cardano due to financial constraints, lack of blockchain knowledge and lack of guidance on where to start when learning blockchain technology. This platform will create a space for students who are passionate about technology and want to gain knowledge about a revolutionary technology that has changed the world, which is blockchain technology. The proposal will also establish a community related to modern technology by introducing Arab students to blockchain, so that they learn modern technology and enhance their potential in technology.\nThe proposal introduces some possible risks such as ensuring a significant number of students sign up for the platform, inability to provide accurate information for beginners, and difficulty in assimilation blockchain concepts that students are unfamiliar with, the lack of interaction between learners and their instructors… They also come up with solutions to reduce it. I find these solutions reasonable.\nThis proposal is in line with the challenge's goal of attracting students to express their ideas, helping students become future engineers, contributing to the development of blockchain technology and Cardano.\n", "q0r": 5, "q1": "The proposal has a clear and specific roadmap, the project is implemented in 3 months, has specific work for each week such as: marketing, research on the provided content, online platform creation, creation of social media accounts for their brand... .…however, the new proposal stops at creating an online platform that is designing websites, developing icons and recruiting lecturers…However, it is unclear how to operate the website after completed, such as server, domain name, website content...\n\nThe project requires a budget of $5,000, which includes expenses like website development, teacher fees, social media, marketing..., not exceeding the challenge's budget limit.\n\nThe project team consists of 2 people who are computer science student and Pre-engineering student at Faculty of sciences of Tunis. They will execute the project with expert's help and supervision, supported by Oussama Benmahmoud, a Cardano community member and Plutus Pioneer, as well as his company PeakSoft GmbH. I believe they will succeed.\n", "q1r": 4, "q2": "The project set goals to achieve such as establishing a reputable and trusted platform, introducing the largest number of students to programming and blockchain before training them to be fully ready for the world. The project also provides measurement criteria, monitoring progress such as setting clear deadlines for all tasks, setting specific goals and delivering them throughout the project. The community can control the project through these goals and these criteria.\t", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 8227, "q0": "The Impact section is well written about the problem to be solved, the information the proposer provides makes the reader feel the need for this project. However, the proposer can add information about the content about Cardano that the team wants to translate into Arabic so voters will have a more comprehensive view of the project. Proposer also pointed out the impact of the project on Cardano if the project is implemented to attract users from MENA. The risks of the project are also pointed out by the proposer along with how to overcome them, which will help reduce the risks for the project.", "q0r": 5, "q1": "The information in the 'detailed roadmap and timeline' section is not really complete. Proposer has given an estimated time for the whole project of 3 months but has not given a time for each specific job, for example, how long the front end will last, or back end activities, etc. The budget section is a bit more detailed, but the proposer can provide additional subtotals for each part of the project. The section about team members is the best part of Feasibility, full of information such as education or work experience.", "q1r": 3, "q2": "Proposer has identified the purpose of the project towards. However, the proposer has not specified his goals, for example, the proposer can specify the number of people that the project wants to reach. Not to mention, the proposer has not clearly established key metrics/KPIs to be able to clearly define the criteria for evaluating the success of the project. Proposer should review and re-evaluate goals to be able to add KPIs or more specific goals.", "q2r": 3, "assessor": "z_assessor_2967", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7701, "q0": "By introducing Arabic students to the fascinating world of blockchain and creating a community for them to learn about current technologies, we can help them realize their full technological potential. Establish a secure environment for children who are fascinated by technology and keen to learn about a ground-breaking innovation that changed the world. Inform pupils about blockchain technology by spreading the word. The goals of the challenge are well-aligned with this idea.", "q0r": 4, "q1": "Based on the team's information provided and the identified relevant experience, I believe the team has the skills and knowledge required to carry out the project. \nI can remark with confidence that the budget is acceptable for achieving the stated goals since I can see that it has been carefully planned and divided into recognizable categories. I like how that's provided. It is a commendable effort to include the risks and obstacles that can exist when the project is being carried out.", "q1r": 5, "q2": "The team's definition of success is highly specific, which gives us lots of data to monitor exceptional auditability In order for us to know what will happen when and to ensure that everything is proceeding as planned, they also go into great detail regarding the phases. This makes it possible for us to continue the monitoring process.", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6963, "q0": "    -  As far as I know, MENA is a phrase that generally refers to two important major regions in the world, the Middle East/Southwest Asia region and North Africa region. it has an underdeveloped economy and the idea of ​​bringing Carano technology to the people of the MENA area is a very good idea. The team that proposes to address these issues is Create the first educational online platform that provides Arabic content on Blockchain and Cardano specifically for active students and future entrepreneurs. I find the problem raised very relevant and this proposal should be further scaled up so that it can be more easily accessed by many countries around the world. In the description of the group solution, many solutions are listed. presented in detail as stated in the project. Besides, the group also stated how the proposed solutions will solve the Challenge. it is Financial Constraints: Lack of Knowledge in the Blockchain Sector: The opportunities offered by blockchain technology are unfounded and we can mention several. and many more challenges. In addition, the group also mentioned the risks that the project may encounter, namely 6 risks. However, the group has not yet identified a solution to limit those risks.", "q0r": 4, "q1": "    -  As for providing a blueprint, including progress and milestones. I see the team has identified a specific milestone that will complete the work in a period of 3 months. I think the above time is reasonable to complete the proposed work. had a clear goal to achieve during that time period. However, the progress of the project is not easily tracked by the community. with a budget portion of $ 5000 and has been broken down into 5 specific phases. I think such distributions are very reasonable. section provides detailed information about the people who will work on the project. The group has raised about 3 members and has assigned specific tasks to each member, but the identities of the members have not been verified. There are no attached documents and links for the community to verify.", "q1r": 4, "q2": "   -  When asked If funded, would you return to Catalyst in a later round for additional funding? The topic of the project has shown a very ready attitude for further promotion. I appreciate that. In the presentation on measuring and tracking progress of the group project, 3 goals were listed, but in my opinion, the 3 goals raised by the group are quite general. Regarding the presentation of the project's success, I see the group has mentioned 4 successes that have had certain results and successes if the project is carried out, but the project is still only a model, not a test run. experience. Since this is a new project that has not yet been funded, I hope the project will have many good results.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"id": 6090, "q0": "MENA is a municipality in the state of Puebla, Mexico, the MENA region is underrepresented in the technology sector, due to inaccessibility to information in Arabic and a lack of funds preventing students from developing business ideas. . To solve the problem, the idea team created an Arabic online educational platform about Blockchain and Cardano. Propose specific description and offer many solutions: financial constraints; Lack of knowledge in the field of Blockchan; Lack of guidance on where to start when learning Blockchain technology. The solutions are laid out and explained in great detail. Besides, the proponent of the challenges that need to be met here is very active. Show that they have the ability to recognize the disadvantages they may face in the project. Along with those challenges, the proponents outlined solutions that show their preparedness. Minimize risk when the proposal is implemented. Proposed impact on the challenge posed.", "q0r": 5, "q1": "Regarding the roadmap, the proponent cites the goals to be achieved in three months. and each month is analyzed by the proponent into 4 weeks and the tasks to be done in the week and month. About the route in my opinion is good, clear. Next is the budget. The proposal requires a $5,000 budget. 5% of the total challenge budget, is a reasonable range of requirements. However, more detail can be added, the budget allocation table for each task needs to be allocated and explained more clearly. Example: Content translation: how much of the translated content will be translated (months), who will undertake the translation, their abilities and experience, how long they have worked on the project. Edit video; how many videos will be made (months), which experts will edit ...; payments to teachers. How many teachers will be involved in teaching, each person's salary, how much time they will spend on teaching (weeks) ... We know how the funding will be allocated, however, details can still be improved. A transparent budget will increase the sustainability and credibility of the project. Finally about the team. They introduced the team members: Yosr Benmahmoud is a computer science student; Manar Bennaceur is a pre-med student and Oussama Benmahmoud is a member of the Cardano community. We know their identities and skills. The proponent also provided the university's gmail so we could contact them. From the plan table shows the feasibility of the proposal is fine, there is some budget information that can be detailed.", "q1r": 4, "q2": "In my opinion, the auditability of the proposal is not ideal. The proponent provides metrics to track progress and how the project will be measured. However, from what is provided, we are vague about how we check and measure the progress of the project. It will be difficult to determine the progress and success of the project here. The information provided is not sufficient for us to perform an accurate audit. The project plan is fine, however, the budget needs to be more detailed, transparent and easy to audit. The information provided is limited, it is difficult for us to audit accurately and securely.", "q2r": 3, "assessor": "z_assessor_2786", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 5743, "q0": "This proposal is prepared by university students that will collect and arrange cryptocurrency and cardano initiation workshops. \nThe proposal is a local endeavor that will focus on the MENA region more specifically Tunis (North Africa) by offering multiple workshops that help address the challenges faced by the younger population about to enter the workforce. \nChallenges that are specific to MENA region such as Arabic language translation, transfer of funds and even availability of potential work (for programmers) can be expanded on and shown the tools for the new users to adopt and implement. \nCardano is an ecosystem that needs new ideas and creative minds that work on solving global problems. And address as well the language barriers. As simple as this proposal seems the idea can be scaled to a global impact where the material presented be visible to a larger group. Specifically if they identify and solve problems that the MENA regions might be facing that is different than other regions (banking difficulties, opportunities etc…).  ", "q0r": 5, "q1": "The proposer is composed of 4 team members that are attributed specific roles for organizing the project. They seem well organized with a defined outcome goal that matches the challenge reported. \nThe budget is ideal and fits well within the scope which is mainly setting up the learning platform website and programming. Then followed with a small portion for the translation and workshop planning. \nThe timeline is not well defined and the target audience is potentially not interested in onboarding into cryptocurrency based on the feedback written for this proposal. \nThe challenging part that the team will need to prove in order to succeed is to make the cardano ecosystem relevant to everyday problems that the young target audience is occupied with (daily struggles and future opportunities). \nIt will need a creative mind to think of new tools or utility for ADA to create a market there for the workshops. ", "q1r": 3, "q2": "The challenge to prepare the workshops and material would be easily audited and proven to be accomplished. I do however request that the publishing of the material be visible to everyone. As part of their proposal a large percentage of the fund will be allocated to server and website costs that will allow such public domain contribution. \nFinally I wish this access can be easily located and promoted on other platforms to increase the visibility of the work they complete. ", "q2r": 3, "assessor": "z_assessor_2745", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5657, "q0": "The project is a unique strategy to introduce more people from the MENA region into the blockchain ecosystem. This is definitely an approach to help penetrate new regions and audience with the cardano project. The end result of this project, as indicated is to help introduce a greater number of students from the region into programming and blockchain before training them to be fully ready for the professional world. In my opinion, this project could become an entry point into the cardano ecosystem for individuals in the MENA region, upon its successful execution. My overall observation here is the potential to onboard more student into the cardano ecosystem via this initiative. The value preposition as suggested here provides a clear highlight of how the project seeks to advance the growth of the cardano ecosystem. However, there is no clear description of how the website will be designed (whether or not there would be an assessment at the lend of each learning course), the nature of the content of the website and accessibility to the site.I will recommend the team provide a detailed information on the website, its content and accessibility to the platform. I will also suggest the team also provide an incentive package for completing the learning process because students are generally motivated by incentivized learning system. This will keep them glued to the platform. Again, my final concern here is , will internet accessibility be a problem? if yes, how will the team address it? if no, i suggest the team clarify that.", "q0r": 4, "q1": "Starting with the roadmap, we know which activities would be necessary for the development of the project, but these activities are not explained in details. The team intend to use three months for all activities under the project without providing a clear plan of the what each activity entails. This makes it difficult to determine what will take place at which time within the 3 months. Will the various activities be executed sequentially as outlined, concurrently or randomly? Again, what is the specific role of each team member in executing the project? Though the project has detailed the profile of the team members, i consider the links to the team's profile a plus to the transparency and credibility of the team. Ultimately, the links confirm the competence of the team, therefore i suggest the team. Aside that, i prefer the the team include a more detailed budget allocation for each identifiable item on the budget list. In my view, I wish items like team fee and  miscellaneous are included in the budget to cover any possible uncertainty.\n\n", "q1r": 4, "q2": "On the audibility side of the project, the project has highlighted what information would be required for the metric of the project. However, the information is inadequate. For instance, the project cites 3 main KPIs such as, “we  intend to set specific goals and deliverables throughout the project, establish a clear deadlines for every task and enhance  communication to ensure project run smoothly”; however, these KPIs are vague and does not provide a clear projections to help to monitor the success of the project. In my opinion, considering the first KPI (we intend to set specific goals and deliverables throughout the project), the proposer should consider outlining deliverables such as, the expected number of people to participate in the online training (at least 10), the expected number of people that complete the course (at least 5) and the expected number of people to visit the online platform (at least 20). Additionally, there is no channels to easily access data on the progress and success of the project. I suggest the team provides a clear indication of how the team intend to ensure that information on the progress of the project is made available to the community. Whether on their website, via their social channels or through the various catalyst channels, the team should include it in the project to ease data accessibility.", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4772, "q0": "\nThe team in the proposal addresses the problem with the MENA region that is under-represented in the domain of technology due to inaccessibility of information in Arabic and the fund shortage which hinders students from developing innovative business ideas and the team offers a solution in the form of creating the first educational online platform that provides Arabic content about Blockchain and Cardano. I would like the team has worked out KPIs through which it could be concluded whether the proposal is able to scale to address future challenges and how can community track the project. \n", "q0r": 4, "q1": "The team consists of two members who transparently presented themselves via LinkedIn and we can clearly see that the team has all the necessary skills, experience, expertise and knowledge for the realization of this project. The budget was presented and is within normal limits, and a budget breakdown was made, but I would like to see how many working hours the team needs to implement the items listed in the work plan. A detailed work plan with realistic time frames is excellently worked out, but it would be good if we had an insight into which of the team members will do what! The team lists 4 possible challenges that are recognized during the implementation of this project, and adequate solutions are offered and developed.", "q1r": 4, "q2": "It would be good if the team communicated when they are starting with work for example the month of September and when they plan to finish the work. The team stated the time frame by weeks of what they will do, but the KPIs that need to be worked out are missing so that the community can monitor the development and success of this project.", "q2r": 3, "assessor": "z_assessor_2616", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2394, "q0": "When analyzing the objective of the project, we have that it aims to reach students in a region in which, in fact, blockchain technology is not yet very widespread. With this, we have that the proposal is aligned with the objectives of the challenge in which it finds itself. In addition, projects with this bias have the possibility of achieving great exposure by having university students involved, which facilitates word-of-mouth advertising. In this way, this proposal, if well executed, has good possibilities of causing a positive impact both on the students of the project and on Cardano's ecosystem. Additionally, we note that the budget being requested is in line with the limit established by the challenge. When analyzing the website available, we also see that, in addition to content in Arabic, content in French will also be made available.", "q0r": 5, "q1": "When we look at a project that aims to develop an educational platform, it is interesting to find some factors that help to differentiate it, since there are many similar ones. And in this case, we really managed to find these differentiating factors, one of them being the website developed. We have that this is well structured, in addition to clearly conveying the purpose of the project. In addition, the team involved made available means for us to better know their background, both through the website and through the links to their CVs. We noticed that the experience of the people involved is very much in line with this stage of the proposal, it is also interesting to note that there will be professional follow-up from other people with more experience. About the activities described in the timeline, we see that they make sense and address several aspects for the structuring of the platform, we are just afraid that maybe 3 months is not enough time for its completion. It also seems interesting that the steps described in this timeline could have their durations more specified. In terms of budget detail, we see that the capital allocations seem consistent and it is interesting to see a portion of the total amount being allocated to marketing. As the main objective of the project is teaching, it would be nice if the amount being allocated to instructors was better broken down, to understand, for example, what will be the amount paid per hour and how many instructors the project aims to have in this initial phase.", "q1r": 4, "q2": "Regarding the aforementioned ways to monitor the progress of the proposal, we have that they make sense and are good practices for controlling the progress of the project. However, in a complementary way, it would be interesting if some parameters had been established to make these concepts a little more tangible. For example, the importance of establishing clear deadlines for the completion of each task was mentioned, but some tool (such as JIRA) could have been mentioned in addition to monitoring the completion of these tasks or estimated average time for the backend to be completed. The described success scenario makes a lot of sense and is consistent with everything that has been worked on. As an additional note, it would also be remarkable if some targets were set such as a certain number of students participating in the project, or an average rating to be achieved (in relation to the website). Thus, it would be easier to evaluate the success or not of this project.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 8831, "q0": "As we there are lot of countries around the world where people are not aware of cardano development project , this is severely affecting the students ,where students are denied of features like funding of their of project and not understanding the importance of blockchain in the future, To overcome such scenario the proposer wants to develop some videos where people of region Middle East and North Africa can understand the basics of project catalyst in their native language of Arabic , this will provide boost for the members to involve in catalyst program, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan presented doesn't involve much of a risk where making educational videos and uploading on a website can be easily achieved, as most of them are students here who are working on the project ,who doesn't have any experience of teaching this will be surely a backlash to the project, the proposer hasn't mentioned how he is going to market the videos where maximum number of people can attend the website regularly, Hence with minimum risk involved and with large audience available to occupy by using Arabic, with less experience provided and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit doesn't contain any marketing strategies so that uploaded videos can reach out to maximum number of people, the audit should have provided any unique methods that will be used in the project (ex:using animations or doing experiments) so that they can keep the audience engaged with regularly.\nExcluding above points the idea to provide to provide blockchain related data in native language is a great initiative,  with provided detailed budget breaking idea and detailed timeline structure to make the project successful , Hence with minimum risk involved , The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 14819, "q0": "A show of approval for a decent, stylish, and totally aligned project with Challenge's Key Metrics. At present, other than Biology, subjects connected with Technology are progressively well known among youngsters, particularly university pupils who need to create or seek after their future mechanical dreams. The send-off of an undertaking that advances the soul of learning and works with understudies in the Mena region to get blockchain information, is destined to hold importance with youngsters. I likewise especially value the creator's dedication to top to bottom exploration by giving explicit numbers connected with the present status of the Middle East and North Africa, to increment reality and persuade for the very purpose of the project. Particularly, while moving toward nations with well-established and ecclesiastical societies, utilizing Arabic rather than English is a savvy and shrewd decision. This not just makes it simpler for college understudies to get information, yet additionally sets out freedom for the project to definitely stand out and get support from the media and the public authority. Moreover, the proposer additionally accentuated that assembling committed understudies from everywhere in the MENA locale endeavor to succeed in programming, particularly constructing DApps on the Cardano blockchain. Drawing in skilled individuals to work for Cardano will clearly be productive in numerous ways for the ecosystem. Besides, the strategies and difficulties anticipated by the staff are likewise totally sensible and guarantee to restrict superfluous dangers while the proposition is carried out. By and large, I am totally satisfied with what the proposer presented in this part.", "q0r": 5, "q1": "The labor force is seem to be completely ready or certain about their arrangements and items since as per the proposer, the project will be finished in 90 days. With only two stages, the timetables have not yet been concretized and are still fairly obscure. Concerning staff, rather than simply working with experts with numerous long stretches of mastery, the project incorporates working with understudies. This will without a doubt draw in the undertaking's ideal interest group since students will actually want to cooperate with each other to find and connect all the more promptly. Notwithstanding, with the rest of the others in the group, the proposer ought to offer subtleties on their skill and achievements or just refer to their LinkedIn profile. Furthermore, I see that the proposer as of now has a number of propositions on Cardano, however, the quantity of staff still just stops at 4. In the event that all tasks are endorsed by the gathering, 4 workers working for a time of 90 days doesn't seem sufficient. So my recommendation is to contemplate getting more assistance", "q1r": 3, "q2": "The unmistakable presence of the venture's prosperity models exhibits that the proposition's group invested a lot of energy in examining and exploring. Achievements and results are cautiously and thoroughly executed, and very lined up with the venture's technique. Be that as it may, it would be better in the event that the measurements used to follow the progress of their activities were more straightforward and detailed. For instance, the author examines the timeline for every objective, except without a particular sum or period to effectively follow and assess. Or on the other hand, perhaps giving the number of understudies the task means to prepare. The absence of characterizing subtlety makes it difficult to survey the achievement of task goals suitably.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "To create the first educational online platform that provides Arabic content about Blockchain and Cardano, which is further dedicated to motivated students and future entrepreneurs.", "experience": "A computer science student at the Faculty of Sciences of Tunis. The university is ultimately a prestigious and competitive faculty. I have also been an active member of student associations, such as the IEEE computer science chapter and the Free Software Club."}