{"id": 415053, "author": "rffx", "title": "Onboard Tanzania Universities", "url": "https://cardano.ideascale.com/a/dtd/415053-48088", "category": 26599, "amount": 4900, "description": "How to empower students to other opportunities prior to their educational impediments purpose of improving their soft skills after completion of their studies.", "f6_no_assessments": 18, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1630, "q0": "The idea itself is very good and is in line with the objectives of the challenge, but how it will be put into practice is a bit abstract. In the theoretical field, the proposal seeks to improve the accessibility of university students, in Tanzania, to the various features of blockchain technology (specifically with Cardano). The main objective is to make these students understand what Cadarno/Catalyst is and enjoy all the opportunities that our ecosystem offers. Proponents argue why it is interesting to develop the project in Tanzania: the place does not have good accessibility regarding the topics covered, I believe mainly because of the language barrier. It is positive that they have already started the work by translating about 10 thousand words, to serve this community, as they themselves declare. It is also very valid that they have (or maintain a partnership, this is not so clear) with a company that already carries out business consulting in the country, already having a physical headquarters and so on. In other words, we would not be starting from scratch when funding this proposal, as the proposers already have a good performance and influence with the local community in Tanzania. What I think could have been better defined would be how they would approach these students: it is said that visits to universities, in-person and online workshops would take place, and that topics such as the blockchain system (including smart contracts, DAOs, NFTs ); what are cryptocurrencies; how Cardano's sustainable infrastructure works (Proof of Stake) and so on. But it would be more valid if we had an action schedule that told us, for example, how many online workshops would take place, how often, how students would be encouraged to participate… Which universities would be the focus of the campaign, with what strategies students would be approached, in way they will be coerced to participate in the community (either through Catalyst or directly participating in hubs or projects, for example)… Anyway, in my view, how these ideas would be put into practice was a little absent, however much the proponents detail the what would be addressed and how (face-to-face or online, for example) things would be done, some organizational and temporal details would be welcome, as well as a greater understanding of which universities would be approached and which students (perhaps those who were already more close to forming). It is positive that the authors mention which challenges can be faced in the development of the project (costs associated with computers, educational difficulties and other associated costs) and already seek solutions to mitigate such aspects. Therefore, I conclude that the idea is very much in line with the goal of involving and encouraging students to participate in our community and our projects, but as I pointed out, some more information would be needed.", "q0r": 4, "q1": "The proposal's script is satisfactory, only that two things are not adequate, in my view: both the level of detail of the activities and the fact that the workshops with the students would only take place during 1 week. Regarding temporality, the total would last 4 months, and the time is divided into weeks, which gives us a great understanding of what would happen and when. Regarding each of the activities, I believe they could have been reported in more detail, with more explanations attached. How would the team be selected, in fact, what would be the positions to be occupied to carry out the project? How many people would have to be added, in addition to those who were presented in the proposal? How would the workshop be marketed? It would be important to approach a simple and attractive way of publicizing the project, so that even university students who are not in the technology area and who have never heard of blockchain before are interested in participating in the project. How would the workshops be held? As I commented on impact, some very important information should have been mentioned here, such as 1) number of workshops 2) type of workshops 3) who would present the contents 4) how many students are expected per workshop, a list should also have been provided clear which subjects would be covered in each workshop, or if, for example, in each workshop an overview would be made about Cardano, mentioning from introductory topics to more advanced subjects (a suggestion would be the following: half of the workshop could be destined for all audiences where a more general aspect of blockchain could be explored, and the rest of the time could be devoted to technology students, covering more specific and technical subjects. very clear, but more detail could also be provided for some parts, and some expenses are a bit confusing, in my vision. For example, in the part of the shirts. It is not very clear if it would be 4 shirts costing 150 dollars each, or 150 shirts costing 4 dollars. Would they be used by the “teachers” of the workshops? Where would advertising materials such as pins, stickers and posters be spread out? Probably in the 3 selected universities, but it would be good if this was clarified as well. How many materials is it intended to manufacture? What exactly is catering expenses all about? This term is not known to all readers of the proposal, probably, I had to research to understand what it would be (food service). Would it then be 200 dollars for each face-to-face meeting? It is also not so clear the hourly price of the professionals involved, since we do not know exactly how many there would be, and the payment would be 1000 dollars for 6 hours of work (of an X number of professionals). Finally, about the team, it's a partnership with a company, a lot of trust is conveyed, since they are well involved with Cardano and provide several means for us to contact them directly.", "q1r": 4, "q2": "Project auditability is good, although not perfect. As a tracking of progress, we have several KPIs, such as “The prevalence of positive feedback from workshop participants (measured in the post-workshop survey) / Level at which workshop participants observe that their knowledge of blockchain has improved (measured in the survey post-workshop) / Views, comments and shares from the LinkedIn blog series / Future views and citations of the peer-reviewed article”. Regarding the last two metrics mentioned, the city of Vienna is mentioned, I don't know if it was a mistake, but probably yes; this information causes some confusion. In general, the information provided is valid for us to understand the partial results achieved, but it would also be necessary, for us to have a complete auditability of this part of the proposal, for us to know how the work behind these advances was being developed. Are the workshops being properly designed and made available? Is the disclosure process being done with the promised consistency? How are students being counted? Would the team be working in their respective roles at the respective time it was planned? Finally, analyzing success, we know that it would be considered when the students involved in the project solidly understand what blockchain is, what are the characteristics and differentials of Cardano, and especially how to get involved in projects relevant to our community, mitigating local and global (as the bidders describe). I believe that these are really the final metrics to be analyzed, what is lacking here is to understand how this scenario would be researched, understood and proven through tangible data. Would a survey be carried out after each workshop, in order to understand the performance of students, how many and which ones would be seeking to insert themselves, in practice, in the Cardano community? And we also understand what roles they would be seeking to play, how their efforts would be rewarded and how they would be contributing to the better establishment of our blockchain in the country in question, and so on. It would then be necessary to carry out this study, analyzing quantitative aspects (for example: number of students who became active members of the community and number of digital portfolios created from the project); and qualitative (where these students would be inserting themselves, what consequences their activities would be generating for Cardano). All these studies and research would need to be made available to the Cardano community in a simple way (for example, through the project's website or discord). That said, the way the proponents suggest so that we can audit the project is good, needing only minor improvements.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 10, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 13429, "q0": "This proposal is more aligned to be submitted under “Grow Africa, Grow Cardano” as that challenge encourage solutions for Africa in terms of education and infrastructure.\n\nWhile your proposal will help onboard students on the platform (Catalyst) by conducting workshops to multiple universities, it doesn’t directly conform with the challenge goal itself. This challenge is specifically to have students themselves submit proposals and start their entrepreneurial journey. By doing so, it gives them exposure to numerous resources/talents such as engineers. \n\nThis would have been appropriate to this challenge if main goal is to specifically guide and have your participants(students) submit proposal under this challenge and measure PA scores and funding rate percentage. \n\nAs for the risks involved in delivering the project it would have been better if a concrete solution were presented rather than having a vague approach. For instance, under “Expensive computer utilization” - keep in mind that Catalyst has a global audience meaning not everyone may have the same predicament. It would make sense to provide numbers as to why is this a risk. I would start by providing availability rate of computers in average per university or at least for each workshop venue? And can this be mitigated by simply having one laptop for the presenter or worst-case use paper visual aids in absence of PC/Projectors? For clarity “risk question” under impact is limited to the “delivery of your project by itself” not the entire adoption of blockchain/crypto.\n", "q0r": 2, "q1": "One implementor have 4 years of experience as a Trainer and mentor, this is a good indication that he has what it takes to deliver their material effectively in a classroom and workshop setup.  Regina on the other hand have extensive exposure in the financial world. This is a good combination although it would be nice if they have someone on the technical side of the blockchain as well. I would imagine that some students would be interested on the financial and business aspects of Cardano and Blockchain while some will be heavily invested in the technology itself. Someone with proper knowledge needs to address those. \n\nThe lack of sample educational materials included in the proposal doesn’t help gain my confidence for the quality of the proposed workshop program. I understand they have listed what’s to be expected but it would help if they have provided an itemized subjects with detail on what will be part of the workshop program so the community can pitch in on what Cardano initiatives or technologies needs to be highlighted. \n\nBudget wise it’s not clear to me what “Workshop for an innovative forum” means. I don’t see any mention on how much will be paid for the presenters hourly? I would highly appreciate if a proper timeline was also provided for these workshops, this not only helps us gauge the budget but also the length of the material for each seminar. \n\nBased on what’s provided in the proposal here’s my additional feasibility recommendations: \n\n•\tIndicate length of each workshop (is this a one day 8-hour session, 2 days, etc..)\n•\tWill these workshops happen simultaneously or different schedules?\n•\tHow would you solicit participations?\n•\tSalary for those who will conduct the workshop (Hourly?, How many?)\n•\tProvide breakdown of Pre-workshop expenses. (Marketing, teaching materials)\n•\tAre seminar, workshops and meetups the same? If not provide expense breakdown of each activity and details on each execution", "q1r": 3, "q2": "At the end of the day success is the prime indicator if a project is worth funding or not. So, it only makes sense that we spend same amount of time if not more in its’ Auditability.\n\nProposer is right to conduct a post workshop survey for satisfaction. This helps validates if material and presentation are well received by the audience. Having negative or what we call detractor responses will shed light on what’s not working. Though there’s no mention of survey results being available to the public? A common repository of updates is necessary for us to track progress not only during completion but while it’s still ongoing. This can be thru twitter or any other public platform.\n\nIt was mentioned that “Views & future citations of peer-reviewed article” as a key metric however I haven’t seen any mention of this all throughout the proposal. This is a good metric for IOHK as they produce peer-reviewed papers but not for this project. \n \nAlso, I need clarity on why we’re measuring VIENNA catalyst participants or VIENNA Blockchain Community discord server? Under the impression that target community is in Tanzania? If “Vienna” refers to something else under than the city then I highly recommend to prime your audience in advance so to avoid confusion. \n\nThe key to having good measures is to align it to your GOALS and make them as objective as possible. Also establish “researched” baselines this way you can compare and gauge if your doing “good” or not yet.\n\nHaving that said, I highly appreciate you taking time to share your ideas with us. Hoping that you take my insights in consideration on the next iteration of this project.\n", "q2r": 1, "assessor": "z_assessor_3644", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 13366, "q0": "- Training and raising awareness of Students about Cardano ecosystem is important in this challenge, Your solutions in terms of awareness raising, education, clarification about cryptocurrency, ecosystem Cardano blockchain and related academic papers are possible, although there is really nothing outstanding about your proposal, but I still support your proposal with other proposals in this Catalyst program...\n- Finally, I hope that if you sponsor this proposal, I hope you can contribute more by passing on more knowledge about the Cardano ecosystem that our Cardano community is aiming for.", "q0r": 4, "q1": "- The plan of the proposal presented by you is quite detailed with 12 working weeks and has specific content for each week, I think it is quite good with this action of yours.\n- But if funded, each of these weeks should be specific, which turns out to be better and gives a better view of the overall plan of the project.\n- The budget table is also broken down by you for each specific item, you do quite well and clearly, the budget is also suitable for the proposed limit (under $5000).", "q1r": 5, "q2": "- The information provided from the group of friends such as: positive response rate from workshop participants, views, comments and shares, number of Catalyst participants and number of new members is enough to evaluate Rate the progress and success of this proposal in this challenge.\n- With the youth and talent of the students, which will contribute to research and development to expand the Cardano ecosystem further, your project has a high probability of success.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 12713, "q0": "The stated problem and solutions directly address the Challenge Topic of \"Challenge & Scouted for Students\" as the Team aims to raise students' awareness and teach them how to benefit from the Cardano Ecosystem.\nI find both the problem and solutions are not well-presented. The Team's problem statement does not address a problem but proposes an activity on \"how to empower students\".\nIn addition, the problem and solutions are not related to each other. While the stated problem is to improve students' soft skills for future employment, the proposed solution is to onboard students to Cardano Eco-system via awareness campaigns.\nIt is difficult for the audience to conveniently keep track of the activities proposed in this Proposal. The number of activities, the type of activities, and the costs of each activity are not well-presented. The Team should explain this important information in a clearly written and well-formatted manner with bullet points and numbering.\nThe proposed solution encompasses physical workshops and the publishing of research papers and costs a total of USD 4,900. However, the project number of students reached is only 150, which is a modest number. Due to the high cost of this Proposal, the possible benefits brought about by this Project might not justify its costs.\nAs the Team is bounded by the physicality of their proposed solution, it is hard to scale up the proposed activities outside of Tanzania. The team should make efforts to find a more well-thought-out solution to promote the Cardano Ecosystem amongst Tanzanian students such as building a platform or online community. With a full-stack developer and a trainer on the Team, I believe that they will be able to reach more students at lower costs and with higher effectiveness.\nFor the above reasons, I give the Team a 2/5 score for Impact.", "q0r": 2, "q1": "The Team consists of only 2 persons: a full stack developer and a trainer with an Account and Finance background, both have actively contributed to the Catalyst Communities. While they have successfully included relevant LinkedIn accounts for verification, the company account is mostly empty with no information that might be useful for PA's assessment.\nThe probability of success for this Project might be higher if the Team can recruit more capable people to take part in the proposed activities.\nThe budget is haphazardly provided, and there are questionable items such as \"Cardano T-shirts\" and \"appreciation and participation certificates\". How many T-shirts are bought with the budgeted item of USD 600? Also, it is not clear who or what the budgeted items will be spent on. \"Workshop for an innovative forum\" at USD 1,000. What will this USD 1,000 be spent on? Will it be to pay speakers or facilitators or both?\n\nThe timeline is blurring with Workshops, Seminars, and Meetups happing at different time durations and frequencies. While there are Seminars and Meetups mentioned in the Budget, no Seminars and Meetups are mentioned in the proposed timeline. The mentioned Main Risks focus on how \"Blockchain is still an immature technology\", which is completely irrelevant to the solution proposed by the Team. The Team's lack of research on Risks and mitigation methods, as a result, make execution risks very high for this Project.\n\n\n\nDue to the Team's ambiguous presentation of the problem, their unclear actionable activities, the unformatted budget items, and the lack of research on risks, I give them a 1/5 score for Feasibility.", "q1r": 1, "q2": "The Team's solutions are neither specific nor do not directly address the stated problem.\nAs I have mentioned in Part Feasibility, this Team does not have an action Timeline that is consistent with their Budget items.\nTheir Budget items are not self-explanatory with items listed in slum sums.\nIn addition, their action timeline is dubious with durations listed in weeks, not days. It lacks basic items such as persons in charge, locations, and ways to promote the activities.\nThere are no KPI items, and no quantitative or qualitative indicators for PAs to judge if the Project is doable or impossible. The Team needs to provide explaining information such as the number of people attending the workshop, or new users joining Cardano Eco-system and Community.\n\nWhile the proposed fund is substantial at USD 4,900, the Team has not provided information on a reporting system or potential auditors to be hired on the Project. Cardano Community needs those information to have a better judgment of the Auditiability of the Project.\n\nThe Team's profile, to me, is the most clearly presented item within this Proposal. However, they have not been successful in putting together a convincing proposal to submit to Cardano Community.\n\nFor all the above-mentioned reasons, I give the Team a 1/5 score on Auditability. They should have put much more effort into their Project to make it believable to the Cardano Community.", "q2r": 1, "assessor": "z_assessor_3470", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12269, "q0": "As an already existing business consultancy organization, and a funded proposer, the team presents a strong foundation and a trust both from their country and on the cardano community. The proposers plan to first teach soft skills and involve a myriad of ideas will allow for diversity and take out risks of lack of expertise in any field the students might be involved in. Aditionally, proposal presents a detailed structuring of the steps that must be fulfilled for the development of their idea, also indicating what must be invested in marketing, which is one of the most important aspects for the success.", "q0r": 4, "q1": "The team’s experience in relation to the operation of Cardano and knowledge of blockchain technology is pointed out which essential for the aim of the project. One thing to be noted that it is not clear whether the people who worked on the development of the idea will also be responsible for its implementation since they plan on recruiting as per their first week’s plan. Does the team intend recruiting free lancers of a permanent team? ", "q1r": 3, "q2": "The use of survey to test the students’ level of understanding is a well thought out plan. I believe that as rightly indicated by the proposer, if students are able to produce innovative ideas of how blockchain can be used to address major local and global challenges facing them, they are more likely to be successful with their actual proposals on the cardano ecosystem; which is the aim of this project.\nI suggest that the proposer sets a clear target of students that they hope to join the ecosystem so as to be able to assess their own performance, Since the proposal has plans for future funding, it should have a system where successful participants who receive funding on their projects as a result of their mentorship will be there to encourage new people the need take their lessons seriously.", "q2r": 4, "assessor": "z_assessor_3378", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11378, "q0": "Project catalyst is a series of experiments which seeks to generate the highest levels of community innovation. Catalyst is bringing onchain governance to cardano blockchain by allowing the community to self determine priorities for growth. It also let's participants deploy funding to proposals which tackle the challenges and capitalise on opportunities that arise in the life cycle of Cardano. Students of the universities are aimed by Onboard Tanzania University towards achieving soft skills before employment,  financial support and capital sources. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal has provided detailed plan includes workshop development marketing and conducting with University students, team gathering and recruitment, circulating paper through faculty members and workshop participants and collecting feedback to refine workshop. Also includes publishing paper and posts. The budget is brokendown clearly and is reasonably achievable. The people working with the project has good experience in this field which is very impressive. Given experiences and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The project progress is measured by prevelence of positive feedback from workshop participants, knowing the level to which workshop participants note blockchain knowledge,  number of new Vienna project catalyst participants and Vienna blockchain community discord server. As the workshop participants produce innovative ideas about blockchain use in addressing majore local and global challenges faced by students once they graduate and being able to join cardano ecosystem by some of the students. This information provided is sufficient to audit the progress and success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 9823, "q0": "The concept of this proposal looks very confusing. The problem statement and the proposed solution seem not to be in agreement with the aim of this challenge; which is to expose student entrepreneurs to the catalyst community where they easily source funds and also link up with engineers to see to the fruition of their ideas/projects. \nThere is no doubt about the expertise and qualification of the team since they are already members of the catalyst community, and also previously funded, however, this proposal seems to derail from the goal of the challenge. The proposal seems to center on preparing university students towards achieving soft skills prior to employment. The team fails to connect how this solution solves any of the metrics of this challenge.\n Although this project will aid in exposing students to Cardano and project catalyst, which could provide a source of financial freedom to them, it still falls short of the goal of the challenge.", "q0r": 3, "q1": "This project will definitely expose students to the ecosystem, solving one of the issues of Cardano in general. The team does well to provide a very structured plan with specific timelines. The team also provides a decent budget with feasible amounts. The total requested budget is 4900 USD, and this is split into detailed categories. There is also no doubt about the capabilities of the team, they are known to the community and have been previously funded, therefore the implementation of this project wouldn't be a problem. The proposer also includes their social handles such as their LinkedIn accounts, details on the team members is very concise and this confers a lot of confidence in the team.\n However, from the plan provided, the organization of workshops will be the main tool to expose these students to Cardano, but not enough information is presented on it. This raises doubt about how these events will happen.", "q1r": 2, "q2": "The metrics chosen to be used to measure the success of this project are carefully chosen, easy to understand, and auditable. The proposer could do well to provide more information on the plan, and the strategies to be used to accomplish them.\nDetails of the budget are adequate, each item is quite explained for easy understanding, which makes it easy to audit", "q2r": 3, "assessor": "z_assessor_3106", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9648, "q0": "The problem statement describes an issue with the preparation of students for the job market and the project aims to on-board Tanzanian university students to the Cardano ecosystem and increase their visibility to engineers and other professionals. The problem lies within the domain of the challenge and the solution is in line with the objectives of the challenge. The proposed project although it is targeted towards university students does not have any students as team members and may defeat the purpose of the challenge to bring proposals of students to the forefront. The project, if implemented, will enrich the Cardano ecosystem with skilled and knowledgeable people who will take on more projects.", "q0r": 3, "q1": "The proposal indicates that the project will take place over a period of 12 weeks with some activities taking up to 2 weeks. I believe this is sufficient time to undertake the project. Two people with backgrounds in app development and finance respectively are responsible for the project. Their expertise is further described in their \nLinkedIn profiles. This is evidence, that the project will be handled by people with the right expertise in the field. Unfortunately, the budget doesn't  break down the various components well enough for it to be understood. For instance, the explanation for allocating 1000 USD for workshop for an innovative forum  is not clear.        ", "q1r": 4, "q2": "The proposers have included strong metrics with which to measure progress. For instance, number of new Vienna based participants as an indicator will perfectly show that the workshops were indeed able to accomplish its purpose and can also help to quantify the success of the project. The more the participants, the more the project is deemed successful.", "q2r": 5, "assessor": "z_assessor_3078", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8843, "q0": "Students now a days lack soft skills and this is the reason most of the students fail interviews ,hence to provide workshop to students and making them understand catalyst project is a great task, where they can involve in future catalyst funding and bring out their own project.\nThe proposal even says about publishing paper regarding internship ideas developed is also great idea  hence this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "Setting up workshop or internship schemes in college will be never be a difficult task , the important task here is just to keep the students engaged with workshops where they shouldn't loose interest while on going internship.\nPublishing paper will never be challenging task ,just the proposer's should make sure that papers written should be unique and interesting way, since the team has been working in catalyst programs and have good team business development hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit contains proper budget breaking and has delivered detailed timeline of each week , the team has also provided proper key indicators as taking review once workshop is completed ,that will be used to measure the success rate of the project.\nThe proposal has also introduced to a team with whom he'll be working with and has displayed their expertise field, since the proposal team still wants to grow with cardano's projects in the future ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 8673, "q0": "Any ideas regarding increasing Cardano's exposure to students in different regions/countries are well on the way to what this Challenge's key metric requires. This will help students gain insight into the positives and opportunities that Cardano offers, thereby motivating and making them one of the contributing forces for the platform in the future. The main purpose of this proposal is to organize seminars, publish documents, and build communities to raise awareness of the Cardano ecosystem and its related issues in universities in Tanzania. Through it, to suggest to students a new way to find job opportunities and financial support for their innovative ideas from Cardano, access to technical documents without limitation governed by language. The author also clarifies the risks they may face hindering the development of the project and the efforts to mitigate it.", "q0r": 5, "q1": "The project development plan sheet is easy to understand because its main work is mainly organization and management, the timelines and corresponding tasks are also clarified. However, I have yet to see any information about community building work as mentioned by the author. The operating cost requirement is in line with Cardano's budget limit for this Challenge, through the budget table the author also clearly shows the frequency of organizing seminars and marketing to be able to attract the number of participants as expected. Information about the person making the proposal and the support person is clearly described, the information about the members' work experience and certifications is completely verifiable through the Linkedin profile they attached. Most of the people who implement the project are active and knowledgeable about Cardano to be able to do well in the blockchain and Cardano seminars.", "q1r": 4, "q2": "The measures proposed by the proponent to be able to measure the success of the workshop after implementation are ideal. However, it is just stopping at the concept/definition without the estimates expressed in specific numbers. In addition, in this project, the author has not yet provided tools/ways/spaces for the community or those who love the project to track information about the project.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7708, "q0": "The proposal complies with the requirements of the challenge, which intends to engage college students in contributing to the Cardano ecosystems that go beyond engineers and tap into a wide range of professionals. Additionally, it will aid in educating the general public, the mainstream media, and stakeholders while fostering positive creativity and innovation in the development of the Cardano Ecosystem.", "q0r": 5, "q1": "I am confident that the team is prepared to carry out the project given the necessary experience presented and the team's background information. The budget is reasonable. This budget proposal shows that the author understands what is needed to carry it out by planning and decomposing the budget. The proposer has a proven track record and vast industry experience. There is a thorough roadmap provided that outlines the goals and steps taken. Given the knowledge and a well-written proposal, this plan has a good chance of being implemented successfully.", "q1r": 4, "q2": "mputed and is requesting 4900 USD in funding, both of which are essential to attaining the goal. The resources offered are sufficient to assess the progress because the strategy has identified, comprehended, and is attempting to fulfill a real demand. The possibility that the idea will be implemented successfully is increased by the proposer's knowledge and understanding.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7628, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done well by putting the proposal at the right challenge to address the problem of the challenge. The problem they have identified in the challenge is lack of empowerment to students especially with soft skills after they finished school. The proposers are using a case study to develop their project taking into considerations where they are located in East Africa, in Tanzania to be specific Dar es Salaam is known as a business hub City serving all the countries in East Africa.   \nMoreover, The proposal aims to onboarding universities students before they finished school and it hopes to achieve this through educating and training them and by helping students contribute their ideas on the Cardano Ecosystem.\nFurthermore, the key metrics and goals of the proposal align with the outlined challenge settings that won't only target the Engineers rather all professional fields concerned in a collaborate atmosphere. \nThe proposal is able to scale to address future challenges by bringing together different professions together and it clearly articulates a plan for the project's future sustainability through gender equality, decent work and economic growth etc. \n\n\n\n\n", "q0r": 4, "q1": "The proposers have been able to provide relevant links to members of their team in terms of their experience and the skills the team possess in order to help them in proper execution of the project if funded.\nMoreover, the proposal and team provided  from the links have the desired skills and experience to be able to execute the project should since they have successfully executed a catalyst funded project before which speaks volumes of them. \nThe proposers know the type and number of team members required to implement the proposal from start to finish. \nThe budget is clearly outlined and broken down into identifiable items and is reasonable to achieve the set goals of organizing a model workshop and training schemes for the participants for a period of 12 weeks. The 12 weeks timetable is also realistic for a proposal of this size. \nThey have also considered challenges and risks relevant to a successful implementation and how to mitigate them. Such as challenges associated with blockchain which \n are its educational aspect, expense in terms of computer utilization and security constraints. All these following challenges have been highlighted in the proposal. \nThe cost associated\n", "q1r": 4, "q2": "They have clearly indicated the timelines and road maps to show how they are going to sufficiently implement the proposal. That is the various activities that will be carried out from week 1 to week 12.\nAlso indicated a well-thought out Metrics/KPIs that define the success of the proposal which includes workshop where participants will have a stronger understanding of the fundamentals of blockchain and the Cardano ecosystem, the various technologies it supports, and most importantly, how the students can further themselves once done with their University studies amongst others. And importantly,  they have illustrated a clear understandable and effective solution that addresses the problem with measurable definitions of success which has been stated already such as \nthe level to which workshop participants note that their blockchain knowledge has been improved. This is measured in post-workshop survey by proposers. \nAnd, they will share the activities of the workshop over social media such as LinkedIn blog series as an accessible public channel for delivering regular updates to the community for auditing progress. \n", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6099, "q0": "Proposal to improve the software capabilities of the students after they complete the course. In other words, the proposal is almost an opportunity for students to gain software skills as well as financial support and resources for them. The proposal is described in detail the impact on the challenge posed. Proposal aims to join universities, by helping students contribute their ideas to the Cardano ecosystem. at the same time, the cooperation between universities and the ecosystem will contribute to increasing resources. The students' contribution targets not just beyond engineers but a multitude of professionals. The team laid out the solution very specifically and clearly explained: Educate and raise awareness, demystify cryptocurrencies, publish documents, and build community. Besides, the proponent also realizes that there are many risks in the project. Example: In terms of education, the use of computers is expensive, security constraints and associated costs. All are considered and have specific solutions to reduce risks when the proposal is implemented. This is a positive point, showing the very good ability of the proponent.", "q0r": 5, "q1": "The proponent gives a specific roadmap with each job and the time to perform each specific job is presented on a weekly basis. The proposal will be implemented in 12 weeks. However, you can provide a few more details, so that we can better understand how it will work. For example, the proposal will be implemented in 12 weeks, however on what date/month the project will be launched and completed. In other words, we know what will be done, in what time frame, but can still improve a few more details. Next is the budget. The proposal asks for $4,900. In my opinion is completely reasonable. The required budget accounts for nearly 5% of the total challenge budget. And clearly explained each amount of funding that needs to be allocated for the work to be done in the project. Finally, about the core team members. I am quite satisfied with the presentation of the team members. We know about their identities, qualifications, skills that are appropriate to carry out the work on the project. The group also provides links so we can know more details about their background, history. In general, in my opinion, the proposal is very feasible for the plan presented.", "q1r": 5, "q2": "The proposal is brand new, however the proposal's plan is very good. Detailed and coherent route. The budget is properly allocated and transparently explained. Besides, the proponent has provided a lot of indicators that make it easy for us to measure and track the progress of the project. about the final product, that is what the success of this project is expected to be. Because we are provided with a lot of important information. I believe that the information is complete and satisfactory has been established", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 4777, "q0": "The proposer points to a problem with students who are completing their studies in Tanzania because students do not have enough information about the Cardano ecosystem when they finish their education. The team presents the solution in a way that will educate and raise awareness about Cardano, publish materials for workshops, forming Cardano Hub discord. This proposal and its goals are in accordance with the outlined challenge settings and the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "The links from which we get all the necessary information about the team are transparently presented. The team has 2 members and the members presented themselves in such a way that we can conclude that they have the necessary knowledge, experience and skills to implement this project. I would like the team to have worked out in detail what and in what way the team members will realize what was outlined in the implementation plan. A detailed plan for a realistic time frame for project implementation was developed and presented, and the budget is modest and a budget breakdown was made. The team is aware of possible risks and has enthusiastically developed actions if possible risks occur. ", "q1r": 4, "q2": "I would like to see when the team plans to start this project? Whether it is this year Q4 2023 or Q1 2023, that info is very important so that the community can know when the project will start and when it will be finished. A timeline with clear actions is presented along with information on how the success of the project will be measured. In the section “What does success for this project look like?” the team presented workshops and later onboard students to the Cardano ecosystem, which reveals to us that this team has an idea how to ultimately finish the project. ", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3496, "q0": "The guidance and support that can be provided to young people prior to seeking a career in the labor market is invaluable.  This effort is even more significant when it is carried out in developing countries.  Young people in Tanzanian universities would benefit from the purpose of this proposal. However, the degree to which the proposal meets the parameters of the Challenge for which it was submitted must be considered.  The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge, approved by the Catalyst community last fund, is to provide college and university students with a space completely separate from the regular Catalyst environment in which they can bring their projects to Project Catalyst and secure base funding, nothing financially ambitious. Clumsy projects, with flaws or weaknesses if any, but with a true innovative and creative student spirit, insolent and daring, that will lead their authors to find in our community a place to learn and get involved, a playground endowed not only with money, but more importantly, with the possibility to get hands on with the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it. That's just what this Challenge is trying to do: build a suitable habitat for students, designed primarily by the students themselves. \n\nBecause of my affinity with this Challenge (formal experience in education at school, university, company level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students.\n\nAs an educator and experienced Project Catalyst member,  I understand the intention behind the proposal and consider it completely valid. However, it is evident that it is not being proposed by the type of students that the Community decided to support through this Challenge, therefore it does not fit the parameters of the Challenge.  I quote (excerpted from the Challenge information): \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section). \n\nTaking into account the above reasoning, I must remove three stars from the final rating.  \n", "q0r": 2, "q1": "Although the type of projects that the experienced proposers wish to implement are of low complexity and the execution under normal conditions certainly follows a pattern that is easy to control, more detail regarding the activities in the implementation plan is desirable. Each activity is so briefly described that in the end it is inevitable that questions about the process of developing each of them will arise.  On the other hand, I personally have no problem with the numbers stated in the budget.  In my opinion, based on my experience as an educator and entrepreneur, they correspond to the implementation of a project of the magnitude of the one proposed.  The experience of the team is sufficient to carry out the proposed project, however, as I justified in detail in the evaluation of the Impact section, the non-student profile of the executing team is the reason why I consider that this valuable project does not correspond to the description of the category in which it was enrolled.  Based on the above analysis, I must remove two stars from the final rating.  ", "q1r": 3, "q2": "KPIs 1, 2 and 3 can be taken as elements for measuring project results, although KPI 2 requires establishing a clear method for measuring results beyond the superficially qualitative (YES/NO).  \n\nSince a more detailed implementation plan (i.e., more information with which to understand more fully the implementation procedures to be executed) is not provided, I consider KPI 4 to be outside the scope of the project.  It is well known that peer review is a complex process that should not be taken lightly.  The information provided by the proposal is not enough to establish if the methodology to be implemented will be the most appropriate for the job.\n\nWith KPIs 5 and 6 I have no problem (it is possible to use those KPIs as performance measurement tools), except for the word \"Vienna\" which, after reviewing the whole proposal several times, I can't find where it fits. I will assume that it is a possible translation or typing error.\n\nIn conclusion, I remove one star from the final result for KPI 4.", "q2r": 4, "assessor": "z_assessor_2462", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2062, "q0": "This proposal aims to join the 12 universities in Dar es salaam to help their students raise awareness of Cardano and bridge the gap between the students of the University and the system of ideas for collaboration and contribution of ideas. Cardano Ecology. The solutions given to solve this problem are as follows:\n-Educate & Raise Blockchain Awareness (Smart Contracts, DAOs, NFTs)\n-Demystifies 'cryptocurrency' and provides details on the fundamentals of the Cardano blockchain ecosystem\n-Publish material for outreach by preparing a published paper, linking workshop ideas to relevant academic literature, and providing insight into what the team is doing\n-Finally building community, by first forming the discord of the Cardano Hub but also the opportunity to introduce young minds to the Catalyst project and the Cardano ecosystem\nThe proposal is within the challenge target because I think this implementation will be core to the Cardano community especially will help more students to the Cardano playground and this number to grow in the future. It's great that the team has also assessed the challenges that may be encountered during the implementation of the project and has contingency methods to overcome them.", "q0r": 5, "q1": "The proposal's roadmap is very detailed, the proponent provides a 12-week roadmap and explains the tasks to be done in weeks. Therefore, I can understand exactly what to do, and when to do each task. The budget is also described very carefully. The proposal asks for $4,900, and we also understand a lot about the details of how to use that money. From expenses such as advertising, seminars, and space rental .... all are presented very clearly and transparently. Finally, about the team, we also have a lot of information, proposing consisting of 3 members, we know their names, each member's Linkedin link, their expertise and where they are working. From the description, I feel like this team is experienced and is currently working as a pioneer company so I feel that the proposal will be taken.", "q1r": 5, "q2": "Finally, in terms of audibility, this proposal was once again considered very carefully. The team has an interest in setting goals and KPIs that will serve as a document for us to analyze the progress of the proposal. It's entirely possible to track results based on the different goals they set:\n-Rate of positive responses from workshop participants (measured in a post-workshop survey)\n-The extent to which panelists note that blockchain knowledge has improved (measured in a post-conference survey)\n-Views, comments, and shares of the LinkedIn blog series\n-Future views and citations of peer-reviewed articles\n-Number of new project catalyst participants based in Vienna\n....\nEven so, I think it would be perfect if the team provides a platform to update the project progress so that it can be tracked by the community such as a website or any social network.\nThe success of the project is also well-defined and meets the challenge's objective well: Workshop participants will gain a better understanding of the fundamentals of blockchain and the Cardano ecosystem, Participants in the workshop will offer innovative ideas on how blockchain can be used to solve major local and global challenges as students graduate, May involve some students in the ecosystem Cardano status...In a nutshell, this project provides a clear roadmap and timeline that provides transparent goals for project evaluation, KPIs are very clear and consistent with the definition of success emerges a good understanding of the target problem.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 13442, "q0": "This proposal aims to onboard university students and professionals in various fields of work , living in Tanzania unto Cardano Catalyst ecosystem. It seeks to empower them to create innovative ideas and submit said ideas as proposal on Cardano in order to acquire necessary funding in order to better their lives and help them to realize life goals and dreams. This will also contribute to the Cardano ecosystem as the proposed project transcends beyond student entrepreneurs and taps into myriad of professionals available in the country.", "q0r": 5, "q1": "This project is to be implemented over the period of  twelve weeks which is a feasible timeline for the realization of the proposal. The proposer has identified the potential challenges that will arise in the rolling out of this project and has offered various solutions to this effect. The amount of founding stated in the proposal is also very reasonable and the strategy that will be used to develop the proposal is also provided, making the probability of success of this proposal significantly high.", "q1r": 5, "q2": "The proposal comprises of metrics will be used in the  assessment of the proposal's growth, as well as a feasible schedule and detailed milestones to measure the success of the project. The proposal also contains an outline of the problem identified and solutions that will be used to tackle said problem. A well detailed breakdown of the budget is also provided. The above information contained in the proposal is enough to audit the success and progress of the proposal.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14454, "q0": "The proposal's goal is to onboard Tanzanian students to provide them with necessary skills and resources for future employment. The target market will be Dar es Salaam - the largest city and financial hub of Tanzania. There are 12 universities here and the proposer has created Catalyst and Cardano resources to cater for Kiswahili - the regional language. This preparatory step helps facilitate the process of onboarding universities in this region. The proposal manages to specify the target audience - university students from all fields of study who will receive support and encouragement to contribute their ideas to the Cardano community. This means a collaboration between the Cardano community with universities in Dar es Salaam which in turn results in a larger pool of knowledge being provided to the Cardano community. This impact is positive for Cardano expansion and publicity (as what the proposer refers to as “momentum” from “general public, mainstream media and engaged stakeholders”). The solution focuses on educating and demystifying blockchain technology. Materials, workshops, Cardano hub discord will be prepared for outreach as a way to welcome students to the Catalyst and Cardano ecosystem. This has a direct impact on the awareness of these students towards Cardano. However, the proposer should speculate the reception of this project among universities and students as well as the surrounding regions. The proposer also manages to identify relevant risks that basically entail educational aspects, security constraints and high cost. However, the “educational aspect” is vague, leading to a lack of connection with mitigation measures. The educational aspect may be the lack of engagement from students, ignorance, resistance to blockchain technology,... Similarly, risks about security constraints are not fully addressed. The proposer just mentions the risks of safety and scams but not how to prevent them.", "q0r": 3, "q1": "The proposal will be carried out in 12 weeks, with specific activities attached to each week. For more clarity, the proposer should include specific dates/month/year (Ex: 8/2022, 3/2023,....) for better tracking. Without specific dates, it will be unclear when the activities will actually take place. This ambiguity is not positive for feasibility. In contrast, the budget breakdown is clearly demonstrated. The proposer is able to specify the cost per duration as well as meeting capacity (50 people), marketing materials (brochures, flyers,...). However, the proposal doesn’t make it clear about human resources. For instance, who will be running the workshop? Who will design marketing materials? Who will be in charge of the marketing campaigns? Who will take the mentor role? The proposer should specify whether these positions will be divided between the two team members who will be working on this project and therefore, no payments will be made for human resources. Or will they hire more people? If yes, then the budget should include payments for the hired people as well. Regarding the two team members, they both belong to the Catalyst community, which gives them the ability to provide guidance and orientation for the participants in terms of knowledge about the Catalyst and Cardano community. Their scope of knowledge is relevant to the project (web and app developer, finance, accountancy,..). However, considering the amount of work that needs to be done within weeks, will two members be sufficient to handle them effectively? As I have mentioned, it is important that the proposer specify whether they intend to hire more people for support. This will deeply affect the feasibility of the proposal and should be addressed in detail.", "q1r": 3, "q2": "The key metrics for audit are quantifiable, which helps tracking become easier. The proposer could also specify whether the results from this survey be disclosed to the public for external audit. The mentioning of the Vienna-based project and discord is a bit confusing as there is no background information about Vienna. Indicators for the vision of success such as participants’ understanding of “the fundamentals of the blockchain” and “how they further themselves after graduation” are not quantifiable and difficult to assess. These indicators should be converted into the percentage of students who join the technology industry/have tech-related occupations/join the Cardano ecosystem to prove the impact of these workshops and the knowledge provided to the participants. SDG goals should be explained further as how the project is related to “sustainable cities and communities”, or it could include “equality/gender equality in education, employment, end poverty,...”", "q2r": 3, "assessor": "z_assessor_4055", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Onboard Tanzania University Students Network. Aims to prepare university students towards achieving soft skills prior to employment as well as financial support and capital sources.", "experience": "\nRegistered business consultancy agency in Tanzania. Active contributors in Catalyst communities (Catalyst School, Sustainable ADA, GTH, C4C, CATH, CETH ), Catalyst PAs and referrers, Business developers, Community manager, Trainers, Fullstack developer, Funded proposer.\n"}