{"id": 415367, "author": "quirin.schlegel", "title": "Mentoring Program", "url": "https://cardano.ideascale.com/a/dtd/415367-48088", "category": 26599, "amount": 3000, "description": "Catalyst Newcomers can have a hard time on boarding and navigating the Cardano space, because the Ecosystem is complex and it is not always clear whom you should talk to.", "f6_no_assessments": 18, "f6_rating": 2.685185185185185, "videos": [], "media": [], "f6_assessments": [{"id": 11540, "q0": "The proposal is poorly written, with almost all of the foundational details missing. On the one hand, the mentorship aims to solve a well-defined and legitimate problem, but the solution is described in two sentences. Furthermore, it is unclear whether the end product - \"platform where catalyst members and students will match up\" - will be physical or online. If it intends to build an online platform, will it be open to all students worldwide or only to students at a specific university? How will students and Catalyst members become aware of the platform - no explanation is given as to how awareness of the envisioned platform will be raisedFurthermore, which students are expected to participate in the project? - The proposal promises to connect new Catalyst members with mentors in one section and students with mentors in the other. Does the term \"student\" here refer to Catalyst newcomers? Furthermore, the project seeks to develop a system for evaluating mentors but fails to describe how it intends to do so - what the criteria will be, what type of survey will be used?, and how it will be quantified/analyzed? Another issue that the proposal does not fully address is the alignment with the current challenge, as it does not specify how such a platform would assist in connecting students with community engineers. On the other hand, it is fair to say that finding the right mentors would help students navigate the Cardano space more effectively and find opportunities for idea materialization and business what is one of the goal of the campaign. Finally, estimating the nature of the project's impact (local/global) is difficult because it is unknown which students will be interested in the project. ", "q0r": 2, "q1": "In my opinion, success is highly improbable. As stated in the previous section, the overall concept is ambiguous, vague and thus difficult to imagine materializing for a number of reasons. First and foremost, there is no description of the team; all that is provided is a single name with no breakdown of his previous experience, background, or searchable LinkedIn/Facebook profile. The provided github repository is essentially empty, with activity limited to the last few weeks/months. I believe it was established solely for the purpose of this fund. The proposer's role and responsibilities are not explained at all. The timeframe is described very poorly, only mentioning two tentences from the impact section. Finally, there is no explanation of the budget. It lists a monthly fee of $500 USD and a fee for Catalyst iteration - what is the justification behind this? What does it stand for? - Assume it means an incentive for developing the platform? How was the budget calculated? The proposal, in my opinion, raises more questions than it answers. ", "q1r": 1, "q2": "The proposal basically copied and pasted the impact section into the deliveries with no further elaboration on the steps required to complete the project without specific roadmaps and delivery dates. The measures of progress are really superficial and lack detail about how, where, and how frequently the community will be informed about progress and who will be in charge of the auditing process. The proposer makes no mention of how the risks might hinder or prevent delivering what was proposed - there is only a mention of an existing scoring system for the quality of the mentors with no detail. Because the autditability section only contains two sentences, these reasons clearly indicated to me that it will be probably difficult to monitor how the project progresses. ", "q2r": 1, "assessor": "z_assessor_3256", "no_vca": 11, "ne": 6, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 193, "q0": "The proposer wants to build a platform which matches up students and senior catalyst members, where funded proposers can be matched up with qualified Mentors to exchange information and experience. This keep funded proposer well focus attention and be motivated, and help to maintain a group of people willing and able to make contributions to the ecosystem. As a result, funded proposal will be highly successful implemented. The platform itself will improve tooling to support human processes in Catalyst. These exactly fits the Challenge.", "q0r": 4, "q1": "The proposer himself was student as well as funded proposer (F3 with Decentralized-Accounting), so he got experience of being newcomer to Catalyst, who got hard time on boarding and navigating the Cardano space, because the ecosystem is complex and it is not always clear whom you should talk to. Keep this in mind, the proposer knows very well what he should do and how the platform will be built.\nThe budget is reasonable by work assigned. However, I’d like to know more details how the framework looks like after 2 months? what does proposer expect during Catalyst Iterations testing? The proposer also awares of the risks, and he already has good solutions for that.\nIn addition, I’d like to see the proposer’s education/working profile in order to confirm his ability to carry out this proposal. ", "q1r": 4, "q2": "The proposal set target very clear and I’d love to know more details how many students and/or mentors expected to join the platform? how the proposer will convince them to make the survey? It will be more easily to be updated the progress if the proposer has separate social media channel. Also, set KPIs will keep proposer focus on final result, and the proposal can be easily audited by community.", "q2r": 3, "assessor": "z_assessor_2055", "no_vca": 23, "ne": 2, "ng": 19, "nfo": 2, "vca_o": 1}, {"id": 9649, "q0": "The  problem statement of this proposal describes a deficiency in the Cardano ecosystem where beginners are not sure how to familiarize themselves with the environment. This could cause discouragement and people losing interest or not being able to optimally utilize resources related to catalyst. The project is proposed by a student who wishes to create a better onboarding environment for young people and this is in line with the challenge setting which aims to give students opportunities to be funded and link them up with interested engineers. The proposal if implemented will have a positive impact on the Cardano ecosystem because new comers will now have necessary knowledge and skills to build themselves up in the Cardano ecosystem. ", "q0r": 4, "q1": "There is a plan for implementation of the project however it is not detailed enough and does not give a clear time frame. The proposer only vaguely mentions that two months will be allocated for setting up a framework but does not give the time period for Catalyst iterations for testing and refining. Again, there is the risk of not having enough mentors with knowledge on Catalyst is high. However the proposer was unable to come up with a solution for mitigating that potential challenge. ", "q1r": 3, "q2": "In my opinion, the only plausible metric for measuring performance outlined by the project is the measurement of how many students and mentors come on board. The other KPI which is the results of the feedback survey does not specifically tell us how  that will contribute to quantifying progress. The other concern with auditing this project  is that the milestones outlined for the implementation are not clear, do not give complete time lines and does not state when the actual mentoring will begin.", "q2r": 3, "assessor": "z_assessor_3078", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 9455, "q0": "The idea of ​​onboarding newcomers in the complex Ecosystem of Cardano by navigating them by a mentor has a potential of big impact. However, the proposal is quite unclear and has gaps. The difficulty of orienting newly joined members to the community was highlighted as a problem, and then the main target group was identified as funded Proposers - people who managed to enter the Ecosystem, to identify its problem and manage to propose a project idea that to be financed.\nIt is not described what information is supposed to be exchanged between funded Proposers and qualified Mentors and what the funded Proposers' supposed need for mentoring is.\n \nFurther, in the project proposal, the target group is described in a new way as \"students\", and the mentors as \"senior catalyst members\". All of this creates confusion about who are the people the project proposal is aimed at, what their needs are, and who can best address them.", "q0r": 1, "q1": "The described plan is without details and clear activities. How will it be implemented and what exactly does Setting up a Framework to manage and match Students and Mentors involve? What will be iterated and refined in Catalyst Iterations to test and refine?\n \nThe budget is without any pricing details by activities, prices, rates and value.\n \nOnly the name of the submitter of the project proposal is given without any information about his professional experience and expertise enabling him to carry out the project.\n", "q1r": 1, "q2": "Only two indicators are identified for monitoring the implementation - Amount of participating Students and Mentors and Results of Feedback survey. As for the former, no specific measurable objectives are set, and for the latter, it is not described what will be investigated and how it will assess the progress and quality of implementation.\n", "q2r": 1, "assessor": "z_assessor_3061", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8845, "q0": "The mentioned proposal is an excellent idea, where new comer will have lots of things going on in his mind ,as whom to connect during the time of need.\nThe proposer has developed a idea where fresh developer can exchange information with experienced mentor and cross the barrier which he's facing or he might face in the future hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Finding mentors would never be a easy task , since experts will always be busy with there work. The proposal hasn't mentioned how he'll help them to get connected, will that through a regular phone call or it is through online web call. The proposer could have added some webinar ideas where expert can clear mass doubts at once , since the proposer has experienced the issue during fund 3 stage , this experience might help him bring determination of completing the project.", "q1r": 4, "q2": "The team with which proposer wants to work lacks experience ,and hasn't mentioned about the expertise field of his partner. The proposer could have had added, what tool he'll be using to set up communication between mentor and fresher.\nThe proposer has set up proper key indicators by getting review and ratings, and it has decent budget breaking idea , with an excellent idea provided, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 8436, "q0": "One project said it wanted students to have access to a mentor to solve their problems. at the same time, creating a Mentor keeps students motivated and focused. Summary of experience shows that you are an experienced idea writer and have already been funded in round 3, but in this round I see that you have come up with a sketchy proposal that does not clearly show what is needed and sufficient for others understand. The solution you presented is simply that this project is suitable for creating a platform for students and senior catalyst members? We do not yet understand what this solution specifically means. Project-solving project themes that will bring students to the side of the problem they solve some problems faster and provide a Mentor that helps focus attention and stay motivated. The details are too short, making it difficult for us to describe this project, more specific data is needed. The risk you face is not knowing the number of Catalyst members to measure the number of Mentor participants, instead of offering optimal solutions, you choose to poll to come up with suitable solutions. , that's also a good way .", "q0r": 3, "q1": "Regarding the feasibility plan, we also found a lack of more detailed information about the steps that must be taken to achieve the goal. Is the brief two-headed information listed on the details of an entire plan going live for the entire Cardano community to participate in. Is it too short for participants to want to know? two months to establish a framework for student-advisor management and matching which I think is appropriate but this project still has a lot of issues that need to be worked out for the students as well as the advisors to understand the problem. common problems to solve, for example: setting up student management committees representing the group leader or the head of the staff committee of that student group, together with the advisor, the managers or the head, to discuss the contents of the student group. basic content to create the foundation to implement other content in the project? or can design certain accessible applications or software that can be exchanged directly with each other from members. Can the budget be given more detail about specific jobs and costs to whom to do those jobs ? The people who join the group you work together are too brief for a name that doesn't add anything about the experience as well as the access link? it is difficult for us to know and put our trust in this project. All in all, we recognize that a little more specificity is needed about the Workable Plan.", "q1r": 3, "q2": "As for the chosen way to track progress and project development, we found it to be very general, without providing a clearer means of the process being examined. Knowing this project is also simple in terms of how to work and build it but should also give us more metrics that are easy to measure and have a lot of confidence in the development project. As a new project that promises success offering a thriving Community of Students and Mentors who inspire each other, complete their projects and possibly build frigates, it's also good if If everything is more organized than planned, believe that your project will also attract a significant number of students.", "q2r": 3, "assessor": "z_assessor_2984", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 7710, "q0": "With the help of this proposal's program, funded Proposers can be linked with knowledgeable mentors to share knowledge and experience. Students can complete tasks more quickly when they have access to a mentor. A mentor can also assist maintain motivation and focus. This idea connects well with the challenge's goals, but due to its inadequate description and lack of sufficient depth, I gave it a score of 3.", "q0r": 3, "q1": "Unfortunately, this proposal's two-month goal wasn't very clearly specified. Quirin Schlegel is the only team member, thus I'm not sure if he will be able to complete the proposal by himself. He'll still have a little trouble finishing the proposal. I gave him a score of three because he did it on his own.", "q1r": 3, "q2": "For the project's two-month implementation, a fantastic road map has been provided. The proposal has offered crucial performance indicators, shown a thorough comprehension of the issue at hand, and offered an excellent solution. However, as I already got mentioned, the overall idea is not particularly adequately described in depth.", "q2r": 2, "assessor": "z_assessor_2916", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"id": 7094, "q0": "The proposal addresses the difficulties of finding mentors for funded Catalyst proposals from students. The idea is that by putting previous Catalyst members and the funded students together, they could both increase the quality and efficiency of the student proposal implementation. I think the problem does exist and it does align with the challenge goals as it acts as one helper tool for funded proposals. However, the proposal presented to us is simply not detailed enough regarding the implementation. That being said, I suggest the proposer come up with more planning the next time around because the problem is already there, but maybe they are busy planning other proposals. Overall, as of now, I disagree with the contribution of this proposal to the challenge setting.", "q0r": 2, "q1": "I strongly disagree that the proposal could be implemented. The proposal honestly seems like a rough draft: the proposer has relevant experience but didn’t list any profiles; the budget isn’t broken down into identifiable items (for example, the word \"framework\" is very vague); the amount requested isn't backed with any justification; there isn’t any timeline; and while the proposer has listed the challenges, no mitigation plan is concretely offered.", "q1r": 1, "q2": "It is going to be hard to audit the proposal simply because the details are not there yet. The roadmap and the milestones don’t exist. While the metrics the proposer picked are right on the nail, there isn’t any objective number we could refer to to measure success, and there isn’t any mention of how we could access the metrics. In the end, I strongly disagree with the information currently provided as it is not sufficient for auditing.", "q2r": 1, "assessor": "z_assessor_2878", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 6583, "q0": "A platform that matches up students and senior catalyst members can help young people to understand the world of catalyst, receive mentoring and get some help and advice to get founded. A program where funded Proposers can be matched up with qualified Mentors to Exchange Information and Experience can help to improve the scalability of these new technologies.\n\n ", "q0r": 5, "q1": "The proposal does not explain how the onboarding of students and mentors will be, will rewards be offered? Will it be a free service?\n\nOn the other hand, about his experience, he only says his name and that he was a student-funded in F3. That information does not allow me to objectively assess whether he is qualified to carry out a proposal like this.", "q1r": 2, "q2": "The proposal does not offer KPIs to be able to audit the project. There is no description or detailed roadmap and the information offered is quite generic. Unfortunately, I must place a low score for this lack of information, but I recommend the proponent resubmit their idea, including more and new details.", "q2r": 2, "assessor": "z_assessor_2822", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 4887, "q0": "The proposal identifies the problem that an onboarding new catalyst member may find it difficult to maneuver around the ecosystem and get lost. For the summarized solution, I find it confusing as it proposes a program to match the \"funded proposers'' with qualified mentors, whereas the problem statement states “Catalyst Newcomers”.  If funded, the proposer should have got around the hardships already and only need to carry out his own proposed plan. He may not need mentorship.\n\nI am not clear as to the mechanism or the system to set up a platform for the matching as it does not elaborate. The proposal also identifies the problem of demand for the mentors and the problem of quality mentorship. It offers a scoring system and sets up rules for mentorship, but does not elaborate.\n\nDespite I am unclear fully about the plan in the proposal, I see the proposal looks to get groups of people to help enhance and contribute to the ecosystem as set in the challenge priorities. This would meet the campaign brief as it promotes new ideas that could have been deterred by the difficulty in going around for help when onboarding.. The budget requested is within the limit in the campaign, although more elaboration on the budget items needed to give a clear direction.\n\nFor the above reasons, I neither agree nor disagree that this proposal effectively addresses the challenge.", "q0r": 3, "q1": "In the detailed plan, it proposes 2 months setting up the framework to manage and match and another two months to test and refine. I am not clear about the intention, nor do I understand how it would go about getting the plan implemented. Again the budget does not have the tasks breakdown.\n\nAs I have difficulty understanding the plan and its implementation, therefore I disagree that it is highly likely this proposal will be implemented successfully.", "q1r": 2, "q2": "Whilst the numbers of participating students and mentors, and the feedback survey results may provide a measure of the progress and success, I failed to see the directions and numbers that would affirm the feasibility of the proposal.\n\nTherefore, I disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_2631", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 4778, "q0": "The proposer explains what problem Catalyst newcomers have and that is having a problem in boarding and navigating the Cardano space, because the ecosystem is complex and it is not always clear who you should talk to. An excellent solution was presented, which is to create a program where funded proposers can be matched up with qualified mentors to exchange information and experience. Because there are no KPIs, it's hard to compare KPIs with challenge setting and the proposal is not able to scale to address future challenges.", "q0r": 3, "q1": "It would be great if the proposer posted links that allow us to see who is behind this project. Is it a real person who has experience, knowledge and skills necessary to realize this project. The proposer presents a budget that is really frugal. I would like a detailed budget breakdown with clearer information on what the money will be spent on. In the proposal, we find information that the project will be done within two months. It would be great if a detailed work plan was developed and presented. The proposer lists possible challenges/risks and acknowledges that there are no solutions to the challenges if they occur.", "q1r": 2, "q2": "This is a great idea and for every great idea it is necessary to have an elaborated roadmap with milestones together with elaborated KPIs so that the community can monitor the development and success of this project and so that the community has a clear insight into what the money will be directed to.", "q2r": 2, "assessor": "z_assessor_2616", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 3661, "q0": "Basically, this proposal has the objective of creating a program where the proponents who get funds, have qualified mentors to help them with their experiences and knowledge exchange. The proposal matches the campaign because it provides a way to increase the chances of success of student projects in the Cardano ecosystem, helping in the development of students and also the blockchain. In this way, it is possible that the proposal will be the basis for future projects.\nThe impact of this proposal would be related to the possibility that the mentor's help would make the proposer able to solve problems faster, stay motivated and focused on his project. This benefit increases in this present campaign, since the proposers are students and due to their lack of experience, they may encounter several difficulties that the mentor will help to solve.\nFinally, the risks and challenges that accompany the idea of ​​the proposal were considered. An important challenge presented by the proponent was the availability of Catalyst members to volunteer to act as mentors, and the proponent still does not have a concrete action to mitigate it other than conducting a poll to understand how many and which people could take on this role. . In order to manage this challenge, I believe it can be interesting to set up mentoring groups instead of just doing individual mentorships. This would be a way to solve the more general and initial doubts of several proponents at the same time, scaling a little more the time of the veteran members of Catalyst (who will be the mentors).", "q0r": 5, "q1": "The proposer has experience with Catalyst and has been funded before. In addition, he is a student and understands the difficulties that other students may have in raising funds for their proposal on Catalyst. An important point is that it appears that the proposer will work alone on this proposal. I would like to better understand how he sees this. The project will take time and the proponent will probably not be able to dedicate himself only to the proposal since he is a student and needs to focus on his studies as well. With that in mind, how does he intend to reconcile these commitments?\nThe proposal presents the execution plan, but it could have been more detailed about what will happen at each stage to understand the CA's. The same goes for the budget. In this sense, some explanations can complement and improve the proposal, for example: what would the '2 Catalyst Iterations to test and refine' look like and what tasks need to be accomplished for these interactions to be carried out to justify the budget of $1000 for each one? Does the proponent already understand how the framework to manage and match students and mentors will be made? (if yes, he could describe a little in the proposal). The proponent claims that the solution to linking students and mentors would be a 'platform', but he does not describe how to create it. This is a point he could explain better as well. This platform would even be created. If yes, what would she look like?\nI believe that the proposal has a lot of potential, the idea is excellent. However, these refinements are important for us (CA's) to better understand the proposal as a whole and also for it to have a clearer and easier implementation roadmap for the proposer to follow. For all these reasons I'm giving it 3 stars.", "q1r": 3, "q2": "The proponent presents some metrics to measure the progress and success of the project and the satisfaction of the people involved (Amount of participating Students and Mentors and Results of Feedback survey). In addition to these metrics, I think it's interesting to track how many mentored projects are succeeding. This is an excellent way to understand and track whether mentorships are having a positive effect on mentees. In addition, the proposal could also present the roadmap with milestones and deadlines more specifically with explanations of each stage, as explained in the previous criterion. This way, the auditability of the project would be easier and clearer. For these reasons I'm giving it 4 stars.", "q2r": 4, "assessor": "z_assessor_2466", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3497, "q0": "Unfortunately, the problem statement is the most rigorously worked piece in the entire proposal.  The problem formulated by the proposer (who provides as relevant information about his experience only his name) is certainly a real case faced by new Catalyst members.  However, the proposal describes the general issues that will be addressed in the design of a possible solution, as if it were a first draft of it.  The information provided is not sufficient to establish what the structure of the proposal is, which is why I must deduct 4 stars from the final rating.", "q0r": 1, "q1": "The limited information provided in the implementation plan, the budget and the experience of the project team is consistent with the methodology followed by the proposer in the development of its proposal.  The information provided does not allow to establish the degree of feasibility of it.  Finally, it is not possible to confirm the student status of the proposer with the information provided in the section \"Please provide details of the people who will work on the project\" (fundamental condition to participate in the Challenge \"Challenge & Scouted for Students\").  Consequently, I must remove 4 stars from the final score.", "q1r": 1, "q2": "It is a natural condition of any KPI (qualitative or qualitative) to be anchored to a fundamental information flow point of project performance, in the same way that measurements on a physical structure are carried out at the foundational bases of it. The proposal as it stands does not provide a clear picture of its structure, so there is no way of knowing whether the KPIs suggested by the proposer have the capacity to capture truly valuable information or pure noise and vibration with no real impact.  Such a proposal, with the right design and preparation work, could be interesting for the ecosystem's interests in the next funds.  However, in its current state, it leads me to remove 4 stars from the final rating. ", "q2r": 1, "assessor": "z_assessor_2462", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3149, "q0": "The proposer is a student, which I appreciate, and their participation in this campaign makes sense, as does the concept of mentorship relationships relating to Project Catalyst. However, there is very little plan or structure around how any of it works. The nature and impact of the mentoring relationships is left to the imagination, so impact is difficult to rate. Furthermore, while this service could be used by students, there is nothing to indicate that it is specifically for students, which also limits its impact and appropriateness in this campaign.", "q0r": 3, "q1": "With no incentivization or structure, I see no reason to think mentors would be eager to volunteer. The proposer provides no details about themselves or their qualifications- only a name, and that they are a student. The budget has a monthly dollar figure, but no details about what this pays for. Specifically, I see no information about how we pay for the “platform”, for starters or for sustained use. Overall, what is needed is much deeper planning and detail about how the solution is built and implemented.", "q1r": 2, "q2": "There is no quantitifiable goals or measures to know when the project is complete or if it is successful. Will there be one mentorship pair? One hundred? Will mentorship pairs meet once? More? What questions will be asked of participants to gauge success? How will they be supported to if they need help in order to have a successful relationship? Just saying the project “done” after a certain time has passed, without other measures of success/completion, is not enough. ", "q2r": 2, "assessor": "z_assessor_2404", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2407, "q0": "In relation to the objectives of the challenge in which this proposal finds itself, we perceive a great alignment, mainly because this is today a clear need for the ecosystem. Currently, after a proposal has been funded, there is no direct monitoring of its evolution by a Cardano technical member. In this way, a tool that seeks to unite proponents and mentors has great potential to benefit the evolution of projects and, consequently, the entire Cardano ecosystem, especially if mentors are chosen with harmonious technical skills in relation to the project in question. Thus, we see a positive impact in the medium and long term with the success of this proposal. In addition, we can mention that the required budget is within the established limits.", "q0r": 5, "q1": "We have that the central idea of ​​the proposal in question is not very complex, even because of the budgetary range being required, so there is also no obvious need for a very dense explanation about the feasibility. But it would have been interesting if a little more detail had been transmitted in relation to what the framework may present. It would be interesting to convey some more details such as the way chosen to match between proponents and mentors, as well as it seems interesting to mention a little better which aspects will be verified in the aforementioned tests. Regarding the distribution of the budget, the spending arrangement seems to be consistent, as well as the actions that will be carried out. However, there is a caveat that perhaps the construction of the tool will be more expensive than what is being planned, and as the budget currently being requested is below the maximum range, in this case it would even be possible to increase it a little. We can also mention as positive points the fact that the student behind the project has already been financed in F3, in addition to having made available a GitHub link that has recent updates. Another constructive observation would be the possibility to 'manually' test this idea before actually going to the implementation stage. In other words, one possibility is to choose certain Cardano professionals who have technical requirements consistent with certain projects and allocate them to mentor them. If the result of this pilot test is successful, there would be a good indication of an efficient method to make this match.", "q1r": 4, "q2": "Regarding the aforementioned ways to measure the evolution of the project, we note that they actually make sense and fit the scope of the proposal. However, we miss the indication of some clearer quantitative parameters, which show us more evident goals to be achieved. For example, how many students and mentors does the project initially aim to reach? (even if estimated). Equally, more information could have been provided about how this Feedback survey will take place (what questions will be asked, what is the average level of satisfaction expected to be obtained). An interesting point would also be to try to measure how this project is being talked about among the members of the Cardano community, to understand the engagement. Finally, it seems valid to leave as a future indicator of success the number of projects that started to be mentored from the next fund.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 2063, "q0": "According to the author, Catalyst Newcomers can have a hard time boarding and navigating the Cardano space, because the Ecosystem is complex and it is not always clear whom you should talk to. So his solution was to create a bridge between the sponsored proponent and the qualified mentor. The idea of ​​the proposal is quite amazing because students have a lot of good ideas but can't always give the right direction, by connecting with the mentor, the student can solve the problem and solve problems faster. At the same time, having a Mentor helps focus their attention and keep them motivated so they can pursue projects to the end. The problem and solution described are reasonable and within the scope of the challenge.\nThe proponent also mentioned 2 challenges that may be encountered during the implementation of the proposal: 1. Lack of mentors and 2. Quality of mentoring. In challenge 1 I think it will be easily solved by Catalyst members who are always willing to volunteer as Mentor so it's not too big of a problem here. In the 2nd challenge, I think that the proposed solution provides a very good solution to be able to limit them. So, in my opinion, this proposal fits very well with the goals of the challenge and does it straightforwardly and directly, so it deserves the maximum score in terms of impact.", "q0r": 5, "q1": "Unfortunately, the feasibility of the project is not appreciated, because all the elements of the budget, roadmap, and implementation team are very poorly explained. Therefore, there is not enough basis for us to evaluate the feasibility of the project. First, the roadmap mentioned is \"2 months Setting up a framework to manage and match Students and Mentors\n2 Iterative Catalyst to Test and Refine\" we don't know the exact start time of your project. Perhaps after receiving funding? Based on what was provided I can't imagine how you would implement the proposal, what activities would be included in it? Next is the budget this section is also explained very simply \"$500 per month, $1000 per catalyst iteration\". Based on the budget I can guess that you will complete this proposal within 2 months. With a salary of 500$/month and 2000$ for 2 catalyst iterations. Here you can explain more about the budget, for example, a salary of $500: how much time will you spend on this proposal, how many days a week and how many hours a day? Although the budget requirement is low, it is important to explain it in detail, helping us to visualize what work you are asking for, as well as better understand project workflow.\nAnd finally, about the project team, there is only one person mentioned that is Quirin Schlegel. Based on the experience summary, I know that he is a student and I have been funded in F3, based on this information alone it is difficult for the community to judge the author's ability to carry out the project. Although this is a simple proposal, it is also necessary to introduce details about the writer of the proposal such as his area of ​​training, personal connections, or personal skills. Therefore, unfortunately, the viability of this project is very low, it needs to be fully supplemented.", "q1r": 2, "q2": "The ability to measure the progress of the project is referred to as\n\"-Amount of participating Students and Mentors\n-Results of Feedback survey\"\nAnd the ultimate success is referred to as \"A thriving Community of Students and Mentors who inspire each other, get their projects done and maybe build frindships\".In short, This is what we are capable of testing. It's not bad, but it's superficial, again. How can we track the progress of the project? All of this information will be needed to reach our community members, one way or another; for example through our Telegram group, or discord, in short, some direct and simple way for us to figure this out. So I think this part of the proposal is also average and deserves a closer look.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 12716, "q0": "This Project aims to onboard new users, specifically students, to the Cardano Community and Eco-system, which is directly relevant to the Challenge Topic of \"Challenge & Scouted for Students\".\n\nThe stated problems and proposed outcomes are clearly identified in the first Part \"General\". However, the Proposer mixed up \"a program\" with \"a platform\" and \"a framework\", and \"funded proposers\" with \"students\" in later Parts, which makes me question his/her understanding of the proposed solution in particular and of the Project as a whole.\nThe Proposer has a good idea that would be greatly beneficial to Cardano Catalyst Fund if it can be carried out methodically ad devotedly. If the Project can equip students with knowledge of the Cardano Ecosystem and Community, it will help increase the popularity of Cardano amongst students and increase the quality of projects submitted by students. If the Project can help funded proposers to implement their projects more effectively, it will help to increase the probability of success for the funded projects. \"\n\nThis idea, if implemented successfully, can be scaled easily to other countries beyond the Proposer's residential territory, as in this internet era, \"mentoring\" can be provided online and not just offline.\nFor the above reasons, I give this Proposal an average of 4/5 score for Impact.", "q0r": 4, "q1": "The Proposer seems to be capable of providing a digital framework for students as he was granted Funds by Catalyst Fund 3, and has provided the Github Link for his past Proposal.\n\nHe also stated clearly that there is only 1 executor on the Project, that is the Proposer himself.\n\nWhile having a very good idea to connect students and senior catalyst members, the Proposer has not found a proper solution to the problem, but rather a \"desirable outcome\". The Proposer needs more brainstorming to find a solution to his stated problem.\n\nI find the proposed budget not well-identified with only 3 cost items. What are the \"500USD per month\" and \"1,000 USD per catalyst Iteration\" to be spent on? What does a \"Catalyst Iteration\" include? We as Project Analysts need more information to assess the budget.\n\nThe proposed solution was not properly presented to the audience. It is hard for the Audience to determine if the Proposer wants to provide \"a program\" or \"a platform\". A program lasts for a certain amount of time, then 2 months might be possible. A platform or framework normally takes more time and requires a capable technical team to build. Since the proposed solution is unknown, it is impossible to judge if the Budget or timeline is enough for the Project.\n\nSince the Proposer was unable to provide a proper solution to the stated problem, the execution risks are high. As a result, I give the Proposal a 2/5 score for Feasibility.", "q1r": 2, "q2": "The Proposer was able to provide a few estimations on budget items and KPIs. However, he/she fails to present specific KPI items and figures. He/she needs to put more effort into providing relevant quantitative and qualitative indicators that are well-researched and trackable by the Cardano Ecosystem\nWithout enough information, I can not determine if the Budget is sufficient, or if the timeline is long enough for the project to be implemented.\nThis Proposal does not give information on a proposed reporting system or how project spending can be tracked.\nFor the reasons mentioned above, I give this Proposal a 1/5 for Auditability.", "q2r": 1, "assessor": "z_assessor_3470", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13726, "q0": "I find that the proposal has a large impact for students looking for resources, knowledge, and consequently \nforward fundings in the Cardano Ecosystem. By the tool que proposer is suggesting to create, the connections between students and engineers can happen in a practical way, opening space for the exchange of ideas and , as I see it, a possible recruitment by engineers. Therefore, the idea is proposing to mitigate the problem presented in the challenge, building a bridge students-engineers worldwide. Besides, the project has the ability to scale as there are more people interested -students and mentors-, and as the tool improves, such as providing new skills to it. I would suggest a \"search/match\" button, where students can search for a specialized mentor in his/her area of interest. \nI just would like to state that the proposer does not mention \"recruitment\" in his proposal at any time, when the one of challenge's clear keys of success this. I highly recommend that, if funded, the proposer makes it one of the KPI's in his report to the community. ", "q0r": 4, "q1": "The proposer already has experience in building tools to solve problems in the Cardano Ecosystem. So, this is a positive point to keep in mind in order to asses the the possible success of the proposal. \nHowever, the total amount asked in the proposal is relatively high and is not clear enough on how this money would be spent. The roadmap lacks detailed information. The fases of the project are not well explained, and the budget is not detailed.\nFor example, the proposer sates \"2 Months Setting up a Framework to manage and match Students and Mentors\", \" $500 per month\". First of all, how would the proposer attract all the students and mentors for him to build this framework, since one of the risks he stated was that he did not know if there wold be enough Catalyst members willing to be mentors - and he did not know how to mitigate this problem yet. In addition, how this Framework would be built? Which information does he need in order to provide a good match for users of his tool? Will it be self-matching or admin-matching? How much of the budget would he need in each fase?\nI strongly advice that the proposer creates a clear roadmap, containing all the details and fases the project will pass. \n", "q1r": 3, "q2": "As I said in the topic above, the proposer does not provide a clear or detailed roadmap, which can hinder the community to audit the project. Besides, he does not provide any milestone or a clear date on when the tool would be ready to be used. In the proposal, the progress if the project would the measured by the number of students and mentors using the tool and the feedback provided, which I particularly think are important but few progress KPI. Here, the quantity of private student-mentor sessions would fit, as well as how many accesses the platform is having per day or month. \nMoreover, there is no importante milestone defined in the proposal. \nAccounting the success of the project, the proposer writes \"A thriving Community of Students and Mentors who inspire each other, get their projects done and maybe build frindships\". And yes, I agree. But shouldn't it be also the recruitment of some of these mentored students? Shouldn't it be measured the rate of mentored/recruited student as an important KPI? Or, those who were not recruited, did they submit any other projects to improve the Catalyst Ecosystem? Were they funded? Did the use of the platform contribute to this achievement in comparison to those who did not use the platform? \nThese are important and necessary rates and KPI's, in my opinion, the should be shown to the community in order to have a good audition. If funded, I highly recommend to the proposer to put some of these measurements on his report. ", "q2r": 2, "assessor": "z_assessor_3768", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "A Program where funded Proposers can be matched up with qualified Mentors. To Exchange Information and Experience", "experience": "I am a Student and I was funded in F3, so I know how it feels like to be a student who wants to build something."}