{"id": 419477, "author": "sensemoneyk2", "title": "Cardano Catalyst Schooling", "url": "https://cardano.ideascale.com/a/dtd/419477-48088", "category": 26599, "amount": 1600, "description": "Most of my peer students are not aware of Cardano blockchain and project catalyst so they can not access project catalyst opportunities. Most of peers are intelligent but idle at home after school.", "f6_no_assessments": 23, "f6_rating": 3.6666666666666656, "videos": [], "media": [], "f6_assessments": [{"id": 9715, "q0": "The proposal identifies a clear problem and shows a solution to address this issue. The project is closely aligned with the fund challenge as the proposer is a student that is looking to add value to the Cardano ecosystem through increasing awareness and education among other students. There is clear and concise information provided on the proposals and goals. The proposer has identified that ‘transportation costs when travelling to-and-from meetings’ may be a future risk that could prevent the project from getting delivered successfully and has addressed how they would mitigate this by having ‘meetings online’. This shows the proposer's acknowledgment to scale to address future challenges. The proposal does not provide information on a plan for the project’s future sustainability.", "q0r": 5, "q1": "The proposer plans to undertake this venture on their own and seems attainable as the project is on a relatively smaller scale and shorter duration to complete. Relevant information on the proposer's knowledge, skills and experience is presented and appears to be competent in implementing the proposal successfully – Though I would suggest for the proposer to insert any of their online social media profiles (Twitter or Linkedin) to help give a reference on their background and experience. The budget is outlined clearly and broken down into identifiable items. There is assurance that the project will have some financial stability as the proposer has thought out the allocation of funds. The proposer has made a typographical error with the information provided on the budget as it is written ‘requested amount $1500’ whereas I believe they meant ‘$1600’. Overall, the budget does seem reasonable to achieve set goals. The project aims to continue its venture into educating the 60 targeted students and has provided information on a plan to access additional funding in future project catalyst funding rounds. The information provided on the plan to complete the work appears to be realistic yet presents insufficient information to give clarity on whether the project will be successfully executed. Especially given the knowledge that the proposer will be taking on full responsibility for completing the tasks. It would be beneficial for the proposer to explore breaking up the 2-month duration of the project into weekly phases to give a better understanding of when certain tasks will be completed or when specific goals will be aimed to be achieved. Having a clear roadmap is important to give goals a link to detailed work and a timeframe for achievement, given the project resources and capacity. I would suggest identifying key milestones for tasks – for example, ‘schedule 10 meetings by week 2’ or ‘accomplish 5 signups on Ideascale by 2 months’. This can help maintain a more accurate understanding of how the project is advancing through the initial plan. The plan and budget items state the necessary resources needed to implement the project. Although there is insufficient information describing what they are or how they are going to be used. In regards to the educational materials needed, it is important to describe what type of educational materials will be used to implement the project. Examples of this can be, types of educational print material like textbooks, pamphlets and study guides or audiovisual materials like presentation slides and videos. Given that transportation costs have the largest allocation of requested funds it is important to provide more information to describe this item in the plan. If the proposer will be driving to meetings - hence stating that transportation costs will be for fuel or will the proposer be travelling by bus, therefore, needing bus fare. In addition, providing an estimate of the distance needed to travel would further add transparency to this. Given that transportation costs were mentioned as a future challenge and risk and that pivoting to more online meetings would be used to help mitigate this issue – it raises some concern that the proposer may have under-budgeted for internet data expenses. It may be beneficial for the proposer to explore a cost-benefit analysis to see which decision to make or which to forego. For example, it may be beneficial to reduce the allocated budget for transportation costs and increase the allocated budget for internet data – as it could allow greater leeway for more meetings.", "q1r": 3, "q2": "The proposal provides a roadmap with unclear milestones and time horizon for achievement – it isn’t very well designed, which made it difficult to audit the proposal. The proposer includes metrics that define the success of the proposal. Though it would have given me more confidence in the proposer's effectiveness to track the project's performance if they provided information on ‘how’ they were going to measure each metric they mentioned. The targeted problem and the idea of their proposed solution appear to be well understood. Although insufficient information was shown on how it can be measured against their proposed outcomes – making it difficult to evaluate success. Even though the proposal provides information on an effective solution, the information provided to address the problem with measurable definitions of success was insufficient. The project scope does appear to be achievable, although, with a plan not being detailed, no clear timeframe for achievement set out and an inadequate description of the resources needed to implement the project - I cannot see direct ways to evaluate the progress of results based on what was presented. ", "q2r": 2, "assessor": "z_assessor_3086", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2}, {"id": 197, "q0": "Proposer offers a peer to peer shooling solution to introduce Cardano and Catalyst to a group of schoolmates and colleagues – with the initial target is 60 pax, in order to have their interest in Cardano and Catalyst. \nThis meets the challenge of 'Challenge & Scouter for Students' in particular and Fund9's goal in general 'Prepare a group of people willing and able to make contributions to the ecosystem'. \nOnce they realize the great opportunities from Catalyst, they will have chance to participate as proposers with great ideas putting into life to improve human living standard.", "q0r": 4, "q1": "Proposer has experience working as CA in Fund8 and PA Fund9, should have knowledge of Cardano and Catalyst project. He is a high school graduate with IT skills, that would make his talk on Cardano and Catalyst more convincing. However, I would like to know more about proposer’s profile information/activity experience. He can add social media link facebook /twitter /telegram … for ref.\n\nBudgets are clearly outlined and broken down into identifiable items. Also, proposal with a realistic timetable for getting the work done.\n\nHowever, with the peer to peer schooling format, transportation cost will be the risk as the cost of fuel increases nowadays, it will limit/reduce the number of trips. Proposer should design and enhance peer to peer online talks /zoom meetings (which are also part of the proposal). With the support of technology, more frequent connection will help keep Cardano/Catalyst information up to date and keep newcomers motivated. In addition, the proposer can easily increase the number of members with online meetings.", "q1r": 3, "q2": "Proposer has provided criteria to measure the results of the implemented projects. It would be better to include specific numbers as target, even if it is less than the proposer's capacity, for example: how many schoolmates become Ideascale’s new members, how many people expected to join peer to peer schooling or zoom meetings…. In addition, the proposer can create a social media channel to attract other users and through which the community can audit the proposer's performance.", "q2r": 3, "assessor": "z_assessor_2055", "no_vca": 22, "ne": 2, "ng": 19, "nfo": 1, "vca_o": 1}, {"id": 12959, "q0": "The proposal is about to educate the students about the Cardano eco system.\nit's opportunities in Catalyst so that our lives will be better when we put our ideas into real life projects through catalyst funding.\nThe proposal enhances the cardano eco system's worth. The proposal's primary measurements and objectives fit the described challenge settings.\nThe proposal identifies the problem that has to be solved within the problem. After assessing the proposal, \nI agree  that it clearly meets the challenge because the proposer has detailed the proposal's solution in a very descriptive manner for the perfect execution.\nThe proposer was in previous funding's  and looks very experienced .\nThe proposer knows the catalyst funding works and have a clear approach to achieve the goals .", "q0r": 4, "q1": "The complete strategy, including a schedule and significant checkpoints, has been submitted by the proposal's proposer. The proposal provides a realistic timeframe for completion of the task .The plan outlines the resources required to implement the proposal, and \nThe proposer have also mentioned the experience which is needed to implement the proposal . The proposal has taken into account the challenges and risks pertinent to a successful implementation. The budget mentioned is some what high can be reduced ,But the challenge and the solution to it is great. The proposer have targeted 60 students and has plan to extend this mission in the next round .", "q1r": 4, "q2": "The proposer have described how we can track your progress of the proposal , The proposer have provided clear understandable description  of the targeted problem and also mentioned the approach to the solution . This is complete new proposal,  but the proposer has raised funding from the previous rounds and mentioned that the funding's utilized properly . The proposer have provided enough information to assess the proposal .\n", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12723, "q0": "The Proposal addresses correctly the Challenge Topic of \"Challenge and Scouted for Students\" by providing peer-to-peer education on Cardano Ecosystem and Community to university students.\n\nI find the Proposer's problem and solution are well-presented and straight to the point.\n\"\n\nThe Proposer has demonstrated the values added to university students participating in the Project. The project, if carried out successfully, can bring the below benefits to Cardano: \"\n1. A bigger community of Cardano Participants means better popularity of the Eco-system.\n2. The additional users of the Cardano Eco-system who are students do not only add brain power to the Community but also are the foundation of the Community in the future.\nThe Proposer, however, has not provided a plan to expand his solution beyond his physical boundaries. The Project would be able to attract and educate a lot more students if the Proposer can effectively promote this Project on online platforms and to other student communities.\nI find the proposed Project inspiring and helpful to Cardano's Eco-system and Community. For the above-mentioned reasons, I give this Proposal a 3/5 score for Impact.", "q0r": 3, "q1": "The Proposer has not provided any concrete evidence of his/her ability to carry out this project. There are no LinkedIn links, no websites, no Github presented to the audience. The fact that he/she is about to enter university might interfere with his/her commitment to the Project due to possible time constraints.\nThere is only 1 person on the Project, and this can limit the possible effect, both in terms of the number of students reached and the quality of lessons/presentations provided. I suggest the Proposer involve more team members in the future if he/she gets funded by the Cardano Catalyst Fund, for this kind of community project, the bigger the team, the bigger the reach and effects.\nBudget items are provided in lump sums rather than detailed items. The proposal needs to break down expenses into smaller items for PAs to determine if the budget is achievable and reasonable or not.\n\n\n\nWhile the Proposer was able to mention 1 risk, he/she failed to mention the other major risks associated with this project such as the underwhelming number of participants or a poorly prepared curriculum/learning materials. The Proposer needs to put more effort into locating and mitigating possible risks for better implementation. \nSince Project Executor might not be able to carry out the project successfully, project risk is very high.\nAs a result, I give this proposal 1/5 for Feasibility.", "q1r": 1, "q2": "\"The Proposal has successfully provided a clear timeline with KPI items for the Project. While the Idea might be helpful not for only students in Ghana and for Cardano's Community, the Proposer has not provided detailed quantitative and qualitative indicators on his/her KPIs. There are so many questions to be answered, such as:\n- How many students does the Proposer plan to talk to? (Is the 60 students the number of students that the Proposer plans to talk to in the project, or is it the number of students he/she plans to approach at the later stage of the project (which is not included in the scope of this Proposal)? \n- How many of these students will likely become a Cardano Advocate? \n- How many of these students will likely participate in the Cardano Eco-system and Community? \"\n\n\nThe Proposer has not provided information on how he/she will report his/her expenses and progress once his/her project is funded.\nFor the above-mentioned reasons, I give this Proposal a 1/5 score for Auditability.", "q2r": 1, "assessor": "z_assessor_3470", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12575, "q0": "The problem that needs to be solved here is that most of my fellow students don't know about the Cardano blockchain and project catalysts so they cannot access the project catalysis opportunities. Most of their peers are smart but stay at home idle after school. How it will add value to the Cardano ecosystem: Educate classmates about blockchain technology. Educate my co-workers about cryptocurrencies. Educate them about the opportunities in the Cardano blockchain. Help them register on the range of ideas. Help colleagues open wallets. The goal is to attract students to participate in the Cardano ecosystem. This proposal also aims to educate more of my peers, about 60 in total, through online, online, and small group sessions so that peers know what the catalyst is. This proposal's key metrics and goals are consistent with the stated challenge settings. With this proposal, I believe it is possible to scale up to address future challenges and I fully agree that this proposal effectively addresses the challenge and rate 5*.", "q0r": 5, "q1": "The proponent provides the relevant skills and experience necessary to implement the proposal. Akwasi Agyemang graduated from high school and is about to enter University. He said he is very talented in IT skills and has great ideas on social impact to help young people and has obtained a Ghanaian WASSCE certificate. The proponent has also provided a required budget of 1600 and has analyzed the specific budget needed: Home transportation from August to September 30, 2022, $800.Educational materials $200. Internet Data (myself and my friends) $200. Lunch and Brand T-shirt $300. Other terms are $100. The proponent made a detailed plan with a project duration of 2 months. (Teaching from house to house for a month. Small group video meeting of 6 people at a time. Communicate WhatsApp and Twitter with several colleagues. mine and I will talk to them about the opportunities in Cardano.Constant meetings and calls to entice friends to join). But I find the plan has a few things that are not reasonable, the proponent said that he will teach from house to house for a month, but if it is possible to do this, there must be a lot of participants to be successful. the cost of hiring a teacher is very large, instead I think it is better to open 1 or 2 classes and set up a clear schedule and be able to combine classroom learning and online learning. With constant meetings and phone calls to enticing friends to participate, I think it is not reasonable because it will not be able to attract you to participate but also make you uncomfortable because you are always bothered. Instead, open a conversation and present the project in the hope that you will join in. The proponent has also identified the associated risk and provided a solution to it. I rate this feasibility 4*.\n\n", "q1r": 4, "q2": "As mentioned in the feasibility of the project, there is a roadmap for implementation in 2 months with specific objectives to be achieved according to each defined timeline. The proponent has determined the success of the proposal, and when implemented will bring success The number of colleagues actually logged into the idea round and joined Cardano and became a PA like me.\nThe number of colleagues also became Cardano ambassadors and attracted more people to join the community\nThe number of colleagues who become developers thanks to their knowledge of blockchain and project catalysts, the clarity I value well.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 11393, "q0": "Cardano is a proof -of -stake blockchain founded on peer reviewed research and developed through evidence based methods.  It combines pioneering technologies to provide unparalleled security and sustainability to decentralised applications, systems and societies. Cardano exists to redistribute power from unaccountable structures to margins to individuals and be an enabling force for positive change and progress. Educating peers about cardano and it's opportunities in catalyst to make lives better by putting ideas into real life projects. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project is planned in 2months which includes house to house teaching, online meetings for small groups, WhatsApp and twitter communication  with peers and talking them about opportunities with constant meeting and phone calls. The budget is outlined clearly and broken down feasibly. It is reasonable to achieve set goals. The people working with the proposal are very talented and have great ideas of impacting society to help the youth. The proposal clearly explains technical aspects like language and technologies. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring the actual number of peers contracted who sign on to ideascale and number of peers who actively engage meeting and who express interest in writing proposals. By knowing the number of peers who become cardano ambassadors and who become developers out knowledge of blockchain can predict the success of project. The plan describes the resources necessary to implement the proposal. It clearly explains technical aspects like language and technologies. The proposer has considered challenges and risks relevant to successful implementation. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 11248, "q0": "This proposal does effectively addresses the challenge as the main idea is to educate the proposer's peers regarding the opportunities in Catalyst. The target audiences are University students. It is planned that those individuals can become Community Advisors, Cardano Ambassadors, and/or developers. The aim is to get a total of 60 individuals through door-to-door, online, and small group sessions for students to understand what Catalyst is. ", "q0r": 4, "q1": "This proposal is submitted by a single individual the proposer, Akwasi Agyemang. He is a high school graduate who is about to enter University. In the past, he has contributed as a Community Advisor in Fund 8. He has a WASSCE certificate and says he is very talented in marketing. Based on this alone it is believed that he can educate his peers about the benefits of the Catalyst. As for the success of the proposal, Akwasi suggested that it can be measured in the following means. House-to-house teaching, followed by with online meetings of small groups of 6, then WhatsApp and Twitter communication with his peers where he would share the opportunist in Cardano. Finally, regular meetings and phone calls to get his friends involved. There is one component that is missing in his plan and that is the marketing aspect. For anything to get traction marketing is needed no matter the size. It can be as simple as word-of-mouth during free breaks, sharing information through his personal social media which his peers should have access to, asking the teacher/lecturer for a small sharing session where he can give minor information, and asking those interested to message him. If a degree of marketing is involved in the plan then the success rate would be much higher than it is currently. In addition, the fund requested does not seem to be reasonable. What would the miscellaneous fees be? Why is there a need for lunch and branded T-shirts? These shouldn't be part of the things requested in the funds. Seeing these things makes it feel like the proposer is still unsure about some aspects and is not ready.", "q1r": 1, "q2": "There are several means suggested by the proposer to assess the progress. Such as,  counting the number of peers he has contacted,  who signed up on Catalyst, who actively engage in his meetings, and who express interest in writing proposals. All these metrics are adequate to assess the progress of the proposal. As for the success of the proposal, the proposer stated the followings. The number of his peers who actually sign on to IdeaScale and get involved in Cardano and become PAs, the number of his peers that become Cardano Ambassadors and bring more people into the community, and the number of his peers who become developers out of the knowledge of the blockchain and Project Catalyst. The first aspect can be used as a measurement, however, the 2nd and 3rd aspects cannot be used as means to assess the successfulness of the proposal. Under what timeframe will the proposer assess the number of people becoming Cardano Ambassadors and/or developers? These take time to accomplish and it can take more than a year to accomplish. Overall the progress can be audited but the success cannot be properly audited. ", "q2r": 3, "assessor": "z_assessor_3233", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9981, "q0": "The problem and the solution mentioned in this proposal Is clear and correctly fit.mostly students complete school and sit ideal at homes without doing anything and this idea is teaching peers about Cadano or educating these peers about Cadano ecosystem will help reduce unemployment rate in Africa and also will grow Cadano more. It is widely known that, when taking part in Cadano ecosystem there will also be some opportunities that may come on your way and your life will also develop more. The propose solution answers the challenge effectively and I believe it will lead to success when funded and more people will also be introduced to Cadano. This is why I think it's a good proposal and therefore will help widen up the Cadano ecosystem and will bring more youth into Cadano ecosystem. ", "q0r": 5, "q1": "Experience and interest of bringing more people in Cadano is a great job enough. But I think this should have been a team work but not just one person in impacting knowledge to the society to help the youth. Even though it stated to meet one on one or door to door teaching, there should also be some people that have a great working experience in technology and also have the passion to do one on catalyst schooling. ", "q1r": 3, "q2": "There's a clear description of the challenge mentioned and also there is also a breakdown if the budget needed to help get this work done but I still think there should have also be a great team members since it is stated that one person works on this project, also I don't support the idea of zoom teaching of people because one may had a bad network or one phone may go off and therefore will be unable to help that person received the teaching that day. But if more hardworking if done and more peers are Introduced in Cadano or catalyst will be out from unemployment and therefore is a good idea to involve the youth in Cadano ecosystem. ", "q2r": 3, "assessor": "z_assessor_3140", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9658, "q0": "There is an alignment between the proposal and the objectives of the challenge. It is very valuable that a high school student decides to teach his peers about the operation of the Cardano blockchain and other important issues in the use of cryptocurrencies, such as opening a wallet, this can definitely generate greater financial and technological or digital inclusion in a group of people. However, it can be seen that the approach is very general, since in order to eradicate poverty, the proposed solution is not enough. I consider that the goal of the solution is too bold, too big. Perhaps, it would be necessary for a next opportunity to narrow it down and limit it to more achievable goals. \n", "q0r": 3, "q1": "In addition to what is mentioned in the proposal by the proposer himself, there are no relevant links to social networks or others that allow to verify the aforementioned experience (the only link provided is a referral link to coinbase). Beyond this, it seems that given the knowledge of Cardano, it could perform the proposal presented without problems. The one-to-one methodology chosen is very appropriate to be able to perform the intended educational task. It is necessary to take into account for the next occasion that the detail of the budget should be consistent and that the amounts of the different items should coincide with the total requested (in the first sentence of the detailed budget it can be read usd 1500 and in the other parts usd 1600).", "q1r": 4, "q2": "Although the possibility of counting the number of peers who express interest in writing a proposal could be measured (for example the number of proposals where someone is linked as a referrer) and also the number of people who engage in the meetings is also possible to audit, I consider that the other two ways of auditing are general and lacking in precision (how does the community verify that a person signs up in ideascale thanks to the proposal?). ", "q2r": 4, "assessor": "z_assessor_3079", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8900, "q0": "Most of the students will be having ideas to work with where they can solve the problems faced by their people, but they will always be denied for funding in future, hence to overcome such scenarios, People should be educated regarding crypto and other catalyst programs available in the market, so it will be boost their confidence in building the projects by using cardano's funding , where it'll be helping people around them hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented plan has chances of being successful since it doesn't involve much risk where ,proposer has already worked as community advisor previously, and has good knowledge on how to speak and how to make people understand the importance of caradano catalyst projects.\nThe proposer has plan where he wants to reach home to home and also wants to conduct small meeting through online data hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer could have added more details in detailed plan module on how he'll he choose the right students for this project, and could have added more members in team where more people could have covered more houses, and could have reached more people.\nOther than above aspect the proposer has clear plan on budget breaking and also have good key indicators where he'll try to calculate he's progress each day by reaching maximum number of people hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 13389, "q0": "You are a high school student and about to enter university, this is a very good and highly shareable idea, very useful and practical for students with a background of knowledge and ability to absorb technology. fast.\nAnd especially if you did PA at Fund 8, it proves that you have an understanding of Cardano and the Cardano ecosystem as well as the values ​​that Cardano brings. I really appreciate the values ​​you share with your peers.\nI also hope that your proposal will be funded in this Fund 9 and hope that after entering the university lecture hall, those shares will also be carried and disseminated more widely in the university environment. This makes the expansion of Cardano known to more people and at the same time the Cardano network grows better and more widely.", "q0r": 5, "q1": "At your age, I have not had these thoughts like You, You are quite talented, Your implementation roadmap is also very good initially, I have also seen the budget table for each item, but you should say clearly state the costs for each stage such as: - $ 800 for transportation costs, in which you specify the distance from your house to the house of your peers is the nearest Km, How many kilometers is the furthest, what means of transport do you go to to verify that amount of funding.\nSimilar to other items such as: what are educational materials, and in what form are printed, the more detailed the record, the more reliable it is. And finally, is the budget reasonable with the descriptions above?", "q1r": 4, "q2": "- Quantitative metrics such as the actual number of friends you've contacted, the number of colleagues or Friends with an idealscale account, the number of colleagues actively participating in meetings, and the number of people expressing interest Proposals are indicators for the community to verify the success of your proposal, but should you have a channel to publicize those metrics for easier reference?\n- And your number of friends is currently 60, why not set a goal in 2 months of how many subscribers to have a more specific and detailed number to measure?\nfor example, after two months, 50/60 people have contacted, there are more than 40 accounts registered on idealscale and more than 30 people are really interested by rating (PA) on Idecalscale, .. . and such numbers will measure the success of the proposal more clearly and specifically, that's my suggestion, I like your suggestion and hope it succeeds.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 8495, "q0": "This proposal is aimed to launch a training program to target at least 100 female students, graduates, or young entrepreneurs to become virtual assistants in Project catalyst. I think it’s a very good idea to get female students involved more in the crypto field which is usually seen as something for men. In my opinion, it will deliver a big message to the industry and the equality trend. It somehow addresses the challenge since it aims to affect Cardano with good intentions. However, I haven’t found the idea being presented very well. My question for the proposer is with the trained students becoming virtual assistants, in which way will they impact the system? Or even a simpler question which is how your in-person training works. I understand that it’ll attract more female students in Ghana to the blockchain ecosystem and introduce them to all of the potential opportunities, however, I haven’t seen the impact on other aspects, for instance, how the virtual assistants are going to benefit Cardano or how they are working in our ecosystem. If the program's impact is introduced with more details, I think it would be better for the community to see how much benefit it will bring to the ecosystem. About the difficulty that the team pointed out, I totally agree that it’ll be difficult to get people interested in crypto due to a lot of conspiracy theories about it. And the team’s solution is offering free courses to solve it at the early stage is very reasonable. Other than that, I would want to suggest the team be aware of the accuracy and credit of their courses’ content, and make sure that they come from reliable sources. ", "q0r": 3, "q1": "With a thorough introduction of every team member, the team has shown very strong proof that they have various skills and experiences in education, blockchain and Cardano which can be seen as sufficient for this project. From my point of view, the team has also provided a brief roadmap which includes every task and estimated time for each phase. Those tasks serve the idea well. I think the team can still improve this part a little bit by providing more explanation about each phase. For instance, for planning/ conference scouting, on which platform will the team do it? What aspects are you going to plan? Or for Call for application, how are you getting people to apply? On which platform are you going to receive the application (paper form, email, online form, website, …?) As I could see, your budget breakdown seems to follow closely with your roadmap and it’s a good thing. Hence, with a more detailed explanation of the road map, the community can justify your requested fund the fairest. ", "q1r": 3, "q2": "The key metrics are built closely with the idea’s scope, and it’s a huge bonus point. However, I think the community still needs KPIs for each key metric to audit this project in the future. In the first part of this proposal, the team mentions this project targets a group of about 60 people. So how many people out of 60 will actually sign on to the program after a period of time? How many percentages of the registered people are actually actively engaging in the meetings? And so on. The proposer should work on building time-related KPIs for each key metric you provide. Not only for auditing but also for the proposer himself to keep track of his work’s progress and make a prompt change if needed. ", "q2r": 2, "assessor": "z_assessor_2989", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7389, "q0": "The idea in this proposal which is peer to peer schooling is a brilliant one but unfortunately does not match the goals and objectives of the challenge,we are looking for brilliant student entrepreneurs with innovative ideas but lack the funds to implement these ideas to coach them to put these ideas into proposals and submit via ideascale to seek for funding to implement these ideas and possibly connect them to engineers in the cardano community. The goal here is not just to onboard people onto catalyst to take part in various roles like proposer assessors,veteran proposer assessors etc. There is more to that. I personally believe this  proposal would have best fitted in the grow Africa,grow cardano challenge because per the descriptions in the proposal,this peer to peer schooling is likely to take place in Ghana in Africa. I will advise the proposer to put up this idea in that challenge in the next fund since it meets most of it's goals. With that said,this proposal does not address the challenge effectively though the idea is a good one. ", "q0r": 2, "q1": "For feasibility,I will start with the experience of the team, but from the proposal,we have only one person described,which means the author intends handling this project alone which is quite reasonable to me since the author is undertaking a peer to peer schooling.\nApart from that, I donot justify the experience of the author with the description given in the proposal. The author claims to be a cardano ambassador and a volunteer helper in wada Ghana programs but he did not provide us with any relevant social media links like his LinkedIn, Facebook, Twitter or telegram handle where we can get to see his experience at wada programs or maybe even pictures and images where we can see the author taking part in those programs as a cardano ambassador.\nAgain,there is no clarity in the timeline for delivering this project. We only know the duration of the project will be about 2 months,we do not know what activities will be taking place in each month.\nLastly, the budget is not relatively high,it meets the challenge setting and is totally reasonable in relation to the kind of project the author plans to implement. Based on the experience and the timeline presented to us in the proposal,I donot believe this proposal is highly feasible.", "q1r": 3, "q2": "There is not soo much details for one to assess this project's auditability. The proposer did not tell us how the progress of this project will be monitored directly by the community. We should be able to have some reports of the project at the end of it's implementation and maybe recorded sessions but this is not mentioned in the proposal. Even though the proposer stated a few key performance indicators which I believe are good ways of measuring success of the project,I feel this project cannot be tracked by the community, there are no direct ways of monitoring this project and in essence,one cannot evaluate the progress of this project based on what was presented in the proposal to us.", "q2r": 3, "assessor": "z_assessor_2890", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7122, "q0": "The proposal has a background that being a Catalyst member, whether be it as the PA or proposer, brings economic leverage for students. After contributing to Fund 8, the proposer discovers that they can help their peers earn financial incentives by becoming a Catalyst proposal assessor. If it goes according to the plan, his peers would not only get early influence with Cardano, but it would also help them get to a better state of economic situation. I believe it matches with the challenge settings, as the proposer targets his peers who are getting into university. I am hesitant with the house-to-house approach the proposer used because it creates a huge bottleneck for the proposer to scale his reach. That being said, I agree that the proposal contributes to the Cardano ecosystem, especially Project Catalyst.", "q0r": 4, "q1": "Unfortunately, I am not positive that the proposal has enough information to entail smooth and successful implementation. I can understand that the proposer doesn’t have enough experience considering his age. However, I would like to see at the very least the proposer’s PA (back then CA) profile to judge whether or not the quality of experience is enough for him to teach his peers. I applaud that the budget requested is very detailed and broken down into items. It could be improved by adding further details for each item. For example, what’s the point of the \"Lunch & T-shirts\" item? What is the quantity of them? Another example would be miscellaneous. What is it actually used for?\n\nThat being said, I have to give kudos to the proposer who specified the amount of time and the implementation items in the proposal. The proposer also considered some challenges that might hinder the plan and the mitigation as well. However, I would also like to see the problem of the peers' not having any familiarity with Cardano or blockchain in general solved. Considering that the proposer targets two implementation months and 60 peers, it would take him a day to teach his peers about the basic ecosystem, which might not be enough (this is a risk that should be mitigated).", "q1r": 2, "q2": "I have to disagree that the provided information is enough for auditing. I appreciate that the proposer set a very high target of 60 peers within such a short timeline. However, because the main approach is to use door-to-door learning, it makes it hard to keep track of and document the entire progress. The metrics the proposer used (the number of peers that signed into Ideascale, etc.) are already correct, but a specific number is needed for it to be used as a factor of the proposal’s success. That being said, I am really inspired to see that the proposer has put this much effort into this proposal. I really think the proposer idea would get more nods of approval if the missing details mentioned above were completed and adopted to the online meeting model rather than door-to-door as it helps with documenting and cost cutting.", "q2r": 2, "assessor": "z_assessor_2878", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6401, "q0": "I fail to see how this proposal is anything but a very passionate individual talking to his friends about Cardano. I celebrate the enthusiasm but there is not really a plan or idea behind this proposal other than an expression of will. There's no detail on what the door-to-door nor group call sessions would be about. The proposal also mentions WhatsApp and Twitter conversations as significant activities, but I don't believe they are truly impactful.\nOn another note, the inclusion of a Coinbase referral link in the 'Relevant Links' sections is outright disrespectful to everyone committing their time and effort to assessing proposals in my opinion.\nThe multiple and massive inconsistencies in this proposal make it impossible to take it seriously.\nIn short, I doubt this proposal will truly have an impact on student entrepreneurs situation with regards to Cardano.\n", "q0r": 2, "q1": "The author seems enthusiastic and excited about the proposal, but does a poor job at accurately describing his skills. Being 'very talented in IT,' 'very good at marketing,' or 'having great ideas' needs to be backed by hard evidence/past jobs to be believable, especially coming from a stranger on the internet. For someone asking for $1,600, one cannot simply take their word for it.\nSecondly, the budget seems a bit unrealistic to me. $800 for transportation costs seems outrageous. I sadly don't have experience with Ghana transportation but a simple Google search and calculation threw a result of $224 for 60 round trips (assuming that a ride is needed for each one of the 60 students, which also seems unlikely).\nThirdly, the plan is extremely vague and not detailed at all. It only mentions having individual and group meetings with the targeted students, 'tweeting' and having WhatsApp conversations. There's no mention of concrete educational activities, exercises, what resources will be used, etc.\nTo summarize, I don't see any clear indication that this proposal can be implemented successfully.", "q1r": 1, "q2": "There's no mention of any platform, methods, or publicly-accessible databases that will be used to document the students responses and experience, meaning that the only source of the results is the author of this proposal itself. In other words, the community would have to blindly trust and believe the author if the proposal was successful or not, since there will be no other way of obtaining the information. The proposal also doesn't describe what a successful implementation would look like, instead repeating KPIs mentioned above.\nFinally, the amount of participants or amount of students contacted isn't relevant at all to the success of this proposal, but rather inexpressive metrics (you can make a thousand phone calls and they could all be unsucessfull).", "q2r": 1, "assessor": "z_assessor_2815", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5677, "q0": "The proposer clearly identifies an existing problem that needs to be addressed via this initiative. However, the proponent’s description of the solution to the problem is so generic and therefore requires more details to make sense of what the team intends do. In an African setting, how would a door to door education look like? what is the nature of the educational resources budgeted for? what is the marketing strategy to get onboard the target audience? I see a few lapses here. For instance, the  the proposer provides little information on how the project intends to enable students bring up ideas and shape them into a well-define proposal for funding in the catalyst space. On the contrary, the other perspective of this project is that, i envisage that this could be a starting point for introducing the proposer’s peers to the ecosystem and eventually helping them develop their ideas. Obviously, I appreciate the intention behind this initiative –to onboard more people via education as a poverty alleviation mechanism. On the basis of the questions raised here, i wish the proponent consider streamlining the proposal to reflect these concerns.", "q0r": 3, "q1": "The roadmap for the project lacks sufficient details and clarity on the overall work structure and strategy on how to implement the project. The 2 month set aside for the project implementation does not provide a breakdown of the duration for each activity. The proposer fails to tell us whether the activities listed under the roadmap would be carried sequentially, simultaneously or randomly. A clarity on this could help the community appreciate what would be done at what time within the two month period.  For instance, how would the teaching for one month look like? how many times would an online class be organized? when would phone call meetings be organized and how many times? I prefer a more definite approach to the  roadmap because, for each activity, a budget allocation may be provided. Therefore, in my opinion, the roadmap needs to be more streamlined to improve the feasibility of the project. Again, on the budget allocation, i am not so convinced about the amount allocation to a few items, in my view, they’re a bit overpriced and without a clear breakdown. I would cite few examples here. In the first place, providing specific duration for the house to house teaching could have justify the amount allocated for transport. Then, we could know the transport fee for each day’s (and week’s) house to house teaching. Therefore, the proposer hasn’t justified the need for a transport fee. Again, the proposer fails to tell us what educational resource would be needed for the project to justify a budget allocation for it. More importantly, the project failed to take into account the roadmap for the Fund 9 challenge. If that was done, the proposer could have recognized that funding is in September. Therefore, how does the proposer execute the activities budgeted for without the funding for it? Like i  said earlier, i suggest the proposer restructure the whole proposal to reflect these observations. Finally, the profile of the team is not  detailed enough to support the level of expertise required for this project. Therefore, if the proposer continuous to pursue this project, i suggest he consider establishing networks and partnerships that could improved the general outlook of the team experience.", "q1r": 4, "q2": "Aside the obvious things that ought to be done to align the roadmap with the budget and the overall objective of the project, i consider the metrics provided here very clear and simplified to access the performance of the project. How do we know whether the objective of “…educating more of my peers, about 60 in total, through door to door, online and small group sessions for peers to know what catalyst is all about” as suggested by the proposer has been achieved? Per the project, KIPs like the number of peers or friends who actually sign on to Idea scale , the number of peers who actively engage in meetings and the number of peers who express interest in writing proposals, would adopted to measure how well the project performs, its progress and success. However, the proposer does not indicate how he would update the community on the progress and success of the project and success of the project. I recommend the proposer consider making available such updates to the catalyst social media channels. ", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4791, "q0": "The proposer indicates the problem because his peers do not have information about the Cardano blockchain and the Catalyst project, so they cannot access the possibilities of the Catalyst project, and therefore offers a solution through education. The proposer has an idea to educate peers individually and in groups. A great idea that the proposer mentions is home education! The ideas and goals of this proposal are aligned with the outlined challenge settings. ", "q0r": 5, "q1": "I would love to see who is behind this project. It would be great if the proposer presented himself to the community via social network links so that the community would have a clearer view of who is behind this project. The budget was presented and a budget breakdown was made. The proposer is modest and asks for a modest $1,600 for this project. A plan for implementation was created, which should be realized in real time within 2 months. The proposer states a possible risk, but also offers an adequate solution if that risk arises. ", "q1r": 4, "q2": "A specific proposal in which you go from house to house for two months and do one-on-one education, and the idea is to do online education for smaller groups. The proposer points out that the community will be able to monitor the success of this project through the number of people who will sign in to Ideascale and the number of people who will have interest in writing proposals. ", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3825, "q0": "Having read through this proposal, the proposer wants to educate his peers about Cardano blockchain and the opportunities in Project Catalyst, which is very laudable. He wants to help his colleagues who have graduated but still at home with no employment in his country.\nThe problem statement is clear and concise. The solution provided is also understandable and fits the challenge. \nIn addressing the challenge which is about providing space for student entrepreneurs to showcase their ideas and get them connected to engineers, this proposal has mentioned that the aim is to educate about 60 peers to get them onto a platform, and help them to write proposals with their great ideas, and get them involved in Cardano, and some becoming Proposal Assessors.\nThe proposer has stated the risk associated with the proposal and how to mitigate the risk. The main risk mentioned in this proposal is high transportation cost since he said that he will meet some peers in their homes and do personal outreach to promote Cardano. To mitigate this risk, the proposer said small group meetings on Zoom will suffice.\nWith these facts from a student entrepreneur, I believe the challenge has been addressed effectively, so I give 5 star rating.", "q0r": 5, "q1": "The plan provided by this proposal is quite detailed. From the proposal, the project has 2 months duration with specific activities. Some of the activities are house to house teaching for one month; online meetings of small groups of 6 people at a time; WhatsApp and twitter communications on daily basis and constant phone communications. This is a good plan to get more peers on board.\nThe total budget request of $1600 is reasonable for this project. It has been broken down comprehensively showing costs of transportation, education materials, etc. The highest cost of $800 is budgeted for transportation, which is reasonable and understandable because of house to house outreach as mentioned.\nThe proposer's name is given as Akwasi Agyemang who is a student entrepreneur and wants to fulfill his dreams of helping others gain opportunities. It is indicated in the proposal that he is involved in Cardano activities in Wada Ghana, and was a PA in fund8.\nThe proposal mentioned that future support will be sought from Catalyst because the outreach will continue. \nGiven that the proposer is a student entrepreneur with passion to spread news about Cardano, and the detailed plan and budget presented, it is highly likely this proposal will be implemented successfully. Hence my 5 star rating.", "q1r": 5, "q2": "To track the project's progress, the proposer has outlined a number of metrics such as measuring - the actual number of peers contacted; the number of peers who sign on to Ideascale; the number of peers who engage actively.  However, the proposer did not mention how reports will be sent- whether by google sheets or posting on YouTube.\nThe proposer has said in the proposal that success will be seen in the number of peers who actually become PAs in the end; the number of peers who write proposals and those who become developers and get connected to engineers. All these success stories contribute to Fund9 goals and Cardano's vision in general. \nIt is mentioned that it is a new proposal. \nThis is a laudable project that will scale Cardano and grow the ecosystem.\nI would have given 5 stars but because the proposer did not provide where reports will be sent monthly, I will give 4 star rating.\n", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1127, "q0": "The presenter is a high school graduate about to enter University in Ghana. He contributed as a CA in Fund8 and would like to share his knowledge of Cardano, blockchain technology and Project Catalyst with his peers. \n\nHe believes there are many opportunities for students in the Cardano ecosystem that are left unexplored because of their lack of knowledge about it. His proposal is to educate his classmates and peers about Cardano and cryptocurrencies through one-on-one discussions, small group sessions and online meetings. His aim is to reach about 60 people in two months.\n \nThe proposal is short but to the point and is in line with the challenge of helping students learn about Cardano and its ecosystem thus giving them the opportunity to connect with engineers share their ideas with the world and manifest them into real life projects and income.", "q0r": 5, "q1": "The timeline for this project is two months, during which time the presenter will travel house to house to teach individuals, conduct online meetings and communicate through phone calls, WhatsApp and Twitter to reach about 60 students.\n\nThe budget is clearly broken down into materials, internet access, transportation, branded t-shirts and lunch allowance. It is very reasonable for the task at hand.\n\nThe presenter has past experience contributing as a CA, is a Cardano Ambassador and volunteer with the WADA Ghana program. He seems very enthusiastic about sharing his knowledge with fellow students and should be able to easily reach his targeted number of students.", "q1r": 5, "q2": "The success of this proposal will be measured by the number of students contacted, number of meeting attendants, number of sign ups for Ideascale, number of new PAs and possible proposers for future challenges. \n\nI would like to suggest that the proposer write a full report of his project's result at the end of the two months for voters and auditors to access, for ease of auditability and as reference for future funding. \n\nThis is a nice initiative and I personally think it should be encouraged. Who better than students and young people to teach their peers about Cardano and its ecosystem? \nGood luck to you!", "q2r": 4, "assessor": "z_assessor_2207", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 1068, "q0": "I have actually enjoyed reading this proposal. From all the proposals I have reviewed so far since Fund 5, and there are a few of them,  the sense of honesty, ingenuousness and passion that transpire, are unique and enthusiastic.\nThe proposer is a high-school graduate from Ghana who has been involved and rewarded in Project Catalyst as a CA (now PA) in Fund 8 and now, after witnessing the possibilities that have opened up for him, he has come up with this proposal in Fund 9. In it, he plans to go door-to-door to all his 60 high-school peers and present to them Cardano and Project Catalyst, the success he’s had so far in reviewing proposals and submitting proposals and convincing them to join as PAs, as well.\nConsidering the challenge the proposal is submitted in, I think it is very well suited, as it will possibly attract numerous passionate students. Considering all the details he has provided us with, I have confidence that the impact it can have on the Cardano and Catalyst community is very positive.", "q0r": 5, "q1": "The proposer has carefully considered several aspects for the implementation of his proposal. He has 60 peers to convince, but going door-to-door to each one could be a lot, so he has also considered having online meetings with some of them, as well as using WhatsApp and Twitter for non-live communications. The budget he has presented is very reasonable and also very comprehensive. It includes a transportation budget of $800 for 3 months, educational materials, and internet data - a very important aspect in Africa that would allow him to show live what is happening in the community, and also, like every promotional event that takes itself seriously: branded t-shirts.\nConsidering his age, I have obviously not expected any LinkedIn profiles, but I must say, I really appreciate the fact that he has given his full name and written an ample paragraph describing his skills and past experiences, not only from Catalyst, but also in general, proving that he has sufficient technical skills, but also that he can be a good marketer and combined with the fact that he knows his peers well, he will know how to approach his presentations in a genuine manner.\nAs such, considering all the information the proposer has provided us with, I see no impediment in the implementation of this proposal.", "q1r": 5, "q2": "Even though at first hand, the metrics for this proposal might seem straightforward, the proposer has given a lot of thought into it and has analysed all the ways he could measure the progress in regards to convincing his 60 colleagues to join Project Catalyst. He will be monitoring how many of them join Ideascale, how many will write proposals etc. The same applies to the success part of this section, the proposer sees a clear path, it is not just the number of peers who sign-up to Ideascale, but also the number who become PAs, developers or otherwise just involved in the Cardano Community. Perhaps, the only missing detail that might have escaped him, is a place for the community to independently view all these described metrics. Either a webpage, a discord channel or even GitHub. But, I do not see this missing information as having too much of an impact on this proposal, as such, I will only leave it here as a piece of advice and won’t be deducting any points.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 692, "q0": "This type of proposal is a great example that with a simple idea, easy writing and creativity, can be combined with a challenge that is of concern to the Cardano community. The proposal is aligned, both in its form, budget (and even a larger amount could be allocated to generate more meetings or those of longer duration each of them), and also in generating the engagement that the Cardano ecosystem wants.\n", "q0r": 5, "q1": "The proponent declares with reference to spending time in the community (from Fund 8), and has participated as a volunteer in Wada Ghana as a Cardano ambassador. What I strongly suggest is that the proponent can check the link that I attach in the proposal since it is a referral link to Coinbase, something that really has nothing to do with the proposal. I think it was a copy & paste error. Once that point has been reviewed, the proponent should leave some external reference to verify their experience. Regarding the plan, although it is not complex and easy to understand and is also aligned with the objective of the challenge, it is recommended to add one last task to generate the closure and the conclusions within the stipulated 2 months.", "q1r": 3, "q2": "The KPIs of this project are clear and auditable since tools such as WhatsApp and Telegram will be used to carry out the activities, and provide help and support in case of doubts and the progress of each student. An external collaborator can join to evaluate and accompany. I recommend creating a blog with a summary of each meeting to share the evolution of the students who participated and then evaluate if it has sparked interest in participating in the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2118", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 7727, "q0": "The proposal flows really smoothly and it’s easy to understand how it addresses the challenge.The Scouted for Students challenge aims to engage students in the Cardano ecosystem. Additionally, this proposal aims to inform more peers—60 in total—about what catalyst is all about through door-to-door, online, and small group sessions. This proposal thus effectively addresses the issue. When people are made aware of the prospects provided by the Cardano Blockchain, their quality of life will improve. Since the proposer was a CA in Fund8, he can provide them the option to take advantage of it and become CAs as well.", "q0r": 5, "q1": "I am very confident that this proposal will be carried out successfully based on the facts supplied by the proposer. He contributed as a Community Advisor in Fund8 in the previous segment, where he did pretty well and received some rewards. The budget is well-defined, and the expenses are reasonable. Also The proposal's author's request for $1600 USD in funding and a breakdown of all potentially calculable costs appear realistic and necessary to attaining the aim. However, since there is only one team member, I'm unsure if he would be able to accomplish the success without much difficulty, thus I choose to award a score of 4.", "q1r": 4, "q2": "Full disclosure is proposed, and the project's key performance indicators are outlined in detail, made simple to grasp, and quantified with precise figures. To make it simpler for the community to monitor progress and more precisely assess project success, I advise setting deadlines for the accomplishment of milestones and results.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 14840, "q0": "The idea of the project is not necessarily bad in general, yet maybe the phrasing isn't great and there are many details that should be explained and enhanced. Above all else, for the proposed arrangement, the proposer mainly focuses on supporting knowledge and registering ideas. This will ensure that the participants will have a good grasp of the necessary knowledge for a proposal. Nonetheless, as of now, the creator has not given a lesson plan for each part. Proposer makes reference to showing companions blockchain innovation, digital currency, and open doors in Cardano blockchain yet doesn't determine what each part will cover, hypothesis, practice, or essentially answer participants' inquiries concerning the Cardano ecosystem. In the event that you assume the part of an educator without a strong and complete illustration plan, it will be hard for the proposer to confer information to others.\nIn addition, the proposer has set a clear goal of estimating about 60 people who will participate in this project. This is a generally good idea since it not just spurs the proposer to finish what has been set out yet in addition assists the project make a good impression on the voters. Be that as it may, 60 is definitely not a modest number and at this point, I have not seen the extraordinary elements of the project. So it appears to be extremely challenging to draw in that numerous members.\nThe challenge is anticipated to be about movement costs on the grounds that the creator utilizes a house-to-house showing technique yet the solution is piece dubious. As of now, the circumstance of web-based learning is exceptionally evolved, on the off chance that you are worried about the issue of high transportation costs, you can instruct through Zoom or other internet education applications. Or on the other hand, the proposer can make an appointment with the participants to stay at the school after each session and teach them directly there.", "q0r": 3, "q1": "There is quite a lot of work to be done in this project and it seems that 2 months is not enough to complete what the proposer has set out. Moreover, the author mentioned a detail that is online meetings of small groups of 6 people at a time but did not say what the content of that meeting was. Will it be used to summarize knowledge after lessons, is it a group study session or a test?\nAmounts to be spent in general have been stated quite clearly and clearly with a rather modest figure of only $ 1600. And as far as I can see, each purpose of spending money is also suitable for the given fee. However, the author mentioned 2 items including Lunch and branded t-shirts and Miscellaneous that I did not understand what it was. If the author intends to gift participants with branded T-shirts or pay for your own lunches, it is necessary to specify more and what other expenses include.\nFinally, I really admire the proposer because you are just a high school graduate and preparing to go to college but already have a lot of experience. But it seems, it will be difficult if you are the only one to teach 60 people in just 2 months. Therefore, find other friends with the same passion, to share the work and not be overloaded.", "q1r": 3, "q2": "The author has clearly outlined the successes that the project is aiming for as well as the project's operation progress. It's pretty clear and coherent. However, the specific number of participants is not available, and so is the time to complete each task. If you simply write briefly and list the ideas, it will be difficult to get the attention and approval of the voters. In general, this section still needs to be researched and added to some important ideas so that the project can be carried out as soon as possible.", "q2r": 3, "assessor": "z_assessor_4104", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "My idea is to educate my peers about Cardano and it's opportunities in Catalyst so that our lives will be better when we put our ideas into real life projects through catalyst funding to avoid poverty", "experience": "In past section I contributed as a Community Advisor in Fund8, and I performed really great and earned some incentives. I am a high school graduate just about to enter the University. I have WASSCE certificate from Ghana and I am very talented in marketing and will add more peers"}