{"id": 420145, "author": "gentner.eva", "title": "OxBAT Conference Oxford University", "url": "https://cardano.ideascale.com/a/dtd/420145-48088", "category": 26599, "amount": 11820, "description": "Interdisciplinary exchange between academia, industry, and its participants is lacking, also in the NFT space. Students often don't have access to future peers and are left alone on their path.", "f6_no_assessments": 11, "f6_rating": 2.7878787878787876, "videos": [], "media": [], "f6_assessments": [{"id": 693, "q0": "As I read through the proposal, the idea seemed like a good fit with the Challenge until I got to the budget section. The Challenge underlines twice that the budget limit is very important to the point of being the exclusive condition. It exceeds it by more than double, which invalidates the entire proposal. Therefore, the proposal does not fit the Challenge. I suggest reviewing the activities of the proposal, taking them online and at most a small face-to-face part that can be resolved within the budget limit. ", "q0r": 2, "q1": "The experience of the team and the plan are well thought out and developed. They have \nexperience in Fund 8. What really surprises me is that they miss the budget limit of the challenge since they have previous experience. The proposal as it stands cannot be implemented satisfactorily. I suggest taking the proposed changes from the previous point to resubmit it with the necessary adjustments.", "q1r": 2, "q2": "The way to measure the progress of the assembly of the event in connection with the activities and participants is well described. But it would be necessary to describe how to measure the success of the event. As a suggestion, I would add a post-event satisfaction survey to have an audit of the participants' points of view for future improvements. They may have some variations when reviewing the proposal, adjusting it to the budget, and changing its format.", "q2r": 2, "assessor": "z_assessor_2118", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 3161, "q0": "The Campaign challenge really puts students in direct focus. This proposal on the other hand, puts students as an afterthought, mentioning that the event is located at a University, and is \"open\" to students. This hardly seems like an effort that is explicitly by or for students. I don't doubt that some exposure to students and networking or educational opportunities for students might result from this, so I'll give it three stars. For more than that, I would need to see students closer to the heart of the project - for this campaign.", "q0r": 3, "q1": "It seems that this proposal is really just asking Catalyst to sponsor food and drinks for a conference that was already funded in F8. I rather wish they had included their refreshments budget in that proposal rather than doing it later, in a campaign that is not a good fit. This makes me wonder what else may have been missing in initial planning, or undisclosed, so I have removed one star. Beyond that, I trust that they would indeed buy food and drinks with this money, as described in the budget.", "q1r": 4, "q2": "This proposal seems mixed up in many ways. It reads as if it's a stand-alone proposal for a conference, but it's not, its a bid for a refreshments budget. I would have wished to see that clearly explained in the impact statement, and reflected through to the auditability statement. Perhaps something like: We are having a conference, funded in F8, and we want more students to come! One great way to do that is to offer free food and drinks, or maybe have a special student reception with refreshments. Auditability consists of showing X# students registered for the event and showing food receipts. This would at least seem more intellectually honest, and frankly I'd support it!", "q2r": 3, "assessor": "z_assessor_2404", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3503, "q0": "As a teacher at formal (college, university) and informal levels, it is evident the degree of specialization and the high academic level that the proposal can offer to students.  There is no doubt that this proposal is in a position to nurture the minds of young people and raise their knowledge about NFTs and Blockchain and activate in them their instinct to connect with others around topics of common interest and under the guidance of experts in the subject areas of study.  The proposal is an academic and working group formation experience in line with Cardano's purpose of providing the general public with the necessary information to interact with our ecosystem (names as important as Mateja Sela, co-founder of Artano, assure that this will be the case).  Undoubtedly, a suitable proposal from every point of view FOR students.  Unfortunately, the problem with this proposal is that it is not one BY students, and therein lies a fundamental difference that makes this proposal fall outside the guidelines specified by the Challenge in which it has been enrolled, the Challenge \"Challenge & Scouted for Students\", and that is why I must sadly remove three stars from its rating. This challenge has clearly stated the type of participants that can be involved in it: high school or university students, still studying, who have ventures seeking financial support and a space to expose their skills to specialized members of the community. I quote (excerpted from the Challenge information) \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students.... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section). Therefore, it is clear that the proposal does not fit this Challenge, regardless of its intention to provide quality education to students.  In my experience, this kind of specifications that apparently ban the free participation of a large number of members and their talented educational initiatives to give entry only to active students and their projects, is not only valid but necessary at a strategic level, and that is what the community in general should understand and protect: these types of spaces are playgrounds that like Cardano, allow us to incubate a whole new generation of developers, creatives, innovators with a mental model that is in direct contact with what is happening in the world (unfortunately, we experienced non-students lack that special condition), a generation that is an integral part of our secret weapon when it comes to long term goals like existing and being around for the next 100 years (statement by C. Hoskinson). Providing capital, guidance, a space for experimentation and failure, is standard procedure.  In short, the message this Challenge conveys is clear: let the students do their own thing, even if it means giving up doing things for them, at least for this time. ", "q0r": 2, "q1": "The way in which the proposers address the implementation plan, budget and team experience sections is an example of elegance and professionalism.  A clear picture of the event jumps to the reader's mind almost immediately, which could possibly have a positive impact on the efficiency with which project performance measurement procedures are carried out during project execution. Unfortunately, there are two aspects to consider that lead me to lower the final rating by two stars (one star for each aspect): 1) the budget far exceeds the maximum allocation of $5000 usd per project.  2) the proposal is competing in a category that does not correspond to it, therefore, according to the Challenge guidelines, its execution will not take place in a space where it can do so.  I have no doubt that in future funds the proposers will find the appropriate category in which they can put their skills at the service of the community.   ", "q1r": 3, "q2": "To be honest, the wealth of information provided in the Feasability section is not consistently employed to generate solid KPIs or metrics that clearly determine what is going to be measured as an outcome at the end of the tunnel.  It is clearly stated in the general submission guidelines that KPIs do not necessarily have to be quantitative formulas that generate a numerical result, they can also be qualitative measures.  However, their qualitative character must allow the extraction of information that can be processed to finally establish a state of project performance.  Unfortunately, as a project evaluator, I do not find a firm column to grasp at the measurement level, which is why I have to deduct 2 stars from the final rating. In short, the KPIs could be further elaborated. ", "q2r": 3, "assessor": "z_assessor_2462", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4688, "q0": "The well-defined problem of the NFT space's lack of interdisciplinary exchange among academia, industry and participants is one that needs to be addressed in this challenge. Students often do not keep up with their peers and are left on their way to learning which is a problem for this project. This problem is solved by organizing the OxBAT Foundation, which is an academic cross-chain NFT conference at the University of Oxford that brings together students, scholars and industry experts from diverse fields. solve the above problem. Help your students keep up with you. The risk in this challenge is the allocation of time and resources to this preparation. Therefore, the author of this proposal desperately needs funding from outside sources. This is a great project it meets the criteria of the challenge I believe with this challenge if the project is funded then success will come to them.", "q0r": 5, "q1": "The well-defined timeline they held the conference started months ago. And they always do with the action points outlined in the present. The working time of the group is thangs7, August and September. This timeline is completely reasonable to be able to complete the proposed schedule. The goals are specifically listed by the author for each month. To successfully organize an OxBAT conference involves the following steps: initiate exchanges between students, scholars, industry professionals and artists, emphasizing the importance of interdisciplinary exchanges, also in different chains , a powerful concept that embraces and reflects the diversity of the NFT/cryptocurrency space, with speakers and guests from different blockchains, research fields, and different levels of expertise, Cardano is the representative representation of a sustainable blockchain, investing in future builders and thinkers. All of these steps are relevant to the success of the project. The problem is solved through organizing as it is being held at Oxford University and it will be open to students from here as well as other universities.", "q1r": 5, "q2": "Metrics are clearly defined through weekly meetings, they also spend a little time outside talking about work. The team regularly updates conferences on Twitter and the team regularly exchanges work with each other to help the project grow. The team consists of 7 key members the author seems to be very experienced in the related issues and has a strong background. The author states their names, what each person has done, they talk about their previous experiences. The team includes :Eva Gentner an art historian exploring the intersection of art, blockchain technology and community, Mateja Sela who connects the worlds of fashion, technology and art with Web3 and NFT, Joshua S. Bamford musician, psychologist and academic nomad, David Hochhauser an anthropologist and digital artist interested in the new frontiers of both fields, Aonia Traxler a passionate Web3 engineer promoting open and inclusive economic models through cryptocurrencies and NFTs, Fabienne Saurer is a cultural anthropologist who studies fan communities, Josiah Thiagarajah is an engineer exploring how blockchain works. The funding for this project is $11.820 less than 20% of the total challenge budget. The author's budget is divided into reasonable expenses: The author divides the budget into 3 main meals: lunch, coffee and tea, and dinner drinks. The payouts are up to the challenge. With the required capital of this proposal and with the distribution of the project's expenses, I find this to be a reasonable expenditure to successfully implement the project.", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 4794, "q0": "\nThe proposer states the problem that interdisciplinary exchange between academia, industry, (also NFTs) and its participants is lacking and offers a solution in the form of conferences. The team's idea is for Cardano to sponsor sandwiches, drinks and coffee between lectures. It would be good if the team elaborated or at least mentioned how this whole story will add value to the Cardano ecosystem. Maybe to have a lecture on Cardano or to introduce Cardano to students? We can say that this proposal with its key metrics and goals is aligned with the challenge setting but when we know that on this conference they will not present and talk about Cardano, I do not agree with this kind of proposal!\n\n", "q0r": 2, "q1": "It would be good if the proposer presented the team and the necessary skills, knowledge and experience through links via LinkedIn, Twitter, GitHub so that the community could get an insight into the people working on this project. Budget is focused exclusively on food, drinks and coffees, it would perhaps be good if the proposer explained how the people at the conference (proposer claims there will be 150) will know and get to know Cardano? At the moment, preparations are underway for the conference that will be held at the end of September, so we can say that there is a plan and organization of the conference, which unfortunately has nothing to do with Cardano. The idea itself is great but I would like to see presentation about Cardano and the Catalyst project on the conference. Maybe on the next conference? That would be great!", "q1r": 2, "q2": "A roadmap with milestones was presented together with KPIs through which the community can monitor the development and success of the conference held in the month of September! In general, this idea is good, but I would like to see, as I already said, that something is said about Cardano at that conference! Or at least to make small Cardano flags and stick them in sandwiches + a small brochure about Catalyst project would be great too!", "q2r": 2, "assessor": "z_assessor_2616", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6038, "q0": "This proposal does not effectively address the objective presented by the challenge.\n\nThe proposal is to organize an OxBAT conference to create a discussion between students and industry experts. This goal, however, is the exact opposite of what this challenge sponsored. This challenge will fund proposals from a community of students with business ideas that grow on the Cardano blockchain instead of sponsoring proposals that mediate between students and professionals. This proposal is unnecessary and it wastes time and effort for the implementer. While the implications of this proposal are good, I think the proposal should be submitted to a more appropriate challenge.", "q0r": 1, "q1": "I think this project is not feasible. Because the budget criterion was violated. Proposal is asking for a budget of $11820, exceeding the $5000 limit for each proposal in this challenge. Therefore the proposal has been violated and will not be approved in this funding round. I suggest that the cost as well as the plan should be rebalanced to better fit the goal of the challenge. In addition, an implementation roadmap is quite general and does not specify how each work will be implemented. They are pretty vague! I suggest that the implementation plan should be more detailed so that the community can clearly see the roadmap that the project will implement.", "q1r": 1, "q2": "I do not agree with the information that the proposer provides to perform an audit of this project. The member information has only been cited for Ms.Eva Gentner, the rest of the members, although I have carefully looked at each link, but none of them direct me to the profile page to check.Also , lack of specific metrics to measure each job completed, and lack of KPIs to show that the project is successfully implemented. I recommend the proposer to clarify this information to increase the persuasion to the community and also increase transparency for the project.", "q2r": 2, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 6403, "q0": "Unfortunately, this proposal asks for more than double the maximum budget allowed in this challenge. I feel like if the author(s) read the terms thoroughly, some adjustments could've been made to make this possible. Sadly, that is not the case. That said, in order to ensure a fair voting and prevent granting any proposals with more than the allowed budget, I feel obliged to give this a 1-star rating.\nHowever, I enourage the author to return in the next fund, read challenge terms carefully, and draft new proposals accordingly.", "q0r": 1, "q1": "Even if granting the maximum $5,000 permitted for each proposal in this challenge, that budget would only cover beverages and drinks (according to the proposal's detailed budget). Additionally, relying on external funding is specified as a risk to the proper impementation of this proposal.\nWith that in mind, and able to grant this proposal only ~40% of the necessary funds to implement it, there's no other option than giving the feasibility of this proposal a 1-star rating.", "q1r": 1, "q2": "Like other proposals out of the permitted budget, the lack of feasibility leads to the impossibility of auditing and measuring the results of this proposal. Unfortunately, you can't measure something that isn't doable in the first place. For that reason, I have to give auditability for this proposal a 1-star rating.", "q2r": 1, "assessor": "z_assessor_2815", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6816, "q0": "As we all know Cardano is built based off of Education, review and resaerch. However, interdisciplinary exchange between different academic fields and industries is important. The proposed idea is to foster interdisciplinary exchange of ideas between students in oxford university and other institutions on ideas and topics around blockchain and NFTs. These will eventually bring students from different disciplines to discover applications of blockchains to their field of study.", "q0r": 4, "q1": "The timelines provided clearly identify a unique, objective and realistic timetable for implementing the idea. According to the timeline, some preparations have been implemented/started already e.g publishing of call papers, outreach to speakers, applications review although, i was equally provided with a (verified) link that confirms same. Requested budget amount is reasonable and fair with a proper breakdown that respectively add up. However, the proposer does not mention exactly how the project will have an impact to our blockchain. These information can simply and effectively be commucated if the proposer had outlined how topics of discussion will be chosen. I suppose that topics are chosen that will have much to do with our (Cardano) Blockchain and network. \nInformation about core team is righlty provided and even though i am yet to confirm how it will directly impact our blockchain, i still believe the team can deliver the project (due to already implemented work).", "q1r": 4, "q2": "The timeline provided is well structured to allow for easy auditability. Further metrics were provided that also make the proposal clear and suitable for audit for example, team will have meeting on weekly basis to discuss weekly progress, ensure set deadlines are met and there'll be regular progress report to direct community on twitter which i think are valuable metrics to track progress. I was also presented with satisfactory KPIs for evaluating success.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 10075, "q0": "- A project proposal to open cross-chain NFT conferences, bringing together students, academics and other disciplines, organized at the university for research in the fields of blockchain and NFT.\n- But with the topic F9: Challenge & Scouted for Students is to provide and sponsor directly for students, not open seminars. And I've tried revisiting the issues your proposal still hasn't met, such as planning issues and student-oriented detailed roadmaps.\n- I have a little advice for you guys to spread the knowledge about Cardano blockchain to students and open contests or give scholarships to students, students can create potential attraction. cardano's ability to develop and contribute to the student's spiritual gift. This will be very helpful.\n- I disagree with the impact of this project.", "q0r": 1, "q1": "- Regarding the plans, you still have not raised the issues related to Live Support as well as bringing knowledge about Cardano blockchain to the students.\n- With a total investment of 11,820 USD according to the information you gave, I only see you organize breakfast, lunch, and dinner meetings, completely without a detailed plan of development goals. student.\n- Project members lack professional information and experience.\n- I disagree with the feasibility of this project.", "q1r": 1, "q2": "- You need to state the KPIs that need to be measured as well as the planning issues in more detail to facilitate project tracking.\n- Please provide full proof of each project member such as GitHub Linkedln or Twitter link to increase transparency for a project.\n- You need to reconsider the issue of funding 11,820 USU is too large compared to the topic F9: Challenge & Scouted for Students\n- I do not agree with the audit of this project.", "q2r": 1, "assessor": "z_assessor_3146", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 11255, "q0": "This proposal does address the challenge as their main focus is to conduct an academic cross-chain NFT conference at the University of Oxford where they can bring not only students but also academics and industry experts from different fields in an open forum where there will be an opportunity to introduce,  discuss, and actualize projects and research questions, to grow networks and create fertile soil for their subsequent success. However, they will have ticket sales. The funds they need would be required for catering for the event. This is an issue that needs some light sheded upon. Is there really a need for a fund? If so is it reasonable that this fund be used for catering services? These are some questions that have raised as going through the proposal. There are many other proposals that utilised the funding for more suitable means. ", "q0r": 4, "q1": "There will be seven people in this project. They are all absolutely well put together to tackle said project together. There are digital anthropologists, artists, wed3 engineers, cultural anthropologists, and more. With their background and experience, they can most definitely tackle this project successfully. Their plan is well throughout and has been in motion already prior to this proposal. They have all the aspects covered for the organization of the conference. Thus, they have a high likelihood of implementing this project successfully. ", "q1r": 5, "q2": "The auditing of the progress given in the proposal is high sufficient as they are giving weekly meetings regarding tracking the progress, deadlines, regular updates on Twitter, Catalyst reporting and the hiring segment as they are hiring people for designated roles we see they are progressing. The audit of the success given in the proposal is rather vague and hard to measure. The team might want to look into the after-event survey, this would help access the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 13417, "q0": "The proposal is requesting funding for the meals and drinks served during the conference. The thought is that informal activities such as eating and drinking will allow students a better chance to network with each other and with teachers and industry experts. The goal of the challenge is to help student entrepreneurs, in particular engineering students, to gain start up funding through Project Catalyst proposals. Further, it wants to promote the connection of professional engineers with students to create new teams for future Catalyst proposals in support of the students’ innovative ideas. In contrast, the OxBAT conference is mainly about art, sociology, and NFTs, a explained in the conference’s description online, “As the first multi-disciplinary conference on the aesthetic, social, and anthropological perspectives on blockchain art, it will bring together social scientists, art historians, artists, curators, blockchain developers, and others in an open forum. The focus will be on encouraging interaction and networking between those interested in studying or working in this space.” While open to all students, the conference does not appear to focus on engineering or entrepreneurship, albeit with some involvement of block chain technology. The proposal does provide a way for students to network with more experienced mentors, and so would meet the “scouting” goal of the challenge in a broad sense. On the whole, the project mostly meets the sense of the challenge, if not all the specifics of it.", "q0r": 4, "q1": "According to the proposal, the conference planning appears to be highly organized and can draw on the team as well as the resources of the university. Therefore, there is no reason to think that the proposal to provide food and drinks during breaks will not be successful. The cost breakdown for the entertainment expenses is quite reasonable. Many opportunities will arise during these breaks for the students and older participants to meet and discuss their thoughts about the various conference topics, and to make important network connections.", "q1r": 5, "q2": "Unfortunately the proposal’s information relating to the audibility of its progress falls short. What is given addresses the progress and goals of the conference itself and reasons that the organizers must stay on track. There is one mention of this proposal’s goal of initiating an exchange between students and academics, experts, and artists as one of the measures of success. However, there are no metrics given concerning the break entertainment planning or the amount of networking that might take place. Presumably during and after the conference the team could report on these events in a subjective way via the Twitter reports mentioned in the proposal.", "q2r": 3, "assessor": "z_assessor_3624", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Organisation of OxBAT, an academic cross-chain NFT conference at the University of Oxford, that brings together students, academics, and industry experts from different fields in an open forum.", "experience": "Eva Gentner: post-grad at Oxford University; organising OxBAT Conference: bridging academia and Cardano; partner programmable.art; engaged with CNFT space; ADA Café host & contributor.\nMateja Sela: CEO, product lead and full-stack developer Artano; engaged with CNFT space."}