{"id": 421675, "author": "tduneau", "title": "Fund Winner Marketing Logos", "url": "https://cardano.ideascale.com/a/dtd/421675-48088", "category": 26599, "amount": 5000, "description": "Catalyst fund winners do not have ready-made visuals to showcase their win. Catalyst does not make the most of winner’s communication to the outside world.", "f6_no_assessments": 8, "f6_rating": 4.291666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1080, "q0": "While I really like the idea behind this proposal, of creating visual marks in the form of logos, banners etc. for Catalyst funded proposers to help them identify and differentiate themselves, I kind of feel it’s missing some details to better complete the driving concept behind this challenge, namely to ”encourage engineers to scout students who are evaluated by the community and create a new team to join the next Fund with a clear Roadmap”. I can definitely see the impact this proposal can have on past and future funded proposers and I appreciate the style of the artist and consider it to be a good fit for the Catalyst community. But, I would encourage the proposer to think about the above quote from the challenge brief and see how she can better fit her concept with it.\nOtherwise, I feel the idea is well articulated and can be easily and successfully implemented in the allocated time, and the imagery she could provide to the Catalyst community could indeed produce a better sense of cohesion and accomplishment. Since I feel it doesn’t perfectly align with the driving concept of the challenge brief, but otherwise consider that it could positively impact the Catalyst community otherwise, I will give it a score of 4.", "q0r": 4, "q1": "What I most appreciate is the fact that the proposer has taken into account a way of incorporating the Catalyst/Cardano community into her design process, thus making sure that the work she will be putting in, will receive the approval and opinion of the community for whom she will be creating for. She has mentioned the creation of a poll, after the drafting phase will end and through it gathering the necessary feedback before she starts adding all the refinements and finishing touches to her designs. Besides the artwork that she will be uploading in several file formats on GitHub, she will also be uploading the necessary code snippets that would allow for their easy integration on websites.\nAs an artist myself, I find the presented timeline and budget to be feasible and reasonable. Since the artist is planning to animate the artwork, it makes perfect sense for her to subscribe to the Adobe Creative Cloud Suite, which will be offering her all the needed apps to complete her task in the 3 months allocated. She has also carefully thought about a small amount to accommodate the feedback period, which denotes good planning from her. And as an artist, I can say that she has the ability to produce artwork suitable to the Cardano/Catalyst community that will look not just professional, but will also probably be pleasing to a large part of the community.", "q1r": 5, "q2": "I feel the contributions the proposer will be making to this proposal will be easy to monitor, especially since she will be uploading the images (drafts, retouched artworks) on GitHub, a perfect place for checking on a project’s progress. For this specific proposal, I don’t see any additional processes needed for its completion, the provided information seems to me to be sufficient.\nI also agree with the statement of the proposal’s success answer, her project will be considered successful if the funded proposers will adopt the images she will provide and use them on their websites or on their social media channels.\nAs such, I completely agree that this proposal can be easily audited by the Cardano community and will give it a score of 5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1, "reply": "Thank you for your comments and feedback. In response to your comment on the impact/alignment section, perhaps adjusting the brief to include a special 'student' category or tag could help student winners stand out, making them easier for others to scout such members out for future projects."}, {"id": 4802, "q0": "This proposal highlights the problem that Catalyst fund winners do not have ready-made visuals to showcase their win. Catalyst does not make the most of the winner's communication to the outside world. The proposer of this proposal is a student who claims that she will Create logos and visuals for selected recurring categories and overall funds to allow winners to showcase their success and help spread awareness of the Catalyst ecosystem. We can say that this proposal is in align with the challenge settings only because it is implemented by a student. If the project were to be implemented, it would have an impact on the Cardano ecosystem as the proposer himself states", "q0r": 4, "q1": "Through the links presented in the proposal we get an insight into how this project is being worked on by one person/student who has all the necessary skills and knowledge to realize this project without any problems. The proposer presents and elaborates a reasonable budget and a budget breakdown is made. The proposer has worked out a realistic time frame within the project will be made as well as a plan for the realization of the project itself. The plan also presents the technical aspects that are necessary for the implementation of this project. Possible challenges and risks that may arise during the implementation of the project are listed and solutions are also offered. ", "q1r": 5, "q2": "A roadmap with milestones was presented, but I would like to see when the project starts and ends. Maybe to create a time frame by weeks or months?! The project starts in Q4 2022 and ends in Q2 2023. Through the KPIs presented, the community can follow the development and progress of this project. ", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1, "reply": "Thank you for your comments and feedback. In terms of specific dates for the project's completion, the intention would be to begin once the assessment for this round of proposals ends, following the roadmap provided, so the end date would be 3 months after the funding has been decided for the project."}, {"id": 5097, "q0": "The Challenge goal  is to encourage engineers to scout students and create a new team to join the next fund. It is in essence a Challenge to provide Student Entrepreneurs a way to get their ideas out into Catalyst.\n________________________________________________ \nThis $5,000 proposal is to create logos and visuals to allow students to show off their achievements in an attempt to showcase Cardano.\n------------------------------------------------\nMy suggestion to the Proposer would be to read the Challenges and fully understand what the parameters are. This Challenge is about helping students to develop their concepts and not in showcasing their success.--------------------------------------------------\nMy assessment of this proposal is a 2( disagree that it effectively addresses the challenge)star. ", "q0r": 2, "q1": "The artwork of the Proposer a PhD student at Oxford is stunning, creative and in my humble opinion very original. The ability to create the visuals as proposed does seem to be in the realm of talent. The proposer is the only team member and would be doing the art work. The budget and timetable are well explained and reasonable. The Risk management and mitigation strategy appears sound.\n-----------------------------------------------My assessment on the Feasibility of this Proposal is a 5( strongly agree it will be successfully implemented) star.", "q1r": 5, "q2": "Auditability by Challenge is specific to the Challenge and not just to the proposal. This proposer has audit metrics but not in tune to the Challenge. There are no KPIs suggested as is often typical and no metrics on how Students would connect with Engineers per the Challenge brief. My suggestion to the Proposer, in part echoing my advise in the Impact section, when writing a proposal is to fully read and understand what each section is pertaining to, what the guidelines are and ultimately what the goal is. Look for other Challenge categories if yours does not fit one particular Challenge and add lots of attachments to explain why you might think it fits.\n-------------------------------------------------\nMy assessment is this proposal missed the metrics suggested by this Challenge and rate it a 2(Disagree the information is sufficient to audit the metrics of this Challenge)star. ", "q2r": 2, "assessor": "z_assessor_2671", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Thank you for your comments and feedback. I apologise if I have misunderstood the fund/challenge aims, but as I understood the brief, student-led projects were also included within the scope of the challenge so the project was under this category for that reason.\n\nIn terms of fitting the challenge brief as I take the reviewer to frame it, there could still be benefits from a marketing perspective, as greater awareness of the Catalyst ecosystem in general will also lead to more students being aware of the platform and thus more likely to apply in future funding rounds. Moreover past winners that are students themselves could benefit from greater exposure. With this in mind, a possible performance indicator would then be to track from where new fund proposers first heard about Catalyst/Cardano, with one option being previous fund winners.\n\nIn terms of KPIs to track how the project is progressing during the development phase, specific milestones were given in terms of how many images/sample logos should be presented at each main stage, which can act as a measure of the progress of the project."}, {"id": 7135, "q0": "This proposal brings an interesting initiative. As things stand, Catalyst fund winners usually spread their success by using just words through their social media. While there is nothing wrong with the current approach, it could be supplemented by using visual designs. It would both help spread awareness about Catalyst and grow sense of achievement & collaboration within the community. The proposal also fits with the challenge settings as it facilitates not only business and engineering students, but also art students onboard. Therefore, I firmly believe this idea could contribute a lot to the Cardano ecosystem. ", "q0r": 5, "q1": "The proposer has put together a well-thought-out plan, so I strongly believe there wouldn’t be any major hindrances throughout the implementation. The proposer has provided us with their profile, and we can see that they have a mix of experience both in art and technology. After looking at their relevant experience, I am confident the proposer could come up with many different art-style directions and the technical know-how to represent the categories. The budget is also broken down into identifiable items and the amount requested is justifiable (the proposer would spend 3 hours on average and the hour rate is reasonable). The timeline is provided, and we can see the milestones and the time horizon for each of them. I really appreciate the proposer's initiative to further clarify what each time horizon consists of so we can clearly get the idea of what the proposer is doing at those times. Not to mention, including community feedback as part of the process is very awesome because, in the end, the people in the community are the ones who are going to use the visuals. The technical aspect is clarified by the proposer (the size of the design, the format, etc.). Lastly, the proposer also factors in the problem of design-breaking changes in the future and mitigates this risk by providing future-proof options. Overall, the proposer has ticked all the boxes for a smooth execution, and I couldn’t see any problems that might occur with the currently presented plan.", "q1r": 5, "q2": "The proposal’s success is obvious; the completion of categories and funds design. The end results could be tracked through the Github link that would be provided later on. We could then measure the adoption rate of the visuals through the forks and follows of that particular Github repository. I might have misunderstood the proposer's plan, but if the proposal is funded, I would like the proposer to dump whatever progress has been made (e.g. the different art-style drafts) into the same Github repository, not just when the final visuals have been made, so we can keep track of everything in the same place. In the end, I am confident we could audit the proposal’s progress and determine its success based on the ways mentioned above.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "Thank you for your review and feedback. It would be no problem to ensure the works in progress and drafts are also included for viewing by the community as the project progresses."}, {"id": 7744, "q0": "The proposal flows really smoothly and it’s easy to understand how it addresses the challenge. By raising platform awareness, this proposal aims to help current and past Catalyst funding recipients as well as the Catalyst community as a whole. Because there are presently no clear rules for fund winners to follow when announcing the success of their projects on social media and within the projects themselves. By offering pre-made graphics, fund winners will be able to quickly add logos or badges to their product graphics and quickly and consistently promote their successes on social media.As a result, the Cardano and Catalyst communities will gain more recognition.", "q0r": 4, "q1": "Based on the information provided by the proposer, I have every confidence that this plan will be carried out effectively. Given that the proposal's digital art, animation, and design experience spans more than five years. A summary of all theoretically calculable expenditures and the author's request for $5000 USD in financing also seem reasonable and essential to achieving the goal.", "q1r": 5, "q2": "Important milestones have been reached at 3, 4, and 5 weeks, and indicators are given to support auditability. To determine the overall topic and style of the finished work, a number of draft ideas will be offered in the initial phase. At this point, there should be a single example from each of the earlier designs that will serve as the basis for the final ideas' style.\nThe time allotted is meant to take into consideration the time needed to obtain input. For the Cardano and Catalyst communities to have a say in the design, a poll will be organized and distributed.\nThe complete set of designs will then be produced in accordance with the final, accepted design and exported in the designated formats.\nThe finished products will all be posted to a public repository along with sample code that shows how to integrate it into the webpages.\nThe 5000 USD in financing that the proposal's author is requesting seem reasonable and essential to achieving the goal once all expenses have been calculated. The plan has recognized, understood, and is making efforts to address an actual need, therefore the resources provided are adequate to audit the progress. The knowledge and understanding of the proposer and his team increase the likelihood that the recommendation will be implemented successfully.\n", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Thank you for your feedback and review. To clarify a point in the auditability section, the milestones are reached after 3, 7, and 12 weeks, with each section taking 3, 4 and 5 weeks to complete respectively."}, {"id": 8278, "q0": "This proposal is innovative, and very different from the others I've seen. The project could facilitate the submission of proposals from new members. However, I am not sure it really fits the challenge, as it not specifically designed for students. The identified risk is interesting, and it shows the need for a continuous follow up to make sure alll the designs are up to date. I think another risk that could be considered is that the proposers don't use the available designs, which wouldn't complete the purpose of having one main visual identity.", "q0r": 3, "q1": "I really enjoyed how the final artwork would be created through an interactive process, this would help create a design that pleases as many possible people. The milestone seems complete, and so does the budget. However, I would have liked some more information on the proposer and whether they have any previous experience with this kind of project. On the other hand, I liked how there are links to check their work.", "q1r": 4, "q2": "I think there could be specific metrics that would serve as measurements for each milestone, for example, how many designs they plan on making, and how they will track how many people are using these designs after they are made available. This would help understand whether the project is a success. Maybe there could be a survey with some of the proposers for the nest fund to understand if they were aware of the designs if they used them if they made any impact, etc.", "q2r": 3, "assessor": "z_assessor_2971", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your comments and feedback. In terms of alignment to the challenge theme, having materials to facilitate branding of Catalyst fund winners can benefit students specifically in two ways, particularly if the winner is themselves a student: first, the student will gain better regognition themselves, which could help connect them to other members of the community for future projects. Secondly, the student's peers would also be exposed to Cardano, potentially leading those with ideas to apply for future funds.\n\nI agree that having a survey could help assess the impact of this project, and in itself would help to spead knowledge of the assets once they have been made, so should certainly be added to the proposal. "}, {"id": 9652, "q0": "The proposal was designed by a student and aims to allow winners to showcase their success through the use of special logos. This directly impacts the Cardano ecosystem positively as it is a form of awareness creation. Also both past and future fund winners can use the logos and this may increase their visibility among engineers for future collaborations. For these reasons the proposal aligns with the outlined challenge settings.", "q0r": 4, "q1": "The development of the project is meant to take place over a period of 12 weeks. Each phase of the project has specific plan for each time period withing the 12 weeks. There is also a description of the designer and a link to her LinkedIn profile highlight her skills. Another link shows some of her artwork.  As indicated by the proposers, the project is sustainable as the budget covers funds in case of an extension to the project in the future. For these reasons, I believe implementation of the project is feasible.", "q1r": 5, "q2": "The proposed solution of visuals such as logos for identifying catalyst winners can easily be measured by the description of success given, which is the use of those logos or graphics. This will be apparent and can easily be quantified and tracked across many digital platforms.  Inbuilt metrics such as the number of follows can also be used to measure the adoption of graphics provided by the project. Thus there is sufficient information to assess the progress in attaining the goals of the project.", "q2r": 4, "assessor": "z_assessor_3078", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Thank you for your feedback and review."}, {"id": 12417, "q0": "I find the idea of a ready made, easily editable graphics template really appealing to have for the community. Especially considering once a Catalyst project is approved for funding, the team members will need to focus on delivering their projects. With a free ready-made template, this can be an easy way to cut time allocated towards marketing for funded proposers since they won’t need to make the graphics themselves. The proposed plan is to provide logos and banners in various format (i.e. vector, .png, etc.) that can be easily edited by whoever wants to use it, this includes categories like Grow Africa, Grow Asia, DApps, DI, Cross-Chain, as well as the general numbered funds. I do think this proposal can help Catalyst garner more outreach since it can make project marketing easier to do and therefore attracts new people into Cardano. That being said, there is the risk of the template becoming obsolete for future Funds and this is addressed in the proposal where the plan is to choose already established categories (e.g. Grow Asia) as well as the generic numbered funding campaign (e.g Fund 9). However, the proposer did not address the risk of more challenge settings becoming an established categories like the 5 mentioned before and with Catalyst becoming bigger, the diversity of challenge settings in each Fund might also increase. This isn’t a big issue since at the end of the day, there are graphics made for the numbered funding campaign, so the projects that don’t fall into the 5 categories can just use those even though it might be too general. All in all, I think the idea is great and can be helpful for funded Catalyst proposer in the future.  ", "q0r": 5, "q1": "The team consist of 1 member with background as a designer and they’ve attached their portfolio in the proposal showing the relevant skills needed to tackle this project.\n\nThe budget of 5000 USD has been requested and is within the limitation of the challenge. Also, it has been broken down into easily identifiable items with ample justification, which includes 3 months of Adobe (for designing), a working rate of 25$/hour (total workhours: 168 hours in 3 months) which is a reasonable work hours and rate for part-time standard. However, I’d have liked more details regarding the “define, organize, and animate sessions for feedback collection” part of this budget. Information such as the total workhours to organize these sessions and whether the rate requested will be the same as well would be appreciated so that this part of the budget can be judged more clearly.   \n\nThe roadmap of the project is pretty simple and has been laid out well going over 3 key milestones, such as the initial design, refinement (via community feedback), and the final design. The timeline seems reasonable with each milestones taking up more time (3 weeks → 4 weeks → 5 weeks) since more polish is needed towards the finalized design. More details on what platform the poll will be held would be appreciated.\n\nOverall, I think the feasibility aspect of this project is clearly communicated through the well laid out roadmap, ample breakdown for the budget, and the proposer has provided sufficient links to back up their skills.", "q1r": 5, "q2": "The project’s deliverables, being the logos and banners will be publicly made available on Github so the tracking for the project completion can be done easily (note: the Github has not been linked in the proposal at the time this assessment in made). The metrics chosen to measure the project performance is “number of completed designs” and in-built metrics from Github (e.g. forks, follows). I think the metrics chosen are adequate measurement for the project outreach and reception (via GIthub metrics) and the project progression (via the number of completed design). Overall, the KPIs are easily measurable and relevant for the project. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for your review and feedback.\nTo address your point on polling the cardano community, this could be done via a combination of a linked google form, and a conversation that can occur directly on the github repository the project files will be kept in. \nThis dual approach should allow both people who do not have a github account to contribute feedback, as well as opening a channel for an open conversation about the direction and style of the products to occur.\nPart of the work required in managing this will be moderating responses and ensuring that members of the community are made aware of the project."}], "solution": "Create logos and visuals for selected reccuring categories and overall funds to allow winners to showcase their success, and help spread awareness of the Catalyst ecoystem.", "experience": "5+ years experience in digital illustration, animation and design."}