{"id": 421815, "author": "tevosaks", "title": "Mini Proposal Workshops", "url": "https://cardano.ideascale.com/a/dtd/421815-48088", "category": 26599, "amount": 5000, "description": "Proposers don't have the experience to make their proposals understandable to voters.", "f6_no_assessments": 23, "f6_rating": 4.420289855072464, "videos": [], "media": [], "f6_assessments": [{"id": 3169, "q0": "This proposal hits one part of the Campaign well, in that I believe the work can very positively affect participation and outcomes for potential project Catalyst proposals. I am removing two starts because what is largely missing is what I believe to be at the heart of this campaign challenge, which is STUDENTS.  They said the word students one time, in the impacts section, but this was not accompanied by any actual plan to attract or proactively involve students. Nor was their any mention of schools, universities, or academia in any other sense. I think this could have easily been a 5-star rating for impact if they hadn't seemingly forgotten about the key demographic target of the campaign!", "q0r": 3, "q1": "This team has a proven track record of delivering this material effectively. I also see evidence that they are reflective, learning from what has worked well in the past and making improvements as they proceed to the next round. They show evidence of planning realistically around their current workload and future timetables. No concerns at all for feasibility.", "q1r": 5, "q2": "Their KPI tracking google doc is probably the best I have seen. Here we can see their results from their past funded projects, and see for ourselves what is working well and where they are targeting improvement. Really well done. My only note for improvement would be to include a short summary of some of these results right here in the proposal, rather than sending me to your google doc to see it. (Voters would be interested in these numerical results, but are less likely to visit the google spreadsheet!)", "q2r": 5, "assessor": "z_assessor_2404", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 12099, "q0": "The proposal addresses the challenge goals. The project identifies that a student's lack of experience in structuring and exposing ideas to investors can be an obstacle in raising money and being noticed by engineers. By aiming to guide future proposers to create more detailed and digestible proposals to the Cardano Catalyst voters, the project could encourage students to seek funds through Catalyst and improve the way they expose their ideas, thus increasing their opportunities for easier funding and engineer scouting. Moreover, the project has been funded in previous Funds, asserting its sustainability, and would continue to add value to the Cardano ecosystem by improving the quality of the proposals in the Cardano community. \n\nThe proposal has links to a Miro board with full workshop examples, links to the previous funded projects closing reports and will be using a public webspace to keep track of the main tasks, which is very helpful in terms of feasibility and auditability.\n\nFinally, it is a very good idea and the proposers have previous experience and knowledge in putting it into practice. But I think the proposal would benefit if the proposers had offered more details on budget and the workshops content and participants, as they did in the past Funds.\n", "q0r": 5, "q1": "Taking into account the previous experience in implementing this project, the proposer has practical knowledge of the budget and efforts needed and has experience in allocating them.\nThe proposer provides links to previously funded proposals, which are similar in content to the current one, containing closing reports exposing their development and main achievements and Miro board with the past workshops structure, sessions and video contents, thus giving evidence of the experience and knowledge in implementing the project\nFrom the previous proposals, the number of hours and team members has grown as well as the budget, which is reasonable given the enhancement of the workshop content and team members through practical experience and feedback, but would have been helpful if the proposer had detailed more the budget, timeline and the team members allocated in the current project, as he did in the past proposals.", "q1r": 4, "q2": "The proposal presents very clear and direct metrics to follow, as well as very detailed reports on different public channels regarding the development and results of the project. The project aims not only to track engagement results, like number of participants who joined the workshops and sessions, number of video views and average view duration, but also metrics that ensure the quality of the workshops, as it can be seen in the documentation of previous proposals that the team keeps track of the mentored proposals scores that got submitted in Catalysts Funds. \nFinally, the project will use a public Dework space in the Swarm Dework project board to track the main tasks and all other documentation and proposals are aggregated to the Project Management Miro Board. There is also a public google sheets keeping track of mentored proposals scores and by the end of the project a closing report is presented resuming the main tasks and results of the project.", "q2r": 5, "assessor": "z_assessor_3361", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12062, "q0": "This proposal is going to have the needed impact on the community and the targeted students as the promoters hope to bring their vast and varies experiences from the Catalyst Community to coach and guide students as they in their quest to submit proposals for funding. Also, given the experience the promoters of this proposal have gained from previous workshops with students and successful implementation of previous projects, this project should be implemented successfully. The implementation of this project will also help to improve the quality of proposals in the Cardano Catalyst Community. The project will also offer opportunity to a lot of students who have innovative ideas and projects which they are having challenge with funding and technical support to shape their ideas and get the needed funding and support under the Catalyst Project. Aside the risk of expiration of study materials as envisage by the proposers, it is important they also look at grouping students into meetings and trainings based on their interest, background and project areas. This will help shape projects into context with Catalyst activities and amalgamation of similar projects for funding and scale up. ", "q0r": 4, "q1": "The promoters of this project have provided a step-by-step road map to ensure students are properly guided at every stage of the onboarding into Catalyst activities. This includes providing a detailed guideline on how to prepare the proposers in line with the requirements, get the needed support, monitoring publicity and funding. In effect, this project when fully implemented will provide a roadmap of getting a students to be on boarded into the community. That is the promoters hope to assist students from ideation stage to proposal development stage up to funding. They have also chosen to communicate the outcome of this project on Catalyst Swarm Youtube Channels for a much broader publicity. This will attract the needed interest from community members with the needed expertise to support these students in fine-tuning their proposals and getting the needed funding. The funding submitted in the proposal falls within the limit set under this challenge and giving the experience of the promoters of this project in the areas of proposal workshops, they should be able to implement this project with the funding requested. ", "q1r": 4, "q2": "This project has set out deliverable KPIs in quantifiable forms to measure success. That is, the promoters have provided the number of proposers they hope to get funding support. They have also provided measurable target for project scoring for participants who participate in this project workshops. In addition, they have also provided the number of views to their Youtube upload on the various workshop sessions. The promoters have also provided the number of feedbacks from participant as well as the various channels they hope to communicate the outcome of these proposal workshops. In terms of accountability, the promoters have provided two main channels they are going to communicate the outcome of this project. That is public Dework space in the Swarm Dework project board and Project Management Miro Board. Finally, since this project is a continuation from previous projects and as stated the promoters hope to apply for future funding, it is important the proposers outlined the challenge they have faced with previous projects and provide measures to mitigate such challenge in this new project. ", "q2r": 4, "assessor": "z_assessor_3352", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12048, "q0": "The problem statement is clear. People have great ideas but unfortunately there is lack of experience in presenting an understandable proposal.  Mini workshops are a very good tool to spread the knowledge of how to develop the ability of creating good proposals in Cardano community and to communicate the objective to voters. Mini workshops as a tool of knowledge, can make future proposers more confident to applying for funding to Cardano. The fact that the proposer aim for more quality proposals as a result of the mini workshops, this will have a positive impact on Cardano / Catalyst ecosystem. More understandable to voters, more time efficient. The KPI's of the proposal matches the ones in the challenge. Student entrepreneurs will be guided to creating purposeful and easy digestible proposals. This proposal could give ideas for future challenge.", "q0r": 5, "q1": "The team has the right amount of people and the right combination of experience and skills needed to complete this proposal.  It was previously funded in Fund 6 and Fund 7. They provide the necessary links and references.  The budget is clearly divided, although I believe that the proposer could give a breakdown to the marketing section ( In my opinion 1000 dollars are not enough for marketing / digital marketing and working hours). The budget is not very far from a reasonable one to achieve the set goals. More budget could bring better results and success for this proposal. Additional funding is not required in this proposal. The proposer though stated clearly the risk of study material changing and the need of video alterations in that case.", "q1r": 4, "q2": "This proposal provides a roadmap but not very clear milestones. KPI's that define the success of the proposal are presented. The goal and the metrics according to what the proposer states are realistic. The Cardano community can easily track the progress of the project by the KPI's given results.", "q2r": 4, "assessor": "z_assessor_3338", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 11909, "q0": "The proposal is about establishing workshops that help participants to create a proposal and effectively communicate the objectives to the voters in an understandable way. \n\nThis proposal is very well aligned with the challenge statement as this proposal provides guidance to the student entrepreneurs to issue purposeful and easily digestible proposals which will help voters with their jobs. \n\nThis proposal will help in having direct communication with the proposal that will yield optimal returns on their idea. This will have a great impact on cardano catalyst voters because they will have a proposal that can be easily understandable for them to vote. \n\nThis proposal will help to improve the quality of the proposals in the cardano  catalyst community thereby helping voters as well. \n\nThe proposal has outlined main risks that could prevent delivery of the project successfully but also the proposal has come up along with some important mitigation strategies to overcome these risks which shows how dedicated and competent the proposer is. \n\nOver I strongly agree that this proposal effectively addresses the challenge statement. ", "q0r": 5, "q1": "The proposal has provided details of the people who will work on this project. There is a small description of team members like their names,  previous jobs but I believe they should have at least provided us how many years of experience they have, how well qualified they are. However, there is LinkedIn profile of each to know them better.\n\nThere is a  step by step timeline mentioned with all the key activities that will be take place however, there is no clear timeline as to in how many months or weeks this will take place. I believe there should have been a clear time table so that we could know which activities would take place in how many weeks or months. This would have ultimately helped auditors while auditing the progress of the project.\n\nThere is a clear budget breakdown and it looks reasonable. It has been divided with respect to the activities that would take place and the amount for each activity looks reasonable and sustainable. They would return to the catalyst in a later round for the funding as long as there will be demand for proposal workshops. \n\nThere is a short discussion on the possible risks or challenges that could occur while executing the project however as they have already solutions for those risks it shows there strength in credibility of understanding the project. \n\nHence I agree that this proposal is highly likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has mentioned all the main tasks that will take place .Voting results and assessment ratings will be used to track for auditing of the proposal. \n\nAll the provided measures that will be used for tracking success and progress of the project seem to be solid and achievable. \n\nI believe it would have been better for the proposal  if there was a clear road map and a clear time line as to within how many weeks or months the activities can be tracked or monitored like after how many weeks or months the auditor should check those measures for having an idea as to how well the project is on track. \n\nThere is clarity with problem statement and solution statement and in their alignment with this challenge. There are sufficient details for auditing but I believe there should be a bit more clear details rather than just details. \n\nHence I agree that this proposal provides me with sufficient information to audit progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_3312", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11099, "q0": "To write a proposal is not an easy job for students. The proponents are inexperienced to make their proposals understandable to voters. What you suggested was: \"Implement workshops to help participants make suggestions and communicate goals to voters effectively\". In my opinion, this is a very valuable proposition for both audiences: Proposers will provide optimal returns for their ideas and voters will have an easier time evaluating proposals. You have raised the risk that the research material has expired, the explanation to reduce the risk has not been effective.", "q0r": 5, "q1": "I strongly agree with your solution, which is to organize an online seminar. This is a compact, low-cost organizational form, suitable for the current epidemic situation. The purpose of the proposal is very clear: to improve the quality of the recommendations in the Cardano Catalyst community. I very much agree with the roadmap you put forward first giving them access to clear, transparent proposals. Then create an environment for the speakers to interact with the students to help them solve the difficulties and obstacles in the research process. In my opinion, in the interactive section, you should have suggestions for the proponent to understand the criteria when voters evaluate a proposal so that they will have specific solutions to improve the quality of the proposal. The budget table for the proposal is still general and not specific, there are contents that you should build a spending norm according to labor hours, thereby converting it into USD for clarity. You have provided information about the people who will work on the project, you can provide more addresses so we can learn more about their capabilities.", "q1r": 5, "q2": "Does your plan state the things that need to be done but not specifically for how long? (missing milestones) so it is difficult to measure the progress of the project. The description of the proposal's success was pretty clear. Proposing successful implementation contributes to the development of sustainable development goals that are to ensure inclusive and equitable quality of education and promote lifelong learning opportunities for all. I support your suggestion.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 10202, "q0": "The team raised the issue and how to deal with it by creating seminars to improve the quality of proposals on Catalyst. However, regarding the risk part, I have more comments as follows: the risk of fluctuations in the ADA coin, and more importantly, the guidance of students to write a purposeful and understandable proposal will be based? Is it general and objective?", "q0r": 4, "q1": "Although the team has stated their progress, I do not appreciate it because there is no specific timeline such as the number of months, and the number of weeks to complete. As for the budget, the team has not detailed it, for example, $5000 will be divided among team members based on the activity time, so how much is the amount spent per hour of activity? As for the team members, it's great, the team has enough members for each of the tasks listed.", "q1r": 4, "q2": "The team has documents and links so that everyone can monitor the progress of this project. The team also detailed the number of each item when talking about the success of the project. Since this is a follow-up proposal from previous Funds, I really appreciate it.", "q2r": 4, "assessor": "z_assessor_3165", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 9830, "q0": "This is another intelligent proposal that is in agreement with the objectives of this challenge. The main concept of this project is to implement workshops that help participants create a proposal and effectively communicate the objective to voters. The plan is to create an online workshop where a proposer will meet this team of experienced mentors, and work on a proposal to help develop it into an effective and acceptable one. I believe this will go a long way not only to help the proposer but the community as a whole. As this will help increase the quality of submitted proposals, assessments would be much easier, and voters could also be less burdened.\nThe team also has experience in a variety of fields and could help address proposals from different topic areas.", "q0r": 5, "q1": "The roadmap of this project is very detailed and gives a step-by-step insight of everything that will happen until the completion of the project. I admire the fact that documentation and report generation has been included in the project. The team also plans to anounce the project on various catalyst platforms before the commencement of fund11, to help increase participation, there is also a plan to record these sessions which will be later uploaded on the catalyst swarm youtube channel. There are a lot of interesting nuggets in the plan which make belief in the success of this project unquestionable.\nEach team member is listed, the specific role he/she will play is also stated, their area of expertise and experience is also provided. Details on the budget is also adequate, stated cost looks realistic and feasible.\nI believe the team has what it takes to see to the successful implementation of this project.", "q1r": 5, "q2": "The auditability stage of this project is well outlined and ticks every box that makes this project auditable. The idea is already great and is backed by a very comprehensive and detailed plan, with the engagement of a well-experienced team. All this makes it easier to audit. The proposer also provides a link that they will use to track the progress of the team. The KPIs provided were carefully selected and I believe are good indicators for measuring the success of this project.", "q2r": 5, "assessor": "z_assessor_3106", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 9425, "q0": "The Mini Proposals Workshop's mission aligns well with that of the challenge - educating student entrepreneurs can directly impact amount of students that are able to successfully and confidently submit good quality proposals. Thus, improving their likelihood of their ideas to be funded and exposure to the world, engineers and within the Cardano ecosystem. ", "q0r": 5, "q1": "- The team all appear to be well equipt to deliver the training. Tevo, the Project Manager, is the co-founder of The Catalyse School himself which (to my understanding) is relatively well-known within the community for on-boarding community advisors and providing resources within the community in general. So, I must be correct to assume that he has the knowledge to guide the direction of the workshops for students.\n- The format of the workshops are somewhat similar to my experience of university seminar learning. Which would allow for seamless entry for the students.\n- One constructive point I may add is that the team need to ensure that information released and used as material to conduct workshops is finetuned and checked thoroughly. There are a few major typos within the material provided for this proposal (e.g. miro page) which, if continued within workshop material, could cause confusion to any student looking to material as resource. Perhaps an new or  existing team member could assume the role of editor to prevent this.", "q1r": 4, "q2": "The roadmap is cohesive and realistic. The team show good evidence of tracking most proposals through the previous funding cycles.  \nFor the 'wider audience' Youtube metrics are a good indication of how many people are interested in learning about submitting proposals, however, does not directly indicate how many of those people followed through. It would be great to create an interactive community (i.e. via discord) that follows up with the new oncomers that pick up along the course. Or, alternatively perhaps a simple questionnaire could be prepared for those who attended workshops to more accurately mesure how many of those have submitted proposals in the end.", "q2r": 4, "assessor": "z_assessor_3059", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8939, "q0": "Not only developing ideas or developing projects are important , it is also important to know on how to present the proposals to voters , since most of the proposal gets rejected as it doesn't have proper presentation of proposals, due to this voters cant understand the projects sometimes, this makes them to reject the project, hence to bring videos on how to make proposal will definitely be big boost to new comers, and this will surely make them to understand what are the important elements that should be added in presentation so that makes voters to understand the presentation easily, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team has been working in catalyst program since fund 7 , they surely have experience on how to write the proposals, and what are the key factors that must be applied to make the proposal more understandable.\nThe team has also come up with their own catalyst team saying \"Catalyst School LATAM\" where they help students in schooling catalyst programs related data, the presented team also contains other requirements such as video editors and content developers , hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has displayed its clear goal wher e they want to school on how to write proposal in most effective manner, the presented plan has even mentioned on each step on how to achieve the task.\nThe proposal has introduced all the team members that will be involved in the project and have introduced their expertise field, which includes marketing, edit and teaching, the presented plan could have added timeline of the project in still more detailed manner,\nthe proposal contains decent budget breaking , the proposal has good key indicators to measure the success rate of the business , with the experienced team provided  information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 12154, "q0": "The proposal is very useful, it is very adaptive to the change of each fund on Cardano, ETH,Catalyst. No wonder it was being funded on fund 6 and fund 7, the consistentcy of this workshop shall be the very weapon to the change of Cardano ecosystem. The link of miro.com will very help Proposer to conduct, generate idea, and not missing a single step on proposal creation. It was mention that to filter the best from 5 workshop to 1 fine proposal. Well aiming on 4.2 rank by Assessors. Making mini or simulation on voting process is very essential on nowadays system works. The future challenges will be more understable by the existing members and new member of the Catalyst and ETH.", "q0r": 5, "q1": "Instead of wondering how they will do it, it is clearly this project must be maintain. The proposer doesn't have confusion on when they will do it, it is written that they will conduct the activity of their project near the time of fund 11, which have so long time to get more resources and information. They also have noticed that something on Catalyst and ETH must be considered and figured out before they launch the mini workshop. As i started to read this project, i can feel these project consist of \"they\" rather than \"him/her\" only. It brings altogether needs and value. The bad side is all about how they alocating only several amount on marketing of this project. i kinda feel it should be like this or that.  But they know better the situation about their own community abroad. Simple project management and somehow impactful for ETH and catalyst itself. ", "q1r": 5, "q2": "Definitely, Cardano needs this kind of project. They don't go for fast funding and not spending the resources to early, they have proven links and have specific KPI to be solved respectively. Upscalling the knowledge of the internal team member of ETH and ECS is the first thing to be assessed before they act. This proposal also think about how it sustain and the value of the society being mentioned well enough and want to grow together. Not selfishtic and being rational. True intention on this mini workshop shall result on positive impact and giving benefit to all members in the future.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 7826, "q0": "This proposal has adequately addressed the challenge by providing timely solution for would be proposers especially students who mostly have little no no experience when it comes to submitting a proposal even though they might have brilliant and transformational ideas. The proposal has also been entered in the right category. For this reason I gave it a rating of 5", "q0r": 5, "q1": "The proposer has received funding for similar projects in previous funding rounds reiterating the fact that the team behind this proposal has what it take to execute this project successfully. The budget provided is within the acceptable amount of $5000.  Watching the video links provided in the proposal shows successful  works undertaken by the team which contains a number of success stories. For this reason a rating of 5 was given ", "q1r": 5, "q2": "The proposal does not really give a timeframe for the execution of the project. However key metrics where provided. These metrics according to the proposal will track the number of views in its YouTube mini workshop videos. An increase viewing audience will mean the project is a success. For this reason I gave the proposal a 4 star rating ", "q2r": 4, "assessor": "z_assessor_2924", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 7600, "q0": "The problem described in this proposal is closely aligned with the challenge because it seeks to guide student entrepreneurs to persue purposeful and easily digestible proposals. This will also make the job easier for proposal voters. The proposal can be  scaled by reusing the guiding content and increasing the number of facilitators in the Cardano ecosystem. The proposal clearly articulates a plan for the future sustainability which will increase the number of youth and adults who have relevant skills, including technical and vocational skills, for employment, decent jobs, and businesses. Moreover, The proposed Solution aims to improve the quality of the proposals in the Cardano Catalyst community, their goal is to support proposers to get over 4.2 Ranking by Proposal Assessors this  will make proposals get funding.", "q0r": 5, "q1": "The proposer and team have the desired skills and experiences making reference to the relevant links which will be needed for the successful implementation of the project. The proposer also knows the type and the number of team members required to the implementation of the proposal.\nThe proposal also provides a budget breakdown which has not really been broken down into identifiable units.e start the sessions a few weeks before the Fund 11 Proposal Submission Stage. From then on, we will be conducting several sessions to prepare a proposal for the Proposal Submission Stage. In addition, we will capture key measurements and share workshop content and impact results with the community.  The proposer also offers the time lines and milestones that includes Youtube video statistics. And the Closing Report will be delivered one week after Fund 11 Voting Results.The proposal has also considered the main risk  which is the study material, represented in the workshops, that can expire in time. This can be prevented through awareness of the voting criteria. As they may change every Fund, we must be informed of the alterations and make our own corrections. These changes are the key discussion topics in our team meetings and workshops.", "q1r": 4, "q2": "The proposer and team has provided a clear outline on how to measure the progress of their project should they be funded . They have the milestones and KPIs on how success will look like should they be funded by looking out for How many views will  be capture with Youtube mini-proposal workshops? This aims at increasing  views per video in 2 weeks from 30 to 40 ,how many views will be captured with Youtube mini-proposal introduction videos to chapters?This aims get around 40 views per video among others.The proposer has also indicated how their progress will be monitored and reported to the Cardano by using public Dework space in the Swarm Dework project board to track the main tasks which will be undertaken by the mini proposal workshop.", "q2r": 4, "assessor": "z_assessor_2906", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "You brought out the fact that our budget is not broken down into identifiable units. It is broken down in a reasonable way. What details do you need? Also, what is your rationale behind lowering the auditability rating besides outlining the general observations you made?"}, {"id": 7395, "q0": "The idea in this proposal is a good one but I do not think this idea aligns with the challenge. Here,the proposer only talks about guiding student entrepreneurs in writing brilliant ideas for funding but how do they first get those student entrepreneurs on their workshops? The challenge talks about scouting for these student entrepreneurs not just guiding them to write proposals. This idea would have closely aligned with the challenge if the writer spoke of how they could first search for student entrepreneurs, maybe,for example, it could be through outreach programs in business schools where the proposer gets to identify those students before onboarding them onto the online workshops. From the proposal,what I see is the author not limiting this project to student entrepreneurs but to a wider audience, meaning anybody at all,be it a student entrepreneur or not can be part of their online workshops,but here is the case in this challenge,the aim is to onboard more student entrepreneurs who have brilliant ideas to start small scale projects but lack the needed funds. The goal is for catalyst to recognize these projects and give funding to these students and hence I do not quite agree with the alignment of this proposal to the challenge.", "q0r": 3, "q1": "It is an undeniable fact that the team has got an array of experience since they have worked on projects that were previously funded in fund 6 and 7 as stated in the proposal and also that can be seen on the youtube link provided,but then this project would have been feasible if the author provided us with some links and LinkedIns for us to get to know the team intimately in details and how experienced they are.\nSecondly,the budget does not exceed the limit for the challenge setting and that is ok. The budget breakdown basically describes three components , notwithstanding,there is little information on how the money is going to be spent. The budget seems obscure and unclear to me especially the part that says,they intend to distribute the $5000 between team members based on the time spent on their activities.which activities? Are the activities the three items listed in the budget? This was not clarified to us in the proposal.\nLastly,the timeline is also not clear,there are no delivery dates,we donot know the number of months,weeks, they are dedicating in delivering this project. With all these said,I do not think this proposal is highly feasible.", "q1r": 3, "q2": "Firstly,the author gave us a link to their YouTube channel where most of their workshops are uploaded. This is a clear indicator for the community to be able to audit this project. we get to see the participation rate and the number of workshops uploaded. The key performance indicators and the goals they hope to achieve at the end of the project are clearly stated. How many people show up for the workshops, how many participants rate the proposal workshops effectiveness after the sessions with a l-5 rating ,I believe these above are good ways to measure results and to some extent I think this project can be audited by the community.", "q2r": 3, "assessor": "z_assessor_2890", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "I agree with you on the fact that we don't talk about how we get the students for the workshops. In our proposal we do mention the presence of various public channels through which we are finding our proposers. The LinkedIn profiles you said were missing are in the Team section. To answer your critizism about the budget: there are 3 people in our team and their tasks correspond with the 3 funding categories. You can see what activities each one is doing in the Team section. I want to ask: what exactly about the timeline is not clear? Our workshops will start before the fund 11 Submission stage. From this point on workshops will keep running weekly and our closing report will arrive at the end of the fund. For auditability you agree that this project is presenting measurable results but yet you lowered your rating with no reason given."}, {"id": 7137, "q0": "I strongly agree with the proposer’s initiative. In this fund, I assessed many students’ proposals and I could attest that the majority of them could benefit from guidance and mentoring. A lot of their proposals are missing key details, such as how they would justify their budget, what exactly are the implementation risks, how they would measure the proposal’s success, etc. Hopefully, by providing the guiding content and mentoring them through workshops, the quality of proposals from students would significantly increase, which ultimately brings more value to the Cardano ecosystem if they were funded. I really appreciate that the proposer put a lot of emphasis on the existence of guiding content because it allows this proposal to scale to many students. Thus, I believe this idea would contribute significantly to students in Catalyst.", "q0r": 5, "q1": "I am confident there would be no problems during the implementation. The proposer has listed their profiles and they have experience guiding proposers before in Fund 6 and Fund 7. The budget requested is divided by workload, and we could see from the members section who is going to do what. However, the budget items could be broken down more based on the number of hours they would have to be spent. Because that detail is missing, it’s a bit hard to justify the amount they requested. That being said, I applaud the proposer’s initiative to explain in excruciating detail what they are doing in the timeline section. There is also a mitigation plan, or at the very least, consideration of the risk of deprecated materials. In the end, I don’t see any hindrance that might block their progress.", "q1r": 4, "q2": "The proposer has given us complete information in the proposal for us to audit it. The timeline is clear, the metrics used are objective and could easily be used to determine the proposal’s success, and we could keep track of their updates through the channels they have set up (Miro, Dework, Youtube). Overall, measuring and monitoring the proposal would be effortless. (Kudos to the proposer!)", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 5689, "q0": "The plan outlined in this proposal is to enhance value addition to the ecosystem by shaping the proposals of proposers via workshops.  The purpose of the project is to enable the realization of a high-quality proposal by proponents through workshops training. This in turn helps voters to make better decisions. Also, it's nice to see the proposers' projects get funded or approved by the community via this initiative. A look at the main objective under this project, makes proposers the central focus of this project, without any clarity whether the proposers are existing or new. This is very important, due to the objective of the challenge and scouting for student setting challenge– focuses on the students entrepreneurs. There is no clarity on the target audience. Given the criteria of this challenge, I wish the proposal provides definite answer here. Is the target audience proposers as indicated from the onset (which includes new and existing proposers)? Or student entrepreneurs as indicated here–“we guide student entrepreneurs to issue purposeful and easily digestible proposals”. A clarity on this would better streamline the overall outlook of the project to clearly sync with the objective of the challenge. In spite of that, I am convinced of the value addition of this project to the ecosystem. Aside that, the proposer provides a strategy to attract proposers and also details the provision of tools and educational contents to proposers that would be relevant in shaping the ideas of the proposers. ", "q0r": 4, "q1": "Does the information provided suggest the project would successfully be implemented? I think the general framework of the feasibility can be improved; From the profile, I sampled key expertise that would be relevant to this project; Tevo brings onboard the experience of co-founder of The Catalyst Swarm and catalyst school. Aside that, Mr. Case expertise in  marketing, outreach, video tagging, and communicator will also be relevant to the project per its design. Obviously the role of a video editor would be required here and Tonis' profile suits this. In addition to these expertise, the proponent provides a clear role of each team member. Based on this, we know who will do what at what point along the project implementation. The overall experience and expertise of the team clearly suit this proposal and are well positioned to navigate through the possible challenges this project may face. The downside to the team’s bio is the absence of attached external link that proves the expertise and experience of the team. I implore the team to make a little amendment to the project to include all the available profile links. the roadmap outlined for this project raises critical questions. It fails to provide actual time horizons that would lead to project implementation. At what specific time does the project aims to set off before fund 11?And when it set off what activities would be performed from start to finish? What are the timelines for such activities? The general information on the plan for project implementation is so generic. More information is needed on the roadmap so as to know the sequence of events to be undertaken to ensure project implementation. For example, even though the proponent intend to market the project in several channels to increase the participation, I wish the team indicates when this would happen. I would entreat the team to refine the roadmap to provide answers to these questions. Again, the budget structure does not tell us the breakdown of each identifiable item. Lumping facilitating, Project Management, and documentation together with an allocation of 2500$, makes accountability difficulty. In my view, there is a market value for each item, therefore for purpose of transparency each needs to be priced separately. Aside that, amount allocation of $1500 for video editing and content improvement is overpriced per my understanding of market value for these items.", "q1r": 4, "q2": "The information on the metrics suggested here is precise with a more quantitative data. The overall impact the project seeks to make here is to improve the quality of the proposals in the Cardano Catalyst community. In that regard, the proponent suggest indicators such as number of participants of live workshop sessions, number of views captured with Youtube mini-proposal workshops, number of views captured with Youtube mini-proposal workshops, number of views captured with Youtube mini-proposal introduction videos to chapters, how participants rate the proposal workshop effectiveness after the session with a (1-5 score rating), how do participants rate how ready their proposal can be ready for funding (1-5 score rating) after all the workshops and how do participants rate how well was their feedback considered after the session with a 1-5 score rating. For each of these indicators, the proponent assigns specific milestones to help determine the progress and the success of the project. Nonetheless, i suggest the team provides time limit for achieving these milestones so as to make the auditability more comprehensive. Already, the proponent has attached documents of their progress report for their project in fund 7. This indicates the team readiness collect data on these KPIs. However, how would the progress report be made available to the catalyst community? I suggest the team makes such update available to the catalyst community via their social media channels. ", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4896, "q0": "The proposal is helping fund seekers to write good and effective proposals understood and accepted by Cardano voters. It is carried out through workshops online. The aim is to improve the quality of the proposals submitted. Such that it will cater for a 4.2 rating or higher awarded by the proposal assessors. The materials used in the workshops can be reused and facilitators can be adjusted.  I also see the advantage that the workshop materials can be updated in views of changes, although the proposer has to be made aware of. Failure to detect the alterations would make the program fail to achieve the objectives.\n\nThe proposal stated that this workshop caters for all who wish to raise funds through Cardano community, that of course it includes the students and indeed is very helpful to them.\n\nI see that this proposal not only meets the objectives of the challenge and the campaign requirements, it will have a great impact on the quality of proposals submitted in the IdeaScale  community. The proposal has been funded in the funds and the team members have the required experience and skills for the successful implementation.\n\nWith that, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal has a very clear and detailed plan with timelines to work on the program. The team will start the session for fund 11. In their plan they have considered the updated requirements or changes to the workshop material content. They will market the program to increase participant numbers, they will have a lot of interaction with the participants to consider all the key points for quality proposals. They will have tracking mechanisms in place to collect statistics and to gauge the progress. \n\nThere are three team members and each is allocated with essential tasks and is in line with the budget requirement.\n\nI am clear about their proposal and their plan of action, their experience and their expectations. I can see that they will succeed in the implementation, and therefore I strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer uses catalyst Swarm to track the progress of the project. It has also laid out the KPIs that are relevant and has targets set for each metric to measure the success of the proposal. The team sees the workshop as being a continuous effort to promote quality proposals. \n\nAll the information provided leads to the auditability of the progress to success. And therefore I have no doubt that I strongly agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2631", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 4803, "q0": "Proposer clearly presents the problem that proposers don't have the experience to make their proposals understandable to voters and offers a solution in the way that he will implement workshops that help participants create a proposal and effectively communicate the objective to voters. Helping community members learn how to make a proposal that will be rated 4.2 and higher by PA definitely affects and adds value to the Cardano ecosystem. Challenge settings of this challenge are not demanding so this proposal with its key metrics and goals is in align with challenge settings and proposal is able to scale to address future challenges. ", "q0r": 5, "q1": "The team of three people presented themselves transparently via LinkedIn so that we have a clear insight into the necessary skills, knowledge and experience needed to complete this project. The team received funding in F6 and F7 for its work so it is known to the community. The budget is within normal limits and a budget item has been created. A detailed plan for the implementation and realization of this project was elaborated and presented and the time frame within the project will be realized was also mentioned. The team states the possible risk in the proposal and offers an adequate solution if the risk appears at all.", "q1r": 5, "q2": "I'd love to see a detailed roadmap so the community knows what's happening and when! Maybe by months or weeks? The KPIs have been elaborated and presented and the project will be presented on multiple channels so that the community can follow everything planned in this project without any problems! ", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 4120, "q0": "This proposal is well organized and addresses a key need in the growing Catalyst community, which is how to produce better proposals by delivering effective proposal communications in an environment that is dynamic and also constantly growing in complexity.  And given that the proposal generally aims to improve proposal quality, I believe that it is appropriate placed in the challenge which addresses helping student entrepreneurs to grow their reputation by delivering high quality ideas.\n\nI look at this proposal from two perspectives.  1) As an entrepreneur, where developing and scaling a business is often secondary to the skills required to pitch and attract investment for ideas - since those skillsets often do not overlap.  2) As a former student, where academic performance is often measured by standardized testing, where scores can more accurately reflect the students ability when they have prepared for the test (format, duration, and content) and and are better prepared to apply their knowledge in a format that is new to them.  And from both of those perspectives, it is easy to see the value the proposers offer in terms of delivering an impact to Catalyst which is well defined in terms of goals, and strategically impactful in terms of engagement and content distribution.\n\nThe overall quality of the mini feedback videos provided as a sample of past work is high, and the proposer also did a great job of providing data from Fund 7 and 8 (after being funded for similar projects in Funds 6 and 7) which prove the effectiveness of their approach and how it aligns with their objective goals to help proposers exceed a certain overall rating.", "q0r": 5, "q1": "Given the abundance of well organized data to show past performance and objective results from previous funds, it is clear that the team is knowledgable on implementation of their and monitoring the results.  The team chose tools such as Dework and Miro to manage workflow on this proposal and have demonstrated that they were successful in similar endeavors by maintaining a Swarm branding to track content production and visibility over time.  The team's experience and history of collaboration also lends high confidence to their synergies as it relates to producing high quality work that is transparent and measurable.  And finally regarding budget requested, the proposal distributes chunks of the $5000 USD to different efforts based on an estimate which is not described in great detail.  While previous proposals from this team had a more clear cost calculation and operations estimates, the results of those projects are sufficiently detailed, so I could acknowledge that the proposer likely aims to achieve more flexibility on use of those funds even though the funding request was slighly increased.  Considering all elements of the proposal and supporting information presented, it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The problem statement is well defined, and the proposal presents concrete KPIs both in terms of community engagement with their project as well as target scoring metrics for participants in their workshop.\n\nWhile I could have had a higher confidence in a roadmap containing timelines to show that the team has allocated resources on a realistic schedule leading up to their Fund 11 deadline, I do have confidence that tools like Dework will allow them to meet the goals via an agile workflow process with some flexibility to adapt to new developments along the way.", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4004, "q0": "In my understanding, this proposal aims to host several mini proposal workshops in order to increase the quality of proposals. There will (hopefully and probably) always be new proposers who will appreciate getting help improving their proposal quality. Higher quality proposals possibly leads to easier decision making for voters, easier workflow for PAs and creative ideas presented clearly. Even though the workshops would be less relevant after the ’finalizing’-stage, it does still bring important value in the Catalyst process, albeit for a specific part of the process (The proposer has acknowledged this in the proposal). \n\nLooking at the wide picture, this proposal addresses the challenge effectively by creating a space where the targeted student entrepreneurs can come for guidance and development of skills. For it to be a complete match with the challenge brief, I would have liked to see a heavier focus on on-boarding new student entrepreneurs into these workshops. I might be missing something, but the proposal seems to focus on people that already have come in contact with project Catalyst. I believe (personal opinion) that these workshops would be invaluable for new student entrepreneurs, but at a later stage after being introduced to Catalyst. Having said that, maybe students are exposed to these workshops without proposing, and then attending the next fund with a proposal after learning about the process. \n\nAll in all, the proposer addresses the problem and proposed solution in a way that communicates a lot of understanding and commitment. Scalability will be uncomplicated as long as the workload of the team members is adequate. I agree that the proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team has experience of being part of Catalyst since previous funds, both as funded proposers and other prominent roles in the community (Catalyst Swarm, Catalyst School etc). Their experience and knowledge of Catalyst paired with the flexible attitude of adapting to what is needed in the workshops is indeed a very strong combination. It is not hard to track down the evidence of the teams track record or competence, since everything is provided with links (A follow-up track record and short statistical analysis from each proposal? Provided Curriculum for the workshops? If every proposal included this like it does in this proposal, my job as a PA would be a lot easier). \nThe videos are all public, so we can easily see deliverables from earlier proposals, and how they are treated and developed through time. \nWe’re provided with a clear timeline presenting each step of the process in a detailed way. If I could wish for something, it would be to include further explanations on how the team manages outreach. What channels are they active on, is it just Cardano related channels? It is not imperative information to include, but some info on how they plan to increase participation rate would make this proposal even stronger. \n\nAs a teacher and researcher, I’m figuratively thrilled to see so much material provided in the proposal, when trying to understand the contents and thoughts behind these workshops. By reading the documents and watching the videos of workshops (and feedback of these), it gives me a good chance to understand not only why or what the proposer wants to achieve, but also how. \u2028\u2028We are presented with a reasonable budget allocation, divided between the three team members based on responsibility areas within the project. One suggestion I would give to make the proposal even stronger is the inclusion of an estimate of the working hours for each person. This would make the division of labor a bit clearer, which might be valuable when for example understanding the actual workload of the project (for those of us who doesn’t have experience in video editing, for example). \n\nAnother aspect that speaks well of the potential success of this proposal, is that the team aims to implement it starting Fund 11, giving them ample time to finish current proposals. The risk of the study material being obsolete (due to the rapid changes that can happen between funds) is highlighted in the workshops, and addressed accordingly. \n\u2028As a whole, I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "As mentioned under ’feasibility’, the proposal gives us an easy opportunity to understand each stage of the process via a roadmap. In order to make it even more transparent, a brief explanation or addition of time estimates could be added. The team has been tracking relevant KPIs (Number of workshop-attendees, proposal score of the workshop participants, youtube viewings, etc) throughout previous funds, and plans to continue doing so. Catalyst Swarm is present and very active in many different social media platforms (Youtube, Discord, etc) so communicating with the team and tracking the progress of development will be an easy job for most people. There seems to be room for development (as addressed by the proposer) in regards to scalability and outreach, but the team provide us with realistic target numbers for these aspects. (Increasing average video views from 30 to 40, for example).\nThe project KPIs provided show a steady increase in proposal quality (the ones who attended the workshops), which is further evidence of continued development and competency. \nConclusively, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_2504", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3508, "q0": "The proposers' contributions to the Cardano ecosystem clearly precede the submission of this proposal.  The importance of the topic they plan to address is as indisputable as their experience and efficiency in it.  Tevo Saks is a reference in the development of workshops that facilitate the access of the general public to education on key topics of Project Catalyst dynamics.  Therefore, taking into account all of the above, it can be stated without a doubt that this proposal contributes to the progress and growth of Cardano.  However, unfortunately the guidelines of the \"Challenge & Scouted for Students\" challenge in which this proposal is being presented, are quite clear in specifying the purpose and characteristics of the proposals to be presented in the framework of this challenge: the proposals must be initiatives of college or university students. As someone who has made a career in the world of teaching and entrepreneurship, the reasons given by the challenge for such categorization are quite reasonable and correlated with reality.  I quote: \"... the number of proposals to Catalysts is increasing rapidly, and the community does not easily notice small-scale proposals from students... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new Category exclusively for students. In addition, instead of the roadmap being ambiguous, we set a budget limit of $ 5,000. By doing so, many students can experience funding from Catalyst.\"  In my experience, these reasons become strategically important for an organization in search of innovation that will put it at a positive distance from its competitors (as in the case of Cardano).  That is the reason why I must drastically downgrade its rating to 2 stars since I consider that this proposal would be perfectly suitable in another category, occupying a place among more mature proponents.  Basically, this challenge is a seedbed for proposals that are still looking for their way, even a place to fail.  That's how the innovation business works, and it's important to keep it as healthy as possible.", "q0r": 2, "q1": "The effectiveness of the implementation plan and the experience of the proposer's team are aspects that have already been tested through the funds, therefore, there is no doubt about the proposal's capacity to be executed.  A careful review of the material provided by the proposers (recordings, Miro dashboard, documents), reveals a proposal supported by a solid structure capable of delivering results.  Likewise, the proposers have judiciously adhered to the maximum budget limit specified by the Challenge characteristics ($5000usd max).  Regrettably, the submission of this proposal in this strictly student-designed challenge makes its implementation plan unsuitable for this Challenge, since at the end of the day it does not correspond to the purpose for which it is intended.   I have no doubt that this proposal would be a solid one in the right Challenge, with more mature proponents.  This is why I must remove two stars from your rating.", "q1r": 3, "q2": "A review of the documentation provided reveals a proposal with an information system capable of providing the data that the community requires to know in detail the progress of the project.  At the same time, the willingness to use a mechanism for public registration of activities (Dework, in this case) shows not only the ethics with which the proponents will execute the project, but also their position to make their actions transparent.  Therefore, I have no doubt that this project has solid auditability mechanisms and an implementation team willing to put them at the service of the community. ", "q2r": 5, "assessor": "z_assessor_2462", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "You argue that this proposal dosen't have an impact for the students and and it would be more suitable in a another category. I disagree since we have had students in our past workshops and it has helped them. Not only by teaching them how to make a suitable proposal for the voters. Though our experience with working with numerous proposers we are able give general guidance, find the according scope for their ideas and help to fill the missing links that the proposer might not notice. As for feasibility you don't give any clear reasoning why this category was rated lower besides the fact that allegedly this dosen't benefit students.   "}, {"id": 7648, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge because the proposal identifies a problem within the challenge which needs to be addressed. That is  most student entrepreneurs are suffering from resource shortages due to large quantities of their proposals don't get noticed by voters and therefore to don't get funded.  The proposers solution to address this problem is through the organization of a mini proposal workshops for these people in order for them to create purposeful proposals that catches the eye of the voters through their impact and feasibility and clearly and effectively communicate their objective to voters. \nThis proposal also clearly articulates how it will add value to the Cardano ecosystem through guiding student entrepreneurs to write impactful proposals that will gain the attention of voters in future funding and therefore most of them get a higher rating for their proposals and therefore get funding for their proposals to create the impact that Cardano expects from these student entrepreneurs. Also, these proposals will be easily  understood by proposal assessors and voters. In the long run it will make the work easy for everybody in the Cardano ecosystem and they will get purposeful projects that makes the necessary impact to the community. The key metrics and goals of the proposal align with the outlined challenge settings which includes increasing the number of applause and comments from the community for proposals from these challenge category through the quality of their proposals. It is also able to scale to address future challenges as it be a workshop which will continue to address this challenge so far as funding rounds continue in the project catalyst. And it clearly articulates a plan for the project's future sustainability.", "q0r": 5, "q1": "The proposers have provided evidence in the form of references, links, social media pages etc of their relevant skills and experience they possess and needed to implement the proposal having been funded in fund 6 & 7.\nMoreover, the proposer and team from the links provided have the desired skills and experience to be able to execute the project should they be funded taking into consideration their previous work in the field with regard to the team such as Tevo, who is the  Co-founder of The Catalyst Swarm and Catalyst School. Who also posses a great skill in organization and feedback. His experience is in Improvement process and makes it a more inclusive and helpful experience for participants, Caue, is also the Creator, Founder, and manager of \"Catalyst School LATAM.\" Possesses a marketing, outreach, video tagging, and communications skills and just mentioning a few. \nMore importantly, the proposers have identified the manner, the type and number of team members required to implement the proposal that will ensure its impact will be felt by the participants. \nThe proposers have done well by providing a detailed budget, broken into identifiable bits and know how they are going to use it to execute the proposal if they be funded.\nAnd finally, the proposal has outlined the milestone by providing duration with which the project will be run for which is going to be rolled over each funding round. Proposers have also highlighted the potential risk of the project and how they will mitigate them which is commendable. \n\n", "q1r": 5, "q2": "The proposers have provided a clear roadmap with milestones and a clear time horizon for measuring their achievement. That is, they will be using a public Dework space in the Swarm Dework project board to track the main tasks which were described in the feasibility section which where they will start the sessions a few weeks before the Fund 11 Proposal Submission Stage and from there they will be conducting several sessions to prepare a proposal for the Proposal submission stage with the participants. \nFurthermore, they have a well-thought out Metrics/KPIs that define the success of the proposal such as, how many proposers found value in the workshop and created a proposal? How many of these proposals got over a 3.8 score? etc \nMoreover, they have a clear understandable and effective solution that addresses the problem with measurable definitions of success example have at least 2 additional people who want to improve proposals, to achieve a score rating over 4, get around 40 views per video and many others. \nAnd finally, they have provided an accessible public channel for delivering regular updates to the community for auditing progress which is their website . https://app.dework.xyz/catalyst-swarm/mini-proposal-worksh\n\n", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "I wonder why you lowered the rating in the auditability section? I don't see your reasoning through your assessments. "}, {"id": 12587, "q0": "The challenging issue to be solved here is that the proponents do not have the experience to make their proposals understandable to the voters. the proponent who has come up with it will add value to the ecosystem. By hosting a webinar, everyone will brainstorm, make decisions, and optimize their strategy to build a viable idea. Will result in a proposition understandable to Cardano Catalyst voters. There will be approximately five workshops to refine a proposal. The main objective of this proposal is to conduct workshops that help participants make proposals and effectively communicate their goals to voters with this goal. it fits the stated challenge settings. With the stated proposal I believe it can scale to solve future challenges. Through this the proponent will gain experience to make their proposals are easy to understand for voters and they will have new knowledge and tools to expand their ability to create great proposals to improve their proposed ideas. given the impact of this project is very good, I believe this proposal can solve the challenge effectively. I rate this project 5*.", "q0r": 5, "q1": "Through the project I see the proponent has provided evidence of relevant skills and experience necessary to implement the proposal clearly and in detail. In the project, 3 members will do the project, the 1st is Tevo - Co-Founder of The Catalyst Swarm and Catalyst School. With duty to ensure completion of all required tasks. (scheduled workshops, recorded, video uploads, timestamping, feedback gathering, etc.). 2nd is Caue - Creator, Founder and Manager of \"Catalyst School LATAM.\"\nMarketing, Reach, Video Tagging and Communications\nfinally Tõnis - Almost a year of experience in Small Proposal workshops as a video editor.\nA reasonable budget for achieving a set goal, clearly outlined and broken down into identifiable items. with a required budget of 5000$ to be distributed among team members based on time spent on their activities. Considering previous experience, the proponent estimated: $2500 will be allocated to Facilitation, Project Management, and documentation.\n1500$ will be allocated for video editing and content improvement\n$1000 will be allocated for marketing, outreach and communications. The amount of funding is appropriate and no further funding is required. The proponent has provided a realistic timetable but I find it unclear, I would like to know more about this project. how long does it take? and what is the plan for each milestone? at the milestone what will it need to do? The proponent has considered the challenges and risks associated with the successful implementation of the project(Risks) The biggest is the research paper, represented in the workshop, which may expire in time.) Given the feasibility of this project I think it is quite good but unfortunately the proponent has not clarified the real time. project implementation, making it impossible for me and everyone else to keep track of the milestones and the whole process. With this feasibility I rate 4*.", "q1r": 4, "q2": "As far as I said in terms of feasibility, the proponent has not given a clear roadmap with milestones and timelines to achieve. this is a weak point of this project. besides the proponent is very well defined about the success of the project, the proponent has analyzed it very clearly in detail. inclusive and equitable quality education and the promotion of lifelong learning opportunities for all. By 2030, increase the number of young people and adults with relevant skills, including technical and vocational skills, for employment, decent work and entrepreneurship. I rate this proposal 4 * because this suggestion doesn't really give me enough information.", "q2r": 4, "assessor": "z_assessor_3438", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Implement workshops that help participants create a proposal and effectively communicate the objective to voters", "experience": "This proposal was previously funded in Fund 6 and Fund 7.\nOur team has combined experience in team leading, system facilitating, marketing/communication, video editing, and overall experience in the Cardano community."}