{"id": 422068, "author": "adaku", "title": "Black & PhD: Writing retreat for PC", "url": "https://cardano.ideascale.com/a/dtd/422068-48088", "category": 26599, "amount": 4970, "description": "Young black entrepreneurs get less business funding than their counterparts. Lack of opportunity for these groups is problematic. Project Catalyst is a great way for Black PhD’s to grow businesses.", "f6_no_assessments": 11, "f6_rating": 4.121212121212121, "videos": [], "media": [], "f6_assessments": [{"id": 3510, "q0": "The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge approved by the Catalyst community last fund, is to provide college and university students a space completely separate from the regular Catalyst funding environment, in which they could bring their projects to our ecosystem and get base funding, nothing financially ambitious.  Clumsy projects, with flaws or weaknesses if any, but with an authentic innovative and creative student spirit, insolent and daring, that could find in our community a place to learn and get involved, a playground endowed not only with money, but even more valuable, with the possibility to get your hands on the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it.  That's exactly what this Challenge is trying to do: build a suitable habitat for students.\n\nBecause of my affinity with this Challenge (formal experience in education at the college, university, corporate level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students.  \n\nThis proposal struggles to meet the conditions clearly stipulated by the Challenge in terms of proposer type and budget, as one who stealthily walks a very thin line.   The proposers are students of course, but PhD students, proposing an event for PhD students.  The proposal describes a scenario in which they will bring together PhD students in a two-day event called Writing retreat, where they will have the opportunity to work on their own projects while working in parallel on projects focused on Project Catalyst.  \n\nAs an educator, I understand the intent behind the proposal and consider it completely valid.  As an educator and as a member of Catalyst I find many moving parts that fail to stand still.  On the one hand, I feel that this proposal is not designed by or for the type of students that the Challenge is intended to support. I quote (excerpted from the Challenge information) \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section).  On the other hand, as clearly described in the proposal, the two days of the event will be arranged to address both own ideas and ideas that can be taken to Catalyst, in a 20%-80% distribution (20% for own ideas, 80% for Catalyst ideas).  In my experience, two days is already too short for only one of the two subjects, not to mention the irrefutable fact that working on one's own ideas is much more exciting than on other study subjects. I find the 20%-80% distribution a difficult promise to keep.  At the same time, the proposal does not mention that the PhD students will somehow already bring some advanced Catalyst ideas to the event, so in that area they would be starting from scratch.\n\nIn conclusion, the reason I am taking three stars off the final rating is because I do not find the proposal in keeping with the spirit of the Challenge in which it was presented, and the potential results of the two-day event unsound.  However, I agree with the proponents, the Writing retreat type of events can become amazing incubators of new ideas, like the less sophisticated incubator of ideas and innovation that the Challenge \"Challenge & Scouted for Students\" intends to create.  \n\n", "q0r": 2, "q1": "The implementation plan described and the budget explained correspond in general terms to the execution of an event of the magnitude suggested by the proposers. Based on the information provided, the planning time (6 months) and the activities to be carried out during that time outline a path of adequate and judicious execution.  The variables to be monitored and adjusted if necessary appear to be within the controllable range.\n\nHowever, it would be valuable to have more in-depth information regarding the degree of knowledge regarding Project Catalyst that the students came to the two-day event with. I fear that if their prior knowledge is non-existent or basic, proper instruction will take up much of the event.  In the same way, and reiterating the point made in the Impact section of this evaluation, it would be desirable to have an understanding of the degree of progress the students will make in the field of ideas to be presented to Catalyst prior to the two-day event.  If such progress is non-existent, much of the event will be taken up by the idea conception phase.  If there is no work prior to the event in the area of instruction in the dynamics of Project Catalyst and the obligation of a previous work on the ideas to be presented to our ecosystem, the effective time of the event (2 days) will be really insufficient to reach a concrete positive result.  I proceed to remove two stars from the final rating as I cannot find any information related to these issues. ", "q1r": 3, "q2": "In my opinion, \"Number of proposals that participated in the next fund\" is one of the metrics that should be taken into account at the end of the implementation process.  However, measurements during the project execution process should be carried out to establish the health of the project during the 6 months of its execution.  Relevant measurements of the receptivity of the PhD students to the proposal that the project formulates, measurements of their expectations in relation to the project (Cardano as an ecosystem provides the necessary tools to develop their ideas? Cardano and Catalyst are a suitable environment for their ideas?), type of approaches that students can get to have during the 6 months of project planning, prior to the two-day Writing retreat event (attendance to Town Halls, participation in Project Catalyst telegram and discord channels , participation in Swarm events, etc).   \n\nTherefore, in my opinion, the KPI formulated in the Auditability section should be complemented with other KPIs describing the evolution of the project during the 6 months of its execution.  The lack of them leads me to remove two stars from the final rating.  ", "q2r": 3, "assessor": "z_assessor_2462", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3841, "q0": "The problem of the proposal is that young black entrepreneurs lack opportunities in Project Catalyst and this is stated clearly in the proposal.\nThis proposal seeks to solve this problem by doing a writing retreat where black PhD students and Postdocs work on their research project 20% of the time but 80% of the time will be spent collaborating on a Cardano related idea which they will submit in the next Project Catalyst round (Fund 10). Writing retreats have similarities to hackathons, which is perfect for Project Catalyst proposals. \nAddressing the challenge, the proposer is saying that part of the writing retreat will include educational sessions on Cardano and Project Catalyst and this can be a perfect measure of the number of proposals that participate in the next fund. During retreats, their ideas can be supported by interested engineers in the ecosystem. \nRisk and mitigating strategy was mentioned in the proposal. Their stated risk is maybe too many applications than expected, but this can be regulated by some self funding of some projects.\nLooking at the details above, this proposal has addressed the challenge very well. My rating is 5.", "q0r": 5, "q1": "The implementation plan outlined in this proposal is shown to have timelines and key milestones. The whole project is seen as a 6 months project, and it is divided into monthly timelines with specific duties added. For instance, month 1 is for recruitment of facilitators and solidify program structure, to mention a few. \nThe budget total is $4970, which is within the limit set by the challenge. It is broken down into the smallest detail cost and a very comprehensive budget.\nThe team is made up of 2 persons who one is a PhD holder and the other is a PhD student. The credentials of both are impressive and are capable of implementing the proposal. \nThe team has indicated that they will return to Catalyst for more support for more writing retreat in the next round of funding.  It is again indicated that they are involved in other proposals in Fund9.\nMy rating is 4.", "q1r": 4, "q2": "To track the progress of work, the proposal has indicated that there will be a clear measure for the 'number of proposals that participated in the next fund' (this is key according to the proposal), and they will make this clear during the writing retreats that their ideas can be supported by interested engineers in the ecosystem.\nHowever, where to access the reports of the progress of work is not mentioned in the proposal. \nSuccess story of this proposal will be seen at the end of the project as participants will be able to write proposals for Fund10; participants can access opportunities in Cardano, and participants will have gained experience networking and collaborating. It is indicated that it is a new proposal. \nApart from the absence of where to send the reports for access, the other information will help to audit the proposal well. My rating is 4.", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 4007, "q0": "From my understanding, the goal of this proposal is to create and host a writing retreat for PhD students and Post-doctoral students (of african-american decent), where the group collaborate on creating ideas that could be implemented on Cardano. At the end of this Research-hackathon, the group will hopefully have submitted (with help from the organizers) one (or several?) proposal for an upcoming fund in Project Catalyst. \nThe issue of inequality will always be important, and creating a space where marginalized academics can collaborate on creating ideas freely rhymes well with the core values of the Cardano Ecosystem. I would have liked to see some statistics reflecting the inequality in academia (as stated in the proposal), just to provide additional weight to the problem statement. \u2028\u2028The fact that one of the two proposers are PhD-students and that the proposals target group is PhD students makes this proposal very much in alignment with the challenge setting. Especially since it also aims to have these students submit proposals in Catalyst. (Which hopefully will lead to further involvement with the ecosystem, and collaborations with developers, engineers, etc). \u2028\u2028Due to the limited spots of the planned writing retreat (12), the proposer is well aware of the risk to fill all the spots. In my experience as a researcher and organizer of similar events, the proposed solution of asking the participants to see if their respective universities would like to offer some funding for attending is a good one.  \u2028This concept is easily scalable and spread to other universities, universities being a perfect place of looking for young specialists in different fields. Theoretically, each of the 12 participants could be inspired to organize a similar event after attending, which would in turn have the potential of continue spreading throughout the world. \u2028\nThe problem statement and solution is presented clearly, and I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal includes a roadmap with milestones on a timeframe of 6 months. \nI don’t know if this is a mistake when writing the proposal, but the proposers states to submit proposals for Fund 10, whereas the roadmap ends with hosting the writing retreat after 6 months (which would in turn make it more realistic to host the writing camp close to Fund 12, since each period is roughly 3 months long). Apart from that, the milestones from the roadmap seem realistic enough to be carried out successfully. Gathering applications (especially if it will include participants outside of the organizing country) is time-consuming, and it will give the proposers more time to focus on creating educational material (also mentioned in the roadmap). \n\nThe team consists of one PhD student and one Post-Doctoral researcher, the academic specialization of the two (engineering science, game intelligence) is easily relatable to a lot of existing proposals in Catalyst. We are provided with LinkedIn-profiles of the two (along with the official website and instagram of the organization), that makes it easy to verify their experiences of both academic studies and their other (impressive list) of competencies. There is also experience of organizing writing retreats successfully from before, along with other events that demand a lot of planning and organizational skills. In order to create a closer connection to Catalyst and Cardano, the team plans to hire a Cardano workshop mentor/facilitator, a wise decision since it is an area of expertise well needed if the writing retreat is supposed to culminate in proposals for Catalyst (with participants that have no experience of Cardano from before). \u2028The team has two other proposals for Fund 9, and I would have liked to see a paragraph included in the proposal where the proposers discuss potential risks (and how to mitigate those risks) in regards to the workload, if all of the proposals are funded. \n\u2028The budget is clearly presented, and seems (from my experience organizing similar events) to be realistically planned for, also leaving some leeway if a participant is in need of further support for accessibility (which is a nice addition to the budget breakdown). If I were to make a suggestion it would be to include an estimation of working hours for each person (and responsibility areas), considering the two team members are involved in other projects. Who will do what part of the process, for how many hours? \n\u2028Apart from the small suggestions mentioned above, I agree that it is highly likely that this proposal will be successfully implemented.", "q1r": 4, "q2": "As mentioned under ’feasibility’, the roadmap is clearly provided with milestones on a timeframe (excluding the confusion of having the project finish for Fund 10 or Fund 12, also mentioned above). \nThe team has an instagram account with around 900 followers, having an active global network established already before the project starts is certainly an assuring factor when assessing the level of auditability for this proposal. The proposer has chosen reasonable KPIs relevant in measuring the success of the proposal (Number of proposals that participated in the next fund, and of course number of participants). If the upcoming proposals from the students are funded, we will also be able to track the development progress through Ideascale and Catalyst. Considering the plan of the proposing team and the relatively small scope of the proposal, I strongly agree that this proposal provides me with sufficient information in the project attaining its stated goals. ", "q2r": 5, "assessor": "z_assessor_2504", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4805, "q0": "This proposal presents the problem that young black entrepreneurs receive less funding for business than their white colleagues and offers an adequate solution. It is very difficult and I regret that there is even a concept in today's world that opens or closes doors because of the color of the skin. I am ashamed! The proposer clearly explains how this project will add value to the Cardano ecosystem. Key metrics are clearly presented and the offering is aligned with the challenge settings and the proposal is scalable to meet future challenges. Through a well-developed plan, this proposal clearly gives us information about future sustainability.", "q0r": 5, "q1": "The team of two people presented themselves through links via LinkedIn, from which we can see that this team has experience, skills and knowledge, and that they know the issues of this matter very well for the realization of this project. The entire performance plan is presented by month in a realistic period of time, and since everything has been worked out in the proposal, the team will not have any problems during the performance. The budget was also presented and it is within normal limits, and the community/voters have a clear insight on what the money will be allocated to. The team has an idea of the possible risk and is ready if the risk occurs.", "q1r": 5, "q2": "A roadmap with milestones by month is clearly presented, but I would like to see when this project starts and ends! Ex. Start Q4 2022. finish Q2 2023. KPIs are presented in the proposal and can be used by the community to monitor this project. The team represents the idea of the success of this project and the solution that addresses the problem is clearly communicated.", "q2r": 5, "assessor": "z_assessor_2616", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5854, "q0": "This proposal effectively addresses the challenge. It provides an opportunity for PhD students to meet together, brainstorm and bring out ideas that will be contributed on the Cardano ecosystem to make it better. \nCard and as a growing ecosystem can tap a lot from the intellectual capacities of these students and they are I boarded to the ecosystem and start participating in project catalyst. \nThe students will also get to connect with the experienced engineers in the ecosystem to support them nurture their ideas. \nI think this proposal is awesome. ", "q0r": 5, "q1": "The outlined plan is elaborate. It includes timelines and milestones that are clear to follow through. The team already has a community of PhD students so recruiting participants will not be difficult. Since the writing retreat is something they do, I believe the team has the capacity, experience and skills to deliver. Links are given to their experience and skills. \nThe fund requested is within reasonable limits and the budget is well presented.\nIn all I think if this proposal is funded, it will be implemented successfully.", "q1r": 4, "q2": "the success metrics presented by the team are practical. The milestones with timelines can be used to track the progress. Key performance indicators are also presented to enable auditing of progress. The account given is clear and that means accountability is assured. \nAuditability is possible for this proposal. ", "q2r": 4, "assessor": "z_assessor_2754", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 8946, "q0": "As Racism is one of the worst hit diseases around the world , where people are denied from their educational rights due to color of their skin which is not to be tolerated, Hence the proposer wants to help these people and and conduct a small workshop and where they can focus on their research for small amount of time and rest time is assured for t collaborating on a Cardano related idea which they will submit in the next Project Catalyst round of fund 10 , so that they can get proper funding support from cardano ecosystem, this also help in growing cardano ecosystem still stronger, Hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan presented doesn't involve much risk in it where it just needs to recruit members who are working on Ph.D. however \"Black and PhD\" network already exists of PhD students globally, with 900 followers already hence recruiting members from there wont be difficulty , and in next stage conducting workshop and teaching them can also be achieved as proposer himself has a experience with writing retreats, one being the Digital Economy CDT Network (DEN) 2-day Writing Retreat and attended during their PhD programs , the proposer wants maximum students to submit project for fund 10 program catalyst , Hence with Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly mentioned the issues faced due to racism during funding of research program , and has provided counter measure to erase such bad practices in the proposed solution, the audit has introduced all the members who will be participating in the project with their expertise field ,where majority are of Ph.D. Students.\nAudit contains detailed budget breaking idea , it even contains well structured timeline to complete the project to make the project more efficient , with key indicator to measure the number of proposals that will be requested by proposer's team, with minimal risk involved  the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9654, "q0": "The problem of black academics who are also entrepreneurs not getting as much funding as compared to other students directly falls within the domain of the challenge. The solution to bring together black academics together and develop proposals for funding and increasing visibility of particularly black students among engineers is in line with the challenge  The proposers also indicate that 80% of the time spent at the writer's retreat will be dedicated to developing Cardano related ideas which clearly demonstrates a positive impact on the Cardano ecosystem.", "q0r": 5, "q1": "I strongly believe the project implementation is feasible because the proposers clearly  articulate  the components of the project and the  description of the skills of two team members is in line with the activities to be executed. However none of them have expertise in Cardano or blockchain and have indicated that they will recruit facilitators with this expertise. Also, the budget for the proposal is perfectly written and gives a detailed breakdown of the cost of all components for implementation of the project. The amount of 300 dollars allocated for travel, food and accommodation for one night is reasonable considering that the project setting is in the UK. The period of 6 months during which the project will take place is realistic and is supported by an implementation plan for each of the months.", "q1r": 5, "q2": "The proposers indicate that a key performance indicator would be the number of proposals from black PhD students in the next fund as well as the number of collaborations with engineers. However this outcome could be as a result of other forms of education and awareness creation and not necessarily because of this project. Moreover,  the KPI presented means that we would have to wait till the next next fund to see whether the project was successful or not. This may stall the process of auditing and is not very efficient.", "q2r": 3, "assessor": "z_assessor_3078", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11556, "q0": "The proposal idea corresponds to both the Main Cardano pillars and the current challenge setting in which the project was proposed. To begin, the project correctly identifies science and research as one of Cardano's building blocks, and that by supporting students, particularly PHD students who actively conduct peer-reviewed research, the entire Cardano ecosystem can be subsequently enriched by highly educated individuals. Furthermore, the inclusion and encouragement of people of all races and cultures aligns with Cardano's goal of open participation for all. Furthermore, by hosting a hybrid writing retreat for black PhD students, more students will be educated on how Cardano can potentially fund their endevour for knowledge, innovations and creativity.From the standpoint of the Catalyst community, it is also a fantastic opportunity to bring in knowledgeable individuals from various scientific backgrounds and enrich the entire community. All of the previously mentioned statements show a clear alignment with the campaign by increasing Cardano esposure among students and, as a result, creating a platform for ideas to be shared with the community. According to the proposal, the scale will include both local black (UK students) and international students. Finally, as stated by the proposer, the project is likely to scale by organizing larger retreats in future FUNDs.", "q0r": 5, "q1": "Based on the information in the proposal, I believe the project is likely to be realized for the following reasons: 1) The budget is detailed, with no gaps in information, describing the rationale behind each item, including the mean of the budget calculation. 2) The total budget does not exceed the challenge's total limit per proposal. 3) The team members are either PHD students or PostDocs in business and technology-related fields. 4) Members of the team have prior experience with lecturing, teaching, coding, and writing. 5) The Catalyst program previously funded the team members.6) The timeframe is well established, including a period of campaigning and refining the retreat program. From my perspective, the timeframe does not mention a phase after the retreat's ending. Another piece of information that is unclear in my opinion is the roles and responsibilities of the team members, which are listed but not assigned to team members, and there is no rationale as to whether the Team's work on the ongoing funds and their PhD will allow them enough time to work on the project. It is well known that Ph.D. students have very little free time in general.", "q1r": 4, "q2": "While there is a good chance that the community will be able to track the project's progress and success, However, I discovered some issues with the auditing process. While the chosen KPIs accurately reflect the quality of education received during the retreat and engagement in the Catalyst community, there is no explanation of how the community will be informed about the ongoing project process. I assume social media's will be utlized for this purpose assumed on the roles listed in the \"Roles of the Team Members\" section, but it is not explicitly stated in the auditability section. Milestones/delivery dates are only mentioned in the timeline section, but I believe the only milestone of the project is a successful retreat organization. On the other hand, as a deliverable, I would anticipate a data analysis and subsequent report from a post-retreat survey from the participants. ", "q2r": 3, "assessor": "z_assessor_3256", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11819, "q0": "The black students round the world are indeed facing a lot of challenges due to lack of opportunities or insufficient exposure. Even though there are very talented students , they are not given the deserved recognition. The proposal is to have a meet up of members of the black and PhD network to come together and collaborate. \nThis is a very good idea but I have a few questions in mind. Is it really necessary to have an offline meet up? The covid situation had showed us that online platforms are a great substitute for offline meet ups . Even though there is a slight compromise of the human interaction aspect of things, I really fail to see that making a drastic change to the outcome.  Online platforms actually enable you to have meet ups with people across the world . This might also have more participation as not everyone would be comfortable to travelling such distances just for a meet up. \n", "q0r": 3, "q1": "The proposal intends to have a meet up of black PhD students interested in collaborating. The team has given a clear budget breakdown. These include hotel rooms ,meeting, booking ,travel for over a month. My concern is the worthiness of the offline meet up.  I personally believe that an online meet up will be preferable for many, and there is no worry on travel and accommodation. There will also be more number of participants in this case. But, keeping this aside, the team will not face any kind of technical difficulties; therefore there is a high chance that the plan is executed successfully. But I doubt if there would be the expected number of participation for on offline event. \nA monthly roadmap for the plan is provided by the team. As mentioned the activities could also be conducted in an online environment which will not need this amount of funding and can also have better coordination.\n", "q1r": 4, "q2": "The key success of this proposal is the offline meet ups among the PhD students and the human interaction between them. The execution of the plan is actually not very difficult .The more difficult part is to have active members participate in the program. Given sufficient number of black PhD students and scholars participate, the team has provided sufficient information on how to pull this off and to auditing track. But to be honest, there isn’t much work that needs to be or can be tracked. Once the meet is set up[, then it’s mostly discussions and ideas , brain storming among the participants. There is no real practical way to audit offline meet up and discussions. The activities could be tracked if this plan was executed in an offline set up as its very easy to audit and have records. The proposal also asks for a writing tract, whose major feature is the non-tractable environment, which is suitable for scholars and thinkers, but I doubt how much effective can it really be. \n\n", "q2r": 3, "assessor": "z_assessor_3284", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12158, "q0": "The main problem in this proposal is the difficulty of Black Ph.D. to get funding for the business. Opportunity from Cardano which focuses on research is the hope for Black PhDs to get the same opportunity to develop. There are thousands of talented Ph.D. students globally who are great researchers. Project Catalyst is a great opportunity for them to collaborate and cultivate business ideas. Their Program is to do a writing retreat where Black Ph.D. students and Postdocs working on their research projects 20% of the time but 80% of the time will be spent collaborating on a Cardano-related idea which they will submit in the next Project Catalyst round ( funds 10). Writing retreats have a similar feel to hackathons but normally work on a research project which is perfect for Project Catalyst proposals. The goal of the project are to increase the Number of proposals that participated in the next fund” and we will also make clear during the writing retreats that their ideas can be supported by interested engineers in the ecosystem,", "q0r": 5, "q1": "The proposal has a timeline for this project but they didn't describe the specific program and how to do this program, and they didn't attach a link or reference to describe the project, they need $ 4970 to run this project for 6 months so this is a reasonable budget the breakdown for the budget is quite clear and the nominal is still reasonable for each cost, and the team members are quite influential figures to influence Black Ph.D. to provide information related to funding that is carried out by Cardano. This is a very good idea but if the proposer writes a more detailed description of the program it will be better to convince the voters.", "q1r": 2, "q2": "The proposer knows technically how to do their program but in writing the explanations are lacking in-depth and the timeline is not very clear to attract attention. The target problem and the solution are being answered and it makes sense number to be achieved by limited people. This person is a passionate people strive for good value for the Cardano ecosystem. there is a focus to increase the number of participants next fund will measure their success. Their goals are for participants will have gathered valuable knowledge regarding the technologies and opportunities available within Cardano and put together a proposal that will go towards making a potentially significant impact through the Catalyst project.", "q2r": 3, "assessor": "z_assessor_3362", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13421, "q0": "The proposal is for the organization of a writing retreat during which Black PhD students and postdocs will be taught about Cardano and Project Catalyst. Additionally, the retreat will center on a collaboration between Black PhD students and postdocs on a Cardano-related idea. The goal will be to enable the students to submit this group idea and other student ideas to Fund10 for consideration of community support. The students will be able to network with the other participants and their ideas (once proposed) will be visible to many interested professional engineers. The proposal therefore meets the goals of the challenge.", "q0r": 5, "q1": "It is highly likely that this proposed retreat will be successfully implemented. For one, both of the proposers have a solid background in organizing and running writing workshops. For another, their academic achievements and extensive social network connections will greatly aid in recruiting interested participants. Also, the provided plan for the retreat preparations is well-considered. The proposed budget is a little confusing (not all the numbers on hours spent/rate charged tally properly). However, the various needs of the retreat are considered and fund amounts are allocated appropriately.", "q1r": 5, "q2": "For some aspects of the project it is uncertain how the community will be able to follow the progress and some of the success measures. The proposal does not mention any plans on updating the community during the run up to the retreat itself. Also of concern is that one success goal is subjective, consisting of “significant progress” in the students’ research and “gaining experience” in networking and collaboration. However, a short term event like a retreat is difficult to track while it is occurring. Instead, the team reasonably proposes to track its success by measuring how many participants go on to make a proposal in Fund10. In a similar way, the occurrence of submitting the group idea for funding in the next round provides a discrete measure of the retreat’s success. In conclusion, the proposal falls short of ways for the community to track progress, but whether it meets some of its goals at least can be determined later by the community.\n", "q2r": 3, "assessor": "z_assessor_3624", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Cardano’s philosophy is well rooted in research. There are thousands of talented PhD research students globally! Black and PhD is a network of black PhD students globally, with 900 followers already.", "experience": "Proposers have experience with writing retreats, one being the Digital Economy CDT Network (DEN) 2-day Writing Retreat attended during their PhD programs, their successful experience helped structure this proposed program. Both also have experience mentoring and lecturing."}