{"id": 422360, "author": "xyzzy", "title": "ADAO Learning Grant", "url": "https://cardano.ideascale.com/a/dtd/422360-48088", "category": 26599, "amount": 5000, "description": "There are very few resources available for students to develop practical skills on Cardano. The blockchain is in need of student workers.", "f6_no_assessments": 12, "f6_rating": 2.472222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 1086, "q0": "For the purpose of Catalyst funding, if the solution offered states “This grant will supply my cost of living as well as increase my quality of life”, then it is completely unclear to me what the purpose of this proposal is. The challenge setting that it’s submitted in, dedicated to students, actually has a very clear purpose and metrics described. Even so, while I understand that the proposer would very much prefer to spend his time learning about Cardano and contributing to the ecosystem, instead of having to get a “fiat job”, he needs to write a clearly defined proposal of what he will be offering in return for the funding. The term research in this context, since it is not accompanied by any other descriptions seems to me to be a little too vague, and as such, it puts me in the position where I cannot agree that this proposal can have an impact on our blockchain.\nI would advise the proposer to think about what he will be researching DAOs about, even if it’s not exact, there should be a purpose in his research and an expected estimate of results. And while one of the consequences of getting funded is that it might “increase my quality of life while researching and contributing”, that is a by-product and not the main driving force behind writing a proposal.", "q0r": 2, "q1": "As mentioned above, I am unclear about the purpose of the research that is mentioned throughout this proposal. The detailed plan does not offer any concrete details and seems to me to be too superficial, as it does not offer any specific inputs. It only paints a general solution of conducting research on DAOs and publishing the results, but no specifics are given. I would have expected some details in regards to what areas the research will be conducted in, what the purpose is, how long will it take to conduct the research, how long will it take to analyse and publish the results etc.\nWhen it comes to the budget, I found that it also does not offer any kind of details, just a mention of “5000 USD worth of ADA will be directly used to improve my ability to pursue my goals” and it will be used as a stipend to convert to cash or spend on assets - I imagine the proposer means NFTs in this case, especially since one of the DAOs he is referencing is linked to a somewhat controversial NFT project on Cardano, flagged by some members for dishonesty.\nI find slightly worrying the fact that the proposer does not provide any details about himself, and that the majority of his short team description is about the project mentor, Adam Rusch, a well-known Cardano Community member. My evaluation cannot be on the proposal mentor, but on the person who submits the proposal, to see if that person does have the necessary skills and commitment to implement the project. In this case, due to the fact that the proposer has avoided answering the question, I will consider it a red flag, especially tied together with the lack of concrete information about the goals and implementation of the proposal.", "q1r": 2, "q2": "I cannot see the connection between the research described in the implementation and feasibility section of this proposal and the Twitter spaces that will be used to track the proposal’s progress. While communicating with other individuals can produce good results in a research environment, I cannot agree with the fact that it’s a good way to measure a project’s evolution. Especially since Twitter spaces only remain available to the general public for 14 days or so, and as such, the Cardano Community would not be able to judge the implementation advancement with a method that becomes unavailable after such a short period of time.\nIn the final question about success definition, I found that it seemed to be almost from an entirely different proposal, as there was no mention of DAOs or research whatsoever, even though the goal of this proposal is to research them and publish the findings. \nUnfortunately, due to the reasoning specified above, I cannot agree that this proposal can be successfully audited by the Cardano and Catalyst community.", "q2r": 2, "assessor": "z_assessor_2192", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3512, "q0": "No career is built without taking the risks involved in the process. With many years of experience in the world outside of Catalyst and considerable time within the Catalyst universe, I can state with full knowledge that compared to the outside world, the opportunities in our ecosystem are abundant.  They are everywhere: mentors, teams, paid management positions (PA, VPA, Challenge Team member) from which you can absorb knowledge and experience from the best as a sponge, bounties chaser, funded proposer, etc.   A sense of collaboration, sharing and helping each other in such massive amounts that it is difficult not to feel this ecosystem as a real home where we try to take care of each other.  I celebrate with the deepest honesty that the proposer is involved in one of the many projects that an active member of Catalyst can be a part of (and can be a part of just by saying \"I want to\", it's that simple here).  However, from there, a path of hard work begins in which the passion and fire of wanting to do something must be fueled with hard work and sacrifice the old fashioned way: taking PA positions, Challenge Team member positions, doing some work through bounties, doing various jobs, etc.  Just like in the outside world, but with the advantage that here inside, in our community, in our ecosystem, you will find the necessary alternatives to follow your own path.  The proposal presented by the proposer does not formulate a solution to a problem, a solution that contributes to the growth or strengthening of the Cardano ecosystem, and in the business of presentation of proposals that is a fundamental parameter. Therefore, there is no positive impact to be generated from this proposal.  Consequently, I must give a low rating of 1 star.  As someone who has traveled the road and still has a long way to go while having to put bread on the table for his family, I send the student my message of encouragement and a piece of reassurance: the system takes care of those who work hard and do not let go of the bone they have chosen to defend.    \n", "q0r": 1, "q1": "The Feasability section of the proposal is a good record of the proposer's journey journal as a member of Catalyst that corresponds to one of the classic patterns that tends to end in a tangible contribution of the member to the Cardano ecosystem: description of an area of study to explore (DAO), an organization that will support his study (Boss DAO), a mentor (Adam Rusch), possible paths to take during the academic exercise (working groups, collaborative research).  It is a promising path that the proposer is charting for himself and his life project in our community.  I have no doubt that we will hear from him again very soon with a solution to a problem that will allow Catalyst to progress in understanding such a complex and emerging issue.  However, for the time being, the Feasability section of the proposal does not constitute a plan for implementing a proposal connected to a budget that will ultimately result in a solution to a problem.  Therefore, I must give the low rating of 1 star.", "q1r": 1, "q2": "In general, there is no implementation process to be measured, since there is no solution to be implemented, since there is no concrete problem that has been identified.  Therefore, there are no KPIs to measure something productive.  Consequently, since there is no object to be audited, I must give the low rating of 1 star.  However, I wish the student a path full of opportunities, because his path is just beginning, and although it may be difficult to understand, submitting this proposal was one of the best decisions he made: the next one will be a solid competitor.  The experience of submitting a proposal is invaluable.   It is a battle scar that no one can take away.  Let no one tell you otherwise.", "q2r": 1, "assessor": "z_assessor_2462", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4017, "q0": "This proposal Address the challenge as well as Catalysts over all ethos of collaboration. We are very familiar with the benefits we can receive when funding students to do research. This proposer shows great initiative by having already made connections with and getting involved in reputable organizations and actors like ADAO.  This proposal if successful could get more students interested in Cardano and even spur student research organizations.", "q0r": 5, "q1": "The main proposer does seem to have knowledge of the ecosystem and so it is of a high likelihood they have the drive and understanding needed to accomplish their goal and even get other students involved. I would have liked to see some of the initial findings, thoughts, or interesting things the proposer found along their intro into Cardano. It takes some preliminary research I assume to even find and understand what organizations like ADAO are and what they are doing. This said, the co-proposer is a well known community member and advocate of Decentralization and open source which does give me confidence in seeing this proposal successful. ", "q1r": 4, "q2": "I rated this section a 4 but that is only because as an ingrained Cardano community member I am  familiar with the co-proposer and the work that he has been involved in. I am also familiar with ADAO and all of the open source work and collaborations they have done. Although,  If I disregarded those facts I could have easily rated it a 2 or 3. In the future I would like to see some preliminary finding even if it's just the work of these other actors or organizations. I would like to see what ADAO does, maybe how you found it or why you see it to be such a great resource for completing your proposal.", "q2r": 4, "assessor": "z_assessor_2507", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 4806, "q0": "\nThe student in this proposal claims that very few resources are available for students to develop practical skills on Cardano, that's why he is ready to ask for funds to invest in himself. This grant will supply his cost of living as well as increase his quality of life while researching and contributing to ADAO and Boss DAO. This is a great idea, but I would like to see some points presented and elaborated, from which it would be visible how knowledge will progress, so that they could draw a parallel with the challenge settings and have a clearer insight into whether this proposal is able to scale to address future challenges. It would be great if a plan for future sustainability was also presented.\n", "q0r": 3, "q1": "Although the student did not provide links in the proposal from which we can see if it is a real person, he stated in the comments on ideascale via link on LinkedIn from which we can see that it is a real person. It would be good if there was a link about the mentioned mentor in the proposal, at least from the social network, in order to establish whether it is a real person. With the requested budget, the student should develop skills and knowledge for future projects. In this proposal, a budget of $5,000 is requested, but no budget breakdown has been made, through which the community would know how the money will be distributed! The student points out that the money will be directly used to improve his ability to pursue his goals. ", "q1r": 3, "q2": "It would be great to have a roadmap with an accurately and precisely worked out budget so that the community would have an insight into exactly what the received funds will be spent on and in what period of time. The community cannot follow the progress of education and the acquisition of skills and acquisition of knowledge by the student due to the lack of information. My advice is for the proposer of this good idea to join us in our weekly gatherings, where he will surely get the necessary information on how to turn this great idea into a project.", "q2r": 3, "assessor": "z_assessor_2616", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6486, "q0": "When reading the challenge, I was excited because I would agree that there are many students who need to have a greater education on Cardano's technology. However, after reading into it more. It appears that this is a grant for a specific person, rather than a group of students or a version of a fundraiser. In this proposal, I think of the old saying of Give a man a fish, feed him for a day. Teach a man how to fish, and he will be able sustain living every day of his life. I was hoping this would be a proposal that would help students learn more about the Cardano ecosystem and have a focus on the EUTXO model. I disagree that this proposal addresses any challenge in the Cardano ecosystem and I give this section 1 out of 5 stars.", "q0r": 1, "q1": "There is a lack of experience in this proposal and it suggests that these funds will be more beneficial for other proposals that will directly help the Cardano ecosystem. There isn't a very clear roadmap on how this is going to benefit the Cardano blockchain and does not give a clear time frame of how this will support the challenge. This proposal is not very likely to be funded due to lack of description and throughput. For these reasons. I give this section a 1 out of 5 stars.", "q1r": 1, "q2": "The information provided in this proposal doesn't serve a purpose. There is no need for this proposal to be funded given that there are other projects that will be building utility on the Cardano blockchain and allowing it to be more secure and scalable. There is lack of a detailed budget breakdown that aligns with Cardano's purpose and it is likely that this proposal will remain unsuccessful until reconsidered or improved. For these reasons, I give this section 1 out of 5 stars. ", "q2r": 1, "assessor": "z_assessor_2817", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6847, "q0": "When I read the challenge for Fund 9 here as a first time proposer I notice one thing immediately.  The amount of ADA is 100,000 usd for the challenge.  I then come over to read this proposal which asks for 5% of the fund.  This will be important to keep in mind.  This proposal is clearly done by someone who is looking to utilize education and help to inform people about Cardano.  Any senior in college that is a stake pool operator shows commitment to the ecosystem.  I believe this proposal addresses the challenge.", "q0r": 3, "q1": "As the proposal states, Jack is a senior in college.  His experience seems high for someone that young, but nonetheless from what I can see and read he has a lower level of experience.  The co-proposer Adam has a higher level of experience and is a core contributor in ADAO who as a community has a proven track record of developing tools for DAOs and contributing to the ecosystem.  This raises the stability even more.\n\nWhen I look at the plan it seems that it may need a little bit more detail on the timing and information.  It says end of Fall semester, but is that this Fall?  Just would like to clarify.  \n\nAll in all with the experience of Jack as a SPO and a great mentor, I believe with a little more clarity on the plan this can easily be implemented. ", "q1r": 3, "q2": "In looking at how to audit this I do have some questions on the analytics of the twitter spaces, and the way this would get measured as well.  I like the idea of him giving monthly reports and I believe Catalyst will require this as well.  I think it will be important that Jack produces some work that will connect other future entrepreneurs and keep this challenge at the forefront so we can continue to help educate and provide resources for young minds like Jack!  I do believe this proposal can be measured but maybe a few more details on what a monthly report would look like or maybe some sample data sets.", "q2r": 3, "assessor": "z_assessor_2835", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7138, "q0": "The proposer plans to use Catalyst funding in order for him to comfortably research DAOs and present the learning to the community. It is interesting to see proposals from individual students instead of a group because the workload is different, the budgeting is different, and eventually the end result would be of different scale. I applaud the initiative to propose the idea, however, there’s many details that should have been further explained. One very crucial aspect missing is the explanation of “researching DAOs”. The word research shows up many times in the proposal, but there isn’t any clear definition or domain on what exactly the proposer is referring to. Is it about DAO’s security? Is it about how to spread adoption of DAOs? The proposer should be able to clarify this further because they have experience contributing to a DAO already. Unfortunately, by failing to mention the scope of the research, which is an essential part of the proposal, I have to disagree with the proposal impact. However, I appreciate the initiative to share the learning results to other DAOs contributors through Twitter Spaces.", "q0r": 2, "q1": "I don’t feel confident that the proposal can be implemented smoothly. The proposer hasn’t provided us with their profile or references. We do know that the proposer has contributed to a DAO before. This is great because the proposer has relevant experience to start researching, but the proposer has not given us details about what is missing with the current DAOs or what could be improved. The budget is not broken down at all, so we have no clue what the $5000 funding is going to be used for. The proposer could start dividing the budget by listing implementation items such as what are the topics of research, how many sessions of Twitter Spaces they would conduct, etc., estimating how many hours have to be spent, and multiplying by a reasonable hour rate.\n\nKudos to the proposer for listing the milestones, which shows a clear objective for the proposal. However, the plan aspect would improve significantly by providing a timeline with a clear time horizon for each of those milestones. Although the risks mentioned in the proposal are not exhaustive (there are a lot of unforeseen problems when doing research), the initiative of finding a mentor should be applauded.\n\nIn the end, I have to firmly disagree that the proposal could be carried out successfully. There are simply too many crucial details missing, and the budget breakdown is not present.", "q1r": 1, "q2": "Auditing the proposal based on current information provided is very hard to do. There aren’t any objective numbers we could refer to so we could determine whether or not the proposal was a success. This could definitely be added by the proposer. For example, to share monthly with 20 other DAO contributors via Twitter Spaces. The proposal plans on giving a monthly report about the learning outcomes. While this is a perfect way for us to keep track of the proposal, there is no mention of how we can access those reports publicly. Another suggestion to consider might be to release one final document that summarizes what the proposer learned and how it could be applied to other DAOs at the end of the timeline.", "q2r": 1, "assessor": "z_assessor_2878", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9661, "q0": "Although the proposal meets the objectives of the challenge and identifies a problem within this challenge, it is limited to only one student, so it is a one-person proposal. We are aware of the great complexity of DAOs and their impact on societies, so it would be more appropriate to form a working group with more than one student, in order to have a greater specialization. A positive point, in this sense, is the possibility of being scalable. ", "q0r": 4, "q1": "The idea is feasible, but there is an inconsistency when the formation of a working group is proposed and in another part it talks about a financial support only for the person who writes the proposal. In addition, there is a lack of clarity regarding the execution of the proposed plan (there is no timeline and the budget and each of the tasks to be done is not explained). The risk is oriented to the proposer and not to the proposal itself. On the other hand, the experience of the proponent and the mentor allows inducing progress in the plans.", "q1r": 3, "q2": "The tools for auditability are interesting and very useful, although it would be very good to have a greater degree of detail on the content, periodicity and structure of the Twitter Spaces and monthly reports. ", "q2r": 3, "assessor": "z_assessor_3079", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11271, "q0": "This proposal targets students and aims to give them a platform where they can learn more about Cardano and work on it with minimal risk and financial stress. This provides the students with a platform where they can share ideas and find funding. The Catalyst is already doing exactly this. What the proposal is trying to accomplish is already done and is open to students too, therefore I fail to see how it addresses the challenge.", "q0r": 2, "q1": "Jack McLane is a stake pool operator on Cardano and also am a Founding Core Contributor of Boss DAO. He is also a senior at a University. Adam Rusch will serve as a project mentor. He is a Teaching Assistant Professor. I fail to see how the team is prepared to build a well-funtionating DAO based on their experience. In their plan, the end goal is just publishing their result on-chain not establishing a DAO, this is worrying and leads one to doubt the capability of the plan. ", "q1r": 2, "q2": "There will be hosting of Twitter Spaces to discuss and spread my learning from Boss DAO and ADAO. The numbers of attendees, gauge the sentiment of the crowd via questionaire. There will also be monthly reports. The information above is sufficient to access the progress. Their metric for auditing the success of the proposal is extremely vague and hard to measure thus making it incredibly difficult to access.", "q2r": 2, "assessor": "z_assessor_3233", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12161, "q0": "It is a direct impact to DAO but not for Cardano as a whole. ADA will be a specific category for this proposer. This proposal also have individual intention and have not yet accomplish many things. So there will be time to spare and to wait even after the project of this proposal getting funded. To evade the conventional type of job that usually people can get, and focusing on Cardano is a simple thing that Cardano really attract person by person to get involved. The Proposer still have no clue but instead on feeling confuse, He wants actively to be as one as DAO itself. ", "q0r": 2, "q1": "The plan is to get hype, and get funded, but what attracts me here is : he wants to establish working group with no detail timeline on the proposal. It is hard to measure the output of this project, what kind of DAO work if this student can get also is a risk in the process. Maybe he has a mentor that is accountable ( Dr. Rusch Teaching Assistant Professor in the School of Information Sciences at my school, the University of Illinois.  He is also a Core Contributor to ADAO, the first DAO on Cardano.) But still, he must have a good goals on how it will be spend. Asking for $5000 without any specific lesson is a hard thing to understand.", "q1r": 2, "q2": "How it will be done on spreading the word that Cardano is exist in the world and he might know some people to approach, but there is no feasible benefit will come from this project. Many people will do what the proposer ask for, without any funding needed.  But the Proposer really depends on the available resource that he had already and maximizing the project from it. Maybe for a promotion of his own social media, or even for operational cost, unless this person not being known by Mentors, community on Cardano, this is straightly giving some fresh money for nobody and expect nothing but a word Cardano being tell to each other in his environment.", "q2r": 3, "assessor": "z_assessor_3362", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 13422, "q0": "The proposal aims to provide financial support for a single student, freeing him to research DAOs and collaborate with notable DAO builders in the Cardano space. One goal of the project is to use the knowledge and experience gathered during the course of the project to help other students learn how to apply for funding for their ideas. As such, the proposal largely addresses the challenge, as it would help other student entrepreneurs to find funding and it provides the supported student the opportunity to work with others more experienced in this field.\n", "q0r": 4, "q1": "The proposal provides a reasonable timeline, consisting of various steps of a DAO research project and collaborative effort with others. The involvement of a professor as a project mentor will aid this process. A possible weakness in this proposal’s feasibility is that it depends on the organization and drive of a single student. It also mentions setting “goals and aspirations” without further clarification, something that would strengthen this or a possible later proposal. Still, it is likely that this proposal will successfully meet the overall goals of the project.", "q1r": 4, "q2": "The project proposes a robust method of providing progress information to the public via a series of Twitter spaces. It also plans on making monthly progress reports available. The Twitter spaces will allow interested students to benefit from the proposer’s research experience. They also will provide others interested in the project the opportunity to give suggestions and guidance to the proposer, enhancing his chances of success. One area of weakness is a lack of a detailed budget in the proposal - the stated uses of “cash as needed” and “Cardano assets” are vague. On the whole however, the proposed public meetings and the final published paper are effective ways to audit the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_3624", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14138, "q0": "I have to disagree that this proposal effectively addresses the challenge. Overall, the proposal is well-written and the ideas and information are all there, however, I disagree that this proposal will benefit the Cardano ecosystem, and more just benefit the person asking for funding. I strongly believe that if someone has a passion, they can make time for it. There are several men and women out there who are working and doing school full-time, yet they still make time for friends, activities, or working on hobbies. In this case, the proposer sounds to be very passionate about studying DAOs and helping others through that. This is a great passion! However, I don't believe this needs funding to be accomplished. I believe that this person can work just like everyone else, and still find time for his studies. It sounds a bit harsh which I apologize for, but I feel that the funding would simply go into assets for gain, rather than taking the money out to pay for rent. It would be very difficult to know if this person is being truthful in where they would be putting these funds. For these reasons have I rated this 2 stars.", "q0r": 2, "q1": "Again, I have to disagree with this. The proposer says that the 5000 ADA will be used to help him achieve his goals, but then beneath that, it is unclear where those funds will be put. At one point the proposal says, \"This grant will supply my cost of living as well as increase my quality of life...\" and at another point, it says, \"My monthly payments will be a stipend I can either convert to cash (if needed) or spend on Cardano assets to help with my DAO work.\" It is unclear where this person will be putting the funds, and it doesn't sound very trustworthy to me. As I had talked about previously, I feel that if this person is really committed to achieving their goals in the DAO space, they would put in that extra hard work for it. They would get a job and use their earned money to do as they please. I feel that this fund would not do much to benefit the Cardano ecosystem as a whole, and more just allow this one person to get out of working. For these reasons, I don't feel that the plan presented will likely be implemented successfully.", "q1r": 2, "q2": "I'm going to give this section 3 stars for a couple of reasons. I feel that this proposal was overall written well. The proposer has strong ideas of what they would like to accomplish, and how they will be tracking their progress. They talk about posting on Twitter and holding discussions with the community to share what is being learned about Boss DAO and ADAO. They explain how they will measure the number of attendees and provide monthly reports. This is all great information that can help one monitor and audit the progress and success of this proposal. However, back to what I had discussed in my previous answers, I don't feel that this proposal will overall benefit the Cardano community, especially on a worldwide scale. I don't feel that this person needs the funding in order to be successful and that they would be able to find the time needed for research while also working a part-time job.", "q2r": 3, "assessor": "z_assessor_3915", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "By working with ADAO Community and Boss DAO, I will learn more about Cardano and the technical aspects of how to organize and benefit a DAO.", "experience": "Jack McLane is a stake pool operator on Cardano and also am a Founding Core Contributor of Boss DAO. \nAs a member of Boss DAO I have been working with ADAO to learn more about running DAOs. I am a Senior at the University of Illinois at Urbana-Champaign."}