{"id": 422335, "author": "defidiscussions", "title": "Outreach/Education Paraguay", "url": "https://cardano.ideascale.com/a/dtd/422335-48088", "category": 26599, "amount": 5000, "description": "A lack of education regarding Cardano's potential in local Paraguayan communities is hindering the development of the cardano ecosystem in Paraguay", "f6_no_assessments": 20, "f6_rating": 3.9666666666666672, "videos": [], "media": [], "f6_assessments": [{"id": 1085, "q0": "By using a text comparison tool I was able to identify that an almost identical proposal has been submitted by the same team in the same challenge called “Outreach/Education Ecuador”. The only words modified are the replacements for the word “Ecuador” with “Paraguay” and that’s it, the proposers haven’t even considered replacing the capital city of Ecuador, Quito, with the capital of Paraguay, Asunción. While this on its own does not necessarily constitute a problem, only perhaps makes me question the team’s involvement in their projects; the fact that it is clearly required and specified in the proposal submission that the team should describe what other proposals they are working on or have submitted in the current fund, raises a red flag, especially for a proposer who has submitted several proposals, with almost identical content and has answered “No” at the question if they are working on any other proposal in Fund 9. As such, my reviews will also be for the most part identical, as the proposals themselves also are.\nWhen I started reading the proposal, I actually got excited by the description of its solution, namely “Our teams goal is to continue educating rural students on blockchain technology” in Paraguay. The proposal goes on to describe how it will organise workshops with rural students, onboard them into the project’s discord and help them eventually submit proposals to Project Catalyst. Until I read that the events will be taking place in Quito (here the team probably forgot to replace the capital city of Ecuador with the capital city of Paraguay), which is also the most populated city in the country. So, obviously, my enthusiasm lowered and I started to ask myself why the proposers chose to present the proposal like this, and where the mistake might lie? Do they have additional information showing that the majority of students in Quito (or perhaps Asunción?) come from rural areas and didn’t think to present this important piece of information, or is the project actually not aimed at rural students any longer? \nBecause the proposals are almost identical to one another, and the proposer have chosen not to reveal that they have submitted other proposals in this fund, I feel like they are not completely honest or very involved in their projects, and especially for a proposal that aims at having workshops with students to attract them to Cardano, genuine involvement and enthusiasm are crucial for it to be successful.", "q0r": 3, "q1": "For the most part, I find the plan described somewhat sufficient, however, I kept having a question in the back of my mind that kept bugging me, namely: the proposers mention that the workshops will be about “the advancements in cardano”, yet that is such a general statement, that I cannot consider it to be sufficient. I really would have liked to know more than just that. Will the workshops be more technical in nature, geared towards more technical students or will they be geared towards a more general population of non-technical students that would be taught general facts?\nRegarding the budget, I find it to be sufficiently detailed and the amounts requested for each segment are very reasonable and cover all marketing aspects, venue rentals and needed materials for the workshops.\nThe team has very short sentences describing their title and previous achievements in Project Catalyst as funded proposers. Perhaps some more details regarding their skills and knowledge would have provided not just me, but the entire community with some much needed information, that we could base our decisions on. I appreciate the fact that the educators have already been found and named in the proposal, although a short description of their knowledge would have further helped in the assessment, as I cannot judge if they are the right people for the task, if I don’t know their knowledge in regards to the Cardano blockchain.\nGiven the missing details described above, I find I cannot agree on whether this proposal can be successfully implemented, but I also cannot disagree, therefore, my score will be a neutral 3.", "q1r": 3, "q2": "As mentioned in the impact section, the review for this proposal is almost identical with two other ones, as the proposers have 3 almost identical proposals themselves.\nAt a first glance, I found the auditability section to be adequately written in regards to this proposal, however, as I analysed the information provided, I found myself with some unanswered questions. The KPIs the team will be measuring to evaluate the progress are easy to follow, some of them will be on-chain, like staking ADA, minting NFTs, and creating ADA wallets, while others can be verified on IdeaScale, like the number of proposals submitted, comments left on other proposals etc. However, for these to be easily tracked back to this project, there needs to be a database with all these metrics and details, that could easily prove their provenance. A place, that the community can easily access and evaluate the advancement taking place, otherwise, we can only rely on the information provided from a centralised source, namely, the proposers.\nFurther on, when reading the answer to the success question I also found it to be partially incomplete, as there is no clear number given in regards to how many new community members will be onboarded, and the proposal describes it as “a substantial number”, which can be any number whatsoever. \nDue to the elements I have pointed out, I find myself in the same position as not being able to either agree or disagree with the ability to evaluate the project’s progress.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 20, "ne": 8, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 12424, "q0": "[Disclaimer: The DefiDiscussion team have submitted 2 proposals that are related to conducting workshops for university students (1 in Paraguay and 1 in Ecuador). These proposals are very similar in their structure and vision. As a result, the assessments for this set of proposals will also be similar]\n\nThe proposal addresses the problem about the lack of awareness and knowledge of Cardano, specifically targeted at students in Paraguay. The proposed solution is to provide knowledge and information about Cardano via workshops for university students. The topics that will be brought up in this includes Cardano advancements, wallet creation, project catalyst, onboarding students to join a Discord server, etc. The topics chosen are relevant for educating students of the Cardano ecosystem however I think some introductory topics to blockchain and Cardano in general can prove beneficial for students that are still unaware or don’t understand the blockchain technology and its role. I think the idea of doing a workshop can add value to Cardano since it can bring more awareness to Cardano and this can act as a catalyst to draw new talents to join the community that have the potential to further development and adoption of the Cardano ecosystem.", "q0r": 5, "q1": "The team members have past experience implementing projects similar to this in past Fund 7 (e.g. networking events in Ethiopia) showing they have the relevant experience and skills needed to implement this project.\n\nThe roadmap is pretty simple and well laid out since the workshop will only be done once (at least for this round of funding) and the first month after funding will be used to set up the workshop. I’d prefer if there was an explicit schedule going over renting the venue, contacting speakers, and other preparations leading up to the event but overall, the roadmap seems realistic to be completed in time.\n\nThe budget has been broken down quite well going over each resources needed, such as venue rental, catering, fee for speakers, participant incentives, etc. I’d like if there were more explanations regarding the “advertising materials” {i.e. the medium for marketing, the number of resources (if it’s physical), etc.}. The same thing for “Cardano swag for participants”. which include shirts, mugs, etc. The amount and cost of each item and the distribution among the 100 participants would be appreciated as a justification for the budget allocation.", "q1r": 4, "q2": "The KPIs chosen are well defined and relevant on gauging the project performance, which includes “number of people creating catalyst account (as CA or proposer)”, “number of submitted and funded proposal from participants”, “number of new wallets from participants”, etc. However, I’d like more explanations regarding how metrics like the number of new ADA wallets, number of participants minting NFTs and/or staking ADA, the number of submitted and/or funded proposal will be tracked by the proposer. Additionally, there were no mentions on where these metrics will be reported. ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 12232, "q0": "The proposal comes from experience actors within Cardano ecosystem who have been funded in F7 and F8. Conceptually, the proposal is new brand-new project which the team plan as hosting larger scale workshops through a new methodology developed by David Tacuri. Thus, the proposer intends to provide seminar and workshop student who are being educated on cryptocurrency and blockchain technology which I believe it is good to maintain the spirit and enthusiasm student about cryptocurrency and blockchain technology until they lead their own funded project. The goal of the project is not just to help the student to navigate their own funded project, but also attract new people into it indirectly. I agree with the challenges of finding what you seek (as the problem statement suggests), and the solution proposed in the proposal will do just that if it will work as intended. In addition, I agree that this proposal effectively address the challenge ", "q0r": 4, "q1": "Considering the team has already working and well received funded project of F7 and F8, I believe, they have plan to run the project as it is stated in the proposal. However, the plan information less in detail e.g., the date they run the project. having detail information about the plan would help us to track progress project even though the seminar and workshop is going to be held for few days. In this way we would be able to follow the intended progress step by step, even if the project would fall behind schedule the community would be able to follow the process. Contrast with the budget which outlined and breakdown into identifiable items thus, it is sufficient information to conduct seminar and workshop. Despite of this, I believe, they commit on the project and I agree the proposal will be implemented successfully", "q1r": 4, "q2": "Speaking about auditability, the proposal stated number of measures to track project progress but, does not have the information of how will it measure. I think, it is better for the proposer to provide the information about how will it measure to trach project progress. therefore, we will understand. I think, since the proposer will host 100 (potential up to 150) student, it would be good as basis to measure to track project progress. I believe the feedback will exist, but it would be great to have sufficient information to audit the progress. However, the proposal has enough information to do auditability  ", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 11719, "q0": "the proposal is aligned with the setting of the challenge. They intend to increase the exposure of students in the LATAM region to the cardano ecosystem, and reversibly shine light on their ideas to get resource, funding, and execution. This is in line with the challenge setting, and considering the lack of cardano presence in their local community, it makes sense that the team wants to tap into the potential talent pool there. i can see the audience growing with cardano over the longer term, and will definitely add value to cardano in their unique way.\n\nthe proposal to engage the audience in their local language means that the project impact will likely only be concentraed within the region where majority of the speakers will be at, LATAM. while this is not a project intending to be scalable on a global level, i still think that it is a project worth pursuing for the benefit of the local community. the project also does not lay out a plan for it's future sustainability, except that it will come back in future catalyst rounds for funding, but i think that its still a pass. given the nature of how cardano can add value to all members of the community there that chooses to participate, and the proposer stating that they intend to create self sustaining community hubs, i think the word of mouth that spreads within the community itself will be sufficient to keep the project going in the medium to longer term.\n\nfor a small scale project, i believe that the proposers are already proposing what can be done in their capacity to mitigate risks as best they can. without a huge marketing budget, they were still able to mitigate lack of participants by leveraging on their networks, which is commendable. ", "q0r": 4, "q1": "the timeline they proposed, while short, was reasonable and quatifiable, which is appreciated. The ROI of the project is then made very clear, where the budget requested is solely focused on throwing an event 1 month from receiving funding. Therefore, the ROI is $5000 to reach 100-150 students depending on signups.  assuming they gather 100 students, it is averagely $50 for teaching students about cardano, which does seem pretty high, in my opinion. i'm hoping that the team can get a venue that accomodates 150 students instead, making the cost of teaching a student go down to $33.33. the budget breakdown indicates that more than half will be spent on Venue Rental & Required Materials, which is reasonable. however, i did hope to see more money allocated to advertising materials to get a higher number of signups and turnup rate. it could have either been tapped from the incentives, or cardanon swag to make up for it. \n\nin terms of execution capabilities, i do think the profile of the working group is sufficient to make the project happen. they were winners from previous funding rounds of catalyst and also have external educators, which is good to see.", "q1r": 4, "q2": "the project measures proposed is reasonable and quantifiable. However, I do have some doubts on some line items, such as, how do they measure the \"number of people that are participating in various discord groups\" that is directly associated with the event that they've conducted? will they match each username back to the people who signed up for the event? and the \"number of people who created ada wallets\", how will they know if one did create a wallet? will they track it during the event itself, and what if the participants recommends it to a friend post event? how will they track an anonymous wallet?\n\nit would be appreciated if they can provide more details for these ambigous line items for reader's clarity and judgement. ", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11270, "q0": "The proposal mentions how the team would like to hold workshops for students who are already being educated on cryptocurrency and blockchain technology through a University Workshop with incentivized learning methodology. They might have some knowledge but the team would like to bring Cardano to their communities, which indeed addresses the challenge. Educating those individuals and providing them with connections with fellow crypto enthusiasts. The team wants to continue providing those students with education on blockchain technology and onboard them onto the team's discord o network with other local crypto enthusiasts and foster collaboration to submit project catalyst proposals that will benefit their community. Thus based on all these aspects that the proposal mentioned it is right to verdict this as one that addresses the challenge. ", "q0r": 4, "q1": "The team consists of 6 members and they are all experienced and capable individuals in their own fields. Jose Velazquez is the CEO of Defi Discussions LLC, Project Manager, Asset Acquisition Manager, and F7 Fund Recipient. Will Shelton is a  Film Director, Media Coordinator and was a recipient of Fund 8. Nathan Samson is a Latte Swap Co-Founder and Project Manager for Fund 5 to 7. Moto Oba is a Fortune 500 Business Consultant, Merchify co-Founder, and a Cardano Community Ambassador. There are also two individuals who are educators. Thus, their experience covers all the aspects that are in the plan. As for the plan it has covered all elements for the success of the proposal. Marketing, seminal and workshops, swags for participants (incentive), NFTs, ADAs, and other native tokens for more incentives. They have content that they want to cover too, thus, it is indeed well prepared. Thus their plan is also likely to lead to the proposal's implementation and success. \n\n", "q1r": 4, "q2": "The information is given to audit the progress is by measuring the number of people that end up partaking in the Cardano ecosystem through various means like partaking in the Catalyst program, staking ADAs, minting NFTs, creating wallets, and many more. These means are sufficient to assess if the proposal is progressing. All these can be assessed as they are part of the content that will be covered. As for the success of the proposal, it would be measured by having a substantial number of new community members on-boarded from mainly Latin America and they end up leading their own funded project. This indeed does measure success but the team needs to find the means to measure it. How will they know the funded projects are people that they onboard once their workshops are completed as that might happen a lot later after their completion of the proposal. If they put it in their Discords that teams that have moved forth should contact them about their success and would get a special \"role\" or something along the line then the team would be able to assess that section with more success. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9992, "q0": "The idea of exposing people to Cadano ecosystem is a good idea and it will advance the people to get to know the opportunities that Canada ecosystem has got. The information provided clearly address the challenge and will lead to success when funded.educating people that doesn't know about Cadano and teaching them about technology will make their mind open and they'll be advance in taking part of Cadano ecosystem and the opportunities available.Also the ideas to take when facing the risk mentioned is clear and will help in exposing these people to know more about Cadano ecosystem.and I believe this proposal will surely lead to success when funded. ", "q0r": 3, "q1": "The information provided clearly as their experience and plans are good and I also love the way the budget is been breakdown. The team has also shown clearly a full description of the team members and it will help us know what they're capable of doing. Also the team has clearly shown the impact of this proposal to people leaving behind and does not have any little idea about Cadano. I believe the information provided about their experience and their plans presented will highly lead this proposal to success when funded. This is why I think is a good proposal. ", "q1r": 4, "q2": "Information provided and ideas presented is widely great and there is also a clear description of team members and also the breakdown of the budget shows that, the team has the potential of growing Cadano ecosystem. Also the team has also give the plans to Introduce people that don't have any idea about Cadano ecosystem and technology to be advance with the help of funds to help them introduced more people to Cadano. I believe the information provided is sufficient to audit the progress and success of this proposal. Above all I see it to create more space for people to get involved in Cadano ecosystem and other block chain. ", "q2r": 4, "assessor": "z_assessor_3140", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9833, "q0": "Lack of education is always a barrier to the development of anything in this world. When people become enlightened and aware of an opportunity, the possibilities are limitless. The goal of the team is to educate rural students on blockchain technology and onboard them to a community and network with other crypto enthusiasts to enhance collaborations so they can submit project proposals to the catalyst community, which will intend benefit themselves and their communities. This will be done through the organization of workshops to expose these students to project catalyst and how beneficial it could be in the long run. These students could be potentially empowered to submit projects of their own for funding to enhance them in their entrepreneurial activities. This project is also locally focused in Paraguay, to help students from these enclaves better provides solution in this environment.", "q0r": 4, "q1": "The team provides a very brief and simple plan. Thus, to organize a workshop with a target number of 100/150 students in Paraguay, with three guest speakers who will guide these students through the various advancements in Cardano. It would have been appreciated if the team could have provided real timelines, and specific activities with corresponding dates, so that follow up could have been simple. This anyway does not hinder the potential success of this project.\nThe budget however is well structured, and every item is well explained. It is very simple and comprehensible. All costs stated looks very real and actual. The team is also known to the community since they've engaged in various funds of project catalyst. I also acknowledge the fact that they continue to train themselves to enrich their capability and that of their training resources. This team looks very capable, and with their experience, this project should be a success.", "q1r": 4, "q2": "The goal is to get tertiary students from Paraguay exposed to project catalyst and its funding potential, with the aim of getting more projects funded in the future which could intend help these student entrepreneurs better effect change in their communities.\nThe KPI's stated are measurable and could be used to track the success of this project. The budget is very impressive and very detailed, though the plan lacks such details, this proposal still looks very auditable.", "q2r": 4, "assessor": "z_assessor_3106", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9781, "q0": "From the proposal, the Paraguayan community is lagging on education about the Cardano Community and the merits related to engagement with the Cardano Community. The proposal also aligns with the strategic goal of this entire challenge which is to build real-world solutions based on the Cardano blockchain.\n\nThe implementation of workshops for universities to educate and sensitize students on cryptocurrency, blockchain technology, and the Cardano network is an excellent proposal. The students are the future of the communities which are lacking education on cryptocurrency and blockchain technologies. Thus, introducing them to the Cardano community makes these students pioneers and this also opens the gate for upcoming youth, in the long run, the communities that once lacked education on cryptocurrency, and blockchain technology, and the Cardano community will now possess knowledge in abundance.\n\nThe increase in knowledge also tends to imply more participation in the Cardano Community, this provides a platform for student entrepreneurs to participate more in proposals and also increases the number of proposals that could be collaborated with other engineers and also proposals that will participate in the next fund. For these reasons, I strongly agree with the proposal.\n", "q0r": 5, "q1": "To begin with, the proposal was able to identify any future risks involved in bringing this project to life and was able to identify measures such as incentivization that will be put in place to mitigate the stated risks. When it comes to budget allocation, the proposed budget expressly conforms to the fixed budget of this challenge. \nThe clear description of the budget allocation makes it easily comprehendible for voters and PAs to understand how what each dime will go into and how it will be spent. The proposal provides a distinct road map as to how the plan is going to go along and after going through the list of individuals who are going to be responsible for handling the project and the references provided, the project is indeed in the hands of personnel with the required skill set and are also inadequacy.\nMitigating problems such as willingness to participate, and language barriers through means including incentivization and implementation of multilingual resources are all the more reasons why I strongly agree with the proposal in terms of its feasibility.\n", "q1r": 5, "q2": "The problem identified: Paraguayan communities and their lack of knowledge on cryptocurrencies and the Cardano community, was identified. The solution to the problem which is the creation of workshops for university students makes it easy to measure this solution against the problem. This is so because, if the workshops are implemented successfully, it implies that knowledge about cryptocurrencies and the Cardano community has increased; hence, the proposal performed its function.\n\nThe key performance indicators and the proposal’s definition of success are spot-on; because they can be easily identified and measured to identify if the proposal was a success or a failure.\n", "q2r": 5, "assessor": "z_assessor_3095", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9674, "q0": "To help onboard ,widen the membership  and adopt the cardano ecosystem in Paraguay and other countries having scanty knowledge about its benefits, there is the need for the adoption of proposals that will identify a particular problem in the challenge and map out remedies to address the challenge. In that respect,we realize that this proposal in question idealizes a solution to a recurring problem in Paraguay which is also prevalent in many countries that still do not have a high degree of technological advancement. In fact, the less the development in the area, the poorer the delivery and improvements in all fields,encompassing educational,economic variable etc. The proposal therefore identifies a challenge of the lack of education regarding the potentials of cardano and its hindrance to the cardano system in Paraguay. This is an indication that there is really a problem that needs to be resolved and so we have no doubts about the usefulness of the proposal in question. With this, it is possible to affirm that the goals of the challenge are fulfilled by the proposal and that, there is a  possibility of a positive impact for Cardano with the success of the project, since the technologies of the ecosystem would be used to benefit the targeted audience which, will go a long way to help achieve some SDGs related to the environment thereby helping to address future challenges in the countries and the ecosystem.I also beleive that the proponent have a qualified team involved in the project, we also realise that the budget request is considerable for the execution of the project, perhaps some parameters that contributed to the success of the project could have already been better worked out.\n", "q0r": 4, "q1": "I have no doubts that the proposal is likely to be successfully implemented.As stated earlier the proposer has provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal. The type and number of team members required to implement the proposal is adequate to ensure the successful execution of the project. However certain details were left out in substantiating their skills and experience needed to execute the project,since the skills and expereince will have a great influence on the success of the project.Again I also consider the budget to be reasonable and will help in financing the implementation of the project as it has been clearly juxtaposed into identifiable items. In case of additional funding required to implement the proposal, the proposer has provided a verifiable plan that will be needed to do so by proactively onboarding new members onto the ecosystem in Paraguay and indicated that they will continue such effort. Even though  I think the proposal offers a realistic timeline in execution of the project on the other hand, the  timetable to complete the work was not been clearly outlined. I mean the duration and the number of days,weeks or month by which a particular plan can be feasible. Hence I suggest that will be reviewed if not now,probably in later proposal. This not withstanding,I believe the proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how it will be done. In view of the above , beleive the proposal is feasible and will be a great contribution to the cardano community should it be taken into consideration for funding.\n", "q1r": 4, "q2": "The proposal has the information needed to audit the progress and success of the project in the sense that,there is clarity in the description of the problem, it's solution and how the proposal is aligned with them.However there is no clarity on how the the measurs of the success of the project will be made available and communicated to the members of the cardano community. I will suggest that the team make a concious effort to make such information easily accessible in order to elicit their transparency in executing the proposal. This could be done by providing the data collected in the form of a PowerPoint presentation,word documwmt,etc and presented to any of the communication mediums in the community. Telegram,discord etc for thier perusal. Apart from these,I believe that other stands declared in the audit stage are  good indicators for measuring success.\n", "q2r": 4, "assessor": "z_assessor_3081", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8953, "q0": "There are still many places in latin america region where cardano is unknown , hence to conduct the workshop to students of who have knowledge over cardano is a great idea,\nThe presented plan has idea to make all these cardano enthusiasts to meet at a place and help them making their development idea come true.\nThis idea will help all the students from the beginning on how to start the project and how \n to present the idea to catalyst voters so that funding is allotted ,By doing such projects it will also boost their fellow mates in showing interest towards cardano development project in the future , hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented plan doesn't involve any risk in it where it just needs some of the counselor to organize the workshop, which definitely can be achieved by proposer team, where they have worked as F7-F8 Project Manager for networking events in Paraguay and Ecuador.\nWith the knowledge of local people the proposer has clear idea on how to reach maximum people and make his workshop a successful one,The team even consist of other members who has been in cardano since fund 5 projects, with the idea of multilingual and minimum risk involved with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit could have still more elaborated on proposed solution which would have added a boost to the presented audit, the audit has introduced all the team members of the project with their contribution and experience in blockchain.\nThe audit has presented us excellent indicators to measure the success rate of the project which includes minting NFT's, creating wallets ,submitting proposals and participation of students in cardano eco system which is very big boost to presented audit.The presented plan has decent budget breaking and decent timeline to complete the project. Hence ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 7750, "q0": "The proposal pinpoints the issue with the challenge and has a big impact. The project's goal is to give students additional options for funding and scouting by increasing their exposure and their ideas' exposure. This proposal team intends to provide these students with high quality resources and onboard them to our team as well as the Cardano community because the majority of Student Entrepreneurs are suffering from Resource Shortages, especially in Rural Communities. Since language can be a significant barrier for students, our team will make better use of our multilingual resources to spread the word about their initiatives and make it simpler for them to receive financing from subsequent catalyst funds.", "q0r": 5, "q1": "I have a high degree of confidence that this idea will be effectively implemented based on the team member's information. The majority of the team members were previously funded by their prior proposal, and the process for measuring and tracking it is extremely well described. The team appears well-organized and capable of producing the desired results. The budget is straightforward and explains how the money will be used for its intended purpose.", "q1r": 5, "q2": "It appears realistic and appropriate to accomplish the goal to request funding in the amount of 5000 USD, which includes the breakdown cost of all the commodities specified. The materials presented are adequate to audit the progress because the proposal has comprehended and identified a genuine need and is working to find a solution. The possibility that the proposal will be successfully implemented is increased by the proposer's and his team's expertise and understanding.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 5858, "q0": "This is an idea for continual education of Latin American students on Cardano leading to onboarding of the students to participate in project catalyst and explore the opportunities in the crypto world through Cardano. \nI like this proposal because the students who are going to participate are already receiving education in block chain technology and that is a good foundation to build on. \nIt exposes the students to the numerous possibilities on blockchain. ", "q0r": 5, "q1": "There is a clear plan including milestones and timelines for implementation. The budget as presented by the team comprises of all necessary resources that will be needed for the proposal to be a success. The allocations made for expenses are reasonable, and the funds requested as well is reasonable. \nThe team consists of a group of experienced persons in the Cardano ecosystem and are active participants of project catalyst and that is a plus. The team already actively working towards onboarding students in Latin American students so I think they’d do a good job. They also include links as proofs to past experiences relevant to implementing this proposal. \nThe proposers intend to make this an ongoing effort to onboard many more people so they'd come back for more funds to do so. \nI think the information given is sufficient to implement this project successfully. \n", "q1r": 5, "q2": "The proposers have given a lot of information to enhance auditability. First of all the KPIs presented accordion to the milestones are clear. The success metrics are also simple to understand and audit. The budget is as adequately presented to ensure transparency in spending. This proposal is auditable . ", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 5786, "q0": "Though the proposal is to some extent addressing the challenge, the focus on educating the already informed students about cardano is not the best for me. The focus on rural folks is also not that clear to me as to universities in the rural areas or students who are quite living distance apart in the villages are brought together to be enlightened on cardano? That should be explained and defined of the what it is called \"rural students\".\nThe \"living no one behind concept\" of the UN is good but in rural areas where I have done lots of works there, the culture of settlement is quite different from the urban. The internet situation is quite bad. I love the fact that, students needs to be educated but the approach and the category of students is important to understand who consumes what information or not. \nIn the rural areas, incentives are important to drive interest and the team should consider that. ", "q0r": 3, "q1": "The team has proven over time as results-oriented with much experience in the catalyst platforms. They have won fundings in fund 7 and 8 and that depict they will execute this proposal with ease.\nThe deliverables and corresponding timelines listed are clear and could be applied to achieve the needed results. The timelines are very simple and directly telling how the proposal would be executed. The amount requested and what the funds would be used for has been well written. The experience and the activities put in place would help the team to achieve success.", "q1r": 5, "q2": "The proposal has KPIs that are targeted and quite specific to help in the auditing. These could have be given metrics to make it more measurable in nature but it also shows these KPIs are easy to achieve. This will obviously help the community to audit with ease. \n\n\n", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 5694, "q0": "In as much as I see similarity in this project with “outreach workshop for Equador”, i still see a determine appproach to advance the awarenness creation on the blockchain technology in Paraguay via this initiative. Definitely this could be a springboard for students to enable them get their ideas into the real world without restrictions in terms of finanacial contrainst and coaching support. The overall objective for this project by the team is to “…ensure that student entrepreneurs suffering from resource shortages, especially in rural communities, have access to high quality resources and onboarding them to our team as well as the cardano community”. This provides more clarity on how it fits the overall objective of the challenge and scouting for student challenge. The advantage here is the opportunity to enable student entrepreneurs explore more on how their ideas could be incorporated with cardano blockchain functionalities to address societal problems. Obvouisly this could scale up the developer base in the cardano ecosystem by serving as an entry point to onboard these student entrepreneurs. Overall, i see a more deatiled description of what the team seeks to do with this initiative – a medium for shaping student ideas, onboarding and awareness creation.Apart from that, i see well thought through strategy to incentivise and attract more students. But i suggest the team provides a more clear and sustainable plan to streamline this project. Nonetheless, this is a great work done by the team.\n\n", "q0r": 4, "q1": "\nThe underpining idea in this project is very laudable but lacks sufficient details to attract an excellent rating. To start with project assessment: there is indeed no specific timeline that allows us to visualize which activities would have to be carried out in which periods of time, so that the final result could be achieved. By the roadmap, the community would be able to determine what activity would take place at what point in time. The budget cites items such as advertising materials,venue rental & required Materials as items for the project but failed to provide when such activities would take place within the roadmap to justify the amount allocation. In my view, the budegt allocations ougth to align with the roadmap. Per the ultimate goal and the expected deliverables, a clear and detailed roadmap would be required to guide and complement the effort of the team in the execution phase of the the project. Therefore, i think the project needs to be refined to make it more understandable and reflect the timelines for each activity. Apart from that, I think the project has a clear budgetary allocation that falls within the set cap specified for this challenge. However, the i consider the amount allocation for items such as venue center, Cardano Swag for Participants and Incentives for participant too high for a workshop. I suggest the team consider a more modest amount for these items. More important to this project is the team members. Per the profile, i see a team with detailed background of what their expertise are. However, i prefer to see more references, external links to the profile of the team and a more designated role for each team member. This would help appreciate what each member would do, at what point in time along the project implementation. Othert than that, i suggest the team refine the refine the project to reflect some of these concerns raised. \n\n", "q1r": 4, "q2": "The absence of a well detailed roadmap on how the team intends to execute the project may affect the possible attainment of the overall objective of the project and eventually affect how well the the progress and success of the project would be measured. Again, the overall objective for this project by the team is to “…ensure that student entrepreneurs suffering from resource shortages, especially in rural communities, have access to high quality resources and onboarding them to our team as well as the cardano community”. With respect to the metrics for measuring this success, the proposer cites KPIs such as  the number of  ADA created, the number of project funded and a few others. In my view, these indicators are more accurate and simplified way of assessing, tracking and monitoring the progress and the success of the project. However, how do the catalyts community have access to the report on these indicators since the proposer failed to indicate that? I entreat the team to make provision for this.\n", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4881, "q0": "The challenge is about helping students to bring out their ideas on a student common platform where they can be connected to Engineers and this proposal is just about that; aiming to educate students about Cardano blockchain and how their ideas can be put into real proposals for funding and grow the Cardano ecosystem.\nThe proposer explained very well in the proposal and also mentioned some risks and mitigating factors to minimize the risks of where students may not be interested but to mitigate, the team will get involved with the students and engage them to understand and get onboard.\nThis proposal addresses the challenge effectively.", "q0r": 4, "q1": "The plan shows that the team will organize a workshop and teach about 100 students on Cardano blockchain and how to write proposals. \nThe budget is clear and broken down well for the different works to be done effectively.\nThose who will work on the proposal are ementioned and their experiences match the relevance of the proposal. They are capable of achieving the purpose, so I think the proposal can be implemented successfully.", "q1r": 4, "q2": "The work in progress can be tracked easily by the metrics mentioned in the proposal as measuring the number of people who become active and also get involved in proposal writing and other roles in the system. \nAt the completion of the project, success will be that more new students or graduates get on board and increase the number of proposers, PAs and voters in theecosystem. The auditing of this proposal can be successful by these facts in the proposal.", "q2r": 4, "assessor": "z_assessor_2630", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 4009, "q0": "The proposal aims to create one or several workshops (hosted in Paraguay), and onboard new members (students) to the Cardano ecosystem through education, networking and incentives. It is clearly communicated what problem the proposers want to address, and what they want to do about it. Worth mentioning is that the proposer has two other proposals circulating Fund 9, one of them being in the same challenge as this. (Link: https://cardano.ideascale.com/c/idea/421959 )\nSo there might be some similarities in my assessment of these, since the two proposals of this challenge is identical on the impact section, but more on that later.\n\nThe idea of exposing students and their ideas to blockchain technology through education and networking is in alignment with the challenge. The proposer also shares the intention of incorporating these students as part of the team which will create a natural exposure to working with developers and engineers, but without throwing them right out on the open market immediately. Having these students be part of the Cardano ecosystem from the start as proposers (and provide them with resources), PAs, developers or voters has a chance to bring lots of value in the form of active future participants.  \n\nI would have loved to see a deeper explanation on how the proposers plans to encourage students to create their own proposals, since there is a heavy emphasis on how students can be incorporated rather than educated in this challenge. \nApart from creating a discord server, and the networking that will occur during the workshop, how will the students be involved? Almost all of the budget is allocated to hosting the mega-workshop with 100-150 attended students, but is that workshop dedicated to education, networking or creating a hackathon-like event? Some clarity on this would strengthen the proposal further. Overall, it Is my opinion that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "As mentioned under ’Impact’, this proposal is a mirror of another proposal with a different geographical focus. This will affect my rationale being mirrored in an equal way across these two proposals. I would suggest that the proposer includes this information in their upcoming proposals. Both for increased transparency but also for the ability for PAs to assess the proposal fairly. (https://cardano.ideascale.com/c/idea/421959)\n\nThe team consists of 4 core members (and two additional educators from another team) with varied background, their experience being listed on their official website. Here, I would suggest providing more links to validate the expertise of the team members (such as LinkedIn, social media, Github etc). Most team members does seem to have experience of being proposers from earlier Funds, which speaks well for long term commitment to the ecosystem. After doing some detective work I could only find one proposal that had been approved from Fund 8 (Link: https://cardano.ideascale.com/c/idea/400210 ), but couldn’t find information on how far that has progressed. Including this type of information would in my experience as a recurring PA further increase how confidently I can trust the proposers to see the project from start to finish, but also validate the commitment that they have to the ecosystem. \n\nWe are provided with a budget breakdown, and it looks realistic in regards to what is presented. Including some Cardano swag-products is not a bad idea, since it is basically walking billboards. In my understanding, the whole budget of 5000 will be allocated to focusing on the actual workshop (planned for happening one month after being funded), does that mean nothing of the budget allocation will go to compensate for the teams working hours? Speaking from my experience as a teacher, an educational workshop for 100-150 people would potentially need something more than merchandise, catering and paying for travel and lodging for the guest teachers. For example, I would love to see an example of the curriculum that the workshop will follow. \nWill the educational content be created by the team, someone else or free resources found on the internet? If the focus lie on on-boarding students and encouraging them through educating them, shouldn’t there be more money being geared towards those segments? \n\nI’m glad to see that the proposers have listed two potential risks, and provided sufficient solutions to these. Incentives are always a good way to get people to show up, and discord is a widely used platform by people of all ages. The fact that the team already holds workshops in Paraguay and Ecuador and aims to improve their educational content continuously will benefit them in the long run. \u2028Speaking of risks, I am slightly worried about the workload that the core team might have excluded from the proposal if all of them end up being funded. \u2028Firstly, the mirrored proposal has an identical plan as this one: hosting a workshop with 100-150 participants after one month of being funded, educating them and potentially incorporating them into the team. Who will do the community management, and which of the team members will be responsible for which parts? Furthermore, do they plan on doing this in parallel with working on the previously funded documentary, and potentially a proposal featured in another challenge (https://cardano.ideascale.com/c/idea/422439 ) at the same time? I would have loved to see some clarifications on how the team aims to tackle these potential risks.  \n\nBased on the points explained above, I disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 2, "q2": "Considering this proposal is an exact mirror of another proposal in the same challenge (but with different geographical focus, mentioned and linked under ’impact’) my rationale will be reflected in the same way. (Since it contains the same information) \n\nIn order to measure the success of the implementation of this project, it would be of great benefit if the proposer provided further details. In its current form, we are provided with the target of onboarding new members to the ecosystem, and including a target number of how many new members would be amazing. Furthermore, if there had been a clear roadmap with a more detailed timeframe (for example, after this many months after being funded and completing this event, we aim to have onboarded 50 new members as proposers or PAs, or as team members). Furthermore, where will the community be able to follow the development progress? It could be a dedicated social media channel that is open to the public, providing updates from events where the team can answer questions. We have a lot of information on what the proposer aims to do, but would have liked to see more details on how the proposer aims to do it. \n\nWe are provided with some KPIs in the form of discord group-activity, submitted proposals (by on-boarded students?), catalyst activity, etc. But as mentioned before, these KPIs would be of much more value if it was paired with target numbers, timeframes and details of open communication channels. (Ideascale is wonderful in many ways, but is it the best place to communicate with every participant?)\n\nHistorically (speaking from my experience as a recurring PA), transparency is key. It builds confidence for the team and good communications with collaborators and potential members. \n\u2028Overall, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_2504", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3511, "q0": "This is a proposal that is a continuation of an arduous educational campaign that the proposers have been carrying out in Latin America and that in past funds has gained the support of the community in the form of funding assignment.  Their work stands out for bringing the Latin American population, especially students, closer to the wealth of opportunities that the Cardano ecosystem represents, through academic methodologies.  To this day they continue to develop their educational project with success, meeting goals and showing the results promised in their previous proposals.  I can make the above statements because, in addition to having made a career in teaching and project management, I know closely the work of the proposers. There is no doubt that education is the best way to disseminate and promote the virtues of a product or service, whatever it may be.  Our case is no stranger to this: the most effective way for people to understand the scope of our technology is through its appropriation.  Therefore, there is no doubt that the work and the present proposal are in line with Cardano's purpose.  However, it is unfortunate for me to remove three stars from their rating since the proposal they are submitting does not correspond to the specifications of the challenge they are participating in.  This challenge, called \"Challenge & Scouted for Students\" has clearly stated the type of participants who are eligible to participate in it: college or university students, still studying, who have ventures that are looking for financial support and a space to expose their skills to specialized members of the community.  Quote (excerpted from the Challenge information): \"By setting up a student category and increasing the exposure of their ideas, they can expect easier funding and scouted from engineers\" (section How does success looks like?).  \"Most student entrepreneurs are suffering from resource shortages, especially in funding and engineer recruitment\" (section Why is it important?). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not easily notice small-scale proposals from students ... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new Category exclusively for students\" (Challenge Brief section).  Therefore, it is clear that the proposal does not correspond to this Challenge, no matter if its theme is about education.  On the other hand, in my experience, this kind of specifications that apparently ban the free participation of a large number of members and their educational initiatives to give entry only to students and their projects, is not only valid but necessary at a strategic level, and that is what the community in general should understand and protect: this kind of spaces are playgrounds that in our case, allow the incubation of a whole new generation of developers, creatives, innovators, a generation that is a secret weapon when it comes to long term goals such as being around for the next 100 years (C. Hoskinson's statement).  Providing capital, guidance, a space for experimentation and failure, is standard procedure.    ", "q0r": 2, "q1": "There is compliance with the budget limits specified by the Challenge ($5000 max).  However, it is remarkable the limited information provided on the details of the workshop development: in my experience, to illustrate to the public about concrete procedures of knowledge distribution (methods, topics, points to be addressed in the framework of the general topic to be worked on) and ways to evaluate the effectiveness of the academic activity (theoretical evaluation, practical evaluation, both) is important to understand the details of the scope of the academic project and therefore, to clearly establish pain points that allow measurement and data collection with the least possible friction.  Also, a little more detail in the budget description would be desirable: e.g., details on the distribution of incentives, the logic behind the distribution of those incentives, etc.  However, the reason that weighs most heavily to proceed to deduct 2 stars from its final rating is that the proposal is competing in a category that does not correspond to it, therefore, its execution does not correspond to a space in which, according to the guidelines of the Challenge, it should do so.  I have no doubt that in future funds the proposers will find the appropriate category in which they can put their skills at the service of the community. Note: it would have been great to read a little more about the new workshop methodology developed by David Tacury (one of the team members), mentioned in the subsection \"Please provide information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new one.\" of the Auditability section.  Perhaps that information could have provided more detailed information on the implementation plan and budget.", "q1r": 3, "q2": "The aspects mentioned as control points correspond to viable forms of measurement.  However, for a better understanding of the measurement process (data extraction, data analysis) it is important to specify the procedure by which each of these elements will be measured.  Therefore, I remove one star from the final rating for a possible lack of detail in the KPIs to be measured.  I also remove an additional star because the project attempts to measure progress in a Challenge in which your proposal is ineligible to take any action, given that, as was clearly stated, the proposers are not current college or university students.  ", "q2r": 3, "assessor": "z_assessor_2462", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1316, "q0": "The proposal aims to host workshops for Paraguay students who are already studying blockchain technology, because as identified by the proposer, there is not enough emphasize of the Cardano development in the Paraguay. The proposer is also stating, that people who understands LATAM the best are actually LATAM people, and I agree with that statement. Educating the local about possibilities can result in developed solutions that are actually required by the community. Additional task that is set by the proposer is to educate these students, onboard to their discord, introduce catalyst and eventually make a proposal, that would be beneficial for Paraguay community. It would also improve the adoption of the blockchain in general. ", "q0r": 5, "q1": "The roadmap is not disclosed, because the proposal seems to be just for one meeting, which will be conducted one month after the team receives funding. The aim is to host a place for approx. 100-150 students in Acuncion and to have 3 guests as speakers. Unfortunately, there is no information about what universities will be reached (or if some partnerships are already pre-agreed), and the same applies for both students and speakers. The content of the meeting is to introduce them to onboarding to cardano – ada airdrops, nft minting, wallet creation, catalyst and LaTam town hall. The budget requested is 5 000 USD, and the breakdown is disclosed. What makes me wonder, is why they are securing “Cardano Swag”, and at the same time, why it is not disclosed, that it will be (most likely) provided by Moto Oba (Merchify). Another item on the budget that poses a question is “Incentives” and it makes me wonder, why it is required when the goal is to educate Paraguay students so they can propose solutions for their community. The team is consisting from 4 people, with a short description of their areas of interest, but as far as I understand, that hosting a workshop is a goal, it is feasible.  To quote proposer “Our teams goal is to continue educating rural students on blockchain technology, onboard them onto our discord to network with other local crypto enthusiasts and foster collaboration to submit project catalyst proposals that will benefit their community” – it is unclear, whether only one workshop is covering the teams plan, or there is continuous process related to it. This requires further clarification, to assess whether it is feasible, because it would require more than just what is stated regarding the team. I am taking one star down because I am unable to verify whether the proposed solution is actually described in the feasibility section. ", "q1r": 4, "q2": "The problem that Cardano ecosystem in Paraguay is hindered because the local students are not exposed to the information about Cardano to the required extent is going to be solved in this proposal. The key metrics that are against this problem are – new CAs or proposers, activity (comments) within the community, submitted proposals, funded proposals. The rest I find slightly less relevant such as staked ADA (just displays the wealth of these students), minted NFTs, created ADA wallets (this is the metric to start with) and participation in various discord groups. I agree, that to measure the success of the proposal, to have some proposals funded which were proposed by the educated students would definitely display whether it was a success. The last item that I am missing is the link for discord (even tough there are some links on the website, discord invite is expired), but telegram worked, so my question would be – what will be the primary information source used e.g. for tracking their participation on these channels, or whether it would not be beneficial to also monitor the numbers of members of these channels. Also, some records from the meeting, or pictures can be provided. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 17, "ne": 2, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 12728, "q0": "The Project correctly addresses the Challenge Topic of \"Challenge & Scounted for Students\", with the problem and solutions being well-stated.\n\nThe Team wants to be funded to hold workshops for students in Paraguay to solve the existing problem of lack of knowledge on the Cardano Ecosystem amongst local Paraguayans.\n\nThe Team proposes 1 physical workshop to students and does not consider other methods to prolong and magnify the effects of the education on the Cardano Ecosystem such as online streaming or live video discussion.\nThe number of students that this Project plans to reach is only 100-150 students, which is a relatively small number compared to the Project Budget of USD 5,000. The cost of USD 50 to educate 1 student is excessively high, given the fact that not all students will be interested in joining the Cardano Ecosystem in the future.\n\nThere will be value-added to Cardano, but the high costs might outweigh the potential benefits.\nAs the Team only hold a physical workshop, it is not possible for them to reach outside of the physical boundary of their community/area. I suggest other mass media platforms be used to furtherly attract and reach a much bigger number of the potential audience outside of the physical workshop.\nWhile I find there is so much room to develop and improved on the Team's idea, I do not see the Team has put enough effort into doing so. As a result, I give the Team a 3/5 for their good idea but undeveloped solutions.", "q0r": 3, "q1": "While the Team behind seems capable of bringing good awareness and popularity to the Project with a well-presented website and members' impressive experience with Cardano Catalyst Funds.\nThere are 6 members in their team, which is sufficient to carry out a successful workshop to educate students.\nThe timeline is realistic and doable by the Team, given their knowledge of Cardano and extensive network.\n\nHowever, the Team's budget is not specific enough, with questionable items such as \"Incentives - 1000 USD\" and the \"3 speakers/teachers with transportation/lodging\". Who are these \"incentives\" given to? The students or the Team members? Who are the \"3 speakers\"? Are they not the Team members? What are their profiles? There is no additional information for the audience to assess the teacher's capabilities.\nIn addition, the team mentioned \"workshops\" to be given, but they will only host 1 workshop as the solution provided by the Project. A USD 5,000 budget is an excessive amount of money for a workshop targeting students in Paraguay. The Team should have been more resourceful in their solutions and such for students/education venues and organizations such as universities and training centers to sponsor their Project.\nThanks to the Team's capability, the one-time-only workshop event and the high costs of the project, execution risk is relatively low.\nI give the Team a 4/5 score for Feasibility.", "q1r": 4, "q2": "The Team's milestone is clear, with 1 event to be held 1 month after they are funded.\nWhile key metrics are given, quantitative and qualitative KPIs such as the projected number of students to become active users on Cardano, and the number of proposals submitted, ... are missing.\nWithout this projected information, PAs and the Cardano Catalyst Fund can't assess the level of success/failure brought about by the Project.\nThe Team has also failed to provide a reporting system for the Community to conveniently follow their progress. Where does it show the active catalyst accounts created, the NFTs minted and the ADA wallet created? How does the Cardano Catalyst Fund determine that these newly created accounts are brought about by the Team's workshop?\nThe Team should put more effort into making their project easily auditable by the Cardano Community.\nAs a result, I give the team a 2/5 score for their Auditability.", "q2r": 2, "assessor": "z_assessor_3470", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14519, "q0": "The proposer wants to do workshops to continue teaching students about Cardano blockchain and cryptocurrency, and onboard them into Cardano channels like Discord.\nThe challenge is about giving space to students to showcase their ideas and get connected to Engineer, and this is what this proposal is about.\nSome risks and how to mitigate them were also stated in the proposal. \nThis proposal effectively addresses the challenge.", "q0r": 4, "q1": "There is a detailed plan in the proposal. The team syas that they will host a 100 student workshop and onboard them.\nThe implementers are 6 members of the team and they have the relevant skills for the project. \nI will say that after reading the contents which I cannot write all here, this proposal would be implemented successfully.", "q1r": 4, "q2": "This proposal has written how to track the progress of work. The metric to measure is the number of people that will be active in Catalyst and will submit proposals.\nWhen the project is completed, their success will be that the number of new communities in Paraquay will increase and onboarding to Cardano will grow the Cardano ecosystem.\nThe information provided is sufficient to audit the proposal.", "q2r": 4, "assessor": "z_assessor_4061", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Hold workshops for students who are already being educated on cryptocurrency and blockchain technology through a University Workshop with incentivized learning methodology", "experience": "Defi Discussions LLC partnership with Ayllu LLC\nCounseled by Business Advisors, Marketing advisors, and Deans of Universities\nF7-F8 Project Manager for networking events in Paraguay and Ecuador.\nMultilingual Resources\nCardano NYC MeetUp Coordinator"}