{"id": 422703, "author": "lilamacdaniel", "title": "Cardano for Latinamerican Students", "url": "https://cardano.ideascale.com/a/dtd/422703-48088", "category": 26599, "amount": 5000, "description": "Low-income students across Latin America are ostracized from global technological innovation such as Cardano blockchain due to underdeveloped educational resources.", "f6_no_assessments": 11, "f6_rating": 3.9696969696969693, "videos": [], "media": [], "f6_assessments": [{"id": 4011, "q0": "In my understanding, this proposal aims to develop an already existing program where students across North America and Latin America connects, educate and support each other through an exchange process. This is normally done by hosting weekly Zoom sessions. The proposal specifically target people living in the Chaco region, as well as a region in Buenos Aires region, both challenged by poverty. The problem statement is presented clearly by the proposer: Involve low-income students across Latin America and introduce them to spaces where technological innovation is present (Cardano). \nThe mention of Cardano is only present in the title and (briefly) in the problem statement of the proposal. In order to avoid the proposal being interpreted as something along the lines of: ”I want funding for my project, unrelated to Cardano” I would suggest to include more detailed explanations on how the project will incorporate Cardano, Catalyst and blockchain technology. What the proposer wants to achieve is clearly stated, as is the background. Where I would like to have more clarity is the how the proposer aims to achieve it. \n\nThe challenge is mostly about giving student entrepreneurs the opportunity to: 1, get a chance to have their projects and ideas realized through Catalyst, an introduction to entrepreneurship without the use of VCs and 2, enable opportunities to collaborate with engineers (student or experienced). This proposal has a good possibility for enabling students to this, but the plan for it would need to be explained in more detail. How will the proposer introduce Cardano in these sessions, and get them enthusiastic about the possibilities of being incorporated into the Catalyst ecosystem? What benefits are possible for the target group, proposers and Catalyst? If it will take some time to achieve, try to present the long term plan and describe each step on the way to your goal. \u2028\u2028Due to the reasons explained above, I disagree that the proposal effectively addresses the challenge. ", "q0r": 2, "q1": "The team consists of one person, with relevant experience of supporting people living in low-income areas (ambassador for OneProsper International). We are provided official links to the current projects but no links to validate the expertise or identity of the proposer. (Or maybe I’m just bad at finding that information). I would suggest to provide some links where the voter can confirm the experience (maybe some documentation or an official link to the OneProsper Int-project) of the proposer. \n\nThe proposal contains a budget breakdown divided in five different segments of development. If I understand the proposal correctly there will be only one team member working on the project (apart from hiring a full stack developer for one month). Does this mean that the listed proposer will be doing everything else (from website graphic design, to teaching, tech setup, etc)? In my experience as a teacher, I know well how the working hours can increase beyond the estimated number, so it would be wise to include an estimation of working hours for each section of the proposal. And if the proposer means to handle web design himself, it would be beneficial if the proposer listed all of the relevant experience needed. In short, the voters need to see what is being done, when, and by whom.\u2028The roadmap contains milestones and is placed on a timeframe of two months, which makes me worry a little bit about the workload that might be present for a team of one person (and one hired), I would loved to either see some explanation on how the team plans to address this potential risk, especially if they are involved in other types of commitments (work, studying, etc). \n\nConclusively, the more information provided about the development process and experience of the people working on it, the more trust in the completion of the project will be built. Due to the lack of detail contained within this proposal (as explained above), I disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 2, "q2": "The key question to answer here is: How will the community be able to follow the progress of the project? I believe (speaking from my experience as a recurring PA since Fund 6) that some form of clarification on that is needed. Will we be able to see updates through the website of Conectamos? Will there be a social media channel where we get updates from the team? If I have a question about the project, where will I be able to contact the team? \u2028\u2028It is nice to see a roadmap presented with milestones on an estimated timeframe, it will help the people in understanding where the project intends to be at a certain period of time. The KPIs included in order to estimate the measurement of success are relevant to the proposal. Registrations on the website, page views, target group numbers reached and tutoring hours all fit, but it would be highly beneficial to include an estimated number for each of these parameters. At the moment, we don’t know if 1 page view per day is the target number, or 1000. We know the parameters (which is great) but we also need to be provided with details on those parameters. It is similar to what was mentioned in my rationale when speaking about the budget breakdown. If the voter/PA/community would know who would be working on website design (for example) and for how long; it would increase the transparency of the project and thus also increase the potential trust gained in the proposing team. \u2028I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_2504", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Impact/alignment:\nThis PA is missing the objective of this challenge. His/her concern is that the proposal does not mention Cardano and blockchain, stating, “He said \"The mention of Cardano is only present in the title and (briefly) in the problem statement of the proposal. In order to avoid the proposal being interpreted as something along the lines of: ‘I want funding for my project, unrelated to Cardano’ I would suggest to include more detailed explanations on how the project will incorporate Cardano, Catalyst and blockchain technology. \" This PA clearly did not read the challenge objective thoroughly, which has absolutely nothing to do with blockchain. The brief of the student campaign clarifies that its purpose is to provide educational resources to students, emphasizing that aims .“to make it easier for the community to recognize new ideas from students.” Furthermore, the campaign’s goals clearly depicts what success looks like: \"setting up a student category and increasing the exposure of their ideas.” This is exactly what Conectamos does for impoverished students in Latin America. \n\nFeasibility:\nThis assessor states that “the team consists of one person” and refers to me, the proposer. Therefore, this PA must not have read that not only is Conectamos in collaboration with multiple teams (including both the organization Chaco Existe and El Grupo Andando), but Marcelo Quirici, the CEO of Chaco Existe, is the head volunteer coordinator for the project, as clearly stated in the Feasibility section of my proposal. Furthermore, he asks, \"Does this mean that the listed proposer will be doing everything else (from website graphic design, to teaching, tech setup, etc)?” Once again, he did not read the budget breakdown where each task and responsibility is clearly stated for the development of this project, each requiring external sources for their completion.\n\nAuditability:\nThe PA begins his explanation by asking, “How will the community be able to follow the progress of the project?” However, the audibility section of the challenge never asks for how KPIs will be shared to the community. The audibility sections only requests “Please describe what you will measure to track your project's progress, and how will you measure these?” This was clearly provided for in the proposal."}, {"id": 4810, "q0": "The proposer presents the problem that Latin America has low-income students who are excluded from technological innovations like Cardano due to underdeveloped educational resources. Proposer presents Contestamos and claims it is a program that provides academic assistance to underrepresented Hispanic students by connecting them with exceptional volunteers from the US through virtual sessions. The proposer states the objectives of their proposal that meet the challenge settings. ", "q0r": 5, "q1": "The proposer presents links from which we can see activities directed towards young people. There is the Yeah platform, which is very active and helps children, and the proposer is also a funder. The budget is modest and a budget item was created, but it would be good if working hours were presented that are in line with the budget. The time frame of two months within the idea will be realized is presented! A work plan was presented, but I would like to see who does what within the project, that would be great! A possible risk in the implementation of this project is presented, but the proposer also offers an adequate solution. ", "q1r": 4, "q2": "It would be great if we knew when this project starts, whether it is this year Q4 2022 or next Q1 2023. The proposer points out how he will measure to track the project's progress. He will measure the amount of tutor registrations, website page views, Latin American students reached, and total collective tutoring hours. It would be good if the development and progress of this project were presented on one of the social channels where the community could participate in the monitoring and revision of this project.", "q2r": 3, "assessor": "z_assessor_2616", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 5868, "q0": "A great proposal to reach Latin American students with Cardano blockchain education. This will lead to increased awareness of blockchain technology among Latin American students, and moreover since the education starts in early life the students will get a strong foundation. \nThe proposal is impactful because knowledge in blockchain technology is valuable knowledge which will help the young ones participate and take advantage of the numerous opportunities around. \nThere is also a higher likelihood that these students onboard to Cardano and start participating in Project Catalyst through presenting proposals, being PAs etc. \nStudent entrepreneurs also can maximize on the several opportunities project catalyst presents, to realize their dreams. ", "q0r": 4, "q1": "The plan presented is very good. The proposed plan includes milestones and timelines that are very elaborate. \nBut the proposer does not state the number of schools this first phase is targeted at. \nThe budget is also well presented. The proposer stated that he will recruit tutors but I don’t see tutors mentioned in the budget. \nThe proposer gives only one person who will work on this project and I don’t see how feasible that will be. There is no relevant experience or skill in Cardano blockchain and there is no plan to collaborate with people who have broad knowledge on Cardano ecosystem.\nI think if the proposers collaborate with experienced people in the ecosystem, this project will go far. \nAnd then tutor incentivization should be factored into the budget to help the tutors give their best.", "q1r": 4, "q2": "The milestones presented are clearly listed, and the KPIs presented to track progress are measurable and can enhance auditing. The success metrics presented are also good for auditing. ", "q2r": 4, "assessor": "z_assessor_2754", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 6513, "q0": "This proposal addresses the challenge because it is focused on connecting students of \na developed country with underserved countries which will help expose Cardano to young students.\nIf success of this challenge should look like \"increasing the exposure of their ideas\" to later attract future engineers, this is a good way to incentivize students to explore the opportunities in the technology Cardano is developing.\nThe website development of a basic platform as a hub to connect students is a great start that could evolve in helping to resolve the shortage of resources they usually face.\nI guess that the proposal could generate a good impact in the Latam student’s community. By building a bridge between these two parties, they both can start communicating through the tool and therefore benefit from each other knowledge, actions and values.\n", "q0r": 5, "q1": "Keeping in mind the amount of work to be performed and the budget requested, I think the proposal is highly likely to be implemented. \nThe team looks experienced and they said they worked with other similar projects so we can expect that they understand what are the steps to take in order to execute the plan proposed.\nI am assuming this does not mean that future funds will be needed in order to keep the project going since I see it is an ambitious plan.\n", "q1r": 5, "q2": "It looks like this group worked already with other projects and with the information provided it will be possible to audit the project. There is a timeline with detailed goals to be achieved on the two months so the progress can be measured if those points are achieved. \nThe budget breakdown looks accurate and people needed for each task is well defined, so it will be possible to track where the funds are spent.\n", "q2r": 5, "assessor": "z_assessor_2819", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 7755, "q0": "The Chaco region (in northern Argentina, Bolivia, and Paraguay) and the slums of Villa 21–24 in Buenos Aires are the two areas that the initiative primarily targets. Local children in these areas lack the opportunity to prioritize their education or increase their technical savvy due to extreme poverty and isolation. Therefore, the proposal clearly outlines the unique challenges in an area and, if implemented well, will greatly benefit the local community. Through the Conectamos program, students are exposed to a variety of educational tools and supplies as well as innovations that will help them integrate with the constantly evolving technological world from which they are marginalized.", "q0r": 5, "q1": "This proposal had a monthly goal, but regretfully it wasn't very well stated. Additionally, since Marcelo Quirici is the only member of the team, I'm not sure whether he will be able to finish the proposal by himself. The proposal will still be a little difficult for him to complete it on his own, so I decided to give him a score of 3. Despite the fact that he has relevant experience from his three years as an ambassador for OneProsper International, a nonprofit organization working to reduce the rate of female illiteracy in India, and from having virtually taught English to girls living in the harsh Thar desert, who typically work six hours a day to collect water for their families, I decided to give him a score of 3.\n", "q1r": 3, "q2": "There is a great road map provided for the execution of the project which is set for 2 months. The proposal has provided key metrics to measure success and it has demonstrated a good understanding of the problem of the challenge and solution is equally a great one.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9837, "q0": "The concept of this project is in perfect agreement with this challenge and even the goal of the project catalyst as a whole. Access to education can be a major issue in the development of an individual and a community as a whole, even more so if you are leaving in an underprivileged community. That is why I applaud this proposer for his thought on developing a  program that will provide academic assistance to underrepresented Latin American students by matching them with exceptional US volunteer tutors through virtual sessions. This is a great initiative and a step in the right direction in the attainment of equal and fair education for all.\n The plan is to organize a 30-45 minutes zoom meeting once a week between a student from these communities with a volunteer tutor from the United States. This project specifically targets student from the Chaco region (in northern Argentina, Bolivia, and Paraguay) and the shantytowns of Villa 21-24 of Buenos Aires, and through the Conectamos program, students are introduced to diverse educational tools and supplies and receive exposure to the innovations that will help them integrate with the ever-developing technological world that they are marginalized from.\n", "q0r": 5, "q1": "With the experience of the proposer, having worked on different humanitarian projects, I believe this project will be successfully implemented if funded. Moreover, the proposer also provides a detailed roadmap leading to the attainment of the success of the project. I still recommend that specific timelines are given to allow for easy track of progress. The budget is also reasonable, the lump sum of 5000 USD is broken down into individual amounts, and what each would be used for has clearly been stated. \nThe proposer also does well to address various challenges that could hinder the success of the project, mainly been; lack of tutor registration, and language barrier. Giving provisions on how these challenges will be addressed, confers more confidence to the proposer in his ability to successfully implement this project.", "q1r": 4, "q2": "The KPIs provided are sufficient to measure the success of the project. There is no provision on how the team plans to provide reports to the community. No milestones are also provided to aid in the easy track of events. \nHowever, there is clarity in the plan and the budget is feasible. There is also confidence in the team to successfully implement the project. With the aid of a few details, the project would be auditable.\n", "q2r": 3, "assessor": "z_assessor_3106", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12097, "q0": "The proposal is written in a simple and easy-to-understand manner. It gives a great overview of being aligned with Cardano's mission regarding education. It is important to keep in mind that it will be for the Spanish-speaking public that is growing day by day in the blockchain ecosystem. The proposal is within the stipulated budget and what is positive is that it already has a large audience base through the two active platforms (Conectamos and Yeah!). In other words, its dissemination can have an immediate effect on the interest of future students.", "q0r": 4, "q1": "This is the weakest aspect of the proposal. Marcelo Quirici is only named as a volunteer in Chaco related to education and 2 previous experiences that are not related to Cardano, blockchain, or the crypto ecosystem in general. I would like to read what value can be contributed from these last topics so that it ends up aligning 100% with the Challenge presented. The plan is correct, although details of the duration of the talks and the drafting of a follow-up document could be added. In conclusion, the proposal is implementable but expected to add more information.\n", "q1r": 3, "q2": "What is described as progress metrics are correct because this proposal includes the development of a web platform, relevant metrics can be obtained for the preparation of KPIs. The only suggestion is to include some type of final survey to the participants to obtain quantitative and qualitative metrics for improvements by possible and future funds.", "q2r": 4, "assessor": "z_assessor_3358", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 12102, "q0": "The proposed idea is a very good fit to the challenge goals. First, it is an idea born in a student environment, by a graduate student aiming to bring knowledge to fellow students with less economic resources. Second, it has a noble goal and if funded it could benefit from the engineers experience to expand and offer even more valuable and structured content. Third, to be funded and grow as part of the Cardano Community, the project connects students from different parts of the world and without any knowledge of Cardano with the Community, what could in the future raise the number of students connected to and seeking Cardano as an opportunity to expose their ideas and get funded, which is the challenge’s main goal.", "q0r": 5, "q1": "The budget breakdown and timeline are simple and direct, but it seems reasonable taking into account that it is intended as an initial setup for a bigger program that, as written in the proposal, will need further funding and structuring to broaden the scope to more schools and provide further technological supply to students. The proposer has 3 years experience in a similar project, which is very good for foreseeing and managing specific problems that can occur in such a project that aims to connect and share knowledge between people of different cultures. Yet, I think the proposal could be more appealing if the proposer had detailed more the roles and responsibilities of each team member and tied it to the budget and timeline breakdown. Also, it would be nice to have at least a draft of the study plan, themes and materials intended to be used during the project. At last, it raises a interesting obstacle, which is the possibility of the student demand outreach the number of volunteers, but taking into account the noble goal of the project and the enriching experience it provides for both volunteers and students, and the recruitment being conduct in an university campus, it seems to me that the recruitment target audience is very much in line with the expected volunteer profile, thus decreasing the risk of a lack of volunteers", "q1r": 4, "q2": "The main metrics tracked seem in line with the proposal’s goals, which are, more than academic advancement, to establish a community connecting students from vastly different environments and cultures. So, by tracking the amount of tutor registrations, the number of students reached and total tutoring hours, it will be possible to measure the engagement and impact of the project in the community selected. Finally, in terms of auditability, the proposal would benefit if the proposers had offered a plan of sharing the metrics and results in some sort of public way, such as an online worksheet for monitoring or a closing reports with main results, learnings and feedback.", "q2r": 4, "assessor": "z_assessor_3361", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12165, "q0": "I identify the bandwagonning purpose of this proposal, a mutualism based, since Chaco region is lacking of technology adoption. It will benefit the society directly and make blockchain (in this case is Cardano, would be very well known by many people that needed the most of technology adoption. On the basis of knowledge level, it will make more access to them to move forward from the poverty. A consistency on this program will surely make a good result since the participants are their own relatives, families,friends on the isolated area. I also notice that the targeted people on this region is children included. We can not say no to those who neeeded. And a good intention for education never been wrong in the future consideration.The ability of recruiting countless tutors from student-led clubs and organizations that match the Conectamos program goals to mitigate the potential problem. So the proposer stated that the environment is lacking but he have the solution toward it.", "q0r": 4, "q1": "Plans, timeline and key milestones. 2 month timeline to finished the project seems to fast and as the blockchain concept will need more time to digest and finding the best practice on how the community in the future will determine what will they contribute to Cardano ecosystem. As it prolonged the breath of these society and make it more prosperous on infrastructure both domestic and knowledge skills, a diverse intention should be accomodate on this website and also their tutor programs. I suggest the Proposer to have Cardano experts to help more and get involved in this project. Such a bad situation to have but still having a passionate people is all that Cardano will need as a good foundation.", "q1r": 4, "q2": "A further result is expect to be reported on these proposal. There is already a connection between Latin American Students and their US tutor i assume. Yes this proposal intention is to create more value but still on the stage of awareness. Global awareness will be noticed and adopt on certain level of beginner. With minimum contribution yet to be found later after the 2 month period of the project accomplished. I hope he knows how to attract more tutor and make it more credible on viewers on website, and how they will communicate and getting the information as soon as they come to the website. Some infrastructure must be well present to convince more that this proposal can turn into project that can be launch on other region which have a common problems too.", "q2r": 4, "assessor": "z_assessor_3362", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 12235, "q0": "This proposal dialogues with the goal of the challenge of encouraging development in Latin America, through the creation of an educational platform focused on technology, which would certainly help to improve the knowledge for low-income student in Latin America. However, I would like the proposer to make it clearer how the Cardano blockchain would fit here, certainly within the technological teachings our ecosystem would be much addressed, as well as the use of ADA Cardano. I felt a lack of assurance about how this project would bring feedback to the Cardano community, I know this feedback will exist, but it would be great to have details of that. Thus, it would be interesting if we knew better how Cardano blockchain fit with technological teaching and also the usefulness of ADA in the project. Despite that, I believe there is no doubt that such a project is very necessary and promising. Thus, the proposal addresses the challenge", "q0r": 4, "q1": "The team involved here is informed only one while I think it is not sufficient information to carry the project. I think, it is better for example, the proposer stated who in charge on website design graphic & content development and who in charge for tutorial session. Detail person information would benefit to find the responsibility of the job. Furthermore, the budget outline supposes to break down in detail and if it could be, the proposer could match between the budget with timeline and key milestone. Despite of this, the proposer provides the feasibility plan of the project and it sound achievable. Thus, I agree that this proposal will be implemented successfully", "q1r": 4, "q2": "The team measure success of the project base on amount of tutor registrations, website page views Latin American students reached, and total collective tutoring hours but, no KPI or other measurement matric provided. KPI’s is needed to understand if the project is achieving what it intends without this, it difficult to measure success project quantitatively. Given the information, I would neither agree nor disagree sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_3367", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13454, "q0": "Due to extreme poverty and geographical isolation, local children in the Chaco region (in northern Argentina, Bolivia, and Paraguay) and the shanty towns of Villa 21-24 of Buenos Aires lack access to quality education  knowledge on technology. This proposal seeks to create a program through which poor and impoverished Latin-American students are introduced to diverse educational tools, supplies and receive exposure to innovations such as Cardano blockchain technology that will help them integrate with the ever-developing technological world from which they are marginalized. This will encourage many students with ideas to make their lives better present their proposals on Catalyst and will empower these students with funding to change their lives for the better whiles also expanding the reach of Cardano into remote areas and increasing the level of engagements in the Cardano community.", "q0r": 5, "q1": "Even though this project is new in Latin-America, the Connectamos team has already been able to successfully implement similar educational projects in India. This gives the team the needed expertize and enough experience to facilitate the success of this project.  The project is also cost effective as it will engage student volunteers from the University of California, Los Angeles who are fluent in the Spanish and Portuguese language leading to a reduction in tuition cost and removal of any language barrier. The stated amount of funding is also feasible and will help the team achieve the objective of the proposal. In all, this proposal has a high likelihood of being successfully implemented.", "q1r": 5, "q2": "The proposal offers sufficient information to audit and evaluate the project's progress toward its outlined objectives, since it explains the implementation approach and project development criteria, thanks to the well-detailed information from the impact and feasibility categories.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Conectamos is an program providing academic assistance to underrepresented Latin American students by matching them with exceptional US volunteer tutors through virtual sessions.", "experience": "I spent the past 3 years as an ambassador for OneProsper International, a nonprofit working to end female illiteracy rates in India. I virtually teach English to girls living in the brutal Thar desert, who typically spend 6 hours a day toiling to collect water for their families."}