{"id": 413974, "author": "konmaorg", "title": "Cardano-Polkadot Oracle Bridge", "url": "https://cardano.ideascale.com/a/dtd/413974-48088", "category": 26598, "amount": 130000, "description": "There are no oracles in Cardano ecosystem to support cross chain interaction b/w Cardano and Polkadot ecosystem. ", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 2870, "q0": "Cardano and Polkadot are both active and well-known Blockchain, therefore as the challenge wants to address the issue of communication, coordination and collaboration between chains, it’s important for such platforms to be able to bridge into each other at a foundational level. From the problem statement, the proposal is believed to address the common point of collaboration tools and platform hence there aren’t decentralized oracles between Cardano and Polkadot. As the proposed solution came out with its best option of developing cross-chain interaction which led to the need of establishing the Cardano-Polkadot Interoperability Protocol. This is considered a scalability feature that would address future challenges within the Cardano Blockchain infrastructure among challenges in Catalyst towards community developers,...  The project process is broken down clearly with lasted proof concept (PoS, dPos, LPow, 3-zkc) where proposers clearly explained how they’ll interact with the different technique on Oracles (through SaaS3 - PoN), this will eliminate the decentralized point of a server for developers to access. The project also their tokenomic by staking $SAAS token. In general, this project is one of the most vanguard projects in the challenge that targeted the characteristic of reducing time-code-complexity for developers with benefits returning to the Cardano system. However the risk management stated that funding would be vital to kick off the CPIP, beside Catalyst, the proposer should dynamically diverse sponsor channels through multiple methods (such as promotion, accelerator program). Human erroneous factors are also a worried angle to look at when it comes to smart contract engineering since the contracts policy needs to be extremely auditable to prove the transparency of the project. As they mention the solution to have 3rd party auditors to review the smart contracts, it’s really important to be clear to PA about how the whole process will run to make sure that 3rd party will not be a factor that causes the system to lack transparency. ", "q0r": 5, "q1": "The break down timeline in the project tends to stick at quarter mocks from 2022 - 2023 (4 quarters). While budgets for Q3-4-2022 and the last quarter stay at 30K USD and 10K add up for the remaining quarter, the team include a table to break down further cost which includes their policy of paying to members, infrastructure cost as it could be seen in the cost inccurration section below. The team is verified in terms of technological and business background. For the confirmation section, the team answered “Yes”, this should include an explanation for their return to Catalyst and it should be their strategy to grow the project, brainstorming what challenges would fit the context of funding. ", "q1r": 5, "q2": "In terms of auditability, the project should include basic metrics to measure the process instead of direct PA into the delay of the metrics (on their Twitter) after the project is started. The metrics could suggestively be the way they evaluate the success of the protocol and establish the verification of how the smart contracts system works. Besides that, the overall success is looking really good with a micro case of how a developer integrates with the communication network among two chains. ", "q2r": 4, "assessor": "z_assessor_2356", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3597, "q0": "Does this proposal help open the bridge between Cardano-Polkadot.\nThat's great, I love this idea of ​​yours.\nProblem to solve: Dynamic oracle solutions, Cross-chain interaction.\nDynamic cross-chain interaction to enable the transfer of data from one blockchain to another in a decentralized manner.\nThe specific solutions given to build a secure cross-chain through a common messaging interface will help the smart contract communication between Polkadot - Cardano take place. This will help developers in the Polkadot ecosystem know about Cardano.\nRisk 1: If this proposal fails to raise funds, the backup solution is to apply to the Fund9 catalyst program.\nRisk 2 is the potential risk of human error, the solution invites a third party to do an in-depth check with the auditors.\nI don't quite understand the solution as well as the risks this 2 poses. If a risk is detected, engineers and technicians have to find the technical fault and then fix it, I don't know how the auditor will help with this risk", "q0r": 5, "q1": "Your team of experienced and enthusiastic members with impressive award achievements will help the project develop well.\nThe budget table shows the budget allocation associated with the plan for each job in each quarter\nWork goals are given according to specific timelines but are too simple to be detailed for each item. The community can't check the work tracking especially non-technical people like us.\nIn the category of costs incurred, the project is only built in 4 quarters: 2 quarters of 2022 and 2 quarters of 2023, changing the working time from part time to full time will help the work develop. faster, but accordingly incurs many costs, which may affect the proposed budget. Other costs incurred: audit costs, unforeseen costs also affect the project budget.\nIf a project arises too much, it will cause reactions in the community, this is a minus point in the feasibility of the project.\nTry not to incur unforeseen costs to increase the efficiency of the project", "q1r": 3, "q2": "Does your road map include the points you need to go to?,\nDetailed project reports are updated on it?\nGive us a detailed explanation so we can see it because not all communities can understand your map.\nThe proposal simply offers road map tracking that cannot make the project transparent.\nThe success of the proposed proposal I can imagine, is the successful creation of a communication interface between Cardano-Polkadot.\nThe data sent over will be decrypted and encrypted in every way, so communication will be faster and easier.", "q2r": 3, "assessor": "z_assessor_2464", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4331, "q0": "The idea of ​​the proposal is very good, but it takes effort and time to research and build before it can be applied in life. This proposal has properly addressed the goal set out in the Challenge. I find this very interesting. The problem to be solved here is that the Cardano ecosystem cannot yet support cross-chain interaction between Cardano and Polkadot. I understand this proposal was born to do that by creating CPIP protocol to build secure services and DApps and can transfer data, tokens, etc... If the proposal solves this then it is great. great, because this is a problem that almost no one can do today. If it is possible to enable cross-chain between Polkadot and the Cardano ecosystem, there will be a very large number of projects, tokens, etc...of the two parties linked together. Thereby solving the common problem of both ecosystems. This proposal will add enormous value to the Cardano ecosystem (if it succeeds) and fully scale and solve future challenges. Cardano will have a very large scale of operation when it connects with Polkadot, which is a great prospect - not only me but the whole community is looking forward to. I have high hopes for this proposal and hope it becomes a reality as soon as possible. With such impact when I completely agree - vote 5 stars.", "q0r": 5, "q1": "Proposer and team have in-depth Oracle, DeFi, Chain Bridge, etc... In-depth computing experience. The team has also provided full documentation related to the proposal. Especially the Linked social network link to publicize the identity of all team members. I strongly agree with this, especially the public through social networks, because from there the community has a lot of advantages in looking up the members' identities and verifying the feasibility of the project. export. A detailed list of members is not possible for every proposal. It is very commendable that the team has made this clear and very specific. The number of team members is 5 people, I understand these are the key members, the team may also have other collaborators that the team is not convenient to identify.\nThe budget is broken down by items and is logical to the goal. Although the team simply lists the budget, it still shows the key milestones in detail, which clearly shows the professionalism of the team. However, as a PA, I still want the team to show more clearly the budget required for each small job so that the community can look at it and have more confidence in the feasibility of the proposal. The team's budget presentation - professionals and people who already know the team well (know what the team needs to do) can also be understood from the current budget presentation, but I think that for everyone from the community (who are very new - they don't know anything about the team and this proposal) to understand it easily we need to have a detailed explanation. More detailed, and easier to understand. That's my advice on the budget. I have an additional question, if it hasn't been funded by Catalyst in Fund 9, will the team continue to work on this proposal? And what other sources of funding does the team have to be able to implement this proposal (from contacting support from other organizations)? I ask this question because I want to demonstrate the clear feasibility of the budget.\nAbout the plan and how to implement has been fully stated and professional. I was most impressed with this in the team's proposal. This is also one of the important factors in clearly defining the feasibility of the proposal. And the team is doing a great job of it.\nRegarding the necessary resources for implementation, I temporarily divided them into two main resources: financial resources (mentioned in the above budget) and human resources. With the current people, with professionalism and expertise, I believe that the proposal will be successfully implemented. However, as the team shared, some members are also working on another proposal in parallel with this proposal at Fund 9. I would like to ask if this reduces the quality of work on this proposal. shoot it? In my opinion, the team can demonstrate to the community that even though there are currently members implementing another proposal, the human resources are still sufficient for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. It is a collection of high-tech learners in the new era: Cardano blockchain, Polkadot blockchain - the programming language of 2 blockchains, Oracle, DeFi, etc... It is made by experienced people. on the cryptocurrency market - members of the current team. That is the basis for me to believe that the team will do a good job when implementing the technical aspect of the proposal implementation.\nThe team is also quite clear about the risks that may be encountered when implementing this proposal: The lack of money to develop the CPIP protocol and another risk that is a vulnerability in the smart contract - accompanied by 2 solutions. measures to prevent the two risks mentioned above. I add a third risk which is Ada's slippage - which will affect the budget to implement the proposal. I would like to analyze this risk more closely: We know that the digital currency market is in a downtrend phase, so the price movement in the downward direction of digital currencies takes place from time to time. day. That is also the reason why Ada may depreciate when Catalyst funds are allocated to the team, then the team will face the problem of a lack of budget to implement the proposal. Therefore, my advice is for the team to consider the detailed budget related to Ada's slippage to make an appropriate budget request. Even if more funding is needed, the team can come up with a full plan to test.\nHere are my positive questions, comments, and advice. I hope the team can consider improving this proposal. I strongly agree with the feasibility of the proposal. I vote 5 stars.", "q1r": 5, "q2": "Through the proposal, I see the team's progress and clear milestones. What I am very satisfied with is that the team has linked the milestones with the timeline (specific quarters of the year). This makes it easier for the community to assess work progress, and to demonstrate the transparency and auditability of the proposal. I wish that any proposal would do the same. It also demonstrates the team's interest in the proposal milestone roadmap. However, I still want the team to be able to present the work done at each milestone in more detail to make it easier for the community to understand and grasp - especially for newcomers in the community. - they can easily read what the team needs to do at the milestones.\nI found it a pity that the team did not present the KPIs and key metrics. We all know the role of KPIs and key metrics in auditing. This makes it more difficult for the community to evaluate and audit when KPIs and key metrics are not visible. KPIs and key metrics play an important role in proving the transparency and auditability of the proposal. So my sincere advice to the team is to quickly add KPIs and key metrics. Having these two indicators in the proposal will greatly improve the transparency and auditability of the proposal.\nOn the other hand, the team stated what is the definition of success, it is seen as the standardization of smart contracts between Cardano - Polkadot, data is sent over blockchain networks and is simply decrypted. , etc... I agree with this definition of success. Throughout the proposal is a clear and easy-to-understand description of the problems, along with a clear statement of solutions. I found that the team made a strong effort to identify the problem and come up with a solution to solve the problem.\nHere are some of my positive comments to build more transparency and auditability of the proposal. Again, I look forward to the team adding KPIs and key metrics. Regarding the auditability of the proposal, I both agree and disagree. I rate it 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 5116, "q0": "The proposal tries to create a Cardano-Polkadot Interoperability Protocol (CPIP), establishing the universal standard for developers to build secure services & dApps. The creating Interoperability with other major blockchains, the impact of the project is immense and cannot be overstated. The team has incredible credibility and gives the voters confidence that the team can implement the proposal. However, some items in the proposal can be written in more detail. The proposal outlined two main risks of the project, lack of funding, and smart contract vulnerabilities. However, the proposal already considered those risks in the proposal by requesting funding in project catalyst and using audits on 3rd party.", "q0r": 5, "q1": "There are clear milestones stated, and each is tied to a specific timetable. That is quartal in a year, to the Q2 2023. There is a budget breakdown but some items need more details. It will be much better if the proposal provides the total hours needed to complete the milestones and the cost per hour. The cost per hour is relevant to make the community determine if the request is reasonable or not. The proposal provides very comprehensive information on each core team's background, experience, and past projects. They also attached LinkedIn profiles, which make it easy to verify their credibility.", "q1r": 4, "q2": "The project’s auditability can be done via the Github repository activity and Twitter account. However, the proposal does not provide any metrics/KPIs as the measurement of project progress. As an example, you can add the number of projects incorporating the tool, etc. The defined success of the project is clear and straightforward with successfully creating a standardized interface for smart contracts to send messages between Cardano-Polkadot.", "q2r": 4, "assessor": "z_assessor_2675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7459, "q0": "I think this is something, as an ecosystem, we could seriously use for interoperability. The biggest challenge with bridging users is creating safe bridges for the community to traverse where hacks are avoided and potentially a thing of the past. Your team seems to be well prepared to take on such a monumental task, and I applaud you for your work in the ecosystem. This is a project that, one day, could mean complete compatibility between polkadot and cardano.", "q0r": 5, "q1": "I believe the amount of money you guys are asking for is a bit much. Your team is very impressive, and the accolades you have received are actually very impressive. This will be quite a task to achieve and will take a lot longer than a few months to build. I do not believe you would have to work on this full time, so you should be able to still focus on your jobs and build this slowly with a lot less funding.  I would love to see this in our ecosystem, but if the voters do not fund you, please do not be discouraged. Come back with a smaller number, and see if we can build this, slowly, once trust is built in the team's capabilities.", "q1r": 4, "q2": "I would like to see your social media reach increased to help build trust with the community for this level of funding. Twitter is fine, but having something like a facebook page with daily posts (\"blogs\" if you will) of what you are building might help bridge that gap to the wider cardano community. Twitter is a great place to start, and maybe even a youtube channel to meet the team and have some regular updates come through could potentially be game changing. AMA's help a lot also, would like to see you guys appear more on some of the spaces in the ecosystem. I am a project ambassador for the Cardano blockchain project Chain Lobby, and we are leveraging the use of social media to help build awareness and community trust before we launch. I think it could help your situation long term with collaboration and transparency.", "q2r": 4, "assessor": "z_assessor_2895", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 14850, "q0": "This solution is exactly what we expect from this challenge: a collaboration with Polkadot. If this project is conducted successfully we will have a bridge that brings a convenient and saving solution to developers, making it easier for every new adoption in the future. I read the whitepaper of SaaS3 and their proposed security for the data is pretty trustworthy including 4 advancements from the traditional API3. Although their solution is incredibly complicated, the data between the two chains will be secured and the risk of the bridge between 2 chains being attacked is diminished. In conclusion, a very promising project that should be given a chance to get funded.", "q0r": 5, "q1": "This is a very technical project and as a project whose success will depend greatly on the ability of the developer team, the profiles of the members will affect our decision to fund this project or not. And to be honest I'm impressed by the team's profiles. They all have achieved excellent results academically and based on their LinkedIn profile, they are well-known characters in the technology industry. \nTheir detailed plan, however, needs a little adjustment so that the community can have a better grasp of what they will do. The proposal would be better if the team include more information about smaller steps in their technical development, for example, the functions/coding parts in CPIP and the time expected to complete them. The same goes for the budget breakdown. The cost presented by the team here doesn’t include salaries for the team and legal services so I suggest they include these costs incurred. ", "q1r": 4, "q2": "For a technical project, there are not so many metrics to track its success other than the completion of the roadmap. Still, I think they can give more metrics to measure the progress of this project, it can be the number of new integrations built successfully due to this solution. They do provide a Twitter page for us to keep up to date which is good in order to make every information transparent. ", "q2r": 3, "assessor": "z_assessor_4106", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will create the Cardano-Polkadot Interoperability Protocol (CPIP) providing a universal standard for developers to build secure services & dApps that can transfer data, tokens and initiate actions.", "experience": "The team encompasses of:\n\nCo-Founder of SaaS3 Oracle\nCardano & Polkadot blockchain developer\nChain Bridge contributor\nDeFi product expert\n2 Computer science PhDs\nLecture professor of NTU, Singapore and NUS, Singapore.\n"}