{"id": 413981, "author": "konmaorg", "title": "Haskell Bootcamp TPG X KONMA", "url": "https://cardano.ideascale.com/a/dtd/413981-48088", "category": 26598, "amount": 70000, "description": "As of May 2021, Haskell was the 28th most popular programming language by Google searches for tutorials, but made up less than 1% of active users on the GitHub source code repository.", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"id": 1357, "q0": "While I like the idea and believe that more education is normally a good thing, I am concerned that this proposal effectively reproduces the Plutus Pioneers course that was put on by IOG and/or other existing Haskell courses (both online and in person). Haskell is not a new language and after so many years one would expect that this information should be available. If there is a niche that this team is looking to fill, it could be better explained. \n\nOne may infer that the proposers suggest their course would encourage people from other blockchains to learn Haskell although this is not explicit and there is no indication that it would in fact result in cross-chain collaboration. Also, the focus of this proposal is on Haskell and Haskell alone which makes it unfit for the cross-chain collaboration challenge. ", "q0r": 2, "q1": "Given the experience and plan presented I cannot say whether this proposal will be implemented successfully, for the following reasons. \n\nThe team does a good job of outlining their plan and how they intend to achieve it, including the training sessions and subjects to be covered. What is missing for me is the acknowledgement of work that has already been conducted in the Haskell training space. Sure, it could be feasible but it could also just be reproducing and repackaging existing materials. Perhaps if the team had taken a more targeted approach on a specific population or cohort of individuals but as written it is so broad. \n\nThe reason why I can't say whether it is feasible or not is that it is unclear whether the proposal would lead to any cross-chain collaboration. In this sense, the feasibility is not on the ability to create a course but on the ability to achieve the end goal of breaking down silos or reducing maximalism between the chains. Personally it does not appear that it would be feasible in this sense but given I am unsure I remain neutral. \n", "q1r": 3, "q2": "Yes, the information provided is sufficient to audit the progress of the proposal, however the measures for success leave much to be desired. \n\nThe team uses clear KPIs to measure the success of their course, however, they provide no sort of measurement or validation of the materials they plan to create/adapt. Given that the majority of the work will focus on building the course and collating the course materials from a variety of sources, there should be a way to track and report on this. How will you confirm whether the information you come up with/find is accurate and the agreed upon information? \n\nThe success measures are unfortunately not strong enough to know whether this course is a success. As stated, given the amount of information likely already available (not just on google but via textbooks etc..) it would be helpful to have a baseline of comparison. Say if course x delivers y amount of new web3 developers, then your course will deliver z amount of developers. Moreover, when the proposers say that \" Work could be focused on Cardano or other ecosystems, could be part-time, full-time, in the form of hackathon/grant projects, and so on\" it essentially means that anyone who does anything after the course would make it a success. \n\nI would encourage the team to reconsider submitting to another challenge in an future funding round and providing more details in about the gap they are trying to fill in more specific terms rather than broad statements. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2049, "q0": "According to the proponent, as of May 2021, Haskell is the 28th most popular programming language according to a Google guide search but accounts for less than 1% of active users on the GitHub source code repository. So they want to enhance the skills of developers through the Haskell Bootcamp covering theory and practical applications while helping to expand the Cardano ecosystem and develop solutions using Haskell. The goal of the team is to have at least 20-30% of developers from this team able to try projects, and bounties and work on hackathons independently. And their long-term goal is to help these developers apply for funding and lead their projects in the web3 ecosystem. The proposal tackles the challenge very well and presents a clear problem and solution.", "q0r": 5, "q1": "The feasibility of the proposal is average and there is still some room for improvement. First, about the roadmap, the proposal says that it will divide its milestone into 2 parts, one part is learning and the second part is implementation. The learning part was very well presented. The learning plan is held for 5 weeks, in each week we know what content will be taught in a very methodical manner. However, during the 6-12 weeks we were not given information about this process, so we don't understand what will happen at this stage. Regarding the budget, the total required budget is $70,000 and is also divided into 2 phases\n1. Training program and demo day budget: expenses will be used for activities such as Marketing and Design, Content Management, Bonuses & Incentives... Each activity is included at 1 certain cost. However, I think these costs can be broken down further, which will help the community have an accurate view of whether the requested budget is reasonable or not. Example: Bonuses & Incentives - $10000. Who will the Bonus be for? How many prizes are there and how much is each prize level?...\n2. Educational module development budget: this budget is very well presented, we know exactly what activities the money will be used for, very reasonable.\nFinally, about the team, this is probably the best presentation in this criterion. The main implementation team consists of 3 members, we know their role in the project, their field of activity, their contributions in the field of Blockchain as well as each member's LinkedIn link. In addition, the project is supported by technical support from the Konma Labz team, a group that has contributed a lot to Catalyst. Therefore, I have 100% on this team, and so I agree with the feasibility of this proposal with a score of 4 (budget and roadmap need to improve at some point)", "q1r": 4, "q2": "Regarding the auditability to track project progress, the proposal provides several easily auditable KPIs:\n-Total number of Bootcamp registrations\n-Weekly Attendance to Monitor Consistency\n-Feedback system after each module completion\n-Number of projects successfully submitted on Demo Date.\nThe proposal provides detailed measurable KPIs to realize whether the proposal can achieve its goals. It would be great if the proposal provides us with a means of being able to track their project progress. All of this information will be needed to reach our community members, one way or another; for example through Telegram group, Twitter, or in short discord, some direct and simple way for us to find this out.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3600, "q0": "Proposing to build an educational theme exactly as the Cardano ecosystem aims.\nWhat do you think about learning and getting rewarded, developers will be very interested in this idea.\nThe programming language education project will give technology enthusiasts the opportunity to continue to need blockchain, specifically Cardano, from theory to practical application.\nThe project helps to expand the Cardano ecosystem to a young technical audience\nWith the asynchronous curriculum, the project will give learners the flexibility to study at their own time and convenience.\nWith the goal of making projects more complete in terms of programming languages, it will help developers register for funding and develop projects in the web 3 ecosystem.\nThe proposed risk raised is the continuous updating of course materials in the document repository, organizing refresher courses for everyone. Other than that I don't see any potential risks.\nI agree with the proposal", "q0r": 5, "q1": "It is proposed to build a detailed work plan into two parts: learning and implementation.\nI agree with this allocation: learning must always go hand in hand with practice to be highly effective.\n The detailed content in the detailed plan table is also reasonable and easy to understand. The construction plan is like a learning textbook to help students visualize what they will learn.\nThe detailed budget is also divided into two parts: the training program and the equally distributed development budget.\nA part of the budget is allocated for access to Colleges and Universities, this direction will attract a large number of students who love and are passionate about technology to study programming languages.\nThe team consists of members who are passionate about technology and education, have a lot of experience in the blockchain industry, co-founder of NFT chain development.\nThe project specializes in education, but in the personnel component, I do not see any teaching personnel, who will be in charge, who will stand on the teaching belly.\nI have no doubt about the feasibility of the project, the team of the project is very talented will help the project develop well.", "q1r": 4, "q2": "I have a bit of a question about the project progress metrics, I don't see any detail that represents language programming education. This is the same question when I ask why in the human resources department there is no one in charge of teaching.\nMy visualization of the technical metrics, i.e. completing and testing the app.\nWhat I like about the success of the project is that learners will be able to work directly in the web 3 ecosystem, flexible time is not required. Therefore, there will be a variety of time options for attendees.", "q2r": 4, "assessor": "z_assessor_2464", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6087, "q0": "As of May 2021, As of May 2021, Haskell is a popular programming language, but accounts for less than 1% of active users on the GitHub source code repository. The idea team wants to enhance the skills of developers, through the Haskell Bootcamp, including theory, and practical applications, while helping to expand the Cardano ecosystem, and develop solutions, using using Haskell. Proposed impact on the challenge posed and described in detail. The Phoenix Guild planned to host a Haskell Bootcamp for developers. 1st goal is: get at least 20-30% developers (can try projects, bounties and work on hackathons independently). Long-term goal: help these developers apply for funding and lead their projects in the web3 ecosystem. Bootcamp will be completely asynchronous, enabling learning and convenience. The team is aiming for: so that cohort participants can start working in the web3 ecosystem, work can focus on Cardano, or other ecosystems, be it part-time, full-time time, in the form of hackathons/funding projects, etc. Besides, the main challenge of the project is also well solved by the author with a lot of time and work.", "q0r": 5, "q1": "The author provides us with the information necessary to evaluate this section; including: roadmap, budget and team. First, the team provided a roadmap analysis of the work to be done in the project. As I understand it, the author, divides his milestones into 2 parts, one part is learning, and the second part is implementation. The work to be done is divided into 5 weeks, and the work to be done is explained densely. At the same time, the learning content is also clearly listed. Next is the budget. The proposal requires a budget of $70,000. We are told the budget will be divided into 2 parts: Training program and demo day budget; Education module development budget. The budget divided for each job is clearly analyzed, including the salary for professionals for 3 months. Finally, about the team of team members.  We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides a text presentation about each member, and attaches  links to let us know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is suitable and the members have many skills and experiences, increasing the feasibility of the proposal.", "q1r": 5, "q2": "Proposals provide us with information to measure the progress and success of the project. Total number of registrations Bootcamp: Bootcamp is a programming training model,  building a community of experts in the field. The proposal has a good plan, a transparent budget, and team members with many skills and experience, which will help to implement the proposal on schedule and successfully complete the project. About the final product is a success, is the expectation of the project. cohort can start working in the web3 ecosystem; Work could focus on Cardano or other ecosystems...", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12328, "q0": "The idea to an enhance the skillsets of developers through a haskell bootcamp. The project seeks to contribute to the cardano ecosystem by developing solutions using haskel. The bootcamp intends to train these developers with theory and practical applications. The idea is an important area in programming language which will provide developers who have no skillset in haskel could be given an opportunity to learn.The proposal plans to use the bootcamp as a platform to educate these developers about cardona and how it could contribute to the ecosystem. I'm a bit confused with how developers will be selected, where is the project headed from and is it open to developers across. The proposal is absent of these details. I believe the proposal has provided the needed information to be implemented. ", "q0r": 4, "q1": "The information provided on team members is an experienced one with partneships to implement the project. This is a confident team for the project. The proposal gave a budget to this effect. However, I'm not too sure with the \"outreach\" in the budget if there was no details on how these developers will be selected. The plan has a clear roadmap with milestones on how these activities are to be executed with the set timelines. This has been put into two parts that is the learning part and the implementation part.", "q1r": 4, "q2": "The information provided in the proposal is absent of some details to the implementation of the project. The proposal has given ways it can contribute to the cardano ecosystem when the idea of bootcamp is implemented. Furthermore, The proposal has provided key metrics and key performance indicators to track the projects implementation. Examples are total number of sign ups for bootcamps, weekly attendance to track consistency and feedback system post each module completion.", "q2r": 2, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13987, "q0": "I have heard from the development community on the Blockchain that Haskell is a bit different than the other programming languages out there in Blockchain and its especially how the Cardano network is being built on. \n\nThere is not much extensive documentation for any one new to start learning Haskell and in fact not many people know about Haskell. \n\nThis arrangement will be a great start for people to learn Haskell and for someone who wants to develop on the Cardano this platform will be a stepping stone where they give personal support unlike the youtube videos which is generally a one way learning. \n\nThis proposal can create a great impact in the developers community of Cardano", "q0r": 5, "q1": "The team seems to be well versed in what they are doing and the support video providied here in this proposal does a great work in taking Haskell to the audiences in a neatly constructed way. \n\nThe mentors mentioned in the video also seem to be profound members of the community. \n\nSeems like they are already working on this and they can implement this project in a grander scale with the help of this grant. \n\nOnce implemented , if the team is able to add at least 10 developers a month to the Cardano community , it will be a great source of addition on the niche skillset in the market. \n\nChanges the lives of members who will be a part of this CoHort", "q1r": 5, "q2": "The team has mentioned clearly on how the training plan will look and how this could be implemented . \n\nThe team can also add what kind of real time projects will the trainees be put up , will it be either something new addition to the cardano community / own cardano projects or if the trainees get to work on real life Projects that could be helpful. \n\n", "q2r": 4, "assessor": "z_assessor_3869", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14547, "q0": "The TPG team and KONMA seek to organize a Haskell Bootcamp for developers who are interested in learning the language, and motivate them by incentivizing the learning process. They have a very clear description of their project impacts, and some key metrics for evaluating it. Their Haskell Bootcamp idea matches the challenge well. It’s designed to bring more talented and potential developers to the Cardano system, and give them the necessary support to work well here with the kind assistance of helpful mentors. Organizing a Haskell Bootcamp may pose some risk due to the requirement for the constant access to new documentation and repositories, and the team plans to offer refresher courses to keep everyone updated on the information. I find this a quite reasonable risk-mitigating solution. My rating is 5.", "q0r": 5, "q1": "The proposal provides a detailed roadmap to implement the project and also clear budget breakdown. Their specific description makes it easy to assess the feasibility of the project. Additionally, they provide sufficient information about their team members. Their names, description of their related skills and experience and profile links for verification are all presented. Most of them are key members of previously funded projects and their competence has been proved definitively. I strongly believe in the team’s ability to fulfill this proposal well.", "q1r": 5, "q2": "The progress of the bootcamp is going to be evaluated via the total number of sign-ups, weekly attendance, and the feedback system post each module completion and the number of projects successfully submitted on Demo Day. These specific numbers do a great part in measuring the project progress and development. They are also sensible enough. Speaking of the description of the project success, the team again presents clear metrics to count on, which include the number of cohort attendees to be able to start working in the web3 ecosystem post the cohort completion in different forms of working (part-time, full-time, in the form of hackathon/grant projects, etc.) At the end of the cohort, the boot camp participants would have to submit group projects that will be evaluated by the mentors. This auditability suggestion totally makes sense to me. My rating is 5 again.", "q2r": 5, "assessor": "z_assessor_4072", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "We want to enhance the skillsets of developers through a Haskell Bootcamp which covers the theory & practical application and help expanding the Cardano ecosystem and develop solutions using Haskell.", "experience": "The Phoenix Guild has more than 8 years of experience in the blockchain ecosystem as developers, entrepreneurs, & community builders, collaborated with protocols including Ethereum Foundation, Covalent, etc. and ecosystem expansion through educational sessions."}