{"id": 414118, "author": "danadak", "title": "ProofOfHumanity KYC on Atala Prism", "url": "https://cardano.ideascale.com/a/dtd/414118-48088", "category": 26598, "amount": 36200, "description": "Atala Prism—coupled with Roots ID—could benefit from a number of proof of humanity KYC solutions that add to a self-sovereign identity and enable true democracy (one person / one vote) within Cardano", "f6_no_assessments": 10, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 353, "q0": "The proposal effectively addresses the challenge as it aims to create a cross-chain project between Cardano and Proton within the challenge timeline of 6-12 months. ", "q0r": 5, "q1": "The team seems to be very well fit for the job of NFT based DIDs on Cardano/Proton. They have already seen success with the Roots wallet which is focused around identity. That being said the listed risks and mitigations are a bit lacking in detail. Stating the risk of \"Cross-chain implementation challenges\" is rather open ended and could be used to sum up all of the risks the project may face. \n\nThe detailed plan section is short and too the point while providing enough information to understand timeline with milestones and how long they will take. The detailed plan meshes well with the proposed buddget and enables me to understand how much each milestone will cost to produce. Props to the team for this section of the proposal.\n", "q1r": 4, "q2": "I have an understanding of what the project aims to accomplish. A non-transferable NFT that represents a DID in the Roots Wallet. That being said I do not understand the end user experience. How will users go about creating a DID, recieving it, and then utilizing it in things like governance. The Impact section is a bit sparse in this regard and uses links to various relevant links, but doesn't jump far into how these links are relevant. This tends to span through the proposal with refrences towards different tools like Freeos, Rootswallet, and WAL-CLI without explaining what these tools are. \n\n\nThe metrics section of this proposal gives a good sense of how progress will be tracked but doesn't provide any KPIs. This isn't a huge deal due to the detailed milestones but does come into consideration once the proposal is implemented. What happens the project once developed? How is usage ensured? Adding a list of standard KPIs like number of users and number of project integrated would be a great start to this.\n", "q2r": 2, "assessor": "z_assessor_2070", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1, "reply": "Thank you for your thoughtful comments:\n\nAuditability: \nOur approach is along these lines: Success is defined by \"Cardano presence on Proton\" and \"Freeos presence on Cardano\". Agile development with the 2 weeks sprint method enable a precise monitoring of the progress. The community will be able to follow it on a public project management platform (ClickUp). Adding that the code will be updated in the FreeosDAO public github repository."}, {"id": 1359, "q0": "Unfortunately I find it difficult to know if this proposal effectively addresses the challenge. It uses the words cross chain collaboration between \"Proton\" and Cardano but there is no real description of the proton KYC. I went to the website but it is still not clear. \n\nAnother issue I'm having a bit of trouble with regarding the impact is the inclusion of the FreeOS system. It appears that you need the Proton KYC to participate in the FreeOS system but from the website it doesn't seem that there is much value from FreeOS itself. If there is something that is clear and I'm just missing then I'd suggest including it in the proposal itself. \n\nFor these reasons I can't say it does or doesn't actually address the challenge. ", "q0r": 3, "q1": "Yes, given the experience and plan presented it is likely this proposal will be implemented successfully. \n\nThe plan is to link Proton KYC with Atala Prism, which is straight forward enough. The steps are well laid out and I appreciate the hours required and hourly rate are clearly portrayed. The team also does a good job at outlining their milestones for each of the activities provided. \n\nI think the team could do a better job at highlighting the rest of the team. As it stands only one of their members provides any sort of confirmation of ability (through linkedin) the rest of the team just list their strengths but no way to corroborate them. While Lance Byrd is vital to the Rootswallet team, the rest of the members are largely unknown. It is also confusing why the name on the proposer (Dan Kimball) who is a long standing member of the community is not listed as part of the team. This should be at least explained somewhere in the proposal.\n\nI'd encourage the team to provide a bit more detail about each of the steps and how they got to the hours required. In addition, as mentioned, the team should focus on including all team members. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. \n\nWhat does give confidence to the ability to audit the proposal is that the team commits to using github for it's code, which is open source and easily reviewed by the community.  While questions still remain over why Proton and what it will provide the community, at least being open source gives the impression the team doesn't have anything to hide. \n\nGiven that the team clearly lays out the milestones and the expected hours to complete them, these are also easily tracked to know whether or not they were achieved. \n\nI think the success measures could be a bit stronger and have a more measurable target but they are simple and likely very easy to achieve. Although what is there \"Cardano having a presence on FreeOS etc...\" could be better quantified to know what threshold of \"presence\" would make it a success. Is one page enough? The option to use Proton? More details here would help improve this score. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for your thoughtful comments: \n\nImpact / Alignment: \nProton KYC identifies a wallet as verified based on confirmed identity of the owner from a centralised source. Freeos uses this verified status to prevent bots and duplicate accounts from multiple claims from its weekly mint. The intent of Freeos is to help a solo mum from a developing nation like Indonesia to feed her family with her weekly claim. \n\nFeasibility: \nProposal Dan Kimball and I (co-proposer) Jerome Hartigan are both volunteers on this project. We are engaged in an admin function only. And we did not include our time on the project to minimise costs and maximise the value we deliver. \n\nAuditability:\nWhy Proton? We used Proton because they have the most advanced proof of humanity KYC on any blockchain. "}, {"id": 1431, "q0": "The proposal would be within the challenge goal, and I think that this proposal probably will increase adoption of the cardano smart contract development ecosystem. At the same time the statement of how problem is to be solved is explained: Atala Prism—coupled with Roots ID—could benefit from a number of proof of humanity KYC solutions that add to a self-sovereign identity and enable true democracy (one person / one vote) within Cardano\nThe proposal if funded will deliver provide a tangible implementation of cross-chain collaboration, it introduce a standard mechanism for KYC verification on Cardano by cross-chain leveraging Proton’s KYC process with Atala Prism. The result is a POC for other chains to cross-chain integrate with the Cardano ecosystem (e.g. EOSIO).\nHowever the objective of the proposal very interesting, because a Proof of Human KYC it’s fundamental for also investment and insurance contracts (e.g. Life insurance policies).\nAtala PRISM framework is mature and adopted by a lot of project on Cardano Blockchain.", "q0r": 5, "q1": "I think that the proposer teams has the necessary experience, because it’s clear the experience for the proposer (deep experience of KYC, Lance is an expert Cardano/Catalyst/Atala Prism SSI (identity) mobile developer. As Co-Founder of Roots ID, Lance is building a Cardano-based open-source identity ecosystem, including a mobile identity wallet -Roots Wallet) but not for the people mentioned, beacuse I don’t discover other information or links to professional skill (eg. Linkedin profile). \nThe solution proposed would be a complete solution of the proof of humanity KYC solutions (and one-person one-vote) on Cardano, and the proposer describe the complete solutions or other milestone within 3 months.\nRoadmap and milestones (incl. time horizon) are described. The budget provided is detailed . There are details how the budget is going to be spent, and in my opinion the daily rate is a bit higher than other proposal in the same challenge (team – US$100/hr).", "q1r": 4, "q2": "The proposer team will use an agile development process with fortnightly sprints to track progress of Milestones and daily standups to track progress of tasks: they are created by the project manager on Clickup www.clickup.com\nOnly SDG metrics are shown, not KPIs. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the community of interest…)", "q2r": 4, "assessor": "z_assessor_2245", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1767, "q0": "This proposal is a about developing interoperability between Cardano and Proton blockchains, in order to bring ATALA Prism access to Proton Know Your Customer identity.\nDetails are provided about how this proposal could scale in future Catalyst Funds, which is moving FreeOS DAO from Proton blockchain to cardao.\nThe problem is well stated and clearly meets the Cross-Chain Collaboration challenge criteria. ", "q0r": 5, "q1": " 6 team members are identified, and their experiences are detailed. As the creator of FreeOS DAO (freeos.io), the team has demonstrated it has the relevant development and blockchain skills to implement this cross-chain proposal.\nThe budget of 36200 USD is reasonnable and well explained, with 9 milestones to be completed during 2-weeks sprint along a 3 month development. The number of  working hours at each step is given.\n4 main risks a identified, but I am missing details to understand it properly. The mitigation plan would deserve being elaborated.\n", "q1r": 4, "q2": "Sucess is defined by \"cardano presence on Proton\" and \"FreeOs presence on Cardano\" which is clear and sharp.\nAgile development with the 2 weeks sprint method enable a precise  monitoring of the progress. The community will be able to follow it on a public project management platform (ClickUp). Adding that the code will be updated in the FreeOSDAO public github repository, this proposal can only receive the maximum auditability score.\n", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 1910, "q0": "The proposer has identified a fundamental problem within the Catalyst voting process using a Self-Sovereign / DID and involve Proton KYC in doing so in their solution. This proposal if successful will benefit the Cardano Ecosystem as a whole and bring the community to learn and experience an interesting approach from the Proton KYC side. Definitely align with the challenge settings - a very interesting project!", "q0r": 5, "q1": "The proposer shares very relevant information about the team and their experiences that will make this proposal successful. The founder of the Freeos DAO team also mentioned and will join and contributing to this project will make this proposal a high chance to succeed.\n\nWith the budget broken down in detail included in the spreadsheet, the numbers are looking reasonable and still within the <10% of the total challenge budget. With 3 months of timeline and with a complete team, the timeline should be realistic, especially since they have identified the risks and planned the mitigation in detail.", "q1r": 5, "q2": "The proposer has provided an easy way to track the progress using a project management app ClickUp while the codes will be updated on GitHub. This is acceptable and will make life easier for the community and the Challenge Team to track this project. \nThe metrics / KPI is also presented clearly, using milestones and an understandable description of what they want to achieve.", "q2r": 5, "assessor": "z_assessor_2289", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3003, "q0": "Atala prism has been a great decentralized identity platform that has given identity and a voice to a lot of people living in distant areas like Africa. It is always nice to see things building on such a great platform and Proof of Humanity has been a thing that has been discussed in past Q&As but there has not been any proposal as far as i know. Thus, i am very excited to see this project asking for funding. I think it can have great impact on the Cardano ecosystem and it clearly addresses the challenge, as it approaches cross-chain collaboration in three different ways (cross-chain collaboration, cross-chain leveraging,  cross-chain integrate).", "q0r": 5, "q1": "All the team members and their relevant skills, the necessary skills and resources, a detailed plan and the architecture/langueage that will be implemented are all there and suffieciently described. The budget is described in a clear manner as well, and has been broken down into identifiable manners. However, i think that a lower budget has more potential of getting funded. For example, from all the other proposals i have seen, i believe that 100$/h might be a little too much. Of course, the specialists know better, but it is a notice you may want to take into consideration. One thing i would like to point out as brilliant, is that you described in great detail every risk that may appear and also gave a good description for the mitigation of each one of these risks. One thing that should be, for sure, is that linkedin profiles should be available for all the team members, not just one of them. ", "q1r": 4, "q2": "There is a roadmap with all the milestones there for the voters to know about the details of the proposal. There are also some kind of metrics, even though, the Cardano presence, does not sound like a metric actually. Should you provide some key metrics for the progress to be measured, you should also provide some numbers for them. You could consider referring to the number of people engaging with the KYC procedure, for example. I like the fact that you provided the link that there will be to track the progress of the proposal and that you also mantion that the code will be available and regurarly updated for the community to audit the progress. The key metrics are an important section to have sufficient information so i can not highly rate it. ", "q2r": 3, "assessor": "z_assessor_2385", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3084, "q0": "The fact that there is a standard mechanism for KYC verification on Cardano by cross-chain leveraging the KYC process has not been implemented much on the platform of the Cardano ecosystem, the proposal presents a proof of concept for cross-chains to integrate. Cross-chain integration with the Cardano ecosystem is a good solution to effectively address this challenge.\nProposing a solution to use WAL-CLI, RootWallet to create/issue/send/verify/manage/revoke verifiable credentials of Proof of Humandity KYC and authenticate information from devices be mobile.\nProposal to increase Cardano presence on Proton, Freeos presence on Cardano, user-friendly for Cardano holders to be Proton KYC verified and become part of Proton community, thereby initially bringing Freeos DAO into Cardano and identity badge used on social media.", "q0r": 4, "q1": "Proposers provide evidence of relevant skills, experience required to implement the proposal including Lance Byrd with deep KYC experience, as a mobile developer on Cardano, professional identity . As the founder of Roots ID, the proponent is building a source code identity ecosystem based on Cardano, including a mobile identity wallet. Additionally he is mentored by professional UX developers from IOG, other identity experts and regularly participates in Trust Over IP, Decentralized Identity Foundation and Hyper Ledger Foundations meetings.\nIn addition, to implement the proposal, there are 5 other members, all of whom have high professional skills and experience to be able to successfully implement the proposal.\nThe proposed budget is calculated according to the working hours of the members, with each specific job the members are paid a fee to implement the proposal. With such a calculation method, the efficiency of the proposal is very high, but it saves a lot of other costs, bringing greater success to the proposal. The proposed budget for funding is in the amount of $36,200, with that amount and the roadmap for delivering that budget making it reasonable and feasible for the proposal to be successfully implemented.\nThe time to complete the proposal is 3 months, with such a volume of work, such a time is reasonable.\nThe proposal also outlines the risks that could prevent the project from being successful, including cross-chain implementation challenges, technical incompatibility with different KYC formats, centralized KYC process , KYC tends to be just another product. Thereby the proposal also offers solutions to overcome those risks, in my opinion it is reasonable to propose measures to reduce risks so that the project can be successful.", "q1r": 4, "q2": "Although the proposal provides a detailed plan according to the timelines and project management by Clickup to effectively manage the project, the project is not measured and evaluated by the KPIs to measure the level of the project. success and efficiency of the project, I see this point as a minus point of the proposal. However, the proposal also provides an easy-to-understand description of the targeted problem that can be measured based on the proposed results, the solution presented is easy to understand and effectively solves the problem with measurable definitions. be on success.\nThe proposal has regular information updates on the channel www.clickup.com to update information for the proposal. Thereby, the community can effectively check and monitor the proposal, bringing confidence to the community.", "q2r": 4, "assessor": "z_assessor_2397", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 4162, "q0": "The challenge seeks to drive adoption by growing an ecosystem of Dapps, products, [services] and integrations.  Ultimately, adoption – transition from innovator and early adopter to early majority and late majority phases – depends on the provision of utility to end users.  People will be drawn to the blockchain that enables them to DO things safely with the least friction. IMPACT: This proposal fits within the challenge problem.\nProposal Clarity & Fit (5): This project will add KYC features with integrations with Atala PRISM, RootsWallet and Proton KYC.  The concept is clear and fits squarely in the challenge. Specifically, the KYC component verifies Proof of Humanity, which will be important for voting applications and validating social media through NFT badges.  \nCardano Impact (5): Self-Sovereign Identity is a major feature of the vision for a blockchain future.  Atala PRISM's DID is a key product for deliver SSI on Cardano. Developing Atala PRISM to add features will greatly expand utility on Cardano.  A rock solid DID product will encourage cross-chain integrations with Cardano. This project adds humanity verification, assuring counterparties that the identify interacting is human rather than a bot. An Atala based PoH solution should be superior to Web 2.O solutions (e.g. Captcha).  The project is a first step in migrating the team's Freeos DAO to Cardano.  \nScalability (5): While it is developed on Cardano using the Atala PRISM digital identity (DID) protocols, the proposal indicates the KYC solution will be cross-chain, suggesting it may be portable to other blockchains.  \nThe challenge presents the following KPIs: 1) increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, 2) Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products, and 3) increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community. A project would be successful under the challenge if it satisfies at least one of the conditions.  \nKPI Alignment (3): KPIs are broad in scope and event focused (e.g. satisfaction of a condition). More quantifiable KPIs more amendable to demonstrating progress would be better.  \nAverage Impact Score (4.5).\n\n", "q0r": 5, "q1": "Experience Required and Fit of Team (5): Experience requirements are not specified, but the team has demonstrated experience in Web 3 and blockchain development.  One member is an Atala PRISM specialist, which is essential for this project. Team is specified by name with relevant experience and roles identified. \nImplementation Plan & Budget (5): The plan and budget are detailed and reasonable. Milestones are clearly laid out, sequentially, in both the timeline and budget.   \nTechnically Sound (3): The proposal presents minimal technical details, but supplements with summary's of the Freeos  and FreeDAO components. Model content (e.g. explainer videos, whitepapers) outlining the project is absent. The team anticipates returning for future rounds for subsequent wallet integrations.  \nRisk Awareness & Mitigation (4): The team identifies four risks and proposes mitigation for each: 1) cross chain issues (mitigation: experience of team); 2) potential technical incompatibilities with different KYC formats (mitigation: specialist team member has expertise in area); 3) KYC is centralized (mitigation: wrap Proton KYC in Atala PRISM), and 4) KYC commoditization (mitigation: Atala PRISM prevents commoditization).    \nAverage Feasibility Score (4).\n", "q1r": 4, "q2": "Roadmap, Milestones and Time Horizon (5): These items are present, clearly delineated and presented in order of execution.  \nReasonable and Quantifiable KPIs (3): KPIs are generalized and reportable as milestones completions. KPIs are dichotemous do not lend themselves to further quantification.\nTransparency (5): The team will track tasks daily and milestones fortnightly.  Progress will be tracked using Clickup.  Code will be updated and posted to Github. \nAverage Auditability Score (4).\n", "q2r": 4, "assessor": "z_assessor_2523", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4553, "q0": "This proposal provides a problem statement and and a very clearly described answer to that problem.  Advances must be made in KYC solutions and self-soverign identity for the larger vision of Cardano to continue.  This team plans to introduce cross chain interoperability with the Proton chain with Atala Prism and mint NFT badges to serve as identity credentials, therefore lining up with the challenge setting.  The proposer cites other human resources they are able to reach out to if the team needs more information while building this.  The team also outlines a bigger picture in the proposal, as this one is just a step in a larger multi-step plan ultimately forming a DAO on Cardano.  Github repository indicates that the project findings will remain open source, which aligns with strategic goals for fund 9.  Rated 5 stars.", "q0r": 5, "q1": "The proposer has included Github, a Medium article, links to relevant websites, and a YouTube video to help understand how this will be built.  These links give the reader a clear idea of the resources the team is working with.  Information about the team including specialties, experience, and what purposes each individual will serve in execution of the proposal are clearly laid out in the proposal. The budget is clear and broken down by a USD rate per hour (specified difference between US and NZ developers), then each milestone of the project includes anticipated hours needed to accomplish each step.  However, the specific titles of team members accomplishing each task is not noted.  There is also an attached further breakdown of the budget.  There is no plan mentioned if additional funding is needed to complete the project, but the proposal provides a clear and detailed timeline that states measurably what is needed to reach the goal.  Technical aspects for implementaion of each step are also addressed in the timeline.  The listed risks/mitigation leave something to be desired, as the solutions generally point back to the team and their skills solving the problems.    Rating feasibility at 5 stars.", "q1r": 5, "q2": "There is a roadmap presented including 9 milestones that include time-limited milestones. Each milestone is expected to be completed within the “2 week sprint”.  There are 5 measurable outcomes listed in the proposal that are expected to qualify the project successful.  Their “fortnightly sprints” method of tracking progress is a great metric for measuring progress.  They also provided a link to a “Clickup” site, which will keep documentation of project progress.  Unclear if the Clickup app will be visible to the public.  Code will also regularly be updated in Github for the public to view, as well as blog documentation (I would like to see a link to the blog, or at least a title), and presentations at Catalyst SWARM.  Rated 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2563", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5294, "q0": "At the time of assessing this proposal, the Proton blockchain was ranked as #433 in terms of market cap, and has 57k followers on Twitter.  The Freeos DAO has a bit over 2000 followers. The unique thing about this proposed cross-chain collaboration is therefore not in the quantity of potentially shared user growth, but the quality. The concept of a self-sovereign, digital identity is very dear to the Cardano community and vision of IOHK, and one of the main strengths of our blockchain at the moment (with government student ID in Ethiopia the best known example of traction).\nFreeos brings several innovations to governance and staking that the voter may or may not like, but they are outside the scope of this Atala PRISM use case example. What the proposers are trying to do is to connect Freeos and Proton by using Cardano DID using the infrastructure of the Roots wallet. \nIt would have been nice to see some more strategic long-term thought going into the direct benefits to Cardano beyond that, as in its current form I see this proposal mainly benefiting the Proton Freeos token which might be \"pumped\" by its exposure to the Cardano community. So although this is a very interesting use case of DID and cross-chain for Cardano, it might benefit from making it more win-win for our own crypto and non-holders of the DAO token. I therefore neither agree nor agree that this proposal effictively addresses the challenge setting, but would wholeheartedly endorse a tweaked version of this proposal as the ideas at its core are extremely sound.", "q0r": 3, "q1": "This proposal combines some of the brightest minds of Cardano DID and Freeos DAO development and has a sufficient budget and timeline to make it a success. It is well structured into milestones and has realistic deliverables. As this proposal has 3 co-proposers and 8 listed team members divided into US and NZ teams, it would have been great to see the exact responsibilities described in more detail. It is reassuring to read that Lance Byrd or Roots wallet himself will be responsible for the Atala PRISM implementation though. It is also good to see detailed risk and risk mitigation. I agree that this project is likely to be implemented successfully.", "q1r": 4, "q2": "Despite the strong team, detailed budget breakdown and good milestones, the auditability section and deliverables are not giving me very high confidence that the success of this proposal can be audited meaningfully by the community. A Cardano presence on Proton. As the goals are simply reciprocal presence of the blockchains without targeted user conversions or number of credentials issued or other such quantitative goals. Brining Proton KYC verification to Cardano and exposing Freeos to the Cardano community are huge benefits for Proton and Freeos but without ambitious goals on the Cardano side not quantifiable targets that the community not currently involved in Freeos could appreciate or benefit from.", "q2r": 3, "assessor": "z_assessor_2687", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thanks for your thoughtful comments.\n\nImpact Alignment: Big picture we'd like Cardano to benefit from access to KYC, and access to participate in Freeos on Cardano. The focus of Freeos is to give out tokens to participants - if Freeos \"pumped\" then Cardano participants would benefit.  \n\nOur approach to auditability is along these lines: \nSuccess is defined by \"Cardano presence on Proton\" and \"Freeos presence on Cardano\" which is clear and sharp. Agile development with the 2 weeks sprint method enable a precise monitoring of the progress. The community will be able to follow it on a public project management platform (ClickUp). Adding that the code will be updated in the FreeosDAO public github repository."}], "solution": "Cross-chain validation of Proton KYC identity with Atala Prism.\nMinting non-transferable NFT/badges to affirm identity credentials, KYC ID with Atala\nprism. Enables proof of humanity KYC solutions.", "experience": "Lance Byrd Decentralised Digital ID & KYC\nAshton Engberg Cardano Web 3 dev cross-chain NFT\nJerome Kelsey cross-chain KYC/NFT design/product management\nTom McCann Blockchain backend crosschain KYC/NFT\nConor Seed Blockchain frontend KYC\nJude Tan Blockchain test cross-chain KYC/NFT"}