{"id": 416363, "author": "monet", "title": "Cross-Chain NFT Cultivation Events", "url": "https://cardano.ideascale.com/a/dtd/416363-48088", "category": 26598, "amount": 50000, "description": "South African artists lack much-needed guidance to understand and create NFT art on the Blockchain and how to join the digital ecosystem.", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 1645, "q0": "The proposal is fully pursued with what the challenge Here, we want to form a relationship between Cardano and other blockchains, so that our technologies are better known, respected and adopted as the most used, effectively. An idea in a series of events, but not problems is just by Cardano (since creating a series of events, problems is just about that, creating the intention to study and export over the chains). These workshops would not know as an audience artists who produced NFT, the idea would be to teach them how to mint in Cardano or even present the target technology to those who want to em. I think this is all within the context that we seek, the proponent quite aware of the fact that it looks like the people of Cape Town will not become fully clear - now they are fully aware of blockchain technology, so he is fully aware of blockchain technology , so he is fully aware of blockchain technology specific concepts, coinage such as \"What is discarded an NFT and why is it not just a project jpg Differences between Blockchains and NFTs, sites of similarity and hype, rating tools, past and factors secondary successes, setting up a wallet, and why art is essential to the ecosystem and the long-term vision and application of NFTs.” Ethereum also points out that it will combine with marketing experts to provide smart solutions, according to some electrical methods. , can also be combined with it. further explanations: what would this approach look like?) Only a few details remained pend people here, in my view. First, how many events would there be, how often would they happen, would we already have a defined location to rent? Then, from which audience do you intend to attract the attention of the audience of these workshops? Marketing is always a part of any proposal, but especially as a proposal of this nature, which aims to promote the sum of new active members to the Cardano community - knowing that these people would be super important to be engaged, at first, to study and better understand our ecosystem, its various possibilities and opportunities. How can we arouse the interest of conventional artists, so that they seek to produce NFT? I think these issues would be worth commenting on as well. Quite a proposal, the proposal since we know what I weigh, what are the guidelines to be addressed, what are the issues to be proposed and also how the possible proposals made would be mitigated. All of this is very much in line with the specific goals of the challenge, to bring new members to our community and to promote well-being and beneficial exchanges between Cardano and other blockchains; These challenges are known and are cited, for example, “Awareness and Governance, Culture, Organization and Inclusion, Innovation and Decision Making, Collaboration Tools and Platforms, Encouraged Participation” and so on. For reasons, I believe it deserves top marks when it comes to the impact proposal.", "q0r": 5, "q1": "The proposal is viable, but we still have a lot to improve here. Speaking of script, first. The whole is divided into phases, these phases are divided into weeks and some tasks are delegated to each, as is clear in the excerpt: “Phase 1 Pre-Launch (1-4 weeks): 40 Days - Marketing, networking, public relations, articles, interviews, 30 Days - Location, lease agreements, staff interviews, hiring and training. Looking for at least two dedicated employee hires for six months.” My question is regarding the degree of detail, we don't know exactly how long each proposed activity would last (or how long it should last, in planning). Not much detail about the actions is provided either. For example in phase 3, between weeks 16 and 28, we know there would be mentoring and training. How would feedback be collected? How would CVs be provided? In general, how would artists be instructed, in addition to synchronous face-to-face moments, to develop these new technologies? It's a little open about how, on a day-to-day basis, everything would be done. That said, I believe, I believe that a further degree of detail and depth would benefit our understanding of the whole. When we talk about costs, unfortunately this part leaves something to be desired, in my view, because the total amount is divided into very high installments, which are not well explained and detailed: “Marketing costs of US$ 10,000 - promotional videos, short documentary of 5 minutes, Twitter, discord, traditional print, posters at artist hangouts + $30,000 Event Costs - Venues and accommodation, catering, setup, decor, projectors, etc. + $10,000 Personnel Costs - Hiring 2 full-time staff per 6 months\". For example, we know that it would be 30 thousand dollars to cover the costs of the events themselves, locations and accommodation, decoration, projectors and so on. But how many events would there be, how much money would go towards each of them, and how much money would go towards each of these little parts (decor and etc)? Likewise with marketing and staff expenses: the $10,000 figure is not well argued. Overall, I found the proposal to be expensive, especially in relation to the costs of the events; it would be important for all of this to be better explained, so that we could have a better understanding of the real need for such investments. And finally, analyzing the team, this part also leaves a little to be desired. We know the names, linkedin profiles and brief explanations about each team member. But we don't have a very detailed curriculum of each, examples of projects they developed before this one, how close they are to Cardano (eg Aaron Arfman is said to be an ecosystem guru - what do you mean? What has he been doing? until then within our community? It would be necessary for this to be clarified through examples, for example any proposal that he has already involved in any of the various ecosystem groups he has participated in - such as Catalyst School, Wada, Cardano4Climate among others). For these reasons, I believe that all parts of the feasibility could be better worked out; although we have basic information about each of them, it would be very positive if we had more details and more arguments, so that we could have more confidence about what would be done, by whom and for how much investment.", "q1r": 4, "q2": "When we talk about progress, the suggested auditability is very good. The bidder informs us of various measures that would be used as KPIs to track partial results, such as “Number of attendees at the event / Number of assessments completed at the event / Skill assessments completed at the follow-up assessment (email delivery)” . Generally, when proposals are aimed at holding events, the proposers turn all their attention to the day of the event, the event itself, without thinking exactly about how the effects of that event can be monitored, that is, how the fruits that arise from it. would they be noticed and proven? This does not happen here since the proponent states that a follow-up assessment, sent by email, would be carried out after the completion of the course. I believe that the questions would serve to understand how the artists would be putting the acquired knowledge into practice, and also, according to the proponent, additional support would be provided. So the only thing that was pending for this part of the proposal to be perfect, in my view, would be some way of auditing the development of the phases, the pre-production that would come before the events. How could we keep up with the tasks that would be necessary, like hiring those who would pass on knowledge, defining the location, calling the audience, that sort of thing? In my view it is both necessary that we know what happens before the events, during and after (these last two parts are quoted). Speaking of final results, success is seen with the maximum capacity of events, the delivery of skill training through mediation tools, transmission of the desired skills and so on. In other words, training the local public. This would definitely drive greater adoption of our blockchain, more artists minting active tokens on Cardano. This is all made clear in the excerpt: “maximum event participation and social exposure for three major events and four smaller workshops with measurable skills training deliverables – we will have an assessment to measure your current knowledge and skills around NFTs, Decentralization, Blockchains Multiples, Cardano”, etc. It would be interesting if all the information were gathered in a complete survey, in which we knew what the artists would be producing after a certain time of the events, and also if the cross-transactions between Cardano and other blockchains increased. Such information must reach the community, either through channels such as discord or telegram, or a website created for this, or even participation in Townhall, for example. In general, auditability is good, but not perfect.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 9, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1363, "q0": "Yes, this proposal effectively addresses the challenge by committing to host a series of events that engage artists from South Africa to learn about NFTs and blockchain. The proposers state that Africa is largely Ethereum-enthusiastic, so these Cardano-led meetings may help increase the movement of these artists between chains. \n\nOverall, this seems like a good approach to help newcomers to the space, or newcomers to Cardano to engage in an easy, conversational, and in-person manner so they can ask questions and potentially become engaged in the blockchain space. The in-person approach is also smart since it can be very hard to dispel misinformation online, but much easier to have a conversation and clear up any confusion. \n\nWhere I think the team could have done a bit better in the impact section is focused more on the cross chain aspect. While I don't disagree that it could happen, I think the proposers could have highlighted how cross chain collaboration would play a central role in these events. As written the cross chain collaboration feels a bit like an afterthought rather than the focus of the proposal. ", "q0r": 4, "q1": "Yes, given the experience and plan presented, it is highly likely that this proposal will be implemented successfully. \n\nThe plan as presented is quite straightforward and predominantly focuses on the hosting of the events. Each of the stages, activities, and deliverables are fairly clear and likely more than achievable. I do think that the team should have included the number of events and workshops in the plan section, not just in feasibility, but at least it's there. \n\nThe team seems very well equipped to deliver on what is presented and appears well connected in the blockchain space to be successful. Their position in the locale of focus also will likely increase their ability to reach out to existing networks and communities that might be interested. \n\nPersonally, I maybe would have liked to see a better outline of the budget rather than just high level items, particularly for the $30k of hosting the events, some more granularity would go a long way. \n\nI am not commenting on the Monet Training Curriculum being developed as it doesn't appear part of this proposal. If it was then it could be better explained how it will be used in the events themselves. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. \n\nThe team does an excellent job at listing their KPIs which are measurable, with their main indicators focusing on the attendance of the event, online sharing of the event, and new adopters of Cardano. They commit to conducting follow up questionnaires to improve their delivery which will result in direct auditing by participants and community members. \n\nWhat is missing in this section here are success measures that the KPIs will be used to measure. I appreciate the goal is to \"fill our venues with maximum attendance\" and \"impart a sense of skills transfer\" but it is unclear how you would determine what constitutes \"maximum attendance\" or \"a sense of skills transfer\". These are much too abstract and do not align with the KPIs. I would suggest adding in more tangible measures in a future round, if necessary. \n", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1, "reply": "What is more tangible than wallets registered, art pieces created by newly onboarded artists? "}, {"id": 1739, "q0": "The problem statement offers insight into this project, including collaboration \"cross-chain\" and \"cross-community\" between artists and blockchain enthusiasts. Both are goals of the challenge; thus, the proposers have done well to meet that objective for voters.\n\nThe value-add is in the paradigm of the proposer, and the potential of having this \"mission-driven\" mindset leads the way to new adoption. Basically, the team aims to focus on making sure to help attendees understand that \"the Cardano community promotes a collaborative ecosystem for a multi-chain future.\" Bravo, team. Well done in keeping with the brief and sharing in the true spirit of the challenge.\n\nBy offering such cross-chain/cross-community events, the proposers provide a valuable addition to the ideas in this challenge. There is no doubt that a successful outcome of this proposal would match the challenge and have a positive impact on all chains and communities involved.\n\nThe mitigation for the risk of coming across as Cardano-only is ensuring that the marketing team focuses first on providing that potential advertisements are given a \"cross-chain\" feel.", "q0r": 5, "q1": "Since the proposer has followed the guidelines and only offers the relevant experience for each team member, voters can appreciate the time this saves them in reviewing such sections.\n\nThe detailed items list offers a clear picture of all of the items necessary to hold the event and almost offers a checklist that the proposer can look back at to track progress. As someone with significant event hosting experience, good work there. If rewriting, please break the $50000 budget into more than 3 categories. Currently, it is difficult for voters to know what $ per hour your team members are charging for their work, if it is representative of an average budget for such work, etc. This is a new ask for proposers in Fund 9, and voters will appreciate the attention paid to it if the team includes it if rewriting.\n\nInformation about a team's current monthly operating costs that are outside the budget ask is unnecessary for the budget area and can confuse readers (voters and assessors alike!). If rewriting, please remove it for clarity.\n\nNo funds seem to have been set aside for contingencies; 5%-10 % are standard in the industry the proposer may think to include it if rewriting, especially given the small budget.\n\nThe plan is a bit more general than it could be. Each section offered in the first 40 days, such as \"marketing, networking, PR, articles, interviews,\" should all have its own list, own breakdown of details, and a complete plan behind them even if displayed in brief, such as: \"Marketing phases to include: 1. social media 2. email connections list 3...\" Given this lack of clarity, the timetable does seem realistic, and there are some actionable items, as opposed to tasks that would come from more detail added to the plan as mentioned.\n\nEvery effort to help voters see the community can track progress on a plan they are committing to makes a proposal more attractive. If rewriting, voters would benefit from months/years, or Q1, Q2, etc./years, as opposed to the more open-ended \"1-4\" weeks. For all reasons mentioned in this section, the proposer receives a 4-star score.", "q1r": 4, "q2": "Roadmap and milestones and time horizon for achievement?\nThe detailed plan in Feasibility constitutes more of a roadmap, and a roadmap of the entire project is an excellent example. It offers specific milestones and time horizons for achievement.\n\nThe KPIs offered in Auditability, the tracking of attendee attendance, surveys, email assessments, NFTs minted by guests, and tracking tweets and wallets are a thoughtful plan for monitoring progress. It is easy for voters to understand how taking these results and applying them to future projects will help the team refine this process for even better outcomes.\n\nIf rewriting, please include weekly updates in a Gitbook or a short vlog every so often to report progress to the community. These additions will round out the Auditability section well. All said the section receives a 4-star score.", "q2r": 4, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3448, "q0": "The main idea of this proposal is create traning and general events of blockchain as whole to South Africa, aiming primairly at artitiss who can leverage the NFT art. This makes sense to fill in the gap in this country regarding lack of guidance in this digital niche, as identifies in the problem statement. As the events will not only be focused on Cardano, but also in other blockchains, as Ethereum, it can incetivize interoperability and collaboration cross-chain, therefore, addressing challenge goal (one example of addressed challenge kpi is \"Number of events / workshops / sessions arranged with other communities\"). Proposal also presents well the topics to be discussed and will work with partners such as The Art Bank to faciliate event promotion, adoption and leverage their capabilities.\nThe strucuture of these events could be better ellaborated, giving more details on the acitivites to be developed. For instance, how the teach part would be carried out, whether there'll be exams or projects to be developed, and so on. The marketing strategy could also be more explored, given the importance of it for this project. It is mentioned that they will rely on marketing gurus to do so, but this is a bit vague.\nAll in all, it's a nice idea and good proposal, fitting well in the challenge, with potential to enhance cross chain collaboration. However, some minor ellaborations (as the ones mentiuoned above) could be provided, to make it more complete.", "q0r": 4, "q1": "There's a very complete and time-framed plan, which included both the core acitvities (such as the events themselves and a mentorship) and the supporting ones (such as Marketing, networking, venue rental). It isalso well divided into 3 phases, which helps to give clarity on each project step. Budget breakdown is fair and matches project plan. \nRegarding the team, there are 5 people already committed with experience in art, NFT, blockchain and marketing. These competencies are essential for this project and linkedin links are provided. However, it is mentioned that part of the budget will go to extra 2 full-time staff members but their role in the project is not mentioned. it could be clear here what are their desired competencies as well.", "q1r": 5, "q2": "There are several kpis proposed to assess project success but some of them could have some targets. It is mentioned that the goal of # of attendees will be the maximum capacity of the venue that will be rented but some idea on the number could be given (dozens, hundreds?). It's also possible to add as kpi the feedback from the attendes to measure the quality of the content.\nIt's also possible to extract some milestones from the plan, related for example, to each of the planned event being carried or the reports proposers will do,but its imporant they share this in online open spaces (as twitter or github) so anyone can see it.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6100, "q0": "Geographically, South Africa belongs to the African continent, with a population of about 59.31 million (in 2020). In which Cape Town is the legislative capital of South Africa, with about 3.7 million inhabitants (ranked 2nd in the country). The team proposed with the idea of ​​leveraging their multitude of training resources to create a Cape Town curriculum and event led by Cardano for all artists on any blockchain. The proposed group describes clearly and in detail. Organize training events and design curricula that help promote artistic creation on Blockchain, and the good thing is that it can be freely made available to anyone as open source material. The events will be led by Cardano artists with a wide range of topics: what is NFT, minting, setting up wallets, and more. On the other hand, the curriculum and other related languages ​​also apply to other Blockchain users, not just Cardano. Very interesting proposal, I think it will be a fascinating portal for artists. The purpose of the proposal is to disseminate the knowledge needed to understand and create NFT art on Cardano, as well as how to participate in the digital ecosystem. In other words, we know what the purpose of creating this content is. We know what specific activities and goals will be developed. I think the artists that will be trained and developed just need to be guided through the training and teaching method as suggested here. The team also realized that the proposal's only risk was marketing. They will rely on professional marketing experts to explain insights and solutions to Blockchain enthusiasts. The proposal has a good impact on the challenge", "q0r": 5, "q1": "Here the route is divided into 3 phases. The first stage is pre-start, the second stage is the program launch, the third stage is after the program. Each phase is divided into weeks by the proponent. and the jobs are broken down by number of days in detail. Overall, the proposal team provided us with background information for our assessment of this issue. Next is the budget analysis. The team proposed a budget of $50,000 for the entire proposal. A relatively reasonable proportion of the proposal, less than 10% of the total challenge budget. However, in my opinion the team could analyze a more detailed budget sheet for each work to be allocated in the project. For example; how many videos, documentaries... per month? Funds allocated? As for the cost of the event, it was $30,000. Account for 60% of the total proposed budget. The team can add more details to this section. We can better understand the cost per job. For example: Where will the location be, how long to hire with a specific cost, which specialist will take on the organizing work. The team can provide information, or a short presentation, about two full-time employees, with the experience and skills to match the job to be performed. (But I understand that it is not always possible to refer all members, in which case you should refer them when they are hired). Overall, we can clearly understand how the proposal will go, what needs to be done, what the budget should be used for. Finally, about the team of team members. The members are all experts and consultants with many necessary skills to implement the project. And there are attached links, so we can learn more about each member. One very positive thing is that some of the team members have close links with Cardano which I think is essential. Proposal has a good plan, experienced team, budget can improve in more detail. I will keep 1 point for the budget part.", "q1r": 5, "q2": "The team's proposal is completely new, however, it has a tight plan, a specific roadmapReferring to the auditability section of the project, proponents begin by stating what is to be expected. The team provided a series of metrics by which we can measure the progress of the project: number of participants, number of completed reviews, number of new wallets registered... all of these What they do will lead to the ultimate success of filling their locations with event participation and social exposure, with training content, imparting a sense of skill transfer to those attend the event, attracting artists to participate in a social capacity. The proposal clearly describes the goals it aims to achieve. Specific solutions to problems. If successful, it will facilitate South African artists in particular and artists on any chain. Increase understanding and number of Blockchain Cardano artists, develop the ecosystem", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11350, "q0": "The idea of ​​the proposal is quite good, helping with training and curriculum design that will fill the training and information gap in South Africa in promoting artistic creation on Blockchain.\nThe proposal also introduced a number of risks such as: The main challenge is to market events as cross-chain events rather than Cardano-only events. And the solution to risk is: rely on marketing experts and proven methods to market professionally.\nHowever, it is suggested that more specific risks and solutions be introduced so that users can have a more objective view. In addition to training artists, the project should be expanded to include ordinary people. The project will attract more users. The proposal needs to be more clear about the number of trained artists and after being trained, there should be a plan or check the quality to be achieved and each person's understanding of the blockchain as well as the cadano ecosystem.\nThe impact of the proposal matches the challenge.", "q0r": 5, "q1": "The proponent has provided a detailed plan including progress and milestones to be achieved in the proposal:\nPhase 1 Pre-launch (1-4 weeks):\n40 Days - Marketing, networking, PR, articles, interviews,\n30 Days - Search for locations, hire agreements, interview employees, hire and train. Looking to hire at least two dedicated employees for six months.\n\nStart the program phase 2 (5-16 weeks):\nThe first event is launched 40 days after funding is secured, a major event every month after, and smaller skills workshops 6-9 months after funding is secured.\n\nPhase 3 after the program (16-28 weeks):\nMentoring and training. Feedback on the material and curriculum is provided to remove any nuances or esoteric language so that it is easy for everyone to grasp and follow.\nGenerate report and survey report for each event one month after the event is held.\nReport the impact study three months after all events ended.\nThe proponent has also broken down the book by categories such as: $10,000 Marketing Expenses - Promotional Video, 5-Minute Documentary, Twitter, Discord, Traditional Printing, Art Hangout Posters doctor.\n$30,000 Event Expenses - Venue & organization, catering, set-up, decorations, projectors, and more.\n$10,000 HR Expenses - Hire 2 full-time employees for 6 months.\nThe divided budgets are completely reasonable.\nHowever, my small opinion for the proponent is that in addition to the budget from the catalyst fund, the proposal needs to call for or find other sources of funding in case the ADA price slips and there is an additional reserve fund if the ADA price drops. The project generates additional items that need to be resolved.\nI highly recommend the team of participants who have a lot of experience and are provided with a fully transparent link to the public.\nThe probability of success of the proposal is quite high.", "q1r": 5, "q2": "The metrics of the specific proposal are clear\nReaders can easily verify as:\nNumber of people attending the event\nNumber of reviews completed at the event\nSkill assessment completed in the next assessment\nNumber of NFTs minted from attendees after the event\nNumber of public tweets and retweets with Event Hashcode, media referrals and published articles.\nNumber of new wallets registered from event attendees\nThe success of the proposal is given specifically as:\nfill its locations with maximum attendance for events and social exposure with measurable skills training content using the above listed measurement tools in KPIs.\nThe ultimate success of the proposal was being able to impart a sense of skill transfer to the attendees. An artist's 'pay-it-forward' approach that Monet trains will then go into the ecosystem to train other artists. This may be a prerequisite for some artists who train outside of the official staff. It is important to engage artists in a social capacity.\nthis is a completely new project, but with the sustainable development goals proposed by the proposal, I fully believe the proposal can be successfully implemented.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12604, "q0": "The project effectively addresses the challenge, NFT is gradually becoming popular and the need to have access to it is increasing. The proposer has clearly stated the goal and how the project will be implemented, organizing a series of events related to NFT is not a bad idea when it creates attraction for the community, that directly complement your training program. I like that you try to keep the cost to the learners as low as possible such that a training program can be freely available to anyone in the form of open source material, so anyone can easily approach to creating art on blockchain. The topics you bring up I think are quite numerous and not yet coherent, you should probably nest related topics together to be more coherent. For example: Introduction to NFT and its relation to blockchain can be grouped into 1 topic. And I would recommend proponent to share any more successes they may have had related to education and events sector.", "q0r": 5, "q1": "The team is very experienced in relation to the development of this project, and all the background information of the team members is provided very clearly. And I believe this project has a great opportunity to do so because the roadmap given is reasonable, the timelines and timeframes match each part of the progress. If phase 2 of the project is when events and activities are implemented, phase 3 is when related feedback is gathered and final revisions are made, which shows the high viability of the project. But I see the phase 2 you describe is not clear, in the period of 5-16 weeks, we know that events will take place. However, how will this task be accomplished? Exactly what activities will happen in what time? What experts will be involved here, performing what small tasks to make progress possible? Financially, I think the amount requested is reasonable given the scope of the project, and is fairly straightforward to understand how it will be used.", "q1r": 4, "q2": "This is the kind of audibility we want to see in proposals, in which the proposer comes to the community and shows progress, not the community having to ask first. The measurement of success in project implementation and indicators are given in quite detail. This shows that the team always has a guarantee of the risk and clarity of the project. The proposer has codified this information on an official website with enough pictures and videos of activities like many projects have done. This will help the team work closely with the community and easily receive support. With all the information released, it's great to see such an effort to be transparent.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Leverage our multitude of training resources to create a curriculum and host Cardano-led events in Cape Town for artists from all blockchains and artists not yet creating NFTs on any blockchain.", "experience": "100+ years of combined experience in education & events, including participating in the first African Blockchain conference in Uganda in 2018. Cardano, art and NFT enthusiasts who’ve set up a nonprofit resource website with tons of educational resources around NFTs & Cardano."}