{"id": 416470, "author": "lambertglen76", "title": "United Media BlockChain Community", "url": "https://cardano.ideascale.com/a/dtd/416470-48088", "category": 26598, "amount": 330000, "description": "The problem that United Media is here to fix is the lack of production, content creation, and documenting the crypto community. Bringing the point of views of those who are working on the blockchain", "f6_no_assessments": 8, "f6_rating": 2.875, "videos": [], "media": [], "f6_assessments": [{"id": 485, "q0": "Solving the \"lack of production, content creation, and documenting the crypto community\" is a great idea! The proposal however does not make any case as to how this solution is answering the challenge ask. \n\nHow will this project  create new connections or enhance collaboration  between communities? What chains will you be working with? Why did you pick those chains?  Are you planning to create community and additional interactions around the videos?\n\nwithout clearly drawing the line, the community has no way to access if this proposal's impact is align with the challenge's intended impact.", "q0r": 1, "q1": "The proposal provides a detailed budget with breakdown for four categories plus a misc. for the year.  Would have love to see similar details for timeline and milestone. How long will this project take? Per company? How many company do you plan to work with? How will you pick the companies?\n\nThe team is qualified and up for the task!", "q1r": 3, "q2": "The proposal has an ambitious goal to publish 30 episodes a month. The proposal however does not provide any information about how it plans to manage the project internally or how the community can follow along before the first few episodes start to come out. \n\nThe project has a clear definition of success... would have love to see the proposal tie its definition of success directly back to the the challenge's definition of success. ", "q2r": 2, "assessor": "z_assessor_2098", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 6015, "q0": "This proposal builds on the idea of ​​​​making episodes of stories in the blockchain space. If the technical characteristics make it difficult for people to imagine fully understanding blockchain, this project will be a means of conveying messages to the community through short films. However, what I evaluate here is the inappropriateness of the proposal. The proposal has not yet shown any contribution to the system. What are the elements of the proposal to develop more than the Cardano ecosystem? Besides, the proposal is beyond the criteria set by the challenge \"Cross-chain cooperation\", which has not been emphasized related to the impact of the proposal such as towards cross-chain collaboration yet, innovation, and interoperability. The proposal is not suitable for this \"Cross-chain cooperation\" challenge. suggested to the proponent that challenges should be found that better fit these ideas. Also add elements that are more relevant to the Cardano ecosystem such as movie content about Charles Hoskinson, about interviews with IOG members about the process of building protocol mechanisms for the system.", "q0r": 1, "q1": "Here, the proposal specifically tells us about each kind of work that needs to be done to be able to produce an episode, very fully and detailed.\nAbout the budget: the proposal is asking for a budget of $330,000, which is over 10% of the total budget. I think this budget cost is not reasonable compared to the value of the product that this proposal brings. Besides, the large budget will make it difficult for the proposal to reach consensus to be approved by the community. Therefore, I have a suggestion with the proposal that you should recalculate the cost or find more external funding to ensure the target of the challenge \"Cross-chain cooperation\"\nAbout the members of the team: the proposal outlines a few names that will take on what roles in the project. However, I have opened all the attachments but still can't find any details about the evidence for each member's experiences here. Therefore, I suggest that you add links to profile pages like LinkedIn to increase the persuasion to the community, and the community can easily check.\nIn addition, I also expect the proposal can provide more about the implementation roadmap so that the feasibility of the proposal can be fully assessed.", "q1r": 2, "q2": "The proposal provides clear milestones to measure progress, we have information on how many episodes will on-air here and at what time. However, I have a suggestion that the proposer should add numbers to measure the reach of the episodes. For example, for each episode that is broadcast, the proposal to attract #number of views on platforms such as Youtube, Website, etc.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6667, "q0": "This is a rather peculiar proposal, and I have mixed feelings whether it actually fits well within the challenge or not. Let’s dive in. \n\nStarting with the problem identification, the proposer informs us that there is a lack of content creation and documentation regarding the crypto community. I find that rather hard to believe, given the very low barriers to entry nowadays into any kind of video production, where all you need is a handheld camera (or even a smartphone) to start producing your own content and posting it immediately on social media platforms, video streaming websites or anything else in between. So I tend to slightly disagree with the statement, or at least propose a different framing - perhaps we are lacking quality content, well researched and edited? This I might agree with. \n\nIn any case, the value proposition we are offered is that United media wishes to start onto this quest with “going out into the field to find builders of the blockchain” … but then we are not told exactly what happens after these builders are found. We have to scroll through the entire proposal to find out that the goal is to have 30 episodes, but it is not clear if we are talking about podcasts, or documentaries, or what shape these episodes will take. \n\nLet’s take a step back and realize we are within the cross-chain collaboration challenge, whose aim is to foster collaboration between teams, identification of other blockchains to work with, and generally increase cross-chain activity. I have searched high and low within the proposal to find any meaningful connection to this topic, and there simply isn’t one. I don’t believe that simply creating media content will contribute to this goal.\n\nTo turn this value proposition into an excellent one I would have expected: \n\n- episodes focused on putting together relevant teams that can click together, perhaps “battles” between each blockchain’s main builders, explaining the advantages of working on their respective chains\n- making a pledge to go out and look for cross chain success stories and turn them into catchy documentaries\n- generally content for which participants have to interact and hopefully bond during this time.\n\nLacking any focus of this tailor-made content specific for fostering cross chain collaboration, I am not convinced of the good fit between the proposal and the challenge, hence only three stars I deem as appropriate.   ", "q0r": 3, "q1": "The team presentation is rather unimpressive, although the name of the proposal suggests otherwise. We are only being informed of Glen, the producer and director of the project, and his partner Giovanni who would oversee casting and logistics. They also have prepared two hosts of the show, called AI Love Tru and Im Rello. For an excellent proposal I would have expected to see a very comprehensive track record for every member of the team: past productions from Glen, the producer, a few social media links, to be able to judge his “traction” within the media sector and also convince of the quality of past productions. As well, I would have loved to see links to past shows hosted by our two potential hosts, but we don’t have any of that sadly. \n\nBudgetwise, the team is asking for funding for a six months period. The entire budget construction is not very convincing, and there are many unclear aspects about it. Let’s show a few examples (but there are many more in the proposal!) . For the five person team, they budget 750 USD per week, meaning 3k USD per month, but we are not being told how many hours per week each member is supposed to be working. Will it be a full time job or just two hours per day? We don’t know and it’s thus impossible to assess the feasibility of the numbers. Additionally, we are being proposed a general admin budget that includes food, gas, water bottles, parking tolls, etc. I am sorry to say that this kind of bulk budgeting, and including costs which have little to do with the project itself, is rather disrespectful for the general ADA holder, and I have a strong feeling that the community will not be receiving a good value for money here. \n\nTimewise, the proposers expect to launch one episode a day, and schedule shoots with blockchain businesses, with several teams of shooters (how do you achieve that with only five persons on the payroll?). They will be supposed to “run around the city, state, and country” but we are not being told not even which state the team is based in. California of course would be the intuitive answer, but how do we know the team is not based in Nebraska? We are not being told. \n\nGiven the unimpressive team description, the weak budget construction and the rather unfeasible plan and value proposition, I have to limit the assessment to three stars again.", "q1r": 3, "q2": "During the second phase of the project the team intends to increase their media machine and heavily promote their content (which we now find out will include documentaries, educational pieces, biographies and some entertainment pieces). They are also proposing a United Media channel en Ether Stream platform as a way of reaching out to the wider community - free content of course. The team also talks now about the ability to purchase NFTs (which are however not part of the detailed plan) which of course is a good think that can attract more users. Overall it will definitely be possible for the Cardano community to follow the developments of this proposal if implemented, but it would have been nice to think about a few performance indicators to really measure success: number of unique viewers, analysis of the most viewed content, perhaps allowing interactions with and accepting feedback from the general Cardano community. So overall we have a fair, but not excellent, case for auditability, so four stars are appropriate. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8787, "q0": "This proposal efficiently solves the lack of production, content creation, and documentation for the crypto community. The proposal also clearly defines the audience that the team will reach and accompany. The highlight is probably that United Media is established and widely known and has experience in Blockchain since 2021. However, with the difficulties raised by the team, I am concerned about scalability. Around the world, this will probably take a long time. Even so, I feel this project deserves funding.", "q0r": 5, "q1": "United Media can be called stable in terms of organization. However, it would be better if I knew how you divide the departments and the roles of each department. Through that, I will better understand the different departments. The part of the personnel cost you give, because at the moment I find this cost relatively high, accounting for nearly 30% of the price, the team considers hiring freelancers to use staff more reasonably. You have two hosts - A.I. You Tru and Im_Rello official. This will cost extra for insurance and benefits, while you can hire freelance M.C.s for each show, thus also helping the programs produced by the company to be more innovative through the leadership of many M.C.s.Also, in terms of equipment costs, the team considers renting equipment that is not used often.\nThe goal of releasing 30 episodes per month in theaters I find feasible because your group has a lot of experience in this.\nIn addition to a few points related to costs that make me bewildered, the rest see the possibility of success of this project. The programs and series on the Ether Stream decentralized platform that the team produces are enriching.", "q1r": 5, "q2": "United Media's goal of having 30 episodes in theaters every month is obvious and specific. However, I think you need to measure the effectiveness of the episodes, such as views, To share the information about how the team will spend when it gets the 330,000 funds is detailed, and if better, the team can update the weekly/monthly spending report for the community to know.", "q2r": 5, "assessor": "z_assessor_3004", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10565, "q0": "In my opinion, “United Media Blockchain Community” is a very good idea and has met the challenge of “Cross-Chain Collaboration”. This proposal has pointed to a problem that is quite a concern by the community, that is: \"The problem that United Media is here to fix is the lack of production, content creation, and documenting the crypto community. Bringing the point of view of those who are working on the blockchain\". This proposal is aimed at a target audience of businesses who want to do business using cryptocurrencies. When those businesses are in need, the United Media team is here to help with media production, content creation, logo creation, and digital marketing so that those businesses have the direction and platform to work to continue to develop further after that. I know that, if you want to do business in any field, you need to learn a lot, and have good knowledge and skills to be able to operate a business well. That preparation includes both physical facilities and orientations, strategies, and branding. Meanwhile, cryptocurrency and blockchain technology is still a fairly new concept to many people and places. Therefore, if there is no specific plan and no help and support from specialized units, it will face many difficulties and very high risks. Therefore, the United Media team is always ready to support, providing the best content about blockchain is a great and necessary thing for businesses and for those who are new to the community. The solution proposed by the proponent I found identified most of the problems of the challenge. By showing the benefits, the group's willingness to support the community has shown the impact of the issue and the proponent's argument is also reasonable. They describe the solution in detail, and clearly, and the topics to be covered are relatively complete. To successfully implement the project, they have anticipated the risks. There are 6 risks listed: Not enough people coming forth, Not enough staff for the workload, Running out of gas, Running out of energy to operate the equipment, and Not having a place to operate the business from. Each risk has solutions to overcome. However, there is a risk here if the first one is Not enough people coming forth. In my personal opinion, the group should have large-scale communication articles to be known by the community, such as publicizing information about major partners who have collaborated with the group to improve the quality of life, and reputation, or have an after-sales policy for customers, a consulting program and customer care after each cooperation. That will help the group get loyal customers and from there, through these loyal customers, they will introduce more new potential customers and partners to the group.\n", "q0r": 4, "q1": "This proposal has broken down the work and tasks that need to be done including: reviewing and adding enough devices to operate continuously for a year, scheduling spins with businesses and blockchain actors in the community, the work of editors, making brochures, creating logos, printing business cards, etc. These jobs are presented in very detail and specific, full of steps to complete a project. However, in my personal opinion, it would be better if the proposer had a more detailed schedule by giving a specific timeline. When to start deploying, how long does each task last, that timeline can be months, weeks, or even days? Thereby, everyone can easily control the progress and ensure more efficient work, avoiding the long delay of a job that affects the next stages and affects the overall results of the entire project judgment. Regarding the budget, the proponent presented how to allocate and use those budgets in a very detailed and specific, clear way, including employee payroll, operating costs of Gas, food, parking, tolls, rent, internet, insurance, etc. There is a point in the budget where the payroll is being divided equally among each employee. However, in my personal opinion, this salary should be divided according to the proportion of contributions as well as work experience. Paying based on individual performance encourages creativity and everyone's contribution to the overall outcome. In addition, if possible, the proponent should deduct a small part of the budget to make a reward fund or apply for additional funding to give to really excellent individuals and groups with many contributions. Regarding the participating members, the proponent also provided relatively complete information about their full names and position. However, this section should be supplemented with information about qualifications, work experience, and suitability for this particular job. If possible, the proponent can provide more Linkedln links for the community to access to learn and evaluate information.\n", "q1r": 4, "q2": "In order to measure the progress of the project, the proponent has proposed a KPI that should be achieved by having 30 episodes a month, which is easy to measure and test. However, in my opinion, in this section, the proponent should add a few other indicators or KPIs, such as: the number of new partners that will cooperate in the month, etc. The success of the project is also achieved as presented. This is a completely new proposal, but I see the impact of the proposal on the community is also relatively large. ", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11058, "q0": "The problem that the proposal puts forward that United Media is here to fix is ​​the lack of production, content creation and documentation about the crypto community, putting the perspective of those who are working on the blockchain but I see in The solution you think is that United Media is always ready to help in media production, content creation, logo creation and digital marketing so you have not shown the role of a producer, creator. Create content and materials about the crypto community. The project has introduced some risks, but the solutions given to overcome the risks are not very feasible. For example, facing difficulties in logistics, where you will buy land, buy offices, in my opinion this is not feasible because it requires strong financial resources while your proposal is completely new. Is there enough funding to implement that solution?\n", "q0r": 3, "q1": "In describing the solutions to implement the proposal and solve the challenges that you have submitted, you have not given specific actions but only given thoughts on the problem proposed by the proposal. The blueprint provided by you is generic without progress and milestones to document the results of the project. The detailed budget table for the project does not specify the number of employees; Upgraded equipment: 200,000 when buying permanently and renting equipment for the year, I see this section to clarify which equipment is purchased at a cost?, which equipment is rented at a cost? rather than aggregating into an upgraded device. Other expenses: 150,000 per year - hire drivers, makeup artists, spokespersons, costumes, catering, etc. This section needs to be specific to each type of expenditure to ensure transparency. The capacity of the project participants is not specific and is very general, the proponent has not provided evidence to prove their capacity. As you describe, I see no one has experience in the field of Blookchain technology\n", "q1r": 3, "q2": "The project's success metrics are not specific, according to your description, we voters cannot control the progress of the project. In my opinion, you need to stick to the progress in the detailed plan to put the way to measure the progress of the project, so that voters can visualize and control the progress of the project. This is a completely new project, I think you just stopped at the original idea, which is not really a viable proposal.\n", "q2r": 2, "assessor": "z_assessor_3216", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11501, "q0": "Proposal wants to improve lack of content and documentation in crypto community by creating 30 episodes (documentary) of something per month for 6 months. As content that will be published is not specified an impact of this proposal cannot be estimated. An idea of minting NFT to achieve some further income is valid but it would need more elaboration of why some would want it. Impact ideas of proposal are too general a miss valid reasoning. Provided Youtube video has minor views and shows that proposal team doesn’t provide valid social media content. Also, proposal is not aligned with the challenge as it misses arguments and blockchains for which it is targeted. I strongly disagree with impact of this proposal for Cardano ecosystem.", "q0r": 1, "q1": "Evidence of proposal teams’ relevant skill is not provided; roles are not set. Timetable and milestones are not set only a promise of 1 video per day is provided, this is unrealistic as there are no ideas of what will be covered. Running around city, state and country capturing content is not feasible plan. Budget is split into several items, a lot of is spend for equipment, miscellaneous services, rent – with high cost these are items that are total off. Marketing budget is missing, while it should be for this type of content carefully planned. Some risks are considered with some inappropriate as: \"Running out of food. We will buy a piece of land to set our HQ and use some of the property to grow our own food in case of any food shortages.\" With provided information this proposal deserves 1 star rating.", "q1r": 1, "q2": "Auditability of provided project outcomes can be probably seen on provided YouTube channel, as it is not stated so. KPIs of success are missing and should be more elaborated, like target of view counts etc. No public channel for project progress is provided. This is not effective solution to proposal challenge and insufficient to audit, therefore 1 star.", "q2r": 1, "assessor": "z_assessor_3255", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14010, "q0": "I do see there would be a series film and each episode would attach with a story related to the Blockchain via this proposal. A barrier in this proposal that is needed to state is the specifications which are mostly related to the specialized knowledge and could be difficult for audience to catch the true value from the project even though this project can be considered as a media that delivered the message to Cardano community in an effiency and effective. However, the mentioned barrier here confuses me whether I should or should not give a high evaluation for this proposal. The contribution to Cardano community is still ambitigous and none of obvious factors that affect directly to enhance. I do hope this proposal would be chosen as it follow a quite creative method when using film to create the value and send it to each individual since, we may not all like to read a such long essay with all included stuffs are words and words. It is a pity for this creative idea, but to be honest, this proposal is out of the challenges “The Cross-Chain Cooperation”  criteria that has been mentioned in which the relevance  toward the impact of the proposal as well as the related target to the challenges have not been strongly mentioned in a clear vision. Thus, I do recommend  for the proposer to focus more on the suitability key and add more information and factors that are more related to Cardano inhabitant. ", "q0r": 1, "q1": "Here, the workload has been described clearly in this proposal about how to produce an episode. \nOn the other hand, the offered budget here is up to $330,000 which is completely over 30% (compared to overall budget). That’s so HUGE. This is a really high and unreasonable. This large amount would be one of barrier for this proposal to receive the agreement from Cardano community. \nFurthermore, there are some names that is mentioned as a vital role in the project but I can not find any available information or profile related to those names. I am apologize but it took me several hours to make sure that there is no evidence to prove your teammate’s experience reliably after opening all the attached files.Provide a proof that it would be more convenient for everyone to check the reliabity of the proposal as well as the participants.\nAnyway, I do expect the proposal to provide more clearly about the conducting progress. That would be easy for us to give a more accuracy evaluation to your efforts.", "q1r": 2, "q2": "A good point in this proposal is that it is a provided timeline in this project to estimate the workload process obviously. Anyway, it is not strong enough to convince us. Instead of measuring in general and no confirmation or verification by real number, there should be a specification or the result that is demonstrated in number to estimate how much accessing level each episode is. Ex: attracts a definite 1000+ of views that would be counted and gathered from a variety of social media like Youtube.", "q2r": 4, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "United Media is going to go out into the field to find builders of the blockchain. The business that wants to do business using crypto currency. We will make a schedule and contact list of those folks", "experience": "United Media has been applying the pressure in the city of Miami with footage already shot for the Crypto Gods, The Crypto Corridor (Wynwood), The Chairman of the Crypto Task Force of Dade County, Bitcon, The Spot Wynwood, and so much more. We started this blockchain journey 2021"}