{"id": 416735, "author": "dreamcoin", "title": "BitFins Cross-Chain NFT Aquariums", "url": "https://cardano.ideascale.com/a/dtd/416735-48088", "category": 26598, "amount": 20000, "description": "Many projects developing in the NFT space lack a utility that can connect to the traditional world and the world becoming more digital means a need for bridging that gap is arising in many forms.", "f6_no_assessments": 6, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1050, "q0": "Even though I do not own any of their NFTs yet, as a fellow creator and collector, I’ve been following BitFins in the Cardano NFT space for some time now (a couple of months), as they seemed to be a group of dedicated creators, willing and capable to develop and innovate. As such, when I noticed they have submitted a Catalyst proposal, I was curious to see what they would be proposing. I am glad to see that they did not disappoint.\nTheir cross-chain aquarium is a nice initiative, opening a digital, interactive place for collectors from multiple chains to visualise their NFT collections in a new way. I especially like the fact that it will be open to all NFTs from the connected chains, with the possibility of partnerships with well-known projects, that would be offering special perks to their holders, like 3D statues of their art, custom frames etc. From the development I have been observing, it looks like the project really stands a chance of bringing collectors together, trying out the Cardano blockchain in a fun, enticing way and seeing the benefits it offers first-hand.\nAs such, I think the project can truly have a positive impact on the Cardano blockchain and lead to an influx of potentially new community members.", "q0r": 5, "q1": "I find the detailed plan section to be sufficiently well described. Perhaps stating clearly the order in which other chains, besides Ethereum, will be integrated would have offered a more precise development schedule, but I don’t see it as a great deficiency.\nI am glad to see the team mention their other proposals, especially since they have carefully considered their time investment into all projects they would be working on. I will probably be checking their other proposal as well, and as such, a link to it would have made my assessment a bit more efficient.\nRegarding the budget, I find the amounts and timeframe described to be in line with what I am familiar with, both on the development side as well as on the design side. From my experience, $12000 for 12 weeks of development seems definitely a feasible amount, both in financial terms, as well as implementation terms. The same applies to the 3D modelling sections and marketing. Regarding the outsourcing, the value of $30-$70 an hour is also a decent amount to be considering, even though I find the range to be too big. \nThe team has also taken the time to write some short descriptions regarding their skill, I appreciate that some of the team members have offered their real names as well, and for those who have chosen anonymity, I can understand their choice and will not be critical about it at all.\nAll in all, the feasibility section doesn’t seem to me to be lacking any critical information, the skills of the team members proved in all the attached links make me feel confident that they are capable of implementing the end goals of the proposal.", "q1r": 5, "q2": "I like the fact that the team already has an MVP of their proposal, an already running version on the Cardano blockchain. I like how they will be tracking their progress, but for the purpose of the Catalyst funding, a clear description of where these stats will be announced would have been helpful. I know they are active on their social media channels, so I suppose that is where they will be reporting. I think that is a good place to do it, but it was somewhat important to mention it, so as a proposal assessor I wouldn’t have to guess if that’s the case or not.\nTheir vision of success seems to me to be realistic and proves that they are working towards quality and not quantity. I know they already have a user base that is genuinely interested in what they are doing, and if they keep building, I can imagine that it will continue growing.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2249, "q0": "At first reading this proposal , i was so hyped thinking no-way they are adding collectibles to real Aquariums, but i got let down when i saw is a CG-game style Aquarium.\nThis is a great proposal for a cross-chain collaborations as the NFTs are promised to be used across blockchains.\nAs a game developer , i really love it (Real Aquariums would have been more hype).\nVCA/Voters can see the functionality here https://youtu.be/OMA7rxpZwW0\nIt is a good look seeing Brett from Tanked speak on Bitfins as i am a fan of the television show and thought they would be the team behind this.\nI will be giving 5 stars for impact according to the PA guidelines.\n\n** you can checkout my game here if you like card games:\nIOS :   https://apps.apple.com/us/app/id1488600103\nAndroid :  https://play.google.com/store/apps/details?id=com.sourcecard.whotfire", "q0r": 5, "q1": "This proposal have a clear milestones with associated timelines of the events and i do not have any questions .\nNow the proposal provided a budget breakdown but it lack details as to how the amounts offered where arrived at.\nfor example \"Development costs and coding for the aquarium platform - $1000USD per week base rate\" - How is the $1000 arrived at? How many developers are programming ? What do they charge per week?\nSadly the proposal provided details of the team but failed to provide verifiable links to their bio. I was unable to find their bio on the linked website as-well(https://bitfins.io/#about).\nI will be giving 4 stars for feasibility as i still believe the issues raised above can be rectified as the project progress.", "q1r": 4, "q2": "This proposal already have a means to be tracked(https://bitfins.io) and the team will provide updates of users at intervals.\nAnyone interested in testing the beta can go to the website now and test it.\nI have nothing much to add to this section.\nI will be giving 5 stars for auditability as the project can be audited with the provided tools.", "q2r": 5, "assessor": "z_assessor_2301", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 2715, "q0": "The proposal is very effective in explaining how Bitfins not only addresses the challenge but how they plan to grow beyond the proposal in the future. The proposal lays out the project in an easily digestible manner. I understand that the aquarium is essentially a hub where I can place my Nfts from multiple blockchains. This will only lead to more cross-chain collaboration, and considering the popularity of Nfts on both Cardano and Ethereum I see this proposal as a good stepping stone and extremely helpful in making Cardano a more interoperable blockchain. \n", "q0r": 5, "q1": "The links included in the proposal already show a working product. I did my due diligence and downloaded the application to try it out. The application worked great, and my Cardano wallet was successfully connected. The ambient music is awesome and super relaxing. Given the experience of the team (that is outlined in the proposal), and the current product put out for the public to use prior to Catalyst funding. I see no reason why this project wouldn't be implemented successfully.  \n", "q1r": 5, "q2": "This project is already well on its way to being a fully functional product. The project will be easily auditable based on new Nft collaborations, and new blockchains being added in the future. Bitfins has a thriving Social media presence which will also help in anyone's personal desire in tracking this project, and see if they hit the milestones described in the proposal.", "q2r": 5, "assessor": "z_assessor_2348", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2716, "q0": "I find the proposal submitted by the proposer and team to be really interesting. The proposal is submitted for the appropriate challenge and takes into account cardano’s goals and objectives.  This is a game-changing initiative to introduce digital Aquarium collectible into the NFT industry which has the potential of demystifying the concept of NFTS among the numerous masses about the worth of investing or paying monies to hold digital assets. This project will be revolutionary since it has the potential of bringing a lot of value into the cardano ecosystem and also opening up the cardano ecosystem to a totally new world that’s the introduction of digital assets into the aquarium world. This will therefore go a long way to onboard many new entrants into the cardano ecosystem. Another interesting point worth noting by the proposer is the capability of their application to interact with other blockchain platform such as ehtereum, polkado etc makes the project viable and worth implementation since these are some of the key metrics of the challenge this proposal seeks to address.", "q0r": 5, "q1": "The proposer and team have provided detailed information about themselves and the relevant skills they possess which I think is convincing and places them as suitable candidates to execute the project. Another thing worth mentioning is the numerous links the proposer and team have provided describing what they are already doing with respects to digital collectible in the aquarium industry etc. this is really exciting and signifies that the team knows what they are about and will really be able to bring the desired value cardano requires from proposers. I find this to be impressive and qualifies them for the job. The Budget is clearly outlined even though not so detailed but is self-explanatory and is divided into smaller bits making it simple to comprehend and interpret. Furthermore, a timeframe and milestones are stated by the proposer which gives a fair overview of the duration the entire project will take to be executed should they be funded. Finally, the proposer and team identified some potential risk to the successful implementation of the project and provided the desired risk management strategy which I think is impressive and deserves commendation.", "q1r": 5, "q2": "The information provided in the \"proposal details” can be used to audit the project should they be funded. The proposer has provided a basic roadmap on the project execution. They have however not stated clearly what the KPI's are in their proposal which i think they have left out  an important component from their project. Additionally, we can keep an eye on the tasks listed in the roadmap and also monitoring their progress through the use of their BitFins platform and also the tracking of user profiles of engagements with their aquarium platform is quite a great place to keep track of the number of new entrants interacting with their project. I believe that their strategy of reporting progress and monitoring is encouraging and increases their readiness to carry out the project should they be funded. I also have another suggestion for the team in terms of reporting progress: the proposer and team should try to engage with the various catalyst-cardano community channels and use their robust reporting tools to support their strategy. This will go a long way to bring transparency in their project execution and they will also be able to give frequent updates to the cardano community on the progress of their project.", "q2r": 4, "assessor": "z_assessor_2350", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5798, "q0": "This proposal very effectively address the challenge by creating an offchain collaborative solution that is linked to different chains. People are able to mint NFT assets on different chains such as Ethereum and Cardano yet can both take those assets to the same virtual aquarium. This proposal aligns with the requirements of this category and addresses the challenge. The team plans on integrating at least one more blockchain giving it even more reach. ", "q0r": 5, "q1": "The proposers are highly experienced members of the Cardano community. They have had alot of previous success with the bitfins project and are highly likely to succeed in their work. The plan is laid out very well and has a clear timeline for the work that is to be preformed. The project is likely to be successful based on the plan presented. ", "q1r": 5, "q2": "This proposal has clearly defined what success looks like and is audible. The community could track progress of the NFT minted and associated with this project. The proposers state that they will track number of users in the virtual aquarium and make those metrics publicly available. Can also audit the other blockchains used like Ethereum and any others added. ", "q2r": 5, "assessor": "z_assessor_2751", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11313, "q0": "This proposal is found in the Cross-Chain Collaboration category\nWhy is this Challenge needed?\nTribalism & maximalism are harmful.\nWe are in the multi-chain future.\nInteroperability is the key.\nWe need initiatives to increase communication, coordination and collaboration between chains.\nWe have common challenges. Let’s solve those together.\n\nBitFins Cross-Chain NFT Aquariums proposal beautifully fits to the challenge.  Bitfins has setup a Metamask wallet access as well as a Shelby era wallet access and is already cross-chain collaborating. They have future plans through Metamask to incorporate other chains wallets as well.\n\nPlease take note of this quote:\n\"\nUsing digital aquariums, we are providing a fun way for people to make use of virtually any NFT that they own through a gallery style customization where even profile pictures or art pieces can be displayed in the background as your fish (digital pets) swim around them. \n\"\nThis means any NFT from any chain can eventially be used in this proposal. This brings use cases from other chains over to the Cardano chain. This adds a lot of value to Cardano, especially as more and more chains are able to be used. This also bring awareness of Cardano not being a ghost chain, but literally able to use assets from other chains, and not just our own.\n\nThe problem that Bitfins is working on is that most NFT's have no utility that can connect to the traditional world. Their solution to this is that they are designing digital aquariums that collectors can customize with their own NFTs (of any project) including from other chains. In the real world people own aquariums, and there is even an aquarium hobbyist industry, but in the digital world not only can you own an aquarium, but you can put things in it that you simply can't in the real world. This takes aquariums, a real world asset, and turns it virtual, with unlimited possibilities. Not only that, but the possibilities are in the imaginations of future projects on whatever chain Bitfins adds a wallet for. This has huge implications for Cardano and may spawn many new ideas out there in the world of virtual and of NFT's.\n\nFinally we have scalability. This proposal is able to scale to any size, it just needs to be able to read the wallet of whatever chain it wants to scale to and collaborate with. This proposal effectively addresses the challenge\n", "q0r": 5, "q1": "First, the proposer has taken the time to consider the risks involved, and ways to mitigate them.\n\nThe timeline/plan is well detailed, clear, and achievable as it is laid out.\n\nThe budget us well written, broken down nicely, and would achieve the set goals\n\nThe team is very clearly listed, and the skills and experience of each team member is provided, but there are no links to verify the information provided.\n\nAlso, when it comes to the team, the proposer graciously let us know this:\n\"In the future we will be looking to onboard at least 1 more person for our marketing segment and another game developer to assist with large-scale environmental designs.\" So there is a possibility of expansion of the team in the future.\n\nGiven experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "There is no \"timeline\" or time horizons and milestones listed to give an idea when each part will be completed. This would be good to add, if the proposer ever decides to do another proposal. You can view their timeline/plan in the feasibility section of the proposal\n\nThey have provided key performance metrics that they will use to track the success and progress of the project, and are sufficient.  They have also stated:\n\"We have an open beta that will be actively updated. Anybody following BitFins will be able to use and test the product on their own as we release these updates.\"\n\nOne negative, is that there is no way presented in this proposal for the community to track the progress of the project. Some ideas for the next proposal if every needed is to add a discord, twitter, reddit, or some other thing where you are giving updates that the community can use to track the progress.\n\nI agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We are designing digital aquariums that collectors can customize with their own NFTs (of any project) including from other chains. We already have support for Cardano and Ethereum NFT wallets.", "experience": "Tyler Shavalier (Project Lead) - 12 years in graphic design & marketing\nHookman - 2 years game development, 21 years software coding experience\nBrett Raymer (Marketing & Expansion) - Over 20 years in the aquarium industry, Previously COO of $10 million dollar aquarium business"}