{"id": 416766, "author": "iagon", "title": "Automatic cross-chain token bridge", "url": "https://cardano.ideascale.com/a/dtd/416766-48088", "category": 26598, "amount": 40000, "description": "For the Iagon token bridge, the current process has to be split into two manual steps (instead of automatic): Ethereum to Milkomeda and Milkomeda to Cardano, which is not an ideal user experience.", "f6_no_assessments": 10, "f6_rating": 4.4333333333333345, "videos": [], "media": [], "f6_assessments": [{"id": 3267, "q0": "This is a relatively straightforward request for funding for software development, in this case, a couple of smartcontracts, one built in solidity, one built in Plutus, in order to add needed optimization to an (ERC-20_to_Cardano Native Asset) bridge built on Milkomeda's Nomad protocol.\n\nFirst a quick note on Iagon and their $IAG token, for those who don't know.  Iagon is migrating a decentralized storage and computing protocol to Cardano from Ethereum, in order to take advantage of Cardano's superior scaling and security.  A key part of this protocol is the $IAG token, whose total $1b supply has already been issued as ERC-20 tokens.  These tokens when staked provide the mechanism by which decentralized node operators (the backbone of the storage and computing layer) receive bonus rewards, and by which investors receive dividends from the fee structure for the Iagon service.  Additionally, investors provide liquidity to the token through arbitrage.\n\nAs near as I could tell they have moved $500m of the ERC-20 tokens over on the bridge, which still leaves a lot more to go.  But the bridge has the potential to be used for any ERC-20 to CNT conversion, and here is where an interesting scaling note comes in:  Iagon is in partnership with the NuFi cross-chain wallet (from the creators of AdaLite) to integrate bridging right into the wallet.  Obviously for such a feature to be successful, optimizing speed and simplicity is a priority, and these smartcontracts are the first step.\n\nIt is also worth noting the team's alignment in vision with Cardano, especially scaling and interoperability (which are really the same thing.)  For that reason, and because this is an effort actively migrating across chains with a high-impact project, I believe that funding the creation and testing of these contracts merits a full 5 stars for Impact.", "q0r": 5, "q1": "The team behind this proposal is extensive, and there is loads of information on the core leaders (CEO, CTO, etc.), as well as good descriptions of the other members such as Andrew Ong, the lead on this project as well as the Head of Engineering for Iagon.  The team includes Haskell developers and UI developers and testers, and they are partnered with a known Plutus developer that has done all of their Plutus work to date, as well as collaborating with the Milkomeda team.  The Plutus developer rates are competitive, and the Solidity rates are comparable, and a little lower, which makes sense, though I don't know what Solidity developer rates are competitive.\n\nThe Iagon bridge itself has been built and is fully operational, and the development of the needed software is clearly mapped out.  Currently the process of using the bridge involves multiple wallet connections and transactions, with multiple fees accruing at each step.  They have clearly laid out the processes they wish to automate with the smartcontracts, which is essentially the back half of each side of the tx:  for the Solidity contract they are automating the milkomeda C1 to CNT, with fees paid in Ethereum, while the Plutus contract automates the C1 to ERC-20, with fees paid in ADA.  \n\nWhile I don't feel this warrants being downgraded, I would have liked to have seen two considerations added or discussed if they are present.  The first is the need to convert to MilkADA for paying the Milkomeda fees.  This would purely be an onboarding issue, since it is easy enough to do, once you know how.  I am wondering how the smartcontracts handle this specifically, and if they mitigate the need for this step as well, or if it is even possible.  Second is the idea of enhancing the overall speed of the Tx process.  Again, this isn't a criticism worthy of downgrade, as many things factor into Tx speed, but I am curious whether they believe these new contracts will speed up the protocol \"on-chain\" (specifically the ERC-20 to Nomad conversion/wrap, where the majority of the wait is built in for the purpose of \"fraud-protection\", waiting to see if any other validators in the system contribute proof of fraudulent activity) or if the only optimization is the \"off-chain\" aspect of a smoother process for the User.\n\nIt is worth noting that professional auditing of the contracts will be something the proposers should do, and they indicate that they would likely be looking for that service in a new round of funding from Catalyst.  Because of ERC-20 side of things, I cannot recommend this path enough, and I consider a solid plan for this to be a critical part of delivering ROI on this proposal.\n\nBecause the team has a clear idea of the architecture and what is needed to create these contracts, and based on their past work and current experience with delivering cross-chain deliverables, I believe they will be able to deliver a working solution on time and within budget.  5 stars for Feasibility.", "q1r": 5, "q2": "The key here is that this is a software development project at root, even though there are elements such as the UI, NuFi collab, and audit that are lingering around the edges.  Ultimately what progress will be measured on is the development and testing of the smartcontracts and their delivery working as intended.\n\nTo this end the team is using Jira with agile framework, which they have deep experience in, and they included a helpful note that they will be using sprint burndown metrics to track and report progress and KPIs.  Their budget was divided up into a 3 month timeline with most of the funds on the backend once testing and UI came on board, but the funding distribution is well balanced and will fit the Coordinator format well.\n\nFinally, a note on Opensource:  while the project itself is not considered opensource, there are many aspects of the vision of the team and the execution of their protocols which indicate excellent alignment with this long term aspect of Cardano, and short term aspect of auditability.  The team, and especially its founders are very transparent and have shown a willingness and availability to answer any question and address any issues, going back to their early days when an initial round of funding got caught up in issues surrounding the service facilitating their fundraising (all investors were made whole).  Likewise, the backbone of the overall Iagon protocol makes the process of becoming a \"node\" open source and open standards.  Lastly, their documentation is extensive, clear and up to date.\n\nBecause of the team's transparency and availability, and based on the very clear roadmap and deliverables presented for this proposal, I believe that they meet and exceed Catalyst expectations for Auditability.  5 Stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 206, "q0": "Yes, it is exactly in line with the challenge proposed as it addresses the interoperability between Cardano and Ethereum. \nAdditionally, the team has the intention to partner with the Nufi wallet team, another great proposal, to work synergistically. In this way, the bridge would be built (Iagon, this proposal) and the Nufi wallet would integrate several dapps and blockchains using it.", "q0r": 5, "q1": "Yes. The team has already released a beta version of their solution, Iagon. All that needs to happen now is taking the bridge all the way to the stable release.\nFurthermore, the fact that they partnered with the Nufi team ( Vacuumlabs) gives them more credit, since Vacuumlabs has a stellar record of developing in this ecosystem, having taken part in Adalite, Yoroi, Trezor and Ledger hardware wallets integration, Wingriders DEX development.. \nThis kind of collaboration is very healthy to foster, and I honestly cannot think of a better way to spend the treasury other than in well established developer teams, and those rising stars who they accept to collaborate with. Makes us all better, and is a judicious expenditure of funds.\nI strongly encourage the approval of both proposals, since they are both very realistic and exactly what we need to happen to facilitate migration between Ethereum and Cardano.", "q1r": 5, "q2": "Yes, the team is well versed in how to make the project auditable. \nThe bridge essentially consists of two smart contract, one in Ethereum and One in Cardano. The only caveat is that they need to be computationally equivalent, and since they already have a collaboration with a Plutus developer (Kirill Elizarov ), they only need to find a matching Solidity developer.\nI have every reason to believe this project will deliver.", "q2r": 5, "assessor": "z_assessor_2060", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"id": 355, "q0": "The proposal accurately addresses the challenge by creating an easy user experience through moving to and from Etherum, Milkomeda, and Cardano. The proposed solution would have a good impact on the challenge settings.", "q0r": 5, "q1": "The team has already delivered a successful product that's been in operation and has a variety of projects that are in need of their solution. This gives good confidence in the team capability to deliver.\n\nThere is good thought into the usage of a wallet that supports the necessary chains to have an easy usage of the bridge.\n\nThe detailed plan section gives us a good sense of timeline and establishes promising partners, but there aren't milestones presented in the 3 month timeline provided besides the 2 user flows.\n", "q1r": 5, "q2": "The proposed solution does a nice job of illustrating how the bridge will work starting on Cardano and going to Ethereum and vice versa. A bit more context on the whole process as well as an example of a user journey would have been great. An exact step by step flow of what the user is doing along with what's going on with the smart contracts/backend would have been very helpful to read. Additionally there is a bit of confusion around the \"CNT\" and \"milko tokens\". Is CNT referencing a Cardano Native Token? Is Milko token refrencing ADA on Milkomeda because Milkomeda doesn't have its own token? Providing a bit more context here would have been very helpful.\n\nThe risks provided seemed reasonable and like they were the most pressing. Unfortunately there wasn't any mitigation strategy mentioned. It would have been good to see how their team could utilize a PAB alternative and the use of budget for an audit to get around the risks mentioned.\n\nThe budget does a good job of providing exact information on what will be paid for and how much it costs. The table provided is very detailed and helps the reader understand the justification of the cost.\n", "q2r": 4, "assessor": "z_assessor_2070", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"id": 1364, "q0": "Yes, this proposal effectively addresses the challenge by improving on existing token bridges through automation, which in turn will improve user experience and reduce duplication. \n\nBridges that link Cardano to other chains/platforms will be integral to realizing our multiblockchain future. Cardano has several of these bridges that are used at high frequency, however, there is currently many ways to improve the bridges that exist, which this proposal aims to do. As a user of these bridges it is true that they can be confusing and nerve racking, thereby deterring some from using them. \n\nI think the team has taken a good approach, rather than starting from scratch, let's take what is already working and optimize it. This will not only drive further impact of the bridges themselves but will also allow users to seamlessly manage their assets across different chains, which could also encourage individuals to purchase assets on Cardano through the bridge. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is very likely that this proposal will be implemented successfully. \n\nA major strong point of this proposal is that the team already has a working bridge (milkomeda) that will be used to automate the process. This means that the team already has a large portion of the work done and now will focus on optimization, rather than the initial build, thereby increasing the likelihood of successful implementation. \n\nAnother strong point included in the proposal is the weight of the team behind the project. In addition to those listed as leading the proposal, the iagon team is stacked with a variety of developers and engineers that hold the experience necessary to complete the development of the automation. \n\nWhy I am taking a mark off here is because of the lack of details in the actual plan. While I appreciate that developing the smart contract may be very clear to the team, the proposal should at least include some of the activities that need to be required in pursuit of development. As stated, the \"plan\" is more about the what and less about the how, which is what we look for in the \"plan\". \nBudget is reasonable and well explained for how the funds will be spent. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nTo measure their progress the team will adopt the agile methodology and conduct development sprints with reports provided after each sprint. To show the community the progress the team will provide the percentage completed during each sprint. \n\nThe other major auditing features are the smart contracts themselves. One thing I would have liked to see here is how they plan to test their bridge and code. Will there be opportunities for the community to participate? You list third party auditing as a risk under the impact section yet I don't see how you will mitigate it? Do you plan to use an external auditor, such as VacuumLabs? This could be better explained. \n\nThe success measure is fine (ability to transfer back and forth in one step) but I would have liked a way to gauge the level of use you are seeking to deem it successful. If the goal is to improve the user experience specifically, I'd suggest adding in a way to measure the user's experience to see if you are in fact achieving your objectives. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1519, "q0": "Automatic cross-chain bridge, effectively addresses the challenge of Cross-Chain Collaboration. Currently bridging Ethereum based tokens to Cardano involves multiple steps, which involve Metamask. This proposal reduces the steps and simplifies the process of migrating tokens/coins for the non-techy crowd. Thereby increasing the onboarding numbers for not only Cardano but the crypto world in general. Ease of use is and UX are the main drivers to adoption.", "q0r": 5, "q1": "Iagon was founded in 2017. Their decentralized cloud storage protocol has been in the beta stage since May 2022.  Initially starting on the Ethereum blockchain, Iagon's team decided to switch to Cardano because of it's ability to scale and fee structure. The four co-founders include Rohit Gupta, \"Technology leader with a proven track record for building and growing teams and championing simple designs for solving hard, complicated problems.\" LinkedIn                                       Iagon is also collaborating with NuFi another well-established and experienced Cardano blockchain protocal.", "q1r": 5, "q2": "Iagon maintains an up-to-date social media presence including a blog (and videos) that tracks their progress. Additionally, this team adopts Agile methodology and carries out sprint planning for project management based on the tools from Jira boards. In addition to progress reports, there will be QA sessions for bug exploring and beta tests before the final launch. Progress will be reported as a KPI metric that shows the progress in a percentage of each development sprint.", "q2r": 5, "assessor": "z_assessor_2256", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2798, "q0": "\"To solve the problem of the challenge that requires promoting the connection of transactions and cooperation of chains on different Blockchains, the main goal is the Ethereum and Cardano platforms, the proposal has come up with a solution to meet the requirements of the blockchain. that request by,\n   use an Ethereum smart contract as a transaction condition with the Milkomeda bridge then automatically the bridge will transact with Cardano's platform, this will help those who make the transaction without any steps Manually just make a smart contract of Solidity with Milkomeda, determine if the transaction condition is qualified by the asset you want to trade or not, then the Milkomeda bridge will serve as the basis for automatic transaction with Cardano, in addition, announced that it would cooperate with Milkomeda, for the purpose of integrating the wallets of the three platforms for a one-time payment from the first contract party, for example, the Plutus party made a transfer contract. From Cardano to Ethereum, you only need to pay once in smart contract in ADA, and vice versa Solidity too,\n  * however the proposal can further explain the implementation of smart contract transactions with the bridge and the condition only needs to pay a one-time fee from the smart contract maker, so the bridge side will be paid at step Can the proponent team be able to explain in more detail or in any other way, as there is no statement on the issue of payment of fees to the bridge party (third party).\nIn addition, the potential risks may occur, but the group has not yet taken measures to optimize or thoroughly those risks, such as: security audits, or compatibility features between two compatible languages. Solidity and Plutus copper. \"", "q0r": 3, "q1": "\"The published progress is estimated at 3 months, because the work is highly technical, so the time cannot accurately determine this issue can understand and sympathize with the proposal, and the work The group also stated will mainly focus on cooperation and compatibility testing of the two contract languages, and to find bugs and fix them.\n  The budget sheets of the proposal provide with pictures and they do not support the view loud and clear it is difficult to read the numbers and calculations listed there, so the proposal team needs to present more direct and specific to this budget sheet, it would be a pity for a good idea not to be able to access those images and analyze them.\n  I accessed the link to the website of the proposed group and there the information and position of each person is provided,\"", "q1r": 3, "q2": "\"lots of statements about the audit before putting it to the test, but there is not a single statement to serve the monitoring, or in other words the audit of the community, the team needs a specific statement. for where progress on this proposal will be made available to the community to verify that the team is working hard, if best possible is the team that organizes weekly online meetups, serving the community Q&A interaction will take place, if so, suggestions will be appreciated for the transparency of the project.\n   The success of the proposal will be that assets can be moved back and forth between the two Blockchain platforms, Ethereum and Cardano more conveniently. \"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 6208, "q0": "This proposal seeks funding or the further development of the existing two step process to bridge tokens between Ethereum and Cardano in order to make it one step automatic process. This will improve the user experience and open the bridge to more tokens.\nThe problem is clearly explained, at the moment the process of bridging is operational but could be improved for better UX.\nThe solution is for Iagon to develop these improvements.\nThe proposal is clearly in line with the challenge goals being a cross-chain bridge development specifically addressing the collaboration tools and platforms section of the campaign brief.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer clearly explains the idea and the implementation of the solution. Also the proposer has already developed the first iteration of that solution and there is no doubt about the technical capabilities of the team.\nThe proposer considers project specific risks and mentions the ways in which these risks could be mitigated, however these risks are for the project as a whole and this funding round does not consider the implementation of these mitigation strategies at the moment, but for a further proposal. This in particular is regarding to the need of third party auditing of the smart contracts that underline the solution.\nThe project timeline projection of three months is build on the research done by the proposer, Nomad and Milkomeda. The proposer outlines two milestones along the way, however does not present a detailed plan or road map of how they will get to these milestones. This however could be explained when we read the budget section of the project. The work will be contracted to external solidity developers, UI designer and Nomad and Milkomeda. This explains the lack of detailed plan, due to the outsoaring of the development of this solution.\nThe budget is presented and is divided between the different outside contractors that will be paid for the development of the solution.\nThe team of the proposal is presented by the iagon’s website where we could see the whole iagon team with linkedin and github profiles presented and by presenting the companies that are contracted.\nThe proposer will return to Catalyst for future financing for the audit and additions to the bridge.\nThe proposer has two proposals in fund 9 for a total ask of $618000 and does not have any proposals in the previous Catalyst funds.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer presents clear deliverables and clear auditable metrics. Also eesides progress reports, there will be a certain amount of QA sessions for bug exploring and beta tests before the final launch. Intermediate progress will be reported as a KPI metric that shows the progress in percentage of each development sprint.\n The only thing missing is where the proposer will be publishing this information and is this place easily accessible for the community.\nThe success metrics are clear, the release of iagon’s token bridge that provides the ERC-20 to tokens and from CNT in one step.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11353, "q0": "The problem with the proposal is that: for the IAGON token bridge, the current process has to be split into two manual steps (instead of automatic): Ethereum to Milkomeda and Milkomeda to Cardano, which is not an experience. ideal user.\n\nCurrently, the token migration between Ethereum and Cardano involves two steps. Further development leading to process automation will enhance the user journey and open the bridge to more tokens.\nProponent explain the problem they are solving, in a clear, specific way in simple language that can be understood by a non-expert.\nThe proposal identifies the problems in the challenge that need to be solved and shows how to do it: using smart contracts to automate the token transfer process on their Dapp bridge, this will allow them to cooperate with different blockchains and wallets.\nThe proposal clearly outlines how it will bring value to the Cardano ecosystem\nThe proponent also clearly explains the technical aspects to be handled in the implementation of the proposed works.\nThey also show what needs to be done and how what they create can benefit the community.\nThe proponent also points out the potential risks and proposes suitable solutions to address the risks.\n This proposal meets the requirements of the challenge.", "q0r": 5, "q1": "The proponent provides a detailed plan, including progress and milestones for the specific project implementation including things to do such as:\nPioneering automatic transfers from Ethereum → Cardano with Solidity smart contracts.\nPioneering automatic transfers from Cardano → Ethereum with Plutus smart contracts.\nThey determined to complete within 3 months.\nThe proponent has done the research and preparation for this project in advance with partners such as: Nomad and Milkomeda.\nThe budget is clearly outlined and broken down into identifiable items, which is absolutely necessary to achieve the stated goal, the proponent has also attached an image file of the very detailed budget allocation table. detail.\nThe project team is fully listed with their identities, images with reference links, experiences, and skills for each job.\nThis helps to increase the feasibility of the project.", "q1r": 5, "q2": "The metrics are specifically stated, the information provided by the proponent such as the progress of the project, the desired results are listed in detail such as:\nA Solidity smart contract will be deployed on the EVM chain to automate the transfer of Ethereum <-> (nomadic protocol) <-> Milkomeda <-> (C1) <-> Cardano.\n \nA Plutus smart contract will be deployed on the Cardano chain to automate the reverse transfer process.\n\nA solid smart contract will be deployed from the EVM chain to automate the move from\nEthereum <-> (nomadic protocol) <-> Milkomeda <-> (C1) <-> Cardano\n\nA Plutus smart contract will be deployed from the Cardano chain automating the reverse transfer from above.\nIn addition, many other features are also detailed by the proponent.\nWell-thought-out metrics and achievements determine the success of the proposal.\nProponents have listed what they hope to happen by the end of their project.\nClearly stated solutions are easy to understand and effective solve problems with measurable definitions of success.\nThey also cite the achievement that their project brings to the community and the Cardano ecosystem as a significant improvement in user experience. The transfer will be much easier to do and the total wait time will be much shorter than it is now.\nMake Cardano an open source project and attract more developers.\nThe proponent provides links and related documents that are accessible to provide regular updates to the community to check the progress of the project.\nThis proposal fully meets the criteria of the challenge.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14830, "q0": "Transacting between two distinct applications is often a hassle for consumers, especially when they don't have a \"non-stop flight\" but must travel through another app. This has happened to Cardano and Ethereum users, and as a result, the author has come up with a fascinating proposition. According to the proposer, a person wishing to move tokens from Ethereum to Cardano must use Milkomeda and pay fees for two transfers at the same time, and this project has chosen to waive one. The project comprises two types of smart contracts: Solidity, which is for Ethereum users who wish to deal with Cardano, and Plutus, which is for the reverse. This divide not only displays the project's many functionalities but also protects the interests of both Cardano and Ethereum users since they will only have to pay fees in their own virtual currencies. The collaboration with the NuFi wallet team, in particular, will be perfect for the project's future development trajectory, combining all three wallets into a single bridge, a feature that is entirely compatible with Challenge. However, I disagree with what is mentioned in the section on forecast risks. The author can only forecast future problems but cannot provide precise remedies. This will have a significant impact on the project's execution; it may lead the project to stall or even be abandoned since it has not been thoroughly prepared for a solution. So, please conduct further study to choose the best course of action!", "q0r": 4, "q1": "The author gives us an investment strategy with a graphic that has all of the relevant information. As we can see, the money will mostly be used to pay employees on a monthly basis, and I appreciate the author's additional clarification below regarding how many hours each individual worked in three months as well as the payment for their working hours. This makes the project's financial utilization more visible to investors. Furthermore, the project plan is separated into two major milestones that must be achieved within 90 days. While we know what would happen during that period, it would be wonderful if the author explained how it will be done. For example, which step will the Plutus smart contract be started, or what is the most important stage in its construction. Additionally, the author has yet to find a Solidity developer, which will have a significant impact on project development if the deadline for phase 2 approaches with no one in charge. Therefore, strive to identify the best individual for the job in a short period of time. Further, I notice two things in the expenditure list for UI designer and automation tester, but there is no name of the person in charge in the team members list. If the Iagon's internal team wants to take up this duty, the author should explain more explicitly the obligations of each member of that team so that both members and voters know whose job it is.", "q1r": 3, "q2": "The author makes no mention of the critical and vital feature of evaluating the project's development progress. Timelines are vital if you want to keep a close watch on the development of a project. In the previous part, we only know that the product will be ready in three months, but we don't know how long each component will take to finish, and this is the same here. Nonetheless, the author performs an excellent job in terms of project success. The data presented is entirely congruent with what the author intends to do in the future.", "q2r": 3, "assessor": "z_assessor_4104", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14855, "q0": "Bridge lagon is already into business and they come up with this solution when there are so many requests to migrate tokens to Cardano. This proves that this solution is practical and will help users a lot in terms of convenience and cost-effectiveness. A comprehensive introduction to their solution which is easy to understand and very well-presented in a logical way. I have nothing to require more.", "q0r": 5, "q1": "The budget details are clear. Iagon is a team full of competent people with the information available on their website. Looking at their co-founders, they are all doctors with relevant study majors related to the activities of Iagon and hold important positions in their previous jobs. Other members also have high educational backgrounds and many years of experience in their field. This project’s success depends a lot on the technical aspects, with this team full of talented people, I believe it will turn out successful.  \nConsidering the detailed plan section, I understand that this is a technical project so there are only a few milestones to notice. However, if the team could give more information on smaller sprints of each milestone, the clarity of this proposal will be improved.", "q1r": 4, "q2": "The team is serious about this project, we can see it from the clarity in the way they track its progress. They provide progress reports, QA sessions and beta test before the final launch, each development sprint has KPIs metric report. There is only one flaw in this part, they don’t mention the platform where thay post all their reports.", "q2r": 4, "assessor": "z_assessor_4106", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Currently, moving tokens between Ethereum and Cardano involves two steps. Further development leading to automation of the process would enhance the user journey and open the bridge to more tokens.", "experience": "We launched the Iagon token bridge beta (https://bridge.iagon.com) globally in May 2022. The team includes front-end, full-stack, and Haskell developers. We’ve been contacted by several projects interested in migrating their tokens to Cardano, which provided significant traction."}