{"id": 417123, "author": "keith", "title": "Job & Event Center (Woolly Map)", "url": "https://cardano.ideascale.com/a/dtd/417123-48088", "category": 26598, "amount": 32000, "description": "There is not a definitive spot to go in the Cardano ecosystem that enables people the ability to act instantly on events/jobs that are going on.", "f6_no_assessments": 7, "f6_rating": 3.619047619047619, "videos": [], "media": [], "f6_assessments": [{"id": 1365, "q0": "This proposal somewhat addresses the challenge by proposing a one stop shop for people interested in learning about events or jobs in real time. \n\nFirst off, the idea is good as the information overload when joining the blockchain space is very overwhelming and is often spread over a slew of different sites and platforms. The team offers a place for anyone, regardless of blockchain familiarity, to get information and make connections. One thing that I wonder though, what would make this webiste more appealing than any of the other Cardano information sites doing the same thing? For example, many groups have moved to using Dework to list their tasks and activities as bounties - wouldn't this achieve something similar? \n\nSecond, I see that the proposers have listed their suitability for the cross chain collaboration challenge as it serves for an entry point for newcomers, the assumption that they are already working on other chains or that through this site they will move to Cardano is not well justified. I am not saying it can't happen, but also saying it will won't necessarily make it so. To this end, I think the team could have made a better case for how their proposal fits into this challenge. \n\nLastly, the website will only be as good as the amount it is used by people, yet I think the proposers could do a better job at explaining how they will get the word out and what they foresee as enticing people to join. I see that they say it will be marketed but with all of the different places striving for clicks and impressions across the Cardano ecosystem, additional focus on how to  drive reach and impact could be more developed. Addressing these issues would increase the score here.  ", "q0r": 3, "q1": "Yes, given the experience and plan presented, it is likely that this project will be implemented successfully. \n\nThe proposers' plan is to create a website that acts as a gateway for those interested in Cardano to learn about events and jobs across the ecosystem. Overall, this is a good idea as it is very burdensome to enter Cardano and can be very disorienting. The team hopes to appeal to newcomers and veterans alike and will update their MVP to include new features. \n\nThe team's credentials are strong and indicate they are up to the task, which definitely gives confidence the product itself (the website) would be able to be completed in the timeframe and budget outlined. \n\nThe team's plan is also simple and straightforward with clear milestones and deliverables at the different stages as it relates to the site itself. What is not included in the plan is their marketing strategy and how they will engage/collaborate with different individuals, projects, or teams. Since the success of the website will be dependent on this, it should be reflected in the plan. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nGiven that the project is straightforward, the team provides good indicators for how they will measure the use/traction of the website overtime. This will help users know if the website is actually being used and by whom. I like how the team split the indicators between users and projects so they can \nprovide a holistic view of use. \n\nHowever, I think the proposers could have done a better job at aligning their KPIs and success measures. For example, if the goal is to have a \"steady increase month over month of users signing up\" there should be corresponding KPI for the community to know whether it is successful. In this sense, the KPI would be # of users per month. Then you could measure if it was increasing at a \"steady rate\". \n\nAt the same time, the team does outline their intent to seek user feedback to improve the system, and in so doing likely offers additional opportunities for community members to be involved. Overall good work, just a bit more clarification throughout would increase the ranking. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1671, "q0": "Unfortunately, this proposal is not well aligned with what we are looking for in the challenge. Here, our main objective is to promote a healthy exchange between Cardano and other blockchains, so that our ecosystem becomes increasingly known and respected, so that new people start to adopt the technologies offered on Cardano. However, this proposal is not focused on making this contact between different chains, different networks, but between the public and Cardano. Perhaps this idea would fit better with the Dapps challenge, as here it is suggested to create a product (an interface) in which “people act instantly based on the information they see. From a Twitter space to a job opening” and “by letting people find out exactly when an event is happening, they can position themselves to get the information they want.” Basically, it would be a site for people to increase their knowledge of the cryptographic world, focusing on Cardano, which is not a bad idea, however there are already other projects in this direction (an example is a site called Cardano Feed, which I I evaluated some proposals referring to the creator in the same fund). Therefore, I believe that it would be necessary for the proponent to invest more in explaining what the user experience would be like here, in what way an audience from other blockchains would be attracted - because the way it is described, the impression we have is that the site would be to the general public, it would be open to anyone interested in the subject of blockchain. The proponent claims that the project meets the objectives of the challenge by providing a “great entry point for those who are curious about Cardano or short on time. We want to remove friction as much as possible so that information seekers can get it right away.” However, in this challenge, our work is in another direction, needing to develop projects that contribute to, as proposed in the scope of the challenge, the “growth of activity in the chain due to new cross-chain implementations, number of proposals including participants from other blockchain communities , number of technical implementations connecting Cardano to other blockchains” and etc. For these reasons unfortunately the idea is not providing exact solutions for what is sought in the challenge, this situation could be better resolved if the proposer worked out a way in which the site would be especially attractive to members of other ecosystems, other blockchains, so that these people would gain a better understanding of Cardano and thus get involved with our community, our projects, initiating cross-chain collaborative projects, as is the objective here.", "q0r": 2, "q1": "This topic is ok, but also not so suitable, unfortunately. The roadmap is presented in a slightly confusing way, first we are presented with what would need to be done in 2 months, but then we go back in the timeline to 3 weeks and then we go forward again to 1 month… It would be easier to understand if the advances were organized chronologically, if we first knew the expected results for 1 month, then for 2 months, and so on. Another point that I would like to comment on is the way information is passed on here. In general, it is said which partial results should be ready according to temporality, for example, in 1 month of project the intention is “create a more robust profile page + add the ability to post vacancies + add the ability to search for candidates and resumes”; but what would need to be done for these things to be delivered? What are the tasks behind this, what would the work routine of the professionals involved here be like? Therefore, in addition to a more linear temporal organization, I would like the team's work routines to be more detailed, but explicit. Because the way the script is presented, unfortunately we can't get a good view of the process. Talking about the costs, a total of 32 thousand dollars is asked, and the amount is divided into some parts, but these are not very detailed either. Most of the money would go towards the developers' salary (27k), but how long would they dedicate themselves to this project, what would their working hours be worth? The same doubts are raised in relation to the marketing/design work and also the product management. How would the project publicity campaign be carried out, what strategies would be adopted? Speaking of the team, this is definitely the best part of the topic, as almost all the developers have some experience working at Cardano, some of them being the main developers of NFT projects (Keith and Erick). In this way, a lot of confidence is passed that they are indeed prepared to execute this project successfully. In general, we know all the necessary information about the team members: their names, a short summary of their resumes and the links to their linkedin profiles, through which we can verify all the information that is said. However, the other feasibility topics deserved a reformulation to make them more suitable: the roadmap needed to be more detailed - they provide a website where we could see better about the roadmap, but in fact no information is passed beyond what is in the scope of the proposal ; and the use of funding could also be better explained.\n", "q1r": 3, "q2": "Once again, the information provided is not that adequate, unfortunately. Regarding the auditability of progress, what is said is that progressive successes would be measured through tracking new users and project listings on the website. I think that this way we can perceive engagement, but we cannot understand how the process of building the platform itself would be taking place. There would need to be a work schedule to be respected, a kind of planning on what would be done, how and when so that such partial results would be possible. And so, it would be necessary for the project leader, the proponent, for example, to keep the Cardano community always updated on the advances, for example they say that they will audit weekly and monthly how popular the site is, but before that, it is also necessary for us to monitor how the site itself is being created (and this must be reported monthly as well). About success, this is defined as “a community center. A site where people go when they start their day to see what's happening around the ecosystem. It is important to give individuals who are not so in tune with what is happening in the Cardano ecosystem an outlet. Many start out as stalkers, and if we can get these people to be active participants, we've done a great job.” But in addition to the success of the site itself, we need to understand the impacts of this for Cardano and especially if, in some way, individuals from other blockchains would have associated with our ecosystem and from there an exchange would have been generated, a creation of projects. cross network. It would then be necessary for the proponent and his team to do some direct research with the users of the site to understand how they would have become active members of the community, if they come from other communities, what projects would have been generated from there, if that platform would have contributed to the greater popularization of Cardano within the cryptographic universe, etc. Therefore, I think that this topic would also need to be better formulated, both in terms of tracking progress (partial results and the passage of phases), and in terms of understanding whether the challenge's objectives would have been, even if indirectly, addressed. If such changes were made, the auditability would be more adequate, but unfortunately it is not the way it is currently presented.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 5, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "This is being filtered out because it is an objective statement to say that this proposal does not belong in this category. There is an emphasis to make this site a great entry point for people from other ecosytems to find out what is going on in Cardano. If we really believe in a cross-chain future sites like this are pivitol to allow people to see what is going on within Cardano (also no reason why this can't be filtered across multiple chains) and have the chance to see exactly what is going on."}, {"id": 2264, "q0": "Now this proposal intends to use its platform (https://beta.woollymap.com) \nas the go to place for Cardano events.\nSadly there is little breakdown about the benefits of this system (https://beta.woollymap.com) as against the existing systems(Catalyst available platforms) or details in general.\nNow most people use mobile phone for day to day interactions, has the proposer considered porting the system to smartphones.\nPlease the proposing team should kindly look at previously funded projects here(https://docs.google.com/spreadsheets/d/15ELXp81NfvXHgrerTbuIofZOXBsdjocN1YgBK0gPP3E/edit#gid=2111315347) \nas a reference guide to drafting their proposal\n as there seem to be lots missing in this proposal to justify the platform.\n The risk and challenges is a self-inflicted issue not an issue that is coming from any external forces.\n i will be giving 3 stars as i can neither agree nor disagree as regards the impact of this proposal to cross-chain collaboration.", "q0r": 3, "q1": "The proposal has a well written roadmap with milestones that are separated by 3 months intervals.\nA cost breakdown was provided but seem to lack enough details as iwould have loved to see (providing working hours of each developer).\nThough the proposal provided details of the team with verifiable links to their bio.\nConsidering all the information provided by this proposals feasibility, i can neither agree nor disagree that this team are capable of delivering this proposal to success.\nI will be giving 3 stars for feasibility.", "q1r": 3, "q2": "The auditability section of this proposal is well written and provided clear means to measure the progress of the project as below:\nUsers:\nSteady increase month over month of the amount users signing up to the site\nMeasure engagement through ability for users to provide feedback on the user experience\nconvert users -> job applicants -> projects\n\nProjects\nGoal - for every 5 users on the site one project joins\nOnce a project is onboarded on the site measure the trend of events posts a month\nOnce a project is onboarded on the site measure the trend of events posts a month\nGain insight on what type of events are the most popular \nI will encourage the team to provide a git link or trello for the community members to independently track the progress of the proposal.\nI will be giving 4 stars for auditability as i believe the provided metric are realistic and can be measured.", "q2r": 4, "assessor": "z_assessor_2301", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 6397, "q0": "I really wanted to like this proposal, but the more I read, the more leaks I found in every section. I don't doubt the intentions of the author are noble, but I fail to see how--yet another--event calendar would boost cross-chain collaborations for Cardano. Firstly, because this wouldn't be anything new (CoinMarketCal and BraveNewCoin are the first ones to come to mind). The same thing happens with job portals (CryptoJobsList, CryptocurrencyJobs, Crypto.Jobs, etc.).\nSecondly, because I don't believe event awareness is a defining factor in Cardano's cross-chain interactions.\nOn another note, I find the writing and structuring of this proposal a bit confusing and vague. It repeteadly mentions providing education and value to users, and being an entry points for newcomers. However, I don't see any concrete actions regarding that besides simply letting developers publish their events.\nOn the bright side, I believe there's a solid project somewhere beneath this proposal, but I do think it needs more work and refining. ", "q0r": 2, "q1": "The team looks capable and qualified to carry out this proposal with ease, and the budget stipulated makes sense, although I would like to see a further breakdown of the marketing budget (ads, social media, PPC campaign, etc).\nFurthermore, I'm still getting this feeling that the writing could be greatly improved for further clarity and specificity, which would do this proposal well. For example, I keep coming across the word \"many\" instead of the specific number of whatever metric is being described (years of experience, languages spoken, degrees). ", "q1r": 4, "q2": "Besides the already mentioned vagueness in the writing, here's my main concern with the goals and metrics provided by the proposal: not a single one of them addresses cross-chain collaboration. Most of them measure the use  of the platform, which is great and necessary for its success, but the challenge this project is supposed to address is to create connections between Cardano and other networks, and the metrics provided here aren't useful for measuring that. Additionally, gaining insight on popular events is not a KPI or measurable at all.\nThe same happens when the author is asked to describe what success looks like. \"A community hub\" or \"a site people go to to see what happens\" don't really tell me anything.\n\nHere's an example of what I think an appropriate metric for this proposal could be: \n1. Number of cross-chain projects registered on the platform (i.e. Iagon Bridge).\n2. Number of non-Cardano native developers attending Cardano events.\n3. Number of non-Cardano native projects signing up on this Cardano native platform.\n\n", "q2r": 2, "assessor": "z_assessor_2815", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The assesor seems to be caught up on the wrong things with this assesment. There is heavy emphasis on how the proposal was written yet there is no mention that there is already a working beta version of the site. This promotes the wrong message to people looking to make an impact on the Cardano ecosystem. Furthermore the coinmarketcal website gives me a \"web safety error\" and bravenewcoin is a data aggregation site so they are not reasonable to compare against this site."}, {"id": 6421, "q0": "Events are one of the best opportunities for members in the Cardano community to get to know each other. We have seen it at Consensus 2022 and will also see something similar during the Rare Bloom event later this year. These are some events that I noticed while looking into the Woolly Map Dapp. Their proposed challenge is that there is not a place on Cardano where a user can go to get access to event/job information. There are lots of opportunities in the job market and lots of events that will likely strengthen the community as well. The proposal suggests creating a dapp and implementing more features and including information for all community members. The vision is to create a dapp where all users will go when looking for jobs/events in the Cardano ecosystem. I find this to be extremely valuable. It is a place where people can describe their skills and potentially get a job doing what they love. I find that this proposal could have a huge positive impact on many users in the ecosystem. Especially for those that are looking for jobs or events that would allow them to network. I find this to be very intriguing and I would love to see this be successful bringing this utility to the ecosystem. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "I was very pleased to see that this proposal includes information on the team behind the proposal. LinkedIn profiles are included for each of the team members and there is also information describing each individual's experience and skills. One of the most important steps when looking into a proposal is the team behind the project. The team behind the Wooly Map suggests that they are willing to be held accountable to this proposal. They have included a specific roadmap that is split up into 4 different iterations within a timeframe of 3 months. These specific details are crucial to help determine the likelihood of success for this proposal. The given experience from the team and the specific details helps ensure that the principle of accountability can be implemented. The idea of creating a Job and Event center is really great and their roadmap explains exactly how they are going to create that dapp. The suggestions I would give this proposal is to include a section explaining how the team plans to market this dapp. There should be a form of community behind the project or in other words. A group that would love to see this job and event center that will likely hold the team accountable. For these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "There is a lot of information provided in this proposal. I should mention that the information is quite specific and allows the reader to understand around what time the proposal plans to be completed. When looking into the potential success of a proposal. There are some ideas that should be considered. The first question to ask is if the project has a community behind it. Without a community, it can be hard to determine how likely the project will be implemented. Who will the users be? The second concept that is important is accountability. The team should ensure that there is a following or a community behind the proposal that is looking forward to utilizing their job and event center. I would suggest including how this will be taken care of in the proposal. Ultimately, I feel that the proposal has great potential. It can bring a lot of utility to the Cardano ecosystem and will have more people participate in events and job searching. For these reasons, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8609, "q0": "The proposal has explained that the team's project is an event-based site. This site will inform people about when the event will take place and people can follow the information of event they have interest in. The promising result of the project is creating a network of people who want to know, want to share things in the community. The writer has also showed the reasons why this project addresses the challenge. The writer has mentioned the possible risks the team might encounter as well as the mitigation plan to deal with the risks.", "q0r": 5, "q1": "The proposal has displayed that the project has 4 iterations and maybe last for more than 6 months a little bit. There is no certain number of lasting time of this project. But they did tell us what they were going to do in each iteration. About the budget breakdown, it is okay when they showed the budget number for each small team. Only one small thing is that they didn't include the currency so it might cause confusion for somebody. The part of team members introduction is written pretty well. They showed the names of those who in charge of the plan, their brief information and LinkedIn link for people to check if they want. I still give them 5 for the feasibility.", "q1r": 5, "q2": "This part of auditability has showed how the team would measure the process both of users and projects. They have mentioned that they would keep track of the users increase month over month, would measure the trend of events posts once a month. What the success would look like was also mentioned in this part.", "q2r": 5, "assessor": "z_assessor_2993", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 14762, "q0": "According to the proposal, participants in the cryptocurrency ecosystem are having a hard time keeping up with the ecosystem. They have no firm direction for the work going on. The solution the team came up with to overcome this situation was to create events and navigation apps for these users that help people take immediate action based on the information they have. Personally, I appreciate this idea and believe that the project will be successful.\nFrom the problem posed, the team presented a specific direction to implement the project. In this section, the team clearly states each feature and function of the project as well as the main components and main activities of the project. The solution is presented in great detail and has an in-depth technical explanation. The project also identified potential audiences as newbies, veterans, and any members of the community. The proposal also showed the impact of the project on these objects and the positive influence on the entire Cardano ecosystem community.\nThe results that the project is aiming for are guaranteed to meet the key metrics set by the Challenge. The results are stated very clearly in each part, each stage. This project helps the community to attract cross-chain members. Once completed, the project promises to expand Cardano-based projects into other chains. All of these goals support the Challenge's KPIs.\nThe team identified the difficulty that will be encountered when implementing the project as an obstacle when putting the project on the website. However, the team has foreseen this situation and provided specific solutions to minimize the risk for the project.", "q0r": 5, "q1": "The team gives a very specific project implementation plan. The roadmap for project implementation is divided into 4 phases. Each phase has specific timelines. The work items to be done are also specified in the proposal. The team provided a realistic timeline to complete the given tasks in a logical manner. The criteria for evaluating the performance of the tasks are also mentioned in the proposal. The proposal has shown a reasonable plan not only in terms of what they will complete but also how it needs to be. The proposers provided details on technical aspects such as architecture, language, and technology required to implement the plan. In addition, the project also clearly defines the positions and the number of people needed to implement the proposed project. Based on the plan the team provides, the community can see the project's potential for success and its ability to achieve the expected results. Because the team has carefully prepared every step, the project will be carried out smoothly.\nFor the budget plan, the cost that they will use the budget to spend on the project has been disclosed by the team in the proposal. It is the employee's salary per job. However, other investment items including activities and assets to pay for the project have not been mentioned by the team. The proposal should detail all the fees required by the project. Budgets should be broken down and clearly bulleted for what activities are being used. This clarity helps the community to assess whether the project's spending plan is reasonable or not.\nThe project is carried out by talented and experienced people in the field. With a specific plan plus the knowledge and skills of the project team, the project promises to be a great success and bring benefits to the community.", "q1r": 4, "q2": "The specific details of what the project will achieve are based on the project implementation plan provided in the proposal. The viewers had an overview of the project when it was successfully implemented. However, the team should visualize specific numbers to measure the success of the project. For example, the number of users, the time to complete which part - what activities, the number of traffic ... The team should give quantitative indicators for these goals. The community will track the progress of the project and rely on the numbers provided by the team to evaluate the success of the project after it is completed.\nThe team has shown the community the products that the project will release after successful implementation. We can see that the team took the project seriously and pursued the goal to bring the best results.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Our solution is to create an event and job app for people to instantly act on the information they see. From a Twitter Space to a job opening.", "experience": "We have a full agile team onboard. 3 developers and a product manager."}