{"id": 417329, "author": "raz", "title": "The ArtSuite Multi-Chain NFT Events", "url": "https://cardano.ideascale.com/a/dtd/417329-48088", "category": 26598, "amount": 90000, "description": "Lack of a Cardano focused, hosted and structured events programme introducing artists, and catalysing multi chain and interoperable collaboration among NFT artists of all chains.", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 3274, "q0": "This proposal from Cardano Community OGs looks to build off of a prototype event structure that the team self-financed in order to create a series of events across Europe to promote, educate and onboard traditional artists, especially artists who are already minting NFTs on other chains.  What the team had to say about this latter point was particularly interesting, in that they found zero resistance from these traditional artists towards migrating work to Cardano, they simply didn't know that it was an option.  This critical issue, that artists eager to approach the space lack education on their options, and how the options they do have interrelate, is the problem this proposal seeks to address.\n\nThe events are currently targeted as one day events at 14 total venues in Europe over the course of 12 months, with some of those presumably taking place at their \"home base\" in Barcelona.  They also suggest that due to the learning experience from the prototype that they envision some of these events (again, I am going to assume this iteration takes place at their own venue) will actually be developed into events that take place over more than a day, and could stretch over a week or so to allow space for what I feel are the critical components of the proposal, which is the hands on and 1-to-1 exposure to the educational resources they will create.  Further, they envision the creation of a \"playbook\" which is at the root of the scalability of this project:  documentation, which includes how-tos, tutorials and reference will be the key to adoption of this methodology (and I would personally like to see them explicitly opensource this playbook.  This isn't something I would mark the proposal down for, but I think it would improve it even more.)\n\nAlignment with the challenge setting, through their approach of blockchain generally, Cardano specifically threads the needle between supporting other chains and experiences while presenting the best of Cardano.  The most relevant statement I saw to the issue of cross-chain interoperability, was a principle they formulated as the artists and builders facing the same fundamental problems, and the pursuit of collaboration across all ecosystems being a way to find key answers that help everyone.  This kind of multi-chain thinking is the underpinning of the challenge setting.\n\nBecause of this multi-chain alignment, as well as the ability to scale it to wider and wider application, I believe that this project can deliver real-world impact to users of Cardano, and I give it a full 5 stars.", "q0r": 5, "q1": "The team is well known via hosted podcasts and community involvement from the earliest days of Cardano.  They helpfully also included plenty of contact information and professional details, and the website was also a trove of information to follow up on the general ArtSuite philosophy and methodology.\n\nBut where the team's work really shines is that they tested this concept before presenting it to Catalyst.  While there wasn't a detailed deep dive on the KPIs of the prototype (such as number of participants, number of attendees, etc.) there was plenty of details for how they believe the data they collected will inform the iteration and development of the events as they move forward.  In particular, it seems like they are zeroed in on the cost of the events themselves, which is 80% of the funding request, which is a huge vote of confidence for their budget numbers.  In addition, it is clear that they developed the general KPIs based on this prototype, and the Risk Mitigation section actually has a pretty good description of their process and helped me appreciate how they are approaching this as an iterative endeavor.\n\nThere was a slight lack of clarity regarding the issue of sustainability, in the form of the events being able to become self-financing, but I don't believe it warrants being marked down, as it isn't critical to the delivery of this proposal, more the long term impact.  I would have liked to have seen a more specific vision of how these events reach that stage, and a clarification of when they envision that happening (by the end of the 12 mos or after the first 4 events?)\n\nBecause the team has demonstrated work done and a solid approach to an emergent process, and because they have included excellent details on their roadmap and budget, I believe that a full 5 stars are warranted.", "q1r": 5, "q2": "The plans to lean into their existing social media and web presence for transparency and availability, which should work well based on the amount of exposure they appear to have in those areas.  The KPIs they have listed are vetted from their prototype event, and while I would have liked to see a comparison of the prototype to the expected metrics to be obtained (in order to get a sense of what kind of growth rates and long term impact was possible here) for the delivery of this proposal, the included KPIs should be adequate to measure progress.\n\nWhile the majority of their success criteria are kind of abstract (opening up a world of opportunity, facilitating a digital art revolution) and hard to pin down, their first criteria is also the best for thinking about the deliverables here: \"create a structure for a self sustaining model of cross chain event that can be replicated and adapted all around the world\".  As the 12 months of this timeline pass, the events act as learning opportunities to continue to dial in the playbook.  It is worth noting, then, that they neglected to include the delivery of the playbook (and perhaps more importantly the iterated development of the playbook) as a critical KPI in the auditing section.  Because this info is presented elsewhere I don't believe this deserves a markdown, but as advice going forward, this playbook will be a key part of the accountability and auditability of this project, as it captures the real time learning from holding the events.  The proposers are encouraged to avoid considering it \"done\" and to lean into it as the basis of the auditing protocol, with their identified metrics being the \"validation\" of the quality of the deliverable, rather than the deliverable themselves.\n\nDespite the need to reorganize some pieces of information in the proposal itself, I do believe that the combination of live events, documentation of those events, and the retrospective in the form of the playbook, along with the general availability and transparency of the team merit full marks for auditability:  5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3462, "q0": "the idea of briging together art in real life (in a gallery format) and Cardano seems great and impactful in a sense to drive Cardano adoption. Proposers is suggesting to do so in partnerships with NFT artists that operate in other blockchain in order leverage from a two-way perspective both Cardano and these other blockchains, each one contributing to another. At the same time, these NFT artists can potentially migrate to Cardano as they see its benefit. In this way, proposal addresses the challenge very well (one example provided in the challenge is \"Common research, education, outreach and innovation projects with other chains and communities\" which clearly fits this one). Proposal also is well articulated and show its value proposition in a clear way and solution will be delivered in several languagues (maybe it could be mentioned which ones). A prototype event was already held (video is provided) and seemed to have been a success. With this project, tools to replicate it in all over the world will be ellaborated and shared in the community and other events will be made. The only thing that could be added to make proposal richer is an advertsing strategy to share the playbook. A communication well made among Cardano community and artists on what will be developed here would help to accelrate the process.\nTaking it all into account, I totally agree that this proposal addresses the challenges and has a high impact potential. ", "q0r": 5, "q1": "There's a sensible roadmap in place with general activities and a long term vision in its end. A step-by-step on how to organize these events is also provided. What could be added here as activties is the marketing part, when the people to attend would be reached and engaged. Budget breakdown is well done, considers 14 events in one year,which is a reasonable number, and matches project scope and roadmap. Here the advertsement budget is considered.\nRegarding the team, there are 6 people already committed with diverse experiences in Art curation, social events, management, communication, innovation and technology. Most of them seems also to have had good contacts with Cardano so far, even though it seems not to had been part of their \" core regular educational background\". Moreover, they already executed a prototype so I guess they wont have a hard time to put this project into action.\n", "q1r": 5, "q2": "There are 5 good metrics provided to track project success. However, some of them could have targets, as the number of attendes and artists on the platform(only the number of events seems to have it, by the fesibility section (14)). These targets could be set in a % increase manner as more events are being held, for example. It is understable that it is hard to set them at first but as there was a prototype already, maybe some guesses could be made. I liked though that proposer already exposed the way they where provide these infomation to the community, this is key for transparency. An extra metric that could be added is the feedback from  attendees, artits and even those who used the playbook to organize the events on ther own. This could be measued by surveys, for instance, and would help to evaluate success. \n Definition of succes is fair but seems a bit subjective, hard to assess later if those points were reached. Maybe they could be translated into something more measurable.\nAll in all, proposal seems generally auditability, just some minor details could be enhanced to make it more robust.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 7295, "q0": "The proposal aims to organize ArtSuite multi-chain NFT events, which are held globally, introducing Cardano NFT to all artists, both from other Blockchain platforms as well as new users NFT. Through these events the proponent wants to introduce and guide all about the Cardano ecosystem, how it works, what Catalyst is and what are the advantages of creating NFTs on the Cardano blockchain compared to competitor blockchains. From there, I think they understand better and have a more objective and positive view of the Cardano ecosystem, and they may consider participating in the Cardano ecosystem. What's special about the ArtSuite platform is an artist launch platform with a social mission. They support projects around the world in the spirit of Cardano and all artists from other chains are welcome to create a global family of artists with a Big Heart. These events will be held around the world. These events will be held globally, so I think its pervasiveness is huge, because artists usually have\n a large fan base, so it could be a bridge for the spread to other audiences who know more about Cardano in the future. Advice because the internet is growing, online marketing has become easier and more popular, so after events like this, the group can record videos to show online on social networking channels. , like facebook, twitter to make it easier to market and promote more aggressively to people globally about the Cardano project and ecosystem.", "q0r": 4, "q1": "The project plan describes detailed work content with clear timelines, the project has a long-term vision, after only 1 year to August 2023, events may expand to other areas. other continents such as Africa, North and South America, Asia. The project has implemented the prototype event and has been quite successful, through this event the platform has also attracted many artists to participate, and learned many lessons for the implementation of the main events. more successful later. Team members with the right experience, as well as skills to implement this proposal, can easily view the information through Linkedin, twitter and the Web. The budget is clearly and easily itemized, the budget is calculated for 14 events held in the capitals of different countries in Europe, including salary for a full-time event organizer. to sue. Total budget is 90000 USD, in my opinion that is reasonable. A positive thing is that the proposed team also spent their own money to carry out the prototype event, showing that the team has also tried and been active in building and developing the ArtSuite platform in particular and the ecosystem. Cardano in general. The proposed team also considered the risks and challenges and put in place measures to reduce the risks in order to successfully implement the proposal. Given the above, I think it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The schedule is provided with clear and understandable implementation timelines, making it easy for the evaluation community to follow the assessment. The solution is clearly described to solve the problem. The project provides a number of commitments for each criterion to be completed in each phase. The project offers a long-term vision with events gradually becoming sustainable, without funding from Cartalyst, but can operate on its own with business and other funding. The KPIs given are clear and complete, easy to measure, track and evaluate through the website and youtube channel provided by the project. From the above analysis, I think it is enough to evaluate the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10139, "q0": "What I'm excited about is the idea of ​​NFT Cardano events. This is very exciting. As the CNFT market is growing, it will be a great opportunity for such NFT projects and artists to build+ Cardano creators to meet and connect. It helps to expand the competitive edge of the NFT Cardano market, to a higher level. You have presented a proposal that is well suited to the challenge. this is commendable.\n\n  Above all, it is a team with experience in the field of hospitality and event education. It is suitable to operate this idea, so it will make full use of your strengths in the proposal to achieve success. Regarding the solutions and risks, you guys did a great job. A successful project helps to open up Cardano's NFT path, expand the market share, and leverage our strengths over the competition. This is good for the Cardano ecosystem, as having the.", "q0r": 5, "q1": "You also have a clear and coherent presentation. You are announcing a team of 6 key operators of the proposal. Comes with clear members' communication and social networks. With your experience, help me identify the problem-solving ability of the team capable of running the idea.\n\nThe proposal was full of information, like a clear roadmap section. Divided into 4 milestones to complete the workload, 1 in detail. Accompanied by the ability to manage the workload clearly and suitable to each person's ability. There is a small point of note about the project that is: Careful consideration should be given to the budget allocation table as to whether additional contingencies are needed. In order to avoid problems arising in the context of high inflation in the global economy. And whether the proposal to ask for 90000 USD is really a bit much, the team needs to explain whether there is a balance to divide the budget by stages. Hope the author considers this more. And wish you success.", "q1r": 4, "q2": "During the operation of the idea. The proposal team provides measures of event attendance, and other reliable metrics for regular updates on the regular ideas home page. Aim to help the community monitor the effectiveness of each event of the project fully. However, if you can also publish these indicators regularly on social networks, as well as publish on popular media channels regularly, that would be great. The idea clearly describes the success of the project, to the good social environment. Proposing goodwill to the world in the near future, art is everywhere. Art lives all around us, and creates beauty in our lives at almost every moment of our existence, without us often being aware of it. . This is worth looking forward to.", "q2r": 4, "assessor": "z_assessor_3160", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14706, "q0": "\"The proposal gave a solution that entirely aligns with the challenge’s objective: hosting the Art Suite events globally to introduce Cardano NFTs to all artists, both from other blockchain platforms as well as those new to NFTs, for catalysing multi chain and interoperable collaboration among NFT artists of all chains, and sustainable impact. Through the recent prototype event, they conceptualise artist events and create standardised educational material in the most spoken languages in the world, that can be used in any future event under the guarantee of The Art Suite. At once, there is a huge potential of future Cardano users and NFT creators that are just waiting to be explained the concept of blockchain in general and the superior technology of Cardano in particular, and with proper guidance, most artists with a following are very open to being taught and guided into the Cardano ecosystem, and will then exponentially spread the word about Cardano, about what Cardano stands for and especially about Cardano NFTs.\nBlockchain technology in general is a tool to make a better world and that everybody is welcome to try their luck on other blockchains as well, and that integration and interoperability are essential into making a lasting difference in the artist’s world; and the Art Suite is an artist launch platform with a social mission, supporting a range of projects around the world in the spirit of Cardano and all artists from other chains are welcome and needed to create a global family of artists with a Big Heart. The team have all the necessary components to solve the challenge, including: connection very well in the Cardano community all over the world, connections to art galleries and artist collectives all over Europe where doing future events, and creating standardised education material that can be used at every event with the widely available information about the Cardano ecosystem in general and Cardano NFTs in particular. The potiental of the project is unlimited, because there are artists in every village or city in the world, and by conceptualising this type of event, there is literally no limit to the amount of people they can reach and impact positively. After completing, the proposal will bring about a digital art revolution on Cardano which positively impact countless lives of people all over the world.\nThe proposer showed the main risk they will meet in delivering this project is not doing things in the right order. In my opinion, the author should bring out more meanings of this risk, such as information of organizing placement, of documents for event, or of communication,….However, the proposal gave how to mitigate the risk: they have our educational material ready and easily accessible for all guests; and there is a separate space and time for the artists to be able to sit down with the team that organises the event, to be able to absorb the information they provide about blockchain technology as a whole and the Cardano blockchain, and its philosophy of interoperability in particular; and at each event, the organising partners are selected carefully and with certain criteria to determine their capacity to deliver, for example in the quality of their communication with their artist communities.\n\"", "q0r": 4, "q1": "\"The team members will organise successful educational cross chain events by a detailed plan by the necessary steps: ceating a team with essential skills and experience; creating standard educational material in several languages; finding a suitable venue, and suitable, skilled and reliable partners in the city the event will take place; and the next event would take place in a much larger venue for several weeks and will have a much larger outreach,….With a clear Roadmap, specific milestones, long term visions, and how the team manage workload are enough for the proposal to achieve the goals that they desired. Events become more and more gradually self-sustainable, and contribute to collaboration, coordination and communication between various blockchain ecosystems, however “there is simply no replacement for bringing people together under one roof and provoking direct communication in a relaxed, fun and informative environment”, this is another lesson from the prototype event. In the section, there is a small shortcoming of technical aspects, as languages, technologies necessary to implement the plan, but maybe it doesn’t affect too much.\nA detailed budget breakdown aligning with the above plan is also proposed, including: one time expense for creation of standard educational material; payment for team salary, payment for 1 actual physical event (advertising, event staff, travel expenses, catering, technical equipment,….). The budget for the events is adjustable according to the size and scope of the event and will be optimised as more experience is gathered. Besides, there are the other budgets external the project, such as costs incurred out of pocket for the first prototype event; and other sources of finance secured the team are in talks with other projects who are targeting big brands in a B2B formula.\nFor the team members, the proposal gives quite sufficient information of people who will work on the project, from educational background, skills, experiences they have from previous project, to the information links, their positions in the project, and some of them can be working on any other proposals in this Fund and the previous Funds. With a globally decentralised, experienced, multiskilled and diverse team, if received funding from Catalyst, they can tap into their multiple connections and resources, to ensure their sustainable approach to managing their workload, and completing the project.\n\"", "q1r": 4, "q2": "\"The auditability of the project will be provided by Website published updates and Youtube Channel – videos, whereby they can measure the project’s progress with sufficient quantitatives indicators: number of events, number of attendees, number of new artists of other blockchain ecosystems on the platform as a direct result of events, number of new parties interested in purchasing, and new Partnerships.\nThe success of the project is shown by the results: having a team creating a structure for a self sustaining model of cross chain event that can be replicated and adapted all around the world; keeping the first such event in Barcelona as an ongoing event, and making it generate enough income to enable organising future events; bringing about a digital art revolution on Cardano which will positively impact countless lives of people all over the world; opening up a world of opportunities in the digital economy and new livelihoods that enable people to do what they love and love what they do; bringing together artists and communities (already belonging to other blockchain ecosystems or not belonging to any such ecosystem yet) in numerous locations all over the world, which will in turn equip, enable and empower ambassadors of a message of unity and togetherness, the pillars that Cardano founded on; and making the world a better place because art is everywhere, art lives all around us, and creates beauty in our lives at almost every moment of our existence, often without us being aware of it. These information define the team are entirely serious in their work and clear about their goals, and they can successfully complete their plan.\nThis is the first time for the Hotel Ginebra and The Art Suite team proposing in Catalyst, and they also submit five other proposals this Fund 9. These five proposals are independent proposals in different categories, and each individual proposal is aimed to fix and extend the existing separate initiatives and activities employed by the platform.\n\"", "q2r": 5, "assessor": "z_assessor_4097", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "The Art Suite events hosted globally, presenting Cardano NFTs to all artists, both from other blockchain platforms as well as those new to NFTs, for multi chain empowerment + sustainable impact.", "experience": "Hotel Ginebra Barcelona - international team experienced in hospitality, events, education, tourism. The first business in the world to accept ADA as a means of payment, back in 2017.\n05/14/2022 we organised https://theartsuite.io/pages/events, prototype cross-chain NFT event."}