{"id": 417395, "author": "wolfram.blockchain.labs", "title": "Wolfram UTxO History&Collaboration", "url": "https://cardano.ideascale.com/a/dtd/417395-48088", "category": 26598, "amount": 67000, "description": "UTXO chains need to accelerate their collaborative efforts and remember their common origins", "f6_no_assessments": 7, "f6_rating": 4.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 1740, "q0": "The problem statement seems to be missing a conclusion that might read something like: \"...because if they don't, we lose out on the possibilities.\" or something to that effect. The solution is in great alignment with the challenge that seeks cross-chain collaborations for the advancement of all. \n\nOf course, there is a positive impact on the Cardano ecosystem as our eUTXO model benefits from this knowledge gathering, whether it solidifies the previous assumptions on Cardano or helps us find new pathways for the future. It also helps support our like-minded blockchains that run on the same or similar methods for their ledgers. This great added value will keep Cardano on a sure footing.\n\nThe KPIs match the spirit of the problem from a future interoperability standpoint and the more short-term outcome of bringing the knowledge of so many from different UTXO blockchains.\n\nThe risks offered are extensive. It will be apparent to voters that the proposer has given the potential issues much thought and come up with a list of mitigations that should take the team to the project's success.", "q0r": 5, "q1": "The timeline is comprehensive, and milestones are added to each timed phase. The explainer, in the beginning, two paragraphs help the voter understand where they are at and what will occur if the team is not funded. If they are, the work will continue in September with phase 2. Brilliant. Thank you for the thoughtful architecture of such a plan. Votes will benefit from the clarity offered in your brief but meaningful milestones. It seems for the work at hand, 6 months should provide the team with enough time to get most or all the way completed.\n\nThe budget is clear and reasonable. However, it could benefit from breaking elements down further into per hour/per day/project costs and helping voters understand the details of the dollars. Brevity in a budget is never good when we ask for such funding. The voting public prefers details, transparency, and a forthcoming list. For those that won't look through the details, that is what the \"total budget\" area is for. For the rest of us, we'd like to understand how the funds are divided up completely.\n\nThe team is explained in brief, and a link to the rest of the group is included. Though a breakdown of what each plans to accomplish is typically helpful for voters to see, it does make sense that the team will need to be nimble and have far more than enough human resources on the core team, as well as help from Wolfram Blockchain Labs and others. Skill sets necessary is implied in work, and it would appear that those named in the personnel are sufficient to complete the work by Spring of 2023\n\nThe resources necessary beyond budget and human resources on the team are Cardano community members that will be called on to claim bounties in return for creating glossary terms for UTXO blockchains. Beyond this, there seem to be no other technical aspects necessary.", "q1r": 5, "q2": "The roadmap and milestones are covered in Feasibility.\n\nThe key metrics both quantify and define success. This assessor can think of no other metric that could be tracked to enhance the list already present. Between interviews, video viewers, glossary contributions, and suggestions, it looks like the team has all the right questions to finish with an accurate summary of their findings to share.\n\nThere is no specific Gitbook to share the process and findings along the way. If rewriting, this would be a great area to place some attention and add transparency.", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1136, "q0": "This proposal, if implemented, would satisfy the challenge goals extremely well by establishing cross-blockchain collaboration among the UTxO-powered blockchains. Some of these funds will be set up as bountiest for R&D for this proposal. It is not unlikely that members from different UTxO chains would work on the same task together, thus increasing the collaboration between actual humans - something that Catalyst has written on its banner (“the highest potential for human collaboration”) but alto often is missed to greed and other destructive emotions that have no place when creating a sustainable, inclusive environment. It is easy to overlook this nuance in implementing the proposal, but this is the main differentiator between a 4 and a 5-star rating in this case for me from the perspective as a bridge-builder of and within communities.\nI see this proposal strengthening first and foremost the UTxO alliance, which WBL joined a few months ago. Besides IO and the proposer, the UTxO alliance also includes Cardano community friends like Ergo. Any increased cooperation between the partners is a win for the Cardano ecosystem and the blockchain space overall.\n", "q0r": 5, "q1": "Wolfram Blockchain Labs is well resourced and capable of implementing this proposal. The team has begun the implementation of this proposal with their research and discovery phase. The months post initial funding will be spent to work on the collected data and its presentation. The timeline is appropriately scoped.\n\nHowever, I have a suggestion regarding the budget breakdown to really go into greater detail how the funds are allocated.\nThe team costs could be broken down further. It is also unclear what “teaching costs” are. Is it the presentation at the virtual seminar? Is there also internal teaching planned?\nThe $5k for supplies would benefit from some explanation as well. What kind of hardware costs are associated with this proposal? What books will have to be purchased/rented? What are “other associated costs”? These are $5k that the voter has no sufficient explanation for.\nWhat does marketing look like? Why $5k? What events are going to be promoted? The impact section only talks about a single event. What is the purpose of promoting the event?\n\nEven without the missing information regarding team costs, the voter has little choice but to view the $10k from unexplained costs in supplies and marketing as padding.\n\nBecause some important detail is missing for the budget, I will deduct a point here, but still think that it is likely that the proposal will be implemented successfully: 4/5.\n", "q1r": 4, "q2": "Vanity metrics like views of videos are easy to measure but not enough to really measure if the proposal was successful in terms of impact. The proposer acknowledges this by adding the number of community contributions for the glossary and UTxO blockchain suggestions as a KPI. The community will be able to audit progress and success quite easily with the proposed information on auditability.", "q2r": 5, "assessor": "z_assessor_2209", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1366, "q0": "Yes, this proposal effectively addresses the challenge by bolstering the connections (or in some cases building them) between chains. Given that the UTXO model is not specific to Cardano, but rather is the basis on which many chains are founded, there is a significant benefit to identifying what these chains have in common and lessons learnt. By taking this broad approach, the team focuses on breaking down silos between chains and focusing on the underlying technology. By doing so, there are potential benefits that will flow from, but also into, Cardano. Challenges that have been overcome elsewhere can easily be integrated or adapted to the Cardano context. \n\nAnother reason why this project is likely to have a big impact is that it is solving a problem that it discovered through their already ongoing activities. The identification of the gap (lack of coherent/robust repository of UTXO chains past and present) highlights a big opportunity for Cardano to again be a leader in supporting the entire blockchain space. \n\nLastly, an additional feature of this proposal is that is is making a research repository that will continue to be added to and expanded. This will deliver an impact not just upon completing the project but on an ongoing basis as more information becomes available. Such an approach could lead to a form of standards that could be integrated into the UTXO Alliance as best practices, bringing further cohesion and clarity to all UTXO-based blockchains. \n\n", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. \n\nWolfram Blockchain Labs (an affiliate of Wolfram U) is already a member of the UTXO alliance and has been a valuable player in the Cardano ecosystem (and beyond) for a long time. Wolfram is often highlighted as a leader in data analytics and imaging. Their track record of delivering speaks for itself, and their Blockchain Labs are sure to live up to this reputation. \n\nAnother very strong component of this proposal is that they have begun the initial stages through preliminary research. Their commitment to already working on the proposal as an extension of their ongoing work gives the impression that the team is committed to seeing this project succeed, and that they are equipped to deliver. \n\nI also like that the team doesn't imply that they will do everything without help but have added in a community participation option through the community-oriented glossary term writing via bounties. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. \n\nThe Wolfram teams are no strangers to Cardano and Catalyst and do an excellent job of hitting the necessary components of the guiding questions, specifically the KPIs and Success Measures. However, I think that the team could have articulated better thresholds to reach in their success measures. For example, \"Community participation with chain suggestions and glossary term writing\" is a good success measure to have but what constitutes community participation? How many members? One? Two? How many are expected to participate through the Bounties? \n\nWith that said, the use of bounties to help formulate the glossary of terms that will be used for the research is a great way to increase auditability. What is nice and true to this challenge is that the participants won't necessarily need to be Cardano-specific but instead could come from any UTXO chain. This approach will allow a form of community auditing to help align all UTXO efforts for the benefit of all. \n\nOverall a very exciting project and one that could provide benefit for the blockchain space for years to come. \n\n", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4368, "q0": "I affirm that the proposal solves the goal posed in Challenge: \"Cross-chain Collaboration\", and identifies the problem that needs to be solved that UTXO chains need to accelerate their collaborative efforts and remember their common origin. . Surely the author realizes that the problem that still exists in UTXO is that it does not meet all the requirements that the current blockchain requires. So the team wanted to develop UTXO, more advanced based on blockchain research and documentation. I consider these to be important studies and suggestions because they can contribute to a direct impact on the ledger (one of the foundations that make up the blockchain). Implemented on the Cardano blockchain platform, it adds value to the Cardano ecosystem and can scale and solve challenges in the future. Through information education, building and strengthening connections with the UTXO chain, etc... If successfully implemented and applied in real life, in-depth studies, computational data, and interview, collect data...it will contribute to the impact on blockchain and related factors (Dapps, and other platforms). Once again we see that the element of information and propaganda is very important.\nI strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "I noticed that the author and team have experience in building research papers and the team also researches blockchain, some of the members are researchers and outreach, programmers, economists, etc… The team has also provided sufficient reasoning to explain the problem, and documents related to the proposal (Wolfram websites,...). However, I do not see the disclosure of all team members' identities via social networking links (Linkedin, Facebook...), it is a hindrance to the community that will not be convenient to look up the name. count the members and verify the feasibility of the proposal and further affirm the credibility of the team (who already have prestige and experience in Wolfram ). The community will have to spend a little more effort and time visiting Wolfram's website and learning about the members of the team. I've come across several other proposals that do the same. Core team members as I understand them to be 4 (listed names and areas of expertise in the proposal) are key members, the team may have others not yet mentioned identified in the proposal. My advice to the team is to try to add a social media link (Linked, Facebook, etc...) directly to the proposal to reveal the identity of all team members. Because thanks to the full complement, the community has a lot of advantages in looking up the members' identities and verifying the feasibility of the proposal.\nThe budget is presented briefly, somewhat sketchy. Still, it's fit for purpose. I think the community needs to detail the important work that needs to be done rather than such a sketchy presentation. Because when listing the details of the work related to the budget, it will clearly show the professionalism and meticulous attention to the team's budget balance sheet, through which the community can strengthen more confidence in the ability of the team. examination of the proposal. It's completely understandable for the team to present the budget as it is - professionals and people who already know the team well (know what the team needs to do) are completely understandable, but I think letting everyone people from the community (some people are very new - they don't know anything about the team and this proposal) can understand it easily then we need to have a more detailed, more understandable presentation. That's my advice on budget.\nThe plan and implementation method have been fully stated by the team in a very logical step-by-step. It is divided into 3 phases (research and explore - work - develop a presentation), each of which consists of smaller work implementation steps. This is one of the important factors in clearly defining the feasibility of the proposal. I am very impressed with the team that started this project before the funding was available. This speaks to the team's enthusiasm for the project. I hope this proposal of the team will be approved for funding to implement.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, with the key members having professionalism and experience, I believe the proposal will be successfully implemented. However, as the team shared, some members are also working on another proposal in parallel with this one at Fund 9. Maybe this causes a few human resources to be scattered but I believe it Does this make the quality of work at this proposal degraded? Because the team has many other members at Wolfram as mentioned (abundant human force). In my opinion, the team should continue to demonstrate to the community that even though there are currently members implementing another proposal, human resources are still sufficient to ensure the successful implementation of this proposal. It is the best way to create more trust in the community (especially for newcomers in the community to understand), thereby increasing the feasibility of the proposal. For this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or other Wolfram employees) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, Wolfram cloud, programming languages ​​combined with administrative engineering, information dissemination, etc… I think it is mainly built by members core team members who already have many of the skills I just mentioned. In addition, a large prestigious team like Wolfram can completely mobilize outside support to propose be implemented in the best way (possibly with the team's ability - it is not necessary). . But I still support this and give my subjective opinion. That is the basis for me to believe that the team will do a good job when implementing the technical aspect of the proposal implementation.\nThe team also stated quite clearly about 5 possible risks when implementing this proposal: No UTXO Alliance support, Cardano community support, etc… - accompanied by 5 solutions adequate to prevent risks. Here, I add a sixth risk: Ada slippage - will affect the budget of the proposal. We know that the cryptocurrency market is in hibernation (devaluation of digital currencies), so Ada may depreciate when the team receives from the Catalyst fund, then the team will face the problem of a lack of budget to implement the proposal. So my advice is for the team to take a close look at Ada's slip-in budget to make the budget requirements in the proposal appropriate.\nThese are just my positive comments, the team can review and adjust this proposal. I strongly agree with the feasibility of the proposal. I vote 5 stars.", "q1r": 5, "q2": "The roadmap of the proposal was presented in quite a detail by the team with a total duration of about 11 months (from April 2022 to March 2023). This is a logical roadmap and milestone. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. The team did a great job of linking milestones to specific months of the year. As a PA, I have evaluated several proposals and have found that not many teams do this. Thereby, it will be much easier for the community to assess the transparency and auditability of the proposal.\nI'm quite pleased to see the KPIs. Does this show that the team has carefully and specifically researched to come up with such KPI criteria? We all know the role of KPI in the audit. This makes it more convenient for the community to evaluate and audit the proposal. I consider KPIs to play a certain role in demonstrating the transparency and auditability of the proposal. However, I am still looking for key metrics, key metrics are as important as KPIs. So my advice is to quickly add key metrics to the proposal. Then this proposal will have much higher transparency and auditability.\nIn terms of \"what the success of this project looks like\", the team had 5 clear criteria to measure success: Community participation; Collecting data; Completing educational modules; Attractive web application; Presentation seminar. Thus, the definition of success is not only necessarily tied to specific numbers, but also refers to the theory and practical applications. I am satisfied with this definition of success, it makes sense. Throughout the proposal, the team clearly described the problems and solutions. We hope that the team will consult with me, taking note of the addition of key metrics. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6108, "q0": "The authors of the proposal recognize that UTXO chains need to accelerate collaborative efforts, and remember a common origin. The author has proposed the idea of ​​​​building educational materials. Research blockchains, research papers and active UTXO developers, and history. The author has described the main points of the project. The UTXO project is one aspect of the new education center that generates in-depth studies, computational data and interviews. The project will provide information, helping to expand UTXO cross-chain operations. Propose impact to challenge and describe in detail through 3 phases. Early Stage: Research and Discovery Phase; Stage 2: Working stage; Stage 3: Presentation phase and attaching links to additional information. The proposal will help increase cross-chain collaboration. There is a high probability of UTXO cross-chain, and more and more UTXO chains will grow, including Cardano development. Besides, the author also tried to outline the risks in the project. Along with those risks, the author has set out solutions for all risks in the project, so that the project can be implemented in a good and continuous manner.", "q0r": 5, "q1": "The author has made a specific plan of the roadmap, budget and team of the proposal. The first is about the route. The author presents a project implementation period of approximately seven months, after receiving a potential grant. The author has given a detailed roadmap of the work to be done in the project through: 3 phases. We have the information we need about the proposal's plan to measure project viability. Although it could be better organized and more detailed. Talking about the team's roadmap tells us what to expect in each phase. Activities are listed. However, it would be good if the author analyzed the route with a detailed timetable. Each phase can be broken down by month and shows exactly what work will be done each month. This way we will have a better view of the development of the project. Example early stage: Research and Discovery Phase (Mid April - August 2022), this is quite a long time for us to know exactly what work will be done, exactly when . It is very beneficial to have a detailed roadmap, ensuring that the work is done on schedule and completed in a feasible way. Next is the budget. The proposal requires a budget of $67,000. A similar thing happens here. We know what the funding will be allocated to. However, it would be good if the author analyzed a specific budget table. Funds are allocated, broken down, for each task performed. Example: $28,500, more than 40% of the total proposed budget is required, because the value is quite large we need a more detailed explanation (cost per part: writing fee, programming fee, modeling fee) model, design and teaching ... estimated working time, salary of specialists (hours/weeks/months)?) etc.. Finally about team members. We checked and was informed that Wolfram Blockchain Labs (subsidiary of: Wolfram Research): offers 4 separate ecosystem areas for DLT. At the same time, we investigated each member according to the link profile that the author provided. We know each member's identity, skills and experience, and have an affiliation profile attached to each member. Show off a potential, capable team. From the plan table, we know the schedule of work to be carried out, the budget to be divided. However, the proposal would be able to perform better, if all were added in more detail. I will withhold 1 point on this part.", "q1r": 4, "q2": "The author has provided many KPIs, so that we can easily track the progress of the project. By metrics: UTXO Alliance interviews: including: UTXO videos and educational videos. Number and contributions of the community; UTXO blockchain proposal. That means we can track in many ways how the phases of the project will develop and we know what value it will bring to the community. And the final product is what is expected, the success of this project. Since we have been provided with a lot of information, I believe it is complete and satisfactory has been established. The proposal has good auditability and transparency.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 9933, "q0": "UTXO is a \"functionalish\" approach to do blockchains. It is one of two major paradigms in the space and it is not only about the accounting model but also about language design and holistic architecture. Having a more comprehensive understanding of the existing infrastructure, architecture and research as well as of directions of the current and historical development, fertilizes opportunities for new insights and innovations. It also crystallizes the understanding of assumptions behind existing solutions and clarifies what can and can't be done within certain timelines, what is realistic and so on. \n\nThe plan represented in this proposal helps at finding common grounds between UTXO platforms and recognizing those areas and directions which might be beneficial to a large group of projects and their goals. This is a big step forward for creating standardized solutions to accelerate development further. The proposal is extremely well aligned with the challenge question of supporting cross-chain collaboration and co-innovation. ", "q0r": 5, "q1": "The process is two-phase. The first phase is the research phase for collecting data and diving deep into UTxO technologies. This phase is already ongoing and will be finished regardless of the funding outcome for this proposal.\n\nThe second phase is about tooling to display and process the collected information. Data computability is Wolfram's core area of expertise. The final outcome depends on the success of UX design and there are no reasons to doubt their capabilities to deliver that.\n\nThe budget is detailed pretty comprehensively. Follow-up funding is not needed until new desired features are asked. Wolfram Blockchain Labs has been deeply involved in the crypto and Cardano ecosystems. Their contributions are well recognized and they have all the required resources to implement the proposal successfully. ", "q1r": 5, "q2": "There are six meaningful, quantitative KPIs given. They mostly focus on the level of engagement when the system is in place. For the research and discovery phase, very short regular updates could be desirable. \n\nAfter the completion, the amount of community participation in data contribution is important since it helps at ensuring the continuation of the service in the future. In the case of educational content, direct feedback from the people might be useful. ", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 10331, "q0": "The proposal presents a problem that needs to be solved in the field of education that applies Blockchain. To build educational materials that require UTXO chains, it is necessary to accelerate collaborative efforts and remember a common origin.\nThis project will also provide information to help expand UTXO cross-chain operations of all types.\nWolfram Blockchain Labs (WBL) joined the UTXO Alliance in April (The UTXO Alliance is an initiative created to initiate a partnership with individuals and organizations that are working to make the UTXO model possible. more extensible, secure, and interactive.\nThe proposal has assembled a list of over 150 active UTXO blockchains. On the other hand, they also interviewed a lot of people participating in different UTXO chains to add documentary information to the ledger.\nI'm sure this proposal fits the Fund9 Cross-Chain Collaboration challenge. It will have the opportunity to expand and grow even further because it is an open challenge that welcomes all projects geared towards cross-chain collaboration, innovation, and interoperability.\nThe proposal contains specific risks and solutions. I agree with this suggestion.", "q0r": 4, "q1": "This plan has been in progress before receiving funding, it is still in the exploratory stage, and if the funding is received, the plan for this project is about 7 months to complete. It seems the source of funding. Cost is a major issue in the project. If this is not funded, this proposal will cut resources and close on September 1, 2022.\nThis plan assumes funding will be divided into 3 phases:\nResearch and Discovery Phase Mid-April - August 2022, Work Phase September - December 2022, Presentation Development Phase January - March 2023. This timeline. is reasonable.\nThe KPI is not displayed and this plan is heavily dependent on funding, so it is difficult for me to assess the implementation of the project.\nIt is proposed that there are no other sources of revenue from this funding.\nThe budget is divided into 5 parts: Team Costs: 28,500 USD, Glossary Bounties: 10,000 USD, Supplies: 5,000 USD, Marketing & Outreach, Website Application & Design: 18,500 USD. The total request is $67,000, We would love to see a more detailed plan, explained with the required budget figures.\n\nThere is a strong team with many teams with appropriate skills, experience, and qualifications allocated to suitable positions to complete the project. I believe the team is qualified to complete this proposal.\nWolfram Blockchain Labs (WBL) team works together with Wolfram Research's Parent Company, on a project to gather human resources from WBL team members and Wolfram Research Open Cloud and Enterprise Private Cloud team members to complete the mission. These include the following groups:\n+ Researchers: Jon Woodard & Steph Macurdy\n+ Technical: Blockchain Team as advisors\nWolfram Open Cloud Team as the engineering talent to execute the project (Specific names and bios will be added later)\nTeam bio reference: https://wolfr.am/Cardano-EPC", "q1r": 3, "q2": "Project progress has specific metrics and KPIs defined, but there are no public links to the community, making it difficult to determine project transparency.\n\nProject completion will be measured using products such as community participation, data collection to support program evaluation, completion of educational modules, web applications, and applications in seminars and presentations.\n\nThis is a new proposal that follows from previous Funds. At Fund8, there have been 4 Funded proposals, with funding of more than $200,000. Projects can be found here:\n1. Wolfram Cross-Chain Framework (funded $75,000): https://cardano.ideascale.com/c/idea/400303\n2. Wolfram Reimagining Defi as RealFi ($50,000 funded): https://cardano.ideascale.com/c/idea/400295\n3. Wolfram Governance Analytics ($50,000 funded): https://cardano.ideascale.com/c/idea/400301\n4. Wolfram Catalyst Impact Dashboard ($50,000 funded): https://cardano.ideascale.com/c/idea/400305 \nGood luck with this project.", "q2r": 3, "assessor": "z_assessor_3181", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Research active and historical UTXO blockchains, research papers and developers. Build educational materials.", "experience": "We’ve built blockchain study group materials and research documents and have already started UTXO discovery work."}