{"id": 418220, "author": "dzhuliana", "title": "Cross-Chain Catalyst Women Activity", "url": "https://cardano.ideascale.com/a/dtd/418220-48088", "category": 26598, "amount": 15000, "description": "How do we ensure Cardano is leading the way for blockchains to meet the UN’s SDG goal for gender equity?", "f6_no_assessments": 6, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1742, "q0": "The Problem statement impacts all the listed \"common challenges\" since once women are also given an equitable place in blockchain, all areas are positively affected, according to presented articles and sociological studies worldwide (an area of study for this assessor). The most apparent matches are in Culture, Diversity & Inclusion, Innovation & Decision-making, Collaboration Tools & Platforms, and Security & Privacy.\n\nThe problem might be less apparent to voters when proposed as a question. If rewriting, perhaps this could be a place to start: \"Cardano has yet to meet the UN's SDG goals for gender equity. There is a need for cross-chain collaboration in open & private spaces for women in Cardano.\"\n\nVoters can be sure that the proposal invites others from neighboring blockchains, it increases the number of events/workshops/sessions arranged with other communities, and likely fits into other KPIs from the Cross-Chain Collaborations challenge setting.\n\nThe team plans to expand their numbers and begins that work with the proposal's addition of two new facilitators. These are the beginnings of scaling; perhaps voters will benefit from learning more about the team scaling plans in another proposal in the future.", "q0r": 5, "q1": "The skillsets necessary include:\n\n1. Facilitation\n2. Education in the SDG goals\n3. The topic of inclusion as it relates to women in a very male-heavy tech space\n\nOther skills necessary are mentioned in the team bios, as well as in the timeline.\n\nThe team, plus two new facilitators, is defined to meet most of the plan's goals. Added to this is inviting others outside Cardano to form Cross-chain collaborations on the topic. \n\nThe plan is detailed, with implementable items in their timeline. The budget is outlined clearly, and broken down into identifiable items for voters.\n\nThe simplicity of the project and the budget laid out are appreciated. The work includes paying for over 6 months and adding funding to community and social media, which are more than acceptable. If the budget were increased by 50%, the team would still be within average pay for such highly-skilled social-issue facilitation that offers a value-add to Cardano and any chains that also partake.\n\nThere is no plan for if additional funding is needed, though the team will come back in future rounds as new endeavors are planned that can help solve problems addressed by Catalyst Challenges.\n\nRisks and mitigation are both offered with similar clarity. They seem well chosen, and it is good to see the team has thought these concerns out; exemplary work others can learn from.", "q1r": 5, "q2": "The roadmap clearly represents all planned marketing and social media work and the scheduled meetings.\n\nFurther, the metrics and KPIs included make sense and easily quantify success. Nothing feels \"out of place\" or that the team is attempting to grow too fast or aggressive.\n\nAt least half of the meetings are public-facing and can be attended by anyone in the Cardano or larger communities. This gives voters and anyone else a window into the work and offers a place to verify activity.", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 492, "q0": "This proposal goal to organize events with people from different communities speaks directly to the challenge ask of address \"tribalism & maximalism,\" fostering interoperability, initiatives to increase communication and collaboration between chains!\nThe proposal does an excellent job experiencing the potential impact of their idea and tying them back to the challenge. The proposal already have a history of having an impact in this area. This proposal will increase that existing impact. \n\nThe proposal is aware of three associated risks and has mitigation strategies for each. \n\nFive stars all around. ", "q0r": 5, "q1": "The proposal has detailed milestone of monthly deliverables spanning 6 months. The relatively modest budget is detailed with line item breakdown of how the funds will be spent. \n\nAll three team member are already very active in the community with experience already doing this kind of work. \n\nI'm confident if funded they will deliver!", "q1r": 5, "q2": "The proposal does a good job detailing 3 monthly KPIs. Would have love to hear how the team plan to track their work and more explicit communication of where the community will need to go to track and audit the work. Would have also like to see the proposal tie it's definitely of success directly back to the challenge success indicator..", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 1370, "q0": "Yes, this proposal effectively addresses the challenge by creating spaces to support more engagement by women and other minorities in the blockchain space. \n\nCurrently, Cardano, but blockchain more broadly, is dominated by men and often very technically focused. This can lead to blockchain communities being unapproachable to many different communities. By creating open spaces where many different individuals from diverse communities and backgrounds can interact, this proposal can help achieve a broader and more welcoming appeal to these persons. \n\nAnother reason why I know this proposal will be impactful is due to the fact that Cardano Women is already strong community in the ecosystem. This group continues to attract and support new members to Cardano. By expanding this to Women In Blockchain, they will be able to extend their reach beyond the Cardano silo, something that is necessary for success. \n\nI fully agree with the sentiment of this proposal that by including more diverse people we will open up new connections and ways of thinking/doing that are reflective of a broader subset of society. This will also allow individuals ways to connect with existing community members to find their niche in order to contribute to the blockchain space. ", "q0r": 5, "q1": "Yes, given the experience and plan presented, it is highly likely that this proposal will be implemented successfully. \n\nThe Cardano Catalyst Women group is already delivering and providing significant value to the community. Everything they have set out to do has been successful and they continue to build their reputation in all venues where they participate. Having been able to contact, engage with, and participate in the Cardano Catalyst Women group, I am certain they are up to the task to deliver on this proposal as well. \n\nThe plan as presented is quite clear and easy to follow. They will host Women in Blockchain events over several months to increase their exposure to other communities and to identify ways to collaborate and grow together. This proposal is also an extension of their already ongoing work which they have implemented extremely well, and so the continuation into the next six months is very feasible. \n\nThere is also seemingly little risk for funding this proposal as the budget is extremely modest but the potential impact is significant. If successful and we can engage more diverse individuals from geographic and cultural backgrounds, it could be some of the best money spent by the community. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs mentioned in feasibility, the plan is very easy to follow and so community members will be able to directly see whether they hosted the meetings they committed to, and what were the outcomes of those meetings. Since the meetings will be done on a monthly cadence it's also simple to follow whether they were done. \n\nThe auditability is strengthened by the fact that the meetings will be open to community members and so individuals can engage the group directly to see whether or not they are achieving what they set out to. \n\nWhile not enough to mark down, my one issue here is that I wish the team had of provided a more tangible success measure for the end of the project. It is good to say you want to increase the number of women in blockchain but there should be a threshold you hope to achieve. Is it 10? 15? Over how long? What is the expected/desired attendance at each of the meetings? This type of information grounds your proposal and makes it less abstract. \n\nOverall, excellent work. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1839, "q0": "This proposal addresses the challenges for culture, diversity, inclusion, collaboration platforms and incentivized participation for women in the Catalyst community and other blockchains. The team have already members from Polkadot community to join their meetings. This is great for future collaborations for interoperability between blockchains and will benefit the Cardano ecosystem. At the same time, this will empower more women to educate and build in the whole blockchain industry. The team have stated the risks and they have taken necessary steps and practical solutions to mitigate them. With great and consistent Public Relations (PR), they can grow and able to scale globally to bring in more women and other blockchain communities to work together. ", "q0r": 5, "q1": "The team have been hosting meetings since January 2022 most of the time After Town Hall (ATH) meetings. I believe they can build and include more women in with excellent PR. Then they will have more speakers to share and contribute to their meetings and therefore grow to the Cardano ecosystem. The team have broken down their timeline with milestones for 6 months of consistent meetings for ATH, Women in Blockchain private meetings, social media management for PR. Though the team have not stated which social media they will be using for PR. The team have the experience to conduct the meetings as they have been continually consistent since they started this year. As for the budget requested, they have broken down where the funds will be allocated to conduct, enhance, and sustain their meetings. Hence, their budget requested is justified.", "q1r": 5, "q2": "As for auditing this proposal is easy. They will continue as their plan to consistently have meetings ATH and Women in Blockchain private meetings. The community can join their ATH and check their social media presence. It will be great if they can find more than 1 speaker every month from other blockchains to join their meetings to share their knowledge, expertise and products/dApps. This will greatly benefit the cross-chain collaboration and interoperability. They will also have a metric to share to the community the number of participants and increase number of women joining their meetings. All in all, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_2274", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3465, "q0": "In fact, gender equality is more and more global demand, across society, companies and governments. Blockchain as an emerging technology should always be ahead of this kind of demands (just as the ones in social and enviromental aspects). Unfortunately, the software and engineering world is still more populated by men and proposer does a great job in showing some data and support material that reflects that. This is why I consider proposal like this very imporant for the ecosystem to grow in a sustainable way. As speakers from all blockchain will be invited to share their experiences, proposal is aligned with challenge, aiming at directions provided in the description such as \"Culture, Diversity & Inclusion\", \"Incentivized Participation\" and targeting challenge kpis as \"Number of events / workshops / sessions arranged with other communities\". Proposal is also articulated on explaining what is intended to be done here and why it is imporant. As also stated in proposal, it aligned with several UN SDG as well.\nRisk management is well done but more clarity on the communication and engagement strategy could be provided. If possible, I'd some benchmark with companies who are doing this kind of work to incetivize gender equality to understand what could be leveraged (both in terms of content and engagement).\n Taking it all into account, it is a much valid proposal addressing a need in our ecosystem and society. My rate is 5. ", "q0r": 5, "q1": "There's a solid plan based on what is going to be delivere/done in each month. However, it could explain better the \"hows\" of these deliverables. I mean, explain more what activities would be necessary to reach the mentioned itens and how they would be spread along the weeks of the month. Possibly including the advertising campaign, the planning part, the outreach for speaker and so on.\nBudget breakdown is fair and transparent. Bascially, all the cost are related to staff monthly payments.\n\nAs for the team, there are 3 people already committed with background in project management, sales and marketing, organizing community education events, Cardano and business in general. This capabilities should be enough to lead this project. However, there  are 2 more people that needs to be hired.\n\nConsidering it all, I believe this project is feasbile. My rate is 4 because the plan could have more information as I mentioned and because still needs to be completed.", "q1r": 4, "q2": "There are several good metrics to measure project success and most of them have targets. It's good they include a minium thereshold for cross chain presentation per month as this is the main focus of the challenge. it would be imporant also to have targets/goals for how many people are attending the ATH and how many women are active weekly.\nProject plan also has good time-framed deliverables, per month.\nOther metric to consider including is the number of new women proposing in Catalyst, as this would be an interesting turnover/aftermath for this proposal.\nMy rate is 5 as I consider the suggested metrics and deliverables enough to assess success.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "The PA gives 2 reasons for rating feasibility. The PA inaccurately assumes 2 more people need to be hired to implement the proposal. This assumption isn't accurate. And they are asking for a detailed day-by-day schedule which isn't aligned with challenge goals or assessment criteria. "}, {"id": 14557, "q0": " The proposal brings up a necessary issue of supporting women in taking action confidently and participating to their full potential within Catalyst, where they might otherwise have remained as observers. I’m personally very impressed with the idea. Nowadays, gender equality is focused on in different types of activities to empower personal growth and make the world a better place for all genders, and it’s just wonderful to see it here in Cardano.  In fact, the team has already carried out a number of activities since the beginning of the year 2022, and expect to have funding to scale up and boost the quality of their events. I can see that their activities play an important part to pave the way for people from other communities, developers included, to the Cardano ecosystem. I believe they match the requirements of the challenge well. The team presents the impacts of their project very well. They also mention three risks that may hinder their project implementation (risks of not delivering, not adopting and not reaching the desired outcome), and propose several sensible ways to mitigate them. I strongly agree with them. Rating of 5.", "q0r": 5, "q1": "The roadmap of the proposal is super neat and clear. The time-framed timeline gives specific and convincing descriptions of the steps to be carried out to fulfill the objectives of the proposal, as well as the expected results of each phase. The information provided here completely makes sense. The team breaks the budget down into two components to cover the tasks required to successfully host their meetings and market them effectively. This financial description is clear and appropriate. The team needs 5 members to run the project smoothly, including 4 meeting facilitators and 1 social manager. At the present, they only have 2 meeting facilitators and 1 social manager. As I see, each meeting is hosted by only two facilitators. They are now just looking for two more meeting facilitators for a better rotation of the tasks, and ensure there are always 2 hosts available for each meeting. So, looking for two more hosts isn’t an urgent task and it doesn’t seriously affect the organization of the meetings. For the current available team members, they are all well described. There are also profile links of them available for reference. The team has done a great job and this and my rating is 5.", "q1r": 5, "q2": "Regarding the auditability of the proposal, the team points out specific quantitative criteria to meet. This helps measuring the project progress easily and conveniently. As for a description of what their success will look like, I think the team could give more information to further illustrate their presentation. For example, their project will become a success if they can increase “the number of Women in Blockchain”, and their “weekly active attendance”. How many women are expected to engage in blockchain ecosystems in general and Cardano in particular? What number or percentage of active attending members is considered a successful number/percentage rate? I guess some figures should be added here to facilitate the project auditing. My rating is 4.", "q2r": 4, "assessor": "z_assessor_4072", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Organizing speaker-focused events with people from different communities to find common ground, share knowledge, resources, skills, ideas and visions with one another.", "experience": "Members of CardanoCatalystWomen, have been regularly hosting weekly events, not just After Town Hall, but also Thursdays, open to members of all chains, and have already hosted members from Polkadot."}