{"id": 418526, "author": "yeepeekoo", "title": "One Crypto Pass", "url": "https://cardano.ideascale.com/a/dtd/418526-48088", "category": 26598, "amount": 57200, "description": "https://youtu.be/bziQe89lHLU  \n\nNot your keys, not your coins, right?\n\nBut how can your seed phrases be kept safe? How will we onboard the next billion users on-chain without this FUD of getting hacked?", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 4106, "q0": "Problem Identification: The problem is clearly defined, and agree with the need for better seed word storage solution that is beginner-friendly.\n\nValue-add: Overcoming FUD for new users is an impactful metric, and helping them to understand and secure access to their cryto assets is one important part of the process.\n\nAlignment with challenge: , This project would be more suitable for the Dapps, Products, and Integrations challenge since seed word storage has no direct link between chains.  It's not a cross-chain collaboration insofar as there is no interoperability improvement here.\n\nScalability: The product should be reasonably scalable to store any kind of password or passphrase as needed.\n\nSustainability Plan: The proposer has committed to multi-year maintenance of the product in addition to the development process, but it's unclear if there is any revenue generation or any income that would make this \"sustainable\" beyond that timeline.\n\nJustification: I generally agree with the proposal's problem/solution match, but maintain a neutral position because I believe this proposal is located in the wrong challenge.", "q0r": 3, "q1": "Team Skill Relevance: The proposer mentions he has 25+ years experience in software development, which is reasonably appropriate for such a simple app.\n\nTeam Appropriateness: The proposer mentions they have the right \"team\" in mind for this proposal, but only ever profiles himself, and mentions an Authenly team who will do beta testing for him.  It should be assumed this person is working alone.\n\nBudget Outline/Reasonableness: I believe the budget as an hourly rate of ~$50/hour is resonable, however from my experience managing product development I think that 99 hours is a lot of time to complete this project.\n\nImplementation Plan: The plan for completion and delivery of this project is clear and well laid out.\n\nResource Plan: The resource plan mainly consists of Catalyst funding and the proposers own personal efforts.  But it seems to be sufficient according to the solution described here.\n\nRisk Mitigation: The proposer has evaluated that most of the real technical work has already been completed and there are limited technical risks remaining.\n\nJustification: I generally agree with the feasibility as presented here, but not strongly due to the fact that my evaluation of the proposal's technical complexity is low, funding request is quite generous, and author mentions that much of the work is completed already.", "q1r": 4, "q2": "Clear Roadmap/Milestones: A clear roadmap and milestones are presented, although there is not a lot of information on testing and delivery, including limited risk evaluation of what can go wrong during that process.\n\nDefined Metrics/KPIs: The KPIs for success on this proposal are clear... Adoption.  If the proposer is successful at quickly gaining adoption by a new user base, they can quickly expand the community, and that measurement will be very clear.\n\nMeasurable Problem/Solution Impact: The problem solution impact is positive, and agreeably defined in terms of importance and perceived risk at entry of new investors.\n\nPublic Update Channels: The proposer does maintain and manage public channels and mentions that the project will be open source, although he has not presented a github or code repository account to indicate this will be an open source project or to allow community review of his past work quality/capability.\n\nJustification: Overall agree in the auditability of this proposal and hope that the proposal delivers a usable product to onboard new users, but long term success depends on opening that product to the community, so that sustainability for the product may also extend beyond the contribution lifespan of the initiator, and improve based on the observations/requirements of the community at large.", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Hi - thank you for your review. It looks like we share different views as to where this project should be funded from (if it gets enough successful backing). I truly believe that it has its place in \"Cross Chain Collaboration\" since it will provide a solution which is de-facto \"Cross Chain\". As you mention, it does not provide chain interoperability, but it fits very much this fund's requirement of \"Catalyst-created solutions adopted by other chains and communities\" in the sense that when developed thanks to catalyst funding, it will be available to ALL \"other chains and communities\". \n\nRegarding your comment about revenue generation: this is NOT a commercial product. I am basically committing to develop the product for the community (in exchange of funding), and I do not intend to sell or license the app. The infra cost for supporting the app will be minimal, and I am sure that if the app helps x100,000 users to secure their seed phrases, 3 years time is ample time to allow the community to find ways to support those very low costs beyond my personal commitment.\n\nRegarding your other comments that the funding request is \"generous\" and that my \"past work quality/capability\" cannot be reviewed, I find them misplaced, but I do not think it is the place to argue here. I will only (re)state that: (i) I have given enough justifications for a very detailed costing in my proposal (by the way, I do not see the incentive for me to give away all my work and proprietary coding of the past years for free as you seem to suggest) ; and (ii) there is proof of existing commercial app (iOS / Android) which anyone can download to check the quality of work. \n\nI agree with your last comment that the \"sustainability for the product may extend beyond the contribution lifespan of the initiator\". Somehow, it is the whole point of this proposal: to transform a proprietary \"web 2\" solution into a community backed and open-source \"web 3\" solution, which will live beyond my initial contribution, for the benefit of the community.\n\nThank you again for your feedback and the time you spent to review my proposal."}, {"id": 1372, "q0": "Yes, this proposal effectively addresses the challenge. \n\nWe have all been through it, the fear of losing your seed phrase and in so doing, access to your entire wallet, all your coins, all your NFTs gone. This factor alone is likely to deter (or at least not appeal) to a broad range of individuals for myriad reasons. What Eric and his team suggest is to develop an application (actually upgrade and improve upon an existing app bringing it into web3) to allow users to enter their seed phrase and encrypt it offline without fear of it being hacked. \n\nThis proposal is exciting because it could be applied to any single chain, however, since it would be on Cardano originally, it could also inform other crypto users about our ecosystem. This type of innovation is not about maximalism or wen moon but focuses on moving the yardsticks. It also speaks to why we are here in the first place: to make a global network and financial operating system where everyone is welcome to participate. Smart and easy applications that build trust, like this one, are how we'll get there.  ", "q0r": 5, "q1": "Yes, given the experience and plan presented, it is highly likely that this proposal will be implemented successfully. \n\nWhat gives the most confidence about the feasibility of this proposal is that the product is already largely built, however, it's built only on Web2, which means that all the submitted information is held on a server somewhere. This type of mentality will not survive web3 where individuals will want to have control over their information and data, not \"trust\" a non-accountable third party. \n\nIt is obvious from the proposal that the team has a good understanding of each of the necessary components to be completed. The level of detail in what activities will be completed, at what time frame, and for what cost really take the guessing out of what the community can expect. To me it shows an immense amount of forethought and deliberation. It is maybe the best I've seen yet. Excellent work. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs mentioned in the feasibility section, each of the expected activities, milestones, time requirements, and deadlines are very well articulated and can be easily tracked. \n\nNext, the team commits to using github and being open source from the beginning. This is true to the Cardano spirit and can inspire confidence that there will be ample opportunity for the community to test and examine the code. This approach will allow the team to only need to solve each problem once, with the help of the community. \n\nThe use of tutorials and animated videos to help explain the issues and support users is also a great idea to explain the process and progress to the community. Users will be able to use the instructions provided to interact with the app and in doing so give valuable feedback on the effectiveness of the tutorials. \n\nBest of luck in the voting round. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Hi - thank you for your review. I am very appreciative of your support, and the fact that you took the time to review in details, and put your own thoughts and argumentation. I would be very happy to exchange more details with you if I get funded, to allow for input and beta testing. But first.. let's hope that the proposal get funded ;-)\n"}, {"id": 4384, "q0": "After reading the proposal, I realized that the proposal that solves the goal set out in the Challenge is Cross-chain collaboration. You have identified the problem to solve how to keep seed phrases (about crypto wallet security) safe - directly related to your crypto assets. This proposal is built on the Cardano blockchain so it directly adds value to the Cardano ecosystem. If it is successfully applied in practice, the contribution to the Cardano ecosystem is not small. I understand that in the face of many e-wallets that cannot guarantee security (maybe due to subjective reasons of users or objective reasons), this proposal is of great importance to all users. use a cryptocurrency wallet. Therefore, the potential for development as well as the scale of development to solve its future challenges is very large. In other words, it is possible to completely expand the scale of this proposal in the future. I am very interested in your suggestion. I see the potential of the proposal as a premise for continuing to build a community to drive the adoption of the Cardano blockchain around the world. I cannot deny the powerful impact of this proposal. I strongly agree.", "q0r": 5, "q1": "You have 25 years of experience in software development and 3 years involved in cyber and crypto projects. This experience is very valuable, it is one of the bases for our community to believe in the feasibility of the proposal. Especially when you have been funded by Catalyst to implement other proposals at Fund 7 and Fund 8. Regarding the issue of publicity on social networks, you have provided your link on Linkedin. If possible, you can provide some other information about the team members, to give the community more confidence in the team and also a way to increase the feasibility of the proposal. That is my opinion.\nRegarding the budget, you have broken down the budget attached to the work items. I find it reasonable to present it so that the community finds it easy to understand, clear, and easy to audit. Data such as 99 days of work execution time, required work items, and USD57,200 requested for funding have been combined to make it reasonable and consistent with reality. . Through the presentation of the budget, I can see that you are carrying out the work in a very serious and professional spirit. I just have a question, if you have not been funded by Catalyst at Fund 9, will you continue to implement the proposed proposal? Do you have any other backup budget, other than the one waiting from Catalyst?\nRegarding the necessary resources to implement, in addition to the financial resources as I mentioned above, there are also human resources (human resources), etc... I understand the core human resources to implement this proposal. you are an important person in the development of software and cryptocurrencies, but I still want you to prove more clearly that the team can fully meet the needs of human resources to implement this proposal smoothly. What I mean is that you can add the names of the members who propose to increase the trust of the community. I see one thing, you mentioned in the proposal that you and the members make another proposal in parallel with this proposal at Fund 9, does that affect the quality of the work of this proposal? are not? How do you better demonstrate that you and your team can execute this proposal well while still working on other proposals in parallel? That is a reference question that I want to send to the team.\nOn the technical side, I totally agree that you intend to create open-source codes, biometric scanning, user interface design, etc... That session is the work required to create the app. specific tools. With your 25 years of experience in software development, I fully trust you on the team that can handle technology-related issues well so that the application can run well on the device platforms. different mobile devices. However, I still want to emphasize that this application must focus on thorough security, security is extremely necessary to protect each individual's assets, especially in the digital technology environment. Many hackers can steal assets through a few operations on the computer without being revealed. Do you intend this proposal to make the application built on a micro-centralized platform? I think you should consider this because in the future the Cardano blockchain will be a great environment for Decentralized applications to develop.\nFor the rest, I agree with the challenge and risks associated with the implementation you stated (\"security and privacy\" challenge - one of the major challenges of the crypto community that needs to be addressed. as I said above). It is a way to confirm the real effectiveness of the proposal when applied in practice. Another risk that I would like to add is ADA slippage during the implementation of the proposal. I think the team should add this issue to the proposal and consider adjusting the funding request accordingly.\nJust now are my positive comments on the feasibility of the proposal. I recognize this proposal as highly feasible and very practical in life. I would like you to consider my positive comments to improve the proposal. I strongly agree with the feasibility of the proposal.", "q1r": 5, "q2": "The roadmap and milestones of the proposal are built by you in great detail, it is highly convincing because it is also mixed with technical elements. This speaks to the very high professionalism of you and your team. The only suggestion I have is that if possible, attach milestone roadmaps to specific months in a year. To follow this timeframe, the community can track and evaluate the proposal quickly and smoothly. I think this increases the transparency and control of the proposal. You also provide a key performance indicator (KPI) related to the percentage of the population covered by the photo mobile network, which is essential for today's technology applications. I hope if there are key metrics that appear in the proposal, that would be great. You can consider my comments to help increase the auditability and transparency of the proposal. I am also convinced by the definition of success of this project, when you give a specific number of 400 users at first, then move on to the wider application in practice. In short, the proposal has a fairly high level of transparency and auditability - it has the same good quality as a clear, easy-to-understand description of the problem and a stated solution. I strongly agree about the auditability. I vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Hi - thank you for your review and your support. I will try to answer most of your questions:\n\nIn Impact, you wrote \" it is possible to completely expand the scale of this proposal in the future\". You may have ideas that go beyond my initial scope, I would welcome a discussion.\n\nRegarding \"other team members\": \n\n - the tutorials will be developed by Tiffany. You can find more detailed information about her here since she has applied for a tiny grant also in fund 9 for providing Catalyst with \"winner logos and marketing materials\" : https://cardano.ideascale.com/c/idea/421675 - Tiffany has developed visuals, logos, marketing materials, sketch videos and more, for me in the past 7 years. Some were made for large companies (like ScottishPower), some for Tech companies, some for startups or non-profit organisations.  You can also have a look at other sketch videos here: https://cartoonite.com/samples  (although there are many more).\n\n - the tests: I cannot name testers because they may change by the time I get to the need of testing. I have a rota of \"IT student placement\" who would be assigned to this job. However, please note that I will rely on community testing when reaching first alpha or beta stage.\n\n - as you have understood, most (if not all!) of the coding will be done by myself. I was also the one (with the help of Tiffany here above) who developed 100% of the current Authenly app, so I know exactly what to do to develop this web3 solution.\n\nYour question: \n- \"if you have not been funded by Catalyst at Fund 9, will you continue to implement the proposed proposal\" => The answer is NO. If unsuccessful, I may submit the project again in Fund10. I will only work on it as a priority if I can somehow get some funding for it.\n\n- \"Do you have any other backup budget, other than the one waiting from Catalyst\"  => Right now, I do not have any backup budget. If I do not get funded this round, it will postpone the project for a next funding opportunity.\n\nRegarding my ability to cope with two parallel projects (if both are funded), I think that I have given some good rationale and details of work schedule for both projects. If I were to work full time of this \"One Crypto Pass\" project, I would probably deliver (the code / app, not the tutorials) within at most 10 weeks. I have instead given ample time (around 30 weeks) to allow for managing the projects in parallel. My credibility on delivery is very important to me. I am taking commitments in front of the community, and I intend to deliver on my commitments. This is why I am not committing to \"stupid or unrealistic\" deadlines, but I made sure that I WILL deliver what I promise to deliver. Note that if this project is funded but my other fund9 proposal is not funded, I will probably NOT accelerate the development of this project, and I will keep it on the same \"very safe\" delivery timeline.\n\nI am not sure I understand well your question about \"micro-centralized platform\". Basically, I will try to put all / most of the code in the app itself, and use some built-in security features of the mobile device. The \"only\" sensitive data to secure is the user \"one crypto pass\" (the main seed phrase). All the rest will be off line, off device, and encrypted. Maybe we can discuss more details about this solution later.\n\nRe \"ADA slippage\", yes I recognize this, but I have assumed it as my risk. The 6 working days of \"dev risk mitigation\" also indirectly provide cover for this. Worst case, it is me who will get paid less... I can live with this risk. Also, although I have come to the Cardano community recently (Q4 2021), I am now here for the long term (not looking for a quick buck!).\n\nThank you again for the time you spent reviewing this proposal. You gave me lots of comments, it is very much appreciated. I hope that we can keep in touch if the proposal gets funded, and maybe you can receive the app as first beta when we start to deliver."}, {"id": 5155, "q0": "The proposal tries to create an IOS and Android app. The app can create an encrypted QR code from the input of seed phrases from the users. The resulting QR code can be scanned using the app to get the seed phrase. This can remove the need of written the seed phrase openly on the paper. The impact of the project is huge as it can be used on any Cardano user, even on other blockchains too. The proposal itself is well written, and with the project already ongoing, the chance of the project being successfully delivered is high. The proposal does not have a serious risk that may face the project, as the proposers are already halfway in working on the project.", "q0r": 5, "q1": "The proposal provides very detailed timelines, where the milestones are outlined. There is a budget breakdown with an estimation of the days needed to complete the tasks. This information is important to determine if the proposed budget is reasonable or not. The development of the project is delivered by Eric Duneau and the tutorials by the same team that delivered Authenly. Detailed information such as the background, experience, or relevant skills is written in the summary section. However, it will be better if the proposal rewrite that information in the feasibility section. It must be appreciated that the proposers give a LinkedIn profile, thus making the community easily verify their credibility.", "q1r": 5, "q2": "There are various metrics used to track the project progress, coding activity, test, monthly report, etc. All of them are easily measurable. The defined success is simple and straightforward with the app running as intended, helping users to store their seed phrase easily. However, I suggest adding adoption metrics, such as more than 20K downloads on IOS, more than 10K downloads on Android, etc.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "Hi - thank you for your review, and I appreciate your support.\n\nRegarding your suggested metrics (e.g. of 20K downloads on iOS), those will depend on factor beyond me. Although I will do my best to market the product, it will NOT be a commercial product. Beyond the ADA fees I would receive (from funding) and the recognition from the community, I will not gain any additional \"monetary reward\" for the app. So at some point in the future, it will have to be pushed by the community, not \"just me\". This is where my \"commitments\" are more difficult to \"guarantee\". I can see how I can push to a few x100 downloads, but to get to x10,000 will require other people's help.\n\nThank you again for your time and support."}, {"id": 6117, "q0": "The proposed team posed the problem, how to keep your seed phrases safe and reach the next billion users on the chain without this FUD to be hacked. The team designed a solution to allow wallet holders, self-managing, to keep their seed phrase safe, without internet, inconspicuous, but still accessible at will through via simple QR code scanning. The QR code contains the seed phrase that no one can decipher. Guaranteed safety, security. Proposals impact challenges and are described in detail. When opening a crypto account, self-sovereign and having your own 15-word seed phrase, there is a risk of anyone seeing and possibly accessing your wallet and emptying it. The proponent has a working prototype, which is already available as an app on the AppStore. As for Cardano wallet keys, it would be interesting to give those Cardano users the ability to view their wallet balance, if there are 4 Cardano accounts there will be a secure storage for 4 private keys, but also can see the consolidated balance of 4 wallets, which is a great convenience for the Cardano user community. Thus pushing the Cardano brand and the wallet brands associated with the app. The proposal was very good and suited the goal of the challenge. Here, the author is aiming for the \"Security and Privacy\" project. The application will work on all major blockchains. In addition, to increase the profile of Cardano compared to all other blockchains, the author will create introductory videos about the application, explainer videos based on Cardano. Besides, the author of the proposal also recognizes the possible risks. At the same time, there are solutions to minimize risks when the proposal is implemented.", "q0r": 5, "q1": "The proposal team, which has outlined a plan for this proposal, is very clear and detailed. Milestones are established for each activity. The proposed team provides us with information on: alternative commitments. The team listed, funded and completed projects. And the plan for the current project is: The author will: ask to hire a Python/Docker programmer and a Plutus programmer. If the author is privileged to sponsor this project (idea / 420812), it will only take about 20 hours per week at most. This is the first step we need to understand the development of this project will take place. how. The author has created the blueprint, the timetable, giving us a more detailed schedule. 21 days: Setup phase; 20 Days: Great App Introduction Guide + Tutorials; 24 days. Most functional user interfaces/applications etc. In-depth explanation of each job to be done in each part of the job (wd = 8 working days). The author also provides: progress and time, a scheduled delivery schedule, and provides a sample screen of the current application (reviewed with a Cardano feel). In the way the author has presented, we have a better view of the development of the project. This plan is very doable. Next is the budget. The proposal requires a budget of $57,200, for 99 days. This is about the necessary budget, which in my opinion is reasonable and well explained. We know how the funding will be used, and how much money will be allocated to each task, in the project. Budgets are presented in a transparent manner. Finally about the team members in the proposal. According to the information that the author has provided in this section, we know the author is Mr. Eric. We also provided: Website and 2 videos. We know the identity, technique and experience of the proponent (funded by Fund 7 and Fund 8). Initial testing will be done by the Authenly team (actual team members can rotate by the time we get there, for this purpose we use apprentices over 6 months). The proposal has a very good plan, I believe in the success of the project.", "q1r": 5, "q2": "From the plan table, it shows the author's professional ability and active effort in the proposal. Detailed roadmap in each milestone, making it easy for developers to audit the successful progress of the project. In addition, a strong team and detailed and transparent budget give strength to the confidence of the project's success. The author provides us with metrics to measure project success. Coding activity: github commits daily; Test: weekly app updates and engagement/usage measurement through testflight monitoring. Instructions: they will be hosted on youtube (will track monthly views). Maybe the addition of \"just one ping\" to the site, will count how many wallets are secured and from which blockchain... we can track in many ways how the phases of the project will develop, and we know the value it will bring to the community. And the end product is what is expected, the success of this project: is the widespread adoption of this application in the crypto community, to help users secure the self-managed wallet seed phrase and protect their private keys.As we have been provided with a lot of information, I believe complete and satisfactory information has been established. The proposal has good auditability and transparency.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Hi - thank you for your time spent on this review, and your support for my proposal. Please keep in touch if this proposal gets funded, and maybe if you would like to be one of the first recipients of beta releases."}, {"id": 12955, "q0": "The proposer addresses the issue that is\n related to keeping seed word safe .\nLike how we can secure the seed words and how we can add the upcoming users to the blockchain without creating fear of hacking .To overcome this the proposer have created the solution where the owners of the wallets can keep their seed phrase private , off the internet, and out of sight while still having free access to it at any time via a quick QR code scan .the proposal The key metrices and goals of the proposal align with the outlined challenge settings.\n", "q0r": 4, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the proposal. The proposer is very experienced\nand have been currently working on the previously funded proposals .\n  The proposer have previously raised funds from the catalysts . The proposer have mentioned the Budget in the description .The budget looks reasonable . The timeline provided by the proposer described Realistic timeline to implement the project  . The proposer will charge for the the time spent on coding and for the team members who contributed to the delivery of the solution. The team who will be working on the proposal are experienced and \nhave knowledge of the catalyst. The proposer have also mentioned the resources that are needed to implement .\n", "q1r": 4, "q2": "On Github, where the proposer will post daily updates, the proposal's development can be followed. The proposer will provide a video report every month on the Cardano / Catalyst community, generally including our previous month's activity, what we'll concentrate on in the coming month, and any difficulties and possibilities .The proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described. \nThe Metrices/Kpi's mentioned in the proposal define the success of the proposal", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Hi - thank you for your review and your support. Do not hesitate to reach out to me if/when the project gets funded, if you'd like to be involved in the first round of beta test."}, {"id": 14862, "q0": "This sounds like an interesting solution to store all the keys to your wallets. Still, putting myself in a new user point of view, I'm not sure about this because I haven't had enough information to decide. Here are some of my questions: What is the algorithm behind this encrypted qr code? the illustrated video states that there is only me who can decrypt this code, I assume that it implies the account. Then, I need a password to access my account right, there is still a risk of being hacked if someone hacks my account and knows the QR code. Or if I don't need a password, what would happen if I lose my phone (or the device that has this app) which is a common thing to happen? Does this mean I can lose all the keys to my wallets?", "q0r": 4, "q1": "The plan provided is very detailed into the amount of work each day plus expenses that may occur in the future and an informative explanation of why that may occur. This is an executable plan for me.\n\nBudget breakdown is also detailed. It just has one minor adjustment, which is that I think the cost of animated videos should be listed in the number of videos that will be made, not in working days. The same applies to other categories as well, the cost should be divided based on the amount of work/the product, or the salaries paid for employees, not based on working days. This way, we can ensure the team doesn't delay the timeline. \n\nThis project will be delivered mostly by one person who is Eric Duneau. He is experienced in the IT field and has a high educational background plus the fact that he has received funds from Catalyst before makes his competence reliable. However, since there is only him who does most of the job, it takes quite a time to deliver this project, not to mention he is also working on other projects from previous funds. The testing will be conducted by Authenly team but we haven't known who will be actual members in this team. This is another factor to consider. ", "q1r": 4, "q2": "All information required in this part is transparently delivered in the proposal: the metrics, the platform to find reports, the envisioned number of users, etc. I have nothing more to ask. Hence, I will give this part a 5.", "q2r": 5, "assessor": "z_assessor_4106", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Hi - thank you for your review and your support. I try to answer your questions below:\n\nQ:  \"What is the algorithm behind this encrypted qr code\". I am using MIT open source libraries, and encode with most secure APIs with a strong seed phrase. If anyone can decode the QR code, then it means they have computing power to decode ALL seed phrases of ALL wallets / ALL chains (totally independently of my app)... So  basically armagedon!\n\nQ: \"Then, I need a password to access my account right\" - No. There will be NO password. Your seed phrase (the \"One Crypto Pass\") will be encoded in the device. Only you know it (if you want to install the app on another device). So you are NOT at risk of anyone stealing a password.\n\nQ: \"if I lose my phone, does this mean I can lose all the keys to my wallets?\" - No, you do not loose your keys to your wallets, since they are NOT on internet, and NOT on your device. They are only encrypted on a piece of paper when you created them. You can lose your mobile phone, it does not give your \"One Crypto Pass\" to who ever gets your phone  (it is encrypted in the phone) and it does not give the QR code papers (likely stored in your home) to whoever gets your phone. in short.. you are safe.\n\nRe cost, the timeline will NOT be delayed. I have taken sufficient leeway to allow for a \"safe delivery\" of the project.\n\nRe testing: part of the test are automated (postman test, see section \"setup phase -  build scripts, ongoing postman tests\"), so they will not require extra headcount. It is also hoped that the community will adopt the app and provide beta testing, in addition of the 6 days of test that we have allowed internally (not a huge workload, less than 50 hours) \n\nRe number of videos, it will be reviewed a bit later, but I will make sure to include all essential ones. The most important ones will be the onboarding / explanation videos which will get first priority.\n\nThank you again for your feedback, review, and support."}], "solution": "I have designed a solution to allow self-custodian wallet owners keep their seed phrase safe, off internet, not in plain sight, but still accessible at will via a simple QR code scan.", "experience": "I have been developing software for 25+ years, and have been involved in cyber and crypto projects for over 3 years now. I have already developed by myself a (web2) prototype showing that what I intend to deliver is feasible. I have the right team to build on this prototype."}