{"id": 418590, "author": "littlefish.foundation", "title": "littlefish - Ocean Organizations", "url": "https://cardano.ideascale.com/a/dtd/418590-48088", "category": 26598, "amount": 66133, "description": "Up-to-date, detailed information on building decentralized organizations is hard to come by, often hidden deep within a DAO. Opportunities to learn and to collaborate never materialize.", "f6_no_assessments": 6, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1375, "q0": "Yes, this proposal effectively addresses the challenge by collating and creating a suite of products, materials, people, and communities that work together to address collective issues. \n\nThe team does a decent job at articulating how their solution is designed to address the currently challenge of blockchain projects working in silos. Through this project they propose their solution will improve implementation of solutions from other chains on Cardano, creating more connections between chains, and sharing of best practices and information between chains. However, I think that this proposal is more suited to the DAO challenge given it's primary focus on setting up structures for individuals to work together in a decentralized way, rather than necessarily addressing cross chain collaboration. \n\nEven in light of this, I still think the proposal has the potential to successfully impact the Cardano community, with the potential of bringing in other chains. I just can't give full marks as the fit is more tangential than direct. ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. \n\nThe proposal and plan is extremely comprehensive and the team explains essentially every single aspect of their intentions and expectations. While maybe a bit long for the average person, reading through the proposal makes it painstakingly clear that the team is prepared and equipped to deliver. I would encourage the team though to perhaps consider the readability of the proposal in future rounds. \n\nThe breakdown of deliverable, specific activities, expected outcomes, and the groups/individuals for each of the components in the plan really removes any guess work that readers would need to do. The team clearly has a broad overall vision and outlines their path for how they will achieve it. \n\nGiven the work outlined, the budget feels very fair. It is obvious that they are already doing a lot of the work and that the requested funds will be spent on progressing their efforts even further. There is not much to critique in this section, excellent work. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs I've stated in other assessments, any project that commits to being open source by default can give the community assurances that they will have the opportunity to provide input and feedback to the proposers, should they chose to. This aligns with the broad goal of Cardano, and the Cardano Community, which is to be a major open source project. The team also already has a variety of products and tools that the community can engage with and help guide the process overall. \n\nSince the plan and budget are so detailed there is no need to guess how the funds will be spent and what the community can expect for them. The granularity of each section and budget item gives ample confidence in the ability to track the project's success. \nOne thing that may be challenging for the team is to report on all of the measures and indicators listed, however, given the size of their team this may ne a non issue. I did find it a bit difficult to not get overwhelmed by all of the different auditability components so would encourage the team to be a bit more succinct with their writing. However, all the information is there and so no points removed. \n\nExcellent work. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4385, "q0": "The team clearly defined the problem that needed to be solved: Currently, detailed information about updating decentralized organizations is difficult to obtain, which is a barrier to learning and collaboration opportunities. I noticed this issue is related to the goal set in the Challenge which is \"Cross-chain Collaboration\". The team also outlined a solution to that problem: The team will provide updates on development, manage information, and research decentralized organization processes. In my opinion, if implemented and applied well in practice, this proposal will add value to the Cardano ecosystem, the proposal made on the Cardano blockchain platform has also had the most positive impact. to the Cardano ecosystem. Currently, the DAO is in its infancy, dominated by many centralized factors. It is very important to provide and manage information in a decentralized way, as a starting point for building decentralized organizations, DAOs. Information is communicated between all individuals and organizations, which increases opportunities for learning and collaboration. This proposal can scale and solve the challenge in the future. I think that will take a lot of time. But there is hope anyway because the team's proposal is creative, practical, and can be applied in practice. I rate it 5 stars because I am completely satisfied with the impact of this recommendation.", "q0r": 5, "q1": "According to the proposal, the team has more than 100 members from 15 countries around the world with experience in the use of blockchain technology, and understanding of digital technology. I consider the experience gained to be very suitable for implementing this proposal - a proposal created based on the Cardano blockchain. The team has provided all documents related to LFF for the community to follow and study. I appreciate this action because it is a demonstration of the team's public transparency. One nice thing that I noticed is that the key members are all publicly identifiable through social networks. Each member shows the link to the LinkedIn social network. This has a great effect to demonstrate the feasibility of the proposal and build the team's reputation in the community.\nI was very impressed with the presentation of the team's budget, it was very detailed and reasonable with the goal. Specifically, the budget is broken down into sections: Modules, and tasks, based on which, the team has calculated the necessary cost to implement the proposal. The method of calculating the team's wages is applied according to the working hours, I completely agree with this calculation because it is a popular and highly accurate calculation method in most large companies around the world. I just have a small question, other than the (expected) funding from Catalyst, does the team have any other funding sources from other organizations to implement this proposal? I ask this because I want to clearly define feasibility based on the proposed budget.\nOne thing I love about the team is the planning and execution of the proposal. It is very clear and concise, with maps and illustrations. I wish that all proposals on Catalyst were so clear and vivid.\nRegarding the resources needed to implement the proposal, I temporarily divided them into two main resources, which are financial resources and human resources. With the financial resources, I mentioned above regarding budgeting. As for human resources, I am quite confident because the human resources team has more than 100 members from 15 countries around the world. This is a strong confirmation of the feasibility of the proposal - the proposal can be implemented quickly and on time as required. Not only that, the core members are all people who have knowledge and expertise in blockchain, DAO, marketing, and communication. Although a member of the team made another proposal alongside this one in Fund 9, I am confident to say that the team can best implement this proposal.\nIn terms of technical and technological aspects when implementing the proposal: There is a lot of high technology involved: blockchain, DAO, and communication. Applying these technologies to engineering-related tasks and being divided into modules makes me feel very secure when the team does technology-related work. Have you ever thought about hiring experts to assist in the implementation of this proposal? I think with what the team has presented, the proposal can be done well without the presence of an expert unless the team wants to contact the expert to find new ideas and learn. knowledge, the good from them - because they are, after all, the best in the world in terms of expertise.\nAbout the challenges and risks related to the implementation of the proposal: One team fully outlined the risks related to different aspects - capital risk, technology risk, and marketing risk. As for capital risk, I would like to add one more opinion regarding Ada's price slippage, which affects the team's budget capital provided by Catalyst. We all know that the cryptocurrency market is in a downtrend, that's why we have to face Ada slippage (volatile day-to-day). My advice is that the team should carefully consider the budget requested through the Catalyst grant so that when receiving funding from Catalyst, there will not be a budget shortfall to implement the project. Several proposals at the previous Fund have encountered this. This is the experience that I have seen, please share it with the team. Hope the team can consult to make reasonable adjustments. If the team needs more funding, come up with a verifiable plan.\nIn summary, as an active community member, I am confident in saying that the team is definitely up to the challenge. I strongly agree with the feasibility of the proposal - I vote 5 stars.", "q1r": 5, "q2": "The way the team presents the roadmap, and the milestones are exactly what I mean (attaching specific months of the year to the goals to be done) - I appreciate this. In looking at other suggestions, I didn't see many that did this. It will be very convenient for the community to determine the transparency and auditability of the proposal.\nIt's a pity that the performance indicator (KPI) was not mentioned by the team in the proposal. We all know the role of KPIs is important to evaluate and audit proposals. I hope the team will soon come up with a suitable KPI to add to the proposal. Then it will become more perfect.\nIn return, the team has presented key metrics: Long-term initiatives, projects, Dapps, etc... If the team gives specific numbers to illustrate the key metrics criteria mentioned by me above is good.\nThe problems have been described clearly and in detail by the team throughout the proposal and are easy to understand, along with appropriate solutions to overcome the problem and prevent risks. Here are some of my positive comments and contributions to the proposal. Teams can refer. I agree with the auditability of this proposal (I hope the team adds KPIs and specific numbers of key metrics). I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5156, "q0": "The proposal's purpose is to create a team of organizational researchers, to produce up-to-date information about developments, curate it, and conduct original research on the processes of decentralized organizations. The proposal outputs are teal organizations with a large knowledge base, thus adding value to the Cardano ecosystem. The proposal is very detailed and well written in every section. The proposal outlined 3 risks that may face the project, funding, technology, and marketing. However, proposers have a viable mitigation plan to overcome all those risks.", "q0r": 5, "q1": "There are various milestones used in the project, and all of them are measurable. The timelines are on each quartal of the year. The budget breakdown consists of two sections, module budgets with an average of 50$/hour, a reasonable fee, and the Action Fund allocation which is 20% of the module budget. There is 3 module, totaling 66133$ requested budget. The proposal provides very detailed information on each core team member. From the background, experience, previous projects, and relevant skills of each member. They also attached a LinkedIn/another portfolio account, hence the community can easily verify the team has the ability needed to implement the proposal.", "q1r": 5, "q2": "This section of the proposal is so complete in every aspect. The project is very transparent, with every major progress published on obsidian (the project’s website), daily updates on discord, and the open public miro boards. Also, the various data from obsidian and discord are easy to analyze. There are various points used a defining success, create community, grow knowledge base, etc. All of them are explained clearly and are quantifiable.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 7553, "q0": "Insights and updates on building decentralized organizations are hard to come by, often hidden deep inside a DAO. This is an opportunity to learn and collaborate that never comes to fruition. This is the problem to be solved in this proposal and it is related to the current challenge. The author should also consider the risks that may affect the challenge as: the biggest risk in the immediate future is financial one of the difficulties that the author has foreseen and makes the judgments for Littlefish organization as follows: a complex organization driven by individual effort. Funding is the most difficult challenge that project authors have to face. If there is no funding, they will still build LEF but can implement the project but it will be difficult and slower. Technology is also a problem that is quite difficult if LFF is developing a strong infrastructure to be able to scale that technology and development team cannot meet, that is also an obstacle. grow hungry with them. Stronger marketing is required on the success of the proposal as it is highly dependent on the spread of highly promotional generated information to the users. The author also raises the risk of marketing if the spread of marketing activities is not widely distributed, the information that the team proposes will make the information of the activities not widely spread. it will be slow and ineffective in attracting the public. This is why the author has raised marketing as a risk in this proposal. The author is also developing the team at Love House, and an LFF working group in charge of marketing, the author also does everything to connect with communities from the other side of the blockchain ocean building community and cohesion is mainly because of the thoroughness of the proposed team I believe this project will be successful if funded.", "q0r": 5, "q1": "The expected completion date for this project is from September 2022 to February 2023. The author has listed clear, detailed and reasonable timelines for doing the work with specific goals. body. Success is listed by the author in five main stages: LFF General - Solving our own problems through testing, building apps that the community loves, LFF General - A strong community of creators and builders, LFF General - Littlefish Vault is the knowledge hub for Decentralized Organizations in Cardano Space, the Organization lab - Blueprint for Decentralized Organizations: LFF, theme export - Littlefish Vault, The Gateway to Cooperation. This is the period the author listed about their success. The solution to this problem is that the Littlefish Foundation creates a decentralized global organization, building technologies that help align individual actions towards shared goals, enabling collective intelligence. This is a good proposal if funded I think it will be successful.", "q1r": 5, "q2": "The proposal solved the challenge question and could create new connections between the blockchain communities they created it by providing a curated experience of finding these communities. The team is made up of active members whose profiles show the right skills and experience to do the job. ChaKhan - 3+ years of experience as a Backend Developer. Python, REST, Postgres, data model. Specialization in Electrical and Electronic Engineering. Working full time on LFF. Emre Kurt - B.Sc. majoring in Geotechnical Engineering with 4 years of working experience in this field. Worked as System Administrator for the last 3 years and Sales Manager for the last 1.5 years. Murat Kasar - 5 years of experience in System Administration, mainly in PCI DSS and high security environments. And some other members also make important contributions to this project. They provide complete information about the team members skills necessary for the development of the project. The proposed funding budget is $66,133, which is a necessary budget that is explained in depth and reasonably in each expenditure.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10333, "q0": "This proposal focuses on cross-chain technology that provides a researched and up-to-date platform for projects, enabling developers to connect and initiate collaboration. This proposal aligns with the first challenge of F9. This proposal was developed by the LFF - Littlefish Foundation, a decentralized global organization that aims to solve the problem of displaying detailed information. Detailed, up-to-date information on building decentralized organizations is hard to come by, the content is often hidden deep inside a DAO, making opportunities for learning and collaboration never materialize. a common topic in the current Blockchain platform.\n\"The solution to this proposal is to build a portal to up-to-date information, insights, and original research in decentralized organization building. With a staff of more than 100 people along with more than 15 core members from all over the world. The first will address the problems faced by the organization and also the common problems in the Blockchain community. From there, provide general knowledge for the community to apply. See information about Tech Help Collective (THC) research center here: https://publish.obsidian.md/littlefish-foundation/D.+Colonies/Tech+Help+Collective/Tech+Help+Collective\nAt this platform, we will find easy collaboration opportunities among builders in the ADA space. \"\"\"\"\nThe product is building an Ocean Map that collects information on projects providing others with communication links to contact and initiate cooperation.\n\nThe suitable audience for the Cardano community and others.\n\nFacing the risks of Capital, technology risks, and marketing risks. The proposal has specific orientations for solutions. One is to raise capital globally and build a contingency fund, two is to connect with other community organizations, specifically supported by the Gimbalabs community, and three is to carry out information-sharing marketing activities. The Littlefish Foundation is a decentralized global organization, the Littlefish Foundation was born out of the Cardano4Climate community [2] to build a DAO that allows funding SDG activities in the field. . Although the word F7 is not sponsored: https://cardano.ideascale.com/c/idea/384063, but they continue to maintain, work on development and creativity to date. F8 proposed to be funded $43,500 from the topic \"\"\"\"Littlefish - Coordinating Action\"\"\"\": https://cardano.ideascale.com/c/idea/404668 . From there, it shows that they are capable enough to build and develop the project on a long, sustainable path. The initial risks are only solvable challenges and obstacles. This shows that this is a Trusted Organization, I fully agree to support this proposal.", "q0r": 5, "q1": "Does the proposal provide a detailed plan, and important milestones, determine the implementation of a specific number of KPIs, clear implementation targets, have a delivery plan... With a prepared plan sheet? carefully, work seriously to create credibility for the evaluation community.\n\nThe proposal has a detailed and properly allocated budget table analysis. All LFF proposals follow the same budget structure. These are made up of module budgets and Action Fund allocations. All modules in this proposal have an hourly staffing rate of $50/hour. The Action Fund allocation is one-quarter of the total budget. The module's operating budget is 1/5 of the personnel budget.\nThe total budget for this proposal of $66,133 is a reasonable amount to implement this proposal.\nIn addition to the revenue from receiving funding from project proposals, there are other sources such as:\n- Income comes from crowdfunding\n- Revenues from a sustainable business model around Future Action\n\nThis proposal is moderated by the working group of the LFF's Organizational Laboratory. These include ChaKhan, Cem Karaca, Emre Kurt, Murat Kasar, Adalat Raimova, Berk Atalay, Engin Gunay, Can Çetiner, and many more. They are technologists, experts in security systems, experts in organization and administration, with many years of experience in research, management, construction, and organizations with specialized knowledge, assign work, and in charge of specific areas of expertise and enthusiasm to work at LFF. Their information can be looked up on the proposal easily through social channels such as LinkedIn, Github...With this competent team, it is enough to complete the project.", "q1r": 5, "q2": "At Littlefish Foundation, all activities are open and transparent as the updates below show that the proposal is prepared in detail, thoughtfully, and with quality to successfully implement the project.\n- Daily activities will be updated on Discord when a system works with NFT: https://discord.com/invite/PKfAsQEhhS\n- Track the number of visitors, average time spent, and more through the Google Analytics channel\"\n\nThe success of the project is demonstrated through\n- Build useful applications for the community to use. The Ikigai model gives users an interesting learning experience. Some other experiments have been done such as Financial tracking of rewards, Actions published on the #action Discord channel, Littlefish Adventures\n- Attracting a strong community of creators and builders: Currently the organization has more than 100 people and this number is growing.\n- Build Littlefish Vault as a knowledge hub for decentralized organizations in Cardano Space. The goal of this proposal is 10000 unique monthly visitors by the end of February 2023.\n- With success, LFF will become a model for other decentralized organizations.\n- The success of this proposal is that Littlefish Vault becomes the Gateway for cooperation\nThe proposal has been and is implementing the criteria for success.\n\nThe proposal is a follow-up from the unfunded F7 and the sponsored F8. At F7, the proposal has not yet been funded, but the organization is continuing to build and develop. The Littlefish Foundation was born with this proposal from the Cardano4Climate community [2. See here: F7: https://cardano.ideascale.com/c/idea/384063\nAt F8 the organization has completed many important steps, they look forward to the proposals in F9 to advance Littlefish's holistic vision.\nF8: https://cardano.ideascale.com/c/idea/404668", "q2r": 5, "assessor": "z_assessor_3181", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11939, "q0": "The proposal targets to make a team consist of organizational researchers. This team will then work together to produce accurate and up-to-date information related to developments, curate it, and conduct further original research on the processes of decentralized organizations. \n\nThe proposal has a very unique target and outputs, enabling collective intelligences based on blockchain technology, thus, adding value to the Cardano ecosystem. The proposal completely detailed and very well written in every section, starting from their background, the main goal, the general definition of the project, and the risk and problem they will face. The proposal try to make the problem visible for everyone, first of all, as the main way of the communication, and then by the research in the project, they will simplify as they highlight the problem encouraging the ideas from other chains to the Catalyst to make them blossom into new project and organization, improving communication and coordination, answering the challenge.", "q0r": 5, "q1": "The proposal has articulated their target of work and quantifiable number of work in specific months in their timeline, resulting in a very precise and informative description on development timeline. The total hours of work and duration also mentioned very specifically for each modules. Worth to mention that they included the diagram of work on reinvention of LFF organization map to simplify the understanding. The budget breakdown is also very well done, broken down in per hour cost and how many hours of each work will be done, yet they even provided the baseline explanation on the budget allocation!! Each person in team has also being provided a very detailed background and experience with also reference to their Github and Linkedin account to support their credibility, in a very detailed description for each of them. They mentioned that they will return for further funding until the action will be developed, making it is reasonably feasible in a short and long term.", "q1r": 5, "q2": "The have mentioned every single of quantifiable measurement on their feasibility support segment, making the project progress and result traceable as they provisioned. The explanation is transparent with every major progress planned to be published on the project website, discord, and open-to-public miro boards. They also mentioned that the data from obsidian (the project’s site) and discord will be accessible and easy to analyze for the community. Every qualitative point of measurement are also included in measuring their success, such as becoming the gateway of collaboration, yet they also included the quanitfiable target such as 1000 monthly visitors.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A dedicated team of organizational researchers, to produce up-to-date information about developments, curate it, and conduct original research on the processes of decentralized organizations. ", "experience": "A growing community of 100+ started in Dec 2021 with a contributor core approaching 20 with highly technical individuals experienced in software development, system administration, plutus development. Extensive experience in entrepreneurship, startups, organization building."}