{"id": 418933, "author": "misterchaos42", "title": "everCrypt DAO|Basic Income Protocol", "url": "https://cardano.ideascale.com/a/dtd/418933-48088", "category": 26598, "amount": 164249, "description": "Climate change & COVID-19 continue to impact populations around the world, compounding existing inequalities & insecurities, while producing new economic, political, social and environmental fissures.", "f6_no_assessments": 8, "f6_rating": 4.625, "videos": [], "media": [], "f6_assessments": [{"id": 3281, "q0": "This deep and wide collection of cross chain contracts and protocols has a real chance of bringing lots of Impact to Cardano, and possibly beyond.  For starters, they are leveraging Milkomeda's EVM bridge to bring over a selection of smart contracts behind protocols such as Frax finance, Curve as well as interoperability with AlphaWallet on EVM.  Within the Cardano ecosystem they are partnered with Proofspace, ClarityDAO, MADAO, Snapbrillia, and on the edge of the ecosystem they are leaning into both Djed for part of the collateral protocol, but also prepping the platform to work with Coti's Adapay.  (And this doesn't even mention their collaboration with Chainlink and things like Truflation for oracle data on chain.)\n\nAll of this infrastructure adds up to a member managed DAO that sets and validates an inflation pegged stablecoin $ECC via a governance token $ECS which creates an investment opportunity (likely a place to \"park\" liquidity, though arbitrage will have its place in the protocol) that rewards all member participants with a nascent \"UBI\" payment or dividend, based only on membership secured by an identity wallet with DIDs.  Scaling the platform in the future is included here with two additional phases beyond the funding sought  here:  Expanding Protocol to add marketplaces, and Feature Rich to add functionality through NFTs and other emergent ecosystem needs.\n\nBecause this proposal aligns perfectly with the challenge's goals of adopting cross-chain processes and tools, as well as collaborating as community with cross chain protocols, and because the proposal indicates multiple areas of impact on Cardano, particularly its Atala identity roadmap and token infrastructure, I rate Impact a full 5 stars.", "q0r": 5, "q1": "The amount of detail included in this proposal is astounding.  From the start we see the proposer's background in the tech industry and the extent of teamwork that is going on to make this effort a success.  While the core team presented here is the founder, collaborations across the Cardano space are noted in Impact above, and digging a little deeper you see tools adopted from ADAO (multi-sig wallet), Chainlink analysis, and GoKey.\n\nThe timeline included on the Miro board is elegant and thorough.  The stages are clearly laid out between MVP (this request for funding) and then two later stages that appear to be contingent on market conditions, where an ICO is intended to be the source of funding beyond fund9.  I really appreciated that even though the project is enormously complex and overlapping, the timeline and deliverables were separated out by this MVP concept to clearly show that this funding is meant to be able to deliver the entirety of the core protocol, while a richer pallete of features and scaling is reserved for future funds.\n\nThe budget is clearly demarcated over the next 12 months and broken down by both an hourly wage in the timeline, and by deliverable.  The proposer has even included cost estimates for the phases beyond this funding phase, indicating a very solid grasp of the big picture for delivery.  \n\nBecause I find that the budget and roadmap that are presented are complete and thorough, and rational consideration has been given to what belongs in the funding proposal and what needs to be left for future funding (as well as the fact that the token sale proposed is a well known method of providing liquidity to projects), and given that the proposer has shown experience and the partnerships are extensive, I am rating Feasibility 5 stars for completeness.", "q1r": 5, "q2": "Because the core buildout is a series of smartcontracts and and a DAO governance protocol to govern them, you would expect to see community structure in place, and that is what you will find at the everCrypt DAO discord server, where tons of documentation and suggestions for onchain oracles, EVM contracts and protocols are already populating the threads.  The founder has also been a regular contributor to Swarm sessions and breakout rooms as he has built connections in the Cardano and Catalyst ecosystem.\n\nFor tracking work it needs to be remembered that as a community protocol, many of the jobs of the build will be part of the community.  The proposer indicates using dework to track task completion (dework is a kanban style management platform with wallet integration for distributed community work in DAOs), as well as Miro and Jira, and all platforms give transparency with the right settings.  Also, not mentioned in the auditability section, is the Snapbrillia partnership, which has a work management/identity component as well, so that should add another layer of tracking and transparency.\n\nFour core deliverables have been included for the first 6 months of the project, and four more are listed for the second phase of 6 months and all are concrete, tangible results that can be measured.  The proposer has included early evidence of work started, in particular the proofspace integration for onboarding users (and this makes sense since community is both a deliverable and the source of future production).\n\nBetween the list of deliverables and the itemized list in the timeline/budget, I believe that this proposal will have a high level of transparency to the community, and plenty of auditable beats that keep time with the monthly reporting, so a full 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}, {"id": 630, "q0": "The main goal of this proposal is to create a so called pseudo-stable token ($ECC) which would basically be a stable coin that would be corrected over time with a forecast of the inflation, based on multiple predictions made by external sources and using oracle solutions like Wolfram and Chainlink. Part of the development of this solution will be done using Frax Finance as a basis, which is a protocal built on Ethereum. The project also wants to include the concept of Universal Basic Income for those who need it, and integrate this with SSI via Atala PRISM, but it’s not clear how the beneficiaries would be selected, for how long, and all the other details. Also, it mentiones that there’s a treasury that will grow over time based on the delegation to multiple DeFi protocals using multisig wallets, and there’s going to be a mechanism for members of the DAO to suggest strategies and to receive bonus if their strategies result in profit for the DAO itself. They also want to include the option of payment in the everCrypt dApp by partnering up with Coti. Overall, this seems to be a very ambitious project, with lots of external sources and potential partnerships, and also using a pseudo-stable, algorithmic (since its based on Frax Finance) stable coin. To create this kind of project and stable coin, usually much more money is necessary than what is being asked in this proposal (~$150k). In general, I believe that if the project is successfull, it would have a greaet impact on the Cardano ecosystem, but the difficulty to implement such a project is considerable. Regarding challenge aligmnent, the project does not directly brings projects from Ethereum to Cardano. It’s actually forking an Ethereum project, doing the necessary modifications and creating a new one in Cardano, which it not exactly what is proposed in the Challenge. The proposer argues that DeFi users would be brought to Cardano if the project is successful, what is related to the Challenge. Therefore, this proposal partially covers the challenge KPIs. And based on the future goals presented here, this could be highly scalable and have a huge impact in the future. The identified proposal challenges are fair, but I believe that others will also exist that were not mapped, regarding the execution itself, as mentioned previously. Overall, due to the proposal’s complexity, partially alignment with the Challenge, the amount of work that would have to be done for it to be successful, I am not comfortable with giving a very high impact score to it, so I’m rating it with 3.", "q0r": 3, "q1": "The proposer of this project is Abhiroop Sharma, he shared his LinkedIn and his information is verifiable. Although, he’s going to be the manager of this project, and not the executer, and there is no one else besides him mentioned in the proposal, which makes us believe there the team to execute it is not yet assembled, or at least contacted. It would be better to know who, or which 3rd party, is going to execute each part of the proposal. Also, since this information is missing, even though the hours of each task are included, the number of participants in the proposal itself seems to be not known. The budget is broken down per activity, but there seems to be only estimates without much explanation, for example, in phase 2: Community: 150h/$15k, but it does not explain where the 150h come from, what’s the rationale behind it. It is mentioned in the proposal that only the first 2 phases are included in the proposal, which seems more resonable regarding the budget requested, and they mention that there’ll be an ICO after phase 2. This budget seem to be ok for delivering the MVP, even though details are missing about its cost. Due to the complexity of the proposal, I’d like to see some more details about the execution, instead of just milestons for phases 1 and 2, because in order to know if the proposer is able to execute everything, we also need to know if he’s capable of even planning in details. The timeline for the execution seems to be ok, but since the team is not ready to start execution as soon as possible, we cannot be certain the it will be followed. The proposer describes the technology on which its development will be based and how it will do it, which is a good sign. Overall, I’d say that I neither agree nor disagree that this proposal is feasible.", "q1r": 3, "q2": "The proposer adds 4 milestones for each of the phases, and proposes to use them to keep track of the progress of the proposal. This is not ideal, since only after 6 months of funding, the community would be updated regarding the progress of the proposal, and by the time, $75k would already have been payed by the treasury to the proposer. The same happens to the second phase, 6 more months until new milestones could be verified. Ideally, the proposer should include monthly verifiable milestones or KPIs, since the reports to the Catalyst community are based on this pace. The success definition of the project is good, even though it doesn’t cover everything that’s being proposed to be developed, and some of the items included here are not going to be verifiable until after the proposal is closed-out, for e.g., “1. Achieve a TVL of $50 Million USD by end of 2nd year of mainnet launch”. The information regarding auditability of the proposal is ok, but some modifications based on the comments above could be made to improve it in case of a future ressubmission.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1, "reply": "The review is unnecessarily harsh on all 3 key metrics. The proposal is not looking to re-invent the wheel and the collaboration index is very high. Please read section \"Lego-Blocks\" https://docs.evercrypt.org/ . The community should be built out only after funding is secured so as to not mislead anyone.  Please join our discord and lets chat!\n--Proposer"}, {"id": 1212, "q0": "This is an idea proposal for a statistical tool to measure the relative inflation of world finance. Mobile apps, and using an economic inflation-pegged token. This is a great idea, but in my opinion it should be placed in the \"Dapps, Products & Integrations\" challenge rather than \"The Great Migration (from Ethereum)\".\nThe visual presentation is very insightful and easy to understand for the reader, which is a plus for this project. Because it shows that he is seriously invested in understanding the problems he is dealing with and having clear solutions to them.\nAlso he mentioned collaborating and getting market data through some oracle projects like Wolfram Alpha and Chainlink.\nHe also has a good grasp of the financial information presented in the presentation. So I still decided to give the maximum score in this section.", "q0r": 5, "q1": "I was impressed with their presentation of the work plan with attached images and clearly divided phases with a reasonable workload. What is rarely seen in the remaining projects. Basically, there will be 3 main phases: finalizing the product, testnet and mainnet, expanding the user market. I agree with this process because they presented the work in great detail and quantified the work.\nRegarding the budget, they also divide each task with the number of hours to make each task clear. That was enough for me to charge them an extra plus.\nIt's a pity for them that the group member's profile is not fully presented here; otherwise I would have given the maximum score.", "q1r": 4, "q2": "Dework.xyz, Miro, and Jira are tools they refer to as tools for managing and tracking work. To me these tools are clear enough for the community to be able to track their progress.\nAnd in this section, they have set numerical goals that they want to achieve specifically: 100k discord members within 3 months, TVL reach 50 million USD by the end of year 2 after mainnet.\nAlong with that is the commitment to create synchronous applications on mobile devices and web3.\nThis presentation is basically consistent with the entire content of the 2 sections above and is clear enough to convince me to give the maximum score.", "q2r": 5, "assessor": "z_assessor_2217", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}, {"id": 2839, "q0": "“Since this is an idea that is already on the Ethereum ecosystem and this proposal brings it over to Cardano it fits the requirements of this challenge, the problem the team brought with this proposal is because of the impact from nature, so the prices of goods are increasing rapidly, in general, macroeconomic related to inflation.\n  I can assure you that you spent a lot of time on the presentation of this proposal as it is very detailed indeed with well documented examples easy to understand the methods the proposal will provide using the protocols for Defi. Reading this presentation from the team recommended me as an adventure into the exciting world of technology.\n  it is really perfect from the presentation that will adopt protocols like Frax Finance on Ethereum in action and especially will develop it on the Milkomeda platform,\n   *the main purpose of this proposal would be to provide the community with a Defi protocol to track the release and issuance of FPI/FPIS token pairs on Milkomeda, to test and curb inflation the examples given are very close to reality as proposals funded in ADA coins can thus remain in value during the implementation of the proposal without worrying about the depreciation of the coin during the implementation period and affecting the Unnecessary lack of funds. The ambition and vision of this proposal will put the benefits of this protocol into practice with mobile applications for payments in partnership with the COTI payment platform.\n  Many risks have been proposed to anticipate and mitigate against them. I hope this proposal will set the stage for larger migrations, looking forward to seeing a lot of proposals like this on the Cardano ecosystem. \"", "q0r": 5, "q1": "“I completely agree with the detailed roadmap presented by the proposed team, it is really meticulous and logical, and will score high on this feasibility when I see the cooperation with other organizations. The proposal team's organization provided evidence with the links * with the budget details are also very detailed and specific to each small amount, but is the average hourly payment milestone $100 / 1 hour is not it because this statement has not been seen yet, and there may be holes in the implementation process that need to be fixed, so the extension of the completion time can also happen so it is very necessary to have a backup for technical problems, * currently the proposed developer is developing alone it is Mr. Abhiroop Sharma and will hire engineers as soon as funding is received, because using popular protocol like Solidity should it would be very easy to hire an engineer who is knowledgeable about it.\"", "q1r": 5, "q2": "\"This proposal will get funding from the ICO to continue developing for the future proposal so there will be no need to return to the Cattalyst fund I appreciate this option,\n   there are a lot of progress and success metrics so the community can check them out but if possible the team recommends considering writing a phased report which would be great for transparency\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}, {"id": 8020, "q0": "The presentation of the problem is described in detail, together with the day-to-day problems. The aim is to reduce existing inequalities and uncertainties while addressing the new economic, political, social rifts. This problem can be solved by a Defi protocol that approximates inflation using a token associated with it. Profits from protocol activities will be communicated to certified participants. A well-developed schematic presentation has been included in which the content of the proposed solution is very clearly described. It will certainly impact the Cardano ecosystem as everyone needs transparency in the face of rising inflation. The makers of the proposal have offered a clear solution on how the proposed solution will be handled. Platforms will be used to reduce the given risks (ProofSpace, Snapbrilla,...).\nDoing this will make it easier to tackle the challenges ahead. This project will receive support from different angles. The risks have been clearly reviewed and included in the proposal. The aim of this project is to provide as much transparency as possible to the people.", "q0r": 5, "q1": "The proposer has included his relevant experience along with his linkedin (Abhiroop Sharma). The makers of the proposal are still looking for interested community members. The link of their discord has been communicated. The budget is very clearly defined. Work will be done in different phases. Hourly wages are also clearly included in the proposal. It has also been indicated that there will be several collaborations to ensure that the project is properly executed. The budget is certainly sufficient to finance the project. No additional financing is required. The intent in phase 2 is to help start up the treasury and deal with development costs after MVP. A realistic timetable has been provided for the work to be completed. Many milestones have been included in this. The intention is to go live after 6 months. During phase 2, the aim is to already implement the project and remove the errors. Here the project will be tested. In phase 3, the aim is to expand the ecosystem (6 - 12 months). The plan clearly states the resources needed to implement the proposal. The technical aspects are included in the roadmap, together with a DAO roadmap. The risks are included. It is clearly recorded that this project does not have the same project flaws as the Terra ecosystem. As a result of this incident, many people have lost confidence in similar projects. It is good that the petitioner strives for transparency for the community as much as possible.", "q1r": 5, "q2": "A very extensive roadmap has been included with clear milestones for the realization of this project. The submitter offers a lot of transparency about how everything will go down in detail. KPIs are clearly included for each phase to measure success. These are all clearly measurable. The creator of the proposal has a clear vision of what success looks like in his eyes. I think you can aim higher than 1000+ members. I'd rather go have about 10,000 members. The description of the intended problem is very clearly included. The solution that is offered is described in great detail. You can follow in detail how everything will happen. This proposal will certainly be a good solution to the problem. I therefore very much hope that this proposal will be financed.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}, {"id": 9026, "q0": "This proposal has could really increase the Cardano users through creating an incentive for people below the poverty line to receive a free universal basic income. Additionally, the token pegged to the consumer price index would be incredibly valuable. This would function like a stable-coin, but instead of being pegged to a US dollar which varies in relative value (inflation/deflation changes the cost of milk), it would be pegged to a variable cost of living index based upon multiple resources. This has the ability to absolutely transform how people see money by doing things that blockchain is really good at. Overall, the impact of this proposal would be huge for Cardano. Also, this proposal would also further the goals of cross-chain collaboration through strategic partnerships with projects developing on Cardano and other EVM based chains. Utilizing projects like ProofSpace, Snapbrilla, Gokey, etc would increase collaboration ecosystem wide. I think this proposal is one of the most-detailed I have seen.", "q0r": 5, "q1": "This proposal has four Phases and a 2+year timeline that far exceeds the scope of Fund 10. However, it's clear they are seeking funding for only the first two phases, Phase 1, and Phase 2. These two would take a year. After that they are planning on seeking no further funding, instead relying upon the growth of the token system in the first year of development, and an ICO at the end. This roadmap is incredibly detailed, especially for the first year, and the budget breakdown is reasonable and appropriate for the amount of work they are planning on doing.  The plan to take advantage of existing frameworks, using crowdsourced labor, and developing a governance DAO means that the proposal team can be small, but still be functional. These reasons all taken together lead me to be very optimistic that this proposal can succeed.", "q1r": 5, "q2": "There are clear and transparent metrics for the project. This includes public testing of the coins. There is also an existing discord server with an active community. There are also plans for developing a public governance system. These are both signs of an open project with clear public auditability. The proposer has put serious effort into the proposal and has made clear steps to ensure this proposal can be approved. There is sufficient detail and transparency to assume this project will be successful so far as the team is involved. There is clear effort put into every section of the proposal and in my mind I think this should be approved and funded this round. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}, {"id": 11357, "q0": "The issue raised by the proponents is that Climate Change & COVID-19 continue to impact populations around the world, increasing existing inequalities and insecurity, and creating new rifts. economic, political, social and environmental.\nthe creation of a Defi protocol that tracks approximate inflation using an economic inflation pegged token, sharing the profits from the protocol operation with SSI certified participants through a mobile wallet is Fit.\n \nThe proposed solution is to outline a pseudo-stable reserve currency protocol that will be pegged to the Consumer Price Index through on-chain exams.\nThe DAO will be open source and a non-profit organization that creates social justice.\nThe creation of a “false-stable reserve currency” could stave off inflation while providing those in need a potential source of basic income.\nThe core protocol will be built on the Milkomeda C1 sidechain\nUsing Milkomeda will make transaction costs lower, high throughput, faster processing speed than building directly on Cardano L1.\nIn addition, it also significantly reduces the cost and time required to build the initial MVP.\nProposal to provide sufficient images and stakeholders to implement the project.\nThe special feature of the project is that everCrypt DAO promotes a dual token model, two distinct tokens with overlapping interests, each supporting the ultimate goal of everCrypt DAO.\n$ECC token is a price-of-living token intended to limit inflation and enable long-term predictability and interoperability of participants.\nThe proposal also includes specific examples to make it easy for readers to understand how ECC tokens work.\nThe proposal introduces two important risks: Third-party risks,\nRegulatory risk. and the solution they offer to overcome the risk is appropriate.", "q0r": 5, "q1": "The proposed implementation schedule is provided by the proponent with a plan to perform specific items with image files, links.\n\nThe implementation roadmaps are divided according to the timelines of each stage:\nPhase 1: Implement core protocol, Implement ProofSpace, Implement basic DAO governance, Audit, Certification & KYC, Legal procedures.\nPhase 2: Fix bugs and improve user experience based on testnet feedback.\nInitial Coin Offering for $ECS\nMainnet Release at the end of Phase 2\neverCrypt mobile wallet launch\nPhase 3: Expanding the protocol ecosystem, Improving mobile app features\nPartnership with Payment Service Providers.\nBuild a decentralized exchange.\nStage 4: issuing NFT bonds, lending/borrowing using bonds as collateral.\nLow-interest micro-lending with partial (or no) collateral to UBI holders using the wallet's reputation mechanism.\nFurther decentralization of governance\nAutomate each part of the Treasury in the cross-chain,\nIncubate other projects that align with everCrypt's philosophy and mission. Help other projects get funded and share the value created with everCrypt participants.\nExpand to developed countries.\nThe budget is properly allocated through each project implementation stage.\nThe project implementation team is experienced in the following fields: Abhiroop Sharma - Founder / Product Owner\n\nWhat I need to pay more attention to here is that the identities, images, and profiles of the participants need to be made public and transparent so that the readers of the project can verify it. In addition to the member being Abhiroop Sharma, there are other members involved. who is implementing the project and has not been made public.\nIn addition to the members participating in the above project, does the project implementer have a policy to recruit more human resources from the community and what are the criteria for selecting suitable human resources for the project. important for the community to assess the success of the proposal.", "q1r": 4, "q2": "project owner success is to ensure equal opportunity and reduce inequalities in outcomes, including by eliminating discriminatory laws, policies and practices and promoting appropriate laws, policies and actions. appropriate in this regard.\nImprove regulation and supervision of global financial markets and institutions and strengthen their implementation\nstrengthen representation and voice for developing countries in decision-making in global international financial and economic organizations.\nFacilitate orderly, safe, regular and responsible migration and movement of people, including through the implementation of well-managed and planned migration policies\n\nEncourage financial flows and official development assistance, including foreign direct investment, to Countries with greatest need.\nBy 2030, reduce the transaction costs of remittances to less than 3% and eliminate remittance corridors that cost more than 5%.\nKPIs are given to perform the appropriate levels in accordance with the successful progress of the project.\nWebsites, links, social networking sites so that the community can track the implementation and success of the project are publicly transparent and easily accessible.\nThis is a new project, but with careful preparation and specific plans, it can be expanded.\n This proposal fits the challenge perfectly.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}, {"id": 11457, "q0": "After reading thoroughly the project, I think this is a great idea of the proposer to create a Defi Protocol which tracks approximate inflation using an economic inflation-pegged token and to share profits from protocol activity with credentialed participants via a mobile wallet. I was impressed by good presentation, deep analysis with reference link and detailed technical solution explanation of the proposer. Also, the main token ($ECC) will be pegged to economic inflation data from on-chain oracles like Wolfram Alpha and Chainlink. The proposer is working with ProofSpace to provide the identity layer with eventual Atala Prism backend. From what the proposer shows, I think he understands of the macro economy, know exactly what he is doing and what he need to working with or partnerships to utilize the resources and maximize the effectiveness and efficiency of the project. I think having this financial tool is very useful especially in this current volatile econonic situation. ", "q0r": 5, "q1": "The detailed plan for the everCrypt project is illustrated clearly and visually by the proposer which makes it much more easier for community. The plan is devided in to each phrase with 6 months for each cycle with reasonable amount of work and exact timeline or milestone. Besides having plan for developing their project, they also has clear plan for partnerships for the long-term development of everCrypt. Regarding the budget, it is clearly calculated for each job by the proposer and it is very clear how the money will be used. The cost is estimated based on a rate of hours in which $100/ hour for builders and $50/ hour for supporters. For personnels, I find that the proposer is very experienced with his strong background in the field to successfully carry out this project. It is good that the proposer has Discord channel for interested community members and hiring system SnapBrilla. However, this is a big project, therefore, for the long-term development, this project needs to recruit more qualified team members for completing this project. ", "q1r": 4, "q2": "Dework.xyz tool will be used to manage and keep track of each main task for each phrase in the project. I think this is a very good tool like Miro and Jira for checking project development. Moreover, clear KPIs is set for each main goal for each phrase such as the launch of Defi protocol testnet, mobile app, 10,000 app downloads, 1,000+ active member on Discord,....After all, the goals are consistent throughout the project. I support this project and hope it could get funded. ", "q2r": 5, "assessor": "z_assessor_3246", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for the detailed feedback, please join our discord and help me make this a reality for us all.\n--Proposer"}], "solution": "Create a Defi Protocol which tracks approximate inflation using an economic inflation-pegged token, sharing the profits from protocol activity with SSI credentialed participants via a mobile wallet.", "experience": "15 years in Web2, this includes 6 years at Instacart as a Solutions Architect, over the last year I have been spending time learning about Cardano, meeting the community and partnering with multiple sister projects in Project Catalyst\nhttps://www.linkedin.com/in/abhiroop-sharma/"}