{"id": 419397, "author": "rootsid", "title": "KERI bridge for Cardano", "url": "https://cardano.ideascale.com/a/dtd/419397-48088", "category": 26598, "amount": 16000, "description": "KERI is a breakthrough technology considered to be the first truly decentralized identity system that is ledger-portable. Can Cardano be the first KERI Witness network on a major blockchain?", "f6_no_assessments": 8, "f6_rating": 4.916666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 64, "q0": "The proposer has provided a clear description of the issue they are trying to solve: KERI, a decentralized identity system that is ledger-portable doesn't exist on Cardano.\n\nAs a solution to the problem, the proposer offers to develop the first implementation of a witness for key event logs, making Cardano a secondary root of trust.\n\nThe problem statement defines a problem within the challenge which needs to be solved. The proposal is likely to have a positive impact on the Cardano ecosystem, making Cardano the first blockchain to operate a KERI Witness network. While bringing new exciting technologies to Cardano should be welcomed, it is, however, difficult to know the size of the target audience and how many users will end up using the solution. Finally, note that the bridge is a proof of concept, not production. Additional funding will be required.\n\nI think this proposal addresses the challenge effectively. 4/5.", "q0r": 5, "q1": "The proposers provided a short description of who will work on the project, Rodolfo Miranda and Lance Byrd, including their roles, experiences, and past work. They have Cardano/Catalyst/Atala Prism qualifications and have successfully completed past Catalyst proposals in FUND 6 to 8. There is therefore complete confidence that the team can bring this proposal to term. They will be supported by the creator of KERI, Sam Smith, Ph.D. \n\nThe budget is outlined clearly and broken down into identifiable items (Research Technology, Deploy KERI agent, Develop PoC, documentation). Additional funding is required to bring the proposal to production. The budget (16K$) and the timetable (3 months) seem to be reasonable to achieve the set goals. The proposer provided a detailed roadmap for this proposal as well as a list of actionable tasks to complete. Given the experience and plan presented, it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal provided a clear and detailed roadmap and a time horizon for achievement (3 months to understand the tech and build a POC). The KPIs that define the success of the proposal are presented and make sense but it would have been nice to see the following KPIs: number of KERI projects reached out to and attracted to Cardano. The plan presented however is sufficient for the community to track the progress of the proposal. I rate auditability a 5/5.", "q2r": 5, "assessor": "z_assessor_2040", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"id": 500, "q0": "I've been following KERI for a while and I'm glad to finally see it maybe coming to Cardano. The ability to have identities not tied to Cardano speaks directly to the challenge brief. The proposal solution is detailed, easy to follow, and reason. The 1,2,3 plan to understand, familiarized, and proof of concept is a sign of a mature team familiar with working with pioneering technology. \n\nThe proposal so draws a clear-ish line between its solution and the challenge ask.", "q0r": 5, "q1": "There is a clear and detailed milestone and timeline spanning surprisingly 3 short months provided. The work is broken up in two 4  discreet tasks with high-level scope of what each task entails (kudos). \n\nThe budget is reasonable and simple with line items for each for aforementioned 4 tasks. \n\nThe team is a well known for pioneering within the identity space in the community. They are one of two teams I can think of that I would hire for this proposal. \n\nFive stars all around. ", "q1r": 5, "q2": "The proposal has details about how they plan to manage the work internally. The code will be open source so the community will also be able to follow along there. would have love to see how the team plans to update the non-technical community on the progress of the research, coding, etc. Will there be medium or twitter posts? discord channels? It is a super short project so perhaps just delivering and shipping the thing on schedule is enough. \n\nThe proposal has four definition of success that is easy easy to publicly audit. Would have love to see it explicitly tied back to the challenge brief's definition of success.", "q2r": 5, "assessor": "z_assessor_2098", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1381, "q0": "Yes, this proposal effectively addresses the challenge by creating a safe and secure way for individuals to verify their legal identities in transactions, not just for Cardano, but that can work with any blockchain. This is the truest sense of interoperability: when the user can seamlessly move between chains unbeknownst to them. Integrating the Key Event Receipt Infrastructure (KERI) into the RootsWallet will allow users to remove the need for useless middlemen and replace it with the blockchain. As witnesses are required for many different types of transactions, having a constant and stable source to use at all times is likely a huge relief. \n\nThis ease of interoperability also will provide an onboarding ramp to users who may be using KERI but not on Cardano. By marrying these two technologies, there may be an abundance of use cases that have not yet been explored, such as in the DeFi space. ", "q0r": 5, "q1": "The team at RootsWallet continue to deliver, and given their experience and the plan presented here, it is highly likely this proposal will be implemented successfully. \n\nThe RootsWallet team have a vision and do an excellent job at laying out. Since their first successful proposal in Fund 6, the team has continued to deliver on each of their proposals. They are truly standing out as the go-to identity wallet on Cardano. The team has a dynamite roster of individuals with the expertise to follow through on their promises. \n\nThe team also does an excellent job at laying out the exact steps they need to complete the project and request a modest budget for completion. Should the team be able to deliver what is laid out at the budget requested, it may just be the catalyst to broader blockchain interoperability through identity. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The RootsWallet is an open sourced project and the team provides constant commits and updates via github. The integration of the KERI feature will also be conducted in this fashion. \n\nThis open-by-default approach is very welcome and can give voters confidence that the team is open to constructive criticism. The team also has a good track record of reporting on their progress and is likely to continue doing so. \n\nSome of the success goals are likely too lofty and not achievable through this project (i.e. make Cardano the principal registry and resolver of KERI identifiers) but I respect their ambition. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1744, "q0": "The problem statement matches the spirit of the challenge, though if rewriting, consider simply stating the problem and educating voters later in the proposal. Something beginning with the following would suffice: \"No blockchain has become a witness network for KERI as of yet. If another blockchain is first, they will play the role Cardano could...\" This is the rationale of 4 stars.\n\nThe project positively impacts the Cardano ecosystem and certainly opens doors and creates pathways toward various types of cross-chain collaborations in the future. Their close work with the creator of KERI assures an almost definite finish for the team, and no significant risk of not finishing seems relevant.\n\nThe portability of trusted data that this challenge focuses on would, if the team is successful, allow for many potential cross-chain collaborations and is thus, \"in the spirit\" of the KPIs of the Cross-Chain Collaboration Challenge.\n\nThere is a plan to scale and build consecutive versions in the future. The proposal covers a \"proof of concept\" first that would require further resources from a future fund to be implemented.", "q0r": 4, "q1": "The 3 months allotted seems reasonable and within the team's capacity. The necessary experience is evident in the knowledge/history provided about the two on the team, Rodolfo and Lance. They have been working on learning more about KERI for quite some time, and with the aid of KERI's creator in their working meetings, it seems they have a solid plan.\n\nThe budget is quite fair, given the unique skills and abilities necessary for implementing and building this proof of concept. Developers in far more common fields are asking twice or more per hour. There is a commitment to be good stewards of Catalyst resources. This only adds to voter and community confidence.\n\nThe proposer has not mentioned what they will do if additional funding is needed. Perhaps a 10% contingency could be added if rewriting in the future, or the team could mention any reserves they currently have for such situations.\n\nThe plan is given a high-level overview and broken down slightly. It is clear that after doing the actionable tasks of initial research, the next step is to deploy a KERI agent and \"play\" with it to see what it does, how it works, and essentially learn. Voters can see from the plan an obvious indication of the clarity and thoroughness of the team.\n\nVoters benefit from the resources necessary, both financially and otherwise, fully explained. The required technical aspects are available through the 140-page whitepaper for KERI and the weekly working group mentioned.\n\nAs far as risks are concerned, the depth of the 140 whitepaper is mitigated by the weekly meetings mentioned in the previous paragraph.", "q1r": 5, "q2": "The \"high-level scope\" offered in the detailed plan section (in Feasibility) serves as the team's only roadmap. Given the nature of the work and the unknowns on this end, it makes sense that they have significant tasks to accomplish and will find the deeper details as they move forward with the work. The milestones and time horizon are achievable as described in Feasibility.\n\nThe addition of a roadmap to Auditability would help with further transparency. It may feel Redundant, but the added clarity for the sake of voters is always a priority. This is the only reason this section will be scored 4 stars.\n\nAs mentioned in the past section, the community will be able to keep pace with the team as they update their Github repo as they are working on the 3-month project.\n", "q2r": 4, "assessor": "z_assessor_2261", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2083, "q0": "The problem is that KERI is a breakthrough technology considered to be the first truly decentralized identity system that is ledger-portable. Can Cardano be the first KERI Witness network on a major blockchain? Key Event Receipt Infrastructure ( KERI ) is the first truly decentralized identity system (https://keri.one/). Based on a log of self-confirmed cryptographic key events, it creates a decentralized secure root of trust that does not need a ledger or moreover a portable ledger which means its identifiers are not locked with any given blockchain and are switchable as needed. In other words, the KERI identifier is indeed portable. It is therefore considered a breakthrough technology being applied in major projects such as the Global Legal Identity Organization (GLEIF), which works with partners to grant millions of unique identities to legal entities participants in financial transactions around the world. This project is about implementing a bridge between KERI and Cardano event logs to act as a Witness in each transaction. Activities require two main activities:\n-Understand technology (with paper)\n-Familiar with available implementations\n-Develop a proof-of-concept bridge component into the Cardano blockchain. Code will be Open Source\nRootsID will work closely with the team behind KERI to develop the first witness implementation for key event logs, making Cardano a secondary source of trust.", "q0r": 5, "q1": "About the roadmap, the Team outlines a roadmap with clear goals that can be achieved in each phase. In each phase, the team provided the community with a detailed explanation of the plans. The action to be taken, is the project completion time within 3 months The author also determined that the product delivered after 3 months is:\n-Open source on Github repo\n-Documentation with the final conclusion\nNext is the budget, the proposal asks for $16,000. In my view, the budget is well calculated (calculated according to the roadmap), breaks down, and explains the activities performed and the number of hours to do them, and the hourly rate (compared to other projects, the salary seems to be a bit higher, but I can't judge that as a moderate or exorbitant number, because it depends on their area of ​​work), overall the team helped us understand what each part of the proposal entails and the costs involved.\nAnd finally, regarding the project team, in my opinion, this team is highly qualified and capable of successfully implementing the project. Behind the project is the RootsID team (this is a group with a lot of contributions to the Cardano ecosystem https://www.rootsid.com/team) and 2 members Rodolfo Miranda, and Lance Byrd we have a lot of information about surnames like Their names, we also have their background, with their expertise explained, what projects they have developed so far, how they relate to Cardano, their affiliate profile. So we have a lot of confidence in them.", "q1r": 5, "q2": "Great auditability, the team defines in great detail what success looks like, so we have a lot of content to keep an eye on. In addition, we can go further in monitoring because they also detail how the phases should be, that is, we know what will happen and when we can check that everything is happening as promised. The roadmap is very well designed, with deliverables/milestones that make the progress of the project easier to track. The metrics and KPIs are well-chosen and I believe they are good indicators of success. Besides, this team applies Agile methodology based on tools provided by Github. Besides progress reports, progress will be tracked by public Github issues, and project views (like Kanban boards) so in my opinion, this section is very transparent.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5016, "q0": "KERI stands for Key Event Receipt Infrastructure. This is a technology that provides secure identities to individuals and is chain agnostic. These identities created can be moved from one chain to another while keeping them cryptographically secure. The proposers want to research and develop a bridge for KERI event logs to act as a witness on each transaction on Cardano. This is the first step in adopting a new technology onto Cardano. I believe this is highly impactful and hence a rating of five has been awarded for the impact section. \n", "q0r": 5, "q1": "The key milestones in the implementation process starts with a deep-dive research into the KERI infrastructure. The next step is to deploy the KERI agent and lastly develop a bridge as Proof of Concept. This proposal doesn’t just promise to create a KERI bridge for Cardano but also provides documentation for other projects to be able to do the same. The feasibility is straightforward and hence, a rating of five has been awarded for the section.\n", "q1r": 5, "q2": "The audibility depends on the open-source development of the KERI bridge to Cardano and the documentation provided. These are open for the community to check on the Github link provided in the proposal’s auditability section. Along with that Github issues, project views, and commits would be considered key performance indicators. Based on the information provided, the auditability is clear and hence a rating of five has been awarded for this section. \n", "q2r": 5, "assessor": "z_assessor_2663", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6126, "q0": "The author of the proposal raised the issue: KERI is a breakthrough technology that is considered the first truly decentralized identity system that can be moved on the ledger. Cardano could be the first KERI Witness network on a major blockchain. RootsID will work closely , with the team behind KERI , to make Cardano a secondary source of trust . The proposal impacts the challenge posed and is described in detail and is easy to understand. KERI: is the first truly decentralized identification system, a breakthrough technology, being applied in major projects such as: Global Legal Identity Organization (GLEIF). The blockchain acts as a witness providing an independent source of trust in addition to the controller. The first person to implement it will become the de facto trustee for anyone implementing KERI. This project is about implementing a bridge between KERI and Cardano event logs. That portability is a big step forward for cross-chain collaboration, which in my opinion fits the challenge. Besides, the author also realizes that the main challenge of the project is: KERI is a complex cryptographic protocol and ecosystem of service roles. Along with that challenge, the author has a positive solution to reduce risks when the project is implemented.", "q0r": 5, "q1": "About the plan of the proposal. The author provides us with the necessary information to evaluate this section. The first is about the route. The author analyzes the main tasks that need to be done, which are distributed by week. Next, the author explained each job that needs to be done to achieve the goal of the job. As I understand, the workflow is arranged in 3 months. Finally, the author provides about the products to be delivered which are: Open source code on Github repo; Document with final conclusions and next steps. Along with the set roadmap, the author provides a budget table, which is allocated according to the work to be done in the project. The requested budget is $16,000. And specifically analyzed include: hours of research, and development, at the rate: $100/hour. Funding for jobs is clearly and transparently analyzed. Finally, about the team of team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides a text presentation about each member, and attaches a link to let us know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is transparent and the members are skilled and experienced, increasing the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "Proposals provide us with a lot of information to measure the progress and success of the project. We can track in many ways: open source on GitHub repository, public RootsID. Also apply Agile methodology based on tools provided by Github. In addition, report and track by public Github issues, project views (like Kanban boards) and commits. Intermediate progress will be reported as Sprint Burndown. In other words, we know what to expect and how successful, and what value it will bring to the community. The final product is what is expected, the success of this project. It is this technology that opens the door to more opportunities in Cardano. Provide the first bridge for KERI, in a blockchain. Attract other projects, building on KERI; Cardano: primary registration and resolution, of KERI identifiers. Since we are provided with a lot of information, I believe that information is complete and satisfactory has been established. This is a new project, however, from the plan table, the team's ability and efforts in the proposal are shown. Specific roadmap, transparent budget. Proposals are auditable well and continuously.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7689, "q0": "This idea meets the challenge. KERI being a revolutionary technology based on a decentralized and portable identity system, its association with Cardano KERI Witness on a blockchain is a wish for a significant impact and thus increasing knowledge of the Blockchain throughout the KERI network. Putting RootsID behind KERI to develop the first implementation of a witness for key event logs, making Cardano a secondary root of trust meets the challenge given that this association did not exist.", "q0r": 5, "q1": "The experience of the members proves the execution of this project given that they have had to work on it in the past and already have RootsID which is a group of expert Cardano/Catalyst/Atala Prism/Aries SSI developers aiming to build an open source identity ecosystem on Cardano. having also collaborated with KERI groups it is possible to unite how these two communities and innovative ecosystems for the benefit of Cardano Catalyst. it should be noted that the plan provided is reasonable, as short as possible and has a flawless execution within the 3 months proposed.", "q1r": 5, "q2": "The information provided seems to be reliable and will allow follow-up given that the proposers have provided the relevant links to rootsid, Keri-resources, their GitHub and link to their Youtube channel with the monthly reports, these platforms will allow follow-up execution or implementation of the solution. Proponents challenge themselves to include KERI functionality in several of our open source projects that have been designed for the Cardano community and monitoring of the latter is possible thanks to the open source code on the public GitHub repository RootsID. ", "q2r": 5, "assessor": "z_assessor_2915", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "RootsID will work closely with the team behind KERI to develop the first implementation of a witness for key event logs, making Cardano a secondary root of trust.", "experience": "RootsID is a group of expert Cardano/Catalyst/Atala Prism/Aries SSI developers building an open source identity ecosystem on Cardano. We have been engaging with KERI working groups and are excited to research how to bring these two innovative communities and ecosystems together."}