{"id": 419387, "author": "rootsid", "title": "RootsWallet - Aries JS", "url": "https://cardano.ideascale.com/a/dtd/419387-48088", "category": 26598, "amount": 21000, "description": "Hyperledger Aires is the most adopted framework for Identity projects. RootsID already delivered backend agents based on it, however RootsWallet, our mobile identity wallet, does not support it yet.", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 499, "q0": "This is an excellent idea and an excellent solution to the challenge ask. Proposals wants to integrate  a javascript library (Aries Js) into the RootsWallet, allowing Cardano DApps that make use of identities to understand identities from other chains. The implication for this in the gaming and other industry is huge. \n\nThe proposal provides a detail solution with easy to follow list of features (and capability) to be provided. The proposal provides spells out it's impact to the Cardano community and ties directly back to the challenge ask. ", "q0r": 5, "q1": "The proposal provides detailed milestone and timeline with a total duration of 3 months. There's high-level details about of each \"activity\" or milestone. \n\nThe budget seems reasonable with line item detailed of broken down costs.  The team already has lots of experience in the identity and SSI space, deliver 5 related proposals to date and 7 more in development. Given short time span of this proposal, the pace at which previous proposals were completed, I don't believe their current workload will negatively affect their ability to deliver this proposal in the proposed 3 months. \n\nFive stars all around!", "q1r": 5, "q2": "As this is a software product, the deliverables are clear. The team plans to use agile, a method of project management, to manage their work internally. The community will be able to follow along via github issue boards. The proposal definition of success speaks directly to the project success indicators and key metrics. \n\nFive stars all around!", "q2r": 5, "assessor": "z_assessor_2098", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "We appreciate your review!"}, {"id": 992, "q0": "I honestly believe that this proposal will bring great impact for the Atala PRISM developers/users as RootsWallet could interoperate with Hyperledger Aries as the most adopted framework for Self-Soverereign Identity (SSI) project. In addition, this proposal is aligned with the key metrics from the cross-chain collaboration challenge setting that is making expansion of Cardano-based projects into other chains (in this case, RootsWallet is Cardano-based project that will be expanded so it could operate with Hyperledger Aries). This is according to cross-chain collaboration is about, that is to create new connections between Cardano and different blockchain. And of course, in the future this RootsWallet could be integrated with other chain/framework to increase the interoperability if needed. Taking everything into consideration, I give 5 stars for the impact.", "q0r": 5, "q1": "In terms of experiences with Atala PRISM & Self-Sovereign Identity (SSI), I think RootsID team is one of the most active team in Cardano community that brings lots of benefit to this field. One of their projects is this RootsWallet that is funded since Fund 7 alongside with another project such as WAL-CLI, which is already completed & delivered. Furthermore, I know these guys from Atala PRISM Pioneer 1st cohort, and they are active to promote Cardano in global SSI meetings. So, I believe that they could deliver the project if funded. Equally important is the budget for the development that they requested is clearly defined in the proposal. All things considered; I give 5 stars for the feasibility.", "q1r": 5, "q2": "To start with, let’s take a look on the roadmap & milestones. RootsID team defined the work for total 3 months. During this period, they will build Aries library into the RootsWallet code plus doing integration, testing, and documentation. As this project is open-source, the community could track the project progress via their GitHub(https://github.com/roots-id) and also check their Sprint burndown chart. Last but not least, they included also clear description of solution to address the challenge that they would like to solve via this project in the proposal. To sum up, I give 5 stars for the auditability.", "q2r": 5, "assessor": "z_assessor_2174", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for your review and encouragement :)"}, {"id": 1380, "q0": "Yes, this proposal effectively addresses the challenge as it focuses on interoperability between SSI systems and Cardano. The RootsWallet Team has put forward an innovative and exciting digital identity wallet and now plans to integrate Aries Framework JavaScript into RootsWallet. This is exciting as the Aries JS is a major framework for building SSI solutions that is already being implemented by a variety of different groups and sectors. \n\nBy integrating the Aries JS in the RootsWallet, there will be more opportunities for individuals to transfer credentials between the two. Moreover, the interoperability is not just for Cardano but also will allow roots wallet to interact with credentials from a broad array of chains (or other sources) without needing to be fully educated on Cardano or identity solutions. This type of low-barrier adoption will only make Cardano more appealing while reaching the goal of being a fully interoperable blockchain. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. The RootsWallet team continues to deliver and has been successfully providing value to the Cardano community since F6. \n\nWhat also provides confidence in the feasibility of this proposal is that it is part of a broader series of optimizations and integrations the team is adding to RootsWallet. The wallet is already built, and now come the add ons. \n\nLastly, the team is well positioned to do this work and participates in a suite of different SSI communities in pursuit of their objectives. To me, this inspires confidence that the proposers are serious as they are not just looking to turn a profit but instead deliver true value. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. Voters can feel confident in the project due to the team's track record. However, the team doesn't rely on their track record but also uses Github for its code which is open sourced, and therefore can be confirmed or questioned by the community. \n\nIn addition to the open source code, the team will provide documentation explaining how to use the new Aries functionalities within RootsWallet. This documentation can be used directly be the community to interact with these functionalities, meanwhile these interactions will illuminate whether the documentation is effective, providing a constant feedback loop the team can use to improve its documentation. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for your review and encouraging words!"}, {"id": 4924, "q0": "Self sovereign identity is an integral part of developing cross/chain collaboration. As such, this proposal aims for RootsID to integrate Aries JavaScript framework into RootsWallet and pave the way to interoperate with most of the Self-Sovereign Identity systems in the blockchain community. SSI is a vital area to deploy Cardano's capacities to become a leader in the collaborative space between blockchains.", "q0r": 5, "q1": "RootsID has developed since its inception inf Fund8 to become a vanguard SSI player not only in Cardano, but throughout cross-chain SSI collaboration; this proposal to integrate Hyperledger Aries into RootsWallet is another example of this. The budget and timeline adequately stipulate how long and how much ti will cost to build Aries library into code, integrate Aries communication protocols, integrate Aries Credential functionalities, test and document. In addition, Rodolfo´s education, prior experience and multiple roles in the Catalyst community (funded proposer, CA and vCA, part of the Challenge Teams for Fund 7 challenge \"Grow Latinamerica, Grow Cardano\" and Fund 8 challenge “Self-Sovereign Identity”, part of the first cohort of the Atala Prism Pioneer Program, and co-creator of the LATAM Cardano Community and weekly LATAM TownHall) are a proven track record that ensures the successful implementation of this proposal.", "q1r": 5, "q2": "The proposal provides the open source code of RootsWallet and the documentation explaining how use Aries functionalities within RootsWallet as the final products upon which to judge the success of the proposal, and a series of additional progress reporting KPIs such as public github issues, project views (like Kanban board) and commits, with intermediate progress reported as Sprint Burndown. Additionally, their vision is to have a cloud agent and a mobile agent based on Aries communicating with each other, and issuing, presenting, and verifying Credentials. These elements should prove enough to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for reviewing our proposal and your show of support :)"}, {"id": 6125, "q0": "Hyperledger Aires is the most accepted framework for Identity projects. RootsID already provides backend agents based on it, however RootsWallet, the mobile identity wallet, does not yet support it. The author has come up with a solution to the problem. RootsID will integrate Aries' JavaScript framework into RootsWallet and pave the way to interoperability with most Sovereign Identity systems in the blockchain community. In my opinion, the proposal impacts the challenge and is detailed and richly described. Hyperledger Aries is a mature library that provides a shared toolkit. RootsId regularly interacts with Hyperledger Aries developers at SSI meetings. The team is developing an interoperable open source SSI ecosystem, and is focusing on integrating Aries JS into RootsWsllet. And is: The first and only \"Open Source Mobile Identity Wallet\" for ATALA Prism. will technically be able to use many of the features of Aries JS. Integrating the Aries open source identity ecosystem with the Cardano open source identity ecosystem is interoperable with much of the SSI industry. Besides that the author has realized the main challenge is to integrate the technique into the code. At the same time, the author has also prepared positive solutions to reduce risks when the project is implemented.", "q0r": 5, "q1": "About the plan of the proposal. The author provides us with the necessary information to evaluate this section. The first is about the route. The author analyzes the main tasks that need to be done, which are distributed by week. Next, the author explained each job that needs to be done to achieve the goal of the job. As I understand, the workflow is arranged in 3 months. Finally, the author provides about the products to be delivered which are: Open source code on Github repo; Document. Along with the set roadmap, the author provides a budget table, which is allocated according to the work to be done in the project. The requested budget is $21.000. And specifically analyzed include: hours of research, and development, at the rate: $100/hour. Funding for jobs is clearly and transparently analyzed. Finally, about the team of team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides texts presentation about each member, and attaches links to let us know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is transparent and the members are skilled and experienced, increasing the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "The proposal provides us with KPIs to measure the successful progress of a project. We will follow RootsWallet's open source documentation, documenting the use of Aries functions in RootsWallet. Also apply Agile method provided by github. Progress will be tracked on github, public, project views and commits. We can track in many ways how the project's phases will develop, and we know what value it will bring to the community. And the final product is what is expected, the success of this project. The team has delivered short-term success: is having a cloud agent, and a mobile agent, based on Aries. long-term success, is to use RootsWallet, to utilize Aries functions, and to interface with projects outside of PRISM, and Cardano, to authenticate information from multiple ecosystems. Create the necessary adoption, to grow the SSI industry, and accept Cardano. Since we are provided with a lot of information, I believe that information is complete and satisfactory has been established. The proposal has good auditability and transparency.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Thank you so much for your review and support!"}], "solution": "RootsID will integrate Aries JavaScript framework into RootsWallet and pave the way to interoperate with most of the Self-Sovereign Identity systems in the blockchain community.", "experience": "RootsID is a group of expert developers that are contributing many Open Source building blocks to the Self-Sovereign Identity ecosystem in Cardano, such as RootsWallet, WAL-CLI, and sidetree-cardano. Check our full work on Github, and more details on the Teams section below."}