{"id": 419964, "author": "sbpabon", "title": "Evescale Devs on Cardano", "url": "https://cardano.ideascale.com/a/dtd/419964-48088", "category": 26598, "amount": 9800, "description": "Japanese developers of the Everscale Blockchain and Japanese Cardano community see Gimbalabs' Plutus PBL as a good tool to learn how to develop in Cardano. However, it is only available in English.", "f6_no_assessments": 10, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 14, "q0": "Everscale is a popular blockchain and grows rapidly. Bringing more collaboration between Everscale and Cardano and with particular application to Japanese community, will definitely benefit both ecosystems. I agree that Education is the best way to strengthen our ecosystem and integrating Everscale into Cardano, consolidation of the Japanese Cardano community will be beneficial for the  Cardano ecosystem. ", "q0r": 5, "q1": "Both proposers, Sebastian and James are already know in the Cardano community and have good track record. Gimbalabs won many proposals in Project Catalyst since the early funds and even closed out several and reported. This in combination with good plan (Plutus PBL explained, 4 stages presented) makes me believe the proposal will be implemented successfully. ", "q1r": 5, "q2": "Information provided is sufficient. It will be easy udit the progress and the success of the proposal, as the proposers are very active in the community and all the metrics is well described and presented. The budget is modest comparing to many other proposals in this category", "q2r": 5, "assessor": "z_assessor_2028", "no_vca": 33, "ne": 1, "ng": 16, "nfo": 16, "vca_o": 1}, {"id": 504, "q0": "The proposal wants to translate Gimbalabs PBL V2 into Japanese to teach Cardano and facility mingling with with Everscale Blockchain community. \n\nThis is an excellent idea and it answers the call of the challenge well. The proposal also explicitly spells out how the \"solution will address the Challenge.\"\n\nThe proposal is aware of one risk and has provided a clear strategy to mitigate it. ", "q0r": 5, "q1": "The proposal has detailed milestone and timeline with spanning four months. Each month has three to four deliverables they will be aiming for. \n\nThe budget is straightforward and simple with three different chunks of human labor. The overall budget is reasonable. \n\nThe team has all the core competency to complete the project", "q1r": 5, "q2": "The team has plans to measure monthly progress and overall progress. Would have love to hear how the team plans to manage the actual work internally and how the community can follow along. \n\nThe proposal has two definition of success it will be tracking. Would have love to see these directly tied back to the challenge's definition of success.", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 1386, "q0": "Yes, this proposal effectively addresses the challenge by working with Everscale blockchain devs and the Cardano Japanese community to translate the existing Plutus Training module from Gimbalabs into Japanese. This aligns perfectly with the challenge that is looking to break down silos between the chains through new and innovative ways. \n\nThere is already a wealth of knowledge in the Cardano community but it is very limiting as it's often only available in english. By translating the existing Plutus module into Japanese, the project will not only break down these silos, it will also make Cardano's efforts more accessible. One could easily imagine the Plutus PBL module being translated into a diverse array of languages. \n\nSince there is already a fairly large Japanese community within Cardano, there will likely be a decent number of people waiting for such materials to become available. The team has already made connections into this community and is responding to their needs, which will drive further impact. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. The proposal is very straight forward and does not require a ton of time or resources. Since gimbalabs already has the module developed, it only requires the completion and vetting of the translation. The proposal also clearly states that the proposer (Sebastian) also helped develop the actual Plutus module that will be translated, so there close knowledge of the content will be very valuable. \n\nVoters can be confident in the ability of the proposer to deliver given the track record of gimbalabs to date. They have been around since the early Catalyst days and continue to deliver major products, tools, and networks to complete their initiatives. \n\nThere is also very little risk with this proposal as we already know that gimbalabs modules are being used by the community. However, I'd encourage the proposers to include some of the data points for the English products to give some context as to what your hopes are for the Japanese module. Voters may also be more willing to take a risk for <$10k due to the potential upside. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The primary thing to be measured is whether or not the module was translated into Japanese in a technical yet well-understood manner. The team commits to validating the translation at each step of the plan, which will offer the community an opportunity to provide feedback throughout the process rather than just at the end, in an iterative fashion. \n\nOnce the module is translated is when the interesting data collection, tracking, and reporting come into play. The true value of this proposal is not in the translation itself but rather how that newly translated module is implemented. To this end, the proposer does a good job at laying out the short vision (translation) and the broader vision (ongoing use). Once translated, the community, through gimbalabs, will be able to tell exactly how many times the module was used, in what contexts, and what was its impact. \n\nFinally, voters can also have trust in the gimbalabs internal auditing processes that are in place and will be applied to this proposal. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1748, "q0": "The problem statement and solutions concerning translating the Plutus Project-Based Learning (PBL) fit well with the Challenge goals. Voters will see you are building bridges (technical or otherwise) between blockchains, allowing many Japanese speakers to utilize the tools to build on Cardano!\n\nThis Challenge will add value to the Cardano Ecosystem by opening up access to an entirely new group of people––some of whom may be outside the Everscale community. Having worked in companies with diligent translation departments, I learned that translation efficiency comes with time/learning how to translate particular jargon. This will likely apply to the work of this proposal. \n\nAll KPIs match the Challenge setting and are transparent. The timeline is more than reasonable, given the weight of the particular contents––no less than a curriculum of such significance that among its first users will be attendees of a summer workshop at Oxford University in mid-July 2022, precisely one day after the latest version deploys.\n\nThe risk of potential inadequate translation is offered, with adequate mitigation provided by the system of translation and planned quality-control checks. Voters will benefit from the author's thorough work on this mitigation tactic.\n\nThere is no need for this particular translation project to scale. However, it does aid the larger project to be utilized by many others. It will be a critical reason for growth among Japanese-speaking developers soon.\n", "q0r": 5, "q1": "The experience and skill sets needed are noted and are clearly outlined in the translation and quality-control heavy schedule. Further, the type and number of team members––3 individuals––come from the Cardano Japan community, Everscale Japan, and one from Gimbalabs. The only improvement is if the team explicitly provides the name of the individual that will fill each role. Even without this more specific information, in the skills sets of the 3-person team provided, we see the necessary talents and backgrounds needed to achieve the task, which seems implied.\n\nRegarding funding, the budget is clear for all three aspects of the work (translation, verification, and corrections). The rate itself (just over US$30 per hour) is quite fair, considering the average price per hour for the level of skill required. Additionally, the more than reasonable rate they will charge is fair compensation for the team and shows mindfulness of the needs of others within the Cross-Chain Challenge. Voters can feel confident that the work is within this well-defined scope.\n\nThe timetable of 4 months (1 month per section) is adequate, given the amount to be translated (links in the proposal to the PBL curriculum). The plan is as detailed as is needed. Actionable tasks are given for translation and verification areas, as well as a stage pre-planned for inevitable corrections, given the needs of the work.\n", "q1r": 5, "q2": "The timeline in the Feasibility section is offered as the roadmap for the project. It provides all details with clarity, to track the translation project from translation to verification and then to corrections where needed. It is timed and will aid the team in meeting measurable goals along the way, and the KPIs required to maintain accuracy and show their progress through GitHub.\n\nThe long-term metrics of the project plan to impact 5 of the Cross-Chain Collaboration Challenge metrics, which are (in brief): On-chain activity growth, # of proposals collaborating \"cross-chain,\" # of tech implementations connecting \"cross-chain,\" tech from other chains implemented on Cardano, and # of events/workshops/sessions with other communities.\n\nIt seems noteworthy that the team seeks \"with this proposal to permanently open a gateway to Cardano for the Japanese development community in general.\" At under $10K USD, it seems a low price for the Challenge team to fund for such considerable implications. For these reasons, this section will receive 5-stars from this assessor.\n", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1842, "q0": "This proposal addresses the challenges of culture, diversity, inclusion, collaboration tools and incentivize participation by having Everscale blockchain building for interoperability on Cardano by having the Plutus Project-based-Learning (Plutus PBL) translated to Japanese language. This will on-board more developers and tackle the language barrier issues. The Everscale, Cardano Japanese Community and Gimbalabs will be working together to provide accurate translations for the Japanese developers to educate themselves about Plutus. This is a small step but a significant one to grow the Cardano ecosystem. Everscale have more than 500 million users and having a portion of them using the Cardano blockchain will benefit both Cardano and Everscale. With the translation for Japanese devs, this can scale when more dApps and bridges are built between Cardano and Everscale blockchains. ", "q0r": 5, "q1": "There are three parties (Everscale, Cardano Japanes Community & Gimbalabs) working together to produce an accurate Japanese translation for Plutus PBL. They have the relevant skills to work on this proposal. The team have broken down their timeline of 4 months to deliver this proposal. The milestone for each month is achievable with the team’s language and technical experiences. As for the budget requested, they have broken down in details where the funds will be allocated for translating the whole Plutus PBL into Japanese. The success rate for this proposal is high as the three parties have the relevant experience to deliver this proposal. ", "q1r": 5, "q2": "As for auditing the progress on this proposal is the translation into Japanese for each milestone in their timeline. The team can update to the community via Twitter and Town Halls as well to show how much they have translated the Plutus PBL into Japanese language. By sharing publicly to the community and able to deliver by hitting the milestones, will help the community to monitor their progress on this proposal. The team have long term metric after this translation is complete such as number of Japanese students, no. of dApps and no. of proposals from other blockchains. I hope they will share this data publicly as this will show how much the Cardano ecosystem have grown since they translated the Plutus PBL. All in all, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_2274", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6129, "q0": "Japan belongs to Asia, has a population of 125.8 million people. The Japanese developers of Everscale Blockchain and the Japanese Cardano community consider Gimbalabs' Plutus PBL to be a good tool to learn how to develop in Cardano. However, it is only available in English. The team proposed the idea that to meet the immediate needs of the Japanese community, the Plutus PBL had to be translated into Japanese. Proposed impact on the challenge posed. I think the proposal was detailed and richly described. The Everscale blockchain and the Cardano Japanese community plan joint projects that will enable Everscale engineers and the Cardano Japanese community to actively develop on Cardano. In this scenario, Gimbalabs participates as a partner that can contribute to the achievement of goals in the development area. The author of the proposal presented the Plutus PBL at the meeting. Plutus PBL stands for \"Plutus Project-based Learning\". This is a learning program based on the actual development of real-world tools and use cases. The benefit that the Plutus PBL educational program can bring is for the purpose of integrating Everscale into Cardano and strengthening the Cardano Japanese community. Plutus PBL is divided into four main parts. The purpose of this proposal is to foster cross-blockchain collaboration while strengthening our own underserved communities. Besides, the author of the proposal also recognizes the possible risks due to language differences and inaccuracies in the translation process. At the same time, the team had a solution, to reduce the risk when the proposal was implemented.", "q0r": 5, "q1": "The proposal team, which has outlined a plan for this proposal, is very clear, and detailed. Milestones are established for each stage, for each operational event. This is the first step we need to understand how the development of this project will happen. Plutus PBL is divided into four main parts: Phase 1: Translation of the introduction (1 month); Phase 2: Translation of the Basic Knowledge (BBK) (1 month); Stage 3: Specialized translation (1 month); Stage 4: Contribute to translation (1 month). We are told the process will begin once the project is funded. Next is the budget. The proposed budget requires $9,800. In my opinion, the requested value is quite reasonable for the work to be done. The author has provided a very detailed budget table. The budgets are broken down, and allocated to each very specific job, estimated hourly, per job. Finally, about the team of team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides a text presentation about each member, and attaches a link to let us know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is transparent and the members are skilled and experienced, increasing the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "Proposals provide us with a wealth of information for measuring project progress and success. Initially, the largest measure of progress will be the monthly completion of each translation phase described in the Possible Timeline. Measuring project completion progress (4 months): Plutus PBL is translated into Japanese on an educational platform, accessible to Japanese students. In the long term, the Team provides metrics for us to measure with metrics: \"Cross-Chain Collaboration\" Challenge: tracked after Plutus PBL is translated into Japanese and launched. We can track the start, finish and long-term, development of the project. We know the value the project will bring to the community. And the final product is what is expected, the success of this project. Since we have been given a lot of information, I believe it is complete and satisfactory has been established. Increased participation of the Everscale blockchain. Strengthen the Japanese Cardano community in the development sector. This proposal aims to permanently open a gateway to Cardano for the Japanese developer community", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6815, "q0": "Language is undoubtedly a huge barrier to so many technological advancements and the Cardano community is not an exception. The proposer identifies these unique bottleneck and intends to provide solution to address these problem within the Japanese community.\nThe solution will be focusing on translating tools and resources from Gimbalabs (A project providing technical, educational and community infrastructure). These will help onboard and meet the immediate needs of the Japanese community as well as adoption.", "q0r": 4, "q1": "These proposal is going to work in synergy with the Gimbalabs team. These sets their roadmap and timelines in same fashion as the the Gimbalabs own. Providing onboarding,  background knowledge,  specialization etc. All these stages and sections will be translated as well. The requested budget amount is fair and reasonable. The project seems to be an internal project within Gimbalabs and i see good chances that it will be implemented successfully. ", "q1r": 4, "q2": "The project has a well structured roadmap and in addition to that, the proposer states that there'll be cross chain collaboration which will also bring about more metrics to measure success. It is however expected that after 4 months, we will have a full translated Plutus Project Based Learning translated into Japanese language.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 9044, "q0": "The goal of this proposal is to translate the plutus pbl into Japanese. This would have a huge impact on furthering the cross chain collaboration between cardano and everscale. Everscale’s goal is to be the most important blockchain in Japan. There is a huge pool of developers and potential cardano developers in Japan. By having a plutus PBL translated  we could grow a whole new segment of developers for cardano.  The budget on this proposal is relatively small and the team is competent so the chances of success are high. In addition to the need and seeing the impact goals of this challenge met, this proposal  receives the highest score of 5 for impact.", "q0r": 5, "q1": " The plan for this proposal is well-developed, the budget is sufficiently detailed and the team is qualified. This proposal is highly feasible and deserves a score of 5. The scope of work is straightforward and simple, and the detail provided in the plan of this proposal is sufficient to assess this at the highest possible score. There are no questions about feasibility in this proposal.", "q1r": 5, "q2": "This proposal is very clear and the metrics provide full transparency as to the progress of this proposal and to the overall results. This team is serious about reporting to Catalyst and they have created measurable set milestones that the Catalyst community  will be able to measure. The ultimate goal is to see the Plutus PBL translated into Japanese on the gimbal labs educational platform.In addition to that the team will also measure on chain activity growth, the number of new proposals from the everscale community and others that align with the challenge goal. This proposal's success and impact feel almost guaranteed. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11083, "q0": "The Japanese developers of Everscale Blockchain and the Japanese Cardano community consider Gimbalabs' Plutus PBL to be a good tool to learn how to develop in Cardano. However, it is only available in English. To meet the needs of the Japanese community, you have proposed: \"Translate Plutus PBL into Japanese\". In my opinion, this is a very good proposal to help the Japanese community access Plutus Project-based Learning quickly and effectively. You have taken the possible risk that the document translation is incomplete. To mitigate this risk, the Everscale - Cardano Japanese Community - Gimbalabs working group will be consulted regularly during the translation process to check the partial results obtained in the translation of each module. I feel very fine.", "q0r": 5, "q1": "I totally agree with your point that to enhance interoperability and collaboration with other blockchains, ready to provide tools to build infrastructure because mutual understanding begins. when we start to speak a common language will help us to cooperate more effectively. You guys have elaborated the blueprint I've seen in each translation with due diligence (feedback): Everscale - Cardano Japan Community - Gimbalabs Working Group and/or other external sources will review the quality amount of translations, meticulous comments to make in the translation. I think this is a solution to improve the quality of the translation, you have provided a detailed budget analysis, I see that the cost of implementing the proposal is not too large, the contents are clear. . In my opinion, you should provide more complete information as well as the capacity of each member so that we can be clear.", "q1r": 4, "q2": "The proposal provided information to measure the progress of the project on a monthly basis as in the developed plan, the success of the proposal is quite clearly described that is the increasing participation of the number of students. original Japanese into the creation and construction of the Cardano scene. Strengthen the Japanese Cardano community in the development sector. The proposal has contributed to the achievement of the sustainable development goals: Ensuring inclusive and equitable quality of education and promoting lifelong learning opportunities for all; Promote sustainable, inclusive and sustainable economic growth, full and productive employment and decent work for all. This is a new project but I see a lot of potential, I support you.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 14769, "q0": "According to the proposal team, the Japanese developers of Everscale Blockchain and the Japanese Cardano community are particularly interested in Plutus and see it as a good tool to learn how to create development projects in Cardano. However, there is no language support for Japanese developers yet. This hinders them and also deprives a large number of potential developers who want to reach out to the community. Faced with this situation, the team came up with the idea of ​​creating a fully supported programming education program in Japanese. I think this is a good idea to help expand the Cardano community and help simplify the developers' experience.\nThe team explained the background of the project very well. The situation and comments of the team are presented in the proposal. Program features and functions are well documented. The main components that make up the program are also presented. How the project works is also described in detail by the team. Furthermore, the project identified the target audiences. Those are programming students from Japan. The project also shows the impact on these entities and the entire Cardano ecosystem community. The proposal also gives the reasons they think this is a very necessary project for the development of the community.\nThe team asserts that this project is completely in line with the goals of the Challenge. More specifically, the project meets the final key metric set by the challenge, which is to create an event to attract members from other communities to access Cardano technology to share knowledge, resources, skills, ideas, and visions with one another. The results and goals that the project is aiming for are also clearly stated in the proposal.\nThere is a difficult problem that the team encountered when implementing the project which is the incomplete document translation. Faced with this problem, the proposal team came up with a solution to ensure the project is running well.", "q0r": 5, "q1": "The proposers gave a project implementation plan with a clear direction. The project is divided into four main sections including Onboarding, Building Background Knowledge (BBK), Specialize and Contribute corresponding to the four stages in the roadmap. The roadmap also identifies the milestones and the requirements to be completed at each milestone. There is a realistic timeline for completing the tasks given in a logical manner provided in the plan. The proposal has shown a reasonable plan not only in terms of what they will complete but also how it needs to be. The details of the technical and technological aspects required to implement the plan are also covered by the proposers. Based on this blueprint, the community can get an overview of the project's progress and appreciate the team's ability to achieve its goals.\nIn general, the budget proposed by the team to implement the project is reasonable. The budget plan outlines activities that require costs. Each activity has a specific cost. The budget plan is clearly presented and easy to grasp. Expenditure items are listed in bullet form. However, the proposal should identify the important positions required in the project and the number of people needed to implement the project and include in the budget plan the expenditure for personnel salaries.\nThe project founding team consists of talented and experienced people in the field. They promise to bring the project to great development to create value for the community.", "q1r": 5, "q2": "The team has established standards to evaluate the success of the project including the Number of Proposals from participants from other blockchain communities, the number of technical implementations connecting Cardano to other blockchains, the number of projects and dApps from other chains deployed on Cardano, the Number of events/workshops/sessions arranged with other communities. These goals are consistent with the goals set by the challenge. Through that, it is possible to see the great potential for community development that the project brings. The successful image of the project has been clearly visualized by the community. However, in order for the community to easily track project progress, the team should provide specific numbers for each criterion. These quantitative indicators will be the basis for the community to evaluate the success of the project in each phase. Furthermore, the detailed information provided in the proposal will show that the team is taking the plan set out seriously and pursuing the goals.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "To meet the immediate needs of the Japanese community, the Plutus PBL must be translated into Japanese.", "experience": "\n\nSebastian Pabon. Plutus Instructor. Gimbalabs member. Experienced in translation of Plutus educational programs. Member of the working group Evercale Japan - Cardano Japanese community - Gimbalabs.\n\n\nGimbalabs (https://gimbalabs.com/team)\n\n"}