{"id": 420176, "author": "dimabrook", "title": "NFT Bridge to & from Cardano", "url": "https://cardano.ideascale.com/a/dtd/420176-48088", "category": 26598, "amount": 100000, "description": "At the moment, there's no reliable way to transfer NFTs to or from Cardano.\nThe existing bridges are FT focused.\nCardano based NFTs are behind an Iron Curtain cut out from the world markets.", "f6_no_assessments": 11, "f6_rating": 3.484848484848485, "videos": [], "media": [], "f6_assessments": [{"id": 9521, "q0": "For major alignment with one of the core focuses of this round of Catalyst funding (interoperability) and incredibly innovative development on blockchain technology, I rank this section a 4. This section of the proposal doesn’t list out all the potential benefits of this proposal in written form but there is a lot of listed impacts in the short video attached. There are lots of indicated benefits like expanding market share, risk distribution, better/cheaper performance, convenience for collectors, and capability for collection migration. These are all attractive impacts, in theory. I think this proposal could secure much more positive reaction from voters with tangibility added by quantification. I would’ve liked to see some citations of how much NFT volume is traded within the marketplaces of the chains that this bridge is connected to, to demonstrate what kind of exposure Cardano gains by approving this proposal. Some additional and more direct tangibility could be added by citing data on how many transactions are facilitated on this platform on 30 day and all time number timeframes. I think this added information would secure a significantly more positive voter response. I wasn’t able to find any information on these platform-specific numbers but I was able to find nearly 40k Twitter followers for this platform’s official page, so there is some demonstrable well-established awareness of this platform. Beyond impact quantification, I think there’s some additional consideration that ought to be made for risk mitigation. I’ve worked with a few DeFi NFT collections on utility development and I’ve also stayed well connected to some utility-based NFT developers and most of these utilities are on-chain based utilities that wouldn’t be able to function on other blockchains. In the event that other NFT bridges pop up, there’s a risk of NFTs losing their utility entirely if it jumps different blockchains multiple times to the point where the trail back to the original is lost. I think this problem could be addressed with potential solutions about metadata information or collaboration with other NFT bridge, which I would like to see further elaboration on IF this issue is on the team’s radar. This could pose a long-term threat to the platform if the future of NFTs is rooted in utility, rather than collectibles. This might not be a huge issue for NFTs that are purely collectibles in nature but there’s plenty of circumstances where NFTs have utility added to them well AFTER the initial launch. Since there is a relatively widespread vision for the proliferation of NFTs and their utility, I would like to see this proposal address more about long-term sustainability of this platform. Additionally, there is another potential risk of this platform being used as a tool to create counterfeit NFTs by masking the authenticity with bridged meta data. Since this platform is already well-established and connected to 16 blockchains now, I expect they already have answers to these questions that are just not answered here. Lastly, I think this proposal could add more reputability among Cardano voters if they disclosed that there is an existing partnership (I use that term loosely)  with Pavia (who is prepared to utilize this bridge). These concerns are not imminent threats and are more likely solved by taking these steps to connect first, so I rank this section positively because of the strong/innovative alignment with Cardano’s efforts for interoperability. ", "q0r": 4, "q1": "Integrations are vastly easier to react positively to because they usually have preexisting infrastructure, as this one does. I rank this section a 5 for thoroughly demonstrable capability and well-established interoperable infrastructure. I have some relatively minor qualms with some details of the proposal, like the difficulty of verifying core team professional experience with the given links/resources. Even on their website, you can find a LONG list of contributing team members with full names and pictures but no LinkedIn profiles to be found anywhere. This issue is pretty well mitigated with the capability demonstrated by the well-established bridging solution that currently exists but it is a factor that could secure greater positive voter reaction. The roadmap and budget sections are a little bit clunky in terms of organization but is plenty functional for what these sections are supposed to do. The roadmap does a great job at outlining all the actionable steps, timelines, and action categories to show expected completion in 4.5 months. In this outline, it doesn’t translate all that well to determine efficiency in spending by providing allocated hours of labor and hourly rates. Based on my estimations, the spending is pretty reasonable for most industry standard rates for blockchain development IF there are 3-4 people working full time hours ($22,222k/mo = $5.55k-7.4k/person). Plus, the overall cost outweighs the potential benefits, in my opinion. I rank positively here because I think there’s no major concerns for feasibility and only a few minor criticisms for how information is laid out. ", "q1r": 5, "q2": "For providing a definition of success that only encompasses completion/functionality as its standard, I rank this section a 2. I think this is where the proposal falls short in demonstrating to voters that the expected outcome of this proposal is worth the requested $100k. While there isn’t an expectation of this proposal having ZERO impact, the proposal does not objectively define/demonstrate a quantifiable outcome that can be properly evaluated against the risks/costs. There are a lot of potential KPIs that voters would expect to see here, such as number of NFTs bridged out of Cardano, number of NFTs bridged into Cardano, number of connected wallets, website traffic, social media traffic and any other metrics that might measure this investment having a worthwhile ROI for the Cardano ecosystem. A higher level proposal would provide identified KPIs with target metrics to quantify/specify the proposers expectation/definition of success. Also, the SDG ratings are a little bit of a stretch. I think there could be a lot more substance here for voters to react to. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 899, "q0": "This proposal will bring value to Cardano's NFT scene, in allowing Individual bridging personal NFT's cross-chain or NFT games for example exploring a different market on a different chain. The proposal also lines up with the challenge setting of cross-chain collaboration. Once the bridge is automated it should have the ability to scale in in my opinion.", "q0r": 3, "q1": "By visiting (https://xp.network/team/) and the proposal twitter page, they seem to have a good social reputation and seem like a professional team on closer inspecting the website above. The main risks this proposer sees is in the area of customer awareness, and they plan to attend conferences as well as regular AMA's with the community. They also have provided sufficient information around budget and a rough timeframe for completion.\nWeighing this up, it seems this proposal has a medium to high chance of a successful implementation of this bridge ON Cardano.", "q1r": 3, "q2": "The area of auditability for this project seems to be lacking. To improve this proposal and allow the community a more transparent view of progress and development, more thought needs to go into this area.", "q2r": 1, "assessor": "z_assessor_2148", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 1387, "q0": "Yes, this proposal effectively addresses the challenge by seeking to build an NFT bridge that would allow users to mint, buy, sell, trade NFTs across different platforms to Cardano (Elrond, Algorand, Tezos, Velas, Gnosis, GateChain, Fuse). \n\nGiven that this project is already well underway and has linked the above chains, it seems like a good idea to add Cardano to that list. This objective aligns exactly with the proposal by reducing the silos between chains. \n\nSince NFTs play such a major role in most ecosystems, it is likely a good starting point to begin bringing down the silos and also reducing the maximalism between chains. This may be important on a broader scale as artists looking to get into NFTs may not need to be exact on which chain they choose to launch on but identify which suits their needs best while still having access to all the others. \n\nThe \"iron curtain\" language feels a little dramatic but the point is taken :) ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. \n\nWhat gives confidence to the team being able to deliver is that they already have delivered NFT bridges to seven other chains and will now be integrating Cardano. Their previous success infers that this project will also be a success. \n\nThe team also provides links for each of the member's github links for the community to track their efforts and if desired check the code. This helps bolster their reputation by being able to see exactly what has been completed to date. \n\nThe plan is laid out well and indicates the team's knowledge on the steps required and the amount of time each would take. I would have liked if they provided more details of how they reached their final budget numbers. At the current rate they are paying $33k/1.5 months but that feels like an exorbitant amount without any real breakdown. \nI am not saying this amount is unfair, just that to ask for such a chunk there should be an hourly rate and expected amount of time required. \n\nOne last thing I think could be better explained in the plan is how they will market/promote their product. Yes they go to crypto meet ups but perhaps using more traditional marketing could make this information known to the broader NFT community given its potential impact. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs mentioned above, the use of github as an open source platform is a welcome sign and an approach that is popular in Cardano. As Cardano seeks to become a global open source project, those teams who start this way are likely better off. This also means that the community is able to track and follow along with the development as it happens. \n\nI think the team could have done a bit better of a job explaining their KPIs. It is good that they will be testing their code to cover 85% of the on-chain functionality, there is no real explanation as to why 85%. Moreover, that's the only indicator they have. There is no real other indication of how the team would be reporting their milestones to the community. \n\nTheir success measure is simple (transferring NFTs to and from Cardano to the other chains) but again I think some scope here would be helpful. Is there a target amount of NFTs you'd like to have traded to be a success? If it happens only once, is that a success? More detail here would help get that last star. Overall good work. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1750, "q0": "The problem statement is clear, and the problem offers a different way of focusing on cross-chain collaborations. The tool of such a bridge makes so much possible and necessarily breaks down existing barriers because we don't yet have the technology to take an NFT from one blockchain to the next. If rewriting, please work on the shorter solution statement. Voters will likely find it confusing, especially ending the last sentence without finishing. \n\nThe solution is a clear value-add for Cardano, as it opens pathways to new buyers, collectors, and builders as well. Overall, a quite positive impact on the ecosystem.\n\nThe KPIs are lacking, though the spirit of the proposal seems to match that of the challenge in that they are looking to create interoperability and break down technical barriers. If rewriting, please add a complete list of KPIs that work for this proposal and match the Challenge setting.\n\nThere is not an indication of scaling past the needs of this current proposal.\n\nThe risk of potential users remaining unaware of their existence has an attempt at mitigation, including going to conferences and other low-budget marketing. The team seems uninterested in charging more than fees they say \"won't provide much income for decades,\" though if they did set a standard amount, those funds could mitigate the issue, and they could taper off the price to users over time to be more inline with their mission. For all mentioned reasons, the section receives 3 stars.", "q0r": 3, "q1": "The detailed plan is exceptional. They add so much detail voters will have no problem determining the team has covered every possible area. If rewriting in a future round, please leave out your own HTML code. It is unnecessary, doesn't work correctly in the proposal format, and takes away from the otherwise beautiful clarity of the document. This area is an exceptional example of breaking down technical steps so anyone can understand them.\n\nThe budget should not point back to the previous section. It should repeat all areas concerning hourly rates per dev, hours expected to work, etc. The budget itself should not have to contain many words but several categories that are all given a specific number. There are no identifiable items within each of the 4 categories that are given any justification for your price. If rewriting, please offer these details. \n\nThe proposer must include if rewriting, any \"relevant experience\" to the personnel field as asked. The current GitHub accounts with job titles are not sufficient for voters. Also, according to the link results, no account exists for \".../YuraDQuigon\" please offer corrected information to voters if rewriting.\n\nAccording to the proposal, the budget and human resources mentioned are the only assets needed to execute the plan. The section receives 3 stars from this assessor.", "q1r": 3, "q2": "There is an excellent roadmap drawn out in Feasibility, remarkable actually. The amount of detail and milestones that are given will help voters see with crystal clarity exactly what the team will be doing at any given time. For this reason, even though several items are missing from auditability (metrics, KPIs that define success, or tracking mechanisms offered to the community as described below), the team still receives 3 stars for this section.\n\nThe metrics are written almost cryptically and unclear in any case. The proposer must offer definitions of success. One suggestion is a bulleted list of metrics or KPIs that help you define success while pointing to the various outcomes. The proposer should be advised that writing a proposal on Catalyst necessarily involves some redundancies and others that are redundant but almost appear so as they are closely related, but a slightly different question from a previous section. If rewriting, please take each field separately, offering a thorough answer to each question without pointing back to other areas or assuming the information was already covered in another area of the document.\n\nNo mechanism for tracking success is given to the community. Some communities offer a Gitbook account updated weekly for community viewing. This can add excellent transparency to the auditability section. All this is the rationale behind a 2 star score.", "q2r": 2, "assessor": "z_assessor_2261", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2097, "q0": "This proposal poses the problem of wanting to find a reliable place to transfer NFTs to or from Cardano. Their solution is the XP. Network bridge that can open the market of the NFT ecosystem of all chains connected to Cardano and vice versa. This solution can directly solve the challenge because of cBridge XP. The network allows for the forwarding of transactions from one chain to another, performing NFT transfers between blockchains similar to those within a chain. The problem is identified and a solution is also articulated even if it is completely obvious. The risk that this proposal refers to is that NFT related projects may not know that such a bridge exists and they can use it 24/7 they also come up with some solutions to reduce it. Mitigate that risk such as participating in Crypto conferences, publishing blogs and media announcements, conducting and participating in AMAs, and publishing on industry-recognized platforms and in the community of projects blockchain project and NFT...promoting opportunities with dApps, Marketplaces, and games...", "q0r": 5, "q1": "Regarding the ability of the team to implement the proposal, it is very clear how prepared they are to carry out this project. There are 4 milestones given which equate to 4 phases of project development. Phases 1 & 2 are both Smart Contract development stages, each lasts 1.5 months and we are given a fourth task to execute in this phase very clearly. Phase 3: Testing & Documentation (2 weeks) and Phase 4: Integration into Live Bridge (1 month) the to-dos in these 2 phases are also listed very carefully, so we can understand the workflow of this project. The script is great, but unfortunately, the budget and the interpretation team are very superficial.\nRegarding the budget, what we know is that the proposal asks for $100,000 and this amount is divided by the phases of the project, e.g. phase 1: 1.5 months requires $33,333 even though in In the roadmap section we know what you need to do, to accurately assess the feasibility of the project, the detailed budget explanation is also an important factor. With the requested funds, we cannot imagine what you would use them for, how many members are involved in these activities, and what is their salary?\nAnd finally, about the team, this part also needs more explanation. We know the names of the members involved in the project as well as their current work, and should also provide each member's Github page, but this is not enough (as it is difficult to find out all about them through this information). We need to know their role for this proposal, their connection to Cardano in particular or Blockchain in general, or attach an introduction to their resume (experience, skills, time involved. joining the blockchain field....) this will be more beneficial to the proposal because we can rely on it to more accurately assess the capacity of the team.", "q1r": 3, "q2": "The auditability of this proposal is very low, what we know of the project's success is \"Successful NFT transfers to Cardano from the other bridged chains and back using the UI/widget and the JavaScript library of the bridge. \" But how do we believe this will be achieved? The reason I say that is because the proposal almost does not provide KPIs so that we can assess the progress of the project. What is provided is \"We will add functional tests that will cover at least 85% of the code functionality on-chain. Some of the code will serve project setup purposes\". I would like the proponent to be more explicit about how this big goal can be audited bit by bit, providing us with smaller indications of overall success. And, in the same way, such information must reach the members of the Cardano community unambiguously.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3014, "q0": "I believe this is a good idea, buidling bridges between networks always has something more to give to the involved networks. The team is experienced as they have built the only NFT bridge to/from Elrond, Algorand, Tezos, Velas, Gnosis, GateChain, Fuse, some of the most known blochchains out there. I don't see how this would not have a positive impact on the whole Cardano ecosystem and i think that becomes pretty clear from the proposal itself from the description of the impact. These kind of ideas are useful for all the blockchains existent nowadays and i believe they should get funded when they are making their appearance. That is why i think it can also address future challenges in future Funds.  ", "q0r": 5, "q1": "In terms of feasibility, there is a detailed plan, including timeline, a quite realisitc one. The budget is described and has been broken down into identifiable items but it seems quite big considering the amount of funds this specific challenge is going to get. From other proposals i have previously assessed i think that the pricing for smart contract development could potentially be a little bit lower, so may you consider this on a next Fund, as smaller budgets have greater potential of being funded. All the team members have been mentioned and there are also github links but i thibk that you should also give a very brief description of their skills or/and in what field of the above mentioned, is each one of them going to work on. The necessary resources can easily be understood from the roadmap section so that is okay. There are 1-2 things that could be corrected and this proposal is likely to be implemented successfully. ", "q1r": 4, "q2": "The roadmap and its key milestones are all there unlike the key metrics that will measure the success of this proposal. It is mentioned that success is going to come from all successful NFT transfers but what does that entails? You should also quantify those key metrics, except from mentioning some more. For example, how many transfers are there going to be to consider this successful? Also, fuctional tests are going to be a useful way to track the progress, but how will the community keep up with the progress as well? Will the updates be available through a github account or through any of the relevant links you provided above? That is something that should be clearer. I don't think that this information is quite sufficient to audit the progress, but the idea has much potential and if not funded this round, i will be glad to see it again on the next Fund. ", "q2r": 2, "assessor": "z_assessor_2385", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3124, "q0": "Interoperability will be the key in the blockchain space. With that in mind, this proposal addresses this challenge nicely. It is rather true that currently Cardano is having an iron curtain blocking its potential from the world markets and the author's proposal may solve this setback by introducing the NFT bridge, which I believe will open the doors of awareness of Cardano to the world. Thus, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team behind this proposal (XP.NETWORKS) has an established name in other blockchains. The team has also been working with Cardano metaverse company (i.e Pavia). Thus in terms of team and skill, I am fully confident in the proposal's team. The cost breakdown are very well detailed, not to mentioned the milestones and deliverables are well detailed as well. By looking at the presented information, it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Clear and precise deliverables and roadmap makes this proposal easy to track and monitor. However would appreciate if the proposal includes the channel to track the progress (via Discord, Twitter or their own portal). The proposal did mention briefly on the test case but lacks the information on the key indicators needed to quantify the success of the project. All in all, it's a little difficult to track and quantify this project as it lacks information(too brief) like KPI and metric to calculate the success of the proposal. Thus, I would give a solid 4 for this proposal.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3332, "q0": "This is a highly ambitious and interesting project with great use cases if implemented successfully, however the proposal itself is very short and have room for improvement in several areas. Building an NFT bridge to & from Cardano certainly would be a fantastic tool and could provide great value to the Cardano ecostystem and objectives of this challenge, but when there are no explanations of key metrics, steps-by-step procedures, or background information of the target users and applicable markets there is no way of grasping the impact and feasibiliy of this project. They have mentioned the use cases this bridge would provide but do not go into much detail about it. They also share how they have been participating in conferences and published in medias, and spoken directly with dApps in order to spread awerbess if their products, and It would be interesting to also hear about the responses they have gotten. Overall, they present an interesting project but fail to help us fully understand what it really is about and how the procedure would look like. They have shown in a comment under the proposal, where they talk about the security of the bridge, that they have knowledge and experience about what they are doing, that’s why I would recommend them to try to incorporate more of this type of information in the proposal itself for next time and they should have a much stronger proposal.", "q0r": 2, "q1": "In terms of feasibility, the proposal has presented a detailed timeline with key milestones and a short summary with specifications for each milestones, but is lackluster in terms of budget detailing and information about the team behind the project. The budget is broken down into the main components, but when it comes to a big sum like $100,000 it would be valuable to also share more of how the payscales and hours have been worked out to get a better understanding of the reasoning behind this. There are also additional things that could be valuable to share, such as what plans and actions would be needed if not sufficient funding was received. The team seems to consist of a skilled bunch of developers, and the github profiles provide some evidence of their skills and experience. However, they could strengthen this part of the proposal by including more information about the team in the proposal, for example some short biographies of the project lead and who is responsible for what areas of the project.", "q1r": 3, "q2": "A big weakness of this proposal is the auditability section, where I feel the proposer has greatly overlooked the importance of auditability. When asking for $100,000 in funding, and the proposal has not delivered a list of KPI’s or measurable components of the overall procedure, this is a major concern. There are also no channels where updates or news are delivered for the community to follow and audit. Without these important tools for creating credibility and measurable progress for the project, there is no way to ensure or audit the success of it. I suggest the team try to expand on this section in the next proposal, since the idea behind this proposal has great potential.", "q2r": 1, "assessor": "z_assessor_2448", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4199, "q0": "The \"NFT Bridge to & From Cardano\" addresses the cross-chain collaboration challenge by 'XP.Network' bridging markets of the NFT ecosystems of all connected chains to Cardano. this will open up the possibilties of dApps to build cross chain games, metaverses, marketplace and defi solution that use NFT as a collateral or key to service/information. The team has specified the risk of such solution as the NFT related project may be unaware that such a bridge exist and that they can use this service 24/7. This proposal satisfies the cross-chain challenge very well in the sense that NFT in Cardano needs to connect with other blockchains in order to boost its visibility and utilities. Once the NFTs are connected, it will also drive the growth of interoperability and collaboration across the chain which is the key of this challenge.", "q0r": 5, "q1": "The total project duration will be 4 months 2 weeks. The team has provided a very detailed milestone with milestone 1 & 2 focusing on smart contract development, milestone 3 on testing & documentation and milestone 4 in integrating into the live bridge. The breakdown in budget is attached to each milestone. However, there is no budget breakdown in term of pay rate and the number of working hours for the project. The team has provided their team members profile link and they plan to get a grant to cover the costs of development. The team could have improved the score in feasibility by providing the missing information on number of hours and the pay rate. The team also should prepare for other risks/challenges in delivering this project ie. any delays that could possibly occur in the auditing of smart contract which the team has not mentioned. ", "q1r": 4, "q2": "The team defines the success of this proposal as the successful NFT transfers to Cardano from the other bridged chains and back using the UI/widget and the Javascript library of the bridge. They will monitor this by adding functionality test that will cover at least 85% of the on-chain code. The team should have a clearer KPIs to track project progress. The team also would have to find the right channel to update the project progress to the community. It is evident that the team has a clear grasp of issue in transferring NFTs to and from Cardano that the existing bridges focus only the FT and locate the effective solution to build bridge in transferring NFTs across chains. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4399, "q0": "The proposal contains highly practical and essential ideas for the current blockchain ecosystem. It is also a common problem that exists in some other blockchains. However, it needs more time to research, build and apply in practice to bring real effective value.\nThis proposal correctly addresses the goal set out in the Challenge: \"Cross-chain Collaboration\". The problem was identified that there was no reliable way to transfer NFTs to or from Cardano, leaving Cardano-based NFTs virtually uninterested in the market. I find the team to be quite subtle when it comes to this, which is also an existing problem in the Cardano ecosystem. The team's solution was to build an NFT bridge to and from Cardano. Doing so, in theory, can solve this, and if it works in practice, it's great. It will add enormous value to the Cardano ecosystem (if it succeeds) and full scale and solve future challenges. Because in general, the impact of the Cardano blockchain on every profession in society is huge. If NFT Cardano goes into circulation without a hitch, it will be a big step on Cardano's path to making the world a better place. I am waiting and hoping for this proposal, wishing it to come true as soon as possible. I consider the impact of this proposal to be quite large for the Cardano blockchain and more broadly for society (macro scale - can be considered later). With such impact, when I completely agree - vote 5 stars.", "q0r": 5, "q1": "The proponent and team have a lot of experience working in blockchain, NFT, DApps, etc...and have received many grants. That shows some feasibility when the team implements this proposal. I have seen documents related to proposals, and documents related to the team (website, ...). However, the identity disclosure via social networks seems to be unclear because the team only gives the Github link, in some member profiles there is no photo of that member. This leads to the feasibility of the proposal not being 100% approved by the community, where there is still doubt about its veracity. My advice to the team is to try to add a social network link (Linked, Facebook, etc…) to make all the members of the team public. Because thanks to the full complement, the community has a lot of advantages in looking up the members' identities and verifying the feasibility of the proposal. The team has listed the number of members, which is not always the case (this is worth noting). Team members I understand are key members, the team may also include other collaborators who have not been identified.\nThe budget breakdown seems to be having issues as it doesn't show the breakdown by items. The community when looking at it will find it very difficult to understand. It does not show the amount to be spent, very vague and sketchy. This makes me and the community even more doubtful about the feasibility of the proposal. As a PA, I advise the team to show in detail, clearly the required budget for each small job so that the community can look at it and have more confidence in the feasibility of the proposal. I have a question for the team: If it hasn't been funded by Catalyst in Fund 9, will the team continue to work on this proposal? What other funding does the team have to be able to implement this proposal (from contacting support from other organizations)? I ask this question because I want to demonstrate clear feasibility for the budget (the team claims to have received 13 blockchain grants).\nRegarding the plan and implementation method, it has been stated but not clear and sketchy (only a few lines). I continue to comment on this, is that the team should review it carefully to write the plan and how to implement it in a much more complete way. This is also one of the important factors in clearly defining the feasibility of the proposal.\nRegarding the necessary resources for implementation, I temporarily divided them into two main resources: financial resources (mentioned in the above budget) and human resources. Given the current (unidentified) people, I doubt the proposed implementation will be successful. However, the team shared that there were no members who were working on another proposal parallel to this proposal at Fund 9. It got me thinking that if the proposal was implemented, the team would spend 100 % of human resources to perform right? Perhaps the team should have more confirmation about the implementation resources to create more trust from the community, thereby increasing the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. It is a collection of high-tech technologies: Blockchain, Front-end, Fullstack, smart contracts, etc… They are implemented by experienced teams in the market (current team members are present). now). That is the basis for me to believe that the team will be able to do when implementing the technical aspect of the proposal implementation.\nThe team is also quite clear about the risks that may be encountered when implementing this proposal: Lack of information to propagate this project to the community so that they know more about the existing tools to help solve the problem NFT to and from Cardano - the team came with a satisfactory solution. I add one more risk: It's Ada's slippage - which will affect the budget to implement the proposal. We know that the digital currency market is in a downtrend, the digital currency is moving in a downward direction - causing Ada to lose value when the Catalyst fund is allocated to the team. At that time, the team will face the problem of a lack of budget to implement the proposal. Therefore, my advice is that the team consider the detailed budget related to Ada's slippage to make the budget request accordingly.\nJust now are my positive comments and advice. I hope the team can consider completing the missing things (member identity, budget, plan, human resources) so that the proposal will soon gain the community's trust in its integrity. Feasibility. I disagree about the feasibility of the proposal. I vote 2 stars.", "q1r": 2, "q2": "I see the team has given the milestones but it is presented carelessly, somewhat sketchy, and confusing. The milestones are not tied to a timeline (specific months of the year) so that the community can see the roadmap more clearly. What makes it difficult for the community to assess the progress of the work, it is difficult to demonstrate the transparency and auditability of the proposal. I think the team should show more interest in the proposal milestone roadmap (both content and presentation). My specific advice is that the team can present the work done at each milestone in more detail so that it is easier for the community to understand - especially for newcomers in the community - they can read and Understand what the team needs to do at milestones easily. With content and presentation, I was a bit disappointed.\nWhy doesn't the team present key metrics and key metrics? I think the team knows the role of KPIs and key metrics in the audit. This omission makes it more difficult for the community to evaluate and audit when KPIs and key metrics are not visible. KPIs and key metrics play an important role in proving the transparency and auditability of the proposal. So my sincere advice to the team is to quickly add KPIs and key metrics. Then this proposal will have much higher transparency and auditability.\nOn the other hand, the team stated what success is: NFT successfully transfers to Cardano from other bridge chains and back using the bridge's UI/utilities and JavaScript libraries. I agree with this definition of success, which is quite simple but clearly articulates the purpose of the proposal. I feel that more effort is needed by the team to improve on the shortcomings I mentioned above if the proposal is to be auditable.\nHere are some of my positive comments to build more transparency and auditability of the proposal. Regarding the auditability of the proposal, I disagree. I vote 2 stars.", "q2r": 2, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6234, "q0": "This proposal seeks funding for the further development of the xp.network cross blockchain bridge to provide the capability to transfer NFTs to and from Cardano to more than 16 other blockchains.\nThe problem is clearly explained there is no solution developed for the NFT movement from and to Cardano.\nThe impact of this proposal could be significant. The frictionless cross chain transfers are incredibly important for the inclusive and collaborative future.\nThe proposal being a cross chain bridge is clearly in line with the with the challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer has already built the functionality for 16 other blockchains and the product is operational. This proposal is for the integration of Cardano to the existing solution.\nThe proposer presents a project related risk and a serious mitigation strategy for limiting the risk.\nThe proposal has a very well outlined plan in a table form, unfortunately the functionality of ideascale did not keep the formatting. \nThe plan is detailed and developed in milestones with timeline, this could be used in the auditability of the project as well. The plan is presented in concrete technical steps.\nThe total length of the project is 4.5months.\nThe budget of the proposal is presented in budgets for achieving a milestone. It is not broken down sufficiently.\nThe team that will work on the project is the xp.network own team https://xp.network/team/\nThe team is presented with their github profiles which are very active to say the least, experience is obvious and it is certain that the team have the expertise needed for this project.\nThe proposer does not have other proposals for this or any other fund in Catalyst. \nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer presents the auditability by adding functional tests that will cover more than 85% of the on-chain code functionality.\nHowever we could take the milestones and timeline from the plan of the proposal, that is developed so well and use them as milestones and timeline for the audit of the proposal.\nUnfortunately the proposer does not present a clear community accessible channel where the proposer will present updates on the progress of the project.\nThe success metrics are clearly outlined and measurable.\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nDear proposer, your proposal is valuable to the Cardano ecosystem. Unfortunately you have some weak spots in your proposal. Please consider reading the PA Guide before you develop your next proposal. https://docs.google.com/document/d/1g-iZhDlKhUBZkui1uv8NVNfJC4oVD3JtR-P6Fue7XPU/edit#\n", "q2r": 3, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "XP.Network connects > 16 chain mapping the contract logic, collection name & attributes.\nWe adapt the bridged assets to the standards of the target chain to be listed, displayed and traded like native", "experience": "We've already received 13 blockchain grants, connected 16 chains and 4 are in the process of integration.\nWe're the ONLY NFT bridge to/from Elrond, Algorand, Tezos, Velas, Gnosis, GateChain, Fuse.\nWe've written a JS library for embedding the bridge in dApps & Marketplaces."}