{"id": 420866, "author": "headelf", "title": "C.S.E.R.DEFI", "url": "https://cardano.ideascale.com/a/dtd/420866-48088", "category": 26598, "amount": 225000, "description": "How can all Blockchains minimize potential staff & bad players predatory practices against vulnerable Senior Citizens globally with resulting bad press and potential government regulation pressures?", "f6_no_assessments": 6, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1388, "q0": "This proposal somewhat addresses the challenge by attempting to make Cardano a leader in self-regulated DEFI with a focus on educating and informing seniors of the risks. While I understand that seniors are a major population with liquidity there is little indication of the desire of this group to enter the crypto space, or what impact their entry would have on cross collaboration? \n\nAs written, the proposers highlight there is a massive silver tsunami headed towards defi over the next decade, but there is no indication of the scale of this \"tsunami\" or where the information is coming from. It would be good to give readers a sense of the problem you are seeking to address. \n\nAlso, what is it about seniors that makes them so appealing as a target audience? Liquidity? Free time? Also, how does reaching out to other blockchains help in reaching seniors? There are some leaps here that should be better explained. \n\nIn the challenges, I'd like to have had the proposers provide an explanation as to how they will get other chains on board. While they say that a united industry could mitigate rejection by regulators, it is unclear how this \"unified\" community develops, or what incentives are present to drive this unification?", "q0r": 3, "q1": "No, given the experience and plan presented it is unlikely that this proposal will be implemented successfully. \n\nThis proposal is too broad and unfocused. While the idea is commendable, it is unlikely feasible. There appear to be two different objectives of this proposal that do not appear clearly related to each other. Objective one appears to be use Catalyst funds to jump start a Self Regulatory Organization for Defi that brings different blockchains together. The second objective seems to be related to protecting seniors from getting swindled by crypto scams. \n\nRegarding the SRO development, there may be an opportunity to drive such an initiative but there are a significant amount of assumptions being made within the proposal that could limit it's feasibility. First off, as a starting point this proposal assumes that such a regulatory oversight is appropriate and/or desired, not just by the Cardano Community but other blockchains as well. There is no real discussion of how this project would fit in with the existing regulatory discussions at the national and trans-national levels. \n\nSecondly, the current plan is largely exploratory about the suitability of and potential forms for SROs. The proposal itself acknowledges that this work needs to be conducted. This I agree, but where I struggle is the reason that the proposers have planned out a year of activities without even having the original foundation together. For example, what value would the community get from providing $189k for you to go to trade shows if you don't have anything agreed to yet? If you find out early on that it won't work (for any reason) how would the community get its funds back? What would the team be on the hook for? Also, if this collaboration is by and for the entire space, why is Cardano (specifically Catalyst) footing the bill for everything? \n\nThe only other reason I'll mention here for the low score is the lack of detail on the team. It's fine to say that X has the necessary experience but we are left to take that on their word. \n\nI would suggest that if you come back in a future funding round, the team should break the proposal into smaller parts to make it more feasible. For example, this proposal would be significantly stronger if they had chosen to focus on part 1 and maybe part 2 of the broader project. However, as written it's just too big of a risk, with too many variables, and too little oversight for the community. ", "q1r": 2, "q2": "No, the information provided is not sufficient to audit the progress and success of the proposal. What is unclear is exactly what will be measured here. As written, the proposal is about setting up the SRO, including research and onboarding of additional partners, however there is no corresponding measure as to what shape/form/format the SRO would take. However, the linkage to seniors and the benefits for this cohort leave too much room for interpretation, when it should be explicit. This last caveat is a bit concerning since they are a key focus of the larger proposal. \n\nGiven that there would be a necessary amount of collaboration with other blockchains, I would have suspected that success would include onboarding (x amount) of different chains. What steps will you take to onboard these groups? What happens when you have differences of opinions? What happens when a group opts-out? How do these questions impact the actually adoption/success of the solution?  How will you \"know\" that you have reached the necessary amount of participants to make it legitimate? \n\nThe measurements that are provided (agile system) will then be shared through slack and miro board but there is not much explanation as to how these will get out to the community. The way that the plan is laid out, the marketing and PR is for the final SRO product, not the weekly updates. Would they be dual purpose? \n\nFinally, I would encourage the team to include more tangible success measures that are realistic. For example, to say that success is \"no scams involving seniors\" I am assuming you just mean crypto scams, but all crypto? Would you include groups that are not privy to the SRO method? What happens when a scam undoubtedly targets these groups even after the project is complete? Would those reflect a failure of this project? \n", "q2r": 2, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 362, "q0": "The proposal does a good job of addressing the challenge. The risk managment frame work will be applicable to a variety of blockchain based project. The addresses challenge section does a good job of describing this. That being said it would have been great to get a bit deeper of a look into how the solution will bring projects together and encourage cross-chain collaboration. ", "q0r": 4, "q1": "The teams 150+ years of experience in the space is good for showing they know what they are doing. \n\nThe risks section does a nice job of addressing the risks at hand and their associated difficulties. It follows them up with a decent mitigation plan that can assist in their defusion. One big risk presented is a lack of adoption of the work done by the SRO. This seems like a major risk that is impossible to avoid. Giving numbers on past SRO success would have built more confidence in this section of the proposal to demonstrate that this major risk can be overcome. \n\nOverall the proposal seems exciting and is tackling and important issue but the reader just doesn't have a solid enough understanding of the project, what it will accomplish, and how it will accomplish it to feel confident in the proposal. \n", "q1r": 2, "q2": "The proposed solution does a great job of demonstrating the passion of the proposer and the issue they are trying to solve. Unfortunately this portion of the proposal falls a little short on describing the solution. The reader can infer that the solution is to educate projects on how to exercise risk managment around employing seniors but it isn't entirely clear. A more in-depth description of what building this framework and interacting with it will look like would be great for the reader to further understand the proposal. \n\nThe detailed plan section does a great job of showing when things will be done, how long they will take, who will be doing them, and how much they will cost. This is helpful in illustrating more information on the proposal. One issue in the budget is the amount of money designated for trade shows. Almost half of the budget is directed to this item and yet there isn't much information on how trade shows will come into the picture beyond communicating with projects/people. If $109,878 is going to trade show involvment for the SRO it would have been great to get a very detailed plan as to how the trade shows will be worth their monetary cost.", "q2r": 3, "assessor": "z_assessor_2070", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 929, "q0": "This proposal aims to set up an organization to train and certify its member organizations who would then be viewed as more trustworthy players that senior citizens can rely on. \n\nThe witty proposal title stands for Certification of Senior Education & Risk Management in Decentralized Finance. Thus, the abbreviation should be CoSERMiDeFi which doesn’t sound so witty anymore.\n\nSame way as the title is slightly forced, having this in a Cross-Chain Collaboration challenge sounds a bit far-fetched. Algorand and Helium are mentioned but mere name-dropping is not enough. There is nothing in the plan that specifically talks about engaging these particular blockchains or DEXs built on them. \n\nFinally, DeFi user experience is still so cumbersome that no senior citizen accidentally starts losing their life savings in crypto. There are easier scams to fall for.", "q0r": 2, "q1": "The plan doesn’t sound entirely rooted in reality. Creation of a self-regulatory organization (SRO) is no easy feat. Just to get one started could mean massive legal fees, years of lobbying and rubbing shoulders with political decision makers. Not to mention the aspirations of doing this on a global scale. It takes more than presence in five trade shows and definitely more than 200K to get started.\n\nIn all fairness, this is also recognized by the team itself: “Lack of Capital to achieve the goal is the biggest risk. To be effective globally, CSERDEFI will require buy in from many of the Industry giants and will require a large budget.” Therefore focusing on US collaboration with existing SROs like FINRA would be a more realistic plan.\n\nIf this doesn’t get funded and you still wish to try in the next fund, I suggest you try to get phases 1 and 2 funded first because asking for a massive marketing budget for an organization and service that doesn’t exist yet is nothing short of daydreaming.", "q1r": 2, "q2": "Considering the amount asked, the auditability section is incomplete. It states for Phase 1 and 2 that “Our measurements will align exactly with the steps laid out.” The community will be able to check each deliverable once it is developed. That’s fair.\n\nSince the lion’s share of the budget goes to Phase 3, this should also be the most detailed section when it comes to auditability. Now, however, it’s quite vague and generic. The team says they will measure “1. Initial contact., 2 sale made to Crypto platform., 3. Onboarding and dues paid by Crypto Platform., 4. Certification online course enrollment by individuals., 5 Measurements of a) onboards, b) dues, c) online course enrollment, d) course completions awarded, e) # of Blockchains enrolled.” None of this measures what the proposal was supposed to solve: “predatory practices against vulnerable Senior Citizens”.\n\n(Now, dear proposers, you have two options: Take this feedback to heart and come back in the next fund with a readier concept OR flag this so vPAs can filter it out.)", "q2r": 2, "assessor": "z_assessor_2156", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 982, "q0": "# GENERAL\n\n(+) Senior citizens are heavily \"undervalued\" as a social capital and thus often mistreated in most absurd and dehumanising ways.\nSenior social capital? Think of the stories, the wisdom, the eye-witness reports, that fuel digital stories and content; or the timespace they have to nurture, watch and play with\nchildren.\n\n(+) This proposal aims to resolve the mistreatment and enable fair and transparent practices, by creating a Self Regulatory Organisation (SRO) - on DeFi infrastructure - to protect senior citizens globally, called C.S.E.R.DeFi.\n\n(+) C4S wants Cardano to lead charge over global CSERDeFi lobby and kick off an awareness campaign (that's what the funds of this proposal are for) for senior education on DeFi and how to mitigate abuse with technology. \n\n(-) Points are deducted because the solution summary is misleading and doesn't properly reflect what is described in the proposal.\n\n# IMPACT\nAssessing the impact here is a bit difficult, as there's not enough information presented on how the SRO will be built or how the UX flows in the certification process.\nThe impact on the challenge is not clearly enough articulated; just contacting DeFi players without additional action items or impact to measure in relation to the contact, is not providing a measurable effect on the cross chain collaboration.\n \n(-) Solution needs to be described in more detail; how does CSERDeFi work on a technical (abstraction) level or is the whole process completely manual, how will certificates be issued?\n\n(-) Cardano is not an entity, nor can it receive discount on annual memberships, there seems to be a misunderstanding of the terminology, maybe the Cardano Foundation was meant?\n\n(-) It's not clearly stated in what form the content (code of ethics, agency principles, ...) will be presented? Behind a pay wall/login on website? With token access in a dapp? On-chain as NFT? To assess the impact there needs to be more information available.\n\n(-) Very little info on the SRO itself ( process flows like building buiing phases )\n\n(+-) Ŕisks of regulatory uncertainty and fractional legal landscape are seen but not fully assessed. The proposal only mentions large sums and lobby activity as mitigation tactics.\n\n(+-) It sounds as if this proposal is meant to kick off a campaign for a Senior Citizens. Which is absolutely fine, however should be formulated as such, and not mention the stretch goal (that can't be reached with this budget) in the solution summary.\n\n(-) Besides mentioning to contact DeFi players and other ledger communities, there's nothing more mentioned about the cross chain collaboration impact.", "q0r": 3, "q1": "In general the plan is not detailed enough for the level of funding requested. \n\n(+) Experience relevant and necessary (to execute lobby/awareness campaign) is to be found in the team and their network\n\n(-) The experience and skills to build CSERDeFi are not\n\n(+) Budget breakdown and phase timeline is provided with basic details who?)\n\n(-) Milestones are missing, it is not explained who will be targeted with the direct mail campaign and why,...\n\n(-) budget for conferences seems very tight (5 people participating with registration for a booth for 2000 USD?\n\n(?) Why not have a separate tradeshow /conference proposal? Would be easier to audit and have the proposals get funded.\n\n(?) Maybe good idea to contact and collaborate with social design academy (SDA) on the UX!\n\n(+) very catchy name, might be only english natives \"get\" it immediately\n\n(+-) further funding will be requested annually for membership fee, for What? The advantageous of being a member are not clearly communicated in the proposal.", "q1r": 3, "q2": "The overall auditability is not ideal. The KPIs and success metrics are too broad and are not measuring impact properly. This can be improved upon heavily, some feedback is given below. \n\n(-+) The proposal mentions using \"agile as a system\" to track progress. however agile is a framework not a system, Miro board and slack are not agile in itself, just as a plough and a shovel are not garden work themselves. The framework needs to be imbued with parameters specific to the project (kanban board setup, swim-lanes? workflow limit?; sprint length, review and estimation process?; all this informatin is missing)\n\n(-?) As the proposer is coming from an agile mindset, it might be helpful to take a look at the \"lean canvas\" tool for agile product development; and use the findings to improve the proposal for the next fund.\n\n(-+) It's not mentioned where accomplishments (KPIs?) will be openly displayed for public viewing.\n\n(-) No measurable KPls are defined; would be necessary to audit successfully. For example no mention of impressions, reach or engagement generated on website and numerous platforms where content is pushed to. No mention of focus group tests for content or web UX\n\n(-) In regards to auditability it's not feasible to ask Catalyst coordinators to plough through slack chats and Miro\nboards. Ideally there's a dashboard like experience to give an overview of the projects progress, milestones and achievements, maybe in a Git book?\n\n(-) No KPls for phase 3 propelry defined, the most expensive and impressions generating phase (probably) \n(-) A crypto platform and sales to it are mentioned for the first time (?) \n(-) Course completions are mentioned as a sort of KPI, however the proposal only talks about a \"concept\" and a \"draft of an self certification course\", not when and how it's implemented or accessed.\n\n(-+) The success metrics are pronounced but too general, not time bound, nor specific, and some not really measurable", "q2r": 2, "assessor": "z_assessor_2170", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6239, "q0": "This proposal seeks funding for the creation of a global Self Regulatory Organization for the entire DeFi and Cryptocurency ecosystem, that will train and certify people and organizations for Senior Education & Riskmanagement in DeFi.\nThe problem that the proposer sees is the existence of predatory practices against vulnerable Senior Citizens globally.\nThis is a project to serve the whole cryptocurency industry, not only the Cardano ecosystem. It addresses the challenge by addressing a common challenge for all blockchain communities in the sectors of awareness and understanding, organization and governance, diversity and inclusion and regulation and compliance.\nThe proposal will have a major impact over the whole industry because it will provide a bridge to onboard the senior community to the blockchain revolution.\nPart of the plan of the proposal is to reach out to a number of blockchains for collaboration in an effort for the organization to be inclusive for the whole industry.\nThe period of the proposal is from Q3 2022 to Q3 2024, this exceeds the 6-12 month impact for which the challenge is created.\nI agree that this proposal effectively addresses the challenge.\n", "q0r": 4, "q1": "The proposers consider some project specific risks and provide mitigation strategies for them.\nThe plan of the proposal is very well outlined in detail and clarity. There are exact tasks and exact number of work hours for each task to be completed in a quarterly timeframe.\nThe period of the proposal is from Q3 2022 to Q3 2024, this exceeds the 6-12 month impact for which the challenge is created. This is very obvious and It brings the attention to the fact that there ar not that many working hours per quarter. For example the sum of the working hours for Q2 and Q3 combined (half a year) for 2022 is only about 193 work hours. There is no reasoning provided for this, if the project was full time it will probably fit into the frame of 6-12 months for impact.\nThe budget combined with the plan for the project bring complete picture of the project. We have hourly rates presented for different professions and we notice that most of the budget is going to the expenses for presenting the project on trade shows.\nThe proposal is created of familiar active people in the Catalyst community and they present themselves with the name that the community will recognize them and some experience they have. However they fail to provide any CV or linkedin account for more detail and support. \nDear proposers, I don’t know how and why you have missed this. The presentation of the team is very important in any proposal. A lot of the voters will now nothing about you and the lack of a CV of any kind is a big hit for your proposal.\nThe proposers plan is that the organization will become an internal Cardano Foundation, IOG and Cardano expense, therefore they will not need the Catalyst funding anymore. \nThe proposer has six proposals in fund 9 for a total ask of $548450 and one is funded in fund 8 for $83300.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "For the audit of this proposal the proposer suggests weekly reports and an open slack and miro board for delivering the weekly progress reports.\nThe proposer aligns directly with the plan provided and can use it as a milestone roadmap for the reports and deliverables.\nThe proposer provides measurable KPIs against which the auditor/community could compare the real progress.\nThe success metrics are outlined well and clear. They are very ambitious and it is unknown if they will be ever achieved in their full form. For example: “Success is no scams involving Seniors”. And they are hardly measurable.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12457, "q0": "Generally speaking all blockchains need to onboard people from web2 to grow and all of them need to invent self-regulatory mechanisms before government will, especially in fields of \"vulnerable group protection\", so I think that it is very good field for friendship and cross-chain collaboration. \nThe chosen field is not too broad: Proposer got interest in regulation of Senior education in crypto, and it's a fair start.", "q0r": 5, "q1": "I see only that Kevin is \"NYC broker dealing with Regulators and has an understanding of SROs\", but he is going to regulate, essentially, an educational course. To do that he needs an expertise in educational regulation and, more importantly, some examples of successful and unsuccessful courses in sight. \nI very much doubt that the field is mature enough to just write regulation inside SRO not having somebody like \"legal hacker\" onboard.  \n\nYes, Proposer write that \"We recognize we will need to outsource several issues and either hire or expand our Colab with other community members to accomplish this important project\" but maybe competencies that close to core need to be in the project from start. \n\nI also see relatively high budgets for promotions but don't actually understand, promotion of what.", "q1r": 3, "q2": "It became completely unclear to me at this stage, would it be certification entity for other courses (and for previous course of the Proposer too, but still) or would it be course? \n\nWhat confused me was KPIs: \n\"1. Initial contact., 2 sale made to Crypto platform., 3. Onboarding and dues paid by Crypto Platform., 4. Certification online course enrollment by individuals., 5 Measurements of a) onboards, b) dues, c) online course enrollment, d) course completions awarded, e) # of Blockchains enrolled.\" \n-  and nothing about certified courses. Maybe it is in \"sale\", or \"onboarding\", but it totally confused me, what is the subject of certification then; what amount of them we have now, what is goal amount and how we would track performance. \n\nAnother thing — Proposer certainly wants to onboard other blockchains, and I don't understand from Audability section — Proposer wants to onboard them to their course, to Proposer's SRO with their own courses and certify them, or what is the general schema? I would like to see or read more clear explanation of that and of KPI's. \n\nPS: In case of other's courses certification Proposer can't have specific goals higher than overall amount of courses of that kind, (but I didn't saw that number anywhere) — at least if he can't affect creation of this courses.", "q2r": 2, "assessor": "z_assessor_3419", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Certification of Senior Education & Riskmanagement in DeFi-CSERDeFi. A global SRO (Self Regulatory Organization) formed for training & certifying Staff & Companies in a proactive & continuing process", "experience": "C4S-Cardano4Seniors is a community platform for the education of Seniors about Cryptocurriencies, DeFi with emphasis on Risk Management. One of the members founded Risk & Safety Management in the late 1980s and worked with the Senior Market. Team combined experience 150+ years!"}