{"id": 421375, "author": "quintin", "title": "Cross-Chain NFT Music Player", "url": "https://cardano.ideascale.com/a/dtd/421375-48088", "category": 26598, "amount": 50000, "description": "Music NFTs are not connected to Cardano from other blockchains like Ethereum, Polygon, and Harmony One.", "f6_no_assessments": 8, "f6_rating": 3.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 364, "q0": "The proposal effectively addresses the challenge by building cross-chain support for music based NFTs. The solution would do a good job of brining NFT utility across different chains and communities. ", "q0r": 5, "q1": "TThe team behind the proposal has a history of success on the Cardano blockchain. This builds confidence in their capacity to deliver successfully. It is also great to see they are already working on partnerships with different projects across chains. This shows the team is willing to put in the work with or without Catalyst funding. \n\nThe risks section covers a good set of potential issues with the project along with a few solutions to them. It seems they have properly mitigated the challenges that could arise during deployment. \n\nThe metrics and timeline section gives exact dates which is exciting to see. Unfortunately there isn't any other metrics that will be tracked other than launch times. It would have been great to see metrics on number of wallets connected to site by blockchain, number of metaverse integrations, and number of songs played. In addition to this there isn't a clear set of features or user actions that can be taken. What is the experience like for the fan and the artist? More context would make it easier to see if the project will be successful or not. ", "q1r": 3, "q2": "The proposed solution section provides an overview of a lot of different topics but doesn't quite drill into any of them. I can get a sense of what is inteded to be built but don't understand exactly what an experience with it from a music creator or listener perspective will be. Additionally there isn't a described set of features that make it easy to understand how the user can interact with the product.\n\nOverall the proposal is exciting but lacks the proper context to truly understand what the product will be. There are notes on an NFT media player, marketplace, and different metaverse integrations but never a solid view of exactly what these things will act like. ", "q2r": 2, "assessor": "z_assessor_2070", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"id": 1393, "q0": "Yes, this proposal addresses the challenge by providing a music player that will be built on Cardano but able to connect to different wallets from other chains, thereby allowing users to play songs from any chain in their player. \n\nThis is a unique proposal in this category. So I start by commending the proposers on the idea. In principle the idea is excellent but I am left a bit wondering about the impact this would have for Cardano, in the following ways. \n\nThe proposers suggest that as more artists come to blockchain ecosystems, they will want to be blockchain agnostic in order to maximize their reach. At first blush this makes sense, however, what is not well explained is the actual process. Would it be the musicians who move seamlessly or the fans? Would a musician not need to launch/release their album/music on a particular chain in order to mint it? To this end, the musicians would likely not be agnostic, they would have to go to the chain where most of their fans are, no?\n\nWhat the solution appears to do (or at least this feels implied) is allow fans to mint music from their favourite artist (on whatever chain the artist minted on) and then listen to all those different music from across chains in the Cardano player. \n\nPerhaps I am missing something here but it don't think so. I still think the idea but the way it's framed is not very clear as written. This idea would be great for those on Cardano who use the music player but how it would improve cross-chain collaboration beyond the community could be better explained. ", "q0r": 4, "q1": "Given the experience and plan presented it is somewhat likely this proposal will be implemented successfully. \n\nThe strongest component of this section in the proposal is the listed team members who hold an impressive repertoire of achievements. In addition to seemingly having the music expertise the proposal also represents some large players in the Cardano community (NFT Maker.io) who have a very good reputation for ideating and implementing innovative ideas. \n\nI do wish the plan was a bit more robust and provided better explanations of the steps required to build the music player. The proposers say they will have the media player on soundrig.io but when visiting the website there is just a fillable form. Given that the proposal suggests a July 30, 2022 launch date for the player I'd hope for at least an MVP. Unfortunately in this instance I again am left wondering. \n\nSince we do not have a breakdown of activities it is hard to know whether the lump sums in the budget are appropriate. Some additional clarity around this would be very helpful and likely would increase the score further. ", "q1r": 4, "q2": "The information in the proposal could be improved for auditing the progress and the success of the proposal. \n\nWe are left with two deliverables, launch the player on July 30, then have cross chain compatibility on September 28. Unfortunately this leaves much to be desired for how progress would be tracked, beyond a simple yes/no. For the request of $50k it would be preferred to have some sort of description of expected steps, the intended outcomes, and then actual way you will track whether what was expected matched the real outcome. Just saying yes/no offers no real indication of whether it was a success. \n\nMoreover, since there is a two month window between the deliverables, would there not be opportunities to provide updates to the community? Dev updates? Progress updates on linking with other chains? These are easy things that could help audit the progress and success of the proposal. \n\nI would encourage the team to provide a bit better of an explanation around some of the key gaps highlighted here if they resubmit. The idea is great. Execution could be improved. ", "q2r": 3, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1753, "q0": "The problem is well-defined in the opening statement. And a solution that seems to offer access cross-chain portability for music NFTs from other blockchains is certainly a fit for the interoperability the challenge seeks.\n\nThe project is a unique opportunity to offer a different kind of \"bridge\" to those from other blockchains to Cardano by helping the music NFTs work from chain to chain.\n\nAfter looking through the KPIs of the Challenge, it is clear that the project does have 2 KPIs in common. Voters could benefit from the team maintaining this match in all KPIs.\n\nThe risks and mitigations are thorough and well thought out. It seems the team has left no stone unturned in their preparation. Indeed, an easy task for voters to verify.\n\nThe issues explained are the rationale to the 3 stars offered in this section.", "q0r": 3, "q1": "There are many people mentioned in the section of \"people who will work on the project,\" and experiences both relevant and irrelevant included. If rewriting, consider only adding in relevant experience and the specific work each teammate will perform to give voters better awareness.\n\nThe budget is broken into sections but given no detail beyond that point. When rewriting, please include more detail to the budget, including hourly wages and all items paid for in each category beyond labor itself. Added to this, the team may consider a contingency budget of a standard 5%-10% for unexpected issues arising from such explorative work.\n\nThe team plans to come back to Catalyst for future endeavors. For the reasons mentioned, the section receives 3 stars.", "q1r": 3, "q2": "The concept of this section, and the whole proposal, are fantastic in their essential elements and likely desired by users (though no data is offered about evident user desirability for such a build). Please know that you will likely succeed if you rewrite and consider the missing elements. Voter support will likely increase as more fields are thoroughly filled in, as suggested.\n\nIn Auditability, there is no roadmap beyond the description of 2 deliverables, one of which isn't even budgeted for (the music player itself) instead of the actual steps that would come before completion of true cross-chain interoperability. Though the deliverables constitute KPIs, other progress markers could be offered, such as the use of the marketplace or traffic to media produced to promote to others. Thus, 2 stars is offered in Auditability.\n\nThe team and community would also benefit from periodical updates to a Gitbook for auditability as well.\n\nIf the proposal is rewritten for a future fund, voters will surely be excited to see the \"gaps\" filled in so we can see what you'll eventually create! Thank you for bringing this idea and plan to the table. It's inspiring to see such creativity that allows for a far less \"silo-ed\" multi-chain future involving music, no less!\n", "q2r": 2, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4215, "q0": "The \"Cross-chain NFT music player\" proposal addresses the Cross-chain collaboration challenge by developing a cross-chain NFT media player on Cardano and https://brave.com to connect music NFTs from other blockchains like Ethereum and Polygon to Cardano. This will create collaboration with projects from other chains to have them work with other musicians. The team will develop SoundRig Media Player as a proof of concept to attract other blockchains to come to Cardano. The project will attract and onboard new musicians and new consumers and even new developers. The proposal has listed down risk possibilities with way to mitigate those risks. It seems that the proposer team has considered building Cardano marketplace to generate revenue stream and they view their media player as attractive features that will draw new consumers from other music blockchains. They have formed the agreement with Metaverse project like HarmonyWorld to provide their musical content for their project.  Their project will allow users from other blockchains to discover Cardano through music and drive adoption. ", "q0r": 5, "q1": "The project duration has not been directly specified by the team but they list their release dates for 2 features during July and Sept: NFT media player to connect to other Cardano wallets and also connect Metamask/ other chain wallets (Brave integration) to play their NFT media player. The total budget of $50000 has been broken down for media player and marketplace cross chain integration with the majority going to the brave integration. The project should list down the pay rate and number of hours working in this project along with project duration. The team is comprised of founders from many protocols and lends to the credibility of this project. There are a verifiable plan for other funding that they mentioned ie. launching primary sales and secondary sales in the marketplace. They have considered all relevant risks and challenges and make action plan to make this project a success.", "q1r": 4, "q2": "They will measure project success with the successful launch  (release date in July and Sept with their music NFT media player and cross chain integration). The proposal should give more info on timeline as the milestones alone would be quite hard for the community to check if the project is on track. The community can observe the project progress by tracking soundrig.io or checking out their marketplace with the cross-chain capability.  Alternatively, the team should update project progress via their preferred channels either github or bi-weekly meetings. They understood the problem and came up with the well-thought-out solution to link the Music NFTs between blockchains. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6895, "q0": "-\tThe proposal aims at breaking down the barriers between blockchains by building cross-chain interoperability for  allowing music to be played in multiple blockchain ecosystems / metaverses.\n-\tThis will allow artists to bring their music to mutliple blockchain ecosystems, access different fan bases, activate multiple experiences ( streaming, meta-verse concerts, remixing, licensing ) and scale up the value they derive from their content\n-\tIn doing so, it challenges the Cardano Ecosystem to provide tools needed for such innovations to materialize and also positions Cardano to compete with some recent products in the blockchain-music niche market ( Audius, UtopiaMusic, Musicoin )\n-\tThe team is qualified, experienced in the industry and is expanding its networking with artists and events. \n-\tThe challenge is in creating a player capable of cross chain interoperability for music which may require some fundamental research in media asset management, and getting a Minimum Viable Product to market\n", "q0r": 5, "q1": "-\tThe cost breakdown appears to be adequate and brings together competencies much needed at this early startup stage ( technical, community management,  partnership management, legal)\n-\tThe roadmap Q3-2022 has been provided but maybe too optimistic. Immediate objectives for this proposal and how the features will be researched and implemented could benefit from further clarification. There isn’t much prior art in the specific area of cross chain inter-operable media streaming, which may be a challenge. So scoping out a Proof of Concept, then a Minimum Viable Product, could be helpful before investing further into a final product.\n-\tSome further details on the go to market strategy could help better understand if there may be some gaps in this respect, i.e marketing and communications campaign and gearing up with an operations team, business developers & partnership managers  to develop the cross-chain partnerships needed. This may also include partnerships with academic bodies for further research in implementing high-performance Media Player in a fragmented blockchain environment, which may require different legal (smart contract) interfaces with each protocol, as well as blockchain based Content Delivery Networks for efficient streaming.\n-\tSetting up a business model canvas to explore an operating business model could highlight some other gaps or hypotheses that the team is making and allow the team to test them ( https://www.strategyzer.com/canvas/business-model-canvas) \n-\tThe tokenomics for a blockchain based application would also need to be designed to clarify the incentivization model, licensing and royalty payments through utility or payment tokens or fiat money, specially in a cross-chain environment.\nIn order to accelerate time to value, the team could consider looking at some of the references below: \nSome developments in the Ethereum space with regards to royalty standards : \n-\thttps://eips.ethereum.org/EIPS/eip-2981 - standard for royalties in Ethereum\n-\thttps://cips.cardano.org/cips/cip27/#simplesummary standard for royalties in Cardano\n-\thttps://www.openlaw.io/ - platform for legal smart contrats for implementing contractual relationships\n-\thttps://accordproject.org/ , open source software for smart legal contracts\n-\t\nDigital rights management : \n-\thttps://www.zdnet.com/finance/blockchain/new-platform-uses-nfts-as-a-gateway-for-digital-rights-management/ \no\thttps://rair.tech/ - Blockchain based digital rights management platform\n-\tOpenMusic Initiative, https://open-music.org/ that has created some open standards for creating and sharing music\nThere are also some similar proposals in Fund9, so probably setting up a Cardano community focussing on the music industry, eg a Guild or even a consortium going forward could benefit everyone : \n-\tLicensing Remixed Music On-Chain, https://cardano.ideascale.com/c/idea/421968\n-\tProject Catalyst... for Musicians , https://cardano.ideascale.com/c/idea/414440\n-\tDecentralizeMusic.com, https://cardano.ideascale.com/c/idea/414289\n-\tPerma-music rmNFT Marketplace, https://cardano.ideascale.com/c/idea/415152\n-\tCardano For Musicians , https://cardano.ideascale.com/c/idea/419013\n-\tCardano Music Marketplace, https://cardano.ideascale.com/c/idea/416274\n", "q1r": 3, "q2": "-\tThe team is clear on releasing a player for the SoundRig platform and aiming for at least one other blockchain. As there is a go to market phase, the team may benefit from planning for some indicators for feedback collection eg : number of users using it, number of interviews, ( groups, individuals) , feature requests using a user-voice mechanism. It will be useful to gauge how well the product is being received by customers and the potential for growing it into a mature product.\n-\tAs this is an arts & entertainment space with active players the product needs to be solid in terms of customer experience and stable in order to develop the acquisition level it clearly deserves. Poor user experience could probably adversely affect growth, so some caution may be needed there. The team is rather experienced, so I would assume this is taken care of.\n-\tNonetheless, some operational KPIs may be handy as the user-base scales, eg, some performance related metrics like number of crashes of application, security issues uncovered, outages, support requests and resolution rates. This could inform the sizing of the operations team needed as the application scales. \n", "q2r": 3, "assessor": "z_assessor_2845", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8927, "q0": "Demand and growth of NFT is growing each and every day, many people around the world wants music to be converted to NFT's, hence the idea of developing a cross-chain NFT music media player on Cardano is great where it will help all other crypto users to divert towards cardano block chain.\nThe presented plan also helps in easy cross chain collaboration with other crypto societies, which will definitely help in bringing in stability of cardano prices, by this project migrating rate increases from other platforms to cardano's catalyst project. hence, this proposal effectively addresses the challenge", "q0r": 5, "q1": "The mentioned task is not simple to achieve , as it also needs to gain trust from other blockchains like Ethereum, Polygon, and Harmony One. but the idea of using music to achieve this is definitely great idea. \nThe proposer has a team where it involves lot of engineers , which includes backend , frontend and a member who was working for \"Cardano for Ukraine\" as a lead, the team has also experienced marketing team, So with the provided team and well planned decent solution to the challenge, the plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal contains detailed solution to the problem and has displayed clear picture on how to develop music player then  to make partnerships for instance with projects from other chains to have them work with other musicians in Web 3.0. The audit has presented many risk that are involved in the project ,and this shows that the team has already done its pre calculations to complete the project.\nThe plan has introduced the team in a very detailed manner and presented each person's expertise field , the presented plan has well structured time line and decent budget breaking idea. hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12582, "q0": "The problem in the challenge that needs to be solved is that the musical NFT is not connected to Cardano from other blockchains such as Ethereum, Polygon, and Harmony One. Through that, the proponent has demonstrated that it will add value to the system. And the Cardano ecosystem by allowing others to listen to their favorite NFT music on Cardano from other blockchains. Music NFT Media Player will be compatible with multiple chains that will help users from other blockchains discover Cardano. The proponent has also sought to create partnerships with many projects on other blockchains to gain traction. Is establishing agreements with various Metaverse projects on other blockchains. This will also allow the team to create partnerships and be able to scale to address future challenges, which will grow. Full SoundRig Media Player on Cardano. I completely agree that this proposal effectively addresses the challenge. I rate 5*.\n", "q0r": 5, "q1": "The proponent has provided detailed information about the people who will work on the project of 11 people, the proponent has also given the specific information of the 11 project members clearly and in detail. The budget proposed by the proponent is clearly outlined and broken down into items we can identify, with the detailed budget proposed by the proponent is as follows: ( Media Player cross-chain integration - $ 2,500 (50 hours). Cross-chain backend on the market - $15,000 (210 hours).\nBrave Integration: $20,000. Team and Developer Growth - $7000. Marketing - $5500). Proponent gives a realistic timetable, first released date is July 28, 2022- Connection to Cardano wallets other to play music on Music NFT Media Player. 2nd Release Date: September 28, 2022-Connect Metamask/other blockchain wallets to play on media players. Allows users to listen to their music from other blockchains on one interface, create playlists and connect to wallets from other blockchains to listen to NFTs of their favorite music. But as for the timing, I hope the proponent can come up with a pre-release schedule to make it even easier to follow. I see that with this project, the proponent poses a lot of risks, but besides that, the proponent has also provided useful solutions for the project, I see this as a big plus of the feasibility of the project. recommended for implementation. This shows that the project proponent is someone with a lot of experience in this area and I believe it will most likely be implemented successfully. I rate this project 5*.\n\n", "q1r": 5, "q2": "As mentioned in the feasibility of this project, the roadmap of this project will be released in 2 days, on July 28, 2022, and September 28, 2022. The success will be achieved in two parts:\nCross-chain compatible media player available on SoundRig.io\nThe cross-chain marketplace was established to be compatible with at least one other blockchain. I fully agree that this recommendation provides me with sufficient information to gauge progress towards goals. With this project, I rate 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14867, "q0": "Indeed a fascinating solution to cross-chain collaboration. If this project can collaborate with other chains successfully. However, it would be more persuasive if they provide more information about the company like their initial users, current artists, and the technical aspects behind transforming music into NFTs and playing them cross-chain, etc. Considering  the foreseeable risks, they have solutions for each of them and the risks are all well-addressed. I don’t have any proposed risks. ", "q0r": 4, "q1": "The roadmap they provide is too general, there is too little information to decide if they can be achievable or not. The team should be more specific in terms of how they execute their plan. Let’s take an example here, with the milestone of releasing music NFT media player, they can write more about their progress, what they have finished and what they haven’t finished to launch the player. Similarly, connecting other blockchain wallets to play on media can be added more information on what blockchains they have in their mind other than wallets from Metamask, the amount of work that needs to be done in this process, etc. The budget breakdown includes marketing expenses so the marketing plan could also be further presented. \nI suggest the team give social media accounts of the members for more references and to make it easier for the community to reach out for project-related issues. Plus, the role of the member listed in this part should be cited and we focus on experience related to the project only to be better understood. Nevertheless, members of this project seem capable because they hold many important positions in other organizations. ", "q1r": 3, "q2": "The team should give a platform where they update their project’s progress so that community could follow its development. The success of this project envisioned by the team is quite simple: compatible media player available and the compatible of at least one blockchain. May I suggest other metrics we can use to track its success? I have the number of wallets that use this player to play music, the number of new artists, etc in my mind. ", "q2r": 3, "assessor": "z_assessor_4106", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We are developing a cross-chain NFT music media player on Cardano and (https://brave.com)to connect music NFTs from other blockchains like Ethereum and Polygon to Cardano.", "experience": "Tobias Steffen & Sunny Basra were the Integration Partner and Client Relations Managers for (NFT-MAKER).\nQuintin Bray-Stone is a founder of (DaBand.io)\nNhan Nguyen & Tuan Pham are Software Engineers for (https://www.uac.edu.au/) & (NFTjam)"}