{"id": 421661, "author": "iamyashablack", "title": "Spectrum.Network | Layer 2 for DeFi", "url": "https://cardano.ideascale.com/a/dtd/421661-48088", "category": 26598, "amount": 312000, "description": "There's no direct access to the liquidity of other blockchains for dApps. Moreover, there's no decentralized way to transfer liquidity across different DeFi protocols. CEX is the only tool.", "f6_no_assessments": 7, "f6_rating": 4.380952380952381, "videos": [], "media": [], "f6_assessments": [{"id": 3060, "q0": "The proposal gives an idea of ​​​​building a layer 2 scaling solution through the Spectrum network. The proposal clearly pointed out the problems of current cross-chain bridges: the lack of transparency, security, and centralization. To solve the problems on the spectrum network, proposal will use the optimized Roll-Dpos collusion mechanism.\nThe community can refer to Iotex's short explanation of Roll-Dpos here https://www.youtube.com/watch?v=ysdFgTt70Lw\nBasically, this is a great new idea to use the Roll-Dpos consensus mechanism to create a network of intermediaries connecting heterogeneous blockchains. However, I have some notes for the community to consider about the spectrum network's solution, which in my opinion has not been clearly stated.\n1. To solve the problem of decentralization: spectrum network uses roll-dpos and there will be thousands of network nodes joining the network to create decentralization. However, what is the economic incentive for network node participants? although the proposal outlines this as follows: The fidelity of the selected participants is achieved by economic incentives built on the prisoner's dilemma from the theory game, which states that it is more profitable for each participant to betray the attacker and receive a reward than to join the attacker and take the penalty. But in a blockchain that specializes in IoT processing, this roll-dpos is feasible because the number of iot-related transactions is very large and has a small value. This creates an economic incentive for validators to participate heavily and reduces the possibility of network manipulation due to the small transaction value. Defi is completely different, the current Defi transaction is divided into small value transactions and large value transactions. Therefore, it is also necessary to have two solutions for the benefits for the nodes participating in these two types of transactions in Defi to create security for the network. Collusion to manipulate and attack the network will depend on the speed of transaction authentication, the processing mechanism when detecting fraud.\n2. The current cross-chain bridges are all built under the EVM server due to the large number of blockchains using the solidity language and these blockchains also use the Accounting ledger. According to the proposed solution, the Spectrum network will have no limitation on connecting heterogeneous blockchains. Maybe, the structure layer of the spectrum network can handle all data from blockchains with different background structures, so the infrastructure for the spectrum network can understand all smart contract programming languages, the data structures of the ledgers. Basically every programming language can \"understand\" each other if it is compiled to the same basic programming language. Perhaps the proposal will introduce this in the future so that the community can better evaluate.\nIf the proposal can clarify more about the economic motivation for the participants of the authentication network as mentioned in point 1 above and the safety and integrity of data as presented in point 2, then I assess This proposal will have a huge impact on the entire Defi and Cardano ecosystem. If judging from a personal point of view, I think the idea of ​​spectrum network is very good, worth developing. But to evaluate from a perspective of a proposal related to finance, it is still necessary to give more details on risk prevention solutions to create trust for the community.", "q0r": 4, "q1": "This proposal will be implemented and completed in 6 months according to the detailed plan of the proposal. The implementation process is all the basic steps to establish a consensus network, create the necessary execution environments for a network to operate in the blockchain, create a test environment or testnet. If it's a regular team, I think this plan is unlikely to be feasible. However, the proposed team to implement the proposal is the ErgoDex development team, this is a team that has time to research and develop Dapps in 2 blockchains Cardano and Ergo. They are fully experienced enough to handle problems that arise during the implementation of the proposal. These factors have greatly shortened the steps needed to create a new layer 2 solution. And the goal of this proposal is just the initial stage of building the network and implementing the cross-chain bridge in its most basic form.\nThe proposed budget of $300,000 I consider reasonable compared to the potential generated by the proposal. Allocate the total budget to each individual who is primarily responsible for the implementation of the proposal for a period of 6 months and does not take into account other resources. This is an encouraging point as the proposal team can manage this part of the cost themselves.\nThe feasibility of this proposal is very high however I have a small note to the community and may not affect the feasibility of the proposal. The budget of the proposal is $300,000, almost a third of the total budget of the challenge. This can be an impact on the effectiveness and objective of the challenge.", "q1r": 5, "q2": "Based on the detailed plan and key metric given in the proposal, it is not possible to track the progress of the proposal, the proposer should provide more specific information such as:\n1. What source is tracking and checking?\n2. Will the proposed activities be reported on a weekly or monthly basis?\n3. Monthly dynamics of dApps created on top of Spectrum.Netwrok need to give specific KPIs.\nSince this is a very technically complex proposal, the more transparent testing sources are available, the easier it is for the community to be able to check.\nHow successful the project will look, if proposal reaches the testnet stage of the spectrum network without any serious security bug that discovered, there are some Dapps that accept to run the testnet, then this proposal will be very successful. In the future, project will create a strong attraction for Cardano and other blockchains. Promote the Defi ecosystem, which is showing signs of strong decline when the crypto market entered the downtrend season.", "q2r": 3, "assessor": "z_assessor_2394", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 821, "q0": "ErgoDEX want to build a layer 2 solution for cross chain swaps and transferring liquidity between different blockchain dApps. This interoperability layer allows for cross chain swaps without trusted third parties in a more decentralised way which increases validators from the hundreds to the thousands. The will be a major innovation on Cardano bringing increased liquidity to DeFi applications. Third party dApps will be able to build on top of the layer 2, which will increase the ecosystem for Cardano and Ergo users. Ergo is a growing blockchain, and I hope for increased interoperability between the two blockchains.", "q0r": 5, "q1": "ErgoDEX is the decentralised AMM on Ergo. The team has built the DEX without a token raise. ErgoDEX will soon launch on Cardano. At that time we can expect the launch of their token which will be one of the fairest launches among Cardano's DEX tokens. I have full confidence in the ErgoDEX team to deliver their platform. Project roadmap and timeline could be more detailed, but is sufficient.", "q1r": 5, "q2": "The number of bugs and issues during testnet  is given as a measurement of progress with an expected downtrend after each update. I'd like to see more KPIs which could be monitored during development. KPIs for the success of the completed project are clear and measurable.", "q2r": 4, "assessor": "z_assessor_2133", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1414, "q0": "The proposer introduces solution that enables decentralized exchanges to increase transaction efficiency, increase liquidity and cross-chain interaction, and act as a focal point for cross-chain transactions.\nTechnically, as we know most of the old Defi build on layer 1 blockchain with classical protocols that have many limitations such as low performance, liquidity limit and swap between native currency in decentralized and native manner. Cross-chain Defi solves the burden of layer 1 transactions with faster and cheaper cross-chain transactions.\nHigh performance cross-chain Spectrum.Network will impact the development of decentralized financial applications. It becomes easier, faster and more diverse. Based on the results (open source) of this project, it will be easier for developers to create applications that are more realistic, bring more transactions and therefore it will add value to the Cardano ecosystem. This proposal satisfies the goal of the challenge to Build real-world solutions based on the Cardano blockchain.\n", "q0r": 5, "q1": "If this project is funded and successful implemented, based on the open source code provided by the project, it will probably help a large number of dApps to be built very quickly in the near future, making dApps become more popular, closer to real life, making blockchain-based applications more valuable.\n\nThe team behind this proposal has a wealth of experience from successful ErgoDEX projects. They have CTOs with 5 years of experience joining ErgoDEX from the beginning, CPOs of 5 years of experience, etc. and many others who have successfully built ErgoDEX. They have the right expertise to ensure a successful implementation this project.\n\nThe proposal budget is affordable. The development of this project requires a lot of experts with high experience and expertise in the blockchain field. High expenses for specialized personnel will create quality products. I believe these investments are reasonable.\n\nThis proposal is to be implemented for 6 months with plans and works being done are described in detail. There are experts with lot of experience in implementing technology solutions on the blockchain platform.\n", "q1r": 5, "q2": "Roadmap and milestones are presented in clear and detailed manner. The tasks to be done are listed specifically and the completed results are reported on a monthly basis, so it is easy to track and evaluate the performance results.\nInformation about the project and key personnel, the team is publicized on social networks and the website, Github … Metrics/KPIs and performance results is updated monthly for community’s auditability.\n\n", "q2r": 5, "assessor": "z_assessor_2237", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1757, "q0": "Utilizing Catalyst funds for this endeavor aligns with several central areas of the Challenge. It also is sure to add many users to Cardano through interoperability and creates even greater value for the blockchain. The problem is well defined, and the issue of there being no liquidity for other blockchains for dApps makes sense.\n\nThe KPIs are an excellent match for the Challenge. Growth to on-chain activity from cross-chain implementations (of their open source dApp), including participants from other blockchains and several others, propose to feel tailor-made for a Challenge such as this. Voters often reward such effort and will see that, as expected, the KPIs are on track with the Challenge. There is little to offer beyond stating. \n\nThe information offered in their solution is exemplary. This highly skilled dev work (Rust) and breaking down everything the way they did means voters can either take the time to learn or just go to the end and read the \"bringing it all together statement\" this was a conscientious move on the part of the team.\n\nA few risks are offered, though some could use fuller detail for the benefit of voters. The mitigation for the first, answering a lack of dev forces with \"we will definitely find people…\" is inadequate to voters often looking for concrete examples. Perhaps \"there are several potential candidates identified (if there are), we have a pool of developers to choose from\" or something even more like \"we've already begun conversations with candidates in case the need arises.\" For this issue, the section receives 4 stars.", "q0r": 4, "q1": "The skill sets are evident in the specific work named in the budget. The team has an extensive collection of knowledge and experience that are more than adequate. They also have a sizable team and will undoubtedly be able to accomplish the work. The links added were supplemental and show even more relevant experience. It is good that the team added both, as some voters will likely not have time to look into each link. \n\nThe budget is broken down into roles and specifies the type of development work and team roles they will take. Voters benefit from clarity in the numbers, \"showing their work\" for all math, so voters don't have to wonder or go to the trouble themselves.\n\nNext is to consider if the price is reasonable. My own extensive experience as a researcher was hardly necessary to find that many in the field charge twice as much as this team will for its Rust Development. Kudos to them for being good stewards of the Community Funds. The team should feel encouraged to set prices closer to the industry standard if continuing in future funds. That said, it is most practical for this project to ask for the total amount in one fund.\n\nThe plan is detailed and implementable. The actionable tasks are straightforward, and though the reader could benefit from a bit more of a breakdown of steps, it is clear that the team is building something new and will only have those details in their final examination.\n\nThe timetable is a straightforward 6-month set of milestones seen in the detailed plan. \n\nOne concern is the discrepancy between the question of whether they are working on a previous proposal or not, and they answer \"no,\" and later offer a link to their last 12-month plan. If rewriting, please make the needed correction. It is only due to the inaccuracy mentioned that this section receives only 4 stars.", "q1r": 4, "q2": "Voters can see that the work of the previous proposal is almost wrapped and that the team seems to be delivering on time. \n\nThere is a lack of a roadmap or sufficient metrics to measure the whole project. The 3 KPIs offered can in full quantify success, though each one represents many more within each that would give voters and the team a more complex view of outcomes.\n\nThe community can track their project through the Gitbook provided. Voters are encouraged to check out the work done in the past proposal. Rationales provided, the section receives 4 stars.", "q2r": 4, "assessor": "z_assessor_2261", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1851, "q0": "This proposal addresses the challenge for interoperability as the team intends to build a Layer 2 (L2) for Ergo and Cardano in a decentralized way so that there is enough liquidity for DeFi. The team will use Roll-dPoS consensus protocol to support many participants. The team is states that Roll-dPoS will be decentralized (with thousands of nodes), high security, providing cheap and fast transactions and high tolerance to network churn. The team have stated the risks with their solutions on delivering this project. They have already partnered with experienced developers in Ergo and Cardano. However, the team is not fully confident using Roll-dPoS as it is one of their risks for impractical consensus protocol. They stated that they will partner with a company that successfully applied Roll-DPoS in their network to get some advice but did not share any information of the potential companies. This project able to scale between Ergo and Cardano which have quite massive blockchain users, but they can scale even higher when they integrate with EVMs. ", "q0r": 4, "q1": "The team have the experience to execute this project. In fact, they have already built ErgoDEX protocol on Cardano using Plutus language. The team have knowledge in Haskell and Plutus languages which helps to build a more secure protocol on Cardano. The budget breakdown is detailed enough as we know it is used for the developers to build this L2 protocol. Furthermore, the budget is reasonable as it is the market rate for full time developers. The timeframe stated to deliver this project (as testnet) is 5-6 months. They have given some information of the project milestones. With the experience of the team, the project timeline is practical and achievable to get a working testnet. The team may need someone as a project manager to ensure the team is able to achieve the milestone on time. They also may need to market themselves for the rest of the Cardano and Ergo community know, use and build on their L2 protocol. ", "q1r": 4, "q2": "The team will provide open-source codes in github for people to audit the team’s progress on this project. However, it is enough for the community to monitor their progress with just codes. Many people are not sophisticated enough to read and understand codes. The team should provide updates in Town Halls with data to back them up regarding their progress whether they are hitting the milestones in their 5-6 months’ timeframe. Or they can provide updates via Twitter and Blog posts with data as proof. The other auditing metrics provided in the proposal is when the testnet is running such as number of bugs, no. of network validators, and no. of dApps built on their L2 protocol. The team can also have third parties to audit their codes to ensure security for users using the L2 protocol. This is to avoid any hacks or stolen funds happening such as in Ethereum, Binance or Solana blockchains.", "q2r": 4, "assessor": "z_assessor_2274", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4545, "q0": "The proposer provides answers that address most of the criteria and are in great detail for me to assess its impact. The solution proposed is a decentralized, natively cross-chain dApps platform that aims to solve the lack of means to transfer liquidity across different Defi protocols. The proposer provides an excellent overview of the landscape, including the current state of Defi and its constraints, the current state of cross-chain Defi, its existing solutions and trade-offs, and goes on to elaborate on how Spectrum.Network plans to address the current gap in the market. This proposal addresses 5 sub-challenges within the Cross-Chain Collaboration Challenge and meets Fund9's strategic goal as an open-source project that will attract more developers. The proposer also puts into consideration a longer-term plan to scale the project sustainably (e.g., build user-friendly dApps on top of the platform, and engage the developer community). There are two recommendations I have for the team to make this section even stronger and more convincing to the community. First, I would hope to see more elaboration or quantitative metrics regarding how it will add value to the Cardano community specifically after this phase (i.e., the cross-chain capability between Ergo and Cardano). Second, I would suggest the proposer have a high-level roadmap for which layer 1s it plans to connect after this phase, and probably select a chain from the priority list of this challenge.\n", "q0r": 4, "q1": "I agree that this proposal's implementation is feasible. The most important feasibility factor is that the team has been working together for more than 2 years and is working to launch ErgoDEX on Cardano (they have run on the Cardano testnet since May). ErgoDEX was funded in F5 and their good progress is strong evidence for the team's ability to execute. The proposer provides a timeline of 6 months with key deliverables for each month. The budget is proposed for 5 team members (2 developers, 1 blockchain researcher, 1 QA, and 1 PM) and the suggested monthly salary for each role is very reasonable. I hope the team could implement this great idea, and I would suggest the following points to consider: (1) please address the technical aspects of the product. Given that they want to build the first in the market decentralized, cross-chain platform, I would expect the team to have some sort of white paper or technical R&D paper to demonstrate their plan; (2) please consider security, speed, or other trade-offs under risks & mitigation. As the crypto community has witnessed a number of high-profile hacks on bridges for various reasons, a thoughtful consideration here will be appreciated by the community.\n", "q1r": 4, "q2": "I agree that the proposal is verifiable. The vision for success is provided qualitatively with three criteria. In addition, there are three KPIs that the team will use to measure the project's progress. Having a past funded project (in Fund5) that is on track is another support for the team's commitment. What I think the team could consider as well are metrics that show the project addresses the problem it raised; for example, the volume being moved between Cardano and Ergo, the number of new users, etc. It will also be easier for the community to verify this project if the team provides a more detailed timeline and milestones (such as a GANTT chart) and one or more communication channels where the proposer will update the community on its progress.\n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11522, "q0": "This proposal aims to improve and decentralize finance from Layer 1 to Layer 2 solution to improve capital efficiency and user experience for DeFi apps. Spectrum-Network provides better solution to centralized Trusted Oracle or semi-centralized oracle network with decentralized consensus protocol for cross-chain computations, allowing for even cheaper transaction fees and bigger throughput with network always up for processing. Further scaling and sustainability are based on future funding, adoption of network and public willingness to collaborate to open-source project. Proposal provides solution to KPIs defined by challenge setting, identifies problem within and describes solution, with global impact to Cardano ecosystem this is highly impactful proposal.", "q0r": 5, "q1": "Detailed enumeration of current solution and possible risks and their mitigation is elaborated in proposal. Technical details like technologies and programming languages are provided and align with Cardano technologies, which is good sign for open-source project and later on Cardano community devs can contribute and improve solution further on. Budget is carefully design with identification of roles needed to fulfill project needs and monthly wages appropriately and reasonable set. With provided GitHub repos and LinkedIn references it is safe to say that team is well suited for job. Experienced and long collaborating team (as proposed) will deliver project with better price to work ratio as a lot of communication is fine tuned. Timetable is realistic, with general description of items, further description of every phase would improve proposal. In proposal is missing assignment of roles to tasks, and tasks could be more precisely described. After delivery of product, I would advise team to provide example apps and thorough documentation of how to use this technology to improve learning curve for devs. Also, audit of code by some third party could ensure better security of network. Feasibility section provided me with enough evidence to evaluate it with full star rating.", "q1r": 5, "q2": "With code being 100% open-source auditing of project process is relatively easy for experienced auditor. KPIs for success of project are partially auditable on following counts of GitHub issues with need of proposal team to provide community an evaluation of dynamics of network validators and dApp created, plus counts of new apps developed or migrated to network. Proposal provides solution to stated problem and helps Ergo-Cardano cross-chain collaboration, improves decentralization and it’s KPIs are properly auditable.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Build a platform for natively cross-chain dApps based on a decentralized consensus protocol.", "experience": "Our team includes blockchain developers and managers working together for 2+ years. We are good at dev management, product management, and in such technologies as Scala, Haskell, Plutus, Rust, and TypeScript. Launched ErgoDEX - AMM protocol on top of Ergo and Cardano blockchains."}