{"id": 421608, "author": "rmbrt", "title": "Multi-chain token bridge", "url": "https://cardano.ideascale.com/a/dtd/421608-48088", "category": 26598, "amount": 231525, "description": "Cardano, like most blockchains, is currently isolated and only few solutions for bridges exist. Existing solutions are not extendable to new chains or require trust in its operators (can get hacked).", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 16, "q0": "I agree with proposer that Cardano, like most blockchains, is currently isolated and only few solutions for bridges exist. There are and there were many bridge proposals in Project Catalyst and there are many more in the other cryptocurrencies. But which bridge solution idea is worth of trying? So I analysed this proposal in details and the proposed solution - Erdstall (the multi-L1 L2 chain) looks really interesting", "q0r": 5, "q1": "PolyCrypt, the company behind this proposal  is developing off-chain protocols and frameworks since 2018. What’s really good is that they have experience with Cardano already. In past, in Fund8 they already applied in Project Catalyst and didn’t win. They didn’t give up and continue to work on Erdstall and at the same time learned Cardano’s eUTXO computation model. If this proposal will be successful - that’s really good example of how the team, by continuing their work and activities in the community, can achieve success. ", "q1r": 5, "q2": "The three main quantitative criteas for auditability are clear: Number of native NFTs deposited from each chain, Number of wrapped NFTs withdrawn to each chain, and the amount of tokens wrapped and unwrapped. And what about other metrics and additional information? The total budget of  $231,525 is relatively high comparing to others and that’s also I think requires more details both on budget breakdown and auditability metrics. ", "q2r": 5, "assessor": "z_assessor_2028", "no_vca": 27, "ne": 2, "ng": 20, "nfo": 5, "vca_o": 1, "reply": "Thank you for the favourable review. We were caught unaware by F9's absence of the \"Refinement\" and \"Finalisation\" phases for proposals, so we were unable to polish the proposal any further. You make a fair point and we are open to engaging more with the community. So far, we had only been focusing on building and researching, but we are aiming to create a community around our project in the coming months."}, {"id": 512, "q0": "The proposal wants to extend their eth layer 2 product to also be a layer 2 on Cardano with bridging technology built it. This is a great idea with benefits including but not limited to:\n* better user experience since users don't have to bring their own bridge\n* tighter integration with less blind spots since the same team that build the the L2 will also be building the bridge. \n\nDoes this proposal effectively addresses the challenge? On it's face, sure it does. The proposal writes a lot about their Erdstall technology and its benefits. Would have love to hear more about the Cardano side of things and what they will do get Cardano supported. \n\nWill be building a new node software to run on the Cardano side? \nWill they be using Haskell or Rust to write this new software? \nWhere will this new software fit on the Cardano stack? \nHow will block explorer work? \nWill Cardano users be able to use existing ecosystem wallets or a new one? \n\nLove the tech and it's novel approach to things, but what about the Cardano?", "q0r": 3, "q1": "The proposal provides detailed plan, timeline and milestone with a tentative completion time of around 6M. The budget is also detailed with broken down line item of costs. The 7 person team is a powerhouse of computer scientists and engineer including a Haskell and eUTOXO expert.  Would have love to see (linkedIn or other) links to the CVs of team members. ", "q1r": 4, "q2": "The proposal provides some KPIs the team and Cardano community can track after the project launch. However, the feasibility questions are meant to communicate to the community how the team plans to manage and track the work and how the cardano community can follow along as the code is being written. Is this an open source software that people can follow the commits? Will you published developer dispatches to medium, your website, gitbook?  How will the community know you've hit a roadblock or need to pivot?\n\nWould have also love to see the proposal tie its definition of success back to the explicit success indicator from the challenge brief. ", "q2r": 3, "assessor": "z_assessor_2098", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for the critique and praise. Sadly, we were caught unaware by the F9's absence of the proposal refinement and finalisation stages, so we were unable to polish the proposal as much as we had intended. Hence, we forgot to mention that we will be developing our system publicly under an open source licence. We are going to write all Erdstall code in go, and then use whatever we find the easiest to use for integrating the Cardano consensus verification into Erdstall."}, {"id": 1308, "q0": "The proposal is aiming to develop a multi-chain token bridge, where users can easily transfer tokens from one blockchain to another, to their wrapped form. Currently, Erdstall (the name of the platform), is being built on Ethereum, and the funding is requested to include Cardano. Nevertheless, they plan to include other chains in the future, but it is not in a scope of this proposal, and funding will be asked from these chains, respectively.  The proposer believes, that compering to other bridges, their solution is superior because it is easily extensible and trust-less. The proposer sees a large impact on Cardano, that in the future, when more chains other than ETH will be connected via Erdstall, they will automatically connect to Cardano, and cross-chain collaboration will be increased. The long term vision of Erdstall is to connect many-chain token bridge and eliminate constraints that currently exist. From this perspective, I find it in a high alignment with the challenge goal.", "q0r": 5, "q1": "The proposal contains the roadmap for the next 6 months, with a possible delay of two months, if another proposal from proposers will be funded. The roadmap is containing 5 milestones, whilst the first milestone is reached after 3 months, and basic deposit/withdraw function will be developed. The second milestone regarding multiple blockchain architecture is estimated to be finished after 4 months. Then another 3 milestones are expected to be finished by the end of fifth, fifth and sixth month. To improve the clarity at least first month (or even two months) could have been described on the weekly basis, what tasks are expected, what will be the time donation. To provide only the result after three months is not meeting this level of detail. Regarding the budget, the proposer is asking 231k USD, and it is broken down to milestones and number of devs. The proposer state, that the monthly salary for the company is 16,5k USD, and it covers fees for devs, researchers, management, etc. Since this is a request for funding voted by the community, I think the detailed calculation should have been disclosed. Also, comparing the milestones in the roadmap, e.g. MS1 (done after 3M), MS2 (done after 4M) = it takes 3 months to deliver 1st milestone, and 1 month to deliver 2nd milestone, but form the budget, there is 3months for MS1 and 3 months for MS2. So this does not add up. In case that MS2 development is starting after the first month (so it will take 3 months to do it, but it will be done after 4 months), then proposer should ask for 4 months for MS1 and MS2, instead of 3 and 3. Or more clarification in this matter should have been provided. As for the team, there is 8 members disclosed, with their bio provided, no linked in profiles tough.  Nevertheless, considering the information in the proposal, it appears that they are having the manpower with the required skills and experience. I am taking one star down due to the roadmap being high-leveled, and the budget calculation is lacking clarity. ", "q1r": 4, "q2": "The problem-solution (non-existing multi-chain token platform -> develop one) is logical and clear. The KPIs stated by the proposer – number of native NFTs, wrapped NFTs, and amount of tokens can be used for tracking the success of the proposal. For progress tracking, there are no metrics stated by the proposer, so suggesting few – bi-weekly or monthly reports on public media channels (twitter, telegram, discord) can be used, and meeting the milestones can be used. Also, the number of transactions, wallets connected, and to track the trend over time (increasing? Decreasing?). I keep the score full, because I think it is easy to implement suggested metrics. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the favourable review and your critique. Sadly, we were caught unaware by the F9's absence of the proposal refinement and finalisation stages, so we were unable to polish and clarify our proposal to the degree we had intended to. The budget is opaque since we are a for-profit company, and in Germany, it's not customary or legal to disclose the salary of employees in a bill (at least that's what I've been told by my boss), so we did not give a clear breakdown of our salaries. Note that the salaries we requested are still below competitive blockchain developer salaries of the industry (starting at around $10k/month per developer)."}, {"id": 1850, "q0": "This proposal addresses the challenge to bridge between Cardano and Ethereum blockchains. To have more Layer 2 (L2) is important for Cardano to grow its ecosystem and also for interoperability. Their bridge is for both fungible tokens and non-fungible tokens. Their proposal is novel as their product allows off-chain transactions and users funds are always at users’ custody. Their proposal intends for this bridge to be decentralized, but now they are in testnet on Ethereum and hosting the main operator nodes. It will be beneficial if they share more information how many nodes currently being run by the community are on the Ethereum testnet. This proposal also have stated the risks of not enough typescript from Cardano libraries and they have stated some buffer on their timeline and they aim to be more close contact with the Cardano core developers for assistance. These are reasonable steps to tackle the risks. Since this is only on testnet on Ethereum, they have the potential to scale and help both ecosystems to grow. ", "q0r": 4, "q1": "The team have already built their test product on Ethereum Goerli Testnet (now working on mainnet) which shows the capability of the team. They also have team members who understands Haskell language to build the bridge to Cardano. This is crucial for security purposes to avoid hacks and loss of funds. Hence, the team have the relevant experience to build this bridge. The team have broken down their timeline of 6months with achievable milestones as they have many developers building on this bridge, but they are also still working on their mainnet on Ethereum. The team intends to divide into groups and build in parallel to deliver their project. They have also broken down their budget to fund all their developers. It is reasonable rate for EU developers and have 50% discount as they are working on another Catalyst proposal. However, they aim to deliver both proposals if either one or both is funded. Only concerns me is the time delivery of this bridge since they are working on the mainnet on Ethereum and not state when they will start to build the bridge to Cardano. They only give the timeline but no information whether they will start building on Cardano in Q3 2022 after receiving the funds.", "q1r": 4, "q2": "The team auditability only after they complete (testnet or mainnet?) building the bridge such as number of native NFTs deposited from each chain, number of wrapped NFTs withdrawn to each chain, and number of tokens wrapped and unwrapped fungle tokens. There’s no way for the community to track the team’s progress during their building phase of the bridge. Suggestions to the team for better auditing by the community are 1) have a github to open-source their codes both for Ethereum and Cardano so developers can contribute and audit their code for security purpose and tracking their progress 2) provide updates to the Cardano community in Town Halls regularly with proper and updated data as proof 3) Have a weekly/bi-weekly/monthly update via Twitter, blogposts and Cardano Town Halls 4) metrics on number of nodes run by the community for decentralization 5) metrics on the off-chain transactions 6) a Gantt chart or roadmap for the community to check whether the team hit the delivery of their milestones 7) have engagement with the community like AMAs or join Cardano Twitter spaces for the community to provide feedback. By having these, the community can properly audit the progress of this project. ", "q2r": 2, "assessor": "z_assessor_2274", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your review and critique. Sadly, we were caught unaware by the F9's absence of the proposal refinement and finalisation phases, hence, we were unable to polish the proposal to the state we wanted. We actually do plan to make our code public for this grant, but were unable to add that to the proposal before it was locked. So far, the code was closed source so that we are protected against theft of our efforts before the project is released or profitable, since we are developing original technology. We are also intending to build a community around Erdstall on our discord server. We will start working on the grant as soon as it is accepted. We expect to be on Ethereum Mainnet by the time the grant starts, or soon afterwards. We also have enough manpower to work on the grant and the ethereum side simultaneously."}, {"id": 4543, "q0": "I strongly agree that this proposal will create a high impact on the Cardano ecosystem. It aims to migrate its cutting-edge multi-chain layer 2 platform Erdstall (based on a novel CommiTEE commit-chain protocol co-invented by their research lead) to  Cardano and develop a token bridge between Cardano and Ethereum. Erdstall currently runs on the Goerli test net on Ethereum and has proven to achieve better-operating characteristics than both plasma chains and ZK roll-ups. Having Erdstall integrated into Cardano is great precedence for other Ethereum-based platforms and DApps to migrate to Cardano. EThe proposal meets the goals of the Cross-Chain Collaboration challenge by creating new connections between the two blockchain communities with cutting-edge, well-researched technology and enhancing existing collaboration, thus attracting new users (it is a multi-chain NFT marketplace and some other layer 1's users would come to Cardano through it).  It also meets Fund9's strategic goal by providing an open-source project on Cardano that may attract more developers. The proposer points out that Erdstall is very scalable, as it achieves better properties than other layer 2 solutions while being lightweight and lean. In short, I am convinced that this project will have a great impact to the Cardano community. \n", "q0r": 5, "q1": "I am strongly convinced that the implementation of this project is feasible. The implementation of this proposal (and its sibling proposal also in Fund9) largely has two main parts: (1) deployment of Erdstall on Cardano and (2) developing Token bridge support between Cardano and Ethereum. The Erdstall technology research and development has already been underway, as evident in its patent, well-researched whitepaper, and its deployment on the Ethereum testnet. The team is highly solid, comprising the head of the research group for applied cryptography at TU Darmstadt, Germany (the patent co-owner), several PhDs in computer science, and 4 core developers who have been working on Erdstall for 1-2 years. The team has also acquired an understanding of eUTXO through another proposal funded by Fund8. The proposer offers a timeline with key milestones concerning the two implementation parts mentioned above. The budget breakdown and unit cost look reasonable for a mainnet-ready production. The proposer offers technical explanations for the project in great detail that are easy to follow for even a non-technical audience. Risks are well-considered and mitigations are provided. There is one implementation risk that I see is the uncertainty to deploy new technology on Cardano, and the team also mentioned this fact in their risks section. In case there are incompatible typescipt libraries for Cardano, it would present a timeline delay risk. However, given that the team is highly experienced and technical-focused, I still believe that it is feasible for them to carry out the proposal successfully. \n", "q1r": 5, "q2": "I strongly agree that this proposal is auditable. The problem and solution statements are presented with clarity, and the solution, comprising a mainet ready Erdstall and a functioning token bridge across Cardano, Ethereum, and Edrstall-native NFTs, is definitive and verifiable. Each milestone on the roadmap could be tracked easily, on top of a set of quantifiable KPIs to measure the proposal's progress (e.g.,  # of native NFTs deposited from each chain, # of wrapped NFTs withdrawn to each chain, amount of tokens wrapped and unwrapped)\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the favourable review. We would have loved to clarify and polish our proposal further, but we were caught unaware by F9's absence of the proposal refinement and finalisation stages, and we were lucky that we had the proposal in this state already when it was suddenly locked."}, {"id": 12766, "q0": "The problem is clearly stated and true. Currently there are only a few bridges and this proposal will bring a new bridge between Ethereum and Cardano. It will be available for ERC20 and ERC721 thus making Ethereum native coins and NFTs tradable. Overall their plan is described in detail and they can bring new usecases to Cardano. \nTherefore this proposal creates the technical possibilities of more collaboration thus it clearly matches the challenge. ", "q0r": 5, "q1": "The team has descirbed the skills shortly. They look competent but there isn´t any proof except for their current website and dApp on Ethereum. The dApp looks good is get used. Thus there is a good chance that they are able to implement the proposal. In addition the developerteam from polycry present themselves well. \nThe budget refers a budget to set timeframes with tasks from the timeplan. Overall it seems reasonable. But the budget is split in half because they use another proposal to complement this. \nThe timeplan is split up into five segments over 2 to 4 months. The tasks for every segment are explained in detail. The tasks are clear and the timeplan is comprehensible. \nOverall they provided good information and the project seems strongly feasible.", "q1r": 5, "q2": "There are three KPIs. They are reasonable and easy to audit. \nThe roadmap is clear and they describe the goal for the future in detail. Their goal is that Erdstall is running on Cardano mainnet and users are able to make transactions between Ethereum and Cardano. \nIn conclusion this proposal is easy to audit. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Thank you for the favourable review. We were caught unaware by the F9's absence of the proposal refinement and finalisation stages, so we could not add all the information we wanted to add before the proposal was locked. We will soon create a discord for Erdstall so that we can have direct interactions with the community, and we will make Erdstall open source."}], "solution": "We built Erdstall, a trust-less multi-chain L2 platform already targeting Ethereum. We plan to expand to Cardano (and many other chains later) and add true token bridge functionality (wrapped tokens).", "experience": "PolyCrypt is developing off-chain protocols and frameworks since 2018. Our research lead, Sebastian Faust (Prof. for Computer Science at TU Darmstadt, Germany), is a co-inventor of state channels, Proof of Space, and the CommiTEE sidechain. We have experience with Cardano before."}