{"id": 381516, "author": "wadalliance", "title": "Influencing Policy for Adoption", "url": "https://cardano.ideascale.com/a/dtd/381516-48088", "category": 26235, "amount": 14000, "description": "Governments' and policy makers lack of use-case understanding of blockchain technology results in Country adoption friction", "funded": 2, "upvotes": 170871113, "downvotes": 15260329, "votes_result": 155610784, "votes_cast": 1336, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal wants to organise 2 large events in 2 African nations aimed specifically at policy makers in those nations. Getting the local authorities to get to know this blockchain, and blockchain as a whole for that matter, could sway the sentiment towards a positive cooperation. Resulting in more adoption and more community influx. ", "q0r": 4, "q1": "WADA is a well known team within the Project Catalyst ecosystem and already has a network of local community centers in place to facilitate this project expansion. Their main project is thriving on the African continent and they keep expanding on this regulalry.  The budget has been allocated realistically and potential risks have been taken into consideration. ", "q1r": 5, "q2": "Very clear KPIs have been put into place as variables along with a roadmap, budget breakdown and risk assessment. The proposal has been assembled correctly in terms of auditability. One suggestion for improvement could be to link the WADA-website in the proposal so the reader can grasp a better general idea of how this would fit in the main project. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 28, "ne": 3, "ng": 22, "nfo": 3, "vca_o": 1}, {"q0": "I strongly agreed because;\r\n \r\n1. The problem neede to be solved has been identified and falling in scope of the challenge .\r\n\r\n2 the proposal also shows clearly how it will add value to the cardano ecosystem and key key metrics and goals of the proposal has been stated clearly amd falls within the scope of the challenge.\r\n The proposal scale to address future challengies.\r\n\r\n", "q0r": 5, "q1": "Strongly agreed;\r\n 1. because  the proposer has provided evidence, reference, links etc of relivant skills and experiences needed to implement  the proposal and the links are sufficient.\r\n\r\n2. their level of competent is accurate and has identifiably listed in manner the type and number of team members required to implement the propsal.\r\n\r\n3. has rationally and logically laid down his team structures and break downs with reasonable budget for the achievement of the goals of the proposal if funded.\r\n\r\n4. The proposal has provide verifiable plans if additional funding is required to implement the proposal and a realistic time table for the complement of the work.\r\n\r\n5. the proposal has also given the necessary resource  needed to implement the proposal and has consider some risk and challengies relevant for a successful ending . \r\n\r\n", "q1r": 5, "q2": "strongly agreed because there are good laid out road maps and time horizon fpr achievement if funded.\r\n\r\nkey metrics and KPI's defines the success of the proposal. And clearly understandable describtions of the targeted problem and reasonable solutions that address the problem.\r\n Has also provided  good contency plans in place for various outcomes.", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 26, "ne": 3, "ng": 11, "nfo": 12, "vca_o": 1}, {"q0": "Great reading this proposal. It is well-drafted and focuses on engaging government officials which is great for influencing policies. I think it would be great to segment the stakeholders into sub-groups like regulatory officials, legislators, etc and target them differently. In all, this is a great way to gain entry into the public policy space. Awesome idea.", "q0r": 4, "q1": "Great team experience and the team has a track record of delivering great projects as well. The plan is specific, practical, and measurable. The follow-up component on stakeholders is great and participatory as it offers them the opportunity to join and influence policies together with the team. The outcomes are measurable and I think the community should support in making this a reality. ", "q1r": 5, "q2": "The team is transparent and open. There is a great auditable process involved in the proposal. I like the budget breakdown as well.  It would be easy to track and monitor success. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}], "solution": "Organize 2 high profile events in 2 African countries to show Cardano use and adoption benefits & onboard policy makers to local Cardano hub", "experience": "\nWada: Skilled Cardano community practitioners and entrepreneurs, located in hubs across Africa & Diaspora\nCardano Foundation LCCs\n"}