{"id": 381329, "author": "felixweber", "title": "Gamers On - Chained", "url": "https://cardano.ideascale.com/a/dtd/381329-48088", "category": 26257, "amount": 500000, "description": "¿Qué aplicaciones de juego Blockchain deberían desarrollarse para lograr la adopción masiva de Cardano?", "funded": 2, "upvotes": 116367465, "downvotes": 8607869, "votes_result": 107759596, "votes_cast": 446, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Creo que soy competente para evaluar esta propuesta, ya que he participado activamente en el proyecto Catalyst desde el fondo 4 y tengo experiencia en el análisis de los requisitos de negocio de más de 5 años de entrega de soluciones de software para pequeñas empresas y corporaciones también.\r\nLa pregunta del reto está claramente formulada y es fácil de entender, en mi opinión. El reto consiste en averiguar cómo utilizar los juegos para hacer crecer el ecosistema.\r\nTambién es fácil de entender por qué es importante, aunque creo que habría ayudado a que el reto sonara más impactante si se mencionara aquí de qué enormes cifras (más de 2.500 millones) estamos hablando cuando nos referimos a los jugadores.\r\nUna vez más, creo que está claro, por la forma en que se enmarca el \"éxito\", que para este desafío significa que los desarrolladores utilizan los fondos del Proyecto Catalyst para hacer herramientas y juegos en Cardano y luego los jugadores fluyen para jugar y explorar el resto del espacio.\r\nCreo que Felix añadió una lista muy completa de métricas clave para medir, realmente no puedo pensar en nada más que pueda añadir a esto.\r\nCreo que debido al público objetivo de este desafío y al hecho de que creo que el juego es una de las formas más importantes no sólo de recreación, sino también de educación en el futuro, que este desafío es muy crítico para lograr la misión de Cardano.", "q0r": 5, "q1": "Creo que los objetivos de este reto son muy factibles. Queremos ver herramientas, juegos, torneos, propuestas con ideas tal vez más revolucionarias, etc. Todo esto será bastante sencillo de verificar con propuestas financiadas, una vez que las cosas se pongan en marcha. También es muy sencillo medir el nivel de implicación de la comunidad aquí. En el Fondo 7, Gamers On-Chained fue uno de los retos con más propuestas ya. Tuvimos gente en nuestra sala de reuniones posterior al ayuntamiento todos los miércoles discutiendo sus propuestas y entusiasmándose con lo que se puede hacer para hacer crecer este espacio. Aumentar el presupuesto de 250.000 a 500.000 es también una muy buena idea en mi opinión, ya que el desarrollo de juegos es muy caro. Mucha gente tuvo dificultades para desglosar sus propuestas y mantenerlas por debajo de los 50.000 dólares. Necesitamos una cantidad decente de fondos para poder hacer rodar la bola de nieve. En resumen, estoy totalmente de acuerdo en que la comunidad tiene capacidad para afrontar este reto.", "q1r": 5, "q2": "Como he mencionado antes, creo que los criterios de éxito de este reto son muy claros y, por tanto, fácilmente verificables. Una vez que las propuestas sean financiadas, será fácil ver cómo los proyectos toman forma a través de sus githubs, canales de youtube, cuentas de twitter, ventas de NFT, sitios web, etc. Este es el tipo de reto que, en mi opinión, tardará un poco en dar resultados, pero una vez que lo haga, se abrirán las compuertas y quedará muy claro para todos el potencial que tiene el juego con la tecnología blockchain.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal aims to grow the adoption of Cardano amongst gamers - a big segment of potential users, which is inline with the cardano's mission and supports Fund 8 strategic goals of growing the app ecosystem.\r\n\r\nAt the same time, the proposal does not explain why accessing these users through games is easiear than through other use cases. The porposal would be stronger if answered the following questions:\r\n1) Which distinctive advantages cardano-based games will have vs other games? What are the benefits for game developers?\r\n2) Which advantages gamers as a segment have for Cardano? Why it's a high ROI? For example, compared to the financial service the regulatory environment is much simpler.\r\n\r\nOverall, this can be a valuable challenge for the ecosystem, but without further clarification, it is not clear why it cannot be done as part of broader DApps & Integrations or Developer Ecosystem challenges, or even regional growth challenges.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.", "q0r": 3, "q1": "While it definitely possible to use blockchain technology in Games and create some SDKs or gaming applications, out of my experience as a product manager, it is equally important to understand if there is demand from the gaming industry and unique benefits to gamers.\r\n\r\nThe proposal would be stronger if it provided an analysis of the demand for blockchain solutions among gaming companies and gamers to prove that a noticeable progress can be made from the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of demand analysis.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposed metrics, such as (the number of users, apps, etc.) do allow to track progress of the initiative.\r\n\r\nAt the same time, the proposal would be stronger if it considered the following aspects as well:\r\n1) the % of users brought to Cardano through projects within this initiative.\r\n2) developer and user satisfaction in comparison with alternative ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user and developer satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 4, "assessor": "z_assessor_1011", "no_vca": 27, "ne": 6, "ng": 15, "nfo": 6, "vca_o": 1}, {"q0": "The challenge accelerates the growth of the app ecosystem and brings gamers together to contribute to the Cardano ecosystem therefore it strongly aligns with the Cardano mission.", "q0r": 5, "q1": "The challenge already exists in fund 7 and had 57 assessed proposals indicating solid interest. The budget request doubled directly in relation to the doubling of the total budget. The budget request is moderate given that there is no real overlapping challenges.", "q1r": 5, "q2": "Progress towards addressing the challenge can be measured using the key metrics provided. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This challenge definetely has the potential to provide interesting usecase for the Cardano ecosystem. It might give it some traction and create some creative efforts to re-think blockchain. However bringing gaming onto Blockchain is not absolutely vital to Cardanos mission. The societal impact of gaming should not be too important.", "q0r": 4, "q1": "In my opinion the parts of the Cardano community has the capabilites to adress the challenge, but not all of them. While we saw some good proposals in this topic, we saw during the last round of this challenge that more people had trouble approaching the topic. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 4, "q2": "The KPIs and metrics are set up well in order to provide the framework for good proposals.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since Cardano's mission spans many areas of life, including the entertainment aspect. The game industry is growing day by day and there is a need for a blockchain with a good foundation so that gamers can work comfortably and record the fruits of their labor effectively in many ways.\r\nTherefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Certainly, the Catalyst community has the capacity to address this challenge because of the following reasons: since the multi-asset function was enabled on the mainnet, NFTs are minted in an increasing number to serve a variety of purposes, including the development of games of various genres. In addition, the Gamers On -Chain challenge is now showing a warm welcome by the community. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested directions and metrics are logical, specific, and measurable to measure progress in addressing this challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "importance": "Los jugadores están listos para entrar en el cripto. Solo necesitan un blockchain claro con aplicaciones agradables en las que participar.", "success": "Cardano se convierte en la blockchain para desarrollar aplicaciones de juego debido a su calidad de herramientas y a su amplia base de usuarios centrada en los jugadores."}