{"id": 380924, "author": "mikolaj.glinka", "title": "Frictionless document verification", "url": "https://cardano.ideascale.com/a/dtd/380924-48088", "category": 26240, "amount": 30000, "description": "La suplantación de identidad y la falsificación provocan pérdidas de datos, dinero y tiempo. Se necesitan herramientas sin fricción para restaurar la confianza en las transacciones y proteger a todos los actores.", "funded": 1, "upvotes": 46138003, "downvotes": 13842871, "votes_result": 32295132, "votes_cast": 214, "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "El proponente quiere facilitar la carga de documentos y verificar su autenticidad e integridad. Esta solución aportará más confianza al ecosistema de Cardano. Varias propuestas están trabajando en este sentido, ya que es una cuestión importante y un problema que la cadena de bloques puede resolver. El proyecto afirma ser capaz de mitigar los daños causados por el fraude documental, que son considerables. Los KPIs del proyecto son relevantes ya que se trata de entregar una versión beta de la aplicación para que sea probada por la comunidad y posteriormente pueda ser comercializada.  Ahora mismo hay un par de cosas que creo que le faltan a esta propuesta, pero las repasaré en las secciones correspondientes de la revisión. Esta propuesta seguramente añadirá algo al ecosistema, pero ya hay un par de soluciones similares que compiten con esta. Como desarrollador tengo un par de preocupaciones sobre la implementación de la propuesta como la falta de credenciales de los miembros del equipo. Sólo se menciona a una persona. En general, si se implementa la propuesta será impactante para la comunidad.", "q0r": 4, "q1": "Una cosa que me molesta es que sólo una persona está vinculada en toda la propuesta. Esto no es una simple dapp para ser hecha por una sola persona. No es que dude de sus habilidades ya que es un pionero de plutus, pero la propuesta menciona a un par de miembros más del equipo pero no se proporcionan enlaces de nombres o credenciales por lo que no puedo verificarlos ni sus habilidades. El proponente obviamente tiene la idea de que más de un miembro del equipo será necesario y ha incluido ese hecho en el presupuesto, pero no dice si esas personas son conocidas o van a ser contratadas. Esta es una aclaración que debe hacerse en la propuesta porque la falta de ella trae más preguntas como: ¿de dónde se deriva el cálculo de los salarios de los otros miembros del equipo? El presupuesto está esbozado, pero en mi experiencia eso no es suficiente. Una discrepancia que encontré fue que la propuesta afirma que la fase 3 no iba a ser financiada en esta propuesta, pero en los fondos solicitados se mencionan 3000 dólares para las pruebas, que están en la fase 3. No se ofrecen fuentes o cálculos para verificar la suma solicitada. Animaría al proponente a mirar otras propuestas y comprobar su desglose de costes que se suelen hacer por horas y por meses. El calendario de todos los trabajos contenidos en la fase del fondo 7 parece factible y realista. Hay una hoja de ruta sensata que describe la ejecución y el posible futuro del proyecto, lo cual es estupendo. El plan describe con detalle por qué es necesario implantar una solución de este tipo, ya que cada año se pierde mucho dinero debido al fraude en la verificación de documentos. Los detalles técnicos podrían haberse mencionado, porque muchos de los miembros de la comunidad son ingenieros y podrían ayudar mucho en cualquier problema y detalles de implementación.  No estoy seguro de si los autores de las propuestas han visto otros proyectos similares, pero yo sugeriría algún tipo de colaboración para aprovechar el esfuerzo de la comunidad y evitar hacer las cosas dos veces. En general, esta sería una solución más factible para mí si se mencionara a todos los miembros del equipo o la situación exacta con su adquisición. Un mejor desglose del presupuesto también aportaría más credibilidad al proyecto.  ¡Buena suerte!", "q1r": 4, "q2": "No se mencionó nada respecto a informar a la comunidad del estado de desarrollo de la propuesta. Obtener la opinión de la comunidad parece un punto que se echa de menos en la propuesta. Los KPIs mencionados parecen adecuados e implican la addopción del proyecto por parte de los usuarios.  Hay un problema claro y una solución clara para el mismo, así que no hay que preocuparse de que la gente entienda de qué va este proyecto.  Sugeriría que el proponente se pusiera en el lugar de los votantes y viera cómo un votante interesado y partidario del proyecto podría presentar cualquier ayuda o comentario basado en el contenido del proyecto. Actualmente no veo una manera fácil, pero es una parte importante de cualquier propuesta. En general creo que la auditabilidad de este proyecto sería difícil de ver por la comunidad. Eso excluyendo las necesarias actualizaciones de desarrollo proporcionadas al catalizador del proyecto.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "La idea encaja bien con el objetivo del reto, y puede resumirse en la siguiente frase \"Transparencia para todas las partes en el intercambio de activos digitales\". Los autores apuestan por crear un producto en el que las personas no iniciadas en cuestiones criptográficas puedan subir documentos a la blockchain, lo que sin duda añadiría valor al ecosistema de Cardano, ya que más personas podrían adoptar nuestra blockchain. Los autores también argumentan cómo un proyecto de este tipo beneficiaría a las empresas y a los consumidores al mismo tiempo, es decir, es una idea pensada para un público amplio y que promete llegar a un elevado número de usuarios, lo que es muy coherente con lo que se busca en este reto. Si la idea tiene éxito, sería posible acuñar documentos en la blockchain para aumentar su fiabilidad y originalidad, beneficiando al ecosistema con la incorporación de nuevos usuarios y a la población que no entiende cómo funciona, en la práctica, esta práctica. Es muy relevante que los autores fueran desde el principio muy conscientes de la importancia del diseño UX del proyecto, que en mi opinión es tan esencial aquí como la programación que hay detrás, porque permitirá un uso sencillo y ergonómico para personas que no tienen contacto con el universo criptográfico. Los autores explican cómo se beneficiarían diferentes vías de negocio, como la farmacéutica, el banco, los corredores de bolsa, etc., más allá del usuario común, transmitiendo así una noción muy sólida de cómo se podría utilizar bien el servicio en cada caso.", "q0r": 5, "q1": "Los autores explicaron de forma perfecta lo que se haría, las principales fases del proyecto y las pequeñas acciones que en conjunto darían lugar a dichas fases, cuánto tiempo (en días) duraría aproximadamente cada fase y el objetivo a alcanzar en ellas. Para mí, éste es un ejemplo ideal de cómo presentar la parte práctica de una propuesta, porque observo que los autores suelen preocuparse por exponer las fases que componen el conjunto del proyecto, pero no por detallarlas, explicando exactamente lo que ocurriría en cada una. En cuanto al monto financiero, sabemos cuánto dinero se destinaría a cada fase del proyecto, lo cual es sumamente necesario, pero sería muy positivo encontrar aquí los mismos detalles del rubro previamente analizado. Por ejemplo, en el parque de \"actividades de lanzamiento al mercado y promoción y puesta en marcha\", ¿cómo se haría este lanzamiento, a través de qué plataforma se haría la divulgación? Creo que este es un detalle muy importante para esta propuesta, ya que también se busca llegar a un público que no está acostumbrado al ecosistema de Cardano, por lo que sería necesario tener un conocimiento de cómo podría llegar la idea a ellos. Sobre el equipo que compone el proyecto, ciertamente son capaces, pero me gustaría ver más explicaciones sobre ellos: quiénes son, sus nombres, ejemplos de trabajos anteriores, cuál sería el rol específico de cada uno en el proyecto... Aunque dicen ser informáticos con mucha experiencia, necesitamos entender específicamente con quiénes estamos tratando.", "q1r": 4, "q2": "El equipo expone aquí lo que pretende conseguir de forma muy exacta, y también qué resultados busca con el paso de los meses, haciendo posible la auditabilidad por parte de la comunidad. Como es un proyecto que ya tiene un prototipo, sería interesante ver cómo se transformaría este producto en su versión beta y posteriormente en su versión final, los autores también podrían mostrar estos resultados a algún equipo de profesionales de la comunidad, para dar aún más seguridad sobre lo que se está haciendo. Sin embargo, creo que todo está de acuerdo en cuanto a la posibilidad de monitorear el progreso del proyecto, esta idea es sólo un agregado que haría el escenario aún más confiable.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This product is much needed. I work with immigration documents often, and see this as assisting a need of verification of documents that are not related to immigration concerns (college transcripts for example). The immigration industry needs more tools like this for future implementations.", "q0r": 4, "q1": "With all of the documentation provided and then with \"A team of computer scientists with decades of experience combined\" listed at the front: I would have expected more team members to have more details on their qualifications. I can assume this team has them, but would like to *know*.", "q1r": 3, "q2": "Lot of information provided that gives me confidence in this team's abilities. They have listed their KPIs, and they seem easy enough to track and confirm. If this team does obtain two enterprise clients it would be a good success.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This team wants to make a system to protect consumers and document providers out of phishing & forgery result in data, money, and time loss. In my point, this will help a lot in the development of DeFi. And as the team described in the proposal, their system will be based on Cardano metadata and has a strong impact on the development of Cardano ecosystem. Throughout their KPIs, I think that this team is really concerned about what this challenge wants to point. ", "q0r": 5, "q1": "The team makes a very detailed plan and technical explanation to help everyone understands what they want to do, the team also includes use cases and scenarios in many industries including banking, insurance, education... to show how this system will affect the current world. \r\nMore than that, they make a very detailed roadmap of what the whole team will do in 4 development phases. And that help clear the budget they required is sufficient and reasonable.\r\nIn addition, we can find a lot of evidence and also an MVP of their system in the proposal. So, this project will definitely have high feasibility to success. .", "q1r": 5, "q2": "They have a detailed roadmap and promising KPIs. Those are completely enough to help to audit easily this project. \r\nThe team didn't explain the problem in detail, but I think their solution made sense and in each sentence, they explain how their features or mechanic to solve some cases that belong to the problem. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Project like this is something the Cardano ecosystem must have. Having all the documents in one place on blockchain and on Cardano is simply wow! The whole project can come to life both locally and globally. It could include individuals but also cities, schools, colleges, todays and tomorrows governments. All documents could be saved to the blockchain wow! In the proposal we can clearly see what the problems are and what solutions the team offers. The proposal states the positive impact for the Cardano ecosystem and it is clear how it will add value to the Cardano ecosystem. KPIs indicated in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 5, "q1": "There is a website in the proposal where we can get information about what the people behind this project are doing but there are no informations about the team. We do not have a clear insight into the experience and skill that will be necessary for realization. We have information about Team Leader as evidenced by the link via LinkedIn but it would be good to have a clear insight into the relevant skills and experience needed to implement the proposal. The proposal states that Plutus Pioneers will work on this project, but we have no evidence that this is the case. In the proposal as I stated we have Team Leader but we do not have clear information on the number of other team members and whether they exist. The budget is reasonable and clearly presented but it would be good to have within the budget broken down better specified in more detail on what all the money will be allocated. An additional funding is not required and a detailed implementing plan is clearly presented in the proposal. The proposal provides details of actionable tasks and an order of execution with realistic time frames within which the work could be done. The plan does not describe the resources required but the proposal clearly explains the technical aspects such as architecture, language and technologies required for implementation. The proposal lists certain problems in the industry, but does not specify the possible risks that may occur during the implementation of this project, so that solutions to possible risks are missing.", "q1r": 3, "q2": "Proposal provide an excellent roadmap with milestones and a time horizon for achievement. KPIs are not best presented in a way to define the success of the project and KPIs provided cannot be used to quantify the success of the project. Therefore, the community will not be able to follow the development of this project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on a system allowing even non-technical/crypto users to 1) upload documents to blockchain and 2) verify document authenticity and integrity. This is a meaningful idea. The problem is clearly described, explained in detail, which fits this challenge. The solution is clearly defined, fits the challenge, shows a clear impact on the ecosystem as a whole in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, with skill, experiences is suitable for implementation, but NO reference/proof (documents/links,...) for verifying. There is no information on demo/pilot. The budget explanations of the calculation base are not provided. The roadmap is clearly described, with measurable and logical KPI/ metrics. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, however, there is a lack of the following components: (1) Team profile reference/proof (documents/links,...) for verifying; (2) Budget explanations of calculation base; (3) Risk and mitigation. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal deals with an area of structural preservation and general document storage. It's relevance to the Cardano functional utility may enhance the designation of some related use documents in a verifiable manner. The conversion from a non blockchain model to a verifiable model needs to be expressly described rather than assumed. \r\nThe proposers have limited themselves to a set of documents which would comfortably be linked to documents presented online so my question is about the specifics of verification as to how the document has been acquired by the consumer for which it is being verified?", "q0r": 3, "q1": "The conversion from an off chain to on chain modality seems to have a workable model and logical deployment. It does seem to need some tightening of the \"raison d'etre\" which is not a large modification. Given the plan it should be implemented successfully for the parts described. ", "q1r": 3, "q2": "This proposal has reasonably sound structure to the development and hence would be auditable for progress. There should be a clearer definition of the value add provided by their model.", "q2r": 3, "assessor": "z_assessor_691", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal would do a great service to the Cardano blockchain by helping non-technical users take advantage of the immutability and trustlessness of blockchain technology to prevent phishing and forgery. It is a relatively straightforward project with potentially high impact, both for Cardano adoption and the track record of Project Catalyst. ", "q0r": 5, "q1": "The team consists of Plutus Pioneers and crypto veterans who provide their linkedin profile and company website. The portfolio and experience presented are suitable for the proposal roadmap and give the proposal a high chance of success.  ", "q1r": 5, "q2": "The granularity of timeline and cost breakdown are highly useful for auditing the proposal during implementation. All the information required for understanding and evaluating the proposal are there. It is also casting a good light on the proposal that so much understanding of the target demographic and market dynamics are presented.", "q2r": 5, "assessor": "z_assessor_692", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Sistema que permite incluso a los usuarios no técnicos/criptográficos 1) cargar documentos en la cadena de bloques y 2) verificar la autenticidad e integridad de los documentos.", "experience": "* Un equipo de informáticos con décadas de experiencia combinada.\n* En criptografía desde 2017\n* Pioneros de Plutus\n* Disponen de un prototipo relacionado"}