{"id": 381096, "author": "shawnim", "title": "ALLIN Betting DAO", "url": "https://cardano.ideascale.com/a/dtd/381096-48088", "category": 26240, "amount": 18000, "description": "Ninguna aplicación actual ofrece una experiencia de apuestas sin intermediarios, todo en uno, con múltiples formas de obtener rendimiento.", "funded": 1, "upvotes": 52348240, "downvotes": 6681116, "votes_result": 45667124, "votes_cast": 185, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Los proponentes desean tener una DAO de apuestas. Se puede apostar con otras personas de la oficina o del mundo. Esta es una propuesta interesante, ya que siempre hay deseo de apostar y esta solución proporcionaría una plataforma de aplicación descentralizada para ello. A través de este tipo de plataformas, más personas se incorporarán al ecosistema de Cardano, por lo que esto trae más gente al ecosistema. La métrica clave como la adopción y los seguidores es válida y se alinea con la configuración del desafío. Los proponentes no mencionan los retos futuros y los problemas a los que pueden enfrentarse, lo cual es un fallo en mi opinión como desarrollador. Aparte de eso, no veo que falte ninguna parte importante en la propuesta. En comparación con otras propuestas, esta parece bastante única y eso significa menos competencia para tener éxito.  Es una idea interesante que puede tener algún impacto en la comunidad de jugadores, pero que tendrá un gran impacto para la de cardanos.\r\n", "q0r": 5, "q1": "Con algunas búsquedas en linkedin pude verificar a los miembros del equipo y su lista de habilidades y experiencia necesarias para implementar la propuesta. El hecho de que hayan dado sus nombres me da más confianza en su proyecto. El número y el tipo de miembros del equipo ya se conocen y están presentes. El presupuesto está esbozado, pero podría ser un poco más detallado. Por ejemplo, los servicios legales para diferentes proyectos van desde 2k hasta 10k y no hay manera de verificarlo. Así que una empresa que se va a utilizar junto con su tarifa por hora sería apreciada en aras de la transparencia. Como promotor, el calendario establecido para el desarrollo parece realista. No puedo hablar de la parte de marketing. Parece que los proponentes tienen un plan sensato para la ejecución del proyecto y tienen una idea bastante clara de lo que hay que hacer y en qué orden.  Se mencionan los aspectos técnicos, como las tecnologías y los lenguajes que se van a utilizar, que son cruciales para la implementación. Una cosa que ya he mencionado que falta son los retos futuros, y espero que los proponentes hayan dejado algún margen para ellos. No se menciona ningún proyecto similar, pero he investigado un poco y no veo ninguna competencia para esta idea específica. ¡Buena suerte a los proponentes!", "q1r": 5, "q2": "Hablando de trazabilidad y auditabilidad, los autores han mencionado las redes sociales y los canales de discordia pero no han proporcionado ningún enlace concreto en el que la comunidad pueda seguir el progreso o la actividad de sus proyectos, así que eso es una gran decepción. Las métricas y los KPIs parecen relevantes, como la adopción por parte de los usuarios, que es, en mi opinión, una de las métricas más importantes. Hay una hoja de ruta clara con hitos en el camino, así como separados por trimestres, por lo que el calendario está bien. Para ser honesto, la descripción del proyecto podría ser un poco más clara cuando se habla de Allin Token y Allin stable token. Un ejemplo del uso de cada token habría sido de gran ayuda para entender el propósito de los mismos. La solución aborda el problema y es suficientemente clara.  En general, creo que la trazabilidad del proyecto podría ser un poco problemática si los autores no cumplen su promesa de un canal de discordia. Y esta propuesta habría sido el mejor lugar para poner tal canal para empezar a crecer una comunidad. Buena suerte y no os olvidéis de crear esos canales comunitarios.\r\n", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Esta propuesta habla muy bien con el objetivo del reto, ya que busca crear una plataforma que realice varios tipos de apuestas (gambling) y utilice tokens, DeFi yield y otras tecnologías relevantes para el ecosistema Cardano. Me pareció una idea interesante tener dos tipos de tokens, uno más inestable y otro más seguro, para poder atender a un público más conservador (o menos arriesgado, en este caso, ya que estamos hablando de jugar a juegos de azar). También es positivo que el equipo desarrolle otro tipo de apuestas, alternativas a la modalidad de persona a persona, cuando se lance la posibilidad de apostar contra la blockchain. Esto es importante porque el mercado de las apuestas se está saturando, en mi opinión, he visto varias propuestas en este mismo reto que abordan este tema. Además de este nuevo tipo de apuesta, los autores describen muchas modalidades, dejándonos muy claro cómo funcionarían las actividades en esta plataforma.", "q0r": 5, "q1": "Los autores de la propuesta afirman ser profesionales experimentados en las áreas de construcción de aplicaciones, DevOps y diversas tecnologías pertenecientes al ecosistema Cardano. Sin embargo, esta descripción es muy abstracta, faltó detallar quién es cada miembro del equipo, su área de especialización, experiencias previas y cómo actuarían específicamente en el proyecto. Tenemos una página web adjunta, donde podemos ver la foto y una pequeña descripción de cada persona, pero es muy corta, no se pasa mucha seguridad en relación al equipo en sí, a pesar de que la propuesta está muy bien detallada y ya tienen una página web lista y varios hitos alcanzados. En el tema de la realización del proyecto en sí, me pareció que acertaron en situarnos sobre qué va a pasar, cuándo y en qué orden. Hay muchísimas actividades diferentes, que van desde la programación de la aplicación web hasta la creación del diseño y aspectos más burocráticos como los contratos legales, y podemos entender cómo sucederá todo esto cronológicamente. A pesar de ello, podría haber más detalles en cuanto a la explicación de cada uno de estos pasos (esto aumentaría mucho la confianza en el proceso). Es muy positivo que establezcan una noción temporal, como he dicho antes, es decir, que sepamos en qué periodo de 2022 ocurriría cada cosa, y también que citen cómo se utilizaría cada parte del dinero, aunque no hablen de los detalles de cada parte . Por ejemplo, en marketing, ¿cómo se haría? ¿Se pagaría a un profesional, probablemente, se pagaría publicidad en algunos medios, etc.?", "q1r": 4, "q2": "Estos son algunos KPI, medidos en trimestres: 3, 6 y 12 meses; se enumeran las expectativas de éxito para cada uno de estos periodos de tiempo, lo que hace más posible que la comunidad supervise el progreso del proyecto. Pero creo que valdría la pena que este proyecto, en particular, tuviera un seguimiento constante por parte de algunos miembros de la comunidad más preparados, porque es muy complejo, implica varios frentes. Sería interesante que la propia comunidad pudiera probar de vez en cuando cómo funciona la aplicación, ver si todo va bien, detectar fallos y mejoras, ya que hay varios tipos de apuestas. Los autores nos dan medios para que podamos ver cómo van las cosas, lo que sugiero es acercar la creación y mejora del sitio a la comunidad, porque como mencioné antes, ya hay muchas aplicaciones de este tipo, y cuesta mucho esfuerzo para que se diferencie.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "If sucessfull the proposal will create a betting dao or betting platform that will attract more users the the Cardano ecosystem, more users equals more utility and adoption, thus the proposal effectively addresses the challenge.", "q0r": 4, "q1": "The proposal has a link to a website where there are short bios about the team, I would like to see links to LinkedIn or similar to verify experience. I would like the team to expand on the backend architecture and how it will tie in with PAB, also I would love to hear the teams thoughts on concurrency in the eUTXO model when placing bets at the same time. As the proposal is presented at the moment its hard for me to see a clear path to success. ", "q1r": 3, "q2": "The proposal provided a high level roadmap and line item budget based. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date –, have 150 users week 8, etc. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The betting industry is a high stake industry and is one of the use cases of Blockchain in the simplest manner. Apart from the ethical site and reservations it's a good business and can boost the adoption and utilization of Blockchain with better transparency than the current centralized setup. This feature is currently lacking in the Cardano ecosystem and can benefit from the success of this proposal. This is addressing an important challenge. \r\n", "q0r": 5, "q1": "The proper team has four persons with substantial experience in the industry and displays a professional approach. There is no major technical hurdle in achieving the end result. Moreover, the team claims to have carried out much of the work required for MVP.  The roadmap and the steps are fairly clear and achievable with these under consideration i feel that the team will be able to complete the project. ", "q1r": 5, "q2": "The proposal has a clear aim and has presented a workable strategy. There will be seven different types of bets and each is being implemented in a separate manner. The proposal has a clear roadmap and budget breakdown. The development cost is reasonable. The progress of the implementation and its success is auditable and measurable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "DAO de apuestas que es totalmente transparente y capaz de proporcionar rendimiento de DeFi, play-to-earn, staking, profit sharing, pick following y más.", "experience": "Equipo global de desarrolladores y profesionales con experiencia en el desarrollo de apps, DevOps, DeFi, blockchain y la industria del juego."}