{"id": 381358, "author": "jaggerbellagarda", "title": "Verifiable NFT-based resumes/CV", "url": "https://cardano.ideascale.com/a/dtd/381358-48088", "category": 26240, "amount": 25000, "description": "La verificación actual de la experiencia laboral y de los documentos relacionados con el trabajo puede ser un proceso costoso y largo.", "funded": 1, "upvotes": 39254036, "downvotes": 6328784, "votes_result": 32925252, "votes_cast": 174, "f6_no_assessments": 6, "f6_rating": 3.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "La idea de la propuesta es bastante única y creo que similar al producto Atala Prism de IOHK, pero con el caso de uso de NFT.\r\n\r\nYo mismo vengo de un país del tercer mundo y soy un desarrollador senior, he sido testigo de primera mano de la falsificación y la documentación falsa/certificados de grado producidos por la gente. La fuente de esta falsificación no suele ser la universidad, sino el mercado abierto, ya que actualmente la verificación de la autenticidad de estos documentos es un esfuerzo muy costoso para las empresas o instituciones de educación superior de otros países.\r\n\r\nPor lo tanto, estoy firmemente de acuerdo en que esta propuesta aborda un problema muy singular en el mundo abierto por ahí y proporciona una solución muy agradable dapp basado en NFT a este problema.", "q0r": 5, "q1": "La experiencia del equipo se presenta bien con los enlaces a sus perfiles vinculados. Como desarrollador, me doy cuenta de que la pila de tecnología ya está elegida y la experiencia del equipo está en línea con la pila de tecnología que han elegido para el desarrollo de front-end, back-end y blockchain.\r\n\r\nDesde el punto de vista de la experiencia, creo que falta el conocimiento de plutus y habría dado todos los puntos si el desarrollador de blockchain también mencionara su participación (inscripción en la APP / finalización con éxito) en el ecosistema de Cardano.\r\n\r\nDesde el punto de vista del plan, me parece que está muy bien escrito y que el presupuesto y los costes son reducidos para cumplir los objetivos del presupuesto del F8. Sin embargo, este presupuesto, en mi opinión, podría haberse dividido más, en lugar de dar una gran cifra de 20.000 dólares, por ejemplo: ¿cuántos desarrolladores trabajarán, cuál es su tarifa por hora/mes, y cómo se llegó a esta cifra de 20.000?\r\n\r\nEl plan, sin embargo, está muy bien perfilado. El enfoque de la solución menciona claramente los objetivos y el alcance de la solución, junto con el enfoque técnico. Es estupendo ver que el equipo ya ha pensado en los conjuntos de características de alto nivel y en cómo abordarán la implementación de esta propuesta.\r\n\r\nPor lo tanto, en general, estoy de acuerdo en que es probable que esta propuesta se aplique con éxito", "q1r": 4, "q2": "El plan presentado aquí es bastante elaborado. El plazo de 1-3 y 4-9 meses que se da también se divide en tareas, y cada conjunto de tareas está bien dividido en conjuntos de características.\r\n\r\nEsto es muy bueno ya que la comunidad puede seguir de cerca el progreso semana a semana. Veo que esto se alinea de alguna manera con la metodología ágil, y espero que el equipo siga la metodología ágil para incluir los comentarios de la comunidad mientras trabajan en la propuesta.\r\n\r\nLos objetivos generales del proyecto dan una buena idea de cómo es el éxito y a dónde nos llevan las características de los marcos temporales más pequeños en términos de una visión más amplia. Por lo tanto, estoy totalmente de acuerdo en que la información proporcionada es suficiente para auditar el progreso y el éxito de esta propuesta.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Los proponentes desean introducir documentos verificables relacionados con el trabajo y la experiencia presentada como una NFT. Esto identifica un problema en el entorno del desafío, resuelto por el desarrollo de una dapp por lo que la propuesta coincide con el desafío. Los autores exponen claramente las muchas formas en que van a añadir valor al ecosistema de Cardano, principalmente a través de información verificable y descentralizada que no puede ser manipulada. Puedo tomar el logro de los objetivos establecidos por semanas como el indicador clave de rendimiento, lo que parece bastante justo teniendo en cuenta que no se proporcionaron otras métricas. Como desarrollador no veo problemas para que el proyecto escale con su entorno en crecimiento, y me gusta la iniciativa que han tomado de hablar ya con posibles socios frente a algunas instituciones.  Esta solución se sumará al ecosistema y, sobre todo, si mucha gente empieza a utilizar esta forma de autentificar las credenciales, habrá menos fraude de documentos y otros problemas que ocurren comúnmente en la escena de la contratación. No me preocupa esta propuesta. Buena suerte al equipo, ¡os deseo lo mejor!", "q0r": 5, "q1": "Los proponentes dan enlaces y una referencia explícita a sus nombres y habilidades, que he conseguido verificar con un poco de google. Por lo que parece, este proyecto ha implicado a un equipo considerable para trabajar en él, y el tipo y número de miembros del equipo ya está establecido. El presupuesto está claramente definido y parece razonable para el trabajo que hay que realizar para que el proyecto tenga éxito. El calendario establecido para todo el trabajo parece realista. Hay un plan muy concreto para toda la implementación que, como desarrollador, puedo apreciar. Las tecnologías que se van a utilizar están todas enumeradas y parecen legítimas para la tarea que se va a realizar. Hay suficientes recursos para que los proponentes construyan con éxito su proyecto desde la base, pero sugeriría buscar otros proyectos de código abierto y lo que han hecho para minimizar el trabajo común necesario.  Se mencionan algunos riesgos y desafíos, así como posibles soluciones a algunos de los obstáculos en el camino.  En general, parece un proyecto factible con un buen equipo que lo respalda con sus nombres y títulos.", "q1r": 5, "q2": "Me encanta el hecho de que el equipo haya previsto podcasts y una presencia en las redes sociales, pero me habría gustado que tuvieran un canal de discordia o alguna otra forma de informar a sus votantes y a los miembros de la comunidad sobre cómo va el desarrollo y el progreso del proyecto. Las métricas y los indicadores clave de rendimiento son muy detallados, lo que no es habitual. Una cosa que me gustó es que el equipo tiene una gran definición de éxito que me parece realista como desarrollador. La hoja de ruta con hitos para la implementación técnica y no técnica es lógica y secuencial. Hay una descripción clara del problema que se pretende solucionar con la autentificación de la experiencia laboral de las personas y una descripción clara de la solución, que está muy bien pensada.  Me gusta mucho que los proponentes hayan mirado a través de los ojos de sus futuros usuarios y vean lo que esperan de su plataforma y tengan un plan para ofrecerlo. En general, creo que el proyecto puede ser más fácil de rastrear si el equipo tiene una manera de obtener retroalimentación continua de la comunidad, así como dejar que la comunidad conozca el progreso.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Considere esta propuesta de alto valor, porque busca facilitar el proceso de verificación de un historial de trabajo y estudio, con el fin de hacerlo más barato y también para evitar el fraude. La verificación laboral es, de hecho, un proceso burocrático y costoso, y ya he visto otra propuesta que aborda este tema, lo que demuestra su necesidad de ser retratado. Si este proceso se realiza a través de la generación de NFT, registrado en la blockchain de Cardano, puede beneficiar mucho a nuestra comunidad y facilitar el proceso de contratación de personas tanto para los propios candidatos como para las empresas. Los autores argumentan muy bien las ventajas de hacer este proceso de verificación a través de nuestra blockchain, confiando en la permanencia e inmutabilidad (como él dice) de la tecnología para obtener los resultados deseados. También se preocupan por dejar claro cuáles son las ganancias para cada parte del público: personas, instituciones académicas y empresas. Así que, creo que sí, este proyecto apunta directamente a generar aplicaciones de alto valor para nuestro ecosistema beneficiario.", "q0r": 5, "q1": "Me pareció impresionante cómo el equipo detalla exactamente cómo sería el uso de cada tipo de usuario en la aplicación, lo que compró que tienen total conocimiento técnico y planificación en relación con los contenidos aquí presentes. El esquema de un guión también es ejemplar, es decir, sabemos 1) cuándo ocurriría 2) quién lo haría 3) qué ocurriría. Dicho esto, no hay mucho que cuestionar, aparte de que el mayor detalle posible siempre es bueno, podríamos saber más sobre lo que pasaría, por ejemplo, más divisiones de bloques de tareas. El equipo también se preocupa por detallar cómo pretende ampliar el alcance de la herramienta, lo cual es, de nuevo, positivo, porque demuestra que son conscientes de la importancia de esta parte de la propuesta. En cuanto a la división financiera, me pareció que esta parte era superficial, la cantidad solicitada en la financiación es muy alta, lo que requiere una muy buena explicación de por qué se necesita tal cantidad. Aunque hay un desglose de costes por partes, es poco profundo. Y por último, sobre el equipo implicado, se detalla quiénes son de forma individual, esto es fundamental para transmitir confianza y con esas explicaciones se transmite mucha confianza en que son capaces de ejecutar el proyecto con éxito. Es muy positivo como incluso adjuntan perfiles de linkedin, dándonos la posibilidad de conocerlos aún más que los detalles de la propuesta. Sólo mejoraría la parte de financiación de la explicación.", "q1r": 4, "q2": "La hoja de ruta del proyecto es muy detallada, por lo que tenemos el material necesario para controlar el progreso de las cosas. El autor también establece en un tema específico cuáles serían los objetivos y soluciones del proyecto, lo que dice mucho sobre la auditabilidad, pero esta parte podría ser más detallada. Me gustaría que el equipo hubiera puesto tanto énfasis en esta parte como en el guión, por ejemplo. Lo que se necesita aquí es establecer un puente entre el equipo y la comunidad. ¿Cómo se presentarían estos resultados parciales? Necesitamos una forma sólida de monitorizar la ejecución del proyecto, porque, a pesar de no ser tan multidisciplinar (lo digo porque en ciertas propuestas hay tantas áreas de conocimiento implicadas que incluso podemos perdernos un poco en cómo monitorizar la auditabilidad), sigue siendo una idea compleja. Sería importante que el equipo presentara periódicamente el feedback del proyecto a la comunidad, por ejemplo, esto podría hacerse mensualmente. Así que creo que hay algunas cosas que revisar cuando se trata de la auditabilidad.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "A problem and a solution to the problem have been identified, and the idea has some potential but its usability, as it is presented, seems to get stuck in the early stage of the project and I will explain it in the next section why I think so.\r\n\r\nSome key metrics are defined and are outlined with the challenge objectives but more are needed to evaluate the impact of this project to the community and to the Cardano ecosystem", "q0r": 3, "q1": "The project aims to create a system where people can store info about their studies and work experience, info that will be endorsed by relevant third parties, and will be frozen on the blockchain as a Proof-of-Trustworthy, in a form of NFT, for further reference.\r\n\r\nWhen creating and making public a CV the person who is looking for a job is having in mind at least of couple of directions to follow: 1. to get the attention of the potential employer and (if necessary) 2. to hide his intention, in most of the cases, of leaving the actual employer.. Starting from this points some major drawbacks are at the horizon. A job offer is based on a series of requirements, and thus giving the possibility of each potential candidate to adapt his/her resume to meet those requirements and not being filtered out. They don't have to lie, just to make the resume more attractive. Saying this, why people would like to take snapshots of their resume that wont match in some aspects over time?\r\n\r\nSecond issue, regarding the request to the employer to endorse the working experience of an employee who is leaving, who would want to be so nice and do this freely knowing that the company will lose an (valuable) asset?\r\n\r\nReworking this proposal and finding a viable usability for the project ma give a better chance for a successful implementation.\r\n\r\nAccording to the LinkedIn profiles posted as reference for the team members it looks they don't have the necessary experience to help them implement the project. Additional relevant references are required to get the better result of the assessment.\r\n\r\n", "q1r": 2, "q2": "The proposer is not aware of any challenges and risks relevant to a successful implementation.\r\n\r\nBased of the info provided, even the idea has potential, it seems unlikely for the project to succeed.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal presents an excellent and innovative use case for NFTs to solve real-world issues. The technical challenges are negotiable and the author is rightly approaching the adoption problem by aiming to onboard one university which can bring about a cascading impact on the whole ecosystem. Overall the proposal is effectively addressing a core challenge. ", "q0r": 5, "q1": "The proposer has carried out research in this new area which could solve old problems and has come up with a workable plan. The has a detailed breakdown and does not seem to have major technical risks. There is a very high chance that the project will be implemented successfully.", "q1r": 5, "q2": "The project has a clear roadmap and task analysis. The steps are well-defined and achievable. The aim to get one university to sign up is a healthy idea to try out the project. Considering these parameters it is felt that the proposal is auditable. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea of using NFT minting as proof of academic and work achievement is very good. There are several proposals in this fund with a similar angle in different categories, but this one expresses the problem and potential solution in a very coherent and logical way and with a credible roadmap. I am worried about this technology to reside in a startup with so many experienced team members without specifying the fee it will charge users for their service after successful completion. This looks like an attempt to get R&D funded by Project Catalyst while retaining the IP and future revenue from potential success.", "q0r": 2, "q1": "The proposer is already known to the Cardano community and the team is experienced and skilled to carry out the proposal. I doubt that the $25K or a MVP using 1 company and 1 academic institution will be indicative of the success or possible flaws of the implementation.", "q1r": 3, "q2": "The proposal uses repetitive wording and lengthy lists to create an illusion of thorough analysis without explaining how this proposal is different from its many competitors, how institutions can be onboarded and what the risks are. To me, the most worrying flaw of the proposal is the lack of separation between startup and Catalyst proposal, or how this proposal's benefits are unique to Cardano.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "La capacidad de verificar la autenticidad de los documentos relacionados con el trabajo (es decir, los títulos) y la experiencia laboral como fichas no fungibles (NFT).", "experience": "El equipo está formado por 5 personas: desarrollo de negocio, arquitectura técnica, scrum master, experto en móviles y un desarrollador de blockchain."}