{"id": 384852, "author": "matthiasksieber", "title": "Reverse Bidding Platform", "url": "https://cardano.ideascale.com/a/dtd/384852-48088", "category": 26240, "amount": 28600, "description": "Los pequeños agricultores suelen carecer de capacidad para vender sus productos a los grandes compradores.", "funded": 0, "upvotes": 18729171, "downvotes": 20154990, "votes_result": 1425819, "votes_cast": 163, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal tries to address the issue of Small scale farmers not being able to sell their products to large-scale buyers due to not being able to meet the capacity of large-scale buyers. The proposal tried to overcome the issue by meeting the large scale buyers needs by buying fractional amounts from many small scale farmers", "q0r": 5, "q1": "The team has the necessary experience and expertise to make this proposal a reality.\r\nThe proposal consists of a detailed plan with a timeline and is quite self-explanatory. But the only thing that concerns me is that the team has not mentioned the possible challenges that they may face while implementing the proposal. Based on all this information the chances of the plan being implemented successfully is high.", "q1r": 4, "q2": "The proposal could have been better to audit if the proposal consisted of well laid out KPIs, a Definition of success, and a detailed budget allocation due to lack of this information it would be hard to track the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_317", "no_vca": 20, "ne": 3, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "This is an intriguing idea, and in fact could have implications in the developing world for smallholder farmers long-term. A dApp seems like an appropriate, broadly accessible way to attempt to address this need. Seeing proposals like this, which could bring new users to Cardano by virtue of creating a tool that fulfills a basic need, is excellent. It fits the challenge snugly.", "q0r": 5, "q1": "I don't have the technical knowledge to know how long it will take to develop these features. It is apparent that the developers are clearly experienced and so I'm giving it 4 stars, but if more technically minded CAs have provided assessments as well please weigh what they say. ", "q1r": 4, "q2": "Information is unfortunately scant here. I almost gave this 2 stars, but the saving grace is that the turnaround on this project should be quick, and there's a commitment to finish it in 11 weeks. This may mean that's it's worth it, though I'd recommend the proposers provide more detail and perhaps even plan to commit to reporting practices for steady communication on dApp development with the Cardano community in the future.", "q2r": 3, "assessor": "z_assessor_853", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This is an intriguing idea, that promises impact. It also fits in the challenge brief, and if successful, will attract an interesting new group of users for Cardano: no-wallet farmers. \r\n\r\nWhat I am missing is understanding how this will fit into the existing market and its challenges for both small-scale sellers and big-scale buyers, and how this proposal will fill the gap. I appreciate the detailed backend features that promises intensive execution on the technical side, however would have been great to see the rationale-behind and the anticipated process of customer development. In its current form, it looks more like a coding plan for a long hackathon, rather than a well-thought and executable proposal. ", "q0r": 2, "q1": "First and foremost, I trust that the team would achieve its listed backend features and its KPIs. However, I don't know what would be the meaning after these achievements. Besides technical roadmap, I am unable to see through how they would work with customers, how would they attract enough both farmers and buyers to create a market or even to test their initial offering. Furthermore, I am also unable to establish the creadibility and the anticipated roles of the working team. Winning a hackathon does not guarantee success in real life. I think perhaps the team need to rework this proposal, give it an appropriate level of depth and submit next time. On the last note, it would be better if the team also interact and answer comments to exchange ideas and co-create, as well as to prove their commitment to the project.\r\n", "q1r": 1, "q2": "I'd be easy to track the progress of this proposal but not its success. Timeline for backend features and KPIs are clear. However, the definition of success, why it is a success, and how it can become a model for scaling up are poorly or not defined. As mentioned above, besides technical development, would be better if the team also define their tasks and actions in term of customer development to create the foundation for its future and long-term development.\r\n", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 21, "ne": 5, "ng": 15, "nfo": 1, "vca_o": 1}], "solution": "Cumplir los objetivos de los grandes compradores ofreciendo ofertas fraccionadas.", "experience": "Equipo de Loxe Inc., grupo de desarrolladores de Plutus con experiencia y ganador de un hackathon, participantes de Gimbalabs PPBL, y desarrolladores web con experiencia"}