{"id": 385153, "author": "titan", "title": "Web based transaction editor", "url": "https://cardano.ideascale.com/a/dtd/385153-48088", "category": 26240, "amount": 16000, "description": "El CLI de Cardano es demasiado engorroso para utilizarlo en transacciones grandes y complejas y bloquea a las personas no técnicas.", "funded": 2, "upvotes": 141093638, "downvotes": 2810792, "votes_result": 138282846, "votes_cast": 791, "f6_no_assessments": 7, "f6_rating": 4.857142857142857, "videos": [], "media": [], "f6_assessments": [{"q0": "El proponente quiere introducir un editor web de transacciones que sea más usable para reemplazar el CLI (interfaz de línea de comandos) de cardano. Como desarrollador que soy, me identifico con el problema descrito en la propuesta y compruebo que cumple con el reto planteado. Está claramente articulado cómo esto traerá valor y alegría a los desarrolladores en el ecosistema de cardano y a mí incluido. Los KPIs son relevantes porque se miden en experiencias de usuario. Las métricas son relevantes y está claro que el proponente ha pensado mucho en la propuesta en sí y en la propia herramienta. Habrá desafíos, pero no me cabe duda de que, teniendo en cuenta la experiencia y la gestión del tiempo de los autores, todos los obstáculos se superarán sin problemas. No falta nada en esta propuesta, lo cual es raro. Este proyecto añadirá algo que falta en el ecosistema: una forma fácil de trabajar con transacciones sin tener que sufrir. No hay preocupaciones aquí. Este proyecto tendrá un gran impacto en la comunidad si se financia y animo a la gente a que vote por él, como haré yo.", "q0r": 5, "q1": "Hay tantas credenciales y habilidades enumeradas que me llevó un tiempo leerlas y verificarlas todas. El tipo es doctor en física teórica y tiene las credenciales para demostrarlo. Hay un plan de ejecución claro y conoce el trabajo que hay que hacer y el tiempo y el proceso para hacerlo. El presupuesto es claro y está lo suficientemente desglosado como para que sea sensato alcanzar los objetivos fijados, que son muchos y ambiciosos. Se presenta un calendario realista para completar el trabajo, pero me pregunto si un equipo no sería más beneficioso, pero ciertamente puedo respetar al hombre que quiere construir una herramienta en el mannar adecuado y tener miembros del equipo no siempre es el camino a seguir para llegar a la fecha final. Se proporciona una explicación detallada no sólo sobre el \"qué\" sino también sobre el \"cómo\", lo cual es raro y lo aprecio. Se enumeran todos los recursos necesarios para el desarrollo del proyecto. Los aspectos técnicos, como el editor elegido y las funcionalidades ya presentes y previstas para el futuro, se describen y tienen sentido como hitos. El proponente ha tenido en cuenta los retos y riesgos relevantes para el éxito de la implementación. Además, ha analizado el impacto de esas decisiones. El proyecto está en sintonía con lo que ya se ha hecho, y creo que esto será un bloque de construcción para el desarrollo y la construcción futuros. ¡Un trabajo absolutamente estelar de una propuesta! ¡Buena suerte!", "q1r": 5, "q2": "Hablando de trazabilidad, el autor ya tiene un calendario y un plan muy específicos sobre cómo incluir a los probadores beta de la comunidad para que le ayuden en el ciclo de trabajo, así como planes para la documentación. Dar a conocer a la comunidad las características que se están poniendo a disposición es una prioridad. No veo ningún problema en hacer saber a la gente lo que se hace y se desarrolla. Las métricas y los KPIs también están a la par del resto de la propuesta y eso es lo que ocurre en muchas otras propuestas. Una hoja de ruta con hitos y todos los elementos necesarios están presentes, así como un calendario que considera los desafíos y tiene un amortiguador para ellos. Los problemas son comprensibles y las soluciones están bien escritas, aunque a veces son un poco técnicas. Esta es la solución para las luchas del ingeniero de software de todos los días.  ¡Buena suerte! Voto por usted.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is brilliant and  clearly addresses the challenge by creating a user friendly alternative without sacrificing the power and utility of the Cardano CLI. The transaction editor aims lower the technical barrier to crafting complex transactions and become more accessible to a wider range of users. This proposal is a  great example of an application that pushes power to the edges. I believe this project can significantly boost development in Cardano's DeFi ecosystem.", "q0r": 5, "q1": "The proposer has shown to have the ability, technical skills, and plan of action to follow through with proposal. The GitHub repository for this project shows that there is already a significant amount of progress and currently has a working \\alpha-prototype of the the transaction editor. The proposer offers a well defined and realistic timeline to complete the project along with a reasonable budget. This project seems like a promising venture and at a good value to the community. ", "q1r": 5, "q2": "Easily auditable record of accountability through GitHub. The proposer clearly has experience with open source production, which allows the community to more easily track and audit the progress of this project after the project is funded. The proposal offers a clear set of metrics and key points of friction that can be used to measure their progress and thus maintain transparency with the community.", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 21, "ne": 5, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "The command-line tool Cardano-CLI is powerful and versatile. Due to its versatile nature, the learning curve is quite steep and demanding. A web GUI-based step-by-step app is likely to help onboarding new developers and reduce the friction for new people trying to learn the Cardano ecosystem. This tool will be a great help even for SPO and those trying to experiment with things like multi-party signed messages etc. ", "q0r": 5, "q1": "The proposer is a prize winner in the Capstone challenge which was conducted during the Cardano summit. Therefore he has demonstrated capability in the area of work. Moreover, the project has less technical risk, therefore I believe that the proposer will be able to achieve his objective. ", "q1r": 5, "q2": "The list of features and the set of transactions that this web application will help in the building has not been clearly brought out. However, the end state and the objective is clear and straightforward. This is likely to improve the auditable and success measurement. The fund requested is slightly on the higher side and maybe broken down to be more transparent.", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal I believe could possibly be a great fit for two different categories, this one and the open-source developer ecosystem as I feel it is a great fit for both challenges. \r\n\r\nThe proposal itself makes a great point about Cardano-CLI which is in fact not very user friendly, and I and many others anticipated something like this eventually coming along and allowing a higher-level UX for less experienced developers to be able to create txs for the Cardano blockchain in a user friendly way, which the Cardalo-CLI is evidently not. ", "q0r": 5, "q1": "Oscar is a fantastic programmer and has made previous contributions to the Cardano ecosystem, he was also a very active Plutus Pioneer and contributor.\r\n\r\nGive his details plan of execution and timeline, I believe we have more than enough information to determine that this proposal has a very high likelihood of success. Oscar has also opted not to use Blockfrost API which proves his level of competence in utilising Cardano DB-Sync, and interacting with the Cardano blockchain.", "q1r": 5, "q2": "I believe given the prior work on this tool already with the working text editor porting it to be a web based editor will be well within the proposers reach and given the roadmap posted with detailed milestones and KPIs, I believe this proposal will be incredibly easy to audit and determine just how successful it was.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "Very strong proposal with a great potential and utility for the community. Since it will be available on GitHub licensed GPL3, it is highly likely that other blockchain projects might be interested in adopting this innovation. Addresses the challenge very well.", "q0r": 5, "q1": "The necessary experience is presented, impressive skills + Plutus pioneer program. The plan is very good and convincing from the technical point of view.", "q1r": 5, "q2": "While the information to audit the progress does not match the VPS budget, the proposal gives a convincing justification for that. In addition, the progress (and later the success) of the proposal is easy to measure from the Github.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal clearly identifies a need within the challenge. As well a clear path to implementing that need through a transaction editor layered on top of the CLI.", "q0r": 5, "q1": "The proposer is well known within the community and holds the skills required to perform the task. The funds requested are well allocated and clearly defined. The implementation is well thought out and expressed although it would be good to highlight possible pitfalls such an implementation may come across. ", "q1r": 5, "q2": "There is a clear path to audibility. The road map is well defined. The KPIs listed are very well thought out. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "The proposal addresses the issues of adoption and attracting new (especially technically inexperienced) people to Cardano. ", "q0r": 5, "q1": "Since the proposer is already an experienced developer and has provided github repositories of existing work. The only risk that isn't considered: what if the dapp testers won't be representative of the real use-cases? This could be detrimental to the UX of the final product. ", "q1r": 4, "q2": "Due to the fact that the project will be open-source from the get-go and will explicitly gather community feedback, the progress will be easily auditable. ", "q2r": 5, "assessor": "z_assessor_832", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Un editor de transacciones basado en la web, un servicio que le permite elaborar sus transacciones de fichas de menta en una UX guiada", "experience": "Construir el editor de transacciones para el editor de texto, fue un ganador del premio en el desafío Plutus Pioneer Capstone"}