{"id": 385138, "author": "javiertc86", "title": "Distributed storage Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/385138-48088", "category": 26240, "amount": 15000, "description": "El mantenimiento de una infraestructura IPFS requiere mucho tiempo y es costoso.", "funded": 1, "upvotes": 75187394, "downvotes": 3789782, "votes_result": 71397612, "votes_cast": 324, "f6_no_assessments": 4, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "La propuesta aborda el reto de manera muy eficaz y ofrece un plan completo para construir un conjunto de herramientas para desarrolladores para una solución de almacenamiento descentralizado utilizando IPFS en Cardano. Articulan claramente cómo abordarían este problema proporcionando una API y herramientas para desarrolladores (SDK) -fácil de usar y de alta disponibilidad- para interactuar con IPFS. La creación de estas herramientas para los desarrolladores facilitará el trabajo de las personas que desarrollan en Cardano (especialmente para los creadores de NFTs), al tiempo que atraerá a más desarrolladores a construir en Cardano (una barrera de entrada más baja para el desarrollo), lo que eventualmente conducirá a la creciente adopción de dApps construidas en Cardano.", "q0r": 5, "q1": "Esta propuesta ha demostrado tener un equipo experimentado y excepcional, y podemos comprobar su perfil en Linkedin. No sólo la función del equipo está bien establecida y explicada en detalle, cada persona también tiene más de 7 años de experiencia en su campo respectivo. El presupuesto es razonable para el salario actual de cada función respectiva, pero faltan detalles sobre lo que costaría la cosa. Sería útil si al menos pudieran proporcionar más detalles sobre, por ejemplo, el coste de la infraestructura del servidor: ¿qué tipo de servidor utilizaría? ¿Cuánto cuesta y se mantiene? etc. Aparte del presupuesto, que proporcionen un plan de implementación de una manera sensata y conductible, por ejemplo, cómo sería el SDK JS, cuáles son los puntos finales de la API HTTP, cómo se implementaría la interfaz de usuario, etc. La razón por la que no le doy 5 estrellas, es por la falta de detalles en el presupuesto, especialmente en lo que respecta al presupuesto de la \"infraestructura del servidor\". Aparte de eso, en general esta propuesta tiene un gran potencial de ser implementada con éxito.", "q1r": 4, "q2": "El éxito de esta propuesta está claramente definido y es fácil de medir en el sentido de que las API y los SDK se entregan con éxito o no. Sin embargo, no han especificado si este SDK será de código abierto en Github o no, y eso hará que sea menos transparente comprobar el progreso en el camino. Mirando su anterior repo de Github (cardano-wallet-js), parece que podrían crear fácilmente un nuevo repo bajo tango-crypto. Pero, de nuevo, ya que parece un servicio de pago (desde su sitio web, hay niveles para diferentes servicios), no puedo estar seguro de si harían esto de código abierto o no. Le doy 4 estrellas porque me gustaría estar seguro de cómo comprobar el progreso de forma más transparente.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Could not stress enough how important distributed storage is for DApps going forward.\r\n\r\nIn fact, most \"decentralized\" applications still rely on some centralized backend utilising PostgresQL or some other database. This challenge is perfect for the Cardano and web3 ecosystem in general, and could be utilised, if successful, by basically every DApp.", "q0r": 5, "q1": "Given the progress made on other tools created by the team members, the progress on the API endpoints that the team has mapped out already I cannot give this proposal any less than 5 stars when it comes to how likely it is that team will successfully implement this roadmap and reach their milestones.", "q1r": 5, "q2": "The roadmap too, looks great. Roadmap includes detailed milestones with specific KPis for each which is what I generally like to see because it greatly enhances our ability to audit the success of the proposal.\r\n\r\nThe team has provided a very detailed look into the very API endpoints that they are creating for this JS SDK.\r\n\r\nThis proposal is highly auditable and is definitely worth of 5 stars!\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal will have a positive effect on the Cardano ecosystem and will drive NFT consumers and producers to Cardano, however the risk could be in gateways which seem to be centralized. This could lead to time lag when resolving IPFS URLs. ", "q0r": 4, "q1": "The proposers have a vast range of experience with all things Cardano and have presented a rich amount of evidence to that effect. ", "q1r": 5, "q2": "Going from the history of the team, it is very likely that their solution will be open-sourced, and therefore subject to public scrutiny, although that is not explicitly mentioned. ", "q2r": 4, "assessor": "z_assessor_832", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "Decentralised File Systems like IPFS are fundamental to build pure DApps. This proposal will heavily drive an increase of the utility and adoption of Cardano by allowing other projects to use IPFS through their APIs. Plus, it will provide a service layer which will allow to mint NFTs. To me, it looks like an essential piece of infrastructure needed by other projects, in order to be more productive and focus more on Their business objectives.", "q0r": 5, "q1": "The plan is detailed and clear. The team is experienced and has built with success several other applications in the Blockchain space. From my point of view, the budget should have been a bit higher to cater for unforeseen circumstances. \r\nOf course, I believe the server infrastructure is 9000 and not 90k - That 90k is probably a typo. ", "q1r": 4, "q2": "The proposal roadmap is simple, clear, and can be audited effectively. I really wish I could give 5 stars, because the roadmap is linear and easy to audit. However, we are  missing Key elements from the challenge that is the measure of the growth/usage of the system.\r\nI think this is because in the roadmap are mixed the auditability with the implementation plan and. There is a simple way to add the missing important information: I would have added one more step to the roadmap: After the service is launched, monitor (1) how many projects are actually using the APIs, and (2) how many files are added to IPFS, (3) how many NFTs are minted. \r\n", "q2r": 4, "assessor": "z_assessor_956", "no_vca": 22, "ne": 7, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Proporcionamos una API HTTP y un SDK fáciles de usar para el almacenamiento IPFS.", "experience": "Operamos el pool de apuestas TANGO y desarrollamos cardano-wallet-js y Tangocrypto Software as a Service."}