{"id": 403110, "author": "francek", "title": "Incremental CA assessments", "url": "https://cardano.ideascale.com/a/dtd/403110-48088", "category": 26453, "amount": 4200, "description": "Time available in the Assess stage alone is maybe not enough to garner a larger assessment rate which are also of high quality.", "funded": 2, "upvotes": 48563493, "downvotes": 4000912, "votes_result": 44562581, "votes_cast": 173, "f6_no_assessments": 8, "f6_rating": 3.9583333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 457, "q0": "An interesting idea. However, this proposed process (CAs having to repeatedly revise their reviews by checking them against successive iterations of the proposal) is quite fiddly, and could easily end up with CAs engaged in time-consuming ding-dong written battles with proposers who disagree with their view. The idea that starting earlier will necessarily give CAs \"more time\" seems to be fundamentally flawed if additional and complex tasks (aligning the review with potentially several successive iterations of a proposal) are being added.  Overall, the proposal seems likely to make the work of CAs *more* complex and difficult, which is the exact opposite of what the challenge setting aims to achieve. Also, it feels like the proposal fundamentally misunderstands the CA role, and conflates it with community feedback. CAs are currently supposed to offer an *independent* assessment of a *finished* proposal, which should not involve building a relationship with the proposer which could blur that independence or introduce potential conflicts of interest. This is in contrast to the community \"refine\" process whereby people engage with a proposer on a personal level and make suggestions. I feel this proposed solution could damage the independence and the interpersonal neutrality of CA reviews. Of course, this is a matter of opinion - but given that the CA community within Catalyst is such an active and engaged one, I feel the proposer could have done some initial research amongst CAs to ensure that the proposal aligns with their consensus on what being a CA means. This could have actually been costed and written into the proposal - it would have helped align the proposal with the challenge goal of solutions being co-designed by CAs as a group.", "q0r": 2, "q1": "The open-source nature of the CA tool means that it would be feasible to make the suggested modiffications to it. However, this is not the whole story of feasibility. First, not all CAs use the CA tool; some go straight to Ideascale, which can't be readily modified in this way. So we would either end up with a \"two-tier\" structure, where 2 different groups of CAs were engaging in two very different processes; or alternatively, we would have to enforce use of the CA tool for assessments - but the proposal does not address at all how the latter would be managed. There would also surely have to be a higher level of accountability (and probably stress-testing/risk management) for the voter tool itself than is currently in place, if the voter tool was going to become the only way to submit CA assessments; the proposal doesn't address how this would be managed, and how/whether the builders of the voter tool would be remunerated for the extra work this might generate for them. I would also like to have seen the proposer include some time and budget for user testing, and for making adjustments in the event that users identify problems with it; and I'd also like to see a defined process for collating and responding to user feedback. Also, the proposal identifies a specific and very significant risk (i.e. that a CA could spend a lot of time reviewing and engaging with proposals which are then withdrawn), but offers no mitigation at all for this. I feel that this risk alone is sufficient to make the proposal unworkable, as it looks likely to happen often (many proposals are withdrawn before the deadline), and would be likely to completely alienate CAs who were affected. In short, the overall feasibility problem for this proposal is that the proposer has only looked at the technical feasibility of the task, and has not considered how to implement it on a human level in the community. So I have to conclude that overall, it's not feasible to implement it.", "q1r": 2, "q2": "The audit metrics given are fine as far as they go; and it's positive that the progress of the work will be transparently trackable via GitHub. However, there is no audit process for the actual implementation of the solution - for example, auditing numbers of people using it, user feedback from both CAs and proposers, or numbers of assessments which are \"half-done\" in the sense that the CA does not come back and rework their assessment in line with the proposer's updates. So while we can easily audit whether the proposer has literally done the work or not, we cannot audit at all the effect of the work, and the return on the intention to make the CA process better. That seems to me to be the main thing we would need to be able to audit, especially for such a fundamental rethink of the work of CAs; so I'm forced to conclude that the proposal is not sufficiently auditable.", "q2r": 2, "assessor": "z_assessor_1157", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 734, "q0": "There are two elements to this review:  the first is that this forking of the CA-tool seems wholly plausible.  The second, is that there is really no sense in doing it.  This isn't the first suggestion for CAs to start working on assessments early, suggestions which have included widening the official time window, having iterative, integrated assessments and proposal developments and having always on proposals and assessments with no deadlines.  This current suggestion is to tweak the CA-Tool to continuously fetch and monitor changes to proposals on Ideascale, allowing a CA to build out assessments in-situ, and whenever a proposal he has assessed changes, he is notified and can go in and change the assessment to reflect the change.  All of these suggestions, including this one, are missing the point.  CAs can already start working early:  in the months leading up to CA work they can be learning about the ecosystem and helping proposers in the rough draft stage by reaching out when they appear in telegram channels and discord asking for experienced eyes on their project.  During the weeks leading up to CA work, they can be reading proposals and giving comments on how to polish or complete proposals.  During all of this they can be taking notes and organizing their thoughts and approach to the work, using simple word processing tools and spreadsheets, suited exactly to their own workstyle.  And then, finally, when the work week arrives, they will be able to be ultra-productive, with less time spent researching, far more familiarity, plenty of notes for filling in assessments, a better sense and organization of the proposals they will be assessing, and, like a cherry on top, many more high quality proposals to assess due to all the extra help the teams had getting them right.  And in my opinion, great proposals make it a lot easier to write great assessments.  The tool presented here solves for almost none of the issues, and replaces tried and true solutions that are comfortable for the user with a top-heavy software solution that only gets about half the needed information on record.  Redesign it with the workflow laid out above, and many CAs would be happy to use it.", "q0r": 2, "q1": "Despite having a very clear path spelled out with where the proposer wants this tool to end up, there are a number of stumbling blocks to its implementation and use.  The biggest is that a proposal on Ideascale is not a static entity with only one dynamic component, content updates.  Proposals switch names and challenges, they add and lose team members, they go away and come back.  Many proposals.  Over half of the 200 or so proposals I was tracking for Fund 8 would stay in an unassessable state for weeks, and then suddenly they would go through multiple, rapid, repeated changes.  Any attempts to assess these in motion like that would have just wasted more time than it saved, with proposals swinging wildly from being 2 stars for missing some critical piece to being 5 star when they added it with minutes to spare the night before assessments start.  The fact of the matter is that it is easy to imagine ways to write an assessment early, but the closest you can come is to just take some good notes early, and keep everything organized.  If this project pivoted away from rebuilding the CA-tool, and instead focused on the process that the proposer describes well (iterative changes to proposals) and built tools for the CAs to be better PREPARED for CA week, than I am all in.  As it stands, despite the solid approach to the development side, the tool being developed is going to struggle to keep what the CAs actually need in any kind of order.  ", "q1r": 3, "q2": "The included vision of the success of this tool tells me that this proposer has his heart in the right place, as he accurately identifies everything that a fully supported, 3-month CA tenure would result in, from more comments on proposals, to more time spent reading and understanding them, to better compensation from being more productive and better informed.  The issue is just that the formulation is upside down.  Success, though measured in these terms, is not a measure of CAs spending more time writing assessments:  it is a measure of supporting CAs in their efforts to do all the little things that allow them to spend LESS time writing assessments.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1884, "q0": "The proposal identifies a valid problem that is very well aligned with the challenge objectives. The challenge among other things seeks to improve CAs performance and this proposal finds a way to improve the existing mechanism in order to achieve that.\nThe proposed solution is an improvement on the process of assessment with earlier start for CAs, before the proposals are completed/the beginning of the assessment stage. To back that up functionally the proposer will change the CA tool in order to be more flexible and keep track of the changes that are made on the assessment and on the project. On top of all that, the vCA tool will be developed to be able to show the history of the work of the CAs during the whole process, which will drastically reduce the vector for abusing the CA position.\nThe impact of this proposal on the quantity and quality of the CA work will be colossal. Due to the increased participation of the CA cohort during the early stages of the proposals, the proposals will improve drastically. In theory, all the remarks that the CA has to make for a proposal could be made earlier and implemented on time. \nThe project is described meticulously and has no weak points that I can find. It is detailed, structured very well laid out and explained clearly. It foresees problems and already has solutions for them.\nI strongly agree that this proposal effectively addresses the challenge.\nKudos to the proposer for this superb work!\n", "q0r": 5, "q1": "The proposer knows in an identifiable manner all the skills needed and the time needed to complete the different tasks that constitute the development of the solution. Also he presents the whole actionable plan step by step with time allocated for every step of the way.\nThe breakdown of the whole project into actionable tasks is impressive and instills trust and respect for the organizational skills and the knowledge and experience the proposer has. This is one of the clearest action plans I have seen among the proposals in this fund. \nDue to the superb actionable plan laid out, the budget is very clear as well. The only thing needed is to state the hourly rate ($50/h) and check the time in the action plan. The hourly rate is reasonable, even on the lower side for the experience level of the proposer. What worries me a bit is that the proposer did not put much reserves in the budget for unexpected events, but I guess the proposer is experienced enough to foresee better than me such risks.\nThe proposer foresees risks and implements mitigation solutions for them for redundancy of the project in the project itself. However, there is one risk that I can imagine that the proposer does not address, namely that IOG and the Catalyst community should agree that CAs could start partially assessing proposals before the assessment stage. This will require consideration of the current mathematical models on which the Project Catalyst has been built and how this change will affect the whole model. That does not mean that we could not have this tool prepared for when the IOG and the community decide on the matter. For sure there are a lot of people doing preliminary work even now, but they are using less suited tools.\nThe vast experience of the proposer is obvious by the presentation of the proposal itself, however the proposer backs it with an impressive CV (the CV is attached to the proposal it is not linked) that shows the proposer is a Master of computer science and information technology and has more than 10y exp. in software development. \nThe only remark I could make to improve this proposal is to suggest an open mind for collaboration with other people from the ecosystem, but that is a personal preference and choice.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer suggests that the auditability of the project could be done by the outlined actionable plan and all progress could be seen as commits on the forked projects in github. \nThis is a very reasonable way to measure the progress of a technical project such as this one. The proposer has stated in the proposal that he will be committing 16 hours per week and the solution will be delivered in 6 months. Because there is a clear actionable plan, it is easy for the auditor to measure does the weekly progress agrees with the plan.\nEffectively the proposal has outlined milestones, deliverables and measurable benchmarks.\nThe success of this proposal is not defined by easily measurable parameters. For example it will be easier to measure if the average assessment of a proposal increases by X, or if the CAs assess Y more assessments on average than in previous funds, as opposed to “CAs will enjoy the extended time to engross themselves into more proposals...”.  As it is outlined now, there is a need of a survey to validate the success of the proposal in the end. Given the superb quality of the whole proposal overall this minor detail could be omitted. \nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_1417", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2162, "q0": "This proposal aims for an incremental increase in the efficiency of CA’s jobs through allowing them to start writing assessments earlier,  even when ideas are not completely finished. This is an excellent idea when taking into account that for instance in this funding round, over 1000 proposals have to be reviewed by at least 5 CAs during the course of one week. A massive task, and allowing for a bit of flexibility at the beginning of the assessment phase, when there are definitely a lot of the solid projects already documented well before the deadline would be great news. Even one extra day for all CAs would turn into an additional 15% more time to write all the assessments. Huge impact, great value for money overall. ", "q0r": 5, "q1": "The proposer behind the idea is a 10 years full-stack web developer and a solid technical background. As far as I can see he proposes to perform all the implementation himself and ask for community feedback in the later, testing stages of the project. I have mixed feelings about offering projects to individuals vs. teams and it would have been a very welcomed addition to the proposal had it contained more members behind it just to minimize non-delivery risks in cases of distress. But also considering the minimal budget asked for I think it is a risk worth taking. \n\nAs stated, the minimal budget basically goes towards funding developer hours charged at a 50 USD/hour rate. The budget offers a great split, down to even halves of hours for certain activities, which from my point of view brings another strong perspective that the proposal was written in good faith. \n\nNot being very technical I can only hope that other reviewers will touch upon the technical aspects of the implementation. ", "q1r": 4, "q2": "The proposer has already defined tasks above which will be auditable through the Github commits. A helicopter view of the three links provided offers me comfort that we are dealing with a meticulous and organized project but again, a more technical CA eye should perhaps shed more light on the nitty gritty details inside. \n\nIn terms of KPIs, it all comes down to old and new CAs and VCAs accepting the change. Another useful KPI, maybe out of reach of the proposer, would be to have statistics on average number of reviews by CA / VCA after each round. Potentially an increase in such a number following the proposal’s implementation would definitely be a valid argument that the proposal reached its purpose. Maybe the proposer can lobby the Catalyst community for such statistics, in an enlightened selfishness mode that will also support his own cause / project?  ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2216, "q0": "Proposal addresses a pain point of v/CA community expressed multiple times by various members and it is well aligned with campaign goals. It would increase performance of an already widely used tools and help staple them as a v/CA standards. \n\nReasoning behind each proposed improvement display hands on experience in roles of v/CA and main problems that participants in these roles face during funding rounds. ", "q0r": 5, "q1": "Detailed notes on suggested implementation give weight to ample experience provided in an attached CV. \nRequired implementation steps are broken down into clear items with expected time valuation attached, leading to easily calculable budget.\nTimetable is spaced out over 6months, giving flexibility for a working individual to complete set tasks. \nClarity of each step and budgeting display high level of competence and knowledge in similar projects, giving confidence to feasibility of the proposal. ", "q1r": 5, "q2": "Since all of the proposal is dedicated to improvements of existing tools with code on github, auditability and proof of delivery will be trivial for anyone with programming skills. However milestones for specific parts of implementation are not set and objective KPIs are missing to evaluate or measure the success of the project after its completion.", "q2r": 4, "assessor": "z_assessor_1460", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5561, "q0": "The proposer suggests a couple of really well thought out changes to the Catalyst Advisors assessment process. Instead of having only a short period of 1 week to write all assessments, the review stage would open from the beginning, as soon as proposals can be posted on Ideascale, and with the help of the already existing CA Tool, developed by the community, the CAs could write a review of a proposal, while having a sort of snapshot of the proposal text at the time of writing, and when the proposal stage ends, there will be a new snapshot that would highlight all the changes the proposer has made.\nI have been relying on a similar process for the current fund (with the help of a more complex writing software, that allows for screenshots of text and comparison), as I take a lot of time per proposal (2, sometimes even 3 hours, depending on complexity) I find the solution outstanding and I see it leading to several positive changes in the Catalyst community:\n1. Better assessments - not only do the CAs have more time in general, but by seeing the changes over the course of a couple of weeks, they gain a better understanding of the subject. Plus, by revisiting older assessments they will be able to modify them before submitting, having a fresh look over them.\n2. More assessments\n3. Time for feedback - CAs will have a lot more time and desire to leave feedback on proposals, especially considering the fact that the feedback will have sufficient time to be implemented by proposers\n4. Better proposals - by receiving more feedback from CAs, the proposers will be inspired to modify their proposals in time, before the deadline.\nConsidering all the arguments made above, I highly consider this proposal as having a positive impact upon the Catalyst ecosystem.", "q0r": 5, "q1": "The timeline and plan description are very well documented, from the organising of the text and all the details offered, one can see that the proposer is indeed a developer, who is passionate about Project Catalyst and has given a lot of thought into improving this vital part of the process.\nThe budget is very well detailed, he has offered many details with number of hours attached and price.\nHe has described his skills and has attached a comprehensive CV with all the information one might need to evaluate the potential of successful implementation of this proposal.", "q1r": 5, "q2": "For progress development, the proposer has provided GitHub links, that are a very good way for the community to self assess the advancement of the project.\nThe success description is also detailed and very realistic. I see no need for any additional information.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6293, "q0": "The proposal seems to be tackling the right problem using the wrong means. It is bringing a solution that does not give more time to CAs; as it actually forces them to come back to review every own draft assessment to check if they are still compatible with the new updates made in the proposal.\nIn addition, the feedbacks during the ideation phase are welcome, but they are already achievable using current tools.", "q0r": 3, "q1": "The budget is reasonable for the amount of hours to be spent in the project. \nThe proposer gave the information that he/she is an experienced developer, but has participated in Catalyst since only the last fund. More experience in the process of assessment would help to develop a more robust solution to the problem of short-time. \n", "q1r": 3, "q2": "The deliverables were listed and are auditable by the community, and there's a roadmap for the proposal. Its success can be also verified, in case of funding. However, the solution could be better tailored to the problem of short time, and consider alternatives (such as extending the time designed for the assessment phase; or any other cheaper and easier alternative). ", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7739, "q0": "As a CA, I personally like this idea to address the lack of time writing CA assessments. The proposer has compiled and is ready to upgrade existing CA and vCA tools, which is very impressive! Even the proposer discusses the possible risks. It would be perfect if this improved tool could notify the CA when the proposer edits the proposal. So that the CA assessment can be kept up to date.", "q0r": 5, "q1": "The proposer clearly wants to upgrade an existing CA Tool (created & maintained by AIM Stake Pool) which is not a member of AIM. And the proposer said that he would do it himself (+consultation with the developer). Since proposer is trying to improve existing CA tools, I suggest proposer can work with AIM. Also about the budget, I think it's reasonable to give $50 hourly rate, since US Fullstack Web Developer rate is in $40 - $53 range (based on Salary.com)", "q1r": 4, "q2": "Proposal is well-written. The information provided in this proposal is certainly sufficient to audit the progress. Key metrics, goals and success criteria are easily reach and evaluated by community.", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Allow CAs to start writing assessments earlier. Even when ideas are not completely finished. As ideas are getting refined so can assessments", "experience": "I was a proposer and a CA in F7.\n\nI have 10 years of professional experience in full-stack web development."}