{"id": 414304, "author": "pace", "title": "Governance & Identity", "url": "https://cardano.ideascale.com/a/dtd/414304-48088", "category": 26604, "amount": 2000000, "description": "What tools, processes and research will improve how we integrate governance or identity solutions both in Catalyst and the wider Cardano ecosystem?", "f6_no_assessments": 15, "f6_rating": 4.71111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 3350, "q0": "Based on the information provided in this challenge setting proposal, I think that it fulfills all four of the strategic goals for fund 9. It addresses the first strategic goal (prepare a group of people who will contribute to the Cardano ecosystem) by providing the guidance and framework for people to build their ideas and solutions to governance and identity on the Cardano blockchain. The proposers listed 11 types of proposals that could fit under this challenge setting. For example, governance tools & software, identity tools and software, and governance research. All of these ideas can help future proposers when they try to come up with their own proposals to address these focus areas. The people who propose under this challenge setting will be even more prepared because there are some recommendations at the bottom of the proposal, which say that development libraries should be open source, commercial products should fall under the products and integrations challenge setting, and governance experiments should all be inclusive of all people around the world. If I were a proposer in this challenge setting, I would have all I need to make my own proposal because it is so clear what is expected of me.\n\nThe challenge setting addresses the second strategic goal (build an open-source ecosystem and attract developers) through the few focus areas that are centered around governance tool software, DAO tool software, and identity tool software. These three areas require huge amounts of development, so developers who are passionate about governance can have the place for their proposals. Having this challenge setting is a good idea because it shows developers who have knowledge on identity solutions that there is a challenge setting for them. Also, the challenge setting has a recommendation at the bottom that states that proposers should make their projects open-source at the earliest time possible. \n\nThe challenge setting addresses the third strategic goal (build real-world solutions on the Cardano blockchain) through the focus areas that the proposers hope to address. All of the areas are about governance and improving Catalyst for the future. Catalyst has the capabilities to change lives and bring the world together. Many projects funded through Catalyst have the potential to impact people’s lives in the real world, whether it be through DeFi DApps or through identity solutions. As a result, improving Catalyst and its ability to efficiently distribute treasury funds to these kinds of proposals will eventually have a greater impact on society. Additionally, some of the solutions developed to address governance could also address other issues. I am specifically referring to the DID or SSI that could be developed as a result of this challenge setting. While originally intended for governance use, it could be applied to other areas that have more tangible real-world impact, like healthcare and education. \n\nThe challenge setting addresses the fourth strategic goal (improve tooling to support human processes in Catalyst) simply through the scope of the challenge setting. The entire purpose of this challenge setting is to improve Catalyst and study new ways of streamlining the process or trying out new ideas. Thus, this challenge setting has infinite capability to improve the tools that support the human processes of Catalyst. New governance tools/software, DAO tools/software, and identity tools/software, can have an immeasurable impact on how real humans interact with Catalyst. The research that will be conducted under this challenge setting will also be impactful because it can inform future developments that fix some of the current issues in Catalyst, such as incentivization and rapid funding mechanisms. Since I have no complaints about any aspect of alignment, I can give this challenge setting a score of 5. (score given: 5)\n", "q0r": 5, "q1": "Based on my knowledge of Catalyst and the Cardano ecosystem, I can say that the Cardano community has the capabilities to address this challenge. In the past, there have been some challenge settings that had ideas that are encompassed by this challenge setting, such as rapid funding mechanisms (fund 7) and community advisor improvements (fund 8). These challenge settings had a combined 43 proposals submitted. While this may seem like a small number, it is important to factor in how much of a wider scope this challenge setting has. There are also the opportunities for DAOs, researchers, and local/global communities to receive funding for their ideas. Governance has not been as big of a focus in the past, but it should be prioritized moving forward because there is such a huge need for improved systems. I already know of developers who have worked on improvements for Catalyst processes, such as the AIM group, so it is these people and others like them who will jump at the opportunity this challenge setting presents. \n\nThe budget for this challenge setting seems reasonable given the large scope of the challenge setting. 2 million ADA is a huge number that can fund a wide variety of proposals. It makes sense to have a budget this big because governance needs to be one of the next big priorities for Catalyst. I imagine some of the projects proposed will require a lot of time and money, so having a big challenge setting budget can support those big projects as they work towards an improved system. Since I did not have any issues about feasibility, I can give this challenge setting a score of 5. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided, the challenge setting is well defined in the metrics of success for its focus areas. The proposers listed some very thorough KPIs/metrics of success that proposers can use when they create their proposals for every one of the 11 focus areas. For example, for governance tools and software, the metrics of success include the amount of adoption from other projects and improvement metrics from any adoption in Catalyst. The second metric is specifically broad in its wording, allowing for future proposers to tailor the metrics of success to their own proposal because every proposal is different. Other metrics were included, such as number of citations for governance research and number of participants for governance experiments or education. I think that all of these metrics of success are very well-picked for the challenge setting because they can also facilitate healthy competition between proposals. If proposals are able to work within the flexible guidelines provided in the challenge setting, then they can find ways to compete with each other to become the best proposals possible. A little healthy competition benefits all proposers, so they will all strive to make the most thorough proposals possible. I did not have any complaints with the verifiability of this proposal, so I can give it a score of 5. (score given: 5)", "q2r": 5, "assessor": "z_assessor_2457", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 131, "q0": "One of Cardano's biggest differences from the vast majority of blockchains is the governance layer conceptualized since the project's inception. The existence of a governance layer brings benefits, such as making upgrades and updates more democratic through voting and the existence of a community-managed treasury that can leverage blockchain development, something we are already seeing happen through project Catalyst, however these positive characteristics also bring the need for governance management and this goes through several processes, which are mentioned in the description of this challenge setting as potential directions (types of proposals).\n\nThe fifth and final step in Cardano's development roadmap is Voltaire and it's all about governance. Catalyst itself is an incentivized testnet from Voltaire that has been under development for about two years and it is extremely important that Catalyst has part of its budget allocated to improvements in the governance layer as the entire process depends on organized, distributed and efficient governance. .\n\nThis challenge is in line with all four items established in the Catalyst Fund9 Challenge Setting Strategic Goals that can be verified in the Proposal Assessor Guide, which makes even more evident the importance of the topic in Cardano's mission at this time.", "q0r": 5, "q1": "I have participated in Catalyst as a CA since Fund2 and I have followed the development of numerous tools and improvements for Catalyst since Fund2. I also participated in some processes to improve Catalyst as well, but I won't go into details to avoid doxxing myself. The point is that during this period I saw the development of multiple solutions, mainly related to governance, which have already caused great improvements in Catalyst, this does not mean that the work is close to being considered concluded, because governance is a wicked problem and we are navigating in uncharted territories.\n\nAlthough this challenge has never been funded before, it was proposed in the previous Fund (F8), received an overall score of 4.67, below only six other challenge settings, in a universe of 75 challenges proposed. The Challenge Setting Governance & Identity was approved at the voting stage and ranked 15th among the 75 challenge settings in Fund 8.\n\nAlthough the challenge was not funded, we can observe challenges related to it in Fund 9 (current) and in previous Funds. The following challenges were present in Catalyst and are an indicator that there is a demand for the development of solutions in governance and identity\n\nDAOs <3 Cardano (F9, F7), Accelerate Decentralized Identity(F8), Improve and Grow Auditability(F8, F7, F6), Self-Sovereign Identity(F8), Community Advisor Improvements(F8), Catalyst - Rapid Funding Mechanisms( F7), Distributed Decision Making(F6, F5, F4), Atala PRISM DID Mass-Scale Adoption (F6).\n\nAll the challenges mentioned above resulted in hundreds of proposals that created solutions and improvements to Catalyst, as can be seen in the work developed by groups such as LIDO, PACE, QA-DAO, SWARM, AIM, Catalyst Circle, among others.\n\nThe budget definition of this challenge went through the Funding Categories discussion and voting process and the resulting budget was obtained through the vote of about 50 participants, something that helps to indicate the potential demand for the theme by community members. Due to the broader scope of this challenge compared to the ones I mentioned above, I believe the larger budget is appropriate.", "q1r": 5, "q2": "The definition of success and key metrics chosen allow identifying the outcome of the challenge in relation to the quality and quantity of solutions created for improvements in governance and identity, but it would be important to establish time horizons for the definition of success and key metrics, in order to make easier to identify the delivery of proposals over time and whether this is in line with the objective of the challenge setting.\n\nSeveral success metrics were included in the proposed subcategories. Considering the range of work that has already been developed by the community in relation to governance and identity, I believe that the success metrics established in these subcategories satisfactorily capture the performance of the proposals (the only caveat, as mentioned above, is to add temporal elements in the metrics)", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 598, "q0": "This goal of this challenge setting proposal is to allow the submission of proposals related to governance and identity, as suggested by its title. The scope is not limited to Catalyst only, but the wider Cardano community, and any solution that’s related to identity of governance could be submitted here. This allows the submission of proposals that somehow use or address DID/SSI related topics, DAOs and governance in general. It is a very broad scope that can accommodate a large number and range or proposals. There are some areas mentioned in the challenge brief that could be covered by proposals, like tools for governance in general, for DAOs, identity, auditing and more. Since the scope is so board, it allows the submission of proposals related to almost all Cardano’s goals for Fund 10, and more specifically to building real-world solutions based on Cardano, and possibly improving the tooling to support human process in Catalyst, as explicitly mentioned in the challenge brief. Additionally, the challenge brief suggests that all developments should try to open source their tooling. Although, it is not a requirement that the proposals must be aligned with these goals. Therefore, I believe that the alignment of this challenge with Cardano’s mission is good.", "q0r": 4, "q1": "The budget requested for this challenge proposal is 2M ADA. This is a fairly large request, and the actual budget might be approximately $1M if ADA price doesn’t change much until the results are tallied. It is still a large request, but since this is quite open challenge, it can fit many different proposals that are historically submitted in other challenges. For example, all proposals that have been submitted in the Atala PRISM and SSI/DID challenges could be submitted here, also the ones in the DAO challenges, and even other that were submitted in DApps & Integrations, for example. Considering this, the budget seems to be appropriate. Also, the community has the necessary knowledge to address this challenge and submit enough high-quality proposals to use the whole budget and execute their projects. This can be checked by the track recorded of the challenges mentioned, related to DAOs and SSI/DIDs, and the proposals that were funded in other challenge but are related to this challenge’s goal. I don’t see any big risk related to this challenge proposal, and overall, I believe it is very feasible.", "q1r": 5, "q2": "The KPIs presented to track the success of this challenge are good and I believe the cover the most important points to be analyzed here. Some of them, like ‘Increasing the quality and diversity of community voices…’, might not be so easy to track and would lead to a more subjective evaluation. This is something that I have verified in many of the different proposals submitted by PACE in this Funding Categories concept. It would be good to add some KPIs that are specific to the different areas mentioned in the challenge brief, but not to limit it to them, for example, proposals related to DAOs, auditing, research, and tools. There would provide more insight to the community about what is being focused and what is not being address collectively and provide directions for future proposers. Although, these are KPIs that could be added on top of what was already proposed, and based on what’s been proposed only, I believe the verifiability of this challenge proposal is good.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 20, "ne": 4, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 669, "q0": "I strongly agree that this challenge is critical to achieve Cardano’s mission. One of the biggest challenges the blockchain industry promises to solve is Governance and decentralized identity. However, like Charles Hoskinson said, Governance is perhaps one of the hardest problems to solve. \n\nAs we are progressing fund by fund we are also seeing the rising need of  tools and software for governance, DAO and identity in Project catalyst. With every round comes more proposals and more members are onboarded, the statistics and data analytics from previous rounds plays a crucial role in further improving and automating certain parts of the catalyst process. \n\nTherefore, this challenge/fund category would need a lot of attention from the community to keep up to the pace of Cardano’s adoption, and tools specific to Governance, Identity, along with Rapid funding mechanisms are of utmost importance to ever growing challenge within Cardano ecosystem.\n", "q0r": 5, "q1": "I strongly agree that the catalyst community has the capacity to address this challenge. For instance, There have been a lot of ideas ( about potential improvements in current processes such as CA/vCA rewards calculation, filtering out bots, improving quality and improved and early community involvement for proposals, rapid funding measures for important proposals etc.) circulating around in the Project catalyst, CA, vCA channels in telegram and discord server. Community members are meeting to resolve many issues that the current process has but we are limited by the manual process or funding measures that we have for many of such steps within Catalyst. \n\nAdditionally, governance and identity tools and software that can be successfully applied within Cardano ecosystem, can then become a benchmark for the wide scale adoption for Nation states OR states governments. However, this trust can only be gained when we already have a successful implementation gained within experiments such as Project Catalyst. As a community member myself for over 4 years now, I am quite confident that we can bring a lot of positive changes and provide many solutions to the Identity and Governance domain via the Cardano ecosystem.\n", "q1r": 5, "q2": "I strongly agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. The potential success metrics are listed down for each proposal type, which is one of the positive impacts of the funding category as compared to Challenge settings method. This will allow proposers to save both time and effort finding right key metrics and success metrics for their proposals and if it is a fit for this challenge setting.\n\nAdditionally, Key metrics to measure align with the types of proposals and provide a comprehensive list that is not only limited to tools and software but also leaves a lot of room for research and experiments specific to identity and  governance, such as increasing the quality and diversity of community voices to be better shared and heard. \n", "q2r": 5, "assessor": "z_assessor_2114", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 844, "q0": "The PACE team is back with their proposal that focuses on how we move strategically around what we know as Project Catalyst. Being a member of this community for over a year, this represents a natural evolution, which is why it resonates so much with me. PACE intends to establish some sort of a set of umbrella categories that encapsulate different challenges that we have had in the past. The way categories were defined is intended to minimize opportunities for overlap between challenges, but also to provide adequate descriptions for future proposers to comprehend the boundaries within each category. This particular challenge aims to establish a category that encapsulates the topics of Decentralized Identity (SSI) and Governance. As regards SSI, it is clear that current identity models are dependent on centralized data repositories, which have on numerous occasions led to data breaches, which have caused the loss, manipulation, and manipulation of personal data, as well as incalculable financial costs, especially to end users. Secondly, we have the governance issue, which I personally view as the most difficult roadblock for any blockchain that aims to be truly decentralized. In the past we have seen famous hardforks in the top two blockchain L1s today, and recently we witnessed an embarrassing event associated with a Lend and Borrow protocol in another L1 that is in the Top10. All these bad examples are arguments that we give as an industry to governments that, subsequently, introduce meaningless, overly restrictive regulations which adversely affect the industry. It is therefore more than obvious that this type of challenge is more than necessary in Catalyst and are aligned with Cardano's mission.", "q0r": 5, "q1": "Despite the fact that this challenge was not selected to be included in the current fund, the topics of Governance and Self-Sovereign Identity have been included in past funds as both standalone proposals and challenge settings. Consequently, I can infer that we have responded both directly and indirectly to the purpose of this challenge. As for Self-Sovereign Identity, we have had several challenges in previous funds, which resulted in the allocation of funds to more than 50 proposals, as well as proposals such as \"Community Governance Oversight\", which have provided significant value to the community. The PACE team held a series of events to discuss the rationale behind the overall proposal. In addition, they opened the voting process for deciding the percentage weight of the budget for the 7 categories that comprise the PACE proposal.", "q1r": 5, "q2": "Because PACE's proposal is intended to represent a wide range of activities, they decided to propose a couple of examples of metrics according to the type of the expected project, since it can have very specific and diverse objectives. I would suggest to the team that, in order to make improvements for future catalyst cycles, they should include information regarding the method of communicating the progress of the projects to the community as part of the considerations for the proposers. Additionally, it would be useful to know in clear terms how this new approach will be evaluated. As a result, I would recommend to the challenge team that they also consider defining metrics to measure the success of this approach as well as the return on intent.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"id": 1003, "q0": "PACE has filed a list of challenge setting proposals that span 100% of the treasury provisioned for Fund10 as opposed to 70% in Fund9, along with one general proposal. Each one of those is a combination of challenges that existed in previous funding rounds to cover as much of the ecosystem needs as possible. This one in particular focusses on the governance and identity aspects of Cardano development. \nIt aligns with Cardano's mission as all these previous challenges were deemed mission critical for Cardano in past and current funds. The proposal is relevant in a sence that identity solutions for the Cardano blockchain are applicable to Atala PRISM and the first logical application for this decentralized identity Dapp would be governments. Due to the combined nature of this challenge setting proposal, it is not limited to just the Atala PRISM protocol. There is also an open source encouragement included in the proposal, which is a direct strategic goal for Fund10. \n", "q0r": 5, "q1": "Since Fund9, PACE has constructed the concept of ‘Funding Categories’, which determines the budgetary allocation for each proposed challenge to be executed in Fund10, if approved by the voters. This system of funding categories is based on realizing an increase in efficiency along with a decrease in overall process cost, as explained in the documentation that is linked in the proposal. The requested funding amount for this challenge setting proposal has been defined at 15.63% of the total Fund, by a budget weighting process under the form of a voting session, presumably containing 56 community members. Voters will have to decide wether this is an adequate amount to represent the community. Therefore I agree with the feasibility of this challenge setting proposal. ", "q1r": 4, "q2": "Well described challenge setting proposal with a clear and detailed challenge brief. Success metrics are set with a focus on tool development, which could generate a variety of rapid-deployable tools. In the proposal's linked documentation, under the ‘Categories & Previous Categorisations’ tab, there are quite a lot of previous challenges that repeat in different proposed categories. Due to this overlap, when a proposer wants to resubmit a proposal from one of those previous challenges, it could be unclear where to go exactly. \nIn addition, the link containing information on cost reduction, although still accessible through the website, is not working. Fixing this would improve this challenge setting proposal. ", "q2r": 4, "assessor": "z_assessor_2180", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 1883, "q0": "This challenge is about enhancing, sustaining, and preserving the governance status of the Cardano ecosystem, and it focuses on governance and identity. Think about all the Grow..., Grow Cardano, Disarm Cyber Disinformation Attacks, Catalyst Value Onboarding, and Atala PRISM Mass-scale Adoption challenge settings that we previously had in earlier funding. This proposal groups all the previously mentioned challenge settings we've had in previous funds into one. This is what PACE wants to develop, a better-structured system where we have transparency and guidance so proposers don't need to start from scratch each fund. This challenge will surely bring contributors to the Cardano ecosystem and help them build real-world solutions.", "q0r": 5, "q1": "As a CA, we are required to consider each suggestion in isolation, but given the extent of the challenge settings PACE has suggested, we need also to take a broader view of this. Due to the scale of their improvement, PACE prefers to refer to challenge settings as Categories, which is a better name for this. By widening the challenge, making it simpler and easier to follow up within different funds, you create global categories which benefit the proposers. \nWe are certain that the community can address this category when we consider the information offered in the GitBook about what challenge settings from previous funding rounds are included in this category.", "q1r": 5, "q2": "We receive more than enough information in the proposal to evaluate this concept. You can tell by the way the proposal's success is articulated that PACE has a broad perspective on Cardano and Catalyst.\nIt complies exactly with the category question. Every detail is included, even the key metrics. There is nothing in this proposal that is lacking, in my opinion. PACE's proposal is carefully thought out and well written. Well done.", "q2r": 5, "assessor": "z_assessor_2285", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 2724, "q0": "The proposal is comprehensive Governance & Identity category challenge setting, trying to encompass all projects which benefit the Cardano ecosystem involving Digital Identities (DIDs), Governance, and tools for DIDs, governance, audits, etc.\nWhile this is important, and it is perhaps a good idea to introduce more static category challenge settings, it is not aligned with the strategic goals for fund 10 challenge setting.\nIOG and the community has decided to focus on 4 strategic goals for the coming fund 10.\n\n1) Prepare a group of people willing and able to make contributions to the ecosystem.\n\n2) Turn Cardano into an open source project & attract more developers.\n\n3) Build real-world solutions based on the Cardano blockchain. \n\n4) Improve tooling to support human processes in Catalyst. \n\nWhile it could be argued that the challenge proposal is implicitly aligned with goal 4, it is not focused on that, so it is not certain that proposals would target that part of the scope. Thus, while I think it is a good proposal, it is not aligned with the strategic goals of THIS fund.\n", "q0r": 2, "q1": "The proposed challenge setting is very broad so many different proposals and solutions can be accomodated. The Catalyst community has built governance and identity solutions to proposals in all recent funds, so there is capacity in the community. When PRISM is live it will greatly improve the way we can use Cardano DIDs and thus also create more solutions. So while the community will be able to create solutions now, it will be even better once Atala Prism is live and working.", "q1r": 4, "q2": "The challenge proposal is very broad, so it does contain ideas for measurements, but no clear, timeboxed, quantifiable and independently verifiable metrics, but that is to be expected with such a broad challenge. When the ecosystem has matured more, and there are reference implementations, baselines and best practices, clearer metrics could be formulated, even for broad challenge categories, like this proposal.", "q2r": 3, "assessor": "z_assessor_2351", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3253, "q0": "With the Voltaire era underway for Cardano, this Governance and Identity challenge is well scoped, well defined, and utterly timely.  It may not always be the case that such funding will be necessary for Project Catalyst to fund (self-funding of many protocols will be desired, and for critical infrastructure, CIPs will be able to parameterize those outlays) but in the here and now we need robust experiments, sharing of data and decision models, internal collaboration around the regulatory mechanisms of Catalyst and Cardano.\n\nFor mission statements 1 and 4 in particular, this category has extreme relevance, preparing people for the responsibilities of contributing to the ecosystem (charles recent roadmap whiteboard pointed this out specifically with the iterative pivot from the tripartate founders model to a members organization), as well as designing human centered processes and tools, lest we forget that under all the technology, under all the politics, there is the very real need to provide people with the tools, space and liberty to realize their own sovereign collaborative agency.  We need to be able to participate in our own self-governance.\n\nBecause Governance is one of the hottest subjects in Cardano, and because Identity is one of the most important tools in realizing the promise of Cardano's protocols for self-governance, this Category proposal deserves a full 5 stars for Alignment.", "q0r": 5, "q1": "As described here, this proposal gives proposers multiple ways to address Fund goals.  Approaches are provided from inside and outside the ecosystem, for builder and members, for finished products targeted at clear needs and experiments targeted at future knowledge.  The broad inclusivity here is among the best in this Category experiment from Pace, as well as among all challenges generally.  This may be due to the fact that this proposal absorbed another community proposal around governance, so it shares multiple perspectives, or it may be just that these topics (governance and identity) are so hot that many have had their share of input.\n\nEither way, the category is receiving plenty of support.  Part of this experiment is for a community vote to actually set the budget among the 7 categories in the experiment, so for this one to be behind only the $3m Products and Integrations $2mil Developer Infrastructure categories is saying something.  Outside of continuing to build, the community wants to start sheparding this project into its own hands.\n\nBecause the budget was sourced from the community and seems reasonable given the expected impact, and because the proposal is well laid out with plenty of guidance for proposers to access the mission statements through it, I feel this category rates a full 5 stars for Feasibility.", "q1r": 5, "q2": "Among the lists of possible access points for proposers to this category, there are also a significant number of metrics provided for measuring progress.  Whether these also help measure success and alignment with the mission statements is a bit less clear.\n\nFor governance in particular, there was no mention of risk, which is part of the fundamental purpose of all governance related decisions and action.  The goal is to reduce and manage risk (which can never be zero) so that people can choose to participate in meaningful ways.  This proposal should include broad metrics to help proposers under its umbrella think about risk and how their projects account for it, categorize it, mitigate it and manage what risk they cannot mitigate.  Examples would include accounting for probabilities of failure, sources of volatility and reduction of these, correctly sequestering value at risk so that governance models to not regulate where they are not needed, etc.  It is through measuring risk and its affects on participation that we are able to gauge the effectiveness and suitability of our governance tools.\n\nBecause the deeper needs of verifying outcomes and ROI are not present, I am docking 1 star, however there is a lot of solid data present across many use cases in order to build out better metrics, so I feel that at the end of the day this category will be able to support most of its proposers in clarifying success for their project.  4 stars for verifiability.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3324, "q0": "This is challenge is part of the “Funding categories” approach to challenge setting, a community-initiated reform to challenge setting championed by PACE group. This new approach proposes that each fund will contain only 7 categories. In contrast to the current model, these are recurring (no need to propose in each round), exhaustive (all proposals have an appropriate challenge to submit in) and non-overlapping (one proposal fits only in one challenge). It also reduces the challenge involved in justifying budget sizes and instead replace that with a more democratic budget setting mechanism.\n\nThis particular challenge focuses on governance. This includes everything from internal governance processes and support structure (Catalyst/Cardano), to general DAO tooling and rapid funding mechanisms. It is very much aligned with the strategic goals as it directly relates to both adding contributors, but also improvements in decision-making processes. Governance itself is tightly related to open-sourcing in the sense that any open source protocol must be able to govern itself in a decentralised manner, a problem that is not as challenging for centralised protocols. Developers who are excited about governance and voting are thus naturally drawn to the Cardano ecosystem if they are able to get funding. They also ask proposers to be open-sourced which means alignment is very strong in every dimension. ", "q0r": 5, "q1": "The Cardano community has already shown a strong interest in governance as illustrated by ADAGOV and other community-initiated groups like the Governance oversight group from fund 8, and Catalyst groups such as AIM and PACE. There are also a number of DAO tooling projects that may require further investment, e.g. DAO-NET from fund 7. ", "q1r": 5, "q2": "A number of metrics are proposed. These include number and quality of tools, SDKs, libraries available for governance purposes; decision-making capabilities; rapid funding pipelines; and number of governance experiments (to mention a few). These are all good suggestions. One possible weakness with this is that they are very broad and cover a lot of areas but it also means it is harder to evaluate due to there being many ways to succeed. ", "q2r": 5, "assessor": "z_assessor_2447", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3777, "q0": "Cardano must not and cannot fail where Bitcoin and Ethereum failed, which is governance. This success in implementing sufficiently decentralized and functioning governance with proper check and balance will be the ultimate factor deciding if Cardano can be the blockchain we always envision it to be and revolutionize the world into being a better place. To be always advancing towards betterment and adapting with relevance, a social community will always need to establish a stable and efficient governance scaling into millions of stakeholders and users. This challenge or category is in sync with the goals Cardano wants to strategically make in preparing a group of interested and brilliant people to contribute to Cardano ecosystem, impacting real world with blockchain-based solution, and improving the utilities that enable easier and more efficient human works in Catalyst. Many excellent minds in blockchain and cryptocurrency is predicting that governance related utilization and application such as DAO will be the next big thing and main driver of broader, higher, and more sophisticated adoption of this technology both by general population and by large and established institutions.\nIn order to achieve a fair, transparent, and honest governance, we will need to have an immutable, self-sovereign, and decentralized identification system. This identification system with such quality is vital and compulsory to unlock all essential implementation and benefits in an effective, robust, and thriving governance. Cardano already made a step ahead with Atala PRISM and a vast number of proposals wanting to deliver solutions and build on top of such topic can be supported through the maintenance and development of this challenge or category.", "q0r": 5, "q1": "This challenge is a more holistic and umbrella category (as described in Funding Categorisation framework model initiated by PACE) for many challenges we Catalyst had already done in previous funds: DAO <3 Cardano, Accelerate Decentralized Identity, Atala Prism Mass-scale Adoption to name a few. PACE, as the proposer himself, is already doing quite an extensive study in effort to improve, scale, and optimize processes and results in Catalyst. The individuals involved in these previous challenges can bring their expertise and capabilities to regulate and manage this challenge promptly. I am not afraid of the quality and quantity of proposals participating in this challenge or category since this topic will be very much relevant in the immediate future, proven by the existence, growth, and improvement of Catalyst itself over time.\nWhen all the brightest minds among us brainstormed, settled their differences, and worked harmoniously towards a grand, common goal, I believe we can elevate the Cardano community to a higher state. We need all of them and us to collaborate more than ever now to deliver Cardano into the ideal of the Voltaire era.", "q1r": 5, "q2": "The metrics and criteria to track and verify the success of this challenge or category in general and proposals specifically are detailed extensively and accurately. If I may add, maybe we can include quantifiable KPIs such as github repos benefitting from and utilizing tools, libraries, SDKs, and other resources created and developed from the proposals and solutions originated from this challenge. This way the Cardano community will have more help to determine the investment return this challenge or category and its proposals generated. Overall, I can sense that the proposer has a deep and far insight into Cardano and Catalyst growth and development future. The encouragement of results and solutions delivered by proposals from this category challenge to be open-sourced and governance experiments to be open, participatory, welcoming, and diverse will also assisting and valuable in maintaining the verifiability, accountability, and auditability of the processes integrated in this challenge category.", "q2r": 4, "assessor": "z_assessor_2482", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4815, "q0": "This challenge is clearly aligned with the overall objective of Cardano, it gives a great opportunity for the community to find or create new tools that can improve the integration of Governance and Identities in the Cardano ecosystem. This challenge is also aligned with the four fund 9 strategic goals, mostly the one that aims to create or bring some tools to support the community. This challenge proposer called Pace is proposing a few challenges that are compacting different problematics which makes it simpler to organize and can lead to more complete proposals.", "q0r": 5, "q1": "The feasibility of this challenge is really positive, there is a lot of opportunity for the community to participate to this challenge since, as said before, it is a challenge grouping different problematics, which makes it easier for the community to find an idea according to this challenge. Moreover, the budget of the proposal is realistic, I really appreciate the fact that the budget has been voted by the community as a percentage of the total budget, it is representative of the community’s needs.", "q1r": 5, "q2": "The success metrics are on the spot and are really beneficial for Cardano and its community. They are really precise and are following the challenge needs as well as the overall objective of Cardano. The KPIs are pretty complete knowing that there are a few different problematics. This challenge also drives to a healthy competition between the proposers and can maybe help to obtain collaboration between the different proposers.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6301, "q0": "This challenge concerns developing tools, processes, and resources to integrate governance and identity solutions in Catalyst and the broader Cardano ecosystem. As stated by the author, there is a need for effective governance & identity tools to maximize the Catalyst potential. Achieving this will create a thriving community and a better development ecosystem. The governance tools & resources are required not only for Catalyst but also for other DApps & platforms on Cardano, such as Decentralized Exchanges (DEXs). Also, they can be utilized by sidechains or other chains upon their successful implementation in the Cardano space. The Identity tools also have a broader use case beyond Catalyst and outside the Cardano ecosystem. In addition, In Governance platforms such as DAOs, Decentralized Identifiers (DIDs) can play an essential role in decision-making and voting. Given the above facts, this challenge category is crucial and will add value to the Cardano ecosystem. On a side note, this challenge is submitted as a Challenge category as the author proposed to change the challenge setting process to the 'challenge category.'\n\nThis challenge will help achieve the strategic goals as it supports people/groups who want to develop governance & identity solutions and contribute to the Cardano ecosystem. Furthermore, these solutions will likely be open-source to make this work available for other projects to use & build their applications. Therefore with the help of better Catalyst governance and provision for these governance & identity solutions to other projects, this challenge will accelerate the growth of Cardano's developer & DApps ecosystem.\n\nFrom the perspective of the guiding questions, this challenge's proposals likely attract a good number of votes based on the past funds' results and being a hot subject. Moreover, this challenge will accelerate Cardano's adoption because of the above points. Hence this challenge is vital for Cardano's mission. ", "q0r": 5, "q1": "In Fund 8, DIDs challenges saw sixty-six proposals, out of which twenty-four were funded. The Catalyst improvement & Auditability challenges also seen sufficient participation from the community. This engagement shows the community's capability and willingness to address this challenge.\n\nThe requested budget of 2 million is appropriate as this challenge category covers a wide range of problems such as Governance tools, DAO tools, Identity Solutions, Catalyst-related solutions, Auditing tools & solutions, etc. \n\nThe author did not provide any details on the challenge team. But since we had similar challenges in the past funding rounds, the community members who supervise those challenges can head this challenge team, too, if it is selected. ", "q1r": 5, "q2": "The author mentions the potential directions for the proposals under this challenge; this is not exclusive. Then various metrics are stated based on the possible directions to measure the proposals' success. I suggest the author include the metrics to measure the progress of the proposals while under execution. For example, if the proposals are developmental, the metrics can be the number of GitHub commits or milestones achievements. Anyhow, I am rating it five stars as the author does provide the possible directions which can be considered to ascertain the metrics. \n \nIn the initial sections, the author mentioned some metrics which are helpful to ascertain the success of the challenge. As stated by the author, this challenge's success will be 'the evolution of governance & identity tools, processes, and resources to improve Catalyst and other DApps on Cardano.' From the progress of various projects on Cardano, it seems we are already in the process of achieving this goal, and this challenge will accelerate it.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6650, "q0": "PACE is a community led project that aims to redefine the funding challenges. In essence, they ask for the entire funding available in F10, and offer a unique distribution along several categories which have been previously selected by the community through a complex mechanism, culminating with an open vote for whomever wanted to take part. Any voter entirely supporting their approach should thus vote for the encompassing “Funding Categories Full Fund”. If, however, one feels that the approach goes a bit too far, this proposal is simply one piece of PACE’s puzzle. \n\nThis fresh alternative to the classical challenge setting process overcomes many downsides (low entry barriers for malicious actors, unilateral budget weighting, limited understanding of challenge teams, suboptimal time consumption, etc.) and aims to be more efficient, flexible, scalable as well as legitimate. Let’s see if it also has the capacity to deliver on of the strategic goals from Fund 9. \n\nCan it help prepare a group of people willing and able to make contributions to the ecosystem? There is great potential here, and in more than one way. The beauty is that, unlike other challenges where economic value exchanges hands in a very traditional way, in payment versus service or product delivered, this challenge encompasses governance, collaboration and mentorships topics, and it has a tremendous capacity of catalyzing groups of people whose actions will be driven by motives other than that to derive economic rents: the need for belonging, the need to be heard, the need to move away from systems that disenfranchise its participants by removing them from power systems. This challenge can attract people passionate about new models of governance (dreps, mentors), or those seeking the thrills of truth finding (auditors, perhaps some form of journalism or investigative activities) or generally those looking for a group of likeminded persons (DAOs). \n\nCan it turn Cardano into an open source project and attract developers? Yes, because the challenge encourages projects to either be open source or at least include details on their plans towards open sourcing the project. As a bonus, the challenge can also foster increased openness around the way we collaborate, and increase the level of experimentation with new models for working. Such projects have already appeared in Catalyst (littlefish for instance) and it is likely that similar projects will only increase in numbers in the near future, especially if the challenge is voted for.\n\nCan it help build real-world solutions based on the Cardano? Yes it can, and in more than one way. Experimenting with governance mechanism has a great potential to unlock many more doors down the road, since governance models are needed in all area of life: politics, businesses, NGOs, and there can be a myriad of types of applications possible within the space that can be of value is so many real world domains: voting systems, identity solutions, funding mechanisms, wealth distribution, social connections, ect. Experimenting with governance has probably the best chances of discovering “white swan” projects with excellent growth potential.  \n \nCan this challenge improve tooling to support human processes in Catalyst? Yes, to the greatest extent possible. Catalyst being a tool that tries to allocate capital as efficiently as possible, it has governance and social interactions at its core, and there is great potential that future proposals within this area touch upon these aspects. If there were perhaps one overarching wish common to every Catalyst contributor, it would be that of changing the inner workings of Catalyst according to his/her own wishes. Starting from this, it only takes one extra step to realize that there will be a significant supply of proposals touching upon this topic and trying to bring changes to the processes behind Catalyst, ranging from incremental ones (tools to increase efficiency) to radical ones (changing the system from the ground up). ", "q0r": 5, "q1": "Does the Cardano community have the capacity to address this challenge? Its capacity to address this challenge is undeniable. The strongest argument is the fact that Catalyst has already been running for quite some rounds, the last two of which being fully-fledged in terms of overall budget, and we have seen a consistent, and increasing, number of teams and proposals sprouting within it, across all previous challenges. Going one step further, this challenge will attract several types of proposals that are currently scattered around many areas: DAO tools from the respective challenge, identity tools spread across dapps and infrastructure challenges, and governance research probably everywhere. \n\nIs the budget realistic and reflecting the requirements of the challenge? In this case, the budget has been established following a vote open to all community members, secured by a few gatekeepers that anonymised voters identity and the vote itself, thus ensuring a high level of trust as well as legitimacy. And the results of this vote have been transposed into the budgetary splits present in the challenge. Are the amounts realistic? The answer to this will definitely be clear post-factum, if we notice enough implementation capacity from the community in terms of sufficient projects, sufficient competition within each category as well as a general good quality of the projects submitted. But the budget is close to a wisdom-of-the-crowd solution, so there has to be merit behind it. Concretely, it’s also very hard to compare the proposed budget with the past funding rounds, since the diversity of projects means that governance related ones were scattered within every past challenge, and there are no readily available tools to measure such past demand with the information currently available. ", "q1r": 5, "q2": "To assess the challenge’s verifiability, we go one more time through the process of turning the verifiability statement from the guide into a fundamental question and answer it:  \n\n(1) Is the challenge well scoped in defining the measures of success? \nThe challenge is very well scoped in terms of defining the types of accepted proposals. We have a multitude of infrastructure projects included, including tools tailor made for governance, identity, auditing, as well as rapid funding mechanisms, research possibilities and small scale experiments.\n\nThe challenge includes as well a wide range of success metrics for each type of project, focused mainly on adoption rates, number of participants for relevant projects or citations for research projects. A great strength of the proposal is that it ends with additional guidance for proposers and in this way weeds out any potential proposal that (1) does not seek to be open source or (2) is profit seeking, for which products and integration category is suggested instead.  \n\n(2) Can the challenge drive healthy competition between proposals?\nThe wide scope of the challenge also implies a certain potential for competition in the broader sense. However, because we don’t have a very well defined market niche here, it will be difficult to measure it across the entire board, since there will be obviously area in which proposers are already well prepared (have a track record, clear value proposition, existing teams, etc.) and they will also be competing with proposers trying to enter newer areas where such resources and clear paths do not exist, and this will therefore offer advantages to the first groups over the others in terms of accessing funds, if quality and feasibility will be more important for voters than potential impact. \n\nIn conclusion, there is a good potential for verifiability for this challenge.", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8997, "q0": "Please vote Funding Categories Full Fund (https://cardano.ideascale.com/c/idea/414562) first!!\n\nThis challenge will do a good job at furthering the  goals set out for Fund 10. All four goals are met in this challenge. The proposals that line up with this challenge range from helping people get prepared to contribute to the Cardano ecosystem, attracting more developers, moving Cardano toward open-source, improving tooling, and supporting human processes. This challenge specifically helps with building real-world solutions based on Cardano. Identity and governance proposals built on Cardano are the best way to gain acceptance from those outside the crypto world which increase network growth. From increased mentoring, to building tools, to rapid funding, these sorts of governance and identity projects will speed adoption of Cardano.", "q0r": 5, "q1": "Please vote Funding Categories Full Fund (https://cardano.ideascale.com/c/idea/414562) first!!\n\nThe team behind this is capable and prepared to take ownership of this challenge. They are the same team that developed the concept for the broad funding categories instead of the challenge settings for Fund 10. This is one of the categories that would be present if the other  proposal is voted first. \n\nThe team's skills, and shared vision will be more than sufficient to see this challenge through to its maximum potential. The PACE team has been working on governance and documentation for issues that are addressed in the challenge through Catalyst and Swarm. They will be capable of providing the time and effort into seeing the proposals made as effective as possible. ", "q1r": 5, "q2": "Please vote Funding Categories Full Fund (https://cardano.ideascale.com/c/idea/414562) first!!\n\nThis challenge has a solid and broad approach setting metrics for impactful proposals.  This challenge is broad, but has definite metrics. There are a variety of potential proposals that meet the goals, while at the same time there are clear proposal metrics that are presented to maximize proposal success. This creates a framework for seeing a more proposals, Having more proposals helps attain the broader goals without restricting them to just a small subset of all that could be effective. I would prefer to see the seven set categories set for Fund 10, but if that does not get voted first, then I would love to see this one approved. Overall, I have no doubt that this challenge would be a success in furthering adoption of Cardano.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}], "importance": "Cardano needs effective governance & identity tools, processes and experiments to make it easier to develop and scale community solutions", "success": "Evolution of the governance and identity tools, processes and resources to improve Catalyst and applications building on Cardano"}