{"id": 414562, "author": "pace", "title": "Funding Categories Full Fund", "url": "https://cardano.ideascale.com/a/dtd/414562-48088", "category": 26604, "amount": 12800000, "description": "How can we improve funding categorisation in Catalyst by using more effective approaches like funding categories?", "f6_no_assessments": 17, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 78, "q0": "This challenge setting proposal aims at changing completely how future challenges are chosen by the community within Catalyst by creating 7 fixed recurring broad categories instead of community elected challenge settings that can change each fund. I have been participating in Catalyst since fund 2 as a CA and very involved as a community member and thus I have seen the opportunities created by the current challenge system as well as its shortcomings.\nThe current system offers a way to create constraints to channel the creative energy of the community toward a particular set of problems to be solved. These constraints naturally transform into opportunities for entrepreneurs. This is good for innovation as the community decides what is currently important. However the current system lacks stability, and a challenge can disappear from Catalyst for a few funds leaving multi stage proposals without the possibility to ask for further funding next round. Lack of  stability is never adequate for long term development.\nHowever there are challenges which have been stable since the very beginning of Catalyst as the Grow Africa Grow Cardano one giving a unique opportunity for proposals aimed at this continent... So the new system proposed by PACE would remove this intentional channeling of the community's creative power in exchange for stability and certainty with fixed challenges that can fit any proposals. I feel that we would possibly lose something that we might not completely grasp yet while also gaining something that we already know for sure. I feel that stability is important but it shouldn't be at the detriment of innovation or disruption capabilities (by focusing a few millions dollars just on DiDs for example).\nIt's certain that the current system lacks clarity as several competing challenges can be voted at the same time resulting in a disproportionate representation of a class of problems at the expense of more specific challenges. The current system is unstable but also fluid as it's short term based and provides a good ground for experimentations and unforeseen innovation - giving the power and resource to people to create something that would never have existed if the specific challenge fitting their idea had not been there to nurture it...\nThe new proposed system is oriented long term and toward stability.\nIt's really up to the voter to decide. This challenge setting being perfectly aligned with Cardano's objectives, I can only give a 5 even though I'm unsure if I'll vote for it myself. The research done to create this new category based system is thorough and deserves the voter's full attention.", "q0r": 5, "q1": "In terms of feasibility, this challenge setting has no issue whatsoever since it has been built around what the community has created so far. The proposed 7 broad categories encompass all the possible proposals and the budget is naturally the totality of the future fund 10.\nNaturally, the only way for this challenge to pass is to end up being the first after voting, moreover the proposer also submitted the independent categories as their own challenge settings so there is actually another way for this proposal to pass: having all its independent categories funded... Even if not funded the result will give a good indicator of the community's support and interest in this idea.", "q1r": 5, "q2": "The verifiability is not really addressed in the core of the challenge setting proposal. We can wonder if it applies given the nature of the proposal that is replacing the established challenge setting system. So the verifiability is summed up by 2 things:\n- is it voted?\n- are the defined categories used by proposers to submit their proposal?\nOn the former, we will know at the end of this fund. Concerning the latter, given the categories and how they were defined there is little doubt to be had that they will indeed be used.\nThe amount of funds per category has been voted on by the community (full disclosure, I participated in this voting myself) so it's quite representative of the expectation and of the other similar challenge settings that were used in previous funds.", "q2r": 5, "assessor": "z_assessor_2044", "no_vca": 22, "ne": 8, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 10151, "q0": "In this challenge setting, the PACE team presents a highly detailed research work, with verifiable sources, and adapted according to the suggestions (and votes) of the community, since they have been proposing this novel way of approaching the categories since the last fund. One of those learnings was precisely to upload this challenge in addition to their individual funding categories, with the intention of getting voters to take this idea to the top of the voting process and decide whether or not to change the scheme for the next fund. \nFrom my point of view, this challenge aligns with the four Fund9 strategic goals, particularly because it will attract more developers by having broader categories where a wider number of proposals can be included, regardless of their alignment with the specific challenges of the current fund as they are today, and also because they estimate that it will reduce the time and costs associated with certain human processes in Catalyst performed by voters, PAs/vPAs, proposers and challenge teams members, as detailed by the team in the documentation provided.", "q0r": 5, "q1": "Having considered that PACE in their analysis not only detailed the advantages of their project, but they also listed various potential difficulties that might occur, such as: proposal idea generation, visibility, submission encouragement, and others, I am confident that the community can meet these challenges and achieve success by following the recommendations detailed by the same team in their project.\nRegarding the budget assigned to each of the 7 categories proposed, I consider it adequate, since the team determined it through the vote of the community before finalizing the proposal, which also shows that the community identifies with such allocation.", "q1r": 5, "q2": "It should be noted that the challenge has a well-defined scope as well as what is needed in order to implement it (in this particular case, it is basically necessary that it comes first in the voting process).\nSince it is a proposal that encompasses several funding categories (replacing the challenges), in order to evaluate the metrics it is necessary to address each of these categories. After determining that each category has its own set of potential success metrics that can be used to gauge how successful each proposal is in meeting the objectives, I consider this challenge to contain what is necessary to demonstrate its verifiability.", "q2r": 5, "assessor": "z_assessor_3161", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 9001, "q0": "This challenge setting would radically transform the process of catalyst Fund 10 b changing how the challenge goals are set for the next Fund. Instead of the community selecting a hodgepodge of options, if this goal wins, then Fund 10 will have preset challenge categories. These categories are fair, equitable, and broad. This is based on resaerach done of all prior funds. The research discovered that every proposal fits into one of seven broad categories. Almost every fund, there is someone who has a proposal idea that there is no place to submit. That would be entirely eliminated by using funding categories.\n\nSome may feel this is less decentralized than before and that would be correct. However, the decision to move to the funding categories is ours. I think it is the correct move, as it enable the broadest number of proposals to have the potential to be funded each round. This challenge setting also more than meets the fund goals. I encourage everyone to vote this first.", "q0r": 5, "q1": "The community has more than enough capacity to move this direction. The funding categories are set and clearly outlined in this proposal. There is enough background information to answer common questions, and provide solutions for problems. The team who put this together has invested a lot of time researching and developing this model. It has passed several rounds of peer-review among those involved in the Catalyst team and has been available for consideration on the Discord and community documentation channels. Overall this funding categories are the best way for the community to move forward with Project Catalyst. ", "q1r": 5, "q2": "These are some of the best, most well-defined, but broad challenge categories yet. Again, voting this first will overwrite every other challenge fund setting and replace them all with these seven broad categories. There will be a place for every proposal under this system. The metrics are well-defined and broadly set. There are whole lists of potential metrics that proposals can meet in order to have a high impact score. As a regular assessor I am very excited and passionate to be able to see the funding categories come about because it will create a standardized method for evaluating proposals. I also will not have to downvote proposals for being in the wrong categories. Every proposal will fit into one of these categories. Let's work together and help make Catalyst better for all b voting this first.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 7997, "q0": "It's a great idea to change the challenging settings to funding categories. By using financing categories, there will finally be no more focus on goals and objectives. This will improve the process a lot. By using this, suggestions will be offered on which success metrics can be used for each proposal. By doing this, the impact of a project can be estimated much better. The funding categories are clearly defined in the accompanying document. (Broad, inclusive, unique and recurring) I think this challenge is critical to Cardano's mission because using this approach will allow a much better focus on new projects. The focus in this project is also clearly placed on the strategic objectives of Fund9. I am certainly in favor of this new method.", "q0r": 5, "q1": "This proposal can certainly be supported by the Catalys community. This project actually includes everything to make Fund10 a success. There is already a clear list of the funding categories and the budgets that would be used. It is good that the categories were chosen by a democratic community vote. A transparent way of how everything will work has been included. The advantage is that people can apply to support a funding category. These teams have not yet been formed. This is a good idea to divide the challenges in a different way. It's clearly written out and I look forward to testing this in the next Fund! Another major benefit is that there can be an overall cost savings of 80 percent if the challenge setting will be replaced. The financing categories are effective for directing the financing and will ensure that there will be healthy competition.", "q1r": 5, "q2": "There will be seven funding categories for the community to submit proposals for the next funding round. A budget weighting will be applied that comes from the vote on the budget weighting. Everything is clearly described how the challenges will be tackled. Provided there is sufficient community support, there will be someone for each funding category to support it. The submitter has submitted a superb plan that should certainly be given the chance to be tested.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6657, "q0": "This challenge is peculiar from all the other ones in this round. First, it goes all in and asks for the entire funding available in F10. The takeaway for a voter: either vote for this challenge and against all the other ones, or vice versa, vote against it and then choose among the remaining ones in a similar fashion to how previous rounds worked. \n\nSecond, it brings a fresh perspective on how Catalyst funds should be distributed. Unlike other challenges which are the product of 3 to 5 person’s thinking, or rarely a well bonded team’s, here the emphasis is on a community-led process  that overcomes the downsides of the classical process (low entry barriers for malicious actors, unilateral budget weighting, limited understanding of challenge teams, suboptimal time consumption, etc.). This new process aims to be more efficient, flexible and scalable. The team has an entire website dedicated to it, and it is a very good read for anyone trying to find out more. \n\nThird, it has a high level of legitimacy. The groundwork for the challenge long preceded the Fund 9 proposal writing period and was performed by passionate community members. Fast forward, the last step was an open community vote to decide on the weights for each funding category, secured by gatekeepers that anonymised voters’ identity. This approach is head and shoulders above any other arbitrary setting of a challenge amount, as is the case with all the other proposals.\n\nAfter such a long introduction, let’s see if this challenge has the capacity to deliver on of the strategic goals from Fund 9. So we continue by turning the four strategic goals into fundamental  questions and trying to come up with decent answers. Here we go.  \n\nCan this challenge help prepare a group of people willing and able to make contributions to the ecosystem? Yes, since splitting the entire amount in categories achieves a balanced outcome, with resources being channeled in more than one direction. Some categories make it easy for non-tech people to participate (Community and Outreach and Governance and Identity for instance) , whereas other categories will add to the building blocks of critical infrastructure (Development and Infrastructure, or Products and Integrations). Takeaway: there is vital development space for multiple, diverse cohorts to come up with solutions for painful but various problems that the ecosystem faces. No important area gets crowded out. \n\nCan this challenge turn Cardano into an open source project and attract developers? Attracting projects and developers is a clear yes, since both products and integrations as well as the development and infrastructure categories offer generous budgets to support both mature teams as well as allowing the entry of small scale proposers with unique value propositions. Is this also the case exclusively for open-source projects? The answer here has to be nuanced a bit. There are no entry barriers for closed source products, but some of the categories within the fund encourage the development of open-source solutions (without exclusively allowing them). Additionally, ADA holders are ultimately the enforcers of this strategic goal, hence the burden lies on them as well perhaps more than on the categories themselves to promote open source more than closed source projects. \n\nCan this challenge help build real-world solutions based on the Cardano? Absolutely, since there is a huge expectation from the community that such solutions be built and we have proven examples of this: Atala Prism and Coti Pay spring to my mind right away, but we can of course fill pages of such examples. And all of these projects, and many new ones, will necessitate additional funding to build more features and carry on experimenting until reaching financial stability and enough traction to be independent from Catalyst funding.\n \nCan this challenge improve tooling to support human processes in Catalyst? Of course, since there is a dedicated Catalyst contributors category dedicated for members working full time in order to support the ecosystem.\n\nVoting for or against this challenge will be a very personal choice for many ADA voters. Just remember that a Catalyst's overarching feature is to “break things”, so perhaps it’s about time we experiment with an alternative funding mechanism. Five spotless stars.  ", "q0r": 5, "q1": "Can the community address this challenge? Undeniably yes. Catalyst has been running for quite some rounds, the last two being fully-fledged in terms of budget, and we have seen a consistent, and increasing, number of teams and proposals sprouting, across all challenges. I don’t believe having seen one challenge without a real competition between proposals, since all of them had funding requests of over 100% of available funding, with some reaching 6 or 7 times that amount. This is definitely the case in the current round with almost 1.2k projects. \nWhile generally true, there are also examples of funding categories within this challenge that are swimming in uncharted waters: Catalyst contributors, Cardano contributors, for roughly 8% of the budget each. For them it begs the questions: do we have all the necessary ingredients in place for Catalyst / Cardano full timers to be paid exclusively for this activity? Do we have the right governance tools to control their work, do we have all the checks and balances working smoothly to detract malicious actors? Do we have the scope of work necessary to keep them busy for an extended period? I do not have an answer for any of these questions, but I do know that the community needs a higher level of public debate around these topics. \n\nIs the budget realistic and reflecting the requirements of the challenge? The budget split here is a wisdom-of-the-crowd solution. If realistic, the answer will definitely be clear post-factum, if we will have sufficient projects and competition within each category, as well as a general good quality of the projects submitted. \n\nIn conclusion, there is an undeniable capacity for the community to deliver on this challenge, and the budget is a wisdom of the crowd solution, overall feasible, but it will most likely have its suboptimal parts. Nevertheless five stars for feasibility.", "q1r": 5, "q2": "Is the challenge well scoped in defining the measures of success? We have again a unique approach that deserves a wider context to understand. Here we go. \n\nThe philosophy behind it is that funding categories should be kept separate from setting objectives within each category, and this division of scope can lead to better long term results. \nIn order to define the objectives, the community collectively has to gather first of all enough knowledge to work with: data, feedback, problems, etc. Only then can it proceed to setting objectives. One benefit of this approach is that there is flexibility in defining what objectives are important, and we can have a matrix-style decision tool in which a proposal can help reach multiple objectives, across different categories. Another benefit is that incentivising teams / individuals can be done in multiple ways: we can have proposal-based funding (classical approach) as well as rapid funding (similar attempts have sprouted in F7) as well as payment for full timers (Cardano / Catalyst contributors). \n\nThe downside is that Catalyst does not have the tools in place to set these objectives independently from the funding categories. Therefore an extra step is necessary to make the challenge functionable for the next round. How long would that take? Will it manage to muster enough support from the community, will it be legitimate? These are still unknown variables.    \n\nCan the challenge drive healthy competition between proposals? The challenge team presents us with a very in-depth analysis of how competition can look like. The takeaway is that it will depend mostly on setting the right objectives, and there will always be a trade-off between setting the right objectives and promoting competition. Let’s see why. \n\nBroad objectives (think classic challenges) can lead to an increase in competition since it allows for a wide range of proposals to compete within the same space. More specific ones on the other hand (think funding categories + objective setting), will limit the competition by narrowing the scope, and thus minimize the number of potential teams that can deliver value within that framework. Finding the equilibrium point of these two aspects is very difficult, and only through experimentation can we find the right answers. \n\nEnding on a high note, this is an extremely well thought out challenge. It passes with flying colors the guide’s requirements, is clear and leaves no room for interpretation. On the other hand there are still significant unknowns and possible unintended consequences lurking beneath it, but it is most certainly a very promising value proposition. Five stars again. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4018, "q0": "\"This Challenge seeks to change the way Project Catalyst challenges are created. Instead of the current process of specific Challenges competing every funding round for a share of the total fund pool, the vision is for a fixed set of broader categories which any of the specific challenges would fall under. It should be noted that many specific challenges could fall under multiple of the defined categories so the categorization is slightly subjective.\n\nThe challenge makes a solid case that categorization is \"\"a more efficient, simple, flexible, scalable and egalitarian approach to do funding categorisation than challenge settings\"\" and includes a detailed analysis paper.\n\nThe challenge makes use of the existing challenge setting process to achieve its desired changes specifically requesting the entirety of the available funds which are then divided according to specified amounts in the defined categories. For this approach to be successful, this Challenge would have to achieve the highest support of any challenge since under the current funding system any challenge scoring higher would be funded first and then there would be insufficient funds for this challenge. \n\nAs a backup plan , the proposers have also submitted each category individually. Voting for the Full Fund and the individual challenges works quite nicely in that the categorization could be partially implemented if this Challenge did not score the highest. \n\nThe challenge is critical to Cardano's mission and the strategic goals. The only minor quibble is with the goal of making Cardano an open source project which is sort of subsumed into the broader categorization but not explicitly an outcome of this challenge setting.\"", "q0r": 5, "q1": "\"Project Catalyst funding rounds could easily be reorganized into categories as envisioned by this Challenge Setting. The proposed budget of the entire fund would be required to fully achieve this structural change.\n\nThe risks section is missing one potential case that should be included. If one or more of the contingent specific category challenge settings score higher than the the Full Fund Category challlenge setting, and no other challenge settings score higher, then it is possible that the specific category challenges could preclude the funding of this challenge setting for which it is a subcomponent. Logically this is not a desired outcome but if this scenario were to happen there might be debate in the community on how to proceed. It would be better to explicitly include this scenario and state something to the effect that if funding one or more of the specific category challenges would be solely responsible for precluding the funding of the broader Full Fund Category challenge then those challenges would waive funding so that the broader category challenge setting would be funded. This is a niche case however and does not effect the overall feasibility.\"", "q1r": 5, "q2": "\"The challenge setting is very methodically detailed with extensive supporting documentation however it partially attempts to sidestep measures of success wiith, \"\"Funding categories do not focus on goal or objective setting. This is better suited as an independent process\"\".\n\nGiven the current proposal assessment criteria, this challenge setting would score better by directly addressing measures of success. Success measures could include metrics comparing number of total proposals under the new system compared to the old or number of unique proposers. Any metric which can verfiy the claim that categorization is \"\"a more efficient, simple, flexible, scalable and egalitarian approach to do funding categorisation than challenge settings\"\" would be useful.\n\nDespite not having specific metrics for the Full Fund Category challenge setting, each of the funding categories that collectively make up this challenge setting do provide suggestions for what success metrics could be applied to individual proposals therefore overall the verifiability aspect is being satisfactorily met.\"", "q2r": 4, "assessor": "z_assessor_2508", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3782, "q0": "With Catalyst is currently on Fund 9 and moving into Fund 10, we should be glad that few members of community contemplated our current framework and methodology then identified some faults and weaknesses in the current way we as Catalyst doing things. The idea in this proposal is much aligning with the mission of improving the support tooling for human processes in Catalyst.\nI believe Cardano as blockchain has the best chance to balance the trade-offs and hitting the sweet spot inside the triangle of blockchain trilemma. To do this, we need to ensure a well-balanced and adaptive development in whole major aspects of Cardano ecosystem in a harmonious and synchronous fashion. This kind of development will eliminate glaring weaknesses in Cardano’s technology and ecosystem and a lot of chicken-and-egg problems in the future. As Cardano scales into more vast and deeper adoption globally, we in Catalyst need to keep up with and accommodate changes for betterment as the stalwart of Cardano’s innovative evolution. Therefore, for the benefit of pioneering positive and groundbreaking revolution of accomplishing our grand mission, I endorse this idea and encourage others to read about their studies supporting the Funding Categorisation in their gitbook documentation.", "q0r": 4, "q1": "Our community in Catalyst has the capability to address, implement, and deliver this idea in a satisfying manner. The community, especially Challenge Teams members, are now dealing with a more difficult and complex framework model with good amount of work duplication and inefficient repetition of tasks. I have very little doubt that we will be able to perform better and easier with this Funding Categories model of framework with the simplicity, efficiency, and stability it offers as benefits.\nWhen reading the studies, I noticed this Funding Categorisation model has some semblance with the Nobel Prize in the way that Nobel Prize has five recurring fields (Physics, Chemistry, Medicine, Literature, and Peace) where the works are focused into. Since Nobel Prize has been going for more than 120 years and along the way producing many positive and great contributions to humanity, I cannot help but think that Catalyst community could learn from this established and accomplished model then adapt and modify the merits learnt. I believe this kind of change needs to be implemented promptly before Catalyst and Cardano grow so complex and large that making it harder to pivot and jump higher. Maybe we can investigate Ethereum long and painful effort to transition from Proof-of-Work to Proof-of-Stage as a case study on the difficulty of changing when things are too big or mature already.", "q1r": 5, "q2": "In assessing this proposal, I spent a good amount of time (a whole day, to be exact) studying the theory and analysis made in the documentation (https://docs.catalystcontributors.org/funding-categorisation-analysis/). The writer and team supporting this framework model had spent decent number of resources in the effort to make unbiased conclusions.  The comparisons with current Challenge Setting model are well-defined and comprehensive. The proposer and its team have laid a solid groundwork for the implementation of this Funding Categorisation model compared to Challenge Setting. The analysis done and documented can be used as the test to benchmark the overall theorized benefits detailed in the gitbook.\nThe immediate and most impactful immediate improvement to Catalyst I can foresee in the Fund 10 if this change to Funding Categorisation is approved to replace the Challenge Setting is PA/vPA will not be focusing their precious time and effort in assessing Fund n+1 Challenge Setting proposal since no incentive to reap the bonus reward from such proposal. This precious resource thus can be allocated to the actual solutions of the actual problems we face rather than spending too much unnecessary resources into less clear and detailed problems. Also, more inclusivity to novel prospective ideas to be proposed on every Funds and continuity to all funded/approved ideas proposed in previous Funds since proposers don’t need to worry if the Challenge they are currently involved and solving will still exist in the upcoming Fund.", "q2r": 5, "assessor": "z_assessor_2482", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13036, "q0": "This proposal is related to 7 other proposals from PACE that are all part of an experiment to address improvements to the current funding system. The proposal itself is well written explaining this alternative process thoroughly and providing links to supporting documentation and community dialogue. The other 7 proposals are this larger full fund proposal broken into the smaller funding categories that it references.\n\nThe basic idea is that by changing the current challenge setting system in catalyst from a  highly variable and open system to well defined and consistent categories that reappear predictably each funding cycle there would be less waste and proposers would be able to propose better and more easily. As the Catalyst ecosystem is all about experimenting to find what works better and if funding categories are able to accomplish the goals of challenge settings, while making the improvements the challenge team suggests, this proposal is very much in alignment with Catalyst/Cardano goals. ", "q0r": 5, "q1": "As I said before, the challenge team provides a lot of supporting documentation for why they believe this proposal will improve the current system. This proposal is asking for all the funds available this Catalyst funding round so if you want to see this experiment through and find out what might be some unforeseen consequences, you have to do it at the expense of all other challenge setting proposals.\n\nThe alternative is to vote for some of the individual funding categories that the PACE team has presented in other challenge setting proposals, but as the challenge team has shown through their documentation of this idea, the individual categories must exist together to create the funding circle that does not exclude ideas and create \"waste\". As such, this proposal is the only viable opportunity to try this funding experiment.\n\nThe proposal states that there is \"no risk\" associated with implementing this proposal but I am not convinced that is true. Let's take for example the combined categories of Cardano and Catalyst contributors totaling $2,075,000. Within these categories proposers are incentivized to run campaigns for the opportunity to make as much as $60,000 for six months. There are suggestion for what might be expected or what might make a good candidate but I would prefer to see exhaustive governance documentation including things like a signed code of conduct and clear recourse for dealing with \"bad actors\" before committing funds to such an endeavor.\n\nIf this experiment were proposed as a side treasure I would be more inclined to overlook potential shortcomings and see what creative ways the community would present to overcome them, but without a robust governance framework in place at every level of this proposal, I have great reservations about committing the full $12,800,000 of Catalyst funding. (3 stars)", "q1r": 3, "q2": "This is an extensive proposal with a lot of background information, community involvement, and supporting documentation and as a result has a wide margin of variability within it's parts. Each of the funding categories in this proposal have associated suggestions for KPI's and success metrics. \n\nWhen we take for example, the \"Nurturing Ideas and Teams\" category, it is easy to draw comparisons between what has previously been called \"Miscellaneous challenge setting\" and see the improvement in verifiability this proposal category would provide. The PACE team has provided more guidance for proposers and verifyable key points, like sharing connections/collaborations within the community or including an open source plan (while not requiring that proposals be open source) then has ever been provided for a \"Miscellaneous challenge setting\".\n\nOn the other hand looking at the Contributors categories we swing to the other end of the spectrum were Contributors expectations are somewhat open like \"supporting the ecosystem\" or have \"high participation\". Contributors would not report typical KPI's like \"idea\" based proposers but instead focus on keeping the community up to date on what they feel they are contributing.\n\nI can see, in a community that already has a large number of contributors working doggedly for no reward except the knowledge that they are making a better ecosystem, how this would work perfectly. I can also see how difficult to verify something like this might be especially when considering scalability and therefore will deduct one star.", "q2r": 4, "assessor": "z_assessor_3545", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3353, "q0": "Based on the information provided in the challenge setting proposal and after having read all of the challenge proposals under this challenge setting, I believe that it addresses all four Cardano strategic goals for fund 9. This challenge setting proposes that all seven of their proposed challenge setting categories be combined into one challenge setting, allowing for all seven to be guaranteed as challenge settings for fund 10 if this challenge setting is voted in. As a result, much of my reasoning below will come from the collective amount of information, including all of the individual challenge proposals (since that is where most of the information lies).\n\nThe challenge setting addresses the first strategic goal (prepare a group of people to make contributions to the Cardano ecosystem) through the guidelines and individual requirements that are listed in each of the funding category proposals. I can say for certain that each one would prepare a group of people to make contributions to the ecosystem. It is very clear what the expectations are for each category, so future proposers should have no issues with understanding what is required of them. I’ll briefly go over how each individual challenge category covers this strategic goal: Products & integrations will prepare people to make end-user products, like hardware, business solutions, climate solutions, etc. Development & infrastructure will prepare people to make new development tools or solutions for devs on the Cardano blockchain. Community & outreach will prepare people to form communities and conduct outreach to onboard new Cardano users. Governance & identity will prepare people to build governance and identity solutions to improve Catalyst processes. Nurturing teams & ideas will help people find new areas of focus and start smaller projects. Lastly, Cardano contributors and Catalyst contributors will support full-time individuals who drive the ecosystem forward. All of these examples are evidence that this collective group of challenge settings aligns with the first strategic goal.\n\nThe challenge setting addresses the second strategic goal (build Cardano into an open-source project and attract new developers) through some of the sub challenges. For example, this strategic goal is the main focus of the development & infrastructure category. The entire premise of that category is to build new dev solutions and infrastructure, while attracting new devs and building an open-source ecosystem at the same time. There were also examples from some of the other challenge categories, such as governance & identity and nurturing teams & ideas. In both of those challenge settings, the proposers made sure to mention that projects should be open-source when possible or at least have a plan to become open-source in the future. Nonetheless, all of the challenge settings that involve developing solutions can attract developers if those developers see there is an opportunity to receive funding for their ideas. \n\nThe challenge setting addresses the third strategic goal (build real-world solutions on the Cardano blockchain) because many of the challenge settings encourage people to make solutions that will help people with their everyday lives. For example, solving climate change, transport and logistics, insurance, and legal were all focus areas of the products & integrations category. The potential impacts of solutions to these areas are immeasurable because every single human has some connection to at least one of those areas. By providing solutions, there is the opportunity to better the lives of everyone around the world. Also, the governance & identity challenge category had DID as one of the focus areas, which could have an impact elsewhere, like how DID is being used by the Ethiopian government to provide students in Ethiopia with more opportunities for finances and education. More examples like this one were found throughout the many different challenge categories, so I believe that this strategic goal was addressed.\n\nThe challenge setting addresses the fourth strategic goal (improve tooling to support human processes in Catalyst) through many of the suggested challenge categories. In the governance & identity challenge setting, the proposers encourage people to build solutions to some of the issues seen in Catalyst and to iterate on the process until a more optimal solution is discovered and implemented. I was also able to make some connections to Catalyst in products & integrations as well as the nurturing teams & ideas challenge categories. There are many opportunities to fund different projects that are working on making better tools to streamline Catalyst, such as the AIM group. Groups like those can propose in the aforementioned categories to continue to build their solutions.\n\nSince all of the challenge settings under this bigger challenge setting address the four strategic goals, I can give this proposal a score of 5. (score given: 5)\n", "q0r": 5, "q1": "Based on what I have read in all of the proposals under this main challenge setting, I believe that the Cardano community has the capacity to address this challenge funding categories idea. Since there is such a wide range of proposals that can fit under any of the challenge categories, there will definitely be enough participation from the community. Essentially all of the proposals in the past few Catalyst funds could find a place under one of these proposed categories, so there are 2000+ proposals as a baseline for participation. Since this challenge setting would take up all of the funds for fund 10, there would be no other opportunities to propose under a different category other than the ones proposed for this setting. As a result, all participation would be funneled through this setting. While that may seem scary to put all faith in one challenge setting to rule them all, it can actually make sense because all of the individual challenge categories are very broad in nature, meaning nothing would be excluded like they might be with a collection randomly voted in challenge settings. Everything has been thought through beforehand, and the challenge categories were chosen to encompass all areas included in previous Catalyst funds. \n\nAs for the budget, I believe that it makes sense given the goal of the proposers. Their main aim is to start a new kind of challenge setting selection, which involves community voting to specify what funds go to specific key areas. The voting already happened, which is how the breakdown of the funds was decided. The overall budget of this challenge setting is the entire budget for fund 10 (12.8 million ADA), with the following breakdown: 1.8 million ADA for community & outreach, 3 million ADA for products & integrations, 2 million ADA for governance & identity, 2.925 million ADA for development & infrastructure, 1 million ADA for nurturing ideas & teams, 1.1 million ADA for Catalyst contributors, and 975,000 ADA for Cardano contributors. I think that this breakdown makes sense because more funds are delegated to areas that require extra focus, like the development & infrastructure or products & integrations. I like the idea of having a collective set of challenge categories because it guarantees that there will be these categories with these amounts of funds if it is voted in.\n\nOverall, I have no complaints for feasibility, so I can give this challenge setting proposal a score of 5 for feasibility. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided in each individual challenge category under this challenge setting, I can conclude that all of the measures of success were well-defined for the focus areas. The proposers listed many focus areas for each challenge category and listed a few metrics of success for each focus area. For example, in the products & integrations category, the proposers listed “total value locked, total number of users, number of active daily/weekly/monthly users” as metrics of success for DeFi related proposals. There were many other great examples throughout all 7 of the challenge categories. The proposers were sure to mention that the suggested metrics of success were not exhaustive though. Adding that statement allows future proposers to tailor the measuring of success to their proposals. This idea can also lead to more healthy competition between proposals because similar proposals can have different metrics of success that can help distinguish between them. Each proposal can drive others to improve their metrics of success in order to compete better, so the overall quality of all proposals should improve as a result. Since I do not have any critiques for verifiability, I can give this proposal a score of 5. (score given: 5)", "q2r": 5, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1885, "q0": "This proposal is something completely out of the box. Which doesn't necessarily mean a bad thing. In my opinion, it's a good thing. PACE proposal is a complete overhaul of Catalyst Funds. It consists of categories instead of challenge settings, which provide better insight and recurring structure over funding rounds. This proposal touches on the strategic goals of this fund.", "q0r": 5, "q1": "The proposal is about why categories are better and less time-consuming than challenge settings. If the proposal is Voted on the structure of Catalyst would change and Categories would come to life, then each funding round the community has the chance to vote for the budget allocations between the categories.\nGiven the fact that this proposal will make sure that the next fund will have 7 categories and a good budget allocation, I'm sure the community has the capacity to address this challenge. In the Gitbook we can clearly see how and where the previous challenge settings fit within these categories.", "q1r": 5, "q2": "For verifiability, it's a bit hard to address this proposal since it proposes 7 different categories. But the 7 categories themselves are also proposed by this fund and the key metrics on all of them are well documented and concerning the measure of success for each category are in line with the challenge question for each. This is a bold but good way to think forward about Catalyst", "q2r": 5, "assessor": "z_assessor_2285", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 1456, "q0": "As many projects scramble and contort themselves to fit narrowly defined challenges, many will not align correctly and therefore be ineligible for funding. By creating a more inclusive framework in which to propose, this challenge setting clearly meets the strategic goals of fund 9 and neatly aligns with the mission of Cardano. The creation of an algorithm to determine future funding levels is an innovative approach to scientifically allocate funds based on data science analysis. Governance issues and voting disparities are similarly resolved by this visionary and proactive challenge setting. Adoption is essential.", "q0r": 5, "q1": "As many necessary projects are denied funding opportunities by the arbitrary revolving door of constantly changing challenge settings, this proposal is not only highly feasible, but entirely necessary. Despite the significant time and energy required to institute the encapsulated governance changes, adoption of the changes to the funding mechanism could be instantaneous and effortless. As a project assessor, I have spoken with many proposers who have bemoaned the exclusivity of the current model. It is highly realistic that the proposed budgetary changes presented in this challenge setting would have widespread support and require far less effort to implement than the current structure demands. The successful initiation of this project would free up human resources to adequately address the governance issues identified, and the process to reconstruction of a more inclusive system of governance could be given the resources and time needed to develop organically, and with the involvement of the entire community.", "q1r": 4, "q2": "The KPIs stipulated in this proposal would be automatically initiated for the funding of all subsequent rounds and are baked into the solution. Verification is provided by data analysis of each prior funding round and establishes a 100% auditability metric as future funding levels are predetermined. The simplistic beauty of this approach provides a failsafe methodology that verifies every funding metric can be audited before a single dollar or Ada can be disbursed.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 921, "q0": "This is hands down the most important “challenge” to vote for if you wish to see any real change happening in Project Catalyst any time soon. It will end the era of challenge setting. That can sound harsh and destructive but the proposer has, in fact, undertaken thorough analysis to arrive at this suggestion.\n\nShould you read through everything, not just the proposal but everything linked here, you soon understand that this kind of approach is much better than our current ever-changing challenge setting. It would encourage the community to be more long-term oriented and take Project Catalyst to the next level.\n\nFinally, this proposal ticks all the boxes when it comes to Fund9 strategic goals, especially if a small but important improvement is taken into account (read the commentary on “feasibility”).", "q0r": 5, "q1": "Asking for all of the money from Fund10 to a single \"challenge\" would be ludicrous but this is not a challenge at all. No, this is a new approach that suggests a new way of distributing the available budget.\n\nWhile the effort gone to this proposal is commendable, it might not be the ultimate solution that it offers to be. But it is fairly close to it. Other categories are okay but these three could be combined into one people-centric category: Nurturing Ideas & Teams, Catalyst Contributors, Cardano Contributors.\n\nLimiting categories into five and acknowledging the fact that miscellaneous ideas, emergent teams and full-time contributors can be found in all of them would make the model clearer. Should that improvement happen, there is no doubt that the Cardano community could run with this new approach.\n\nThe Development & Infrastructure category would “help turn Cardano into an open source project & attract more developers”. The Products & Integrations would be all about “building real-world solutions based on the Cardano blockchain”. Governance & Identity would “improve tooling to support human processes in Catalyst”. The combined people-centric category would help “prepare a group of people willing and able to make contributions to the ecosystem”. Finally, the Community & Outreach category would drive us towards bigger impact, therefore allowing us to fulfil the Cardano mission on an ongoing basis.\n\nWhat could have been improved in the proposal was acknowledgment of potential risks. There are plenty if you embark on a change management journey of this magnitude.", "q1r": 4, "q2": "Listing the suggested measures as part of this grand undertaking would render the proposal unreadable. So, to get to the actual measures of success one has to open the Gitbook link (https://docs.catalystcontributors.org/catalyst-funding-categories/). Over there, each category is explained in full, examples are provided and ideas for metrics provided. This approach invites innovation, collaboration and the required “healthy competition” from the community. \n\nAll in all, this Funding Categories approach only makes sense if it is implemented as a whole. We have already seen in Fund8 how confusing the fund becomes if there is one mega-size “challenge” (dApps, Products & Integrations) and a bunch of smaller ones.", "q2r": 5, "assessor": "z_assessor_2156", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 850, "q0": "The PACE team has been advocating in several places within the Catalyst community for the need to evolve the way in which Catalyst defines the areas for budget allocation. This is necessary in order to reduce the risk of under-allocating funds in key areas of ecosystem development and, on the other hand, to cover critical topics that have been covered in past funds. Sadly, the results of their efforts in Fund 8 resulted in only one of the proposed categories being selected for Fund 9. Considering that all or most of the categories must be approved to make this approach work, PACE decided to include an additional challenge setting that, if selected, would enable the challenge team to receive the entire budget for Fund 10 and distribute it among the seven categories necessary to manage the Cardano treasure. Due to the fact that this is an umbrella challenge above the challenge categories, I consider it to fulfil Cardano's mission and the four strategic goals for the next fund.\n", "q0r": 5, "q1": "The best way to assess the feasibility of this challenge is to examine the feasibility of each of the categories that comprise it individually. After having done this, and having read the supporting documentation provided by PACE, I can confirm that the community is capable of addressing each of the categories that comprise the challenge independently. In order to define the budget for all of the categories that make up this challenge, PACE presented a well-documented methodology not only outlining the pros and cons, but also giving the Catalyst and Cardano communities an opportunity to participate in the discussions. Additionally, there was a voting phase in which users assigned a percentage accumulating to a total of 100% among the seven proposed categories. From my perspective, the Cardano Contributors category should have been given greater weight. However, since this is all a part of a big experiment, I do not mind that these are the results of voting, and then we will evaluate the data for the next fund.", "q1r": 5, "q2": "Having assessed the verifiability of all of the challenge categories, I must recognize the noteworthy level of effort put forth by the team that prepared these proposals, both in terms of their efforts, but also in terms of their knowledge of Cardano and the Catalyst ecosystem, as well as their strategic vision for where we want to go. Consequently, the metrics presented are intended to serve as a guide for future proposal authors, but due to their characteristics of not being exhaustive or restrictive, they are capable of enabling teams to create metrics that are on the one hand in line with the broad approach of the category and on the other hand, allow them to express their impact more clearly. It would be a general recommendation that I would make to the team that like any hypothesis, it is critical for the community to understand the evaluation criteria that will enable us to determine whether the experiment was successful or not. In this way, we will be able to learn quickly and pivot if necessary.", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 607, "q0": "This challenge proposal is something that has been discussed by the community for a few Funds already. It has been originally proposed by George Lovegrove, from PACE, which is the submitter of this challenge proposal. The idea is to have defined categories that would allow submission of all proposals based on different areas, for example, Community & Outreach, Products & Integrations, Governance & Identity, etc. These categories have been discussed with community and the budget distributed was voted for during the first half of Fund9. Since this proposal allows space for all the different proposals to be submitted in any Fund, and it covers basically all areas that have been covered in Catalyst so far, it matches all the goals of Cardano’s mission for Fund10, for example: Catalyst and Cardano contributors would allow people to continue contributing with the ecosystem and to increase their impact; Development & Infrastructure will attract developers and has the potential to help building Cardano open-source tools; Products & Integrations allows building real-world solutions on top of Cardano and many different categories could help improving Catalyst’s human processes. It’s a very broad challenge and I see it could be a good experiment to have it for one Fund and check the outcome. And the ask for the whole Fund budget is aligned with what was proposed in the challenge proposal. I believe the alignment of this Challenge with Cardano’s mission is very high.", "q0r": 5, "q1": "As mentioned, this challenge proposals intends to cover all aspects that already covered by other challenges that are present in Catalyst for several funds, with the difference of having pre-determined definition of the challenges and their budget, discussed by the community. So, I don’t see any big risks related to the community being able to submit valuable proposals in this challenge and making a success out of it. The only risks, I’d say, are related to the Catalyst and Cardano Contributors categories. Since it would be the first time that these categories would be included in the process, and since the proposals of these challenge would actually be candidates to receive funding and increase their contribution to Catalyst, and not regular proposals, I believe there might be some nuances related to these categories that are yet not known and could make its execution more difficult than we foresee. I would have expected lower budgets for these challenges since it’s their first time. Besides this, for all other categories, I believe the budgets are appropriate and I don’t see any reason for them to failure. I believe the feasibility of this challenge proposal is high.", "q1r": 4, "q2": "The verifiability of the categories proposed are related to the other categories that have been submitted here. I have checked all the other categories and assessed their verifiability individually, and the average verifiability that I’ve given to them was 4. But I believe some KPIs should be added to this challenge proposal as well, related to both the scope and the budget distribution of these categories. The proposer should add ways to receive feedback from the community, and to track the ratio between high-quality proposal submitted in each challenge and the budget of each challenge so adjustments could be made for the following funds for a better general outcome. Taking these two points of view into consideration, I believe the verifiability of this challenge proposal is ok. ", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 4, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 138, "q0": "This challenge setting has a different concept from the others, so it is necessary to make a different reflection assessment.\n\nThe concept that we currently have in Challenge Setting started at Fund3, when IOG started to delegate the decision-making power for allocating resources to the community, since then the community has had more decision-making power in choosing the themes of the challenges, but despite the distribution of power and greater autonomy of the community as a whole, some problems arose in the process. We had some cases where challenges with similar themes or with a large area of ​​overlap were funded at the same time and cases where challenges considered essential for the Cardano mission were momentarily out of funds, an example occurred in F7, when the \"Developer Ecosystem\" challenge was not funded and the budget available for projects related to the developer ecosystem was greatly reduced in relation to the total budget of F7.\n\nThe problems above illustrate a recurring problem and still without an apparent solution, the lack of coordination among the community makes the choice of challenges not optimized.\n\nThe concept presented in this challenge setting aims to solve the problems I mentioned and make the process more organized and articulated.\n\nFunding Categories bring an approach where the community discusses and votes on the distribution of resources from a Fund previously, this makes niches have their budget modulated according to the weighted demand of the community through a voting step, this process prevents niches from being without resources and brings more predictability to the proposers, who do not have to deal with the uncertainty that the challenges of interest to them will not be funded.\n\nThe Funding Categories Full Fund encompasses seven categories that were previously discussed and had their budgets decided by vote.\n\nCommunity & Outreach - 1,800,000 ADA\nProducts & Integrations - 3,000,000 ADA\nGovernance & Identity - 2,000,000 ADA\nDevelopment & Infrastructure - 2,925,000 ADA\nNurturing Ideas & Teams - 1,000,000 ADA\nCatalyst Contributors - 1,100,000 ADA\nCardano Contributors - 975,000 ADA\n\nConsidering the defined categories, this challenge setting is aligned with the 4 Catalyst Fund9 Challenge Setting Strategic Goals, therefore it is a critical challenge in the Cardano mission.\n\nA final observation is that the budget of this challenge setting is equivalent to all available budget, this is not necessarily positive or negative, it is a different concept but totally inclusive because the seven categories established are enough to receive proposals from different concepts, it will be up to the voters to decide whether this new concept must be funded or not.", "q0r": 5, "q1": "The nature and purpose of Funding Categories is to offer themes with a broader scope than currently exist in the current Challenges, so the Cardano community should have no problem creating proposals in number and quality.\n\nThe budget for each of the seven categories went through a community vote, where just over 50 people voted for a distribution of funds between the categories. Despite an apparently small number of participants, it is important to note that the number of unique wallets that voted in the Fund 8 Challenges decision was around 150 per challenge, so it is not such a big difference if we think about the size of the Cardano community .\n\nThe seven themes defined for Funding Categories were thought in the context of Catalyst and there are solid arguments to support the division of the categories. The defined categories also show the objective of giving continuity to the works that the community has been developing, so it is not to be expected a rupture in the resources of the proposals that are already under development or of the proposals that will be submitted in case the Funding Categories is chosen.\n\nOn account of the points mentioned, I believe that the challenge is completely feasible.", "q1r": 5, "q2": "Due to the fact that Funding Categories have broader scopes/themes, verifiability can be more difficult, however, by checking the links/docs provided it is possible to see that Funding Categories establishes several definitions of success and key metrics according to each of the 7 categories. The success definitions and key metrics chosen were well articulated to capture the outcome of the challenges/categories in an objective and appropriate manner for the new concept. My only caveat would be to include an element of success definition over time/key temporal metrics, in order to assess the outcome of the categories over time.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 17, "ne": 6, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 3259, "q0": "To get your hands around this proposal, you have to understand some of the work behind a community movement to shift the challenge setting paradigm.  This shift has been researched and designed primarily by George Lovegrove (pace) with a healthy dose of community involvement, from meetings (more than you could count), research (the links in the proposal are only the tip of the iceberg,) and even voting on parameters (56 community members voted to set the budgets for the categories).\n\nThis shift in the challenge setting moves from a more distributed, self-organized structure, which has inefficiencies regarding costs, organization and clarity (but high levels of autonomy) to a more centralized structure which reduces waste and creates clearer structures, but does so at the cost of the personal agency of the community.\n\nWhere this particular proposal highlights issues surrounding this, is in the inclusion of two \"Contributor\" treasuries which are side treasuries for members of the community.  While the roles are relatively well defined, the governance parameters for such side treasuries is a list of 7 bullet points, which is tremendously risky and is leaning into \"leaders\" to make decisions for it.  The issue this points out for this proposal is that whenever these organized hierarchies are defined, you often lose the ability to parse things in a more granular fashion, which can be a good trade if what you get in return is efficiency and optimization, but a bad thing if you want undiscovered innovation from the far edges of the treasury ecosystem.\n\nBecause this strategic pivot in challenge setting/categorization provides ample evidence and community research regarding its benefits, but also because it is lacks critical insight into its own methods and the benefits of its alternative, I find that I can neither agree nor disagree with its premises for why voters should support it.  A rating of 3 stars.", "q0r": 3, "q1": "As noted above, by combining all of the (pace) principles around categorization and contributors into one proposal for all the funds, there are too many places where the risks related to errors or oversights (or bias) would be inescapable.  While I personally feel there is a time and a place for high level organization, what I know is that such times are limited in scope, and the graceful end of such structures should be as much of a consideration as their beginnings.  I don't see that kind of thinking here.\n\nBesides lacking treasury governance for the side treasuries (which puts $2.075m at extreme levels of risk) there are undiscussed gaps in the conceptual framework around the categories that may indicate issues.  An example is whether the hyper innovative proposal that doesn't really have a category that fits (and remember, innovation by its nature defies categorization) should submit under \"Products\" (described as a catch all), or \"Nurturing\" (also described as a catchall).   While redundancy is a necessary quality of resilient systems, it is also inefficient.  Which principle are we to follow in adopting this pivot?  If both, why pivot, since we have this kind of play-it-by-ear structure in place already?\n\nIn terms of the research, documentation and participation, I do believe that the work behind this strategic pivot is exemplary as an example of how the community can approach their own self-organization, regardless of how it culminates.  On that topic of self-organization, there is a major risk in this proposal worth considering:  if it were to be funded, you would need to immediately organize a huge swath of the community to replace the roles of challenge team members across the entire fund.  While some portion of that could be drawn from supporters of this pivot, and another percentage could be drawn from proposers of other, similar challenges, there is no way to know if this would be adequate or if it would be underresourced.  On that same note, there is no suggestion of the risks concurrent with having essentially two rewards pools dedicated to funding these teams and how that would be handled.\n\nBecause the team has done a tremendous amount of good work to prepare and design these categories, but also because problems related to the non-iterative nature of this whole-fund pivot are already starting to show, I don't feel I can gauge just how feasible of an undertaking this will be for the community.  3 stars.", "q1r": 3, "q2": "This rating essentially relates to analyzing the metrics of all the underlying category proposals, where there is a broad swath of pros and cons.  I intend to discuss those fully under each of the specific category proposals, as it is too much to cover in one section here.  What I will address here is a high level view of this concept of measurability and achieving success in the Catalyst ecosystem.\n\nThere is a spectrum in decisionmaking that can be described thus:  simple (clear parameters), complicated (many simple things), complex (unclear parameters), chaos (many unclear parameters).\n\nChaos is damaging, and can limit participation, but everything has its roots in that flux.  There is a need to both embrace the nature of chaos, while also finding the patterns and networks that allow for goal-directed action and decisions.  To the degree that such decisions are not stochastic (random), this is the nature of complex systems thinking.  It is the skill to use the compass rather than the map, and this is where Catalyst exists right now, on the high seas of chaos, but with a sail, a rudder and a northstar, if she chooses to use them.\n\nBut inside the scope of this systems thinking, in order to participate, in order to make decisions that we believe matter, we have to discover parameters and let discovery and data inform our next steps.  This process delimits the chaos around us to a subset about which we can make decisions (creates simple, if sometimes complicated, situations that we can get our minds around).  In other words, decisions don't get made in complex situations, they get made when we can make complex things simple, even if things go right back to being complex again.  This give and take is a balance that is discovered through the process of challenge setting, and when we see oversights, mistakes or even attacks (chaos), we feel the need to simplify and, if it resists, we are tempted to try and exert control.\n\nMore than any specific category within this challenge setting pivot, this whole-fund proposal puts this balance of control-through-simplicity and complexity-bordering-on-chaos to the voters, and that is as simple as I can make this complex decision.  3 stars for verifiability, and it is in the voters hands.", "q2r": 3, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13873, "q0": "This fund 10 challenge setting proposal presentation by the team from PACE provides a unique and breathtaking new opportunity for the transformation of the challenge setting component of Cardano Catalyst funding. The proposers provide a detailed and well explained concept, plan and rationale behind their idea to use a category funding system. I’m over simplifying here, but basically the proposal is requesting the entire Fund 10 budget to establish 7 funding categories that attempt to encompass all of the Cardano focus areas to consider. The funding per category was then put towards a community vote, with the ADA budget amounts per category visible in the proposal.  I’ll delve into the proposal and specific category details through the application of some of the challenges setting strategic goals below.\n\nThe first challenge setting strategic goals asks whether the challenge will prepare people willing to contribute to the ecosystem. This proposal clearly achieves that aspect, within three of the categories the team have identified there are clear opportunities to fulfill this goal. The Cardano Contributors and Catalyst Contributors categories support payment of community members who help to manage, support and improve the Catalyst and Cardano ecosystems. The third category which supports this goal is the Community & Outreach, which basically describes how onboarding of new members, engaging partnership organizations and ongoing community collaborations can help the ecosystem. There will be other opportunities within some of the other funding categories proposed to prepare more people, however, I believe these three categories in themselves provide a broad enough scope to successfully accomplish this goal.\n\nAnother one of the strategic goals is to attract additional developers and ‘turn Cardano into an open-source project.’ Certain aspects contribute to this goal, within some degree, there are several categories that would support this goal, however, not a clear category assigned to open-source projects. The Development & Infrastructure as well as the Products & Integrations categories, interestingly voted the highest two categories (~46% of the pool together), would definitely encourage more projects and in turn more developers with such a large ‘prize pool.’ Proposals submitted within the Nurturing Ideas & Teams, listed as an experimental category, could also develop solutions to attract open-source projects and attract more developers. There is definite scope within these categories to satisfy this goal, one note, would be that future proposers would have to ‘market’ their proposal as open-source within one of the categories provided, having no specifically dedicated channel. As open-source is listed within this key goal, there would need to be a mechanism in place to remind the community of the value of these proposals.\n\nOne of the main strengths of this proposal in terms of the Cardano Catalyst strategic goals is that they plan categories that will create authentic solutions to problems using Cardano blockchain. There are two main categories listed in the proposal that address this goal, the Products & Integrations and The Development & Infrastructure categories. The development category aims to attract proposals with “research, tools or software (that) can improve the developer ecosystem or infrastructure to make it easier to build and scale on the Cardano blockchain.” While the products category aims to support developments and improvements with high impact and/or adoption of the Cardano ecosystem. Even if the products category doesn’t specifically mention blockchain in the introduction, it is dedicated to providing real-world solutions through the Cardano ecosystem. This goal can be clearly met through the category system suggested as this challenge setting proposal.\n\nOverall, I’m confident that this proposal has extremely clear alignment with the challenge setting strategic goals and in turn is critical to achieve Cardano’s mission. The categories have been clearly thought out and articulately defined. The only minor concern of note is that in this iteration there is still only a small proportion of community members voting on the budgetary weighting of the categories, this has considerably increased since Fund 8 (with only 19 voters) though. The proposers note though, in regards to the voting, “the intention for this in the future will be for Catalyst contributors to host a more wide reaching vote to include more of the community in future iterations.” I rate this proposal 5 stars for alignment for this challenging setting proposal that shows true initiative.\n", "q0r": 5, "q1": "Due to the nature of this all encompassing challenge with a wide scope of categories this challenge setting proposal is clearly feasible. Through analysis of many (not all!) of the proposals in Fund 9, and several from Fund 8, I’m convinced that nearly all would fit within these proposed categories. (Those that don’t are generally poorly written, or not effectively connected with Cardano or Catalyst, which is a specific requirement.) With the clearly defined supporting materials provided on their easy to navigate website, https://docs.catalystcontributors.org/catalyst-funding-categories/, all proposers would have the ability to write effective proposals within the Catalyst guidelines. This in turn would hopefully attract more proposers and the clear guidelines lead to more quality proposals to increase the overall competition.\n\nThe feasibility in terms of the budget provided is also achievable - they’ve asked for the whole lot! However, it’s not just a big lump sum or slush fund. Following from their initial attempt in Fund 8, where they only attracted 19 voters, they have more members of the community who have voted on the percentage of funding to be attached to each category. This pre-proposal community involvement is an excellent initiative for the challenge setting and proposers to see the current community priorities and develop their proposals based on this specific information. In turn, the budget will be allocated effectively to the areas the Cardano community identify as priorities for the upcoming round.\n\nConnected with the budgeting and overall cost of the proposal system, the team have put together an analysis of the overall categorisation cost. (https://docs.catalystcontributors.org/funding-categorisation-analysis/historical-analysis-and-comparisons/categorisation-overall-cost-comparison)  They analyse historical data from previous funds, and apply their methodology to possible future scenarios with different voter, proposal and PA numbers. I took a little time to investigate it, but honestly didn’t go to the level of detail of checking their calculations in the spreadsheet, but, the model of categories, without the challenge proposal and assessing stages to finance - Cardano does stand to save a significant proportion of each round’s ADA budget. This is a very worthy aspect to this proposal, and the simplicity of this implementation definitely contributes to my opinion about this project's feasibility.\n\nOverall, I strongly believe that this category system is highly adaptable and will allow the Catalyst community to address the challenge. I rate it 5 stars for feasibility. \n", "q1r": 5, "q2": "The proposal and the team behind it have put clear thought and explanations into the possible success criteria for the challenge. Since there are separate categories, each will have its own suggested criteria. The team wants to make it only suggested, as a supportive resource as they state ‘goal or objective setting… is better suited as an independent process.’ Upon browsing the detailed resources on their catalystcontributors.org site, each category has 3-5 suggestions of broadly framed metrics that could be used to track success. The team should be congratulated on this level of detail, consistency and adaptability of their resources for the future proposers.\n\nOverall, the main measure of success will be the increase in number and quality of proposals attracted to the Catalyst Funding rounds. Having an open category system may mean an onslaught of average proposals just thrown in, or perhaps speciality niche proposals with high impact that have never found a place to shine before can be shared? The success of this category system will be based on the willingness of proposers, PAs and voters to get behind it, read clearly the descriptions of each category and adhere to the categories within the scope of their proposals. This all-or-nothing approach as the proposers have referred to, is a mind shift for the community, but I believe it can be clearly verified and easily adapted or improved if needed in future rounds. \nOverall, I rate this proposal 5 stars for verifiability \n", "q2r": 5, "assessor": "z_assessor_3840", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Challenge settings are not effective for funding categorisation. Funding categories offers a simpler, more effective & scalable solution.", "success": "Increasing the effectiveness of funding categorisation so that the most promising proposals can be submitted that provide the highest impact"}