{"id": 414641, "author": "emeliasarfo2", "title": "NPOs/NGOs Integration & Solution", "url": "https://cardano.ideascale.com/a/dtd/414641-48088", "category": 26604, "amount": 350000, "description": "How can NPOs/NGOs optimize Cardano for project management, reporting, M&E and income generation for project implementation to transform more lives?\nNPOs /NGOs are the drivers of development in Africa", "f6_no_assessments": 9, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 139, "q0": "This challenge setting aims to stimulate the development of solutions for NGOs and NPOs on the Cardano blockchain. Non-governmental organizations in theory could benefit from decentralized governance structures on blockchains like DAOs. DAOs are one of the most discussed models to serve as an evolution of centralized systems of governance. This point could be included in the challenge setting as a use case, since none were mentioned.\n\nThere is an interesting concept presented in this challenge setting, but I believe it has been little explored. Examples of NGOs/NPOs could be mentioned to illustrate use cases. The challenge description could also have given more context to the problems faced by SPOs/NPOs to make it clearer how critical it would be for these organizations to adopt blockchain solutions. What are the bottlenecks/inefficiencies and reasons that make blockchains a suitable option?\n\nI believe that this challenge setting needs to demonstrate more clearly the potential to be explored on Cardano.\n\nThis challenge setting may be in line with items 3 and 4 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 3, "q1": "The concept of this challenge setting is not clear enough to indicate that the community will address this challenge. Not potential directions or suggested case uses to indicate how the community can address this challenge. The absence of details makes the feasibility of the community addressing the challenge uncertain.\n\nConsidering the possibility that I suggested of DAOs as tools for NPOs/NGOs, I believe that the community can address the challenge, but this needs to be mentioned more clearly, even so that the proposers who eventually create proposals in this challenge have direction and PAs have clear criteria on how to evaluate proposals in this challenge.", "q1r": 3, "q2": "The definition of success is too generic and could apply to many challenges, it lacks specificity in how the NPOs/NGOs theme will be addressed. In addition, there is no time period for evaluation of success.\n\nThe first two key metrics, as well as the last two are generic, lack more context and detail to understand how to apply them, lack of specificity.\n\n\"Number of countries engaged and making beneficial contributions to the ecosystem.\"\n\nIt is a key metric that would indicate quantity and geographic dispersion of solutions, which is a relevant indicator.\n\n\"Number of proposals from NPOs/NGOs for important income generating projects.\"\n\nIt is an indicator of demand for this challenge, which is relevant, but it is an indicator prior to funding, which does not say much about the outcome and success of the challenge after funding.\n\nFirst, I would recommend further detailing the rationale to justify the challenge setting, explaining the problems of NPOs/NGOs and how blockchain technology can improve the scenario, citing examples of use. Second, with an already clearer description I would recommend adding more key quantitative and qualitative metrics for defining success over amount x of time.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 608, "q0": "The goal of this challenge proposal is to fund Non-Profit Organizations and Non-Governamental Organization through Catalyst. The main rationale behind submission of this challenge proposal is that we could have Cardano as the go-to blockchain for NPOs/NGOs, instead of other blockchains. These organizations would have to use Cardano to leverage their services to the community. The scope of this proposal is very broad, but I can see it going into many different directions. NPOs/NGOs related to education could teach young developers about blockchain and Cardano. If the NPOs/NGOs can create real world applications on top of Cardano to help their communities, they will be directly addressing another goal of Cardano’s mission for Fund 10. In general, I believe this challenge proposal is very well aligned with Cardano’s mission and will be very beneficial to the ecosystem if delivered successfully.", "q0r": 5, "q1": "There have been a few proposals so far in Catalyst, as far as I know of, that were somehow connected to NPOs/NGOs. For this challenge proposal to be successful, it would be necessary to onboard NPOs/NGOs that are currently not in our ecosystem, which creates a new challenge for the success of this proposal. It is possible that there are already many people in the community that work with NPOs/NGOs, but since this information is not available, we cannot be sure. On the other hand, the budget set for this challenge proposal is not so high, so I believe it would be possible to fund a few proposals in this context, and if there are not enough proposals to be funded, the remaining budget would go to the leftovers. The challenge team for this challenge proposal has not been set yet, and the two proposers of the challenge are deeply involved in other projects in Africa, so I don’t know if they would be available to be in the challenge team. Ideally, the challenge team would have people who understand about NPOs/NGOs to be able not only to track the progress of the execution of the proposals, but also to provide some support and guidance.", "q1r": 3, "q2": "The KPIs presented in this challenge proposals to track its success are good, but there are some that are not so easy to track, for example: ‘Extent of Cardano and other blockchain education’, ‘Number of people that get to know cryptocurrency and blockchain technology’. The latter would be measurable, but tracking the real numbers is very difficult. I would include some metrics about how many NPOs/NGOs were onboarded to Catalyst, how many people were affected by the projects developed and other metrics that are more easily measured. Overall, I believe that the KPIs included are good to measure the success of this challenge proposal and its verifiability is very good.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 851, "q0": "The operation of NPOs/NGOs organizations can be enhanced through leveraging the features of the blockchain. Personally I have been in several organizations in the country where I reside and they always seem to be the same problems. Donors tend to be concerned about outcomes, impact stories, budgets, program outputs, among others. In the end, it is trust and transparency that tend to be the recurring problems. This is why I believe that by incorporating the benefits of using a blockchain like Cardano, it would give us on the one hand the possibility to enter a growing market. Why? In addition to the rising number of companies dedicating parts of their budget to corporate social responsibility (some by their own choice, others by legislation or tax interests), there is also the possibility that the impact of these organizations can be enhanced by resolving trust and transparency issues. From my previous arguments I can affirm that the objective of this challenge is aligned with Cardano's mission, as well as fulfills at least two of the four strategic goals we have for the next fund.", "q0r": 5, "q1": "Cardano in general and the Catalyst community in particular are known for their high social sense, as evidenced by the proposals that have been approved for allocation of funds to improve conditions in communities in Africa, educate vulnerable populations, and in a variety of SPOs that donate part of their profits to NPOs and projects like the WMT that are the perfect intersection of social and financial objectives. The reason I mention this is that I believe that the community would respond positively if this challenge were selected. It appears that the amount selected is a bit high, however, I do not consider it to be a problem. I would like to mention, although I will not consider it in my score, that this challenge competes with at least two other challenges with relatively similar topics, I mean social, environmental and sustainability education topics. If there is a previous organization, and a challenge setting is presented that concentrates all these social causes, on the one hand, it would have greater chances of being selected, and also there would be an additional security to the community that they would not be distributing the community treasure in an inefficient way.   ", "q1r": 4, "q2": "Success is described very generically and subjectively, as it could be applied to any other challenge in Catalyst. Provide a more specific description to understand the long-term impact of this challenge. Regarding the success metrics, there is a good combination between metrics that seek to measure the performance of the challenge itself, for example, \"Number of proposals from NPOs /NGOs for important income generating projects\" with others that could serve as a guide for future proposers, for example, \"Number of Communities impacted\". However, there are others that are difficult to measure. Also included within the challenge brief section are some examples of proposals that serve as potential directions to expect in the proposals contained within this challenge.  \n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1770, "q0": "Proposals for this challenge are expected to target non profit organizations or non governmental organizations (to facilitate management, processes).\nThe objective is not very well defined. For example, successes like \"more people engaged in Cardano\" or \"Cardano becomes the best Crypto\" are very generic.\nThe challenge note recalls the lack of funding that NPOs/NGOs suffer from, but does not list their relevant use cases that would need funds.\nEven if this purpose is important, this challenge setting proposal does not explain how it aligns with a least one of Fund10 Strategic goals.", "q0r": 1, "q1": "I do not see any reason why community members should not be able to make proposals in this challenge, whose only criteria is to target a NPO/NGO use case or foster NPO/NGO engagement. What I am missing in the challenge setting proposal to rate feasibility at higher score is examples of use cases, or potential directions that proposer could take.", "q1r": 3, "q2": "The definition of the challenge is precise enough so that the community will know if a proposal fits in or not. Metrics like Numbers of communities impacted of number of proposals from NPOs NGOs are measures for the impact of this challenge. However the brief lacks details about how impact of proposals will be measured and compared. I suggest including in the challenge setting proposals some indicators or criteria to be met, that will drive the competition and enable impact assessment of the proposals.", "q2r": 3, "assessor": "z_assessor_2264", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3260, "q0": "Like many challenge settings that are generally about new adoption and outreach sectors, this proposal has decent, if rarely explicit, alignment with a couple of Fund 10 goals related to improving user experience (#4) and preparing people to contribute (#1).  Where this proposal is able to increase its alignment, it is with the idea of Real World Solutions (Goal #3).  Again, this is mostly implicit, and drawn from the idea that these NGOs and NPOs are almost always working on Impact issues or SDG issues, which typically address issues and problems \"in the real world\".\n\nThe issue I have is that these alignments are all implicit, and thus not totally clear (and in the case of NPOs that aren't working on real world problems, not aligned at all, yet still covered under this umbrella).  Because the alignment is present, and can be sussed out with enough careful reading, but because it was not addressed in a clear way, I am downgrading the alignment score by one star.  4 Stars for Alignment.", "q0r": 4, "q1": "The only place I found the kind of support and guidance needed to help proposers orient themselves within the proposal was in the final sentence of the Challenge Brief, where it gives broad examples of the kinds of proposals and ideas that would fall under this challenge.  This is just barely adequate in my opinion.  I would recommend that the team include a section with these broad types, and include more specific subtypes, including approaches that go beyond onboarding the NGOs and their needs, and addresses support for builders of those specific connection or the bridges they get carried out on.  Additionally, adding in possible avenues to pursue provides inspiration and guidance for proposers as well.\n\nThe budget is suitable in the sense that this is a sector with usually large funding needs (of the 3 NGO projects I have spotted so far in Fund 9, the average budget ask is ~$90k) so too small of a budget would severely limit participation.  On the other hand, too large of a budget for an experimental category with no track record would face real risk of not being funded, so I feel they have balanced this reasonably well.\n\nBecause there is a reasonable budget and a small amount of support for proposers to orient themselves to the challenge, I feel that there is a sound basis here, but without more specific details I don't believe that proposers will have enough guidance to effectively bring ideas into alignment with the Fund 10 goals, so 3 stars for Feasibility.", "q1r": 3, "q2": "I really don't know what to make of the provided KPIs.  There is only one which is directly linked to the idea behind the proposal (a classic \"count'emup\" metric for number of proposals from NGOs) and it measures the Challenge setting rather than provide guidance to proposers on how to set their objectives.  The rest only obliquely touch on NGO adoption and impact, usually based on assumptions around an NGO/NPO's influential role in a community (which isn't always the case...some valuable impact organizations are running counter to their communities (knowledge dissonance) and would have a hard time driving adoption to other ecosystems...and these instances may need support more than most).\n\nWhat needs to be included here are metrics that would be useful to proposers who are trying to describe objectives and goals that are actionable and attainable, i.e. KPIs of how proposers can find and show successful alignment with the goals of a fund.\n\nBecause the provided metrics are not suitable for proposers and won't help them evaluate their objectives, I am afraid I have to give a very low score for verifiability. I do believe there is something to work with here, and that the existing KPIs with some reworking could measure up, so I would give 2 stars for Verifiability given their current state.", "q2r": 2, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3354, "q0": "Given the information in this challenge setting proposal, I don’t think that this proposal fully addresses any of the strategic goals for fund 9. Firstly, the proposal doesn’t address the first strategic goal (prepare a group of people to make contributions to the Cardano blockchain) because the plan for the challenge setting is to distribute funds to NGOs and NPOs, but it provides no guidance for how those NGOs or NPOs could actually make an impact on the Cardano blockchain. There are no guidelines or recommendations for future proposers, except for generalized outcomes, such as “Cardano becomes the best crypto” or “more people engaged in Cardano.” The “Why is it important” section of the proposal states that NPOs can “scale up Cardano and Project Catalyst through the numerous projects that are funded by major organizations.” But isn’t the point of Catalyst to propose projects/ideas for funding? What is the point if the NGOs already have funding? Why would they need to come to Catalyst then? The proposer could have included more info about this in order to address the first strategic goal. \n\nThe proposal does not address the second strategic goal (build an open-source ecosystem and attract developers) because it makes no mention of encouraging proposers to make open-source software or other ideas. I do see how the challenge setting could potentially attract new developers since NGOs can hire developers to build their ideas, but the first part of the strategic goal was not addressed. \n\nThe proposal sort of addresses the third strategic goal (build real-world solutions on the Cardano blockchain). The challenge setting says that NGOs can use the Cardano blockchain to improve transparency, hold attendance sheets, and report publications. These solutions are real-world, but I feel like there could be more elaboration here. What are some other ways NGOs can build real-world solutions on Cardano? Are NGOs going to be using the blockchain to provide financial services to people? Can NGOs use the blockchain in their work to change the lives of people outside of the blockchain?\n\nThe proposal does not address the fourth strategic goal (improve tooling to support human processes in Catalyst). There is no mention of how this challenge setting could help improve human processes in Catalyst. How exactly would the NGOs improve Catalyst? Since the proposers did not address many of the strategic goals for fund 9 challenge settings, I can only give this proposal a score of 1 for alignment (score given: 1)\n", "q0r": 1, "q1": "Based on my knowledge of Cardano and Catalyst, I think that the Cardano community could address this challenge setting. I am sure that there are NGOs and NPOs who would love the funding to build some of their ideas on the Cardano blockchain, but are these groups already within the Cardano community? How many NGOs are actively in the Cardano blockchain and have been seeking funding for months or years? It is very hard for me to say that the Cardano community can address this challenge when it is targeted at a very small percentage of the Cardano community (NGOs) and the proposers provided no insight into how many NGOs are in the Cardano ecosystem that could address this challenge setting. \n\nGiven the scope of the proposal, I think that the budget of 350,000 ADA makes sense because it is a smaller challenge with a smaller target proposer audience. I think that quite a few NGOs could receive funding through this challenge setting, which would help them with whatever their goals are. Since very little information was provided about the number of NGOs, I can only give this proposal a score of 3. (score given: 3)\n", "q1r": 3, "q2": "Based on the information provided, I do not think that this proposal is well scoped in defining the measures of success for its focus area. The main reason for my conclusion is that I feel there is a disconnect between the metrics given and the other information provided in the challenge setting proposal. If NGOs are using the Cardano blockchain for transparency, accounting and reporting, project management, etc (as mentioned at the bottom of the proposal), how are they able to meet any of the metrics of success, such as “number of countries engaged and making beneficial contributions to the ecosystem?” How is the “extent of Cardano and other blockchain education” related to the work of any NGO? Are there any examples of NGOs teaching people about Cardano? If the proposers provided more metrics of success that are more relevantly connected to project ideas, or had they provided different NGO project ideas that matched the metrics of success given, it would have greatly strengthened the challenge setting. Since I was unable to make a good connection between the focus area (NGOs building their own internal solutions on the blockchain) and the metrics of success given, I can only give this proposal a score of 1. (score given: 1)", "q2r": 1, "assessor": "z_assessor_2457", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6313, "q0": "The NPOs/NGOs can benefit by accepting cryptocurrency as donations. These benefits can be tax advantages to the donors, easy donation from anywhere in the world to anyplace, anonymity, and appeal to the young audience. The NPOs/NGOs can also use blockchain-based solutions for grant transparency, accounting & reporting, project management, etc. In the case of charities being distributed to individuals across borders in other countries, NPOs/NGOs can utilize the blockchain to ensure the funds reach the deserving candidates without falling into the wrong hands. \n \nThis challenge may help bring in willing and able people to contribute to the Cardano ecosystem. This contribution can happen if the Not for Profit organization are like the ‘Linux foundation’ and consists of developers making the tools, platforms, and DApps. If the NPOs are like Linux, we can expect them to be open source. Apart from this, this challenge can help with the outreach as it will expose the NPOs/NGOs, their donors, benefactors, and communities to the Cardano ecosystem. \n \nThere is room for improvement in the challenge. The author could have better explained the need for a separate challenge for this cause. As we can see in the last fund, many proposals related to this category are submitted under Nation Building DApps and Miscellaneous challenges, and one of them got funding. Hence I am rating four stars for this challenge.", "q0r": 4, "q1": "As we can see from the past funds, some proposals addressing the NPOs/NGOs issues were submitted by the community, thus proving that the community can address this challenge. But I am skeptical about the number of proposals this challenge will attract as I can hardly see around five proposals in the last fund. \n \nMaybe If we have a specific challenge, we will see more proposals concerning NPOs/NGOs.\nThis type of challenge concerning NPOs/NGOs was not funded earlier by the Catalyst. So there is a lack of a challenge team for this challenge. Moreover, no other details of the challenge team are mentioned here.\n", "q1r": 4, "q2": "Several metrics are mentioned in the challenge that can be considered to measure the impact/success of the challenge and also to track the success of the proposals. However, there is a scope for improvement in metrics. If the author could have separated the challenge metrics from the proposals’ metrics, it would have helped.\n \nThe proposals’ metrics can be based on the type of NPOs/NGOs. If they are related to developing tools or DApps, the metrics can be GitHub commits, achievements of milestones, etc. If they are about serving the communities of people, the metrics can be the number of people who benefited and the number of people onboarded into the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10368, "q0": "NPOs/NGOs are large organizations that receive support from people around the world. These organizations often provide benefits and support to the community. Projects of NPOs/NGOs have always been approved by the community but budget is still a difficult issue for NPOs/NGOs. If Cardano can encourage and fund the projects of NPOs/NGOs, this will help the community change their view about Cardano ecosystem and will more easily accept Cardano. This will help Cardano grow stronger.", "q0r": 5, "q1": "This challenge is possible to do. Cardano's direction is not only to expand and grow its ecosystem, but also to bring global benefits. Therefore, the funding of projects of NPOs/NGOs is in line with the Cardano orientation. I believe the Cardano community will also be very supportive of this. Especially in developing countries with large populations, they really need help from the projects of NPOs/NGOs and the Cardano community.", "q1r": 4, "q2": "There are some key metrics to measure the challenge “NPOs/NGOs Integration & Solution”. We can measure the project through number of people knowing cryptocurrency and blockchain technology. We also base on extent of Cardano and other blockchain education. Furthermore, we can base number of countries engaged and making beneficial contributions to the ecosystem. Besides, we can base on number of proposals from NPOs /NGOs, number of communities engaging and number of developers and dapps. All these metrics are good metrics for measuring the progress.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11691, "q0": "the challenge proposed is certainly aligned with cardano's mission and strategic fund goals, especially goals 1 and 3. NPOs and NGOs are generally providing services for social good and I agree with the proposer here, where they are generally underappreciated and underserved in developing countries, coming from a third world country myself.  i believe that if cardano can help provide them resources and system to flourish, these will be the seeds to be nurturing the growth of the cardano community in the coming years. the challenge team was kind to provide example use cases to readers, in case it is not clear to proposers in the future, and i can see clearly the big picture of what this challenge aims to achieve. ", "q0r": 5, "q1": "with the current dapps and tools being built on cardano and the work being done by IO, emurgo, and the foundation, many of the tools and learning being executed in the africa region can be aligned to the vision of the challenge team stated out here. mostly, the use cases on transparency and auditability will be a quick win. that said, knowing that these solutions are already actively being worked on in one way or another by the cardano community, i can see them coming along and contributing more manpower to drive this challenge forward, making this challenge a feasible one. for a start, i am not aware if this challenge has been proposed in previous funds and the history of this initiative, but the asking amount of 350k ADA seems reasonable, given the incentive for ideas can vary wildly from country specific levels to almost a global level. it provides headroom for large and bolder proposals to take part in this challenge.", "q1r": 5, "q2": "my reservations for this proposal only comes from this section, on addressing the verifiability of the challenge. While the proposer is setting a good context in the challenge brief, I see it falling short on conveying what success looks like and relating them back to the measures and key metrics. in the proposal here, it only states high level vague words, like more communities, more developers, more people engaged, which is fine but not specific enough, considering the context of the entire given proposal here was about NGOs and NPOs. i mean, there was this line \"Cardano becomes the best crypto\"... it would help if they can narrow this back down to the context of NGOs and NPOs. for the measures specifically, they stated mostly quantifiable measures which are good guiding points for future proposers to adhere to. 2 points here i would like more clarity on would be:\n1. \"Number of people that get to know cryptocurrency and blockchain technology\" - how do they intend to measure that? it may be a problem for proposers to address, but the challenge setting could be more clear, perhaps the number of employees within the impacted organizations, etc.\n2. \"Extent of Cardano and other blockchain education\" - this needs to be quantifiable as well. how do proposers measure the extent of cardano education?\n\nit will be helpful if more specifics and details could be provided", "q2r": 2, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "NPOs in developing countries can scale up Cardano and project catalyst through the numerous projects that are funded by major organizations.", "success": "\nMore people engaged in Cardano\nCardano becomes the best crypto\nMore physical project changing lives\nMore communities\nMore developers\nWallets\n"}