{"id": 414858, "author": "zakariam.munir", "title": "Cardano and Agriculture", "url": "https://cardano.ideascale.com/a/dtd/414858-48088", "category": 26604, "amount": 800000, "description": "What are the potential issues in the Agri-food industry that could be addressed using the Cardano blockchain technology?", "f6_no_assessments": 12, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 6660, "q0": "Let’s see if this challenge has the capacity to deliver on of the strategic goals from Fund 9. So we continue by turning the four strategic goals into fundamental  questions and trying to come up with decent answers. \n\nCan this challenge help prepare a group of people willing and able to make contributions to the ecosystem? \n\nSo my take on this is that agriculture can greatly benefit from blockchain applications, but only after critical technologies have already been implemented in sectors where scalability and concrete results arrive faster, perhaps healthcare or global distribution chains.  \n\nCan this challenge turn Cardano into an open source project and attract developers? Again, this is a mixed bag, since there aren’t very strong connections between developers and the agriculture sector, especially when focusing exclusively on the open source projects. Of course, anecdotic examples can definitely show up here or there, but lacking any evidence of widespread synergies between these two sectors I have to argue that an agriculture challenge is unlikely to attract significant numbers of developers into the ecosystem. \n\nCan this challenge help build real-world solutions based on the Cardano? Absolutely, since there aren’t many other sectors getting as real as agriculture does. But what kind of solutions can there be? Are we, as a community, ready to target the average 5 acre farmer and offer solutions for him? I would argue that we can’t just yet, not without risking loss of keys, funds or the need to interact with complicated web applications. We are also still lacking the basic decentralized infrastructure to target the small farmers. DIDs through Atala Prism are still some time away. And so are payments through Coti Pay for instance. And so are user-friendly wallets. And so are open communication systems. Let’s give more time to World Mobile - like technologies to flourish first. So while Cardano agriculture solutions are a beautiful idea. I find it unlikely to create a significant impact, simply because we’re not there yet in terms of supporting infrastructure. \n \nCan this challenge improve tooling to support human processes in Catalyst? Unlikely, and due to the rather obvious lack of connection between the two subjects I won’t go into additional explanations. \n\nSo while agriculture solutions on the blockchain might seem like a tempting value proposition, I think we are still too early for them and I am only offering three stars for alignment with the strategic goals. ", "q0r": 3, "q1": "Can the Cardano community address this challenge? I have mixed feelings on whether there is enough capacity to fill the challenge with healthy competition, let’s say 3x its budget. While Fund 9 definitely has a few proposals directly (Algae Rhythm, CO2 capture unit, sustainability index) or indirectly (CH2O Africa) connected to the agriculture sector, I am not sure whether a fully fledged ecosystem already exists to tap into this potentia just yet. If you think about it, agriculture is not the easiest sector to disrupt: it’s at the mercy of the weather in most of the years, progress takes sometimes years to show up due to growth cycles, huge disparities of technological use between countries, vast areas to cover and challenging infrastructure development to name only a few of these headwinds.  \n\nIs the budget realistic and reflecting the requirements of the challenge? I have searched high and low throughout the Fund 8 and 9 proposals to find evidence of potential within the agriculture sector. And there are indeed a number of agriculture related proposals, under ten. A few unsuccessful, four voted four but only two funded so far (supply chain, agriculture and metaverse). So there is at least some potential, but I feel that perhaps a 500k amount would have been a better choice. \n\nIn conclusion, there are some indications that the Cardano community can address this challenge and the budget is fairly feasible, albeit we are unlikely to see strong and healthy levels of competition within the challenge, so four stars.     ", "q1r": 4, "q2": "To assess the challenge’s verifiability, we go one more time through the process of turning the verifiability statement from the guide into a fundamental question and try to answer it, and this is where it leads us:  \n\n(1) Is the challenge well scoped in defining the measures of success? \nI dare to say that not quite, and unfortunately this is the case for many challenge proposals. When defining success metrics and targets one has to pay particular attention to their capacity to be “operationalized”, meaning translated from words into useful, relevant and measurable metrics. Here, success is defined as “creating a healthy and transparent agricultural chain which will go down in favor of the production, supply and consumer chains”. I find the terminology rather unfortunate and I will only point out to a few flaws, trying not to be very nit-picking: \n\n- A few terminology items bundled together:(1) the circular reference of a chain which goes down in favor of another chain, (2) consumer chain: perhaps distribution chain more appropriate? And (3) going down in favor will be again difficult to translate to a more useful term\n- it will be challenging to measure the “health” of an ecosystem\n- a few of the following key metrics are very difficult to measure: physical markets (not clear what the term encompasses), producer satisfaction (producers hardly measure or are worried about their satisfaction, if such a thing can be applied to a business, decentralization (of what exactly?)\n\nI humbly offer a few alternative avenues to explore for future iterations: \n\n- measuring the strength of land rights for cadastral solutions (tools already exist and have been widely used to draw connections between how powerful land rights are within a country to the economic welfare of the population\n- measuring the length of the supply chain and the number of intermediaries when blockchain targets a certain crop (we can infer that a blockchain solution that minimizes the number of intermediaries interposed between small scale farmers and consumers will increase farmers’ margins or decrease end prices, all things equal)\n- identifying the emergence of new cross-cutting enablers (access to irrigation, lower transportation costs)\n- concrete new solutions of accessing capital\n- emergence of swarm-like behavior that increases resilience (risk sharing agreements like insurance type products, revenue sharing agreements, crowdsourced negotiated agreements with intermediaries down the value chain, etc.)\n\n(2) Can the challenge drive healthy competition between proposals? My take on this is rather grim again - since I don’t think there will be enough demand within the category to lead to an optimum level of competition, considering past examples and the quality of the proposals read by me so far. I would have rather started with a lower overall budget, and once a clear sign of healthy competition emerged - that would have been a perfect sign to increase the amounts for future financing rounds.\n\nConsidering all of the above, I have to maintain my neutral stance towards this challenge’s verifiability potential, so only three stars. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 142, "q0": "This challenge setting intends to resolve issues in the Agri-food industry that could be addressed using the Cardano blockchain technology, but there is no rationale in the challenge brief that explains the scenario of the agri-food industry or that serves as a context to inspire proposers.\n\nThe absence of a detailed rationale explaining the concept does not allow identifying how critical this challenge setting is in the Cardano mission.\n\nHow big is this market and where can Cardano serve this industry with better quality? What are the problems identified in the supply network today?\n\nBlockchains in general can help in verifying the origin of inputs and goods and this would fit the market in question, but it is important to describe the context in more detail.\n\nThe supply chain and agriculture theme is aligned with items 1 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals, but the lack of clarity in the description of this challenge setting makes it difficult to measure how critical the challenge setting is in the Cardano mission.", "q0r": 2, "q1": "There are several projects dedicated to solutions related to agriculture and supply chain, many have already submitted proposals on Catalyst related to this topic, but more information about the concept of the challenge is lacking in order to understand potential directions where the community can contribute. This uncertainty added to the $800,000 ADA budget makes the assessment of the community's feasibility and ability to address this challenge uncertain.\n\nI would recommend including potential directions where the community can develop, a more elaborate rationale in order to make the concept clearer and if possible cite projects related to the agro industry that are already being developed at Cardano and proposals related to this topic previously submitted on Catalyst .\n\nThere are people capable of creating solutions linked to supply chains on Cardano, but for greater precision in the evaluation, greater context is necessary.", "q1r": 2, "q2": "There is not enough clarity in the rationale of this challenge setting to allow us to understand how to assess the definition of success presented.\n\nThe key metrics indicate interesting properties for supply chains, but they are vague, they need more specificity so that they can be measured in a qualitative way. I also recommend a time frame to measure key metrics and definition of success over time.\n\ne.g.\n\nVolume of transactions related to applications developed in this challenge setting in 2023.\nNumber of applications developed in this challenge setting in 2023.\nNumber of countries where the solutions were applied in 2023", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 422, "q0": "this challenge proposal meets the assessment criteria well. the challenge will make great strides in introducing more people and development to the Cardano Blockchain, expand the open source utility of the network, build real-world solutions right at the heart of the global economy, and by its very nature build tooling to support human processes inside and outside of Cardano. \n\nI would have liked to see more language directed at developers and Dapps, but the challenge meets and exceeds the requirements for a 5-star alignment review.", "q0r": 5, "q1": "the catalyst community easily has the means and ability to create very successful projects under this challenge. there are in fact several agricultural-based projects in the Cardano ecosystem and it would be of great benefit to all to bring a greater diversity of ideas to the space. the budget of 800,000 ADA is a little lower than I would have used but sufficient to fund many high utility and output proposals, while not being so high that it damages the ability of the catalyst to fund other challenge settings for even greater impact.", "q1r": 5, "q2": "this challenge proposal is well suited to audibility and verifiability, with 8 metrics listed each of which can be used in a number of ways, it is, without doubt, a challenge proposal very well-suited to the verifiability metric. proposals under this challenge will have very wide-ranging and easily measured KPIs and a great deal of oversight friendly activity.", "q2r": 5, "assessor": "z_assessor_2082", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 612, "q0": "The goal of this challenge is to allow the submission of agriculture-related proposals. As mentioned, the agro industry has many problemas that could be solved by the usage of blockchain, and in many aspects, this is a sub-set a the supplychain and auditing issues that many other indutires also face. The agro industry is especially important in developing countries, located, for example, in South America, Asia and Africa. This would help to onboard and provide opportunities for community members from these places, and also for community members from other places to develop solutions to them. This challenge is very well aligned with Cardano’s mission for Fund 10, since it directly tackles the goal of building real-world solution based on the Cardano blockchain. In the past, there has been many proposals submitted in different challenge, especially the dApps & Integrations challenge, there were proposing to solve issues related to the agro industry, and if this challenge gets funded, it’s guaranteed that this sector will have at least some proposals funded and some solutions will be developed. The budget for the challenge, though, seem to be a bit high, but at the same time it wouldn’t be very cheap to develop real world solutions for agro and to integrate them with other parts of the process. Overall, I believe this challenge would have a good impact in the Cardano ecosystem.", "q0r": 4, "q1": "As mentioned previously, there has been many proposal submited in other challenges, in the absence of a agro-focused challenge, that were aiming at solving some issues of the agro industry. The community is already prepared to submit proposals in this challenge, and there are also many other businesses being onboarded right now that could benefit from this challenge and bring value to the ecosystem. For example, big food and beverage companes, such as AB InBev, have been in touch with some community projects and are considering developing their blockchain solutions using the Cardano blockchain. Also, some other projects like DLT360 have been focusing on analyzing the risks and opportunities related to blockchain projects that focus on the agro industry. In my opinion, the community is capable of coming up with good proposals to be submitted in this challenge. As I mentioned previously, I believe the budget is quite high, but on the other hand this allows for higher budget proposals to be submitted and possibly succesfully delivered, increasding the value of this challenge. The challenge team is not yet defined, and this might cause some friction during the beginning of next fund.", "q1r": 4, "q2": "The metrics proposed to track the success of this proposal are good but not ideal, since some of them are very hard to properly measure, for example, information flow and transparency. Some other might be easier, such as customer and producer satisfaction, dApps and DAOs created. And there is one that’s not clear what it is: physical markets. I would suggest to include other KPIs that are easier to measure, for example, number of proposals that successfully delivered their products, number of businesses using the solutions developed on the challenge, number of different companies that were onboarded to Catalyst because of this challenge, saving related to the usage of the technology developed through this challenge, an other similar. Overall, I believe the verifiability of this proposal is ok, and it could be improved.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 4, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 1772, "q0": "This challenge setting proposal offers the community to explore agri-food industry issues and look for cardano-based solutions. Agri-food industry indeed faces important tracking and trust challenges, as food poisoning scandals raise in most countries. Trust and transparency are what blockchains are intented to bring, enabling the customer to check data about supply chains by him self for example.\nThis challenge setting proposal strongly aligns with Fund 10 strategic goal \"Build real-world solutions based on the Cardano blockchain\".", "q0r": 5, "q1": "Proposal in this challenge will require standard blockchain development skills that the community as already proved to gather. I have no doubt that the community will be able to partner with farmers or food companies to explore their specific issues and make good quality proposals. \nThe 800k USD budget seems a little high for a first execution of this challenge when compared to other challenges.", "q1r": 5, "q2": "The challenge brief lists generic  (\"Decentralization\") and not measurable (\"Transparency\" \"Physical Markets\") metrics to verify that coming proposals focus enough on the challenge. I recommend to elaborate on this metrics, to make sure that PA will be able to assess the impact of proposals with respect challenge objectives and to compare impact between proposals. One metric I think of is \"number of impacted products by a given proposal\", \"number of customers impacted by a given proposal\".", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3006, "q0": "The agriculture industry is growing more and more everyday, especially in a period that the climate change has arisen and it causes all kinds of problems all around the world. Building a bridge between the agriculture field and the Cardano ecosystem could ensure the transparency of all the agriculturing procedures including the production chain, the supply chain and the consumer chain, making it profitable for all the involved members. That's why i think that this challenge could have great societal impact. Transparency, decentralization and mass adoption of the blockchain technolofy are all goals of the whole Cardano mission so this challenge definitely addresses it. ", "q0r": 5, "q1": "There are a few solutions that are refered to as key metrics to implement in order for the challenge to be held successfully such as giving the proper attention to the transparency, the traceability and the information flow, giving space for development. It is a quite hard challenge to be implemented but i believe if it gets funded and people start building on it, the results will be visible in the first 6 months and that could be even more likely should it be a cooperation with a platform like the Atala Prism one. However, there is no mention of any team involved and that is something that you need to describe briefly so that the challenge has more chances to get funded. ", "q1r": 4, "q2": "The success criteria for this challenge is very clear and easy to verify. It’s about these following features the information flow, transparency, customer satisfaction, producer satisfaction, decentralization, traceability, user-friendly DApps and DAOs, physical Markets. I believe that you may have to consider presenting some numbers or in general how you are going to measure each one of each metric. Foe example, how is the decentralization going to be quantified? How about the traceability and the transparency that were the two main goals of the whole challenge? In that way, the challenge can be audited easily by the community members. ", "q2r": 4, "assessor": "z_assessor_2385", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3262, "q0": "There is a general lack of alignment here with the Fund 10 goals, in the form of lacking specifics to help tie this challenge to the goals.  While it could likely be a useful challenge setting, and agriculture is a deeply significant sector that deserves specialized focus, it would have been helpful if the proposer had provided some features and characteristics of this challenge setting in regards to each Fund 10 goal.  For example:\n\nFor goal #1, prepare people to contribute, they could have suggested proposals related to education about how the parts of the food supply chain interreact and where opportunities for decentralization lay, or for prioritization of apps and tools specific to small-holders or AG SMEs for onboarding them to blockchain solutions.\n\nFor Goal #2, opensource, they could have included the need for repos for AG specific DAO tooling, or governance and contract templates opensource libraries for adoption at all levels of the supply chain.\n\nFor Goal #3, Real world solutions, it is easy to imagine what could be innovated, but what is needed here are explanations and examples to provide inspiration for proposals and help see where the impact and relevance is for various ideas related to AG.\n\nFor Goal #4, Improve tooling for humans, they could have included guidance on creation of education, documentation and onboarding  mechanisms, and inclusive design principles that make the solutions accessible at different levels of the supply chain.\n\nBecause the proposal can easily be imagined to fit into the Fund 10 goals, but because no specific details were provided to that end, I disagree that this proposals has established good alignment with the goals of the fund.  2 stars.", "q0r": 2, "q1": "This is an area where more details, and a longer challenge brief that digs into the problem as presented would have been useful.  As it is we don't have much to go on in the way of what kind of standards define \"healthy\" or \"satisfaction\" within this challenge.  What is needed is guidance and support for proposers within this challenge to understand the scope of what is being considered, and to be inspired with examples of the types of proposals that would be accepted under that guidance, and align well with the goals of the community.\n\nWhile the budget seems reasonable given the scope and role of the AG industry as a whole, the lack of the details mentioned above will make it difficult for proposers to orient themselves within it, which puts that much budget at risk of either over or under optimization.  Even if the criteria had been better defined, the newness of this challenge setting (i.e. the need to learn what are the best KPI s and objectives to set, and to clarify its scope) points to lowering the funding into the $500k range which is the norm for feeling out emerging categories over the last few Catalyst funds.\n\nBecause the details provided are only of limited help in guiding proposers in this challenge setting, and because the budget comes in high for such an unexplored area of funding, I disagree that this proposal is Feasible.  2 stars.", "q1r": 2, "q2": "The KPIs included are numerous, but could be fleshed out more individually to better understand how they could be used to measure success and help proposers frame objectives under this challenge setting.\n\nFor example, decentralization of the food supply chain is a laudable objective, but how do we measure that?  Can we include under this heading sub-metrics like number of sources of input to individual supply chains (say for coffee beans, to a given smart contract in that market, i.e. how many small-hold farmers are able to combine under a given buyer's quality protocol, which diversifies and strengthens the quality of downstream supply chain?).\n\nAnother example is \"Information Flow\" where it would be nice to know what kinds of objectives might satisfy this metric...real time market updates, consumer access to producer data, etc. would be good places to start.\n\nAll in all this broad category has a future in Catalyst, but in the present more concrete and well characterized KPIs would go a long way towards structuring the challenge.  Because neither agree nor disagree with the applicability and validity of the provided KPIs, I assign this field 3 stars for verifiability.", "q2r": 3, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3356, "q0": "Based on the information provided in this challenge setting proposal, I don’t think that it meets all four of the strategic goals for fund 9. For the first strategic goal (prepare a group of people to make contributions to the Cardano ecosystem), I think that the proposers could have done a better job of including more information or guidance for future proposers. In the challenge setting’s current state, there really isn’t any guidance for proposers besides general problems to address, like fixing 21st century agriculture using blockchain technology (which is very vague and not very useful to a reader). However, people who address this challenge setting can make contributions to the ecosystem by bringing in new customers and use cases for the Cardano blockchain. More context about how blockchain technology can fix the current agricultural problems would have been needed to conclude that this challenge setting addresses the first strategic goal. \n\nFor the second strategic goal (build an open-source ecosystem and attract new developers), I think that this challenge setting only partially addressed it. Firstly, the proposers made no mention at all whether proposers should make their software solutions open-source or not. I could see a case where this challenge setting attracts some new developers to build the solutions people come up with, but the agriculture area is not necessarily the biggest growth area for blockchains in the current moment. As a result, it may be hard to attract developers to this challenge setting and Cardano as a whole if the guidance is very sparse.\n\nThe challenge setting addresses the third strategic goal (build real-world solutions on the Cardano blockchain) because the outcomes of addressing the agriculture industry could have the impact of improving the production chain, the supply chain, and the consumer chain (according to the proposers). Fixing the problems with food production can have long lasting impacts on people around the world. It could help solve the food security crisis and also reduce waste. The possibilities for real-world impact are huge.\n\nThe challenge setting does not address the fourth strategic goal (improve tooling to support human processes in Catalyst) at all. Since this challenge setting is specifically targeting an off-chain sector, it has no impact on Catalyst whatsoever. If the proposers could have addressed how this challenge setting could improve human processes on Catalyst, it would have greatly improved the proposal. Since this challenge setting did not address one strategic goal and did not fully address two other strategic goals, I can only give this challenge setting a score of 2 for alignment. (score given: 2)\n", "q0r": 2, "q1": "Based on the information provided in the proposal and my knowledge of Cardano, I think that the Cardano community has the capacity to address this challenge. However, there will definitely be lower interest in this challenge setting than for other challenges because the agriculture sector is not a huge priority for growth on Cardano. Over the past 3 funds, I do not recall seeing any challenges specifically targeting agriculture. I only saw a few proposals in various categories that could maybe fall under this challenge had it existed. As a result, I do not know if there will be enough developers and community members to fully address this challenge setting. If there were more examples from past funds of Cardano being used to address the agriculture sector, I would be able to say that the Cardano community could address the challenge, but that isn’t the case.\n\nAs for the budget, I think that 800,000 ADA seems a bit high. I did not see any reasoning provided in the proposal as to why this budget was requested. Additionally, based on my previous comments that there might not be too much interest in the challenge setting, I don’t see how there would be enough proposals to use up 800,000 ADA worth of funding. I think the proposers could have chosen a slightly smaller budget for this challenge setting because of the lower interest in it. Since this challenge setting proposal does not fully address the criteria for challenge setting feasibility (not fully addressable by community and budget a bit high), I can only give a score of 2. (score given: 2)\n", "q1r": 2, "q2": "Given the information provided in the proposal, I don’t think that this challenge setting is well scoped in defining metrics of success for its focus areas. For example, the proposers simply listed very generalized metrics of success, such as information flow, traceability, and customer satisfaction. I don’t see how metrics like these could help many future proposers because there is no indication of how one could measure success using those metrics. How exactly can one measure success with information flow? Are the proposers supposed to increase information flow? Streamline information flow? For all of the metrics provided, the proposers should include some more context on how those metrics can constitute success. A good way to address the point I just mentioned, the proposers could have added something to the effect of “improve information flow between producers and suppliers.” Anything that provides more clear information as to how success can be measured would have made the challenge setting more clear. In its current form, the challenge setting’s metrics of success for its single focus area of agriculture are not as well defined as they could be. Since the metrics are not defined well, I can’t say that this challenge setting will create healthy competition between proposals. Since it is very hard to measure verifiability for this challenge setting, I can only give this challenge setting proposal a score of 2 for verifiability. (score given: 2)", "q2r": 2, "assessor": "z_assessor_2457", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4670, "q0": "This proposal for a challenge is a lovely idea that is very well in line with Cardano's commitment to enriching lives globally. Speaking as someone with about a decade of experience in global science policy, I can tell you that agricultural development is already a major global priority. It's laid out in the second Sustainable Development Goal and there's a reason the FAO exists. So there is indeed strong reasons to have confidence that a challenge of this kind is both appropriate to Catalyst and but indeed an arena that Cardano could become a key player in. That alone earns this proposal at least a rating of 4 in its alignment with the Cardano mission.\n\nSadly, this proposal is also underdeveloped. The idea as presented needs more detail and to express a greater, bolder vision. Indeed, future proposers in this category will need more and better guidance before they could craft effective proposals in this category. I'm going to attempt to address some possible avenues for improvement for the proposers here to explore in the remaining two sections, in the hope that this idea could become something that does indeed lead to the development of real-world solutions in agriculture practice and policy.", "q0r": 4, "q1": "While the Catalyst community has much potential to contribute here, the problems the challenge needs to address must be better defined. \n\nThere proposers write \"21st century Agriculture is facing a lot of issues that could be solved by blockchain technology through Cardano\" and end it there. I would encourage them to list some examples of these \"issues.\" Give us some clear language about what you want proposers to tackle. Provide us with links so we can research it with full confidence that there is no communication gap. Links to news articles would be fine, but especially links to policy papers or scientific research would be ideal. Look to UN reports, and NGOs in the area, as well.\n\nIt would also be excellent to point to existing examples of solutions, if possible. This would do much not only to persuade proposers that this should be a priority, but also hopefully inspire action from established teams to contribute, building a community in Cardano focused and passionate about this priority. \n\nAlso, since there appears to be a challenge team of some sort under the banner of \"AgriTech Society\", it would be nice if you could tell us a little more about yourselves. Who are you? What is your experience? What is your current focus? Do you have academic credentials? Have you had success in this arena in the past?\n\nWithout information of the above nature I can't in good conscience award this proposal for a challenge with more than 3 stars. \n", "q1r": 3, "q2": "Categorically, the metrics listed are appropriate. But to attract quality proposals this challenge will need more than sensible categories. \n\nA good start would be to present these categories as key questions all submitted proposals will be expected to address. Instead of listing \"transparency\" you can ask, \"How does the proposal demonstrate transparency to the Cardano community?\" That on its own helps with clarity.\n\nIt's important to note that auditable proposals, if approved, will show not only final results but should be able to file routine reports on progress while the projects are ongoing. This warrants a prominent mention in the text. How does one present progress on \"information flow\" to the community? \n\nIn other words, give everyone a little more to chew on! There is something with promise and potential here that is worth developing further.", "q2r": 3, "assessor": "z_assessor_2585", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6317, "q0": "The Cardano blockchain can help solve some of the Agri-Food Industry's problems, such as supply chain transparency and impact on agricultural land. Supply chain transparency is required to ensure the agricultural products are organic and no Genetically Modified Organisms (GMO). The biggest threat caused by GM foods is that they can have harmful effects on the human body. Furthermore, it is believed that consumption of these genetically engineered foods can cause the development of diseases that are immune to antibiotics.\n\nOn the other hand, somebody needs to track the changes on the agricultural land, and it is good to know people are developing solutions (Environment Oracle proposal) on Cardano blockchain for doing the same. These points prove the importance of this challenge, and we can conclude that this challenge will add value to the ecosystem and have a positive impact.\n\nThis challenge assists in achieving two of the strategic goals. It will incorporate able people & developers who want to develop solutions to tackle the above problems and thus contribute to the Cardano ecosystem. The initial solutions designed under this challenge will pave the way for more and better solutions. This will enhance the growth of Cardano's DApp ecosystem in the direction of Agri-Food solutions.\n\nIf this challenge succeeds in materializing solutions to real-life problems, it will positively influence the Cardano adoption. Given the above points, this challenge is vital to Cardano's mission.", "q0r": 5, "q1": "I have already seen some proposals attempting to solve some Agri-Food chain problems, such as 'Environment Oracle,' 'Open Ledger for Agricultural Land,' 'Landano: Cardano Land Registry DApp,' etc. This reflects the capability and willingness of the community to address this challenge. \n\nWe can anticipate the proposers will submit many proposals to this challenge. But I am skeptical about the number of proposals, I suspect it to be low, and thus I think the asked budget of 800k is a little excessive. Therefore, I suggest the author start with a lesser budget as this challenge is presented for the first time. Subsequently, this amount can be increased in the following funds based on participation and feedback. Because of this point, I am rating four stars. \n\nThe author did not provide any details about the challenge team, and as this challenge was not selected by Catalyst earlier, there is no challenge team available. ", "q1r": 4, "q2": "The author defines success as the 'creation of a more healthy & transparent agricultural chain.' This definition and the metrics mentioned in the challenge are somewhat vague but can be utilized to measure the challenge's success. \n\nThe author did not mention metrics to measure proposals' success separately. Still, auditors can use some of those vague metrics (transparency & traceability) to evaluate proposals' success. \n\nOn the other hand, proposers, auditors & other parties also need metrics to track/audit proposals' progress. As these proposals will be developmental, the metrics can be the development updates on platforms such as GitHub or Jira board or via some reports. Therefore there is room for improvement in this challenge. Hence I am rating it four stars. ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7484, "q0": " After reading this challenge, I had to re-read Cardano's missions (https://cardanofoundation.org/en/our-missions/) to see if the challenge would help Cardano achieve the mission. There are 05 paths in Cardano's mission:\n1-Driving adoption of Cardano\n2-Shaping legislation and commercial standards\n3-Growing the global Cardano community\n4-Ensuring stakeholder accountability\n5-Facilitating partnerships\nI think challenge is more suitable for path number 1. However, Proposals for these challenges can be placed in a category like dApp, DAO or local community rather than creating a separate challenge. If it is to be a separate Challenge, it is necessary to set the conditions to limit the projects submitted. So I give 3 points", "q0r": 3, "q1": "There are 21/52 Agriculture related projects funded at fund8 (https://www.lidonation.com/en/project-catalyst/projects). There are 23/107 Agriculture related projects funded in all funds. This affirms that the Community has an interest in solving issues related to Agriculture. Total funding for 23/107 Agriculture related projects funded in all funds is $645K, while this challenge proposes 800K. It is necessary to consider this number in order for good proposals to be selected in funds10. I rate 4 stars", "q1r": 4, "q2": "There are 08 Key Metrics to measure written in the challenge as:\n- Information flow\n- Transparency\n- Customer satisfaction\n- Producer satisfaction\n- Decentralization\n- Traceability\n- User-Friendly DApps and DAOs\n- Physical Markets\n\nThese criteria are suitable for dApps in challgence, however it is necessary to clarify how they are measured. for example, how to measure Information flow, how to measure Transparency, Traceability. If this information is updated, it will be easier for potential proposers to assess progress/success. I give 3 point", "q2r": 3, "assessor": "z_assessor_2896", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12875, "q0": "Agriculture is connected to the food that we use on a daily basis and consume, so this is a large space and an ideal environment for Blockchain technology to enter. This will allow for the tracking, monitoring, and creation of a marketplace that can supply \"green\" agricultural products to customers all over the world. The implementation of Blockchain technology in agricultural practices has the potential to alter the conventional method of labor while also enhancing the community's familiarity with the Cardano Blockchain. Consequently, this assists farmers in becoming more knowledgeable about Cardano and Blockchain. The issue that you brought up in order to be able to set up a challenge in fund 10 is an important one, and it needs to be solved in this fund specifically.", "q0r": 5, "q1": "It can be seen from all of the votes on the websites that Cardano compares all aspects of Cardano with other ecosystems, which is the overwhelming crowding of ecosystems. In point of fact, Cardano's community is quite powerful. and additionally complete faith placed by the community in the natural system. Along with the explosion of decentralized applications (Dapps), products, and a bridge between Ethereum and Cardano, there will be a large number of developers passing through and developing for some other ecosystems because of the low cost as well as the low cost. Cardano's use of POS systems is an example of one of its advantages. Therefore, finding a solution to the problem posed by the challenge is not particularly difficult. A budget of 800,000 ADA for the challenge, which is equivalent to nearly 400,000 USD at the moment when the price of ADA is 0.5 USD, is a reasonable level for developing a large sector such as agriculture at the present time.", "q1r": 5, "q2": "Applications that can be applied to agriculture are needed in order for the challenge to be successful for the proponent. The goal of the challenge is to create a clean and transparent agricultural chain. It is necessary to have transparency that is both clear and verifiable in order to link and connect supply chains from production to consumers. The community as a whole places a high value on food, which is why elucidating its provenance and striving toward greater \"greenness\" in food production are among the most pressing concerns. In light of the criteria that will be used to evaluate the success of the proposal, I believe that it is quite reasonable.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}], "importance": "21st century Agriculture is facing a lot of issues that could be solved by blockchain technology through Cardano.", "success": "Creating a more Healthy and transparent Agricultural chain which will go down in favor\n\nthe production chain\nthe supply chain\nconsumer chain\n"}