{"id": 415716, "author": "agustin", "title": "Grow LatinAmerica, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/415716-48088", "category": 26604, "amount": 1000000, "description": "How do we increase Cardano adoption on our countries?", "f6_no_assessments": 12, "f6_rating": 4.527777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 89, "q0": "Latin (South/Central) America is one of the continents with great promise for Cardano’s expansion due to the population’s great awareness of the dangers of inflationary monetary policies and the continent’s relatively good infrastructure and large young population. There is real world use for crypto in Latin America (think shaky monetary systems in many of the countries of the region, think remittances, etc). This proposal is one of proposals that emulated the model of “Grow Africa, Grow Cardano” – to obtain funding. Yet, I think that it might be time to move a bit away from the continent-based challenges in order to focus more on ideas, especially as Cardano’s mission is not overtly continent based – but rather global. Continents, such as Africa, South America, etc.., are as diverse inside as they may seem similar from the outside. Even Brazil is often known under the acronym Belindia – an amalgam of Belgium and India. The challenge question is wide enough “How do we increase Cardano adoption on our countries?” – to encompass almost every project touching on Cardano in the Latin American region. However, that might be a bit of a weakness of this type of challenge – its lack of focus on the global priorities of the Cardano mission and Fund 9 (despite the seemingly strong focus on a continent) – as every region of the world could equally claim the right to a challenge in Fund 10 as in each region of the world Cardano wishes to spread its gospel. The challenge does address the Fund 9 goals 1, 2, 3 and 4 – but all of them partially as it narrows its scope to one part of the world – which itself (as an approach) is not Cardano’s mission which is a global mission. ", "q0r": 4, "q1": "The Latin American community is pretty strongly present in Cardano and I would think that there are many proposers that could participate. The proposed success criterion “Making innovative projects that can bring real solutions to the people” seems overly general to me and combined with the very general nature of the challenge (focus on Latin America) – it sounds like an invitation for many projects that may have or not have sufficient focus. I am also worried about the fact that many projects might try to include a Latin American angle (developer, token local partnership, etc.) just in order to formally fit in into this challenge. The asking budget for this challenge is pretty large at ADA1,000,000 for a Latin America based challenge and I feel that the challenge is so general that the feasibility of organizing a challenge that provides sufficient value for money might be compromised by the very large budget. The challenge brief is a bit too simplistic for my liking “We need to make Cardano grow in our countries” as it focuses more on growing Cardano, than on providing real life use and utility. If this proposal for a challenge is not voted in this round, I would advise the proposers to shake up the now partially stale concept of \"Grow XXXX, Grow Cardano” and to reimagine a new form of more focused challenge that would be more laser-focused on the specific needs of a certain category or groups of potential and likely Cardano users in the whole – or part of Latin America – or even without the geographical connotation. The budget of ADA 1million seems too high for a challenge that does not focus on a priority area for Cardano – I would argue that only Africa has been singled out as a priority area and that is also a priority that has been determined by IOG, one of the many players in the Cardano ecosystem. Hence, I question the feasibility of spending so much money and whether there are enough GOOD projects to share it. If the proposal is not accepted this time around, I would advise resubmission in the next fund with a smaller budget. ", "q1r": 3, "q2": "I think that the proposers have set up solid metrics – although some of them a bit vague for my taste - and which are focused on the specific aim of the challenge. As this is not the first time that this challenge was proposed (I think that it has been voted in previously as well) – I would have liked to see more information from the proposers about which metrics have proven to be useful and how have they performed in the “Grow XXXX, Grow Cardano” challenges. There have been a handful of “Grow XXXX, Grow Cardano” challenges until now and there is real life information about some success stories and failures from these challenges that could impact the development of more precise metrics for the newly proposed “Grow Latin America, Grow Cardano” challenge. I would have liked to see feedback about what has been learned from these types of challenges and what type of growth has really been achieved. Hence, I remain a bit more skeptical - without that feedback – about the true verifiability of the impact of this challenge. As the proposers of this Challenge Setting are keen on improving the participation of Latin America in Cardano, one of the proposed metrics “Offer Cardano solutions to real problems” could have been more specific – by identifying some “real problem categories of importance for Latin America” that could be specifically targeted by the challenge. As it stands now, the challenge could be merged into a wider single “Grow Cardano” challenge, as it does not highlight any specific needs, domains or problems that face Latin America in particular. ", "q2r": 4, "assessor": "z_assessor_2047", "no_vca": 22, "ne": 9, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 144, "q0": "Mass adoption is one of the ultimate goals of not only Cardano but all public blockchains (supposedly). This challenge aims to channel funds to catalyze the development and integration of the LATAM community with Cardano. I would like to see more arguments about the Latin American backgroudn to justify the importance of the challenge. I was born and live in Latin America and I understand the problems faced by being part of this context, but Catalyst and Cardano is a global community and many people do not understand the problems and importance of prioritizing development in LATAM x in the world as a whole.\n\nCardano has a global community and although many people are aware of the problems faced at LATAM, it is important to provide more detailed sources, articles or rationales in the description of the challenge, as this will define how critical this challenge is in the Cardano's mission.\n\nAs in Africa, which has major problems of infrastructure, connectivity, unbanked population and several socio-economic problems, Latin America suffers from these problems as well, but to a lesser extent.\n\nThis article (https://www.statista.com/chart/26757/cryptocurrency-adoption-world-map/) cites Chainalisys as a source and indicates that LATAM has similar adoption to Asia. When talking about adoption it is important to discern the context of adoption, in some countries adoption may be due to political issues in other countries financial. In Argentina and Venezuela we see greater adoption of cryptos in LATAM, most likely due to the chaotic financial issues of these countries. Venezuela and Argentina both face hyperinflation and despite inflation being around 10% worldwide, in these two countries it is more than 60% a year in Argentina and in Venezuela well above 100% a year during the last years.\n\nRegarding social problems, I can highlight the humanitarian crisis in Venezuela, which has caused hunger and a large migration of Venezuelans to neighboring countries. There is also the issue of authoritarian governments and exchange controls, where citizens are prohibited from trading local currencies for currencies of other countries such as the dollar. At this point cryptocurrencies have been a lifesaver for many to maintain their financial wealth and/or not starve to death (literally).\n\nhttps://www.nytimes.com/2019/02/23/opinion/sunday/venezuela-bitcoin-inflation-cryptocurrencies.html\n\nhttps://www.coindesk.com/markets/2021/11/23/axie-infinity-finds-ready-players-in-hyperinflation-racked-venezuela/\n\nRegarding unbanked people, LATAM does not have as bad a scenario as there is in Africa, but it is still very promising for leapfroging blockchain-based financial solutions in more precarious communities.\n\nhttps://medium.com/the-capital/the-unbanked-and-financially-excluded-ba55805dbb1c\n\nhttps://insights.invyo.io/latam/fintech-corner/why-the-banking-industry-should-bet-on-latam/\n\nThis challenge is in line with items 1, 2 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals.\n\nDue to the similarity between the \"Cardano support for Latin America\" ​​and \"Gron Latin America, Grown Cardano\" challenges my assessments will have a higher similarity level.", "q0r": 4, "q1": "This challenge was already present in Fund 7 of Catalyst, with the budget of $500,000 USD and the total requested budget was around $2.5M, so a moderate available funds/required funds ratio.\n\n If all approved proposals were funded the budget would need to be around $1.5M USD. The demand observed in this challenge indicates a significant demand from the Cardano community for challenges in LATAM, which is a positive indicator for the feasibility and capacity of the community to address the challenge. Cardano's LATAM community is also growing and participating more in project development, a few months ago LATAM TownHall was started and has helped to expand the LATAM NO Catalyst community as well.\n\nOn the other hand this challenge this challenge (\"Grown Latin America, Grown Cardano\") has a large overlap area (almost identical) with the challenge \"Cardano support for Latin America\" whose required budget is $1.153M ADA. It is important for voters to keep this in mind, as if these two challenges become funded, there will be a budget of around $2.1M ADA, around 16% of the total Fund 10 budget for proposals in LATAM, which I see as a certain imbalance in relation to other Catalyst challenges. This rationale is for the voters' consideration only and will not influence the score I am assigning to this proposal, as each challenge setting must be evaluated on its own merits. Challenge setting overlaps are a problem in Catalyst as they can cause major fund imbalance in certain areas and I would recommend that proposers pay attention to this and try to collaborate with other proposers to set an appropriate joint budget and avoid redundancy in challenge settings. Due to the similarity between the \"Cardano support for Latin America\" ​​and \"Gron Latin America, Grown Cardano\" challenges my assessments will have a higher similarity level.", "q1r": 5, "q2": "The definition of success of this challenge (\"Making innovative projects that can bring real solutions to the people.\") is not objective enough for the outcome of the challenge to be measured. The definition of success seems generic and not aligned enough with the context described in the proposed key metrics.\n\nIt is true that there is a character limit for the proposer to establish a success definition, but several challenge settings have included auxiliary success definitions in the challenge brief description.\n\nOn the other hand, the key metrics defined were diverse and well designed, as they allow capturing the outcome of this challenge in several aspects, such as community participation in Catalyst, number of devs, voters, PAs, proposers and onboard users, integration with governments and institutions . Qualitative key metrics were also included. My only recommendation in relation to metrics would be to include a time window for the measurement of these metrics, in order to make the measurement of the outcome of the challenge more accurate.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 412, "q0": "It is stated by the proposers of this funding category that, Latin America is one of the regions where 'Crypto' is more adopted. I recommend the challenge team to showcase some statistic / analytical data that supports this statement.\nThe challenge brief gives more insight into understanding, the importance of this challenge category. This challenge is to keep Cardano growing in this region, to allow more people to join the community.\nI can strongly agree of the importance of this funding category, it is critical to Cardano mission to make the World a better place, and it effectively addresses this fund strategic goals.", "q0r": 5, "q1": "The budget set for one million Ada; The number of people that this challenge reached in the past and a thriving community of the Catalyst LATAM, approve to me that this budget is adequate for this funding round.\nAs stated by the challenge team, the impact generated by this challenge in the past, where now many Latin Americans are collaborating. Engaging like in LATAM community, lowering the language barriers for new Latin America people is clearly a good showcase of the capacity for the community to address this challenge.", "q1r": 5, "q2": "The key metrics are very extensive, I counted 14 different measures. All are well-defined and understandable. From more broad ones, like \"Offer Cardano solutions to real problems, to the more specific / quantitative ones. Measuring of numbers of new local hubs, impact of those communities, local partnerships, solutions for infrastructure and education.\nAll these 14 metrics can be helpful and motivation for new proposers under this challenge.\nI can agree that this challenge setting is well scoped in defining what the measures of success will be, for the challenge category as well as for the future projects proposed under this challenge.", "q2r": 5, "assessor": "z_assessor_2081", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 444, "q0": "Cardano is very much still reliant on Western Hemisphere nations. By having specific teams that comes form the local communities who understands the pain points of Cardano in their local vicinity will  not only yield effective results, it will also expand the reach of Cardano.\n\nHaving a problem specific Challenge Setting although in theory is impartial and fair, these problem specific challenges might be problems that only Western Hemisphere/Developed nations have. Which in turn alienates minorities in the community. Minorities here does not mean a small number of Cardano supporters, but more towards the impact a specific community has on the Cardano ecosystem.\n\nHence the importance of Region Specific Challenges, which allows the citizens in these region to develop solutions that are detached from the development mindset of Western Hemisphere/Developed nations. One huge aspect of almost all region specific Challenge Setting is their lack of human resources that can develop on top of Cardano. This handicap unaddressed will always render minorities to the mercy of groups with abundance of Cardano based human resources.\n\nThis MUST be understood by everyone in the community. The community must look at themselves, left and right and ask themselves, are we Cardano diverse enough? When we can confidently say we are diverse enough, decentralization happens by itself. The more people can build on Cardano around the world, the more likely we will see innovative products pop-up, the more likely we will see SPO's around the world and etc.", "q0r": 5, "q1": "LATAM Town Hall has been already set-up and has shown consistent growth. Like all region specific Challenge Settings, the perceived growth will not be exponential at first, results will most likely be compounding. Whales from the developed countries with their humongous influence,  need to understand this. It takes time to build a strong, vibrant community. It will probably take 3 (three) years to reach a maturity where decisions made are highly effective, communications happens easily and coordination has become a system.\n\nAs mentioned, LATAM has shown consistent growth, but without funding they will slowly die out. They can not yet live from operating an SPO, their only chance is through Project Catalyst. There are many prominent Catalyst members who hail from Latin America, who are instrumental in the development of various key communities such as Catalyst School. Guided by these individuals, innovations will come from LATAM. ", "q1r": 5, "q2": "Although highly experienced, their success criteria could have been more specific/reflective towards the current development of Cardano in Latin America. Like most regions outside the Western Hemisphere, the number of Cardano based developers from Latin America although available are not that abundant enough that it justifies their target of creating innovative project that can bring real solutions to their communities. I would recommend a success criteria that is a lower hanging fruit. A moving target that changes from fund to fund depending on the KPI's they have stated.\n\nTheir stated KPI's are very thought out although it is more towards being a roadmap rather than KPI. It definitely encompasses and reflects the current ecosystem of and processes in Project Catalyst, from education on Cardano, education on PA's, vPA's etc. to the end goal of creating new applications. Perhaps limiting the KPI's to 5 (five) objectives would be beneficial for the community for then the community would have a better understanding of what to achieve.\n\nThis also would help this Challenge Setting itself. Having a clear roadmap and having achievable KPI's will provide the larger Cardano ecosystem with signals that the team understands the overarching goal yet at the same time understands also the underlying steps that need to be taken to achieve those goals.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 854, "q0": "This is my fifth fund participating in the Catalyst community in different forums, and I have witnessed how the LATAM community is getting stronger, I notice it in the participation in town halls, telegram, discord, twitter spaces and more importantly for this case in the number of proposals that apply for fund in depth. Despite this, there is still a long way to go, in terms of education, success stories, active participation, among others. This Challenge aligns with Cardano's mission in the same way as those focused on Africa, for example, since a large part of the population has been historically marginalized and defrauded by the traditional financial system, as well as suffering from very similar socio-economic structural problems. Regarding the direct relationship with the strategic goals for the next fund, you can find a relationship with at least two of them.\n", "q0r": 5, "q1": "The only time that a challenge focused on the specific regional needs of the countries that make up Latin America resulted in a remarkable performance. This was in terms of quality and quantity of proposals, which resulted in the formation and strengthening of the community. Unfortunately this time we have two challenges competing to be selected for the next fund. This for me is a cause for concern because in case of being both selected could threaten the capability of response of the community and therefore, a potential inefficient allocation of the Catalyst Treasury. To strengthen my argument, we can analyze the data of proposals related to the previous fund. In total 18 proposals were submitted in the different challenges available, of which 13 were approved for a total amount of more than US$230,000. Based on the above, I must say that I neither agree nor disagree with this proposal.\n", "q1r": 3, "q2": "The description of success is clear and concise, however, I would have preferred it to be a little more specific to the challenge, since it easily coul be applicable to any challenge. Metrics presented here are well defined, objective, and easy to measure. The metrics are a combination of metrics that are used to measure the performance of the challenge itself, as well as metrics that are used to guide the definition of proposals that will be submitted as part of the challenge. In future catalyst cycles, I recommend the team include, in addition to the brief, a list of possible expected directions, which will provide direction and time limits to potential proposers.\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 3198, "q0": "The Latin America community in Cardano has achieved a lot of success in its early stages, but still there’s an enormous demand for funding directed at the region. Just as Africa is becoming on of the main hubs in Catalyst, Latin America has the same potential and could bring the same progress – only if it gets funding incentives as well. It’s also worth saying that the all the four strategic goals set for F9 challenge setting are achievable by this proposal of challenge. The challenge could have brought a focus on representation and diversity, which is highly needed in the Latin America community, but this does not make the challenge less relevant, as it is not the focus of the strategic goals for F9. ", "q0r": 5, "q1": "In F7 this challenge has proven to be one of the most active in terms of proposals, activity and interaction among proposers. It has also sparked a lot of collaboration among proposers and enthusiasts that were connected after the challenge was created. Therefore, there should be no doubts that the community has the capacity to correctly address this challenge and make it happen, especially under its goals.", "q1r": 5, "q2": "The community can verify the challenge success according to a long list of metrics described in the proposal and its clear view of success presented in the challenge. In addition, the budget requested can stimulate a healthy competition between proposals and even contribute to the create of more partnerships. ", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 4913, "q0": "Latin America is, within the regional prism, a clear target for Cardano. Highly unequal, with low adotion of TradFi for the population, it is ripe for disruption, with the opportunity to leverage the highly skilled workforce, specially developers which may be onboarded to Cardano. The focus which Cardano has made publicly to the developing regions of the world, with Africa as the spearhead region, naturally must also reach Latin America.", "q0r": 5, "q1": "The fact that there has already been a Grow Latin America, Grow Cardano Challenge in Fund 7, and that it was a huge success in terms of proposals presented, engagement of new members and developers, creation of new Hubs in the region and so on, is a clear indication that the community has the capacity to address the challenge. Although these specific proposers were not part of said Challenge team, and appear not to have a proven track record in Catalyst, nevertheless theere is a LATAM Cardano Community that can be leveraged in case of need to sustain this Challenge, as they have already done in Fund 7, and in case of future iterations of this proposed Challenge setting we would suggest perhaps a joint proposal with their more prominent members so as to ensure higher possibility of success and creation of synergies arising from past expriences and continued engagement with the local LATAM community.", "q1r": 4, "q2": "The proposed criteria are in line with those used to measure the results of the Fund 7 itearation of this Challenge setting. Namely, the number of proposals presented, number of new Latin America-based users onboarded onto Cardano and Catalyst (proposers, voters, PAs), number of Latin American developers onboarded, local impact and partnerships formed, including with Governments and other institutions, number of new local Cardano communities/hubs, etc. These metrics will ensure that success is eminently verifiable on the part of the Challenge team, the LATAM Cardano Community and the wider Catalyst/Cardano audience.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6321, "q0": "Disclaimer: I will be using almost identical assessment text for two challenges focusing on Latin America. \n\nLatin America has a population of over 600 million, with the majority of the population speaking Spanish and Portuguese. As per the reports, more and more Latin Americans are showing interest in cryptocurrencies and want solutions that facilitate access to the crypto world. The Latin American country of El Salvador is the first country in the world to legalize Bitcoin as a legal tender. El Salvador is also becoming the favorite country for crypto enthusiasts. Hence, the region is interested in crypto and willing to participate in blockchain projects. Cardano, the most resilient blockchain, can also help solve various Latin Americans' problems. \n\nCatalyst community has already started providing region-specific assistance by conducting Townhall meetings every Thursday in local languages, i.e., Spanish, Portuguese, and English. We can further increase this help by funding a region-specific challenge to increase the outreach and development proposals for or from Latin America. This challenge will help with the strategic goals of the participation of capable people who want to contribute to Cardano space. Also, the regional developers' onboarding will help grow the DApp and developer ecosystem. \n\nIn terms of attracting votes, this challenge may help increase the engagement into Catalyst from the region and thus may increase the votes. The successful execution of the outreach and development proposals from the region, this challenge will push for Cardano adoption in the area. Given the above points, this challenge is essential for Cardano's mission. \n", "q0r": 5, "q1": "As we can see from the participation of members from Latin America in regular Townhall meetings and LATAM-specific Townhall meetings, there is a big Cardano community in Latin America. In addition, Latin Americans submitted proposals in the past funds; some were about local outreach & others were developmental proposals. Hence it reflects that the community is capable and willing to address this challenge. \n\nThe fund asked by the author is $1,000,000, which I think is not reasonable. This challenge is not funded earlier, and we cannot be sure of the quantity and quality of the proposals under this challenge. It will attract many proposals, but it will be low for the first time. If we keep a high amount, it will result in funding low-quality proposals. Therefore, I suggest the amount be $100,000 or a maximum of $250,000 for the first time. After that, we can see the participation and quality of the proposals, and then maybe this can be increased in future funds. \n\nAs mentioned above, we already have effective participation from the community in the Townhall meetings. These meeting organizers or other capable members of the community can act as the challenge team. However, as we did not have this challenge for Latin America earlier, Catalyst did not create the challenge team. \n", "q1r": 4, "q2": "Many metrics are mentioned here in the challenge. Some of these metrics are suitable for measuring the challenge's impact and success. The other metrics, such as the number of users onboarded, the number of new Catalyst members gained, and the number of developers onboarded can be considered to measure outreach proposals' progress. There is room for improvement in the metrics mentioned, such as if the proposals are about the development of DApps or tools, then the metrics can be the GitHub commits or milestones achievements. \n\nThe success definition mentioned by the author is confining to innovative projects. I think if the challenge is focused on a continent targeting other language speakers, the success can also be the number of users onboarded who are participating and contributing to the Cardano Ecosystem. The author does mention the above in the metrics. \n\nI suggest the author collaborate with 'the team of an identical challenge' about Latin America. Hopefully, that will improve the quality of the challenge and increase the chances of getting funded. ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7711, "q0": "This challenge is indispensable to the core objectives of CARDANO, a region with a large number of crypto currency holders, precisely because of the political bureaucracy, currency devaluation, severe inflation, corruption and other criticisms that make people choose to invest in crypto currency, and a region with a very large number of CARDANO advocates, as well as a region with a high density of talent and worthy of development. I am very supportive of the goals and objectives of this challenge.", "q0r": 5, "q1": "We are very sure that the Catalyst community has the capacity to deliver on this challenge.\nThere is a lot of talent in the region, we have had the same challenge before, and most of the funded projects are ongoing, so this is a place for people in the region to get funding and develop their expertise. Many people in the LATAM region have creative ideas, but no funding to execute their ideas. With this challenge, more people who lack the pipeline resources can accomplish their dreams through this challenge. I am very supportive of this challenge and believe that every FUND should have this challenge, after all, the region has the same potential and lack of resources as the African region and its development is urgent.", "q1r": 5, "q2": "This challenge offers possible indicators to measure, those indicators complete, such as measuring the challenge through the number of proposals, like solving the fundamental problems that hinder the adoption of Cardano in Latin America, providing solutions to infrastructure and education problems, the number of new users joining Cardano in Latin America, the number of new Catalyst members (sponsors, voters, CAs) based in Latin America, the number of new number of Latin American projects, number of Latin American developers joining in 2022, local impact, local partnerships formed to provide Cardano solutions to real problems, access to governments and institutions, number of proposals made by Latin Americans, quality of these proposals and their impact on their local communities, new local Cardano communities created in Latin American countries or cities The number of new local Cardano communities created in Latin American countries or cities, etc., are all listed in this challenge to measure its success.", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 7787, "q0": "This challenge focuses on the development of Cardano in the LATAM region, which is home to about 600 million people. This is an area with many talented people and has a lot of potential to develop Cardano. This geographical promotion of Cardano development is part of Cardano's mission to contribute to community development. However, in my opinion, apart from the special priority Africa region, the Catalyst fund for regional development should be divided equally, not giving priority to any other region to ensure decentralization. Therefore I give 4 points in the alignment criterion for this proposal.\n", "q0r": 4, "q1": "Catalyst has funded the challenge Grow LatinAmerica, Grow Cardano in fund 7. So with the capacity and experience of the Catalyst community, we can definitely complete this Challenge. However, the proposed budget for this Challenge is up to 1,000,000 USD, I think this is too much. Regional development proposals should limit funding to less than $500,000 depending on the size of the area's population. Therefore I rate 4 points for the Feasibility criterion", "q1r": 4, "q2": "The proposal provides a series of criteria to evaluate KPIs for Challenge. We can see that these criteria are mostly similar to other geographical Cardano development challenges, for example: Number of proposals, number of users, number of catalyst members, number of developers. We basically have a clear view of the criteria the challenge expects. So 4 points for verifiability.", "q2r": 4, "assessor": "z_assessor_2922", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8004, "q0": "As many as 500 million people live in Latin America. So it would be very interesting to increase the acceptance of Cardano in these countries. It's good to create innovative projects that can bring real solutions to people. Involving Latin America will create a whole new community. New talents will be discovered and projects will be looked at from a different point of view. I see only benefits from funding this project and giving these people the opportunity to get involved in the possibilities of the Cardano ecosystem. So this challenge is certainly critical to achieving Cardano's missions. The Catalyst LATAM community that has been established will already allow future collaborations to be formed making this an easier start to building new projects.", "q0r": 5, "q1": "The Catalys community certainly has the capacity to rise to this challenge. Part of the impact this challenge has already generated is the creation of Catalyst LATAM community where many Latin Americans now gather. This establishment has ensured that certain future collaborations have already started. This is a good start to build a future in this region and foster the growth of the Cardano ecosystem. This challenge meets Fund9's strategic objective. With enough new collaborations from the LATAM community, this project can certainly be a success.", "q1r": 5, "q2": "Success criteria and suggested stats are properly set up to measure progress in tackling the challenge. It is possible to clearly measure how many people are admitted from Latin America. The projects are aligned with the strategic goals from Fund9. By establishing LATAM-Catalyst, there is already a group that wants to contribute to the ecosystem. The projects that will be implemented will be open source projects that anyone will be able to use and solve real problems for the people. By including a target group of 500 million inhabitants, the ecosystem will be provided with new community and developers. There will be new developers and new apps being developed in these regions. It will be important to include a new part of the world in the Cardano community for each Fund. Choosing Latin America now is a good start. Hopefully this challenge can be expanded to even more continents in future Funds.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10377, "q0": "Challenges such as \"Grow Africa, Grow Cardano\" and \"Grow East Asia, Grow Cardano\" are currently offering many important proposals and projects. These challenges not only help the Cardano ecosystem grow, they also benefit communities in Africa and East Asia. Cardano's goal is to become a global blockchain so it needs to promote projects in many regions of the world. Therefore, the proposer wants to propose the \"Grow LatinAmerica, Grow Cardano\" challenge. The purpose of this challenge is to help develop projects that serve communities in Latin America.", "q0r": 5, "q1": "This challenge is very real and helps grow the Latin America region. If this challenge is approved, many projects related to Latin America development will be proposed. I believe the Catalyst community will be very interested in this challenge. More regions supported by the Catalyst fund will have more people trusting in Cardano.", "q1r": 5, "q2": "In the challenge \"Grow LatinAmerica, Grow Cardano\", the proposer sets up many very specific key metrics such as number of new Latin America-based users, number of new Latin America-based Catalyst members, number of new Latin American projects... Key metrics in this challenge help to measure the impact and effectiveness of projects in this challenge.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}], "importance": "Mass adoption requires a global view. Latin America is one of the regions where Crypto is more adopted", "success": "Making innovative projects that can bring real solutions to the people."}