{"id": 417104, "author": "sbpabon", "title": "DEVELOPING COUNTRIES UNITED", "url": "https://cardano.ideascale.com/a/dtd/417104-48088", "category": 26604, "amount": 1000000, "description": "Time to make an experiment: let's provide support by socioeconomic conditions rather than by geographic location.That's one of Cardano's original purposes: to provide support to developing countries.", "f6_no_assessments": 8, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 149, "q0": "The challenge setting proposes to carry out an experiment providing support according to socio-economic conditions rather than geographical conditions, which is interesting considering that socio-economic inequality has no borders and there are several developed countries with poor populations. Another objective is to improve communication, coordination and collaboration between developing countries to reduce inequality, which is something positive and promising.\n\nThe problem is how will this be used in practice? Will there be any criteria for proposers according to the socio-economic conditions of the proposers or the team? There is no clarity on the borders of this challenge\n\nThere are several confusing points in the challenge description that make it difficult to understand the concept and purpose.\n\nThe challenge question does not present a question but a statement.\n\nThe importance justification mentioned in the section \"Why is it important?\" doesn't make sense, it's too subjective.\n\n\"Global dialogue has the opportunity to find its own way. Similar problems present similar opportunities for solutions.\"\"\n\nThe lack of an articulated rationale for what problems this challenge intends to solve and providing an appropriate context for this topic makes the goal uncertain.\n\nI would recommend avoiding excessive catchphrases, as catchphrases are often generic, lack specificity and a challenge setting needs to show value through clear and objective ideas of what it is expected to achieve in order to guide the proposers who will submit proposals in it.\n\nDue to the lack of clarity in the target problem of this challenge setting, I do not agree that it is critical in the Cardano mission. I recommend that the proposer better describe the target problem. Improving inequality and conditions in underdeveloped countries is an overly generic definition that could fit into almost all challenge settings as an indirect effect.", "q0r": 2, "q1": "Blockchain applications and solutions naturally tend to reduce socio-economic inequality, so there are numerous solutions that can be created in this context, this would indicate that the Cardano community in theory would be able to create projects to improve inequality and communication between underdeveloped countries, which is already happening through teams/projects such as WADA and Latam Town Hall, but the lack of clarity in the challenge brief raises questions about feasibility.\n\nIn addition, there is no established time window to define the outcome of the challenge. How to assess whether the community can address the challenge when there is no established period to reach the goals?", "q1r": 3, "q2": "The definition of success is extremely subjective(\"Problems from different continents converging on common ground. Solutions remove boundaries.\" ).\n\nThere is no way to gauge the outcome of a challenge with such a vague definition of success. In addition, it is important to establish a time frame for measuring success. How long (months/years) should we expect this challenge to succeed? \n\nRelevant key metrics were included but without a time window to measure the success of these key metrics.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 618, "q0": "The goal of this proposal challenge is to create solutions that apply to many different developing countries. Differently from other challenges where the focus in a specific geographic location, this challenge tries to include all the developing countries at the same time, and I believe this approach makes a lot of sense since many solutions might work on different places that are facing similar issues. As mentioned in the challenge brief, there is also the possibility of applying solutions already developed for some places, for example, to other places that could benefit from it, not necessarily creating completely new projects and solutions. Since the scope of the projects is not limited, but only the countries that would be able to submit proposals in this challenge, all the goals of Cardano’s mission for Fund 10 can be covered in this challenge, although it is not guaranteed that they would be covered. Overall, the alignment of this challenge with Cardano’s mission is good.", "q0r": 4, "q1": "This challenge proposal covers many of other already funded challenge settings, such as the ones related to Africa, Latam, India, Asia, etc. These communities are already part of Catalyst and I have no doubt they would be able to propose and successfully deliver proposal in this challenge. The budget for this challenge is 1M ADA, which is high but considering that it would be covering all developing countries, relatively it is not so high. Also, there have been many proposals that already got funded and delivered that could be submitted in this challenge. I believe the community is completely capable of making this challenge a success. The challenge team of this challenge proposal is yet not defined, but I know the proposer of the challenge and he is well connected in the community, and I believe it wouldn’t be hard to find interested community members to take this role. Although, since it’s not defined yet, this may cause some friction at the beginning of Fund 10.", "q1r": 4, "q2": "The KPIs included in the proposal are good to track its success. All of them can be measured, some more easily and some not so much, but at the end all of them can be. It would be interesting to include KPIs specific to the common challenges that were mentioned in the challenge brief, for example, KPIs related to projects that are dealing with awareness & understanding, innovations, regulation, etc. This would give insight about not only the overall success of the challenge, but also what are the areas that are currently benefiting the most with the use of Cardano and blockchain. But this is something that could be added to what was already proposed, and I believe that the KPIs proposed are good enough and the challenge team and community will be able to verify this challenge’s success in case it gets voted in for Fund 10.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 858, "q0": "This challenge proposal aims to try a different approach to a type of challenge that we have regularly had in Catalyst. In Project Catalyst, there have been challenges, such as \"Grow Africa, Grow Cardano\", \"Grow Latin America, Grow Cardano\", \"Grow India, Grow Cardano\", etc., which are positive in that they have budgets to solve regional problems, but may restrict the opportunity of those in other regions to take advantage of the solutions. It appears to me that when viewed from this perspective, it has a better alignment with Cardano's mission. However, I feel that leaving the term \"socio-economic conditions\" without further explanation could be confusing and would add to the difficulty and transparency when discussing global issues. A model reference would be the Human Development Index (HDI) promoted by the Human Development Report Office (HDRO) which measures not only financial factors but also health, education, and a decent standard of living. Compared to the strategic objectives of the next fund, I find a clear alignment with at least two of the four objectives as it can prepare people to contribute to the ecosystem while on the other hand, it can create the conditions for developing real solutions.\n", "q0r": 5, "q1": "Since the conception of Catalyst we have had multiple challenges and proposals that directly or indirectly want to address the type of issues that are included in this challenge. We have the \"Grow Africa, Grow Cardano\" challenge in Fund 9 with an allocated budget of $500,000 in ADA and 106 competing proposals. There is also \"Grow East Asia, Grow Cardano\" with an allocation of $250,000 in ADA and 73 competing proposals. Considering the above arguments, it can be concluded that the community has the capacity to address the upcoming challenge and that the $1,000,000 budget is appropriate for the project. The team that prepared this proposal has not yet defined the challenge team, but considering the community's affinities with this type of challenge, I do not anticipate that this will be a problem in the near future.\n", "q1r": 5, "q2": "The author of the proposal presents an appropriate and easy to understand description of success. The metrics presented are a combination of metrics that seek to measure the success of this challenge itself (as one more iteration within this grand experiment), as well as metrics that are intended to serve as a guide for future proponents. There is an excellent job being done in describing the common problems found in these areas, as well as providing a good description of the directions that could be expected in the proposals that fall within this challenge. As a recommendation for future challenges, it would be interesting to include within the considerations to be taken by proposers as well as for the PA/vPA community the definition of communication and reporting channels between teams and the Catalyst and Cardano community in general.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1462, "q0": "Despite some of the controversy surrounding the wording of this challenge setting, it is a wholly worthwhile undertaking and clearly aligns with the strategic goals and missions of Cardano. Leveling the playing field by equalizing opportunities through the use of blockchain is a recurring theme in the sermonology of one Charles Hoskinson. No one can assess the needs of the population of developing nations better than the inhabitants themselves. Creating a collaborative platform to elevate those voices is a noble endeavor that can efficiently accelerate mass adoption and drive appropriate, targeted innovation.", "q0r": 5, "q1": "The Cardano community is extremely diverse, economically, culturally, and geographically. Exploiting this diversity will enable this challenge to be successful, thus, it is very realistic to foresee great accomplishments deriving from this proposal. Cardano is already operational in many countries that are considered to be developing nations. Amongst all blockchain communities, we alone are the most well adapted to successfully execute this critical challenge.", "q1r": 5, "q2": "A few of the metrics used to assess KPIs for this challenge may be difficult to evaluate numerically, but on the whole, this proposal has more than enough quantifiable indicators to provide a robust and detailed audit. Most of the measurable metrics can be easily verified. Perhaps the biggest obstacle to account for in regards to auditability would be the language barrier. Adequate levels of translation service could effectively eliminate this barrier.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 3271, "q0": "The suggestion of this challenge setting is to increase the collaboration across regions and continents when considering Catalyst funding targeted at developing nations.  The standard procedure at this point is for a geographic region to propose a \"Grow Region\" challenge setting.  This proposal seeks unite all such challenges under a collaborative heading.  One issue this creates is that for projects with no reasonable need for collaboration outside their region (and there are many of these due to the nature of regionality itself) you really still need the other challenge setting, so their is risk of allocating too many funds to this area. (Perhaps a middle ground would be to encourage these other regional challenges to adopt this regional collaboration language, and to prioritize such goals through their metrics.)\n\nIn terms of Fund 10 alignment, Goal 3 is a particulalrly strong area, with real world solutions being a key deliverable here.  Improving human process and tooling (goal 4) and preparing people to contribute (goal 1) are also well represented in the list of proposals to consider.  It should be remembered that RealFi in these developing nations will amount to access to decentralized global markets through global finance participation, so this kind of cross-region collaboration is built into many of our assumptions about Cardano's sucess in this area.\n\nBecause of strong alignment with most Fund 10 goals, I feel that this proposal merits full marks for alignment, 5 stars.", "q0r": 5, "q1": "There is excellent support and guidance provided here for proposers under this challenge setting. 9 general areas where proposers could apply themselves, along with 5 general examples of types of proposals allow for good orientation to the fund goals through this challenge, and provide plenty of inspiration for how a proposer might interpret and apply these goals to their projects.\n\nIf there is an issue, it is that it quite explicitly pins these proposers down into this collaborative mindset, so a project with no reasonable means or need for this kind of cross-border collaboration will not be able to bring itself into alignment with this challenge, and will need to look to other funding challenges, so the budget here of $1m may end up being too high due to this exclusion.  Given that it is an experimental idea as well, $500k is the usual entry point, and would have suited this proposal better.\n\nOne area of interest, is an idea expressed in the comments that these types of challenges that rely on definitions of socio-economic regions have issues related to being too inclusive or exclusive because of our inability to parse the particulars of these definitions.  I actually think this kind of cross-border interoperability (poverty is a shared problem with a common language) can help with this issue.  An example is that in \"undeveloped\" countries you may have regions that are swimming in wealth due to foreign infrastructure investment etc.  On that same note, there are areas of \"developed\" countries that have been left behind, and which experience unemployment, impoverishment or lack of food security as poignant as anywhere else.  The ability to connect people in these neglected areas to eachother and to the wider world of opportunity and innovation is definitely a shared, borderless problem.\n\nBecause the team has provided excellent guidance for proposers to build effective proposals from their ideas I believe there is a solid foundation here.  But due to a budget that is too high for both an experimental category and one that is borrowing bandwidth from other still necessary challenges, I am going to give 4 stars for Feasibility.", "q1r": 4, "q2": "There is a fantastic list of KPIs here both measure success as well as how proposers can prove iterative progress towards their goals.  The objectives laid out in the metrics would effectively represent the culmination of this cross-border approach to problem solving, and in particular the areas where it suggests applying existing solutions across multiple regions, which would require on the ground teams across these regions, is a great way to get the information from that collaborative process captured.\n\nBecause the team has provided KPIs that support the proposers in formulating goals and objectives that align with the Fund 10 goals, I believe this proposal merits the full 5 stars for verifiability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4435, "q0": "Personally love this idea to make it a challenge setting for Fund 10. Main idea is how developing countries \"develop\" each other with their successful solutions. So Developing Countries could trade ideas and could modify them so it can be applied in each area.\n\nThere's two things Proposer should clearly explain are, First the list of developing countries in 2022. At least references / link from Wikipedia would make. Secondly, when Proposer wrote in the proposal \"...to increase communication, coordination and collaboration between developing countries on different continents.\" There are 94% of the world's population does not speak English as their first language. 75% do not speak English at all (source: bws-school.org.uk). It should be consider as challenge for this proposal too.", "q0r": 3, "q1": "Requested budget is reasonable since Proposer want to engage users in Developing Countries to create a collaborations.\nThere's one thing to describe in this proposal. Proposer didn't mention any of Challenge Team will handle this Idea. Any experience in our communities such as \"PA / vPA for x fund\" can make us (PAs & voters) consider this Challenge Setting would be handle easily by the team.", "q1r": 2, "q2": "Those success criteria and suggested metrics are aligned and this is are doable things to measure. The proposer also provides us with examples of what projects can be created in this Challenge Setup. This will be very helpful for future proposers.", "q2r": 4, "assessor": "z_assessor_2553", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4916, "q0": "Going beyond mere regional Challenge settings, the idea for a socioeconomic-based Challenge setting is a worthy addition to the socially and economic-development minded nature of Cardano. Rather than focusing on Asia or Africa, this setting aids in achieving Cardano´s mission of assisting the economic development of less fortunate regions of the world in one fell swoop, rather than on a geographic case-by-case scenario. Furthermore, as a transversal initiative, it fosters decentralized initiatives that may materialize and be implemented simultaneously across the developing world, heeding the ethos of our ecosystem from the get-go.", "q0r": 5, "q1": "The proposer is a recognized part of the LATAM Cardano Community and even EMURGO Academy. He has a proven track record of engagement with Catalyst and Cardano, and as his engagement with comments on this setting suggest, he is mor ethan willing to acknowledge credit where it is due and has no qualms in admitting errors, due to the fact that what we are building is bigger than any one of us. As the proposal indicates, salutions remove boundaries, and that is what we must aspir to as a decentralized community and the largest decentralized VC experiment in the world.", "q1r": 5, "q2": "The key metrics suggested, coupled alongside concrete examples of international collaborations that may be addressed in this Challenge setting, are adequately set to allow for progress measurement. KPIs such as growth of on-chain activity due to the coordinated application of solutions in developing countries on different continents, number of proposals, number of technical implementations, projects and Dapps providing solutions to common problems in developing countries, number of events/workshops/sessions connecting efforts of developing countries, number of ongoing initiatives with teams whose members come from developing countries from different continents, all serve the main goal of auditing the success of this Challenge setting.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6334, "q0": "This challenge intends to incentivize proposals from developing countries instead of focusing on a specific region. It wants to bring people from different developing countries together to solve the problems in their countries by collaborating. I agree with the author that many developing countries have some common issues. But, the collaboration between individuals from those countries may or may not help solve those problems, and it will have its problems. But anyhow, the best practices and tested solutions can be implemented by teams to take the maximum advantage.\nIn the challenge question, the author’s perspective is to support developing countries’ proposals based on their socio-economic conditions, but in the other part of the challenge, the author emphasizes collaboration more. I like the first perspective to support developing countries, but I am skeptical about the collaboration aspect. As a side note, already several proposals teams work in African countries and Japan; the team members come from different countries.\nThis challenge’s proposals, if successful, will bring in people who will be able and wants to contribute to our ecosystem. It will also help grow the developer and DApps ecosystem. Furthermore, depending on the proposals’ success, it will be helpful for Cardano adoption. \n \nI am rating it four stars because I concur with the author on focusing on developing countries instead of specific regions. On this point, this challenge can be a better alternative to some region-specific challenges. However, on the other hand, I am skeptical about the collaboration aspect as I think there will be certain hurdles in that approach, such as language.", "q0r": 4, "q1": "If we are considering the developing countries, we have seen many proposals in the current & past funds coming from developing countries such as Indonesia, Vietnam, Ethiopia, etc. Hence we can see similar participation in this challenge if we do not emphasize collaboration.\nAs this type of challenge is being submitted for the first time focusing on developing countries and collaboration among them, it should have started with a reasonable budget of 100k to 250k and not with $1 million. It may be appropriate if we have to replace region-specific challenges. But if we restrict the proposals to ‘coordination from different countries,’ I suspect the participation in proposals submission will be low.\nGiven the above two points, I am rating it four stars.", "q1r": 4, "q2": "The author mentions several metrics such as ‘the number of proposals participating, the number of technical implementations, the number of events/workshops, the number of ongoing initiatives, etc., which are useful only to measure the success of the challenge.\nNo metrics are provided for tracking the proposals’ progress or auditing them. Hence there is room for improvement in the challenge in terms of ‘metrics for proposals.’ However, the author does mention the examples of proposals expected under this challenge which can be considered to derive the proposals’ metrics. \nAs stated by the author, the success of this challenge will be the solutions implemented in developing countries obtained through the collaboration and working together of teams from different developing countries on different continents.\nI am rating four stars as there is room for improvement in the challenge regarding proposals’ auditability metrics.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "importance": "Global dialogue has the opportunity to find its own way. Similar problems present similar opportunities for solutions.", "success": "Problems from different continents converging on common ground. Solutions remove boundaries."}