{"id": 417316, "author": "easterntownhall", "title": "Grow E. Hemisphere, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/417316-48088", "category": 26604, "amount": 500000, "description": "How do we grow the Cardano ecosystem in Eastern Hemisphere in an inclusive and supportive way? The same way we do in Africa, focused initiatives!", "f6_no_assessments": 8, "f6_rating": 4.749999999999999, "videos": [], "media": [], "f6_assessments": [{"id": 152, "q0": "This is a challenge from the \"Grow(location), Grow Cardano\" series. The inspiration for this series began with the aim of focusing on the local development of Africa, over time new series challenges were created, each to encourage the development of a local community.\n\nThe scope of this challenge is within the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n\nI know this challenge is important from the point of view of distributing the community in the Eastern Hemisphere and driving mass adoption there. The fact that a large part of Cardano's technical community is located in North America and Europe is a problem. There is a geographic centralization of SPOs which is a point to be improved. Due to these points it is possible to associate the importance for Cardano, but I would have liked to have seen more arguments and information about the context of the Eastern Hemisphere to understand how critical this challenge will be in the Cardano mission.\n\nI have seen a large number of challenge settings resorting to the use of \"catchy phrases\" to get the attention of the community and I don't consider it a good practice unless arguments or sources are added so they can be contextualized without looking like just a marketing appeal . I would recommend avoiding using definitions like:\n\n\"Activate the Cardano community's ability to recognize, reward the opportunity to make the world a better place.\"\n\nAll challenges are intended to somehow make the world a better place, which is amazing, but it's not a valid argument for evaluating a challenge setting realistically.\n\n\"Eastern Hemisphere is fertile ground for the adoption of Cardano\"\n\nWhy is the Eastern Hemisphere fertile for adoption? Are there any social or economic aspects that indicate this? If it exists, it would be important to provide an appropriate context with arguments and sources so that it can be properly evaluated.", "q0r": 4, "q1": "This challenge setting has a broad scope, allowing a wide variety of proposals in different niches, which indicates that the community should have no problems addressing the challenge. Cardano also has a large community in the Eastern Hemisphere.\n\nThis challenge setting overlaps with other challenges from the \"Grow(place), Grow Cardano\" series, I am inserting the links with the related challenges in case voters decide to prioritize certain challenges.\n\nhttps://cardano.ideascale.com/c/idea/419157\nhttps://cardano.ideascale.com/c/idea/413991\nhttps://cardano.ideascale.com/c/idea/421545\nhttps://cardano.ideascale.com/c/idea/414030\n\nI would recommend coordinating the definition of challenge settings with the other proposers in order to avoid overlapping themes. Overlapping themes brings uncertainty about demand for certain challenges and makes it difficult to assess feasibility. I will not deduct points from this criterion as each challenge setting needs to be evaluated independently.", "q1r": 5, "q2": "The definition of success is appropriate to the context of the challenge. Several key metrics relevant to the context of the challenge setting were included, which allow measuring the number of proposals and new onboarded members, number of stake pools, impact of proposals and auxiliary metrics for evaluating the quality of the created solutions.\n\nI would recommend including a timeframe to check the challenge's success.\n\n\"At the end of this challenge...\" When would it be considered the end of the challenge? Having a time frame helps in the clarity of the outcome and in the evaluation of the proposed key metrics.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3007, "q0": "I am abosulutely sure that it is vital to address different parts of the world directly and intentionally through funding challenges to make our community more accessible. Decetralization of the ecosystem will come, if people from all around the world get familiar with Cardano's concept, start building on it or even start making use of its variant products. As in Africa, raising the awareness and education levels of the Eastern Hemisphere countries about blockchain and the Cardano network should be a priority for the Catalyst community for the Cardano's mission to be achieved. ", "q0r": 5, "q1": "Given that the only requirement of this challenge and the proposals that are and will be built on it is to originate or focus on Eastern Hemisphere countries and include Eastern Town Hall members, makes this challenge easier to be addressed. Let's nor forget that EMURGO started in East Asia and focuses on it when it comes to the lessons provided or the open working positions. Why not enhance this try by increasing adoption in the part of the world? The whole community could a part of this project, but the people living in the Eastern Hemisphere are going to play a huge part in this project, increasing the number of stake pools being run for example. For such a big project, the results might not be visible on the first 6 months but will be overtime and they will be huge, considering the mass adoption that will take place. \n", "q1r": 5, "q2": "We have well-defined success criteria and success metrics that are long-lasting in multiple funds that need minimal adjustments to meet the strategic goals. They are precise yet give enough room for a wide variety of proposals. There are 7 metrics that refer to all the individual features of the Cardano ecosystem, such as the stake pools, the active Wallets, the participation of the Cardano and Catalyst community as it will be a key metric to see an increase in proposals refering to the Eastern Hemisphere or that were proposed from community members living there. There are even specific questions about the quality of the proposals, which makes it even more likely that this challenge will be auditable/verifiable by the community. ", "q2r": 5, "assessor": "z_assessor_2385", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 3273, "q0": "This is one of the fastest growing areas of Catalyst and Cardano, the E.Hemisphere.  In theory, it is by far the largest population base of any \"sector\" of Catalyst to date, yet participation from this sector, while accelerating, is low in comparison to other areas. (Just as a side note that may not mean anything: \n I have done a lot of data analysis regarding past challenge settings and wallet participation, and there are data outliers that appear whenever you have anything even remotely Japanese related...two of the highest positive vote ratios ever in Catalyst, alongside such luminary ideas as DAO reporting, NFT marketplace and SPO tooling (all areas of extremely high participation in Cardano), were two proposals for *surveys*...but they were surveys taking place in Japan.  Methinks there is a there, there.)\n\nThe challenge aligns well with the goals of Fund 10 that are related to preparing people to contribute (#1) and to improving the UX for humans (#4), as this is a challenge that is looking to make Cardano and Catalyst accessible to a whole cohort of new users and developers.  The focus on the developer pipeline, in particular, should really tap the E.Hemisphere into Cardano (and I would suggest particular focus for Vietnam for this area, where a ton of critical development on other blockchains is being sourced and where there is a good regulatory and collaborative legal environment being cultivated...Cardano could be the key to keeping something like that rooted in solid principles).\n\nBecause the team has provided a means for proposers under this challenge to create relevant proposals that deliver on Fund 10 goals, I believe this proposal deserves high marks for Alignment:  5 stars.", "q0r": 5, "q1": "The proposal is really well structured and provides both a solid narrative for the \"why\" behind proposals under its umbrella, but also lots of examples to give some direction and inspiration to those teams.  Given the growth being experienced and the metrics that indicate the potential, and given that the challenge team is deeply involved in cultivating the participation they are seeking to drive with this challenge, this is definitely a challenge that the Cardano community is ready for, and even needs.\n\nThe budget at $500k is at the standard level for a regionally targeted \"Grow X\" proposal, and we have seen such proposals generate a ton of participation in Catalyst over the last few funds.\n\nBecause the proposal gives good guidance and support for proposers to define the scope of their ideas under the challenge setting, and because the budget has been set reasonably, I feel this proposal merits a full 5 stars for Feasibility.", "q1r": 5, "q2": "The metrics provided are high quality metrics that will help teams set objectives, but this proposal team goes yet a step further and describes an internal process they will be engaging in with proposers to really help drive innovation in this space if it is provided.\n\nThis internal process deserves some study by other challenge setting proposers as I think it lays groundwork for how a challenge team can approach the idea of providing high level support for ideas under a challenge umbrella to really iterate and develop during the submission process.  Just a quick example, but specifically counseling proposers on addressing the sustainability of their ideas beyond Catalyst is an area where every challenge setting could improve drastically (and no, an ICO is not the answer, lol).\n\nI believe this proposal warrants a full 5 stars for verifiability due to the exceptional support and guidance it has provided for proposers to craft meaningful objectives and reach them successfully.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4282, "q0": "I totally support this challenge setting of bringing together people across Eastern Hemisphere countries to grow Cardano's ecosystem. And yes, the main pain point is education. I would love to see various communities' proposals to this challenge. This is going to be a great social experiment on how to also empower people from non-English-speaking countries to be actively involved in Cardano.", "q0r": 5, "q1": "The team behind this proposal is a well-known Eastern Townhall team who already has experience in Project Catalyst. But, I have several concerns about how the team would approach people from different countries with different cultures and languages. How would the team manage the different time zones of each Eastern Hemisphere country? The team needs to do a lot of meetings, and, one of the ideal solutions is for each Eastern Townhall team member to be able to speak one of the local languages to communicate clearly with the new members.", "q1r": 4, "q2": "I believe we will see some increment in the proposal numbers from Eastern Hemisphere countries. But the KPI itself needs to be defined as not too aggressive nor pessimistic in order to really see quality proposals coming out of this challenge. And, the KPI also needs to take into account the Eastern Townhall team's capacity to assist the proposers from end to end (something like mentoring) until they can help themselves up and help other new members later.", "q2r": 4, "assessor": "z_assessor_2542", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 4440, "q0": "I am personally aware that Proposer change the scope from East Asia to Eastern Hemisphere, which is great! As far as I know, the existing country who joined the Eastern Hemishphere Town Hall still only Japan, Viet Nam, Indonesia, Australia + NZ and East African region. With this Challenge Setting, Eastern Town Hall wants to expand its scope to others region (such as: North Asia, Central Asia, South Asia, and Western Asia) with this Challenge Setting. By having this challenge in Fund 10, hopefully, it would attract more and more friends from other countries in East Hemisphere that haven't been reached until now.", "q0r": 5, "q1": "Definitely yes the Eastern Town Hall community has the capacity to address the challenge because they already do it on previous Funds. Bring the challenge back to Fund 10 plus widen the coverage from East Asia -> Eastern Hemisphere will help some proposers who not the winner on Fund 9 improve their proposals and joining the challenge one more time. By expanding the coverage area, Proposer is also aware of the doubling up of the budget. With that, the Challenge will cover much proposal in wider community.", "q1r": 5, "q2": "The Success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. However, I believe the team will find the right metrics for the reporting purpose along the way. Communities could see the results from more IdeaFest Reels which will hosted by Eastern Town Hall.", "q2r": 5, "assessor": "z_assessor_2553", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 6336, "q0": "Eastern Hemisphere is the birthplace of many blockchain projects. The Cardano was also born in Eastern Hemisphere, Japan. It is the home of Emurgo, one of the founding members of Cardano. Apart from this, the projects like Axie Infinity originated in Vietnam. Several big exchanges and blockchain platforms are operating in Eastern Hemisphere. It shows the region's interest and willingness to participate in blockchain projects. This challenge will help utilize the region's curiosity and capabilities to add value to the Cardano Ecosystem. \n \nThis challenge can help onboard the people and developers from Eastern Hemisphere who will be capable and wants to contribute to the Cardano Ecosystem. The developers and builders from the region will help grow the developer and DApp ecosystem. Thus this challenge will help in achieving the strategic goals. \n \nAs happened in the past funds, we can expect many proposals ranging from DApps, NFTs, Technical Community, and Outreach. This challenge will act as a springboard for Cardano Adoption in Eastern Hemisphere with all these proposals. In addition, these proposals' projects can scale to serve the global population. Given all these points, this is one of the important challenges for Cardano's mission. ", "q0r": 5, "q1": "This challenge with the name of Grow East Asia, had a budget of $100,000 in Fund 8 and had seen thirty-four proposals submitted, out of which it funded eight proposals. In this Fund 9, the total number of proposals submitted is 84. These two funds show the capability and willingness of the Cardano community from the region to participate in Catalyst via submitting proposals and subsequently building on Cardano.\n\nAs mentioned above in Fund 8, the budget was only $100,000, which was only enough for the eight proposals. In Fund 9, it has been increased to $250,000 to include more projects. Now for Fund 10, the author again increased the amount to $500,000, which I think is a bit early. I suggest they see the proposals' submission and their quality under this challenge in Fund 9, then think about increasing the challenge amount.\n\nAlong with the other regions like Latin America and Africa, Eastern Hemisphere has regular Townhall meetings and a dedicated community. Anybody interested can reach out this community on Telegram and Discord. Also, in the last few Funds, the community voted for this challenge. Therefore, a challenge team is already available who can serve again if this challenge is selected.", "q1r": 5, "q2": "The author mentions several metrics that can be used by interested parties to measure the success of the challenge. However, no metrics are mentioned to track/audit the proposals' progress. For example, based on my observation of other challenges, if the proposals are about onboarding people from Eastern Hemisphere into Cardano, then the metrics can be the number of people brought in. But, on the other hand, if it is a development proposal, the metrics can be the GitHub commits, achievement of milestones, etc. Hence there is a need to improve this challenge on the above point. \nThe author does mention the success criteria, which is 'people across or connected to Hemisphere coming together & forming teams to grow our Cardano Ecosystem.' Anyhow it is a brief statement that the author can further elaborate. ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7788, "q0": "This challenge focuses on growing the Cardano ecosystem towards the Eastern Hemisphere as the Cardano community is currently concentrated mainly in Europe and North America. This area is home to more than 80% of the world's population and has a lot of potential for growth in the long term. Promoting the development of the Cardano ecosystem towards this area helps the Cardano ecosystem to become more and more decentralized. It is also one of Cardano's important missions: \"Turn Cardano into an open source project\" & \"Prepare a group of people willing and able to make contributions to the ecosystem\". Therefore I rate this project 5 stars according to Alignment criteria.\n", "q0r": 5, "q1": "The team that launched this challenge, Eastern Townhall, has extensive experience in the Catalyst project with many successfully funded and implemented proposals. Their ability has been proven over time, so they are fully qualified to take on this Challenge. The focus of this challenge is on education to create more and more developers for the Cardano platform and gradually be able to develop independently from the West. Although in terms of technology, Eastern countries may be behind, they always have a young, abundant and highly specialized workforce. For example, India is very famous for IT. This proposal requests a funding amount for this challenge of 500,000 ADA which I think is reasonable. Therefore, I strongly agree with the Feasibility criteria: 5 stars.\n", "q1r": 5, "q2": "The proposal provides 7 criteria to evaluate the progress in problem solving of the Challenge. These criteria are all quantitative, so it is relatively easy to test such as the number of projects, the number of wallets, the number of pools, etc. In my opinion, these criteria are enough to ensure the success of the Challenge in developing the Cardano ecosystem towards the Eastern Hemisphere.\n", "q2r": 5, "assessor": "z_assessor_2922", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11698, "q0": "the challenge being proposed here is definitely aligned to the strategic goals for the fund (Prepare a group of people willing and able to make contributions to the ecosystem), and cardano's mission as a whole. The nature of this challenge itself, to grow the eastern community (this is focused on eastern hemisphere as a whole) has been a recurring theme across the past few funds of catalyst now, indicating that there is a clear demand for this. it shows that the cardano community is time and time again, on a longer journey to grow the eastern community as a whole. to name a few, there was the South East Asia Challenge, East Asia Challenge, Grow India Challenge, etc. ", "q0r": 5, "q1": "Considering that this has been a recurring theme for the past few funds of catalyst, I can comfortably say that the challenge is realistic (the community has the capacity to address this challenge) and will attract a decent number of proposals, as a recurring fund to grow cardano's presence in the region. In the brief, i appreciated the fact that the proposers was able to list down the specific regions that it aims within the eastern hemisphere. at first glance, the challenge seems too broad and has no focus, and i feared that it will attracted too much a variety of proposals and the messiness may cause problems down the road when its time for assessment when some proposals may require special expertise. however, looking at it in more detail, the intention of the challenge was to make the cardano ecosystem more robust and have people working, using, and interacting with cardano within the hemisphere. while i think the mess will still be a problem, at least the intention was made clear and addressed by the team.\n\n compared to this round's challenge to grow east asia, the budget proposed has doubled to $500k. i think this is reasonable, seeing that every round of catalyst sees an increase in number of proposals, and more assessors. the increase in budget allows headroom for larger projects with bigger and bolder ideas to come onboard without fear of an upper limit for funding.", "q1r": 4, "q2": "the measures proposed are clear to gauge the success of the challenge and I believe that the scope is wide enough to cover a wide variety or possible proposals to be submitted under this challenge in the future. the challenge team even elaborates a separate set of questions to assess the quality of proposals, besides those measures that they have for the challenge itself. this aspect of the proposal is very well done and clear.\n\n if i may add with my limited knowledge, a feedback i would give is to look in past funds and see how many past proposers from south asia are a recurring proposer, and add these segments as a measure for the challenge as well. that will let us know the trajectory of south asian proposals, whether they are the same people over and over agian, or are they new people to join only in the future fund, fund 10.", "q2r": 5, "assessor": "z_assessor_3270", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "importance": "The Cardano community leans heavily toward North America and Europe. Growth elsewhere requires our support and initiative as a community.", "success": "A broad spectrum of people across Eastern Hemisphere assisted by the Eastern Town Hall, coming together and growing our ecosystem together."}