{"id": 417629, "author": "chriskellerracing", "title": "Challenge Teams Process Updates", "url": "https://cardano.ideascale.com/a/dtd/417629-48088", "category": 26604, "amount": 900500, "description": "Catalyst has run Challenges in fund 7&8. After iterations and two rounds of Leading Dapps and Integrations I have revised a process to make challenge teams more effective at their overall goal. ", "f6_no_assessments": 9, "f6_rating": 3.2592592592592586, "videos": [], "media": [], "f6_assessments": [{"id": 95, "q0": "The idea of improving the performance of challenge teams is certainly aligned with Cardano’s mission and the Catalyst modus operandi as of now. However, I remain a bit confused. Was this proposal well written as a challenge and designed as a challenge? Seemingly not completely. The proposer states that he has been a member of a challenge team for the Dapps and Integrations challenge for the past two funds and has ideas on how to make challenge teams more efficient. This is excellent as Challenge Team members are good sources of information on how to improve the process. What seems unclear to me is what kind of challenge is this specifically. It has a very large budget of ADA900,500. This means that future proposers in this challenge in Fund 10 would submit proposals to tackle the Challenge question. Yet, when I look at the question –the question for the future proposers seems to be a statement: “Catalyst has run Challenges in fund 7&8. After iterations and two rounds of Leading Dapps and Integrations I have revised a process to make challenge teams more effective at their overall goal.” Effectively, the proposer here does not invite ideas from other proposers in the Fund 10 challenge. There is no question and the proposer states that he has a solution to make challenge teams more effective. Hence, this proposal is somewhere in no man’s land between a Challenge Setting and an regular proposal. If it is not approved in this round, I would advise the proposer to rewrite the Challenge Question as a question and to expand on the importance of the issue. Currently, the proposer states – when talking about the importance – what has he and his team done. [“We have taken Onboarding, Proof of Life, Collaboration, Teambuilding to new levels within our team.”] – however, this is a proposal for a future challenge and it should reflect the importance of the challenge for the entire Cardano ecosystem. ", "q0r": 3, "q1": "The proposer states that the brief of the challenge is to better define the roles of the Challenge teams. Indeed, the Catalyst community certainly has the capacity to achieve this – as stated. The issue that I find somewhat confusing with this proposal for a Challenge is its outsized budget of almost 1 million ADA. I am certain that the community can submit proposals to “better define the roles of the Challenge teams” – although I can not ignore the fact that it might not be feasible to spend almost 1 million ADA in a rational manner on this process. The proposer might have meant that the budget is to be distributed among some future Challenge Teams or to fund the research behind better defining the roles of the Challenge teams and experimenting with different processes. The challenge brief does specify that part of the funding can be used to fund “Challenge teams for continuing support” – however, it would be good to have some criteria as 900,500 ADA is a lot of money. It is unclear whether the 900,500 ADA is a one off for funding Challenge Teams in Fund 10 or 11 … or for many funds. Hence, the use of more precise language would help guarantee the feasibility of this challenge. If this challenge is resubmitted in the next fund (if it does not obtain sufficient support) – I would advise the proposer to rewrite the challenge for more clarity about what is exactly expected from proposers – and to include a question in the Challenge Question field. Maybe also good to avoid references to “We have” and “I have” – and to use generic language – in order avoid muddling the waters between a Challenge and an implementation Proposal. ", "q1r": 3, "q2": "The key metrics to measure the success of this challenge include some metrics that are already used as deliverables criteria for challenge teams – such as “Challenge Setting Town hall video presentation” and “Effective outreach/encouragement to new proposers that meet Challenge”. These two things have been required from a challenge team members in previous funds, as was another of the listed metrics: “Early feedback to help projects meet goals” – in effect, challenge teams already are required to hold Office Hours in order to communicate with funded proposers inside their challenge, thus allowing for early feedback from the challenge team and an exchange of ideas. Hence, I would say that practically all of the key metrics of this challenge are already in some form part of the Challenge Teams’ modus operandi and might seem not so relevant for a new challenge in Catalyst – as they are already inbuilt. If this challenge is not selected by voters in this Fund, I would advise the proposer to resubmit with some key metrics for this challenge that would go out and beyond the existing Challenge Team scope. The challenge brief inside this proposal for a new challenge seems to be the strongest and most original part of this proposal and if this challenge is not voted in, I would advise the proposer to work on expanding the challenge brief into a more substantial and approachable challenge for future proposers. ", "q2r": 3, "assessor": "z_assessor_2047", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 154, "q0": "The challenge question does not contain a question.\n\nThe Challenge Teams model was created to better coordinate the cohorts as the large number of challenges and proposals to each Fund has caused confusion and lack of accountability.\n\nThis challenge setting contains little information to evaluate. In the challenge brief it is described:\n\"This Challenge is to better define the Roles of the Challenge teams.\"\n\nHowever, no context was given as to why it would be important to better define the roles of Challenge Teams. What are the identified issues and why this challenge setting is critical in the Cardano mission.\n\nThere is not enough information to make a proper assessment of how critical this challenge setting is as there is no well-articulated rationale for this challenge proposal. If we consider the idea that Challenge Teams is a sub-theme for improvements in Catalyst governance, I see this aspect as important in the Cardano mission and in line with the Catalyst Fund9 Challenge Setting Strategic Goals, but it is necessary to better articulate the concept.\n\nThe bullet points described in the challenge brief seem more like deliverables from a proposal and not from an open ended challenge. Are these items potential directions/suggestions or requirements for proposals in this challenge?", "q0r": 2, "q1": "Considering the amount of budget requested in relation to the Fund10 budget (about 8%) and the fact that this challenge setting has a scope apparently dedicated only to solutions for Challenge Teams, I don't see enough demand for the community to fill this challenge with proposals in quantity and quality. Also it is not clear what the concept of this challenge is, there is only one line in the challenge brief, the rest are areas of interest or perhaps requirements to participate in the challenge (no mention).\n\nThe activities mentioned in the bullet points in theory should already be incorporated into the work and remuneration of the challenge team, I do not understand the meaning of a challenge setting for activities that are already remunerated and conducted by the challenge teams. I may have misinterpreted it, but due to the lack of rationale there is no way to be sure.", "q1r": 2, "q2": "The definition of success and metrics are related to the work already carried out by the challenge teams, so they are plausible, but it is not clear if this challenge setting is intended to rearrange the current funding model of the Challenge Teams or to be an alternative/complementary source of funds.\n\nThere is no time frame to assess the definition of success and proposed key metrics.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 625, "q0": "I like the idea of having a challenge setting specific for challenge team improvements. Although, I don’t think this challenge proposal was written in a way that would create a challenge that would help to improve the challenge teams for the next funds. The first point to be mentioned is the budget, which is almost $1M and in my opinion is way too much for this topic. Such a challenge should have proposals that would, for example, have defined budget to increase the effectiveness of challenge team if they execute some tasks that are currently not their responsibility, as state in the challenge brief, for example, ‘Critique new proposals before CA Assessments’. There are goals to what a good challenge team would go, and ways to measure their performance, but it is stated that this challenge exists to help defining the roles of challenge teams, like ‘Outline Checkmarks for meeting goals’, ‘Create collaboration environments between similar proposers’ and other things. These things would be developed by a quick research and proposition of guidelines for challenge teams, there isn’t much to do to consume the $1M budget. Although the challenge proposal is aligned with Cardano’s mission for Fund 10 to improve the human processes in Catalyst, I believe this proposal should be re-written taking into consideration the topics I mention in this assessment.", "q0r": 2, "q1": "The theme of challenge teams has been discussed a lot recently and the community knows that there are many improving points already, for example, the budget distribution between challenge teams that are responsible for challenges with very different number of funded proposals, lack of clarity about the challenge teams’ scope of work, the process of choosing a challenge team, and others. I don’t think it would be difficult for the community to come up with many good proposals for this challenge. On the other hand, in my opinion the budget of this challenge proposal is completely wrong. It should be maximum $100k and having a 1M ADA, potentially $1M, doesn’t make sense especially since these improvements should be done step by step instead of all at once. There would probably be a huge leftover in this challenge, or many redundant proposals being funded at once. If the budget was lower, this challenge proposal would have a much better feasibility.", "q1r": 2, "q2": "There are almost no metrics presented to track the success of the challenge. There are some points mentioned to be used to assess the performance of a specific challenge team, for example, ‘Outline Checkmarks for meeting goals’, ‘Create collaboration environments between similar proposers’, but these is not the way to evaluate the challenge’s success. There should be metrics to measure the successful implementation of the proposals funded in this challenge and their outcome, for example, number of improvement suggestions to the challenge team process, number of suggestions accepted by the community, and other related metrics. The way this challenge proposal was written, it has a very low verifiability.", "q2r": 1, "assessor": "z_assessor_2110", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 860, "q0": "The focus proposed by the author of this challenge setting is to improve the processes that are the responsibility of the challenge teams. According to the last presentation I found available made by Kriss Baird on February 16 (take as reference the docs available in the Iterative Dropbox v2 - shorturl.at/himt1) the challenge team has essentially 3 deliverables, TH presentation, Cohort Onboarding and ROI retrospective, with an estimated effort of 20 hours. TAccording to the author, these topics should be addressed as a challenge. However, from this proposal it is only possible to understand the existing problem associated with workload. According to the author, the workload is determined by the number of submissions. Therefore, it is necessary to have a team proportionate to the scale of the challenge.In spite of the fact that I agree with this problem, for example, because I believe that the workload in the onboarding process for the winning proposals in the Dapps, Products and Integrations challenge will be totally different than for the proposals in the dRep improvement and onboarding challenge, I find that the proposed scope is too narrow, and I also consider that there are not enough arguments to elevate this problem to a challenge. The alignment with Cardano's mission is clear, as well as the possibility of improving Catalyst's processes as a result of this challenge. \n", "q0r": 3, "q1": "While I believe that the community is fully capable of addressing the issues raised by this challenge, unfortunately when evaluating the justification of the budget I cannot find sufficient information to allow me to affirm that the amount requested reflects the requirements of this challenge. As a reference we can take the current challenge \"dRep improvement and onboarding\" where the community approved a budget of $150,000 in ADA. I personally consider that this challenge has the potential to impact the community as a whole and is directly aligned with our roadmap; therefore I disagree with this challenge in terms of feasibility.\n", "q1r": 2, "q2": "The description of success is a bit confusing and I even find it to be limiting. The success metrics provided are not objective, difficult to measure and with a very narrow focus. Some of them, from my point of view, are more considerations or requirements to be taken into account by future proposers instead of being defined as metrics in themselves. Although it is mentioned in the \"challenge brief\" section that the objective is to improve the definition of roles in the challenge teams (which is not clear in the \"challenge question\" and \"why is important?\" sections), I would have expected a list that presents possible directions regarding the type of proposals to expect within this challenge.", "q2r": 3, "assessor": "z_assessor_2142", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1921, "q0": "The proposer submit a very good solution on iteration for the challenge team and agreed on the success criteria that focus on \n\n- Outreach and help new proposers.  - Yes new proposers especially the \"failed\" / \"not funded\" ones on the previous round, the community needs to reach out those great ideas, but maybe with not-so-good proposal writing, or even worse, killed by the voting process that benefits the big whales (and their circle). This also (hopefully) will trigger the community to reach fresh new faces into Catalyst - and avoid the system being dominated by a group of people (and whales)\n- Critique new proposals before CA Assessments - Agreed 100%, the critics must be submitted PRIOR to the assessment stage, so the proposer can have valuable feedback before finalizing\n- POL Funded proposer - if the POL stands for Proof of Life, I believe we should wait until the SSI/DID projects kick off - such as ATALA PRISM or similar to support this - the last round is very awkward to do POL over a zoom video meeting - cannot imagine how long it would take once Catalyst scales. \n\nBeing said, this challenge will align with Cardano Mission - and will help the Catalyst project progress to the next level. (align with Improve tooling to support human processes in Catalyst)", "q0r": 5, "q1": "With the increasing number of proposals and CA/PA on every funding round, this Challenge will help the Catalyst and Cardano community to improve one of the problems in maximizing our ROI.  The capacity might not be there yet, so we need to make iterations/improvements as soon as possible within the Catalyst community. It's like hold on a second, let's take a look at what we have done and admit that we are not perfect, and improvement needs to be done ASAP before it is too late. And one of that areas is the Challenge team setup.", "q1r": 3, "q2": "Agreed on the success criteria setup that focuses to help new proposers, while raising the proposal quality before the assessment period. This will help CA/PA & VCA review the proposals more efficiently.\n\nThe key metrics setup is aligned with a clear description of how to measure its progress to achieve the challenge goals. This way the  Catalyst Community can measure the Challenge Team's performance in the future, and surely this challenge needs to align with the DAO tooling app that is currently being proposed in the Cardano <3 DAO category.", "q2r": 5, "assessor": "z_assessor_2289", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4673, "q0": "It is good for the challenge setting process to be under a continuous process of re-examination and scrutiny. For this reason the proposal fits well into Cardano's mission.\n\nWhere this proposal is lacking is supporting arguments that demonstrate that its particular approach is the answer. Let's take the provided powerpoint as the primary argument made by the proposer here: There is no context via audio provided to explain what the various listings on the slides are attempting to articulate, and the final slide is blank. Furthermore, the main body of the description lists various appealing sounding items without contextualizing them in how  they solve problems. \n\nFor this reason, I can't imagine giving this proposal more than 3 stars. It seems unfinished, really. A more developed version of this proposal could probably score higher.", "q0r": 3, "q1": "For what it's worth, I think turning to the Catalyst community for proposals specifically to update Catalyst's procedures to introduce solutions to flaws in those procedures is a productive route to follow. With enough funding it could mobilize existing talent in the Catalyst pool of developers and thinkers to improve upon some of these needs, especially pre-assessment guidance for new proposers. \n\nThat being said, the categories remain a little broad. The proposal would benefit from better defined challenge brief that goes into the background, the need for change, and crystal clear examples of what proposers might provide to make this challenge setting a success.", "q1r": 4, "q2": "Metrics need better definition as well. Rather than leave it at that I'm going to put forward some examples here of how the proposer could improve upon their stated metrics in an effort to help.\n\n1) \"Challenge Setting Town hall video presentation\": One presentation in one town hall is barely a metric. Three would make more sense. One before, one during as progress is being made, and one after a set time frame to compare to pre-set goals and assess effectiveness.\n\n2) \"Effective outreach/encouragement to new proposers that meet Challenge\nSteering\": How many new proposers are you looking to attract? How long should they stick with Catalyst? Give us a numerial range and a time frame rather than a vague category. \n\n3) \"proposers/teams to proper Challenge Category\": Again, how many? What's a minimum bar for success here? It doesn't have to be an astronomical number.\n\n4) \"Early feedback to help projects meet goals\": A little unclear. Who should provide feedback? Why would it be different in this fund, as opposed to other funds in which historically early feedback has been arguably scarce? What exactly is the change proposed here?\n\n5) \"Networking and POL with all funded proposals of Challenge\": This one is OK, though some vision on the specifics might help.\n\n6) \"Open communication to Teams and funded proposals.\" How do you measure open communication? Where can it happen, if it's open? If all these questions are left unanswered, all you're introducing into the Catalyst system is more uncertainty, which is the opposite of what a proposal like this should be aiming for.\n\nI hope this helps explain why my response to this proposal is so tepid. I think there's potential here, but it's not at all close to realized potential, yet.", "q2r": 3, "assessor": "z_assessor_2585", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8093, "q0": "I vote for this challenge because the effectiveness of challenge teams is one of the most important parts of Catalyst’s funding process.\nThe current processes of Challenge Teams (CT) involve many activities and there is a lot of space to improve these activities. Continuous improvement in the process of Challenge Teams is necessary. For example, Proof of Life is one of the time and effort-consuming activities of Challenge Teams. CT Members need to manage a lot of meetings, record videos, etc. Tracking “Proof of Life” of proposers who have more than 2 proposals in different Challenges is very very tiring because proposers may do POL in one Challenge but skip it in the rest Challenge. CT Members need to cross-check with other CT (through Telegram, Discords..) to be able to confirm that. Here is an example of one of the efforts to improve the CT Process (https://cardano.ideascale.com/c/idea/422817). This proposal proposes the idea of creating a web portal, where CT can manage their tasks easier with the help of automated tools. This is just an example of an idea to improve the effectiveness of the CT process. There may be other ideas, too. I believe there will be much room to enhance the CT process. If this Challenge is available in Fund 10, such above ideas will surely fit this Challenge. \nThis is aligned with the Fund 9 strategic goals. Especially it is directly aligned with “Improve tooling to support human processes in Catalyst” and “Prepare a group of people willing and able to make contributions to the ecosystem”. These are also the most contribution of this proposal. The proposal is also aligned with other strategic goals like “attract more developers”, and “build real-world solutions based on the Cardano blockchain” in an indirect way.  Once CT process is improved, the whole Catalyst ecosystem will be improved, and this will attract more developers as well as more real-world solutions.\nFor these reasons, I vote 5 stars for this Alignment \n", "q0r": 5, "q1": "Normally, the work of Challenge Teams is understood only by CT Members, and transparent to the whole community. For the whole community to be able to audit and track the progress of CT, I think there should be a place where the community can see and track, e.g a website of CT, or a Telegram, Discords, channel where CT Members can release announcements to the whole community. \nI think the budget for this challenge is sufficient. I did not get why the budget is not round up to 1 million instead of 900500. To me, 1 million for this challenge is totally fine.\nThe proposer is Chris Keller, an experienced proposer who has successfully got funded with his proposals “Catalyst Circle Treasury Management” in Fund 7. I think he is experienced enough to know what is the pain point of the current CT process, and where to improve.", "q1r": 4, "q2": "The indicators the author provides are pretty sufficient to measure the CT performance. I like the “Steering proposers/teams to proper Challenge Category“ and “Early feedback to help projects meet goals” metrics. Currently, CT Members can hardly do it.  If CT Members can do it, it will improve the quality of submitted proposals. However, note that this will increase the workload of CT Members and we need proper tools to support them. ", "q2r": 4, "assessor": "z_assessor_2950", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11700, "q0": "the proposal intends for a change of how challenge teams operate in project catalyst, by asking more accountability of them and follow through, in contrast to the process now where challenge teams merely post a challenge but is not responsible for following through with winning proposals. yes, they currently do have some work to do like presentations and stuff and facilitatesfund receivers at the end of the next round of funding. but challenge teams dont see funded ideas through and through and i agree that this is a con of the current process. challenge teams list 'measures' for the proposed challenge, for the sake of listing them then telling proposers about it, not that they will follow up to see the success of the challenge through and through.\n\nfor the impact that this will produce to everyone in catalyst, from proposers, to PAs to vPAs, and to voters, quality throughout the chain will increase and proposals are likely to be clear and concise, in the right place, get the right feedback, and voters more engaged. Ii do see this challenge proposal as aligned to the strategic goal \"Improve tooling to support human processes in Catalyst\"", "q0r": 5, "q1": "from what I could gather, this topic of what challenge teams do and contribute in catalyse has been discussed before in PA groups, I believe via telegram, if not via discord. It is understood of that is asked of the challenge teams currently, but time and time again the question arises, \"why dont the challenge team be held for a longer term to see the fruition and success of the challenge they proposed?\". these are not actual words used, just my paraphrase. i believe that this is a known issue in the catalyst world and the community certainly can address this issue and improve it by tweaking some processes. \nhowever, i cant seem to justify hte budget required of 900500. will this challenge be awarding the challenge team a salary or stipend to carry out the vision? as it is, challenge teams are already being awarded $5,000 for the work that they do. for the incremental work required, i dont see it amounting to such a huge sum...", "q1r": 2, "q2": "for the measures mentioned, it would help if the team ensured that the proposed measures are indeed, well, measurable. Some of the words used are very vague like \"Effective outreach/encouragement to new proposers that meet Challenge\" and \"Open communication to Teams and funded proposals\". i may be missing something here but how do they plan to measure things like that? also, it would help if they can explain in more details what i POL - proof of life. just saying proof of life in the proposal does not help readers indicate if its the life of the challenge they are referring to or the proposals within them. for the vagueness in some of the items, i can only maintain a neutral stance though the other measures are ok.", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12852, "q0": "This challenge tries to solve problems in the operation of Challenge teams and at the same time helps to improve the performance of Challenge teams.\nNow each challenge has a Challenge team who work as liaisons and advisors to support proposers. Therefore, the effective operation of the Challenge team plays an important role in the operation of the Challenge in particular and the Catalyst fund in general.\nAs far as I know, Challenge teams currently face many difficulties and limitations in the process of operation. For example, tracking “Proof of Life” of proposers who have done POL in other Challenges, supporting the proposers in the process of preparing to submit the proposal, quick response to proposers’ requests for help, etc.\nIf the above problems can be solved, it will have a direct impact on the goals of “Improve tooling to support human processes in Catalyst” and “Prepare a group of people willing and able to make contributions to the ecosystem”-the Fund 9 challenge setting strategic goals.\nBased on the above analysis I rate this Challenge setting 5 points in the Alignment category.\n", "q0r": 5, "q1": "This challenge is not a big one that takes a lot of time and outside resources to address. It is an internal challenge that will appeal to proposers who are members of Challenge teams, or who have knowledge and experience of Catalyst’s working process. So I think the challenge’s goal will be raised and addressed quickly within 1 to 2 Fund. \nAlthough this challenge is very important and has a great impact on the performance of the Catalyst fund,  its scale is not large. I think the 900500 budget for this challenge is a bit too much. Compare with The Great Migration from Ethereum challenge (500000 budget) or the Cross-Chain Collaboration challenge (900000 budget), this challenge is obviously smaller in scale.  So I think the budget for this challenge around 500,000 or less is appropriate.\nBased on the above analysis I rate this Challenge setting 4 points in the Feasibility category.", "q1r": 4, "q2": "The author provides 6 Key Metrics to measure the success of the Challenge. These metrics focus on measuring the strengthening of the communication among proposers, among Challenge teams, between proposers and challenge teams; and measuring the effectiveness of Challenge teams’ support. These metrics are clear and able to measure. \nHowever, the goal of the challenge is not only to support the proposer but also to support the Challenge team. For example,  reducing working time and increasing the work efficiency of the Challenge team should be also focused on. Therefore, the metrics given to measure Challenge teams’ working time, workload, and work efficiency…are also very important. If the challenge is approved, I think we should consider adding these to Challenge’s key metrics. \nBased on the above analysis I rate this Challenge setting 4 points in the Verifiability category.", "q2r": 4, "assessor": "z_assessor_3494", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "importance": "Iterations to Challenge teams- We have taken Onboarding, Proof of Life, Collaboration, Teambuilding to new levels within our team.", "success": "Effective Challenge teams will provide\n\nOutreach and help to new proposers.\nCritique new proposals before CA Assessments\nPOL Funded proposer\n"}