{"id": 417910, "author": "cnftguild", "title": "NFT Community & Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/417910-48088", "category": 26604, "amount": 1500000, "description": "How can we support effective and impactful projects and initiatives to build for and grow the NFT Ecosystem and Community?", "f6_no_assessments": 13, "f6_rating": 4.589743589743589, "videos": [], "media": [], "f6_assessments": [{"id": 96, "q0": "This proposed challenge to me seems to be perfectly aligned in terms of scope and – most importantly – timing, with the current state of the Cardano mission. The cNFT (Cardano NFT) space is burgeoning and as the proposing team themselves state - NFTs play a crucial role in the Cardano ecosystem. NFTs – or non-fungible tokens [unique cryptographic tokens that exist on a blockchain and cannot be replicated] - are not simply blockchain representations of JPG files. NFTs are most known for their role in the rapidly rising digital art sphere, but they also serve as unique representations of other types of assets, property or claims to something. I think this challenge is both necessary and welcome in Fund 10. The part of where it is important, the team states: “This challenge incentivizes the development of infrastructure and tools for Cardano NFTs.”. I would add that the challenge should probably also give equal weight to looking at new use cases for NFTs – fortunately the team did include new use cases as a potential direction for the challenge. Furthermore, the challenge seems to be very well aligned with the first three Fund 9 goals. ", "q0r": 5, "q1": "The feasibility of this proposal is one of its strongest points, in addition to timeliness. The community growing around Cardano’s NFT space is growing by leaps and bounds and there is a clear potential for expanding and strengthening NFTs in this unique blockchain – due to Cardano’s exceptional technical qualities. This is not merely an NFT space like in every other blockchain community. It is an NFT system inside one of the most decentralized, most global and most technically minded blockchain communities. No doubt in my mind that devoting a specific challenge to the needs of the NFT Ecosystem will yield ample rewards. As regards the size of the budget, to me it seems on the large side as it has been set at ADA1.5 million. I would advise the proposing team, if resubmitting for the next round, to reconsider whether the size of the allocated budget will lead to careful and rational spending. ", "q1r": 5, "q2": "The metrics were set excellently by the team of proposers. Especially the quantitative metrics, such as monitoring the number of new Cardano NFT related initiatives submitted as proposals in Catalyst and the number of NFT projects actively building on top of Cardano. I miss some qualitative metrics – for example - one other possible metric that could have been included is the creation and harnessing of Cardano’s unique eUXTO blockchain capabilities to create new opportunities and new economic advantages for NFT creators and businesses. Another possible metric would be to look at the number of NFT project migrations from other blockchains to Cardano. One of the proposed metrics seems to be too vague [“A sense of community and conversations. Having people around to talk and connect with.”] – I think that if the challenge is not adopted, this metric could be improved by tightening it up into something more tangible. Kudos to the proposing team for including a great array of Potential Directions for future proposers – as they all seem inspiring and well-though out. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 23, "ne": 5, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 156, "q0": "NFT (non fungible tokens) are assets created to represent digital scarcity in unique assets and have huge potential on blockchains. This article cites 10 use cases for NFTs in addition to digital art:\n\nhttps://www.hongkiat.com/blog/nft-use-cases/\n\nCardano is among the blockchains with the highest market value of NFTs, volume of NFT transactions and number of users interacting with NFTs.\n\nNFT is one of the easiest ways to increase blockchain adoption, largely because of the frenzy for digital art and speculation, which makes it a controversial topic. But despite NFTs being popularized by the digital art market, there are numerous applications that can be benefited through NFTs, such as tokenization of real-world assets such as houses and works of art or tokenization of company shares.\n\nThis challenge setting is in line with items 1 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 5, "q1": "NFTs is probably the topic that generates the most social engagement in the Cardano community. There are more than 400 projects related to NFTs created at Cardano according to the latest report submitted by IOG, most of which are related to digital art. In the marketplace https://www.jpg.store/ it is possible to see several collections of NFTs that are for sale.\n\nThe fact that a large ecosystem already exists indicates that the Cardano community is fully capable of addressing the challenge.\n\nWe've never had a challenge dedicated to NFTs with such a high budget value, the closest that came before was the Fund 6 \"NFT Business models\" challenge which had 131 proposals and an available budget of $200,000, a high demand in number of proposals and the combined budget of the 131 proposals exceeded $5M USD, which is high demand and indicative that the community has a strong interest in the topic.\n", "q1r": 5, "q2": "The definition of success is consistent with the theme and objective of this challenge setting, but there is no time period for verifying the success of the challenge, I recommend the inclusion of a time frame (x months or x years) to measure the outcome of the challenge .\n\nSeveral relevant key metrics were included, but I would recommend including more key metrics such as transaction volume, market cap of NFT markets, variety of NFT related solutions in addition to digital art, plus metrics that can assess the quality added to the ecosystem and establish a period of time to measure key metrics.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 3, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 626, "q0": "The goal of this challenge is to allow the submission of proposals related to NFTs, either in the community or ecosystem sides. NFTs are going to play a central role in Cardano’s and blockchain ecosystems in general and setting Cardano as the go-to blockchain for NFTs would be a huge step into building a stronger community around Cardano and increasing its market share in general. This challenge is very well aligned with the goals of attracting more developers to Cardano and possibly build real-world solutions using Cardano blockchain, since NFTs are already being used for many real-world applications, art being the main application so far, but others like property registration and certifications, for example. Also, a good inspiration for proposers in this challenge, related to real-world applications, would be the F6: NFT Business models challenge from Fund 6.", "q0r": 5, "q1": "The requested budget for this proposal is 1.5M ADA, which might be close to $750k is the exchange rate is like the current rate when the results are out. This budget is quite high. I believe the Catalyst and Cardano communities would be able to come up with enough good proposals to make use of this challenge, but I’m afraid some not so good proposals get voted in because the budget is too large, or there is too much budget remaining because there weren’t enough approved proposals by the community. This is my only concern in relation to this challenge proposal because I believe there are many communities and project already that would benefit from a NFT focused challenge like this. The potential directions also Also, the NFT Guild, the submitters of this proposal, have already offered themselves to compose the challenge team in case this challenge proposal gets voted in, which is quite good. ", "q1r": 4, "q2": "The KPIs related to this challenge proposal are good. Some of them are too general but I believe it’s implicit that that would have their scope limited to solutions related to this challenge. For example, ‘Number of NFT Projects actively building on top of Cardano’. There are probably more external reasons that would increase the number of NFT projects building on Cardano, therefore it makes sense to limit this evaluation for the projects that somehow benefit from the proposals submitted in this challenge. The KPI ‘A sense of community and conversations. Having people around to talk and connect with’ is not really a KPI, but this information could be tracked and evaluated at least in a subjective manner. It would be interesting to add some KPIs related t the potential directions mentioned, for example number of new NFT Tools, Platforms and Marketplaces, NFT Standards, and so on. Overall, I believe the verifiability of this challenge proposal is good. ", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 1, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 861, "q0": "After a year and a half of having NFTs available on Cardano, we have seen how this marketplace has brought in new users that traditionally were not attracted to other features (this happens on all blockchains). Unfortunately, as of today platforms such as https://cryptoslam.io/ do not have listed the Cardano NFT marketplaces. However, doing a performance comparison in the last 7 days of the data presented on that site versus the data we can see on the platform https://www.cnftjungle.io/ we can see that Cardano is located in the fourth place behind Binance with a total of US$2.44M in sales. They place Spacebudz among the top 40 compared to the data of other ecosystems available on cryptoslam. The numbers are convincing, although we have already demonstrated that there is an ecosystem that is growing organically. However, we still have a lot of market to gain with respect to the first 3. This challenge seeks to strengthen the ecosystem, looking for a space for entrepreneurs who seek to improve existing tools and markets, promote research and the establishment of standards, as well as promote communication between the different NFT projects. Based on my previous arguments I find a direct relationship with Cardano's mission, as well as a relationship with the goal that seeks to prepare people who seek to contribute and evolve the ecosystem.\n", "q0r": 5, "q1": "A good indication of the community's commitment to the focus areas of this challenge is the data we have in this regard from previous funds. There was a challenge in Fund 6 called \"NFT Business Models\" with a budget of $200,000 in ADA, for which 80 proposals were submitted, of which only 25 were approved and only 8 were funded. However, if we examine proposals associated with NFT in the past fund (criteria: NFT word in proposal title), we have 46 approved proposals of which 17 were allocated funds totaling $821,004 in ADA. This represents a considerale demand with a lot of potential that deserves to be elevated to challenge. In order to determine whether the budget is appropriate or not, I consider that in Fund 8 alone, there were 31 proposals approved by the community but not allocated funds due to simple funding limitations in each challenge. I consider this sufficient justification for the budget. The proposal's preparation team was also tasked with finding community members willing to become challenge team members, which adds an additional layer of feasibility.\n", "q1r": 5, "q2": "The definition of success relates directly to the multiplicity of possible directions that the proposals within this challenge are expected to take. However, I would have expected a better description of the key metrics presented by the challenge team. I generally find them to be very general or difficult to measure. On the positive side I find a couple of metrics that seek to measure the performance of the challenge itself, but unfortunately there are shortcomings regarding the metrics presented as a guide to future proposers. Our community will need practical measurement methods to evaluate the level of success or failure of this challenge if we decide to establish it for the next fund.\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 1008, "q0": "As we are still at the dawn of development in the NFT-market and a great opportunity could be created for Cardano by playing a big role in that market, NFT Community & Ecosystem facilitates an excellent base of operations as a potential challenge setting. So in terms of expansion, entering the NFT market in force is mission critical. ", "q0r": 5, "q1": "This challenge setting proposal has the ability to produce a variety of solutions applicable to cNFTs. As a kickstart, the proposed budget seems appropriate for its intent. A challenge team has been predefined, but I had to go digging in the links in the reactions to have an unconfirmed idea to find out who would seat in that team. So a possible improvement towards the future would be to include this in the challenge setting proposal. ", "q1r": 4, "q2": "The proposal describes potential directions that proposers could follow. The KPIs are set clearly and realistically to produce progress after 3 months. It is defined in a way that it is short, simple and comprehensive. ", "q2r": 5, "assessor": "z_assessor_2180", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"id": 3277, "q0": "This actually turned out to be a difficult challenge to assess according to the guidelines.  NFTs are a popular part of the Cardano ecosystem and they drive a huge part of Cardano adoption and transaction volume.  As of the beginning of June there have been 5,727 NFT projects launched on Cardano (https://blazetrends.com/over-5-million-nfts-created-on-cardano-network/ note: the info about 5million NFTs is inaccurate in this article, as that is the total number of token policy IDs which includes fungible tokens as well as NFTs).  In the most recent funds, there hasn't been any real dedicated space for NFT proposal submissions, to the inclusion of this well crafted challenge settings makes sense.\n\nBut there is a problem.  Our job when assessing alignment is to assess alignment to the Fund 10 goals, and for this proposal, that alignment has not been well described.  By reading between the lines, I can excavate some possibilities of alignment:  for Goal 1, the suggestion for proposals around community events MAY allow for education or support around NFT standards and governance parameters; for Goal 2, there MAY be possible alignment with opensource development in the establishing of standards and CIPs; for Goal 3 there MAY be some NFT project that aids in real world solutions (there are no examples or terminology for that suggested here, but real world projects like Littercoin have NFTs in their roadmap); and for Goal #4, there is plenty of mention for how to improve standards and tooling, so that MAY be aimed at human-centric UI/UX.\n\nAgain, none of these possibilities are specified, so even though I personally can imagine how they could support projects in coming into alignment with the Fund10 Goals there is a high likelihood that many of the projects submitted under this challenge will not be in alignment.  While in the end, as always, this is in the voters hands, I find that I can neither agree nor disagree with how well this challenge aligns, so I am giving it 3 stars for alignment.", "q0r": 3, "q1": "As noted in alignment, while there is plenty of examples and inspiration provided to support and guide proposers, none of it supports and guides proposers to the Fund 10 goals.  I do think that the guidance related to creating standards and CIPs has the most potential to impact the fund 10 goals, with the suggestions for community tooling also having a chance.  But this limited alignment becomes an issue when you start talking about a budget of $1.5m, where you would like to see good alignment across all 4 goals, or excellent impact in 1 or 2 goals.\n\nAt the end of the day this proposal is a general Cardano impact proposal, rather than one targeted through the lens of the Fund 10 goals, and so all of the suggested examples are also of general Cardano impact.  The result is that it has high feasibility generally, but not feasibility specific to the goals lined out for challenge settings.\n\nBecause it is well structured and does provide good guidance and support for general NFT ecosystem proposals, I believe it has a strong Feasibility component, however I am removing 1 star due to not having enough guidance and support for the Fund 10 goals specifically.  4 stars for Feasibility.", "q1r": 4, "q2": "Finally, the lack of explicit goals alignment continues to haunt the proposal in the area of providing metrics for proposals to measure progress and success.  When these types of metrics are suggested, the idea is to measure \"progress towards what objectives?\"  \"Success by achievement of what goals?\"  The issue becomes that this proposal defines the objectives and goals without relation (without alignment) to the short term mission statement of Fund10 (which other challenges are being held to as well).  Proposals under this challenge really have been given no guidance as how to achieve those short term objectives.\n\nHave they provided general guidance on long-term Cardano ecosystem issue and alignment, yes.  But challenge setting is about taking the long term goals and anchoring them to short term goals in the present, about focusing the bird's eye view of the Cardano mission into less abstract, more objective means of achieving it now.  And it has to do this in conjunction and competition with all other challenge setting proposals, which is why the Fund goals are formulated: to give everyone a scope and fair field within which they should apply for the funding over the next 4 months.  Voters ultimately decide what matters and what doesn't, but I have to mark this proposal at 3 stars for verifiability due to the lack of metrics that describe goals and objectives related to the Fund 10 goals.", "q2r": 3, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4950, "q0": "This proposal aims the support the Cardano NFT ecosystem by setting up a 1.5M ADA challenge in Fund 10. This is a great challenge since NFTs are in need of special attention at Cardano. We still don't have a widely accepted NFT metadata standard. This hampers interoperability, which is the main point of having publicly available data. The proposal outlines clear metrics and potential directions for how proposers may approach the challenge. I think this challenge would result in great proposals that further the Cardano mission.\n", "q0r": 5, "q1": "At 1.5M ADA, the challenge requests ~11.72% of Fund 10. To understand if this is too large, small or just right, we should analyze it in context of development challenges in previous funds. The worst case with these challenges is exemplified in Fund8 with Cardano Scaling Solutions challenge. It was so technical that only a few proposals were submitted and most of them got funded with 180,000 USD to spare. NFTs are a big part of the ecosystem so this is a general topic that would get a lot of proposals, so we don't have such an issue here. This is more inline with Business Solutions challenge from Fund8, which had a healthy amount of competition. I think this sizing is just right for this challenge. If we see it as a success, with healthy competition in Fund10, I'd like to see it's size grow in future funds.\n", "q1r": 5, "q2": "Most of the metrics provided are well defined and can be tracked/measured without much issue. For instance number of NFT projects on Cardano, new Cardano NFT related proposals, etc. are clear and can be tracked by the community without issue. Two metrics are more intangible, and I feel can't truly be measured as much as felt: 1 - A sense of community and conversations, 2 - Filling in gaps defined in the exploration stage. These I don't think are true metrics by which to measure the progress of the challenge, but they've become widely accepted in other challenge briefs so I understand the need by the proposers to include them. I'd suggest making them more measurable/trackable nonetheless.\n", "q2r": 4, "assessor": "z_assessor_2643", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 6340, "q0": "The Cardano community has one of the top ten largest NFT communities in the Crypto space as per Defillama, and our NFT marketplace website 'https://www.jpg.store' is also in the top ten. Hence there is a massive scope for growth to become number one in the NFT space. I see this becoming a reality sooner or later, considering the reliability of our blockchain, low fees, and a strong community. All these are required for an NFT project.\n \nThis challenge will incentivize the artists & developers to opt for Cardano blockchain for their NFT projects or build NFT infrastructure tools & platforms on Cardano. Hence it is critical for Cardano's mission.\n \nI am concerned about the NFT projects that are funded but failed to make an impact. For instance, there is an NFT project funded by the catalyst known as 'akkadia (nftdao).' They built their marketplace website & minted their ticket NFTs, but if you go on to check their NFTs on jpg.store or other Cardano NFT marketplace, you will know that they have not yet verified their project. Also, there is very minimal community building or engagement from this project.\n \nWe also have some funded NFT projects which contributed to the Cardano Ecosystem and have had a good impact, such as 'nft-maker.io.' The difference between these two projects seems to be marketing and community engagement. The challenge author does mention briefly regarding 'the community sense,' but the community aspect is much more critical in the case of NFTs as the strong community is the foundation of any successful NFT project.\n \nAnd in the case of tools or marketplaces, we need to consider the number of projects awaiting to utilize the protocol or the number of partnerships and collaborations.\nFrom the strategic goals point of view, this challenge will bring people who will be able and willing to contribute to the Cardano space. It certainly accelerates the growth of NFT related developer ecosystem.\n \nThere is a chance that this challenge will garner more votes if the projects submitting proposals already have a community presence who will try to vote for their proposals to win. We can also expect the Cardano NFT community, in general, to pay attention to this challenge and vote for the deserving proposals.\n \nCardano is among the top ten in the NFT space with a volume in millions, which is still a fraction compared to the total market volume of billions of dollars. Cardano's NFTs space is only a year old, but we have reached in top ten. If we continue to grow and develop tools & platforms which facilitate a smooth experience for the upcoming NFT projects, Cardano will soon be the number one choice for NFT projects. Hence this challenge will undoubtedly act as a springboard for Cardano adoption.", "q0r": 5, "q1": "As mentioned above, Cardano has one of the best NFT communities. This community includes various artists, tools & platform developers, art lovers, NFT flippers, etc. Hence the community is capable of addressing this challenge.\n \nWe can expect many proposals under this challenge, as in past funds. In the current funds, many NFT projects are submitted under other challenges such as DApps & Developer ecosystem. Before that, we had a Challenge in Fund 6 as 'NFT Business Models,' which attracted 80 proposals, out of which seven were funded as the small amount allocated for the challenge. This time the asked amount for this challenge is $1.5 million, which will help fund many projects and is an appropriate amount expecting the number of NFT-related proposals.\n \nIt will help if we have a specific challenge for the NFTs. Then, we can consider more detailed metrics and address the potential problems in a more particular manner. It will also declutter other challenges from NFT-related proposals.", "q1r": 5, "q2": "The author describes numerous KPIs, some of which can be used to assess the proposals under this challenge. The other metrics seem to be mentioned to check the challenge's success. But there is a need to provide more specific KPIs.\n \nRegarding the KPIs for proposals, the number of repositories on GitHub is applicable. The metric 'a sense of community' is vague. If it means the community engagement of the NFT project, then it is a relevant metric. The community engagement metric can be the number of Twitter followers, discord members, etc. It is imperative as any NFT project's success depends on the community's strength.\n \nSuppose the proposal is about building the NFT tools & marketplaces. In that case, the metrics can be the number of expected parties who will utilize the protocol and the number of partnerships or collaborations with the NFT projects.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7793, "q0": "This challenge is to help support and develop projects that aim to build and develop the NFT community and ecosystem on Cardano. NFT has always been an extremely important part of any blockchain platform. Its applicability does not stop at collections, game projects, but can also solve many real-world problems such as movie tickets, airline tickets, intellectual property identification and license. Therefore, the development of this NFT community and ecosystem is associated with one of the Cardano missions, which is \"build real world solutions based on the Cardano blockchain\". This challenge also provided clear directions for problem solving: to build NFT tools & platforms, maintain standards, offer services, organize events and research. Hence I think that doing this challenge can even attract more developers to the ecosystem and attract more users from the external community. Thereby, it is possible to accomplish many goals of Cardano missions at the same time.", "q0r": 5, "q1": "Following the development of the Catalyst project, we can see a lot of projects related to NFTs, which can include games, music, marketplace construction, etc. TThese are all necessities of the Cardano ecosystem. Projects related to the NFT community have also been well implemented on the Cardano ecosystem. The Cardano and Catalyst communities are therefore fully qualified to take on this challenge. The proposal also gave 9 directions to develop NFTs projects such as Developing NFT Tools, Platforms and Marketplace, NFT Standards. This shows the writer's awareness of a huge amount of work on the problems that need to be solved to develop the NFTs ecosystem on Cardano. So it makes perfect sense for them to request up to 1,500,000 ADA funding for this challenge.\n", "q1r": 5, "q2": "This proposal defined the success of the challenge as making it easier for NFT Projects and developers to build on Cardano. To successfully implement the challenge, they have also come up with a set of 6 criteria for evaluation and monitoring. Basically, these KPIs can roughly assess the development of this Challenge. However, most of the criteria are only evaluated in terms of the number of projects, the number of tools used, but not much attention to the quality of the NFTs projects and the problems these projects solve. I think it is more reasonable if the writer proposes to add a few more evaluation criteria related to the quality of NFTs projects in the Challenge and the ability of these projects to solve real world problems. It would be much more convincing", "q2r": 4, "assessor": "z_assessor_2922", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 8012, "q0": "This challenge is critical to achieving Cardano's missions. The importance of good infrastructure and development of tools for Cardano NFTs are of great importance. It is very important to ensure that Cardano NFTs can differentiate themselves from other platforms. Launching community-based solutions to provide NFt tools and platforms and various other innovative solutions. This challenge contains the strategic objectives included in Fund9. The Cardano community is in need of new tools/platforms to ensure developers are more likely to use Cardano instead of Solana, Ethereum or other providers.", "q0r": 5, "q1": "The Catalys community certainly has the capacity to meet this challenge. The stated objectives are certainly achievable to be implemented. There are already many projects from Fund9 that can take up a role in this challenge. The advantage is that this project can be used in many different directions. These directions are included and will be very important to make Cardano great. Getting this proposal funded would be a big step in connecting the NFT community to Project Catalyst by creating a space where NFT-related ideas and experimentation can be born. This challenge will certainly be achievable if people are open to the growth of the NFT community. I am a trader in NFTs myself and I personally experience that there is a need for new tools and infrastructure to release NFTs. The advantage is that the NFT Guild will take charge of the Challenge team.", "q1r": 5, "q2": "Success criteria and suggested stats are properly set up to measure progress in tackling the challenge. The statistics included evaluate whether this challenge has succeeded in making NFT projects and developers easier to build on top of Cardano. The statistics have been carefully chosen and will provide transparency as to whether this challenge was successful or not. The possible directions that have been chosen will ensure that developers want to make a choice from a clear point of view. The included challenges are aligned with Fund9's strategic goals. Hopefully this challenge will get a chance for funding because there is a need for sufficient tools/platforms that will make it easier to build on top of Cardano. By financing this challenge, Cardano will be able to distinguish itself from other platforms in the long term.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9020, "q0": "This Challenge will meet all the goals of Fund 10. By developing NFTs that people engage with we can further develop the Cardano ecosystem. The Challenge would engage people through proposals that contribute to the NFT economy. NFTs are popular and growing in interest all the time. By attracting more NFT projects and funding, it is possible to see more open source projects on Cardano and attract more developers. Additionally, this challenge opens up the possibility of seeing more real-world uses built on Cardano, the potential to see more tools developed to increase NFT adoption, and additional improvements of the existing NFT ecosystem.", "q0r": 5, "q1": "This challenge was proposed by the Cardano NFT Guild. They have experience in managing and mentoring NFT projects. Many members have developed their own NFT projects. They possess the skills, knowledge, interest, and time to manage this challenge. They want to develop and grow the community and projects surrounding NFTs on the Cardano network. They are perfectly positioned to ensure this challenge is a success. I believe this is a very feasible challenge managed by a very competent challenge team. ", "q1r": 5, "q2": "This challenge is highly verifiable. The team developed a core set of metrics. These metrics enable the challenge to be measured successfully and they line up well with the Fund 10 goals. They will grow the community through engagement and conversations and by increasing the number of projects and tools developed on Cardano. This project even includes a metric for “filling in the gaps.” This is a really positive challenge goal as we are still so early on in developing NFT's on the blockchain we should still be actively looking for all those things we don’t know we didn’t know. Ideal challenge for Fund 10.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 9788, "q0": "Developing NFT in the Cardano ecosystem is very important for blockchain and Cardano platforms. It is clear that developing NFT is such an important goal that this proposal is completely relevant and essential to our ecosystem. This challenge is born to stimulate a wide range of developers as well as create many applications to carry out Cardano's mission in Fund 10: build real-world solutions based on the Cardano blockchain. Impressive NFT projects are always something that makes a strong impression among developers and users and increases their awareness of Cardano and draws them into the ecosystem.", "q0r": 5, "q1": "It is clear that there are quite a few NFT projects in many fields that have appeared on our platform including entertainment, games, and even highly realistic projects…. With developers and the Catalyst community, these projects have received good attention and support. This proves that if this Challenge is funded, it will definitely get huge support. Besides the enthusiasm, the community is also fully qualified and skilled to perform this challenge well. The project's authors also break down the small pieces to make it easier for developers and the community to follow such as Tools, Flatform, Marketplace,... This project also proposes a relatively large amount but with a small amount of money. important areas are as expensive as this proposal, which also makes sense.", "q1r": 5, "q2": "The authors cover success using six metrics. The aim is to help NFTs and Developers to complete their work on the ecosystem easily. The figures they give are also reasonable and easy to observe such as the number of projects, and the number of tools used. In my opinion, this is a long and quite big challenge so we should also have some more long-term looking metrics in terms of the quality and development of the projects in the challenge because it's clear what we desired is the level of completion as well as the quality of NFT projects", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 11702, "q0": "the challenge being proposed here is definitely aligned to the strategic goals for the fund (Prepare a group of people willing and able to make contributions to the ecosystem, Build real-world solutions based on the Cardano blockchain), and cardano's mission as a whole. We know NFTs are a huge part of the cardano ecosystem already and is growing by the week. adding more ideas, proposers, and developers through the onset of this challenge in the next round of catalyst will only accelerate the growth of the cardano ecosystem. ", "q0r": 5, "q1": "development of NFT based projects in the cardano community has been going on for months now and there is definitely no shortage of interest in the area. The community certainly is learning and dveloping up until this current moment, and they definitely have the capacity to address the challenge. \n\nthe budget that is being asked for is a hefty sum, standing at $1.5m. However, i understand that technical talents are a scarce resource these days and to have valueable input from experienced individuals in the industry is defintiely not cheap, letting alone some of the proposed directions like \"Developing NFT Standards\", \"Academic research and analytics on topics related to NFTs or NFT tooling\", and \"Change existing tools to support and adopt new standards\". which are huge undertakings. some basis of comparison for voter's easy reference, the average Web3 developer salary is $100k - $150k per year. splitting them out to differnt seniroity levels, shorter duration of work, language, and experience, i would say that this is reasonable amount for the entire challenge with enough headroom for some outstanding proposals.", "q1r": 5, "q2": "while the proposal is valuable and impactful to cardano as a whole, I have one feedback to give. The scope of this challenge I feed is too large. Indeed, the proposers were likely trying to attract a decent number of proposals for some healthy competition between proposers, but NFTs itself can be used for a wide variety of applications. will this challenge be focused on helping the art community, gaming community, digital ID community, etc? i understand that they want to - quoting them - \"build NFT tools & platforms, maintain standards, offer services, organise events and research\", and they have a bunch more listed potential directions of the challenge, but i still think the scope is too wide. having more focus on a particular use case will help attract the right proposals and developers, with the relevant assessors to be able to give valuable guidance to the proposing comunity. \n\nfor the measures, i think most are fine. however, i did find some of the listed measures being...not quantifiable. how would one measure \"A sense of community and conversations. Having people around to talk and connect with.\" or \" Filling in gaps defined in the exploration stage\"? would suggest for proposer to be more specific in these cases, though i believe a good intent was behind the measure - to have a sense of community, for example.", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "NFTs play a crucial role in the Cardano ecosystem.\nThis challenge incentivizes the development of infrastructure and tools for Cardano NFTs.", "success": "Kicking off community based solutions to build NFT tools & platforms, maintain standards, offer services, organise events and research."}