{"id": 420431, "author": "aharon", "title": "DAOs <3 Cardano", "url": "https://cardano.ideascale.com/a/dtd/420431-48088", "category": 26604, "amount": 1000000, "description": "How can we make Cardano the go-to choice for building DAOs? What tools can we provide to enable effective DAO's Creation & Operation", "f6_no_assessments": 12, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 167, "q0": "The fifth and final stage of the Cardano development roadmap proposed by IOG years ago is called Voltaire and it deals with governance. The project Catalys itself is an incentivized testnet of Voltaire that started to be embraced by the Cardano community about 2 years ago and aims to build the foundations of Cardano's governance model. Today thousands of people actively participate in this ecosystem.\n\nThe existence of governance structures such as DAOs is extremely important in the future of Touring Complete blockchains for different reasons, but in short the idea is that a blockchain and the dapps on it need to be upgradable in order to maintain security, competitiveness, performance and meet the demands of their communities.\n\nSome communities see governance as an unwanted feature, like the Bitcoin community, but in their case it is advantageous that the Bitcoin protocol is more rigid, because in theory this is what gives more stability to the store of value feature and maintenance of monetary policy of inflation. On the other hand, the choice to ignore governance means that protocol upgrades are decided by a centralized core of developers, where token holders have no say.\n\nCardano, unlike Bitcoin, is a blockchain that allows greater expressiveness in its programming and this makes it a tool for the development of dapps and different solutions, so Cardano has as one of its value propositions being a \"smart contracts\" blockchain and this puts pressure on it to remain competitive with other competitors in this niche. To maintain competitiveness and continue to be a secure and promising blockchain, updates are necessary and at this moment political and social issues arise that require a robust governance layer and that have well-architected incentives in order to prevent a group of players from manipulating governance and taking the development and updates to a side that is negative for the community as a whole.\n\nThese points indicate the importance of governance structures such as DAOs for the maturation and improvement of governance models and this challenge aims to make Cardano's DAO models more attractive and progressive, therefore of great importance in the Cardano mission.\n\nThis challenge is in line with items 1, 3 and 4 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide, which highlights the importance of the topic.", "q0r": 5, "q1": "The DAOs <3 Cardano challenge has previously occurred in Catalyst's Fund 7. In Fund 7, the available budget for the challenge was $500,000 USD, the challenge received 41 proposals, 30 of which were approved and 12 were funded, which indicates that there was significant demand and above the available budget.\n\nCatalyst is today the largest decentralized innovation fund in the world, which shows that the Cardano community has embraced the quest for governance.\n\nhttps://iohk.io/en/blog/posts/2021/07/08/introducing-the-catalyst-circle/\n\nMy only caveat is that there is another challenge (\"Governance & Identity\") at Fund9 that also proposes funding for DAO development, but also proposes a larger budget and has a larger scope, as it serves to embrace proposals dedicated to governance as a whole and for identity solutions. This aspect will not change the evaluation score, the intention is to draw the voters' attention so that they understand that there are overlaps of ideas and that they reflect when deciding the vote. Considering the combined budgets of the two challenge settings in 3M ADA and the current market value of the ADA of around $0.45 USD I think that even funding the two challenges there would be sufficient demand from the community and I say this based on the demand seen in the recent challenges aimed at Catalyst governance and identity. Considering challenges dedicated to governance and identity (as these are the themes of the two challenges that are overlapping), the demand for funding of approved proposals in Fund 7's \"DAOs <3 Cardano\" challenge was around $1M USD, the demand for approved proposals in Fund8's \"Accelerate Decentralized Identity\" challenge was around $1M USD as well and\ndemand for successful proposals in Fund8's \"Self Sovereign Identity\" challenge was around $900,000 USD.\n\nAggregate demand for proposals approved in the challenges aimed at governance and identity was around $3M USD. Considering the amounts requested in the two challenge settings addressed in this evaluation (3M ADA) if the trend continues, the community tends to fill both challenges with proposals.", "q1r": 5, "q2": "The definition of success is bold and promising, but it is not a simple outcome or easy to measure with the key metrics proposed in this challenge and without an established time window. I would recommend setting a time frame in which you can expect to make DAOs created in Cardano the best choice for management across multiple groups.\n\nThe metric keys are consistent and appropriate for the challenge, they allow evaluating the number of communities using DAO solutions, number of tools and frameworks created, transactions from these DAOs and a period of time for verification of outcome, however given the definition of success chosen , it would be important to include more key metrics that could gauge the use of Cardano DAOs against other blockchains and the quality of these solutions.\n\nAuxiliary success definitions could also be added, as was done in other challenge settings presented in Fund9, this would help the outcome evaluation, creating nuances to what is considered a satisfactory autocome, establishing different items where the quality of DAO solutions, tools and frameworks created on Cardano can be better compared to what exists on other blockchains. \n\nCardano, being a eutxo blockchain, can greatly reduce transaction costs in DAOs through transactions with multiple inputs/outpus, how could this aspect be measured? Perhaps through transaction costs between DAOs on different blockchains or the number of active users voting on DAOs on multiple blockchains.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 108, "q0": "The proposed challenge is aligned with Cardano’s vision of having a decentralized infrastructure and decentralized decision-making, as well as empowering the fringes of society – by pushing power to the edges. The challenge question is very well formulated – how to make Cardano the go-to solution for new DAOs and for groups that wish to self-organize. The creation of efficient tools and structures and platforms would certainly enable this and foster Cardano’s own development. I think that the “Why is important field” fails to fully capture the importance of the challenge, as it cites the progression of market attention from currency to DeFi to NFTs – and predicts that DAOs are next. This is, of course, just a supposition and I would argue that that is not the true importance of the challenge. As regards the four strategic goals for Fund 9, this proposed challenge does address all four goals. ", "q0r": 5, "q1": "The Cardano community is by its very nature composed of decentralization enthusiasts and throughout the past funds, we have seen numerous proposals for facilitating the setup of DAOs on Cardano. I would argue that there is a firm probability of ensuring that this challenge is realized successfully – although I have some doubts whether the proposed budget of ADA1,000,000 is realistic (to me it seems too high) – I mention this as it affects the feasibility of wisely using the entire budget in the next Fund. If the challenge is not approved this time around, the proposers could resubmit with some more information on why – “the current options [for setting up DAOs] are all based on, mostly, the Ethereum blockchain”. Maybe it is not only a financing issue – and there are some other factors at play that influence the feasibility – and the community’s capacity to address this challenge? ", "q1r": 4, "q2": "I think that the proposed metrics for the Challenge are well set and will reflect the success of the future proposals submitted to this challenge, if it is approved. Maybe the proposers could have also included some metrics regarding the possible transfer/migration of existing DAOs from other blockchains to Cardano – although it might not be realistic. Another possible metric – if this challenge is not approved now and is resubmitted – could be the “number of original and unique Cardano DAO creation tools and solutions that are not available on other blockchains”. With the technical prowess of the Cardano developer community and the high assurance level of its code, I feel confident that the Cardano can provide not only “similar tools that offer superior features to those offered on other chains” - but also novel tools that are unlike any others offered on other blockchain. The DAO challenge category should probably stimulate both emulation and radical innovation. Fortunately, the proposers of this challenge also share this view as they stated “Additional not yet existing tools to give Cardano a distinct advantage”.", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 23, "ne": 5, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 636, "q0": "This challenge proposal’s goal is to create space for proposals related to DAOs - Decentralized Autonomous Organizations. DAOs are a central concept in the blockchain ecosystem and one of the most important applications of the technology. This challenge intends to support the development of all DAO-related tools for creating, operation and governance. Since the DAO concept is very broad, this challenge has the potential to cover of the goals of Cardano’s mission for Fund 10: it can help preparing people to contribute to building DAOs and its tooling, to create open-source tools, attract developers, build real world solution using Cardano and improve Catalyst’s human processes. The alignment of this challenge with Cardano’s mission is very high.", "q0r": 5, "q1": "This challenge has already been funded in Fund 8, and it is now present in Fund 9. The previous budget was $1M, and now the request is 1M ADA, which is going to be equal or less than $1M. In the previous iteration, a total of 111 proposals were submitted in this challenge. This shows that the community has ideas for projects related to DAOs and is willing to propose and execute them. Also, there are already many DAOs being formed in Catalyst and they have already been working on some tooling, and some community projects are already building some DAO tools as well even without funding. With this challenge, they can dedicate more time and effort for this initiative. Since then the community has been growing and the budget of this next iteration is going to be equal or smaller than the previous one, I believe that the community is going to be able to use the challenge and make it a success.", "q1r": 5, "q2": "The KPIs added to measure the success of this challenge are good, but I think there should be some corrections. For example, “Amount of ADA coming from DAOs transaction fees after the solutions on this challenge get implemented (> than the challenge's allocated fund amount)”. Reaching the same amount of the fund’s budget is something very difficult to achieve, and there is no period set for this to happen, i.e. 6 months? 1 year? 2 years? Also, “Number of DAO toolset/frameworks available for DAO Ops (>1)” is not so clear, as it seems that if a single toolset/framework is developed, this would already meet the goals for the challenge. I would advise adding KPIs related to creating of different tools or concepts for different DAO needs, as mentioned in the challenge brief itself: DAO collaboration, creation, operation, and governance. In general, I believe that the verifiability of this challenge proposal is good.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 679, "q0": "This challenge is about building effective DAOs on Cardano, helping Cardano have dApps  that covers a wide variety of services ranging from finance, governance, grant management, education sector. The challenge brief provides  a comparison with DAOs that are available on Ethereum and the need to have similar or even better DAOs on Cardano. Additionally, the challenge settings do fulfill all 4 fund 9 strategic goals mentioned for challenge settings, and therefore I strongly agree that this challenge is critical to achieve Cardano’s mission.", "q0r": 5, "q1": "I strongly agree that the catalyst community has the capacity to address the challenge. This challenge setting is also a part of current Fund 9 and already has a fair share of proposals made under this category. \n\nAdditionally, the catalyst community has been talking about a lot of improvements in the catalyst process that could improve governance and move us towards a more decentralized governance model, unlike the current way which is steered by IOG. \n\nMany such ideas are waiting to be funded and worked upon via dApps that would be completely decentralized and provide critical tooling infrastructure to support and improve decentralization in Cardano.\n", "q1r": 5, "q2": "The key metrics to measure are written in terms of number of community engagement using Cardano DAOs, number of DAOs in different areas fulfilling governance, toolsets/frameworks. The success criteria mentions that if in crypto someone wants to manage a DAO then Cardano DAOs must become the gold standard and hence a goto first choice for DAO creators.\n\nHowever, it would have  been also nice to elaborate further on the timeline of when we expect this success metric to be achieved ? With current Catalyst model there is no guarantee that this challenge will be part of future funds, therefore considering the as in state of today, the challenge team should also give a tentative estimated schedule of when they expect this to be a success. Something on the lines of how they have done for a number of DAOs that use Cardano as a governance/management chain in 6 months. Therefore, I can only agree and give 4 stars.\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 1886, "q0": "This proposal is about offering a place where the development of tools for DAOs can be realized. Since Cardano is the lone wolf within the blockchain technology we can use this challenge to develop our own tools for DAOs. If this challenge is successfully voted on we can focus on a bottleneck within Cardano. \nBecause of this, the proposal falls within the strategic goals, it provides expansion of the ecosystem and helps contributors.", "q0r": 5, "q1": "Since Cardano <3 DAOs has been in the past funds we can say that the community is up for the task to address this challenge. In this fund, we have 74 proposals in the assessment phase. With the creation of tools to develop DOAs, maintain them, or operate them we can help IOHK develop a blockchain to be reckoned with. Given the fact that the voters have been voting for this challenge in Catalyst since F7 and on the different communication channels like Telegram or Discord there is an abundant amount of talk about DAOs, this challenge is more than feasible to be addressed.", "q1r": 5, "q2": "Looking at the key metrics for the challenge they have stayed the same. In the last fund the key metrics were changed which made it clearer what the proposal was about and it got voted in for F9. Now looking at the challenge this time, we have a slight decrease in the number of proposals. The success criteria is well defined and easy to understand.", "q2r": 5, "assessor": "z_assessor_2285", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2516, "q0": "The rise of the decentralized technology has given rise to the concept of DAOs and decentralized decision making is becoming more and more important with the adoption of Blockchain technology. For the DeFI and NFT projects launching on these Blockchains, it is important to have a decentralized decision-making process to govern the project. From the regulatory perspective as well, it has become important for the projects launching in the space to become decentralized otherwise they run the risk of being categorized as securities by the regulators of different countries. \nThe answer to all these problems is to create Decentralized Autonomous Organizations which consist of holder of these token and which governance the decision making process of these projects. This shows that DAOs are becoming integral part of the projects launching on Blockchains. But DAOs face many problems like manipulation of the process by large holders of the coins of that project, lower voter participation, community engagement in decision making to name a few. We need comprehensive solutions build within protocol level to provide the projects much needed support to run their DAOs and overcome above challenges. Cardano’s Voltaire update will provide such support for governance but we will need innovative ideas to implement it for individual projects. This challenge addresses this problem and is very critical to achieve Cardano’s mission. If the challenge is successful, we might have many great ideas regarding DAOs and decentralized governance by the time Voltaire update is live on Cardano.\n", "q0r": 5, "q1": "We already have many DAOs running on Cardano and our community is working hard to make these DAOs successful. Catalyst in itself is on of the biggest Decentralized Governance Forum and the community here posses the right kind of skills to conceptualize and develop better systems for DAOs and in process make Cardano one of the most preferable blockchain for Governance requirements of the projects and even institutions in the near future. So I am very confident that the catalyst community will be up for the challenge and will come up with great ideas to improve the Cardano ecosystem.", "q1r": 5, "q2": "Some key metrics are suggested in the proposal to measure the success for such proposal but I think we need to add some more metrics so that the success can be measured form a wider point of view. Some of such metrics might be like 1) The average number of wallets who will be participating in the voting on DAOs on different projects. 2) The voting power which the top 10 wallets had and was the voting power skewed toward big wallets? 3) No of DAOs using innovative methods of voting then just using 1 coin 1 vote method.", "q2r": 4, "assessor": "z_assessor_2312", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4832, "q0": "This challenge is clearly aligned with the overall objectives of Cardano, this challenge is clearly beneficial for Cardano and its community since it aims to make Cardano the best choice for DAOs which are the future of the ecosystem. It can be a great opportunity for the proposers to develop or add tools for Cardano in order to make it better. This challenge is also aligned with the fund 9 strategic goals. ", "q0r": 5, "q1": "There is a lot of opportunity for the community to participate in this challenge, moreover, this challenge has already been existing for previous funds and has been impactful for Cardano and its community since some good proposals have been done (111 proposals on fund 9). The budget seems realistic according to the goals of the challenge and the opportunity that there is with this challenge. ", "q1r": 5, "q2": "The success metrics a well-thought and are beneficial to the Cardano community, these metrics are aligned with the challenge and to Cardano’s objective. The Key metrics are mostly about the impact a DAO is having on Cardano. This challenge can drive to a healthy competition between proposers and a possible collaboration", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6353, "q0": "DAOs are self-governed organizations defined by a transparent set of rules encoded as a computer program. One significant advantage of DAOs it does not require trust between two parties. In contrast, a traditional organization requires a lot of trust in the people behind it, especially on behalf of investors. In the case of DAOs, only the code needs to be trusted.\nThe DAOs are vital as they will be the subset of the Crypto industry along with NFTs and DEFI. Furthermore, because of their unique structure, DAOs offer the promise of enabling a focus on community rather than just profit. \nAs mentioned by the author, with this challenge, we have to build tools and infrastructure to make Cardano the go-to choice for building DAOs. Currently, the choice for DAOs is the Ethereum blockchain.\nThis challenge will help highlight a specific area within crypto to focus on and guide our efforts, i.e., DAOs. This challenge will prepare people who are capable of contributing to the ecosystem. Also, the proposals under this challenge will speed up the growth of the developer and DApp ecosystem. We already see many protocols and platforms built on Cardano for DAO operations; this challenge will further accelerate that. We can expect some DAOs to be open source, but it depends on the developers' intentions. \nDAOs will be one of the essential elements of the cryptocurrency industry. If we succeed in offering Cardano as the best option for the DAOs, it will be a springboard for Cardano adoption in the industry. Given the above points, this challenge is critical for Cardano's mission. ", "q0r": 5, "q1": "As reflected from the several proposals for the creation of DAOs or the development of tools & infrastructure submitted in past funds and their execution, the community is capable of addressing this challenge. In fact, in Fund 7, seven proposals were funded under the DAO challenge. Again in this Fund 9, we are seeing more than fifty proposals under submission for this challenge. \nThe author asked for a budget of '$1000,000', which I think is reasonable considering the high number of proposals submitted under this challenger. This increased participation also reflects the community's enthusiasm regarding DAOs. \nThis challenge is the continuous challenge from Fund 7 & Fund 9. Hence we have the challenge team coordinating and doing the necessary work. ", "q1r": 5, "q2": "The author mentions a few metrics to measure the progress of the proposals and the success of the challenge. The first two metrics, i.e., the number of communities engaged in collaboration using DAO tools and the amount of ADA coming from the DAO transaction fees, can be considered to measure the proposals' success. However, the author can further improve these metrics to include the metrics such as if the DAO tools and framework are being built, it can be the number of GitHub commits or milestones achievements. \nThe author mentions the clear success definition to make the Cardano the go-to choice for building and managing DAOs. Hopefully, we will achieve this soon if the proposals under this challenge are executed, and we develop quality protocols. ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8029, "q0": "This challenge will be important for Cardano's future. It will be important for Cardano to be able to offer the right tools and to enable effective DAOs and Creation & Operation. I think it's important that both small businesses and global communities have these tools at their disposal. If Cardano can evolve faster than the competition and bring new tools to the market with innovation, communities will understand why they should choose Cardano. Giving this project a chance for further development may see people move from the Ethereum blockchain to Cardano to set up their DAO infrastructure.", "q0r": 5, "q1": "This Catalyst community has the capacity to address this challenge. I myself have already read many projects about DAOs for Fund 8 and 9. There are many teams that are eager to be funded to further develop the innovative project of DAOs. There are already many teams creating platforms for DAOs. It would be a shame not to provide funding for this project because many teams are eager to continue working, but cannot do this without further funding.", "q1r": 5, "q2": "The success criteria and the proposed statistics are correctly defined to measure the progress of the challenges. This proposal meets Fund9's strategic objective. There are plenty of teams willing to contribute to the ecosystem through this topic. These project will be open source projects that can be used by anyone. The tools will be available to everyone and thus ensure that people can start with a DAO faster. This challenge will accelerate the growth of the cardano ecosystem. This challenge definitely needs to be taken up again for me to be funded.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10938, "q0": "To keep up with the current development trend, Cardano needs to build a DAO because blockchain applications have changed, such as currency to Defi and NFT. Therefore, this transformation is necessary and inevitable. In the future, DAO Cardano will help businesses and the global community best manage DAOs.  Challenge setup DAOs <3 Cardano has been done in previous funds, and I believe this challenge perfectly aligns with the Cardano mission.", "q0r": 5, "q1": "Setting up the challenge of DAOs <3 Cardano is following the success of fund7, and fund8, which had many proposals funded and implemented. So I fully believe that Catalyst can fulfill the challenges set out well. The Cardano community will contribute to creating tools that make the DAO more efficient. From there, Catalyst will have more participants to collaborate with, and the Cardano community will collect the transaction fees of the DAOs. The need to create a private DAO by the community is very high, so setting up this challenge successfully will bring many benefits to the Cardano community; this challenge is being worked on, and on the upswing, I think Cardano should keep building this project. One thing to remember about this challenge is the best practices for DAO operation and governance.", "q1r": 5, "q2": "Success criteria and challenge success metrics are clearly stated based on the number of participants using the DAO, the amount of ADA collected from transaction fees, etc. For Cardano DAO to succeed, Cardano needs tools to create outstanding features for effective management. The unique thing about the challenge setup is that the ADA revenue from transaction fees will help reinvest projects and support expansion and challenge development.", "q2r": 5, "assessor": "z_assessor_3208", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 13038, "q0": "I believe that people in every country have more in common with each other than the centralized legacy institutions that control and govern them. The idea of a DAO (decentralized autonomous organization) is to bringing together people from around the world who do not know each other but share common goals or values while making it possible to establish governance and make decisions autonomously all with the security of block-chain. It eliminates the bureaucratic and hierarchical hurdles that are endemic in the legacy systems that surround us while allowing automated trusted transactions and value exchange. I can't think of anything that could be more representative of Cardano values or something that has appeal to such a wide demographic having the capacity to onboard people of every age and ethnicity.", "q0r": 5, "q1": "The challenge team is well rounded with prominent and active members of the community. Their budget is the same as when they were successfully funded as a challenge setting for Fund 9 and the voter approval rate at that time was 98% which seems to indicate they are asking for a reasonable percent (8%) of the funds available for all the challenge settings.\n\nThey have linked many DAO building dApps in their proposal but it doesn't take long looking around on the internet to see that most DAO related tools that searchers are led to are Etherium based. I believe all those tools/dApps/handy infrastructures should all be Cardano, only more and made better as one would expect from Cardano. DAO creation and infrastructure was a challenge setting in Fund 7 and again in Fund 9 so we can see how proposers have begun to address how to \"make Cardano the go to choice for building DAO's\". Funded proposers have been developing Plutus smart contracts, dApps, creating DAO friendly communication platforms, working on cross-chain interoperability, ect. the transformation is underway and should continue to be a reoccurring challenge setting until all those who search for how to create or find their DAO are led to Cardano.", "q1r": 5, "q2": "Because this has been a previous challenge setting it would have been nice to see the inclusion of some KPI's related to how DOA support/development/tools are progressing rather than a rehash of the previous challenge setting proposal. For example, what was the “number of communities engaged in communication using Cardano DAO creation tools”? What is it now? How have the “number of DOA tools/framework available for DAO Ops” increased as a result of this challenge setting? \n\nThe list of key metrics to measure success that was provided by the challenge team is a good list, it just would have been nice to also include how this continuing challenge setting has had impact. However, because what was laid out in the proposal is all still true and applicable there is no reason to deduct any stars. \n\nThis is easily verified by the community or anyone who walks through the steps to create a DAO but as I said before, true success will only be when all of those people find themselves led to Cardano. ", "q2r": 5, "assessor": "z_assessor_3545", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 13615, "q0": "In the coming years, the general trend of blockchains is to develop decentralized autonomous organizations. Because the advantages that DAO brings are increasingly evident: DAO helps participants have more benefits and fairness. All members can know and vote, and the DAO will serve the wishes of the majority. More importantly, the members of the organization don't need to know and trust each other because their every action will be recorded on the chain, which opens up a lot of potential for cooperation between strangers. And countless other possibilities that DAOs will gradually discover.\n\nDAO organizations have been very active on other blockchain ecosystems, especially on ETH. Looking at the Cardano ecosystem, I am sad that I have not seen a solid and effective DAO organization. Especially have not seen tools to support the development of DAO organizations.\n\nThis challenge is very relevant to the development of Cardano, and it will greatly contribute to the growth of small communities and smaller organizations.\n\nWithout the necessary funding from Catalyst to develop the DAO, Cardano would be very slow to scale. I rate this Challenge extremely important and 5 stars is well deserved.", "q0r": 5, "q1": "In a Crypto winter, people are starting to return to the real world and are less interested in DAO activities or other Cardano news.\nIt can be a big challenge to contribute ideas and suggestions about DAO tools or applications. But now, it is an opportunity to screen out those who have faith in Cardano in the future of Cardano's sustainable development. So, proposals to contribute to this Challenge may be few and far between, but we should maintain this sponsorship regularly to find good ideas and high-performance teams.\n\nAnother difficulty is in terms of the technology and infrastructure of Cardano. It is a significant barrier for developers to develop DAO organizations on Cardano. It may take a long time for the developer tools on Cardano to mature and get better. Make it easier and faster for developers to build DAO-enabled tools or DAOs.\n\nBut If we don't take action now, there will be nothing in the future. I believe in the Catalyst community; there will always be teams of skilled and capable teams that can overcome technology barriers to help grow the DAO model on Cardano.", "q1r": 4, "q2": "DAO is still very new and has not yet exploited the full potential that it possesses. Therefore, the author should stick to the proposals and evaluate the impact of the sponsored proposals on the development of Cardano. It's not just numbers about the number of users, the number of transactions.\n\nGoing further, the author needs to find and develop proposals that can generate revenue and profit to continue to maintain those activities. Make those operating models sustainable. Because I see a lot of proposals, after the proposal is completed and funding is closed, the project also stops working. If so, it will be very difficult for the Cardano ecosystem to develop sustainably.\nI know that making this request can be quite challenging for the team making the proposal and even the creator of the Challenge. But if we don't do something more drastic and value driven, then we don't know when Cardano can go far.\nIf the seed we sow today is not good, how can we harvest good apples.\nTherefore, indicators and criteria need to be stricter and more focused for long-term development.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}], "importance": "Blockchain applications have moved from Currency to DeFi, to NFT. DAOs are Next. Cardano needs to be ready for when that happens.", "success": "There are no better ways to manage your DAO than to use Cardano DAOs. From Small Business to Global Communities.. Cardano DAOs deliver."}