{"id": 420610, "author": "lloydduhon", "title": "Improve User Experience on Cardano", "url": "https://cardano.ideascale.com/a/dtd/420610-48088", "category": 26604, "amount": 2000000, "description": "How do we Educate, Entertain, and Excite our community? Can we build experiences that users don't want to live without, that they control?", "f6_no_assessments": 8, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1796, "q0": "Improving User Experience on Cardano is critical to cardano's mission and well aligned with Fund 10 strategic goal \"Build real-world solutions based on the Cardano blockchain\". Real-world solution can indeed only succeed if non-technical users are well onboarded. This requires that solutions are designed to provide seamless experience, excitement, and happiness.\nThis challenge could overlap a little with the Dapp, Products and Integration Challenge, but I consider UX is an important enough matter to deserve its own challenge, for this reason I give an alignment score of 4.", "q0r": 4, "q1": "The challenge brief is clearly stated, and good guidance is given to proposer on how to address a user experience challenge. There is a good level of details about what is expected for proposal in this challenge, which ensures that the community will not make many off-topic proposal.\nWhen reviewing proposals in the Dapp, Products and Integration Challenge, I have noticed that many proposal teams embed a UI/UX development skill. I'm convinced that the community has the capacity to make good quality proposal in this challenge.", "q1r": 5, "q2": "The brief defines how to measure a user experience through Usability/Engagement/Conversion metrics. Examples are given to help proposers to define success metrics that will enable the community to track the progress of their projects with regards to UX.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 3288, "q0": "This challenge setting for incentivizing user-centric design principles in the Cardano and blockchain ecosystem is well laid out and presents clear alignment with most of the Fund 10 goals.\n\nIn particular it has strong alignment with 1 and 4 which are focused on the link between people and the technology they are using. Improving process through the design principles, including the standard usability, engagement and conversion metrics, but with an overlay of the 3 \"E\"s, excite, entertain and educate, the team has provided a solid starting point for proposers to bring their ideas into alignment with the Cardano mission of inclusivity and being able to be a toolkit for all. (For those who don't know what \"conversion\" is, it is usually expressed as a rate at which users become adopters of a certain thing. \n for example, websites have well known metrics around how to establish a first impression, and from that initial baseline they look for increases in key metrics like clickthrough rates to tell them that someone has stuck around and is using their site to access other areas of the site or information provided, and this is the \"conversion rate\").\n\nWhile I appreciate the description of the 3 \"E\"s and believe they will be valuable indicators to use, I encourage the proposal team to consider also adopting the principles of \"Inclusive Design\" (http://www.inclusivedesigntoolkit.com/whatis/whatis.html) as I think there is a lot of overlap and they would be able to articulate some of the points they have made even better.\n\nBecause the proposed challenge effectively seeks to improve the usability of tools throughout the ecosystem (which in turn will help more projects in other settings to also improve usability, a virtuous cycle) I believe they have effectively met the standards required for alignment. 5 stars.", "q0r": 5, "q1": "They provide a really good map of how proposers should both think about the issue as presented, as well as how to approach it through their proposal.  I would have appreciated some more examples, because as it is phrased it really sounds like the target here is anyone designing a UI/UX to grab funding from here in order to add the principles and support provided here to their buildout.  What isn't clear is if research into these ideas would be welcome under this proposal, or dedicated opensource documentation, or frameworks or SDKs for building these things.  Would it be appropriate for a proposal funded in another challenge for a Dapp, for example, to also approach this challenge setting specifically to fund its UI/UX budget for the Dapp, presumably to bring its UX into alignment with these principles?  I would guess all of the above is allowed and encouraged, and examples would have made that clearer.\n\nBecause UI/UX optimization based on these inclusive principles is definitely within the capabilities of the Cardano community, and because they have provided many resources for orienting proposers to the Fund 10 goals, I believe it has a solid foundation for Feasibility, however, the lack of examples or descriptions of what kinds of proposals would satisfy the challenge requirements leaves the question a little too open-ended, so I am marking down one star for a 4 star rating.", "q1r": 4, "q2": "Despite the lack of clarity of just what kind of scope proposals under this challenge might pursue, there are loads of ways for those proposals to measure objectives once they are on track.  Specifically, they list out key metrics for each of the 3 broad areas of standard UX design, and include 6-7 metrics for each that have been adapted from the 3 \"E\"s for teams to measure a successful implementation of these principles.\n\nBecause the team has provided metrics that would apply to most use cases imaginable under this challenge setting, I feel that proposers would be able to successfully set reasonable and relevant objectives within it and I am rating verifiability a full 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3363, "q0": "Based on the information provided in this challenge setting proposal, I think that it will address some of the four strategic goals. The challenge addresses the first strategic goal (prepare a group of individuals able to contribute to the ecosystem) by providing a space for people to propose solutions to the issues they see with regard to user experiences. There are some good guidelines in the challenge setting, such as the three E’s (entertain, educate, and excite) that can help future proposers prepare their own proposals. The metrics provided are also good guides for developing a project. There are clear goals to achieve, such as better usability, increased engagement, and more conversion.\n\nThe proposal sort of addresses the second strategic goal (build an open-source ecosystem and attract more developers). I did not see any mention of how the challenge setting will encourage more open-source projects. It would have been nice to see the proposers include something about how the challenge setting would do that. But, I do see how the challenge setting could attract new developers, despite it not being listed explicitly. The area of improving user experience is very broad, so there will need to be many developers who work on this key part of the Cardano ecosystem. Thus, developers will come to Cardano with their ideas if they know that there is a challenge setting that can accommodate their projects.\n\nThe proposal partially addresses the third strategic goal (build real-world solutions on Cardano) because it encourages people to write proposals that will make Cardano more user-friendly and accessible. The only reason I can’t give much more insight into the real-world impact is that the proposers did not provide much information about how the challenge setting will encourage the development of real-world solutions. Many broad terms were used and no specific implementations were provided as examples. “User experience” is a very ambiguous term, so providing some examples of potential focus areas or ideas that fall under this challenge setting would have been helpful. The proposers mentioned usability metrics, which I see could be real-world solutions because they can help people more easily “complete tasks.” However, it is unclear what kinds of ideas could fall under this concept and also require funding for it. It would have been much better if the proposers of this challenge setting had provided more examples.\n\nLastly, the challenge setting can address the fourth strategic goal (improve tooling to support human processes in Catalyst) because the entire premise of the proposal is to make “experiences” more friendly to users. This could include Catalyst if there are any proposals that connect back to it. Again, it would have been nice to have more explicit information about this too. Overall, this challenge setting covers some of the strategic goals, but is missing information that could have addressed some of the strategic goals better. (score given: 3)\n", "q0r": 3, "q1": "Given the information provided in the proposal, I think that the Cardano community could address this challenge, but I do not know how many projects could make use of this challenge setting. It seems like improving user experience is more geared towards already developed projects that need funding for improving the user experience of their product/platform/idea, or proposals that want to improve an already existing system. There are definitely some cases where a proposer wants to create a completely new idea that can address a problem related to user experience. It would have been nice to see some more ideas for how the Cardano community could approach this challenge setting. I think there is definitely a subsection of the Cardano community that could use this kind of challenge setting, but it’s unclear from the description I read. \n\nThe budget for this challenge setting seems a bit high (at 2 million ADA), but that also may be a result of not enough information being provided on what kinds of projects would make use of the funds. I agree that improving user experiences is incredibly important, but I can’t give it a score of 5 since it was missing some details that would have given much more context into the types of proposals that could fall under this challenge setting. (score given: 4)\n", "q1r": 4, "q2": "Based on the information provided in the proposal, the challenge is decently scoped in the measures of success. The metrics were broken down into three categories, usability, engagement, and conversion. All of these categories had lists of KPIs. For example, under usability, there is time on task, success at task, perception of success, confusion reduction, recognizing clues, and navigation usage. I understand how some of these metrics are important for usability, but I don’t quite see how perception of success can be measured by future proposers. Do they need to take surveys of their users? Many of the metrics provided are incredibly subjective, meaning it would require a high level of surveying to fully understand if these metrics were met or not. I think the proposers could have provided some more metrics of success that are less subjective. I understand it is hard to measure success for user experience, but there must be some way to make it slightly less subjective. It will be very challenging to get an accurate picture of success based on the metrics listed in the challenge setting proposal. These metrics should encourage healthy competition between proposals if they can be accurately measured or even quantified. (score given: 4) ", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "In Impact, the user agrees that the challenge setting meets fund 10 strategic goals, and then chooses 3 stars, neither agree nor disagree. This is inconsistent logic by the assessor."}, {"id": 3796, "q0": "Upon reading this challenge setting proposal, I somehow can relate since I know some friends who actually holding ADA but have problem setting up native wallet, using DEX to swap tokens, getting tokens from dispensing, or distributing app/service such as Dripdropz, and many other instances of not being familiar with the wonderful world and marvel of decentralized applications (dApps). Most of them will probably just keep holding those keep using CEX wallet. This all could be caused by the fact that blockchain tech is still relatively novel. This caused general crowd has very limited understanding and knowledge truly decentralized technology such as Cardano. Probably the only info they got is from mainstream medias mostly supported by people who are afraid of decentralization. This lack of understanding and knowledge then leads to unfamiliarity and hesitation to try using it. Having better user experience will have a positive supporting impact to help people be familiar using this nascent technology by warming up the interaction between human and machine.\n\nHowever, above being said, separating user experience (UX) from software or application development as whole is a bit off to me. I will try to explain a bit more about this in the next two aspects. So far, the idea behind this proposal still aligns with some Fund 10’s missions and goals to attract more people into adopting Cardano tech, finding standard solutions to achieve good UX in Cardano and open -sourcing it, impacting real world through Cardano-based solutions, and maybe making human processes in Catalyst easier (such as issue and complains with IdeaScale). In conclusion, I can only rate this proposal’s alignment with an enervated 4 since I think there are probably better resources apart from Catalyst to address this challenge.", "q0r": 4, "q1": "The kind of proposals we can expect to participate in this challenge is still somehow vague and hard to think of. Submitting a dApp proposal to dApps and Product-themed challenge and separating the UX budget by creating a different proposal submitted into this challenge is awkward at best. Proposers might not really be aware of the possible direction to go with. Maybe the challenge setting proposer can give few cases of bad or subpar UX in Cardano as examples to inspire coming proposals to alleviate this issue of limited clarity. Challenge team is also not mentioned yet and currently difficult to imagine who in Cardano or Catalyst will be suitable and able to help. Lastly, the fund asked is also on the higher side of budget spectrum for a challenge and any reference case to study from previous funds make this is quite risky for the community. I suggest asking for and start with lower budget to study and formalize the deliverables we can expect from this sort of challenge setting proposal then slowly developing from there.", "q1r": 3, "q2": "While the metrics of the UX are on point and are fair standards in software development industry and knowledge, I am not sure if those are the right things to measure in ecosystem level. To me, they are more useful in product proposal level rather than challenge level. If I may suggest, these might be more suitable metrics to track in addressing the challenge and its outcome, including but not limited to,  growth in new users onboarded represented by new wallets from the proposal implementations, retainment/retention of users through measuring the period of inactivity (no transactions) or average time between two set of transactions  in different days, more activity and engagement represented by transaction number each period, and how many different kinds of transaction (transfer, staking, signing, minting, depositing, withdrawing, vesting, etc.) being done using various dApps in Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_2482", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Assessor provided suggestions for how they believe the challenge setting should have been run, rather than discussing the merits of the setting as presented. User shows bias because they believe some users may not see a way to separate UX from application design."}, {"id": 4555, "q0": "As a non-technical user who entered the community about a year ago, improvements in user experience and accessibility immediately struck me as important.  As I've been learning how to function within Cardano, I found that I would have liked access to more tools to help me understand these new concepts as a non-technical user.  Tools proposed in this challenge would help new users foster an“I am able to do this and I find these applications useful in my life” attitude rather than thinking, “this is difficult and risky, I don't need this and I don't want to be involved.”  The important idea of agency is addressed – not using the tools because the individual has to, but because they choose to use them.\nThe 3 E's (Entertain, Educate, Excite) are rightly presented as great motivators, but I especially love the accent on building new systems that lack the 4th E...Exploitation.  I think that developed and third world countries alike are hungry for these kinds of systems  - To promote stress reduction, increase quality of life, increase sense of happiness/fulfilment in people, and making best efforts to eliminate the systemic problems that have plagued societies for ages.  This challenge proposal gives proposers space to address all 4 Fund 9 Strategic goals.    I rate the alignment of this challenge proposal with 5 stars.", "q0r": 5, "q1": "Usability, Engagement, and Conversion are the 3 core metrics are clearly provided in the proposal.  As a challenge setting, the outlining of these metrics leave plenty of room for interpretation so a variety of different kinds of user experience improvements can be proposed.  However, the metrics also paint a clear picture of what those situations would look like if they were executed effectively.    Rated with 5 stars.", "q1r": 5, "q2": "Some measurable criteria mentioned in the proposal include task completion, perceived ease of use, continued engagement, and rate of recommendation to peers.  There are also detailed breakdowns for facets of Usability, Engagement, and Conversion that include examples of both measurable and anecdotal/narrative evidence of effectiveness.  This proposed challenge setting appears to cover the bases while keeping the setting open to creativity, rated at 5 stars for verifiability.", "q2r": 5, "assessor": "z_assessor_2563", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6711, "q0": "There is definitely a real and present desire in all of us to have access to better applications in terms of functionality, appearance and ease of use. And this is exactly the idea behind this proposal - to support projects that deliver enhanced usability, engagement and conversion for Cardano projects (the three key metrics of UX/UI). The challenge’s very clear focus helps us to immediately identify a group of people who will be supported by it: user experience specialists. Unfortunately, the challenge does not address the other two strategic goals: neither will it help to develop an open source environment (since it’s out of scope for user experience activities), nor will it help bring additional real world use cases to Cardano. In conclusion, four stars for only partially advancing the strategic goals.", "q0r": 4, "q1": "The multitude of projects being built on Cardano is definitely a strong argument in favor of more UI/UX investment in the future. As some of the existing applications will gain traction, the need to improve their user experience will definitely increase. Will the Cardano community be able to tackle this challenge though? I argue that this will not be an issue in this case, since there is already a UI/UX industry flourishing, with significant existing competence in the area, but not necessarily activating in the Cardano community. But that is definitely not a problem, since competence always follows money, and having a dedicated challenge specifically for this topic is bound to bring more external competence to fill the need. \n\nUser experience is  a domain intimately ingrained into each individual project and it has to be tackled at the right time in order to deliver its full efficiency - in the initial stages of development. More often than not, focusing on all the other bits and pieces of a project and not tackling UI/UX before a product's launch is a terrible mistake that is bound to turn many users away following a bad  initial user experience. I think a missed opportunity was to explicitly define the types of projects that are encouraged to apply, for example overarching proposals (development courses, assistance for existing projects, UI/UX audit) or proposals to fund partially UI/UX portions of larger budgets. \n\nWith a good (including external) capacity to tackle this challenge, but with a rather poor description of what types of projects are encouraged to apply, only four stars are appropriate here. ", "q1r": 4, "q2": "A positive aspect of the challenge’s very targeted focus is that competition within projects will be very precise and highly relevant. However, I don’t think the challenge is very well scoped in terms of defining success. Although there are quite a few metrics proposed, they are rather general and difficult to measure. The challenge also does not address set clear targets or objectives, for instance: net performance scores, user feedback on application stores or measuring user experience through external benchmarks. In conclusion, four stars again due to the lack of concrete success targets. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9793, "q0": "1. User experience is critical to the success of any application, product, or platform; it determines whether we keep existing users and attract new ones. From my perspective, this is a good idea and a necessary challenge because, obviously, in order to reach the masses especially non-technical users the Cardano ecosystem must be simple to understand, accessible, and simple to use, which is the first step. With the technical language barrier and products that have yet to be refined in terms of user experience, it is easy for developers to overlook many potential users and Cardano's ability to be popular. It is also more difficult to spread.So I strongly support this Challenge because the effect will be very low if we continue to expand to find new communities but the ecosystem makes it difficult for users. When focusing on the 3Es: Entertain, Educate, and/or Excite, the author demonstrates a strong understanding of UX and Cardano.\nCardano will undoubtedly reach more non-technical users if these three critical factors are met.\nAs a marketer, I strongly support this challenge and hope that it will encourage developers to pay more attention to UI-UX issues and to come up with new ways to improve the user experience on the ecosystem.", "q0r": 5, "q1": "This challenge focuses on a fairly real issue in our ecosystem, which has also often been discussed extensively in the group. When I looked at the authors' proposal in the products section of recent funds, I noticed that many people were aware of the user experience in the process of designing and creating products. When this challenge is born, everyone in the ecosystem will undoubtedly contribute to it. Furthermore, because UI UX is not a new field and is quite familiar to technical and IT professionals, the Catalyst. Looking at the proposal, I only have one thought: the author appears to be very knowledgeable about user experiences; the proposal would be more feasible if the author and his team formed a team of UX advisors to assist developers in the ecosystem. ", "q1r": 5, "q2": "The author has proposed several Ux metrics to assess the project's success. It is also quite logical and understandable. However, the measures remain unclear and unquantifiable. This number, I believe, can be tracked by proposals related to Ux UI, as well as projects funded in this area. Optionally, it is possible to create target tables for users of existing products on the ecosystem from which to have a basis for upgrades and improvements.", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11961, "q0": "This challenge is aligned with Cardano's mission, and could increase further adoption in the future. This challenge also is important because it tries to fulfill the user’s needs. It aims to provide positive experiences that keep a user loyal to the product or brand. Additionally, a meaningful user experience allows you to define customer journeys on your product that are most conducive to business success. What is essential to keep in mind is that the product/dApps or anything that is being built in the ecosystem, we might not be a potential user who might be using the product. Hence we cannot assume what a user wants or How they need. By getting close to the users/community, talk to them, watch them use your product, get inside their heads and question yourself about the decisions they make. Smart user experience design starts by identifying the problem and guiding all ideas to solve that problem. Therefore, I feel that this challenge will definitely improve the quality of Cardano's ecosystem, as well as solving the consumer end problems together with the community.\n\n", "q0r": 5, "q1": "The community has the capacity to address the challenge. With many pioneers in Catalyst ranging from developers, entrepreneurs, designers, and marketing experts, I think this challenge could bring great minds together to improve Cardano's user experience. I suggest that we can further bring UI/UX designers, graphic designers, and other creatives to have their own Catalyst group that discusses on user-centric approach when designing/building dApps in the ecosystem. Or even a core design system where builders/developers could take basic  guidelines  and general components. This would likely set a benchmark of high quality dApps for anyone that wants to build in Cardano. So, for this challenge, I feel like creative thinkers/UX experts could propose effective and consistent ideas for the community. By making this a challenge active for Fund10, it will be a great start for seeing ideas/research that caters for the consumers end, in turn to really have an adoption of ordinary users - that uses Cardano's ecosystem without having technical knowledge but more on real value use cases which benefits their daily lives.", "q1r": 4, "q2": "The criteria and metrics suggested are the core of user experience, and there are many laws that fall under these key metrics. Extensive research of demographics/user behaviour towards dApps too are crucial to when it comes to improve the quality of the ecosystem. We can honestly see that there are most dApps in the Cardano ecosystem that have a very difficult way of using it, also stresses the users to some extend due to design, and not having deep user research on successful existing Web2 companies (due to the dogma of Web3 being against centralised entities).  One of the examples that I have seen from other chains is Aurora, they have improved their user experience and followed Apple in ways to present their product. They have also made easy for users to make transactions all in one place with a simple but effective dashboard. I believe that Cardano could do the same, or even better with the growing talented people in Catalyst. ", "q2r": 5, "assessor": "z_assessor_3320", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "importance": "The future of blockchain tech is building out the experiences that users want in their lives, while leaving them in control of their info.", "success": "Experiences are built that draw a new user base that takes advantage of the underlying technology, while providing value in their lives."}