{"id": 421390, "author": "dag1", "title": "Lace Live Demonstrations", "url": "https://cardano.ideascale.com/a/dtd/421390-48088", "category": 26604, "amount": 50000, "description": "How can we promote mass adoption of Lace wallet?", "f6_no_assessments": 6, "f6_rating": 1.8333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 172, "q0": "The challenge setting could have explained what Lace Wallet is all about in the first place.\n\nLace is the light wallet being developed by IOG to serve a large niche of the community that was helpless.\n\nThe wallets considered official at Cardano are Daedalus, developed by IOG and Yoroi developed by Emurgo.\n\nDaedalus many months ago stopped being a viable option for everyday users due to higher hardware and bandwidth requirements and this is understandable as Cardano's blockchain has increased a lot in storage space after the Goguen-era updates, ale´ Furthermore, Daedauls is a full node and brings greater sovereignty and autonomy to the user.\n\nYoroi is a light wallet for mobile/browser and is more practical to use than Daedalus, as it does not need a copy of the blockchain to run and is not a full node. However, Yoroi many months ago began to have performance problems due to dependence on Yoroi's servers, which makes the UX terrible for users.\n\nSeveral wallets were developed by the community to solve the problems of official wallets, such as Nami, Eternl, Gero, Flint, among others.\n\nAnd today the community has several options for wallets, what is lacking is certification and standardization of security requirements to guarantee greater security to users.\n\nLace is a wallet developed with the future in mind, which will not require hard hardware or bandwidth requirements, will also have no backend dependencies and can have security equivalent to Daedalus through the concept of blockchain snapshots brought by Mithril. In addition, it will have a UI/UX appropriate to the needs of the community.\n\nAlthough Lace is an important tool, I don't see this challenge setting as critically important to the Cardano mission at the moment, as the community is already served with different wallets and if the Lace product has quality and fulfills the promises to deliver what the community wants, the integrations in applications will be natural, as it was with Nami and Eternl.\n\nIt is unclear what kind of solution could be created in this challenge setting and as IOG already has a watchest to develop LACE it would be important to define why the treasury would need to allocate more resources to a product that is already being developed by IOG.", "q0r": 3, "q1": "Although this challenge setting requires a relatively low budget and should not cause problems to create demand and proposals in it, the challenge brief for this challenge setting contains only one line. There are dozens of applications running on Cardano's blockchain, there should be no difficulty finding teams that want to integrate these applications with the wallet. LACE is a product being developed by IOG and the challenge setting does not indicate what types of proposals could be created beyond a vague definition of integrations, which is not an appropriate description for a challenge setting.\n\nThere is a problem in assessing whether the Cardano community has the capacity to address this challenge, firstly that it is not clear what the goal of the challenge is. Massive Wallet Adoption? What would be considered mass adoption? Massive adoption in the Cardano ecosystem? What is the line that defines mass adoption?\n\nThe definition of success on the other hand is realistic: \"Success looks like an increase in Lace wallet downloads and Dapps being produced using Lace wallet as it's choice.\"\n\nIf the mission is to increase the number of downloads and make Lace an option for interacting with dapps, the community is able to address the challenge without great difficulties, as it is not a complex objective, but the definition of mass adoption would need to be better explained. .", "q1r": 3, "q2": "The definition of success needs some modification to become a good indicator of success.\n\nIncrease in the number of downloads from Lace can have many causes, how to differentiate the increase in downloads caused by this challenge from organic downloads?\n\n\"...Dapps being produced using Lace wallet as it's choice.\" It is a reasonable goal, but it would be important to define a period of time to assess the outcome of this challenge. How long are dapps expected to integrate with Lace? 6 months? 1 year?\n\nOnly 3 metric keys were established:\n\n\"The Amount Of User Downloads\"\n\"The Amount of Dapps Created Using Lace\"\n\"Lively Community debates about new features to add.\"\n\nThe first, as mentioned before, needs to be better described, as Lace downloads need to be counted according to proposals that are eventually created in this challenge, only then would the indicator be useful and reliable.\n\nThe second key metric is relevant and appropriate.\n\nThe third key metric is subjective and not easy to measure, so it does not significantly add to verifiability.\n\nI would recommend including more key metrics and time frames in order to assess outcome over time.\n\ne.g.\n\n-Number of unique wallets interacting with Lace in solutions created in this challenge. over 6 months\n-Number of transactions and volume resulting from integrations that used Lace in this challenge over 6 months\n-Bugs and issues identified in the integrations\n-Number of repos/commits related to the integrations", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 7, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 639, "q0": "This challenge proposal goal is to promote the mass adoption of Lace wallet. It is a very straight forward goal and simple to understand and would be directly related to increasing adoption of this wallet developed by IOHK through live demonstrations of other methods. This goal is not directly related to any of the goals of Cardano’s mission for Fund 10, and it would only increase awareness about a specific wallet. It could, at the end, attract users and possibly indirectly address the other goals. Although, this challenge depends on the launch of Lace. And, as happened before, it is not ideal to have a challenge like this with a product that hasn’t been launched yet because usually here are some delays, and by the time I’m writing this assessment, there no date for Lace to be launched. For these reasons, I believe the alignment of this challenge is very low.", "q0r": 1, "q1": "The Catalyst and Cardano community would definitely be able to submit good proposals and to make this challenge a success, since there are already many people in these working with marketing, awareness and advertising. Although, as mentioned, this depends on the external factor of Lace actually being launched. The budget requested is 50k ADA, which, according to current rate, would be approximately $25k. To get mass adoption, though, this budget seems to be a bit limited, since marketing is not that cheap and if the goal is to reach all the crypto community, it would take more than just $25k, which is not necessarily going to fund a single proposal. Overall, I believe the feasibility of this challenge proposal is very low.", "q1r": 1, "q2": "The proposal suggests 3 KPIS to be used to measure the challenge’s success: amount of user downloads, amount of dApps creates using Lance and Lively community debate about new features to add. The last KPI I believe it not easy to measure, and the first two are very difficult to separate from general downloads and integrations of Lace that will occur when it’s launched. For download, it would be possible to use a trackable link, but not necessarily everyone would it use, and for integrations it would be even more difficult. A good KPI for this challenge, in my opinion, would be related to social media engagement and visualization, and other metrics related to traffic through the links used in the marketing campaigns.", "q2r": 1, "assessor": "z_assessor_2110", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 1800, "q0": "This challenge calls for proposal that would promote adoption of the new Lace Wallet, sucess being defined by an increase in Lace wallet download. \nLace wallet adoption is indeed important, however it is not critical to cardano's mission as many other good quality wallets exist. Moreover this challenge does not align with any of the 4 Fund 10 strategic goals.", "q0r": 1, "q1": "No proposal direction are listed in the challenge brief, and the definition of the success is not a sufficient guide for proposers. Increasing the download of an app does not seem a tough work though, to the community could reasonably make some acceptable proposals in this challenge.", "q1r": 3, "q2": "The scope of the challenge is precise, how ever the challenge setting proposal lacks potential directions to make sure that no out of scope proposals are made. Measures of success are quite relevant, but again this is not a relevant challenge versus Catalyst Strategic Goals.", "q2r": 2, "assessor": "z_assessor_2264", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 3365, "q0": "Based on the information provided in this challenge setting proposal, I don’t think that it addresses all of the strategic goals for fund 9. The proposal partially addresses the first strategic goal (prepare a group of people to make contributions to the ecosystem) because it encourages people to find ways to increase the number of Lace wallet downloads. While doing so is a contribution to the ecosystem, I think that the proposers of this challenge setting could have done a better job of providing some more guidance for future proposers. There could have been a couple more examples of ways that proposers could increase the number of Lace wallet users, such as video tutorials, wikis, etc.\n\nThe proposal partially addresses the second strategic goal (build an open-source ecosystem and attract more developers) by encouraging people to build DApps that can be used with the Lace wallet. Since the Lace wallet is in development, there is opportunity for new developers to be brought into the ecosystem to create new ways to use the wallet. Interactions with the wallet are key in growing it to become a key part of the ecosystem. As a result, there is a market here for new developers. However, this challenge setting proposal did not address the open-source nature of the challenge setting. There was no mention of whether integrations or projects will be open-source. I understand that most projects in this challenge setting will be live demonstrations, but the proposers could have mentioned a statement about making projects open-source when possible. It would have allowed me to say that this challenge setting fully addressed the second strategic goal, but it doesn’t in its current form. \n\nThe challenge setting can address the third strategic goal (build real-world solutions on the Cardano blockchain) through the DApps developed using Lace and the community debate about new features. There are opportunities to build real-world solutions that can benefit users of the Lace wallet, such as useful real-world integrations like DID or SSI. Connecting the wallet to the real world could have huge potential impacts. At the same time, the challenge setting can indirectly bring in new interest in the Lace wallet through the tutorials. Eventually, the more people that become interested in Lace, the more developers will want to build DApps that can connect with the wallet. In the end, there could be a bright future for the Lace wallet, where many developers are building things for the wallet, which all started from the simple task of building more awareness.\n\nThe challenge setting does not really include ways in which the fourth strategic goal (improve tooling to support human processes in Catalyst) can be addressed. I did not see any reference to how this challenge setting will affect any tools for Catalyst processes. If the proposers had added some information about how the challenge setting could address this strategic goal, it would have greatly strengthened the proposal. A potential suggested idea that I have is that the Lace wallet could be integrated with DID to make Catalyst registration easier as well as more secure. \n\nOverall, since not all of the strategic goals were well addressed or addressed at all by this challenge setting, I can’t really agree that this challenge setting addressed alignment well. (score given: 2)\n", "q0r": 2, "q1": "Based on what I know about Cardano, I think that the Cardano community has the capability to address this challenge. It seems like there are many groups who are interested in tutorials or education about Cardano applications/services. I have seen some proposals in other challenge settings from past funds (mostly in the Grow Cardano challenge settings) that are about teaching people how to use certain platforms or use Cardano. As a result, based on that prior knowledge, I think that there will be enough participation in this challenge setting. People are always able to make demonstration videos and tutorials for the community – these kinds of videos do not require too much technical knowledge. There are also developers who want to build DApps and make connections to wallets that can help their DApps. This area has huge potential to grow in the coming months and years as more developers see the impact of making integrations for wallets. Growing Lace is like growing Cardano, so people will always be willing to participate. \n\nThe budget (50k ADA) for this challenge setting seems reasonable, if not a little low, for the scope of this challenge setting. Since the main part of this challenge setting is about educational videos or demonstrations, the budget does not need to be huge. There only needs to be enough funds to support a handful of tutorial projects. I do, however, see the potential of there being not enough funds for some other development-heavy projects because development of integrations with a wallet like Lace can take a lot of time and money. I could actually see this challenge setting having more funds available for developers, like 100k ADA. In the future, I would suggest that the proposers consider this idea in order to make sure that there are enough funds to actually accomplish all of their goals for the challenge setting. With the given budget, there might not be enough funds for all necessary proposals. Since this challenge setting’s budget isn’t necessarily sufficient for the challenge setting, I can only give this proposal a score of 4 for feasibility. (score given: 4)\n", "q1r": 4, "q2": "Given the information provided in the challenge setting proposal, I think that some metrics for success are defined, but they could overall be stronger in certain areas. The proposers mentioned the amount of user downloads, the number of DApps created using/for Lace, and lively community debate about future features for Lace as metrics of success. However, there were no metrics about the number of views for demonstrations, which seems to be the main focus area of this challenge setting. Also, if the proposers are including development as a focus area, then they could have added some other metrics, like amount of ADA moving from Lace wallets to DApps or number of connections made by users between integrations and the Lace wallet. These are just a couple of suggested ideas that I came up with that could make the challenge setting’s metrics of success stronger for its focus areas. Overall, the ideas for metrics of success are good, but more (specific) examples could have made it better. Since a limited number of metrics of success were included (only 3), it is hard for me to argue whether the challenge setting is well defined for its focus areas or not. As a result, I can only give it a score of 3 for verifiability. (score given: 3)", "q2r": 3, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6721, "q0": "This is a very weak challenge. The first argument is that it only contains 100 words, so don’t expect a very long assessment either. In a nutshell (how else) the proposal wants to promote the adoption of Lace, the new light wallet built by IOG. I don’t see the adoption of a specific wallet as a strategic target for Cardano. It won’t help prepare a group of people willing and able to contribute to the ecosystem, since the wallet is already built, right. It won’t help adopt open standards since adoption of a wallet has nothing to do with this subject, either. To keep it simple there simply isn’t any alignment between this challenge and the Fund 9 strategic goals, so one star is sufficient. ", "q0r": 1, "q1": "Can the community deliver on this challenge? Or course it can, by definition to drive adoption of a wallet you have to be within the community and already interact with its products / wallets / ecosystem. Again, this is a rather weak challenge setting exercise and the very small budget shows this perfectly - the proposers themselves did not have enough trust in their writing abilities to ask for more. 50k is merely the first step above 25k, which would be the minimum requirement for a challenge. One star again.  ", "q1r": 1, "q2": "Can the community verify this challenge? Through numbers of downloads and dapps created “using” Lace. Using is such a poor choice for a word in that context - dapps are not built on wallets, wallets are simply interfaces for users to interact with the chain, no? And where would the competition be? Between whom? And on what? One star again, and there you go - I made it to almost 300 words. ", "q2r": 1, "assessor": "z_assessor_2824", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13892, "q0": "This proposal within the Fund 10 challenge setting aims to promote the mass adoption of the Lace wallet. Just to be clear, this is not a proposal looking for its particular impact - but a suggestion for an entire funding category, albeit a low budget of $50,000 ADA , for the next funding round. Initially I thought the proposal had been submitted in the wrong challenge, as it has possible impact, but as a challenge setting proposal we don’t investigate the impact, rather its alignment. There is hardly any detail provided by the proposers, under 100 words, barely sufficient to address the connections to the fund challenge setting strategic goals, but I’ll try.\n\nThe proposers phrase this challenge as to ‘promote’ Lace wallet, so it’s essentially a marketing campaign with a focus on live demonstrations. In terms of the strategic goals, the Lace wallet itself fulfills several of them, however, promoting it may only briefly tough on the first goal tentatively. Promoting Lace wallet, may inadvertently prepare more people who are willing and able to contribute to the Cardano ecosystem. This possible knock on effect has absolutely no guarantee.\n\nIn regards to the other three strategic goals, without detailed information in this proposal it’s unlikely that alignment can be found within this challenge, and thus without that support, the proposals it attracts are unlikely to contribute to the directions Cardano would like to progress. I need to be clear here, Lace wallet is an excellent idea and has a lot of potential success, but looking at this ‘promotion’ type challenge fund it does not clearly align to the challenge setting strategic goals. I rate this proposal 1 star for alignment. \n", "q0r": 1, "q1": "As an ever growing community, Cardano and Catalyst members will be able to contribute proposals that address this challenge, even if the documentation provided is seriously limited and lacks supporting details. In some ways the lack of detail allows for more proposals to enter, whether they are relevant, appropriate and quality is an entirely different matter. For an extreme example, I could write a proposal to stand outside a supermarket with a hand drawn sign that says ‘Get Lace wallet’ and this would fit within this challenge criteria. So, it is feasible that the proposing community can come up with creative solutions to promote Lace wallet, but how is it going to be feasible for the PAs, VPAs and voters to manage the onslaught of random proposals?\n\nOverall, it is possible the community has the capacity to address this challenge, however, I rate this proposal 2 stars as this possibility is seriously limited.\n", "q1r": 2, "q2": "The proposers provided very limited information throughout the entire proposal section, the measures of success are not exception to this. A one sentence overview describing success and three key metrics are provided. This is hardly enough information for the proposal to be addressed or for future proposers to have a clear understanding how they themselves can succeed.\n\nThe information provided in the proposal describes the ‘increase in Lace wallet downloads’ and ‘Dapps being produced using Lace Wallet’ as the two main success criteria. They write these in both the success section and the key metrics to measure. Additionally in the key metrics they list ‘lively community debate about new features to add.’ This lack of detail and support for future proposers needs to be rectified in order for this funding category to have any chance of success, even if it’s a good ‘idea’ there needs to be accountability in terms of the project's success. I rate this proposal 1 star for verifiability.\n", "q2r": 1, "assessor": "z_assessor_3840", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "importance": "Wallets are the entry points for most community members on any chain. Having a light wallet that is easy to use and develop for is key.", "success": "Success looks like an increase in Lace wallet downloads and Dapps being produced using Lace wallet as it's choice."}