{"id": 421545, "author": "nguyenhuyentran235", "title": "Grow Vietnam, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/421545-48088", "category": 26604, "amount": 150000, "description": "How can we make the Vietnamese community adopt Cardano and connect with the Catalyst community?", "f6_no_assessments": 7, "f6_rating": 4.809523809523809, "videos": [], "media": [], "f6_assessments": [{"id": 641, "q0": "This challenge setting has the goal of creating space to submit proposals that are executed by or will benefit Cardano’s Vietnamese community. It is stated in the challenge brief that since Fund 7, the number of Vietnamese proposals has increased significantly, and it’s also mentioned that blockchain in general has attracted the attention of this community, which is usually behind other countries in relation to technology in general and this could be a good opportunity to bring it to the center of discussions. There have been some already successful projects executed the Vietnamese teams and some communities formed around community projects such as Eastern Hemisphere Town Hall and Eastern Catalyst School. Also, some projects were mentioned in the challenge brief that are related to the Vietnamese community: the FIMI project, Catalyst2VN, VCoincheck, BWORKs, IRONSKY, BlockTree. Since this is an open-ended challenge, potentially all goals of Cardano’s mission for Fund 10 can be addressed there: preparing community members to contribute with the ecosystem, turn Cardano into an open-source project, attract developers, build real-world applications and improve Catalyst human processes. Although it’s not guaranteed that these goals will be met, it’s highly probable due to past contributions from the Vietnamese community. I believe the alignment of this challenge proposal with Cardano’s mission is high.", "q0r": 4, "q1": "The budget requested for this proposal is 150k ADA, which is estimated to be around $75k when results are out. This budget is quite small when compared to other challenge’s budget. Considering that there is already an existing Vietnamese community in Catalyst, and that this challenge could bring even more people from this community into Catalyst, I believe it there are very high chances that the community would successfully use this challenge’s budget and only high-quality proposals would get funded. Also, I believe the budget is good for an experiment since it would be the first time that this challenge would be voted in, and the $75k estimated budget would be enough for an experiment with this community and see what results we would. In my opinion, it would be a good experiment for the community and worth the try. I believe the feasibility of this challenge proposal is very high.", "q1r": 5, "q2": "The KPIs included in the challenge proposal are good, but I believe only had of them are measurable. For example, the number of new Catalyst members from Vietnam could be tracked, but it would be an underestimation since it’s not possible to track them all, and the same for PAs, since PAs are anonymous by default. Quality of proposals is also something that’s subjective to be evaluated since it was not specified what quality is in this context. Adding some KPIs related to Cardano’s mission would benefit this proposal’s verifiability. For example, some KPIs related to open-source projects funded, new developers onboarded, real-world solutions built and tools improving Catalyst’s human processes. These could be adapted to cover Vietnamese focused initiatives but are an excellent guide to measure the challenge’s success according to Cardano’s mission for Fund 10.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 2, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 2851, "q0": "I support this proposal, as the team stated in this presentation about the rapid growth of the Cardano ecosystem in Vietnam, and the country Vietnam has contributed a lot to our ecosystem. . significant human resources and in many positions within the Cardano platform. e.g. talented developers, PA and vPA communities, Haskell language programmers, SPO owners there are still a lot of unsaid positions, but they all contribute a lot. Innovative ideas for our ecosystem. I think this idea needs to be facilitated more, in this funding round, it is possible to create a playing field for the community in this area, to realize their full potential, and under conditions that The concept offers and the development element is strong, so this idea will be up to the challenge.", "q0r": 5, "q1": "The questions that the proposal poses to serve as the basis for development ideas are reasonable, and the personality both develops and learns, creating the mentality of the community to constantly rise, in many fields of the industry. blockchain technology, a statement that explains the budget of the proposed team giving the total and limit for development ideas, is perfectly reasonable since the goal of this proposal is to focus on projects small community and educational, and the right approach, introduction and awareness of the community about the Blockchain technology platform and especially the Cardano platform.", "q1r": 5, "q2": "The document that the proposal provides about the metrics to make this idea a basis for the development of the following funding rounds is reasonable, I do not add anything more because it is more than enough to see the impact of an abundant human resource, waiting for the wings of Catalyst to open to them, in addition, there are also many links of completed and active projects of living and working proponents. In Vietnam, the success of this proposal is very clearly defined, but if the number of commitments to be submitted in F10 can be given, it will definitely be better. In addition, the success criteria can be accurately measured to achieve the success of this proposal. across the presented group documents qualified for maximum transparency.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 7801, "q0": "This is a Challenge that aims to develop the Cardano community in Vietnam. Despite being a middle-income country with many language barriers, the Vietnamese community is relatively responsive to Blockchain. Many big projects that have resonated in the Cardano community come from Vietnam like Minswap. They have also been relatively active in Cardano and Catalyst. We also see more and more Vietnamese people joining Catalyst with the roles of proposer, PA/VPA, challenge team. Many Vietnamese projects have also been funded and well implemented by Catalyst. Therefore, it will be appropriate for the Vietnamese community to have its own challenge in the upcoming Fund 10. I believe that funding for a separate Challenge in Vietnam will contribute to the development of this community and bring many benefits to Cardano and Catalyst.", "q0r": 5, "q1": "According to my research, in Fund 7 Vietnam, there are 10/19 funding proposals, and fund 8 has 21/46 funding proposals. These numbers are an affirmation of the contribution and capacity of the Vietnamese community to Catalyst. Therefore, the implementation of this challenge is completely possible. Moreover, the Vietnamese community also has a lot of high-quality and experienced personnel in the roles of Challenge team, proposers, PA/vPA in Catalyst, thus increasing the feasibility for the implementation of this proposal. The amount that the team proposes is only 150,000 ADA or about 70,000 USD at the time of writing this review, which is not too much for the Catalyst fund. I believe funding for this Challenge will be highly effective.", "q1r": 5, "q2": "The proposal has set relatively specific goals for the proposals of this Challenge such as education and training, community hub, Awareness campaigns. The sets of criteria to evaluate the quality of proposals are also stated quite clearly such as: Number of proposals , Number of new Vietnamese community hubs, Number of Vietnamese PAs/vPAs. In my opinion, this set of criteria is relatively clear and appropriate to evaluate and measure the development in solving the Challenge.", "q2r": 5, "assessor": "z_assessor_2922", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9794, "q0": "As with many other Geographical Challenges, all of the Geographical Challenges in major developing countries regions of the world are of primary importance to the mass adoption and diffusion of Cardano.Vietnam has special characteristics that, in my opinion, are very attractive for Cardano to develop. Although it is a small country, a large percentage of the population has good IT skills and is extremely interested in the opportunities and development of Cardano. Now that the success of Game Exie infinity has inspired a lot of developers and companies in Vietnam to get involved in different blockchain platforms bothe Gamefi projects and other areas products, attracting them is good for Cardano.", "q0r": 5, "q1": "Following back to previous funds, I saw the appearance of many ideas to develop the community as well as products in Vietnam. At Fund 9, there were also 56 proposals from Vietnam in many different fields. There are groups such as Fimi Vietnam or Tre Viet that have joined Cardano for a long time and created a certain resonance. So I believe that this challenge can be completely successful because the current groups will surely come up with many ideas and many proposals for the Fund later. The problem here is that most of the proposals come from the South of Vietnam and need more events, and workshops to spread the project to many other places, and for the image of Cardano to be more widely spread throughout Vietnam. In addition, challenge proponents can also show background to make proposals of the challenge more convinced and pay attention to organizing a team of experienced experts to act as advisors for projects in Vietnam that will participate in the Challenge.", "q1r": 4, "q2": "As with other geographic challenges, the proposal focuses on key metrics of how many proposals are presented and how many Dapps/DAOs/Vietnam-focused services are launched. Especially the amount of educational content, is one of the reasonable figures, with a country like Vietnam needing this content for Cardano to be more widespread and reputable.", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10939, "q0": "We noticed that starting from fund7, the number of proposals from Vietnamese people increased rapidly, showing that the Vietnamese community is very interested in the Cardano ecosystem. In particular, many Vietnamese projects have been sponsored and appreciated. The resources and Vietnamese community are still extensive; therefore, by establishing the challenge setting Grow Vietnam, Grow Cardano  will help exploit, consolidate and develop this resource stronger, promoting the Cardano ecosystem's development. ", "q0r": 5, "q1": "Setting up the project is highly feasible because now Vietnamese people participate more in the Cardano ecosystem, and there is a need to develop and expand. Cardano Vietnam community is struggling with the non-native language, so Creating educational content about Cardano & Catalyst in Vietnamese is essential. That helps the Cardano Vietnamese community to access Cardano ecosystem knowledge more fully and accurately. The Cardano community has full knowledge of Blockchain technology that will help reduce fraudulent projects causing bad influence. When Cardano Vietnam groups or communities are established, it helps to attract a large number of participants, and the volume of proposals increases, contributing to the development of the Cardano ecosystem. I think encouraging more Vietnamese members living abroad to participate in the project will help set up the challenge with more new and attractive proposals. Setting up this project is connecting and developing Blockchain technology in Vietnam and Southeast Asia.", "q1r": 5, "q2": "The success criteria of the challenge setting are perfectly consistent, the indicators are definable, and the challenge is relevant. The total challenge setup budget is clearly divided for each project. The budget for the full challenge setup is lower than other setups, and I think the budget needs to increase to attract more extensive projects.", "q2r": 5, "assessor": "z_assessor_3208", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11126, "q0": "This challenge is for proposals related to the development of Cardano and Catalyst in Vietnam. Although I am a new PA starting from this fund 9, I have known Catalyst from previous funds, through Mr. Duc Tiger's Tiger's View team, and I must admit that Cardano and Catalyst's attraction is growing in popularity. with the Vietnamese community. It is not difficult to review the history of Vietnamese proposals in fund7 & fund8, as a result, fund 7 has 17 proposals submitted with 10 funded proposals (58%) and fund 8 has a total of 45 proposals submitted in which 22 proposals were funded (reaching nearly 50%). This shows the growing interest in Cardano from the local community and it makes sense to suggest a challenge specifically for Vietnam. This challenge does not address the goal of open source Cardano, nor is it likely to directly promote developers or the application ecosystem. However, it has a lot of value in other ways. The goal of this challenge is to bring Vietnamese people together and create groups together to develop the Cardano ecosystem. This challenge is a springboard for the Vietnamese community to contribute more proposals to fund 10 to develop Cardano and Catalyst in their own country both in quantity and quality.", "q0r": 5, "q1": "This challenge requires low funding: 150,000ADA and stipulates a maximum of 15000ADA per proposal. This means that at least 10 projects will receive funding. With a current population of over 98 million people and their history of contributions to Catalyst, I think they will make the most of this money and make a significant contribution to the community here. The proponent also made it clear that this challenge is for proposals to develop the Cardano community in Vietnam, so other proposals with a broad application would be suitable for other challenges. So I think the amount asked is perfectly reasonable. As far as I know, although in fund7 and fund8 the number of proposals from Vietnam is quite significant, most of those proposals come from familiar members such as Mr. Duc Tiger, Mr. Trong, Mr. Thang Nguyen, and Mr. Tienna. ...this means that if expand Cardano, we will create more conditions for people to know about our ecosystem, and more ideas to develop the Cardano community in Vietnam in particular and around the world gender in general. I think if this challenge is crowdfunded it will solve this challenge well.", "q1r": 5, "q2": "\"The proposal covers 6 KPIs, and they are all easily measurable and directly related to the challenge, which are powerful indicators to guide and track progress on this challenge:\n-Number of proposals originating from Vietnamese people participating in the Catalyst Project\n-The quality of those proposals as well as the impact on the Vietnamese community\n-Number of new Vietnamese community centers from Vietnam are formed.\n-Number of new Catalyst members from Vietnam\n-Number of protected areas / VPA of Vietnam\n-Create educational content about Cardano & Catalyst in Vietnamese\nBesides, the author also carefully provides guidelines and recommendations for the proponent to focus on, which will help the proposal writers know exactly what they need to do to be suitable. fit the challenge. This is very commendable. And as a Vietnamese, I think this proposal is needed and I hope this challenge will be funded.\"", "q2r": 5, "assessor": "z_assessor_3223", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12893, "q0": "The Catalyst community in Vietnam is flourishing, as shown by the rise in the number of proposals submitted to Fund 7, as well as the remarkable rise in the number of proposals submitted to Fund 8. Because of projects of a community development nature carried out by organizations such as FIMI or Catalyst2vn, the community has a real understanding of Blockchain and is learning more and more about the Cardano ecosystem. Therefore, the creation of a catalog is a challenge for technology enthusiasts who are looking for challenges and want to assert themselves in Vietnam. I believe that the Challenge is important and I believe that it is necessary in order to be able to solve the problem of the increasing number of members as well as the increasing number of people who are learning more and more each day. As a result, this helps the Cardano ecosystem to become increasingly diverse in terms of the products and ideas that it supports.", "q0r": 5, "q1": "The Catalyst community in Vietnam is capable of finding a solution to the problem presented by the challenge, as shown by the many projects that friends from Vietnam are working on, ranging from Product development and integration to Dapps and developer ecosystems. Other projects include East Asia development, Cardano development, and more. Every competition receives Vietnamese submissions, and the number of Vietnamese ideas put forward by the Fund is not insignificant (I don't really want to specify the exact number). I will not name the specific names of each project because doing so would generate more public interest in the projects (public relations). Since the maximum amount that can be requested for a proposal in the Fund 10 challenge is only 15,000 ADA and the funding request for the Fund 10 challenge is 150,000 ADA, there is enough money to fund at least 10 proposals, which is roughly the same as 10 projects. assistance in the event that the endeavor is successful. Therefore, it can help you start your business in Vietnam more effectively, thereby increasing the number of Vietnamese people who are familiar with Cardano and Catalyst. And as you pointed out, this is merely a stepping stone; this is the first time the challenge has been issued, which means that you will have to return to the next Challenge, which will ask for a greater amount of money.", "q1r": 5, "q2": "Indicators such as the quality and quantity of assessments, as well as the number of PAs and vPAs are increasing day by day through each fund, and the number of centers and projects that are being built and completed to be able to come into our real life every day is also gradually increasing. It is believed that the metrics that will be measured will be detailed and accurate in order to be able to show the community's progress in addressing the challenge. The fact that so many Vietnamese individuals sent in their ideas to Fund 10 is a clear indication of the competition's level of success. We have been successful, and we have indicators that allow us to measure our progress in addressing the challenge. After the completion of a successful challenge, it is clear that the number of Vietnamese people who are familiar with blockchain technology and who hold an increasing quantity of ADA will increase.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "importance": "From fund7, the number of Vietnamese proposals has increased significantly. This means that Cardano is strongly attracted to this community.", "success": "\nMany people from over Vietnam are connected and groups are formed then grow our ecosystem.\nA lot of ideas about Fund 10 have been submitted.\n"}