{"id": 421868, "author": "galsen19", "title": "Challenge & Scouted for Students🎓", "url": "https://cardano.ideascale.com/a/dtd/421868-48088", "category": 26604, "amount": 200000, "description": "How can we provide Student Entrepreneurs with a place to appeal their ideas to the world and an opportunity to connect with Engineers?", "f6_no_assessments": 7, "f6_rating": 3.1904761904761902, "videos": [], "media": [], "f6_assessments": [{"id": 176, "q0": "The purpose of this challenge setting is to give space to students on Catalyst. Developing a public blockchain like Cardano and a robust developer ecosystem requires many contributors/developers. There is an underexplored workforce in universities and colleges that could be used on Cardano.\n\nDue to the maximum budget of up to $5,000 USD and the concept of embryonic proposals, this challenge does not tend to result in ambitious and high-impact/critical solutions, on the other hand, forming an ecosystem with more students can be a promising way of onboarding a young and with great potential to expand the Cardano ecosystem contributors.\n\nThis challenge setting is in line with item 1 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 4, "q1": "This challenge was already present in this Fund 9 and had 35 proposals submitted, a relevant demand. The budget requested for the new challenge setting is proportional to the current one and relatively low compared to the other challenge settings.\n\nThis challenge has no technical challenges that limit the community's ability to contribute, the $5,000USD cap indicates that there would be at least 18 proposals considering the current market value of the ADA, but capping the maximum cap at $5,000 USD does not mean 20 different proposers/teams . A team could just fragment a high-budget proposal into several smaller ones. If the intention is to give chances to more students it may be more appropriate to limit the number of teams/proposers as well.\n\nThe fact that Cardano has a background in research is a relevant and positive factor as it brings the academic/student community more aligned with Cardano.", "q1r": 4, "q2": "\"...easier funding and scouted from engineers.\" doesn't say much about the outcome of this challenge. Just the fact that this challenge was approved and funded at the voting stage would already mean success? I don't think it's an appropriate definition and ambitious enough. Another point is that there is no time frame for successful verification. The definition of success needs to indicate the outcome of the proposals over time.\n\n4 key metrics were included, but I do not consider them appropriate to measure the success of this challenge.Number of proposals and applauses are relevant indicators of demand in the challenge and engagement, but they say little about the work and development of proposals an theirs contribution to the ecosystem.\n Number of collaborations is a relevant indicator. There are no key metrics to assess the quality of projects and proposals after funding and how they are delivering what is expected by the concept of this challenge. Would it also be important to provide a time frame for evaluating when key metrics and success will be measured? 6 months? 12 months? It is important to establish a time frame to make appropriate verification.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 643, "q0": "The goal of this challenge proposal is to create space for students to get into Catalyst without having to compete against big projects with experienced teams. The goal is for them to define small proposals, with maximum budget of $5k each, and the community would evaluate their performance and eventually they would receive job offers from other projects within the ecosystem. This is a very smart concept, and this challenge has already been voted in and is currently present in Fund 9, with a budget of $100k. This proposal is very well aligned with Cardano’s goals of preparing a group of people to contribute to the ecosystem, attract developers and indirectly build real-world solutions based on Cardano. I believe the alignment of this challenge with Cardano’s goals is very high.", "q0r": 5, "q1": "This challenge, as mentioned, has been voted in during Fund 8 and is now occurring in Fund 9. With a total budget of $100k, it would be able to fund 20 proposals, and there was a total of 49 proposals, and 36 of them made through the assess stage. This means that there are more students that submitted their proposals in this challenge than the goal, which was 20, what is a proof that there is enough interested in the community already present in Catalyst to make a good use of this challenge. Though, since this is still ongoing, it’s not yet possible to evaluate its success. But I would expect an increase in the number of applications in case this challenge gets voted in again, because students tend to share this kind of information with their friends, especially if they get to know about Catalyst’s referral system. The budget is expected to be very similar to the current budget of $100k, since the request was 200K ADA and the current exchange rate of ADA is $100k. Considering all these points, I believe this challenge proposal is very feasible.", "q1r": 5, "q2": "The KPIs included in this challenge proposal are good but only enough to evaluate the success of this challenge during the proposing stage, since it includes the number of proposals submitted, number of reactions in IdeaScale, proposals that collaborated with other engineers and that proposers that come back for next fund. It would be interesting to add KPIs related to the delivery of these proposals, for example, how many of these student were able to successfully executed the proposals they proposed to develop, how many offers they received from Catalyst or Cardano projects, how many got ‘hired’ by these projects and how many other students they were able to referrer to Catalyst and to this specific challenge. Overall, I believe the verifiability of this challenge proposal, based on what was included in the proposal only, is just ok.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 873, "q0": "It is likely that we have all heard of success business stories that were created among college classmates. This is the period in which we are able to experiment without any hesitation, and from that standpoint, I understand the intention of the team that prepared this proposal. However, there are also many other factors that must be considered in order for a project to be successful, aside from having a great idea and a passion to execute it. For a project to be successful, it is necessary to employ a wide range of skills. I believe, however, that since Project Catalyst's founding, it has not imposed any limitations on the people targeted by the challenge in regards to requesting budgets from any eligible individual. As well as the fact that if a student project is good enough, it will receive the visibility necessary to receive funding. Regarding the alignment with Cardano's mission, I find alignment in the sense that it would appeal in a special way to this sector of society and that, being mainly young people, they may find within the ecosystem edges that allow them to stay.", "q0r": 4, "q1": "A total of 62 proposals have been submitted seeking to be selected for funding under this challenge, which has been selected for the first time in this fund 9. With $100,000 in ADA, 62 proposals have sought to be selected for funding. Despite the fact that it is not possible to evaluate the quality of the proposals at this point, I consider that there are a sufficient number of proposals that demonstrate an adequate response from the community. In addition, the maximum amount of $5,000 per proposal is another intriguing feature of this challenge. It ensures the dissemination of funds to students, which is positive from one point of view, but it is quite challenging to manage an impact project with this budget, and so it could be considered an inefficient use of the Catalyst funds. Based on my previous arguments, I am unable to agree or disagree with the team regarding the feasibility of the next fund.  \n", "q1r": 3, "q2": "The description of success seems simple to me, but I consider it to be poorly focused. I believe that the assessment should consider both the impact on the target population and the ecosystem of exposing this population to the allocation of funds for their projects. Metrics are straightforward and easy to measure, but they only measure the performance of the challenge itself. These metrics should be complemented with metrics that serve as a guide for students in formulating proposals. No mention is made of the potential expected directions, which could lead to a wide divergence in the type of proposals submitted. In fact, there may be little to no relation between these proposals and Cardano (since it is not required in the challenge setting). ", "q2r": 3, "assessor": "z_assessor_2142", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1441, "q0": "The proposal would be a great idea and meet the challenge goal, and I think that proposal is urgently needed for the Cardano Community, because it allow important young resource and brain to scout new projects and new innovative solutions.\nHowever the objective of the proposal is real and urgent, and I think it's important to for the challenge and I suggest to define use cases to engage better student organizations for their time devoted to the Cardano initiatives.", "q0r": 5, "q1": "I think that it’s important to establish a new Category exclusively for students like in other blockchain community, so we need to explore new ways of incentivizing this kind of players to grow the Cardano ecosystem and financing young student ideas. \nIn my opinion Cardano Community is a great place to develop new brilliant ideas and this challenge surely involve many student organization, business schools, Venture Capitalis, Dex to propose new incentivize models and I hope that ADA holders have the possibilities to vote for the best proposal.", "q1r": 5, "q2": "Success criteria is simple to identify and trace with key metrics to measure (eg. Number of students benefits, …) .\nI think that the successes and metrics are easly verifiable through the catalyst initiatives and  will be created through funding.\nThe budget allocated for the challenge is right and correct aligned with the possibile proposals.", "q2r": 5, "assessor": "z_assessor_2245", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 1484, "q0": "This challenge setting identifies a clear need to support students as entrepreneurs and future engineers, but only marginally aligns with the strategic goals. A more refined proposal with stronger alignment and greater integration with Cardano could significantly increase the likelihood of receiving funding. Also, it appears as if there was no communication between the proposer and project assessors for this challenge. A rigorous back and forth exchange of ideas could help in the construction of a challenge setting that more closely fits the strategic goals of any given funding round. The stated intention of using Project Catalyst rather than traditional VC funding for traditional business start ups does not strike close to the targeted funding available on Cardano.", "q0r": 2, "q1": "A comprehensive review of the challenge proposal finds feasibility to be very unlikely. The challenge brief presented may have some honorable intentions, but it is very hard to see any logical basis for a successful implementation of any of the business ideas that this challenge seeks to fund. Statement such as “it is difficult to set a clear roadmap while resources are scarce” seem to imply that a more well thought out proposal was somehow predicated on prior funding which was not received. The mission of Project Catalyst is to fund proposals after they have conceived a detailed and well thought out project, not before. ", "q1r": 1, "q2": "The proposer of this challenge setting was unable to solicit valuable feedback and first joined Project Catalyst a few weeks ago according to his bio. In order to prevent roadmap ambiguity, the proposers limits each recipient to $5000 without clarifying what it will be used for. This does not seem to prevent ambiguity nor demonstrate verification processes that can be audited. Another curious statement speaks to the desire to “raise a large salary for engineers through Catalyst rather than” traditional lenders. This seems incongruous with a $5000 limit and raises some serious concerns about accountability of a 200,000 Ada budget.", "q2r": 1, "assessor": "z_assessor_2252", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6360, "q0": "This challenge is about providing students an opportunity to present their ideas to the Catalyst community and then recruited by the engineers in the domain. I think it is a good idea and can be funded to encourage future developers to join Cardano from the beginning. The author set the budget limit of $5,000 for each proposal which is good to provide the opportunity to more students. With this amount, students can present their ideas by building some proof of concept or pilot products.\n\nIn the current Fund, most of the proposals under this challenge are college outreach & educational proposals. It shows what the author intended for this challenge may not happen, and this challenge is becoming more of a 'college/students outreach' challenge.\n\nThis challenge could have helped onboarding future entrepreneurs and developers with the intended goal, but it is acting as a Cardano awareness and students onboarding challenge. This is also good but not what the author wants from the proposals under this challenge.\n\nI cannot agree or disagree with this challenge because it seems not to achieve what it intends. Still, it is adding value by onboarding students into the Cardano ecosystem. I would have rated more stars if the author could change the challenge and make it a 'college outreach/students onboarding' challenge.", "q0r": 3, "q1": "In the current Fund, this challenge receives thirty-six proposals. Most of them are outreach/onboarding proposals, but some are based on entrepreneurial ideas. Hence it seems the community can address this challenge, but it shows meager interest from students to present innovative ideas and pave the way to be recruited by engineers.\n\nThe author increased the budget from $100k to $200k. Two factors do not justify this increase. 1) The number of proposals submitted for the current Fund is thirty-six, and we can finance twenty proposals with the current budget cap. The current budget is sufficient for the total proposals submitted as it lets only the better proposals be selected. 2) As mentioned above, this challenge has become more of an outreach challenge. Hence this challenge does not seem to achieve what it intends. So, there is no need to increase the budget.\n\nTherefore I am afraid I have to disagree with this challenge on the above facts that the challenge is not achieving what it intends & there is an unnecessary increase in budget. Therefore, I suggest the author keep the same budget and change the challenge to an outreach challenge.", "q1r": 2, "q2": "The author stated four metrics:' the number of proposals under this category in this Fund & the next Fund,' 'the feedback from the community, and 'the number of proposals coordinated with other engineers.' All these metrics are helpful only to measure this challenge's success.\n\nNo metrics are stated in the challenge to track or audit the proposals' progress. As this challenge continues from Fund 9, the author could have seen the proposals submitted under this challenge and provided some metrics for the proposals. In addition, the author could have explored the possible types of proposals based on the idea.", "q2r": 3, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11717, "q0": "the challenge proposed is certainly aligned with cardano's mission and fund goals. Students are indeed a key audience to target and if cardano gets their attention at an early age, it is likelier that they will find a career in the ecosystem, and contribute to develop or bring value in any other way to cardano as a whole over the longer term. noting the risk of having inexperienced students to propose in this challenge, the team sets a proposal budget limit of $5,000, which is a fair amount for entry level ideas. for a total challenge budget of 200k, it would be able to fund 40 proposals, also a reasonable amount when compared to the average number of proposals per challenge as seen in fund 9 currently (excluding outliers like dapp,products, and integration) \n\ni am however concerned about the lack of focus for the student industry as a whole. i understand the intent behind this to shed light on these newcomers for fear that they get drowned out from other more experienced proposals. but i would expect a whole jumble of proposal of all sort of different nature to be in there, and with the lack of focus, i foresee difficulties to find relevant expertise to assess and follow up with the proposals flowing in. some may be more commercial in nature, some may be product development, all these requires expertise and experience to assess accurately.", "q0r": 2, "q1": "I think that the community has already demonstrated that they can incubate new ideas and guide new community members to deliver. the target audience of students especially, will be itching for a source of funding or any resource they can get to work on their idea. it will naturally attract proposals with the funding from catalyst, and with guidance from the community as a whole, i think the challenge will be very feasible. \n", "q1r": 3, "q2": "for the metrics proposed to be measured, I generally agree with the majority of it. Only one of which - Number of applause and comments from the community - I feel does not accurately reflect the success of the challenge. Not everyone uses the applause feature, and from the various proposals i have seen, not many comments were made as well for a majority of the assessments. basing this as a measure will lead to an inaccurate gauge of the community participation in this challenge. \n", "q2r": 2, "assessor": "z_assessor_3270", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "Most student entrepreneurs are suffering from resource shortages, especially in funding and engineer recruitment.", "success": "By setting up a student category and increasing the exposure of their ideas, they can expect easier funding and scouted from engineers."}