{"id": 422204, "author": "headelf", "title": "Miscellaneous Challenge", "url": "https://cardano.ideascale.com/a/dtd/422204-48088", "category": 26604, "amount": 500000, "description": "How does Cardano & the Catalyst Community create a space for ideas, projects and outlier concepts that do not fit into any of the other current Challenges or is there a round hole for a square peg?", "f6_no_assessments": 16, "f6_rating": 4.479166666666666, "videos": [], "media": [], "f6_assessments": [{"id": 116, "q0": "Cardano itself is blockchain that is based on an idea that was an outlier concept in the blockchain universe – imagine, research and build the future – meticulously and slowly. Effectively, upending the current state-of-play is the essence of Cardano’s mission. The entire story of Cardano is a story of rejecting the status quo and conventional wisdom. The Cardano team chose a functional programming language, the team chose to build only after peer-reviewed research, the team continues to release new developments only after exhaustive and extensive testing. Cardano is the Miscellaneous blockchain among blockchains. Hence, this idea that a Challenge should be organized by the Catalyst Community to “create a space for ideas, projects and outlier concepts that do not fit into any of the other current Challenges” – could not be more aligned with the Cardano mission and ethos. Maybe there could some more stress on the importance of innovativeness as part of this challenge. The Fund 9 goals can/are all addressed through this challenge. ", "q0r": 5, "q1": "As feasibility goes, we have already had a Miscellaneous Challenge before and I remember reading through the proposals and feeling impressed by the broad range of non-standard and unusual and interesting proposals. The Cardano and Catalyst communities are among the most diverse – not only geographically  - but also in terms of interests, philosophies and backgrounds. The challenge is completely feasible and it is well focused with a clear challenge brief that seeks real-world solutions, to stress the importance of the open-source nature of Cardano, to support decentralization and motivate people to build and expand Cardano. The budget of ADA500,000 seems realistic as it will allow for a mishmash of smaller and bigger proposals. May the best ideas win!", "q1r": 5, "q2": "The team behind this challenge setting submission put forward a short list of metrics. One of them is clearly to ensure that the proposals that are submitted should be clearly out-of-scope for all the other competing challenges – so that the competition in this challenge should be fair. I feel that the team behind this Challenge Setting proposal could have thought through in more detail some other possible metrics that could be used. Metrics are not limitations per se, if defined in sufficiently general terms. In case the proposal is not accepted this round, I would advise the team to add some additional metrics – such as “number of innovative projects unique to Cardano as a result of this challenge” or “number of non-blockchain experts who were attracted to use the Cardano platform” or “number of innovative uses of Cardano or its ecosystem as a result of this challenge”. ", "q2r": 3, "assessor": "z_assessor_2047", "no_vca": 26, "ne": 6, "ng": 18, "nfo": 2, "vca_o": 1}, {"id": 177, "q0": "One of the weaknesses in Catalyst's thematic challenges model is that in many cases promising ideas/proposals don't have space. As a CA since Fund2 and mentor to some proposers during this period I have noticed that some proposers prefer to submit proposals that are outside the scope of a challenge just because there is no appropriate challenge or because the competition in a given challenge is low.\n\nThe purpose of this challenge is to minimize this problem by creating an open scope challenge that accepts proposals from the most varied categories, this gives space to promising ideas that would not have space without an open challenge.\n\nConsidering that the Miscellaneous challenge goals reflect the Catalyst Fund9 Challenge Setting Strategic Goals this challenge is of great importance to Cardano.", "q0r": 5, "q1": "The Miscellaneous challenge has already been present in past Catalyst Funds (F7 and F8). In Fund 8 was the challenge with the most competition among all challenges,  considering the ratio of funds requested/total budget (the ratio was 7.3x), which indicates a great demand from the Cardano community in this challenge.\n\nThe fact that this challenge is open in scope makes the challenge more likely to be feasible to address in terms of demand.", "q1r": 5, "q2": "Unfortunately, the definition of success for this challenge was not well articulated. \"Funding great ideas that focus on problems that are not covered by any other Challenge.\"\n\nThe problem with this definition is that all the proposals present in this challenge in theory could not fit into other challenges and linking the success of this challenge to the fact that the proposals are funded does not measure success, only the fact that resources from the treasury were allocated.\n\nDefining key metrics in an open scope challenge is difficult because the variety of proposals and metrics that could assess the outcome and improvements for Cardano are theoretically infinite.\n\nOnly two key metrics have been established:\n\n\n\"Successfully fund proposals, approved by the community, that don't fit well any other challenges.\"\n\"Number of identified possible Challenges to be proposed in the following Funds based on proposals submitted in the Miscellaneous Challenge.\"\n\nThe metric keys above are not appropriate for identifying outcome, as they do not say much about how to assess success.\n\nSuccessfully fund proposals mean what? Would any proposal that is funded translate into success in this challenge? The distribution of funds by itself does not mean anything in relation to the outcome, only that the community voted more for them.\n\nDespite the difficulty in defining key metrics, it is important for the proposer to establish them. Even if they are broad key metrics like:\n\n-Score of the proposals funded in this challenge against the score of the proposals funded in other challenges.\n-Number of developers embarked through this challenge\n-Number of open source projects\n-Number of proposals related to Catalyst\n-Number of tools, SDKs and documentation created\n-Community satisfaction surveys to identify the success of proposals funded in this challenge\n\nThe key metrics above are based on the fact that this challenge has used the Catalyst Fund9 Challenge Setting Strategic Goals as a reference for proposals in this challenge.\n\nI apologize if I sounded harsh on my assessment, but the idea is that this challenge needs to improve in verifiability and I consider it an important challenge for Catalyst.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 14, "ne": 4, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 417, "q0": "This is a reoccurring challenge since the 7th funding round. It is meant to enable great ideas to be funded, even if the proposal doesn’t fit in any of the objective driven challenges, at the current funding round.\nThis challenge has proven to be a necessary part of the ecosystem, with over 200 proposals submitted since fund7.\n\nIn the Cardano ecosystem, the growth and the development on the edges is very important. A miscellaneous challenge does create a space for outliers and great new concepts to be supported. The challenge brief states that the main objective for new proposals to follow, is to adhere to the 4 fund9 strategic goals.\nI can agree that this challenge has all the necessary information to be successful in creating value to the community and the Cardano ecosystem.", "q0r": 5, "q1": "The funding budget for the miscellaneous challenge set to 500k ADA. As the challenge in fund8 had budget of 500k USD in ADA, now I question if the budget set for too low, or high. It would be very informative, if the challenge team members did present the data about fund8 budget. How well did it cover all the approved proposals?\n\nWith the statement that any proposal is welcome, which can demonstrate to bring value in one or more of the four strategic goals, I can acknowledge that Cardano community has the capacity to address this challenge.\n\nTo have the fullest certainty for this challenge, and to be able to better grasp the budget dedicated, I suggest to the challenge team members to add progress analysis data from past funding rounds.", "q1r": 4, "q2": "The key metrics to measure are the same one from the fund8 round. The two metrics look into successfully funded proposals that are approved by the community. And as the secondary measure to identify possible new challenges, to be created in future funds, based on successful projects under the miscellaneous challenge.\n\nThe above-mentioned metrics are good to recognize the progress made under this challenge, but I must advise the challenge members, if applicable, to look for adding additional measures. Since fund7, there should be some traction, or impulse, for updating the standards of this challenge.\n\nFor the proposals, as mentioned before, the approach to metrics is set by the 4 fund9 strategic goals.\n", "q2r": 4, "assessor": "z_assessor_2081", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 467, "q0": "A very interesting Challenge Setting that lost it's place last fund. I do feel that this Challenge Setting plays a role on onboarding newcomers. For I would say this is a playful Challenge Setting with loose metrics, making it an ideal breeding ground for experimental innovation. It helps to shatter this stigma that Catalyst is for techies or nerds even. But being broad and unspecific perhaps played a role in it being booted out for at this current stage, there is a unanimous understanding that we need more developers. Ideas are plentiful but impactful ideas that require technical support are very limited. Hence, this fun challenge I felt -although is needed- at this current moment in not crucial to further move the adoption rate of Cardano. There are other specific Challenge Settings with specific criteria's that helps create a more focused and effective proposals outcome.", "q0r": 3, "q1": "As this is an encompassing Challenge Setting with soft/loose metrics it could be that we either do or do not have the resources to either judge the effectiveness or understand the problem and solution of proposals that will be submitted.\n\nFor it could be a topic that we as a community totally have no understanding for as this Challenge Setting has mentioned, it seeks to find solutions for problems we as the Cardano community have not identified.", "q1r": 4, "q2": "It is quite clear actually what this Challenge Setting seeks to achieve, which is finding problems and solutions that we collectively have not identified. Though the follow-up metrics intended to achieve are somewhat not inline with their Success Criteria. For example ; to improve tooling for governance, to build real world solutions and etc.  If indeed they are guiding principles of the potential proposals to be submitted than they overlap with specific Challenge Settings, such as Products and Integration. Which are more refined and focused, which then negates the intent of this Challenge Setting of finding that out of place proposal and perhaps is one of the reason that contributed in this proposal not being voted on.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"id": 644, "q0": "The miscellaneous challenge has been created a few funds ago and has been present since them, except for Fund 9. It accommodates all the other proposals that doesn’t fit in any other challenge, and it a way to make sure that all proposals, no matter what’s their scope, can be submitted in a specific fund. Historically, this has been a very successful challenge and funded some out of the box ideas. Since the scope of this challenge is completely open, and basically the only requirement for proposals is that they are somehow connected to Cardano, all proposals have the potential to address Cardano’s goals for Fund 10, although this is not guaranteed. Overall, the alignment of this challenge with Cardano’s mission is good.", "q0r": 4, "q1": "This is a very specific proposal and since basically any proposals could be submitted here, I’m very confident that the community would be able to come up with high quality proposal to use all this challenge’s budget of 500k ADA, which is going to be maximum $500k. Checking this challenge’s history as well, it is possible to see that the proposals that there were more approved proposals than what were funded by the treasury. The last time this challenge was included was in fund 8, already with the budget of $500k and it was already a success. Now in fund 10 the community has grown and therefore the risk of not having enough submission is even lower than before. Based on all this, I believe the feasibility of this challenge is very high. The challenge team hasn’t been set yet, but I don’t see this as a big issue for this proposal specifically.", "q1r": 5, "q2": "The verifiability of this proposal, based on the KPIs provided, is just ok in my opinion. There should be some KPIs related to what’s developed by the proposals submitted there, but at the same time I believe it’s very difficult to do that for a challenge that’s so open like this one. Maybe some general KPIs like dApps created, people onboarded, proposals successfully executed and other similar, that are broad enough to cover most of the proposals submitted in this challenge. The verification of this challenge’s success should be done carefully and consider all its nuances. But I believe it’s success can be verified be the challenge team and the community.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 1488, "q0": "Miscellaneous challenge settings are a necessity for innovation and unique applications. Similar challenges have historical precedence and create the space for valuable projects that do not align withing limiting challenge structures. Alignment with the strategic goals of this funding round is assured provided that quality proposals are submitted. This has occurred repeatedly in the past. Omitting this category could lead to stunting the growth of the ecosystem.", "q0r": 5, "q1": "As long as there continue to be a plethora of solid projects proposed on Catalyst, the feasibility of a miscellaneous challenge is extreme. All one has to do to verify this is research successful projects from similar challenges that were funded in past rounds. Creativity can be stifled by narrowly applied definitions, which makes the miscellaneous option not just feasible, but necessary.", "q1r": 5, "q2": "Although the list of measurable indicators of success is very short, it is sufficient to audit the efficacy of this challenge. Simply put, if successful projects emanate from this challenge and it would be difficult for them to align with the other challenge settings, the experiment was a success. Sometimes less is more and simplicity offers the best solution.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 1807, "q0": "A Miscellaneous challenge has demonstrated it utility in passed Funds, by offering a way to leave absolutely no idea aside. It is important for Cardano’s app ecosystem to fund every good ideas (maybe not critical because good ideas will always eventually come out), or at least to offer a space where ideas can be presented and improved before to become actual proposals. \n\nAs it is widely open, this challenge contributes to Fund 10 strategic goals \"prepare a groupe of people willing and able to make contributions to the ecosystem\" and also \"attract more developers\". For this reason I strongly agree that this challenge is critical to achieve Cardano's mission.", "q0r": 5, "q1": "The budget proposed for Fund 10 is identical to F8 and F9, i.e. 500k USD. Numerous proposals have been made in previous miscellaneous challenge, so there is  no doubt that the community is able to make creative proposals in this challenge.", "q1r": 5, "q2": "Verifiability of this challenge is not obvious: as the goal is intentionally wide, it is not easy to define measures that tracks correctly the progress of the challenge. But, as stated  in the brief, this challenge achieves his goal if proposals are funded that would not have fit into other challenges. And another success is if it leads to a new specific challenge proposal for the following funds !", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"id": 3063, "q0": "Miscellaneous Challenge, a challenge that attracts a lot of attention in the community with mixed opinions.\nMany people are in favor of it, but there are also many who are against it. However, as a funded proposer in this proposal, I realize that this challenge is very much needed for the community. This can be considered as the best challenge for new proposals, start-up proposals that do not have enough reputation to compete in high-competition challenges.\nIn many funds before this challenge is always one of the challenges with the most submitted proposals and the most diverse. Maintaining this challenge will open up new opportunities for new proposers, increase Cardano's popularity, and possibly lay the groundwork for new challenges to be created in the future.", "q0r": 5, "q1": "The feasibility of this proposal has been demonstrated in previous funds with the number of proposals proposed and funded. Accompanying that is the richness in the topics of the proposal.\nThrough many proposals that may be suitable for other challenges but are unlikely to be competitive due to being new, the new proposer will also assess the practical necessity of all the challenges in a fund. The challenge's required budget amount is 500000 which is a reasonable amount that could fund between 10-20 new proposals", "q1r": 5, "q2": "To verify the challenge there are 2 key metrics listed Successfully fund proposals, approved by the community, that don't fit well any other challenges.\n1- the decrease in the number of funding proposals that have been returned by the fund to submit proposals at the challenge (this number should be reduced to leave room for new proposals)\n2- the number of new proposers participating in submitting the proposal.\nNumber of identifiable possible Challenges to be proposed in the following Funds based on proposals submitted in the Miscellaneous Challenge. No different from previous funds, these metrics live up to the name of the proposal. However, to further improve the quality and success of the challenge, I have some additional suggestions for new key metrics for the challenge team to consider:", "q2r": 4, "assessor": "z_assessor_2394", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3366, "q0": "Based on the information provided in the challenge setting proposal, I believe that this challenge has the potential to address all four strategic goals for Cardano. The main reason why I say “has the potential to” is due to the fact that this is a miscellaneous challenge that can encompass any proposal that did not fit into any other challenge setting. As a result, any proposal could technically fit into this challenge setting. \n\nHaving an open category addresses the first strategic goal (prepare a group of people who are able to contribute to the Cardano ecosystem) because it gives people a place to put their unique ideas. This challenge setting essentially encourages people to put whatever fun or interesting ideas they have to help grow the Cardano ecosystem. \n\nThe challenge setting can address the second strategic goal (build an open-source ecosystem and attract developers) through its open nature. A developer might have an idea for the Cardano blockchain that doesn’t fall under any other challenge setting. As a result, there would still be a place for them in this setting because it is open to all other ideas. The proposers did not make any explicit mention of saying people must make their software projects open-source, but the proposers did say that people must address at least one of the strategic goals, which includes the open-source aspect. \n\nThe challenge setting addresses the third strategic goal (build real-world solutions on the Cardano blockchain) by allowing for new and novel solutions. Maybe someone has an idea to solve a real problem they see in their community, but they need a place to put it. Now, with the miscellaneous challenge, there would be a place. Receiving funding from a source like this challenge setting could kickstart a whole new branch of the Cardano ecosystem just from a single proposal idea. There are endless possibilities for how proposals in this challenge could solve real-world problems.\n\nThe challenge can address the fourth strategic goal (improve tooling to support human processes in Catalyst) if there are proposals that are Catalyst focused. If, by some unfortunate chance, there is no challenge setting that encompasses proposals for Catalyst tool improvements, then it would be necessary to have this challenge setting, so those proposals could receive funding. I could think of a few areas where this might be helpful, such as PA improvements or vPA improvements. Since all four strategic goals were addressed, I can give this proposal a score of 5 for alignment. (score given: 5)\n", "q0r": 5, "q1": "Based on my knowledge of Cardano and past Catalyst funds, I believe that the Cardano community has the capacity to address this challenge. In fund 7, there were 119 proposals in the miscellaneous challenge. In fund 8, there were 141 projects in the miscellaneous challenge. These are huge numbers of proposals, so there is clearly enough demand for the challenge setting amongst the community since the numbers increased from fund 7 to fund 8. There is never a shortage of interesting ideas, so this challenge setting is the perfect way to give some of those ideas a home. Additionally, since there is no miscellaneous challenge setting for fund 9, there are likely to be even more proposals that need funding in fund 10. \n\nThe budget of 500,000 ADA seems very reasonable given that it is an open category. In the past, the miscellaneous challenge had a budget of 500,000, and I don’t see why that needs to change. 500,000 ADA is enough funding to support a good number of smaller proposals, while not taking away from the other more specific challenge categories. I had no complaints about this challenge setting proposal from a feasibility standpoint, so I can give it a rating of 5. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided in the proposal, I think that the metrics are slightly defined. There really isn’t a focus area since it is a miscellaneous category. However, there are a couple interesting metrics to note: the number of successfully funded proposals that don’t fit in any other category and number of successfully defined challenge setting areas for future funds based on the proposals submitted in the miscellaneous category. I think that these metrics are important because they help track the success of the challenge setting overall. However, the proposers could have added some other potential suggested metrics of success, taking inspiration from other challenge settings. For example, the number of users and the number of countries involved are both metrics that could apply to a lot of different miscellaneous proposals. Including some examples, such as these, could provide future proposers with some more guidance. General examples of potential metrics of success are a good idea to include because they make it clear what is expected at the very minimum. I understand that there are a lot of different metrics that could apply to this challenge setting, but just a few ideas would have been helpful. Also, more metrics would need to have been included in order for me to conclude that they could drive healthy competition between future proposals. Two metrics of success that aren’t about the future proposals themselves isn’t quite enough. Since the challenge setting is lacking a couple of other examples of metrics of success, I can only give this proposal a rating of 4 for verifiability. (score given: 4)\n", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5082, "q0": "Yes, this challenge is absolutely “critical to achieve Cardano's mission and [the] four Strategic goals specific to Fund9” (quoted from the PA-Guide) – since it contains the four strategic goals as the challenge brief, it serves as a kinda safety net to catch all the proposals that do not fit into other challenges. To me personally, the Miscellaneous challenge is a must-have, because it takes much pressure off of proposer’s shoulder, and opens for literally anyone. The only critique I have would be that the challenge brief could have been written more invitingly and welcoming. It seems to be written very formal and serious, and as referred to in “Verifiability”, very repetitive.", "q0r": 5, "q1": "Yes, the Cardano community totally “has the capacity to address this challenge” (quoted from the PA-Guide), because the challenge is set up as totally feasible. The funding budget fits very well – it is not too much, but also not nothing.", "q1r": 5, "q2": "The weak point of this challenge setting is, that it really only mentions the fact that the there-to-be-submitted-proposals “don't fit well any other challenges” (as quoted from the proposal). I would have loved something like: “It can happen, that in Project Catalyst, challenges do not span much of a spectrum – this challenge is here to catch all the great proposals that deserve a chance to get funded despite that.” Or: “It can happen, that the Process of Project Catalyst produces a constellation of challenges, that are too focused on specific areas and don’t address other important ones. No system is perfect, and Catalyst is a hell of an experiment. Hence, to provide a miscellaneous challenge for proposers to consider as the last resort, helps greatly in minimizing unforeseen deficits in the chosen challenge settings.” Or something. /// (new paragraph) The challenge doesn’t really have focus area(s), so I don’t really know whether “[t]he challenge is well scoped in defining what the measures of success will be for its focus area(s)” (as quoted from the PA-Gudie); and the success metrics are firstly: proposals funded that do not fit into other challenges, and secondly: that it provides some inspiration for further challenges. As the miscellaneous challenge does not much more than that, those are well-defined. Furtherly, they are also “included to drive healthy competition between the potential proposals” (ibid). Again, this challenge is super helpful, especially for new proposers – because it does not require them to study through all the challenges until they find a somewhat fitting one, when they didn’t even fully arrive yet.", "q2r": 4, "assessor": "z_assessor_2670", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 6364, "q0": "Looking at the selected challenges for Fund 9, it is clear that various proposals do not fit with the chosen challenges. For example, Governance proposals for improvement in Catalyst or documentation for Catalyst, Research proposals, some outreach proposals that do not align with area-based outreach challenges, etc. Hence this challenge is essential to include all those proposals that will not align but add value to Cardano and have a positive impact. \n\nFrom the strategic goals view, this challenge will bring a group of people who otherwise missed out due to other exclusive challenges. It may also contribute to the developer & DApp ecosystem depending on the type of proposals, such as developers onboarded due to Catalyst improvement proposals. Also, future 'proposals' utilize the research carried out by proposals under this challenge. We can expect some 'proposals' to be open-source such as research or documentation proposals. \n\nIn the past funds, this challenge's proposals garnered sufficient votes appropriate to the challenge amount and the volume of the 'proposals.' Moreover, as this challenge is all-inclusive of 'proposals' that do not fit in other selected challenges, it contributes and is an impetus for Cardano adoption. Thus it is vital for Cardano's mission. ", "q0r": 5, "q1": "This challenge had good performance in Fund 7 & Fund 8. In Fund 7, seventeen proposals were funded out of a total of sixty-eight. In Fund 8, this challenge got eighty-eight 'proposals' and funded twenty-four proposals. As can be seen, the participation is growing and proving the community can address this challenge and submit positive impact proposals that do not fit in with other challenges. \n\nThe challenge's budget of $500,000 continues to be the same as in past Funds. Therefore, it is reasonable and sufficient to fund deserving proposals like in Fund 7 & 8. As this is a continuing challenge from Fund 7 & Fund 8, there is a challenge team who can collaborate and assist the proposers and do the necessary tasks. ", "q1r": 5, "q2": "The author mentioned a few metrics, such as the number of funded proposals and the number of identified possible challenges for future funds, both of which can be used to measure a challenge's success. \n\nThere is room for improvement; the author could have mentioned some other metrics which could have helped the proposers and auditors to measure the progress and success of the proposals funded under this challenge. I know it is difficult to ascertain the metrics as the proposals here can differ. But as the Catalyst community selected this challenge for Fund 7 & Fund 8, the author could have checked the type of proposals submitted and what can be the metrics for that kinds of proposals. Then those metrics can be listed in this challenge as examples.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9900, "q0": "The problem statement for the Miscellaneous Challenge states that the Catalyst Community needs a space for ideas/proposals that do not fall into any of the other challenges. This is apparent when looking at various proposals where the author has attempted to force their idea into an existing category. The problem with this approach is if the proposal does not directly relate to the Challenge it will be difficult for the proposal to be funded. As stated, “a Miscellaneous Challenge will enable outlier concepts & great ideas to be proposed & funded even if they do not fit another Challenge”, which is how this proposal will add value to the Cardano Community. The metrics provided will easily allow the success of this proposal to be measured by looking at the number of proposals presented.", "q0r": 5, "q1": "The feasibility of this project has been proven in previous Funds. The skills needed to accomplish this will be found from the user community when ideas are added to the Miscellaneous Challenge. The resources needed for this are well defined in the budget request which will be distributed to the winners of the challenge. In previous Funds this Challenge was successful and created a Fund for proposals that did not fit into other Challenges. It worked great in the past and therefor should work moving forward.", "q1r": 5, "q2": "The success of this proposal will be easily verified by the number of ideas that are submitted in the next round of Funding. The milestones and roadmap are well defined and will follow the pattern of previous Funds. The problem was clearly defined, and the proposals submitted will show the value of adding this Challenge to Future Funds. The public will easily be able to monitor this by following the ideas being submitted in Ideascale.", "q2r": 5, "assessor": "z_assessor_3130", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10943, "q0": "Setting up the Miscellaneous Challenge will bring many new ideas beyond the challenges set. This challenge is for a groundbreaking yet highly valuable proposition for the Cardano community. Through the challenge, we will see many concepts and ideas about the problem we have not thought of. All suggestions are welcome if they meet Catalyst's goals and bring value to the Cardano community. I found this Challenge Setup a good fit for the Cardano quest.", "q0r": 5, "q1": "The Miscellaneous Challenge setup has been done very well in previous Funds. I believe that the Catalyst community can completely solve the challenges posed. In addition to the suggestions in the pre-division Challenge Setups, this challenge will bring many great ideas and great value in the future. The Catalyst community is always interested in new, cool and creative things. I believe this challenge will bring many unexpected and valuable proposals. It is essential that the proposals provide real value to Cardano and that it meets the goals of the challenge. The challenge has four goals as a guideline, and the proposals must stick to the plans.", "q1r": 5, "q2": "The challenge's success criteria and metrics are clearly stated, specifically through the number of sponsored proposals and community acceptance. I think the challenge is attracting more and more people, so it is necessary to supplement the budget to encourage new ideas, from which the Cardano community will reap many creative ideas; the exception concept is not suitable for anyone. Whatever the challenge, it opens a new turning point for Catalyst.", "q2r": 5, "assessor": "z_assessor_3208", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11482, "q0": "With the widespread application of Blockchain technology today, many developers have a plethora of new ideas to develop. However, it is not suitable for the challenge, which results in the failure to submit ideas in order to have capital to maintain operations, develop ideas, and recruit personnel.This challenge provides an opportunity for the Catalyst fund to fund a variety of ideas, and it is perfectly aligned with the Fun 9 goal.\nHowever, I thinks this challenge does not focus on resolving a major community issue. As a result, developer ideas are less impactful than ideas focused on solving a specific large problem.\nThis reduces the efficiency of the budget spread. So I give 4 points in this section.", "q0r": 4, "q1": "This challenge provides an excellent opportunity for developers to be more daring in voicing and developing ideas.\nHowever, in this challenge, limiting the budget per proposal is a priority to ensure equal competition among other proposals. Because this proposal may not be important to the community, funding is limited. To make it possible and more equitable without being dominated by large groups. I believe there should be more parenthetical conditions, such as not being able to vote for proposals with less than three points, as there will be a large number of proposals submitted in this category and a better idea is required, or exclude proposals submitted in other challenges as many teams will want to increase their chances of being funded and will submit an idea in two challenges, leads to higher competition for ideas.\nFor the reasons stated above, I give this section 3 points.", "q1r": 3, "q2": "If this challenge is accepted, I believe a large number of developers will submit challenge ideas. As a result, I need a better method or tool for selecting good proposals that will make it more competitive with other challenges. As I mentioned above, multiple teams will submit ideas for two categories, making this challenge less competitive than the others challenge.\nThis challenge is entirely consistent with the stated strategic objectives. However, the scope of impact is too broad, resulting in ideas that do not focus on solving a specific problem, and the ability to compete with other challenges is low due to a lack of some screening conditions. For the reasons stated above, I give this section 3 points.", "q2r": 3, "assessor": "z_assessor_3250", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 13039, "q0": "It is possible or even likely that a proposer has created or wants to create a project that is relevant to solving a \"problem\" in the Cardano ecosystem or furthering our common goals in some aspect that does not fit well into a described challenge setting. Without the Miscellaneous challenge setting we run the risk of losing this insight to the constrained scoring criteria of Proposal Assessors.\n\nRadical inclusivity is of paramount importance in Catalyst, you never know in what form or from where paradigm shifting insight might come. This iteration of the miscellaneous challenge setting has included strategic goals that are a common theme in past and present funds and is therefore highly aligned with what drives the Catalyst/Cardano ecosystem forward.", "q0r": 5, "q1": "Because miscellaneous has been proposed as a challenge setting since fund 6 we can easily examine it's feasibility. Fund 7 had 68 proposals submitted to the category while Fund 9 had 88 showing a 29% increase in submitted proposals. There was also only one challenge setting (DApps and Integrations) that had more submitted proposals which by it's self might indicate a need for the miscellaneous challenge setting. The budget that has been asked to fund this category has remained at 4% of the total funds available for the challenge setting categories, since it's original iteration. It should be noted that as a fund 9 challenge setting it was approved but not funded which might be more of an indication of funding competition than budget.\n\nI was particularly pleased to see the inclusion of some guidance for proposers (fund 9 strategic goals) in the challenge brief but it might also be helpful to have included in this section, that proposals aligning with other challenges should be in those challenges. I would however call this an improvement to the proposal overall and see no reason to deduct any stars.\n\nThere is another challenge setting proposal \"Nurturing Ideas and Teams\" that is similar to this proposal and a future merging of the two might help provide clearer guidance for Miscellaneous challenge setting proposers.", "q1r": 5, "q2": "We can see from looking at previous Funds that Miscellaneous as a challenge setting had high competition for funding for the proposals submitted (as I said before only DApps and Integrations had more submissions in fund 8). We can also see that there were 17 voter approved and funded proposals in fund 7 and 24 voter approved and funded proposals in fund 8 that did not fit well into another funding category. This seems to indicate the need for the Miscellaneous challenge setting as well as providing a history to gage performance and success.", "q2r": 5, "assessor": "z_assessor_3545", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13895, "q0": "This proposal of a ‘Miscellaneous Challenge’ has been funded in previous rounds of Catalyst. I would not argue that this challenge is ‘critical’ to Cardano’s mission or whether it strictly adheres to the fund challenge setting strategic goals, however there is potential. As the proposers state, sometimes challenge categories can be so specific that it’s like fitting a ‘round hole for a square peg.’ Hence the idea for a catch all, everything else, be creative as you can challenge. In the challenge brief, they’ve copied the challenge setting goals directly, and stated that any proposal is welcome as long as it can demonstrate that it addresses at least one of these goals.\n\nThere is however no definite value in regards to Cardano’s mission that can be guaranteed from this challenge. There may indeed be amazing small proposals that add high value and impact, or there could be many interesting ideas that are very loosely supporting the strategic goals. With an overall budget of 500,000 ADA, this significant budget may be siphoned away into many random directions without clear alignment to the goals. Overall, I rate this proposal 4 stars for alignment.\n", "q0r": 4, "q1": "In terms of feasibility, a challenge that is open and all encompassing leads to an extensive range of possible proposals. The proposers state within the description that any proposal is welcome, with some caveats that they must be somehow related to the one or more of the challenges setting strategic goals. As an ever growing community, Cardano and Catalyst members are definitely able to contribute proposals within this extended scope.\n\nHistorically, in Fund 8, we saw the successful miscellaneous challenge fund, with a similar design brief and instructions to this proposal. With a budget of $500,000, in Fund 8, over 140 ideas were submitted. Sure, some were way off task, but the sheer number competing for this limited amount meant that some truly ingenious proposals got their first chance at funding success. As an educator for many years, sometimes students develop their best work outside classroom settings, through experiential learning, field trips or just day to day life. Connecting to this, some teams and proposals just don’t fit within the normal funding challenges, yet have a lot to show and offer the community.\n\nI think the Catalyst community can easily rise to this miscellaneous challenge to provide many proposals within this proposed funding category. I rate it 5 stars for feasibility.\n", "q1r": 5, "q2": "Due to the nearly totally open-ended nature of this challenge it is harder to set criteria and measure against them, but not impossible. The proposers list only two key metrics they plan to monitor, from reading other proposals, particularly those from the PACE group, a more detailed plan of the success criteria would be appreciated within this proposal.\n\nThe initial criteria for success listed is the number of approved by community fund proposals - that wouldn’t have fitted in the other challenges. Here, the team will have to make a value judgment, as to whether the proposal is truly ‘miscellaneous’ or whether there was a more accurate challenge fund and the team possibly choose the easier, quicker, budget unlimited option to place it in the miscellaneous fund. So then, if it’s a successful proposal, but placed in the wrong challenge, do they plan to mark this as a failure?\n\nSecondly, the proposers state that the miscellaneous challenge might attract a collection of similar proposals that in turn lead to the creation of possible challenges for the following Fund. This would be easier to track, but time consuming to analyze and process this information. A simple example I could think of, perhaps there are a group of people all proposing creating different types of books to educate a range of audiences about Cardano, think audio books for the commuters, kids graphic novels to introduce the next generation, to even Cardano infiltrated romances. These ‘book’ type proposals all get approved, and are hypothetically all successful, so in the next round someone proposes a ‘Books about Cardano’ challenge. I can see this happening, if the challenge setting team are willing to go through and follow up with an in detailed look at their successful proposals and the progress. However, it seems like a lot of work for little direct reward for the team\n\nOverall, I see some measures to verify this challenge setting proposal, but not as much detail to see that it could ensure success and accurate monitoring. I rate this proposal 3 stars for verifiability. \n", "q2r": 3, "assessor": "z_assessor_3840", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}], "importance": "A Miscellaneous Challenge will enable outlier concepts & great ideas to be proposed & funded even if they don't fit another Challenge.", "success": "Funding great ideas that focus on problems that are not covered by any other Challenge."}