{"id": 422355, "author": "cardano4climate", "title": "Regeneration: Opportunity 4 Cardano", "url": "https://cardano.ideascale.com/a/dtd/422355-48088", "category": 26604, "amount": 250000, "description": "What regenerative solutions and use cases will seed and grow Cardano adoption in 2022 and beyond?", "f6_no_assessments": 10, "f6_rating": 4.7, "videos": [], "media": [], "f6_assessments": [{"id": 179, "q0": "This challenge is about how Cardano can help improve SDGs (sustainable development goals) and making the world work better for all, which is one of the ultimate goals of Cardano, as well as many public blockchains. This challenge is also aimed at open source and shared solutions, which is important in a public blockchain ecosystem.\n\nThis challenge aligns with items 2 and 3 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n\nThe challenge setting suggests in the challenge question that the solutions may already result in Cardano adoption in 2022, which is positive as it indicates a short-term impact on the Fund9 Challenge Setting Strategic Goals, which are also short-term goals.\n", "q0r": 5, "q1": "Considering the 17 SDGs and the history of the Cardano community, I agree that the community has the capacity to address the challenge, as several goals have already been used as a target in several projects on Cardano. Some examples:\n\nThe Cardano community has a group of SPOs called Mission Driven Pools (http://www.missiondrivenpools.org/) where different SPOs (stake pool operators) contribute in different ways to causes such as: environmental preservation causes, social causes, education, charity, among other causes that can be checked on the website.\n\nSeveral projects in the DeFi/RealFi niche have great potential to make financial services more accessible, which ends up contributing to the economic issue to mitigate poverty.\n\nSeveral projects related to models of carbon credits through NFTs.\n\nDozens of community education initiatives for onboarding new members to the community.\n\nIn addition, many projects developed in the blockchain industry end up having outcomes that go in the direction of SDGs indirectly.\n\nThe budget requested is relatively small compared to the other challenge settings and around 2% of the total available budget of Fund 10, which brings more certainty about the community's ability to fill this challenge with quality proposals.\n\nMy only caveat is that one of the budget definitions was not clear enough:\n\n\"...the collective total budget of proposals in this challenge are equal to or below the challenge budget.\"\n\nThe above definition is not understandable and should cause confusion. How to make the combined budget of all proposals within the available budget? Requires further explanation.\n\n", "q1r": 4, "q2": "The definition of success is relevant and appropriate to the context of this challenge setting.\n\nThe 4 key metrics are too subjective, but as the auxiliary success metrics will need to be aligned with the 17 SDGs and examples were mentioned for establishing KPIs, I believe that from this point of view the established metrics will allow a good assessment of the outcome of the challenge.\n\nIt was mentioned in the challenge question:\n\"What regenerative solutions and use cases will seed and grow Cardano adoption in 2022 and beyond?\"\n\nThe existence of 2022 as a reference doesnt add for measuring the outcome. We are already in 2022 and if this challenge settingbecame funded, it is not realistic to expect any tangible results this year as the funded proposals should only receive funding in 2023. It would be important to establish an appropriate timeframe to verify the success of the challenge.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 7, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 418, "q0": "This challenge stetting, dauntingly broad in scope, it reads as the UN mission statement or Cardano's mission statement, and the message is clear.\nBy bringing focus to the regenerative solutions; combining open source, transparent systems based on Cardano. This challenge offers a unique way to achieve Cardano's mission, making the world better for all. Following the 17 UN SDGs (United Nations Sustainable Development Goals), it is easy to create synergies and lead new projects towards these common goals.\n\nAll four fund9 strategic goals covered with this challenge. I am explicitly pointing to the challenge's clear statement, noting that all solutions within this challenge are open source. By hosting weekly meetings, the challenge team set to facilitate collaboration within this challenge.\n\nI strongly agree that this challenge can be a critical one to achieve Cardano's mission, and possibly, have an impact on global scale by creating real world SDG solutions.", "q0r": 5, "q1": "At the first glance, I would say the budget (250 000 ADA) chosen, is small for such an impactful challenge. And the challenge creator, described with reasonable rationale, this modest approach. The rationale states that, in order to showcase how limited resources, in a permissioned cooperative environment, can reach the goal of creating regenerative and sustainable solutions. I am looking forward, to see what under this challenge can really sprout out with this modest budget.\n\nThere is nothing else to add but to say that the challenge has everything that future proposers need, to identify and be successful under this challenge. From thorough explanation of the challenge goals, to types of proposals expected and good guiding questions.\nI can strongly agree that with a good structured challenge like this one, the Cardano community has the capacity to address this challenge.", "q1r": 5, "q2": "The key metrics are:\n- Tech & science based products, tools & solutions to increase accuracy & trust\n- People participating and engaging to increase collaboration & action\n- Boots on the ground use cases as templates to scale & increase real world impact\n- Systems, processes & integrations to create connections, increase efficiency and reduce redundancies\nAs for the future proposer's ability to present and track KPIs, there we are presented with a perfect example of good structured logic for the KPIs.\nEach project may design their own KPIs, with a specific formula. Actually, there are two options, formula for lagging KPI, and one formula for leading KPI.\nThe challenge is complete and well scoped in defining what measures of success will be for its focus, to bring world solutions with tangible climate action and UN SDGs impact.", "q2r": 5, "assessor": "z_assessor_2081", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 646, "q0": "The goal of this challenge proposal is to allow for regeneration-related proposals to receive funding through Catalyst and to help making the world more sustainable. The main theme is optimization of resources and collaboration over competition: solutions that are open-source and can be used by the whole community, developments that overlap between proposals and could allow saving and reallocating part of their budget and other ways to maximize the impact while minimizing the use of resources. This is even part of the rationale behind the budget: 250k ADA, which is quite limited, but the goal is to show that it is possible to have a great impact even with a short budget. Besides this, since the goal is also to address the United Nation’s Sustainable Development Goals, it is clear that this challenge will allow the funding for real-world solutions. At the same time, I believe it would be a great opportunity to onboard entrepreneurs that currently work with regenerative projects into Cardano. Therefore, I believe it is well aligned with Cardano’s mission for Fund 10.", "q0r": 5, "q1": "There are many different projects in Catalyst already working with sustainability, climate change and related topics. Also, the indication of which SDGs are being addresses by each proposal is something that has already been incorporated into the Catalyst process. At the same time, coming up with projects that somehow use Cardano to address the SDGs is not something so easy to do. From the technical perspective, I believe the community won’t have issues to execute the projects, it might be more challenge from the insights and ideas perspective. But since the budget for this challenge is quite small, only 250k ADA, especially in comparison with other challenges that have millions of ADA, I believe the community would be able to come up with enough projects so that really good quality projects get funded through this challenge. Also, this would be a very good opportunity to onboard members to the Catalyst and Cardano communities, for example, through the partnerships that exist between the projects that work with sustainability in Catalyst and other external projects that are currently not here. Overall, I believe the community will be able to make a success out of this challenge and I think there are big risks associated with this challenge being voted in for next fund.", "q1r": 5, "q2": "The proposing team has presented good and measurable KPIs to track the success of the challenge proposal. I believe most of the proposals submitted there will contribute to more than one of these KPIs, since they measure products by desired outcome - accuracy & trust, boots on the ground use cases, increase efficiency & reduce redundancies - and people participation. I believe it would be interesting also to track which SDGs are being tackled by these proposals, because this would provide a good insight about which of them are being currently addressed by our community and can benefit from blockchain applications. It would also help with the creation of specific initiatives in the future, maybe even specific challenges by SDGs, that could focus on solving issues in a specific area related to regenerations, for example, fighting hunger and increasing education. Also, the challenge team of this challenge proposal, if voted in, is probably going to be made of members of the Cardano4Climate group, and I believe they will provide all the information necessary for the community to track the success of this challenge. I believe the verifiability of this challenge is very high.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 3, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 988, "q0": "A challenge setting of utmost importance to survival of humankind on planet earth. The goals of the challenge tie into the Agenda 2030 SDG of the UN. \nNot necessarily cooperating with the UN or agreeing with their agenda, simply leveraging the research that went into formulating a common taxonomy for becoming sustainable globally. Very smart and also much aligned with Cardano's mission to make the world a better place by banking the unbanked and building a sustainable, holistic economy.\n\n\"Resources are shared over duplication whenever possible: focus of the challenge team is to facilitate collaboration and consent over competition for limited resources. \"\n\n(!) Regenerative finance (\"ReFi\") is only mentioned indirectly. It might be helpful especially in the next iteration to include the term and connect with the sustainable and open minded ReFi community.", "q0r": 5, "q1": "Since this challenge setting is proposed by Cardano4Climate, it's highly likely the capacity to facilitate is available. They are an active and constantly growing community in Catalyst for over a year now.\n\n(+) Clear and concise mission of the challenge team makes sense and is often missing in other challenge settings.\n\n(+) Weekly Challenge team meetings for proposers (also before end of submission) make a lot of sense in this highly collaborative and open source context.  \n\n(+) The budget is too modest for the importance of and the impact the Regenerative initiative can have. Achieving one of the (sub) SDG with a 250k budget would be a commendable effort.\nIf the challenge setting is successful the budget should be increased drastically in the next iteration.", "q1r": 5, "q2": "(-) The Challenge settings key metrics should be a little bit more measurable, specific and time bound; especially when reiterating the setting with a larger budget.\n\n(+) Success metrics for proposals are clearly defined and even present a formula for creating custom leading and lagging KPIs.\n\n(+) Guiding questions to analyse the impact of the challenge are well articulated. Additionally they can be connected to and easily answered through the KPIs of the individual projects within the challenge setting.", "q2r": 4, "assessor": "z_assessor_2170", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1491, "q0": "Alignment with the goals of the challenge is achieved, and the proposal is extremely well intentioned, but some of the scope of the project exceeds the boundaries of blockchain solutions. Every metric of success in extremely valuable and the challenge setting has significant potential. The only facet of the problem identified that cannot be solved through blockchain are the elements that require a political rather than a technological solution. Blockchain can certainly be used to improve upon legacy systems but it can not for example, “take urgent action to combat climate change” nor can it sustainably manage forests in the absence of the political will necessary to change laws and exploitative behavior. Despite this minor shortcoming, this is a challenge well worth supporting.", "q0r": 4, "q1": "Is it feasible that this challenge could foster the implementation of projects that will significantly address the issues of regenerative culture and climate change? Absolutely! The rigorous KPI regimen and the requirement that proposers with in this challenge setting attend weekly meetings demonstrate a strong commitment to collaborative success. This commitment increases the likelihood of successful integration of all projects that receive funding from this challenge. Due to the enormity of the problems identified herein, it would not be reasonable to expect a dramatic impact on each and every one of the 17 metrics provided. Nonetheless, they are all admirable goals and any positive change attributable to projects funded by this challenge should be considered a major victory.", "q1r": 4, "q2": "The non-quantifiable aspect of the KPI regime makes it more difficult to audit successful and verifiable metrics. This is not to say that successful achievements can not be audited, but certain metrics could prove very difficult to track. For example, it would be difficult at best to Achieve Gender Equality and Empower all Women and Girls, and this metric would be exceedingly difficult to make a direct correlation between a blockchain project and a cause and effect relationship. In this case, a political solution seems likely to have a far greater impact. Despite the inherent limitations of blockchain to impose political solutions, this challenge is still well worth supporting.", "q2r": 4, "assessor": "z_assessor_2252", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 1810, "q0": "This challenge setting proposal from Cardano4Climate is about \"Regenerative\" solutions contributing to Cardano adoption. The challenge brief includes a full definition  of \"Regeneration\" that includes for example \"response to the urgency of climate crisis\" and \"work that links us to eachother wellbeing\".  When applied to this challenge, if focuses on proposal with an identified positive effect on UN SDGs, collaboration, regeneration use cases. All solutions in this challenge have to bee open-source and collaborative.\nThis challenge is critical to Cardano's mission (which includes \"change the world\"), and is aligned with at least two of Fund10 challenge setting strategic goals : \"Turn Cardano into an open source project & attract more developers.\" and \"Build real-world solutions based on the Cardano blockchain.\" ", "q0r": 5, "q1": "The community has already proven its ability to make open source projects and projects driven by SDGs. An evaluation of the contribution to SDGs is included in many proposal that are build with the proposer tool build by AIM. \nThe budget of 250kUSD seems to me a bit low compared to other challenges (as stated in the challenge brief), proposals may be limited by this but this is not a reason for removing a star to the feasibility score.\nA challenge team is identified, from the C4C community, that will steward proposers.", "q1r": 5, "q2": "The scope of the challenge is well defined. I appreciate the \"Guiding questions\" section, that will help Proposers Proposal Assessores and Voters to identify if the proposal meets the challenge criteria and assess how impactful it is.\nThe proposal success metrics list based on 17 UN SDGs, together with example of derived proposal KPIS can be used by proposers to build precise definition of success for their proposals.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 6369, "q0": "This challenge wants to support regenerative, open-source, transparent solutions to achieve Sustainability Development Goals. This is important as the world is in danger, and we are running short on achieving sustainability goals; the provision of funding can bring things on track. Due to its low power usage, Cardano is already famous as a green blockchain. We can build upon that fame, and if this challenge can contribute to the sustainability goals, it will show Cardano's commitment to society.\n\nThis challenge will help with at least two of the strategic goals. First, it will bring in capable entrepreneurs and impact companies who want to contribute to the Cardano ecosystem and ultimately towards sustainable goals. Secondly, as described by the author, all proposals under this challenge must be open source. I think it is essential as it will help to boost cooperation & collaboration and make the developed solutions available to others to increase the impact. \n\nAs mentioned above, this idea of Cardano contributing to achieving Sustainability goals will solidify our commitment in society's eyes and pave the way for Cardano adoption. Given the above points, this challenge is essential for Cardano's mission.", "q0r": 5, "q1": "I have seen many proposals in the past funding rounds and current fund attempting to address sustainability goals. For example, the proposals like 'Environment Oracle,' 'Protecting Wildlife & Maasai,' 'Open Ledger for Agricultural Land,' 'Landano: Cardano Land Registry DApp,' etc. This shows that the community is capable of addressing this challenge. \n\nThe requested budget of $250,000 is very modest because, as stated by the author, 'the goal is to take a limited resource, and showcase how, through cooperation and consent, we can create regenerative and sustainable solutions to make the world work better for all people, animals & the planet.' This is a very inspiring way to approach problem-solving and will be a role model for future challenges and proposals if this can succeed. \n\nRegarding the challenge team, it looks like the Cardano4Climate group members will be part of the challenge team. The author provided the Challenge team telegram and discord link at the end. ", "q1r": 5, "q2": "The author stated various metrics to help in measuring the proposals' and challenge's success.\nApart from this, some more suggestions are mentioned, which the proposers can use to design their KPIs based on their target problem. Furthermore, the author provided the guiding questions which will assist the proposers in selecting the proposal subject and also help the PAs assess the proposals. \n \nI suggest the author also include the metrics to measure the progress of the proposals while under execution. For example, if the proposals are developmental, the metrics can be the number of GitHub commits or milestones achievements. Anyhow, I am rating it five stars as the author does provide the potential 'types of proposals' which can be considered to ascertain the metrics.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6733, "q0": "This proposal is meant to be an experiment within an experiment, a sort of proof of concept for future challenges, and this is all due to the very modest budget requested. Its focus is to bring regenerative, open source and transparent solutions / use cases onto Cardano. What is regenerative, you may ask? Regenerative, in this context, is any solution that is life-centric, applies to all life, brings / creates wellbeing, or answers urgent societal needs like climate or poverty. Focusing on Cardano, regenerative solutions can be interpreted as more collaboration and less competition and a strong focus on product integrations and sustainable development goals. \n\nCan this challenge prepare a group of people willing and able to make contributions to the Cardano ecosystem? The biggest challenge will be, in my view, to make all stakeholders and proposers “think Cardano” and speak the community’s language. I already see a few projects in Fund 9 that would fit in this challenge, with the overarching unanswered questions being, for all of them: \n \n- Where is the tokenomics discussion?\n- great idea, but how is the blockchain involved in it?\n- you can’t do “that” on blockchain, that’s not how things work..\n\nAnd so on and so forth. So yes, the challenge can definitely help prepare a group of people willing to make contributions. The “able” part will be much more difficult to achieve though. \n\nCan this challenge turn Cardano into an open source project? Absolutely, it’s a one of the challenge’s features of collaboration not competition and focus on open source projects. So definitely yes. \n\nCan this challenge attract more developers? Unlikely, but it can shift existing developer resources to regeneration projects, for what it’s worth.\n\nCan this challenge build real-world solutions based on Cardano? Yes it can, with the significant caveat of the “able” part detailed above - it will be very difficult to have a critical mass of realistic solutions being proposed. \n \nIn conclusion, this challenge would be a great experiment within the experiment, but with some question marks on how the target audience / future proposers will fit within the existing Cardano community. Four stars. ", "q0r": 4, "q1": "Can the Cardano community address this challenge? Yes it can, and this challenge will definitely be a honeypot for projects and proposers who are rather the exception in Catalyst: climate / forestry / subsistence agriculture focused NGOs, sustainability initiatives, social impact projects and many similar others. Their wide spectrum of core competencies will range from well established partners that bring concrete added value to anything they get involved in, to more “flower power / hippie” projects with less concrete value propositions. This challenge might also turn into an overflow for small scale open source projects. \n\nIs the budget realistic? Given its very modest amount and the fact that it’s designed as an experiment, I say definitely yes, it’s small enough to be considered as one, and not large enough to be unfeasible.\n\nWith a good capacity to be addressed by the community and a small but realistic budget - five definite stars again. ", "q1r": 5, "q2": "Is the challenge well defined, and do we know the measures of success? \nIn more than one way, yes! This challenge performs a beautiful implementation of performance indicators. First, proposals need to have a tangible and verifiable impact on at least one of the 17 US sustainable development goals. Second, we are also provided with the right tools and formulas to measure this impact, through either lagging or leading indicators. It will not be easy to implement at least a formula for each proposal, but at least we have a good start, and this is definitely more than any other challenge setting in this fund has achieved - trying to come up with an encompassing framework for measuring real impact. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12858, "q0": "This proposal encourages to build of regenerative, open-source solutions based on Cardano blockchain to achieve the SDGs targets, especially in Climate Change target. Cardano’s mission is “Making the World Work Better for All”. Achieving SDGs targets is one of the ways to realize its mission. For this reason, this proposal is aligned with the missions of Cardano blockchain. \nThere have been many open source projects so far, but very few focus on regenerative solutions. I think this is a special point of this proposal. This proposal directly is aligned with the strategic goals “Building real-world solutions based on the Cardano blockchain” and “Turn Cardano into an open-source project & attract more developers”. It also meets indirectly with the goal of “Preparing a group of people willing and able to make contributions to the ecosystem”. Thus, I vote 5 stars for the Alignment of this proposal.\n", "q0r": 5, "q1": "I believe that the Cardano community can have enough tools to track and audit this Challenge. Although this is a one-person proposal, the proposer is cardano4climate, an experienced one. The author successfully has 6 projects funded in Fund 8, and 2 projects in Fund 7. Almost funded projects are climate change-related solutions such as Cardano4Climate Community Events, Cardano4Climate Community Hub, etc. With such a background, the Cardano community can put trust in the author. Not specially mentioned in the document, but I believe the author will join the challenge team to be able to contribute and guide this Challenge.\nClimate change is a global problem and may need a huge amount of budget to solve. The requested budget is 250,000, which is modest. I recommend that in the next Funds, the author should consider doubling or tripling the budget to be able to encourage more and more projects.", "q1r": 5, "q2": "The authors proposed 4 key metrics for this Challenge, which are very appropriate. \nEach project in this Challenge should define its KPIs as tangible, verifiable, and based on pre-defined instructions (either Lagging KPI or Leading KPI, or both). These projects need to target 17 UN SDGs.  This challenge also limits the types of proposals that it will accept such as Technology, Processes & Systems, etc. From my viewpoint, these indicators are all appropriate. And I do love the details of these metrics explanation. It shows that the proposers know exactly what to do for this Challenge. I vote 5 stars for this part. \n", "q2r": 5, "assessor": "z_assessor_3494", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 13437, "q0": "This is a prime example of what sets Cardano apart from other BlockChain/Crypto Projects.  Tackling real life issues to its core! There’s no denying that Crypto in general is viewed just as a financial speculative play by your average joe. Having projects deployed and funded by a decentralized system specifically for betterment of healthcare is beyond anything our industry has seen. This is a proof itself that Cardano is beyond profit and financial gains. This will validate our mission to improve life in general for everyone. \n\nMedicine and Health System is one difficult technology to navigate around, especially with anonymity and privacy as one of its core principles. I couldn’t agree more that we need people working on this, not only on the tech part but also when it comes to the legal aspects of each system. This would be a good platform to unite people with different backgrounds to work together. Making decentralized and open system options would bring back power to patients globally. \n", "q0r": 5, "q1": "With the global reach of Cardano we can tap into abundant resource of talents for both medicine and engineering. What I like most about this is that guide and formula for KPI is established, this helps proposers express their ideas better in a concrete manner. \n\nMany of the listed GOALS are grandeur in scale and general in way that identifying what cause the changes comes with its own difficulty. But I would agree that we shouldn’t sell short as when it comes to Health one should never be satisfied. Proposers can come up with local and/or target goals based on this Goals.  Guiding Questions are detailed enough to help create a path for proposers. \n\nPersonally, I would have wanted a bigger fund for this, why? Well, we all have our own stories and struggles during the recent pandemic. We lost special people and love ones. While Cardano Community cannot put the whole Healthcare System in our shoulders, we need to increase our stake and participation as this affects us in a huge undeniable way. \n", "q1r": 4, "q2": "Suggested KPI Formulation does increase the chance of having proposers work on their metrics and performance indicators carefully, does increasing quality of auditability and verifiability. This challenge does show what to measure using the 17 UN SDGs, though these needs to be refined into numbers. Specially in terms of correlating Goals vs Funded Projects. For an example, we need concrete numbers, methods and substantial proof that these projects did indeed help decrease poverty and hunger. I’ll leave it to the proposers and Challenge team to come up with varying methods and for myself I’ll take part in proving feedbacks for incoming proposals. ", "q2r": 4, "assessor": "z_assessor_3644", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "importance": "Legacy systems have failed us. We need regenerative, open source, transparent systems based on Cardano to renew hope & health to all.", "success": "Individuals collaborating on processes, integrated products & real world solutions with tangible climate action and UN SDGs impact"}