{"id": 423239, "author": "kriss.baird", "title": "CARDANO FOR SCALA SUPERSTARS", "url": "https://cardano.ideascale.com/a/dtd/423239-48088", "category": 26604, "amount": 1000000, "description": "How can we reduce the knowledge gaps between engineering communities such as Scala and Haskell and drive new developer communities towards exploring blockchain research and development?", "f6_no_assessments": 9, "f6_rating": 4.407407407407407, "videos": [], "media": [], "f6_assessments": [{"id": 187, "q0": "Cardano has as one of its missions to expand support for other programming languages, as can be seen in the focus given to the integration with IELE/KEVM (something that unfortunately seems to have been delayed or canceled) months ago.\n\nThis challenge can be a good opportunity to expand the community of Cardano developers through a community of Scala developers, which due to the similarity in the programming languages ​​would be easier to convert, therefore it would be a \"low hanging fruit\".\n\nDespite the importance of bringing in more developers from outside the Haskell/Plutus community, there is still a lot of work to improve the development ecosystem of the Cardano community itself, proof of this is that there is another challenge submitted by IOG itself to improve the development ecosystem in Plutus.\n\nhttps://cardano.ideascale.com/c/idea/423218\n\nThat said, I don't see that this challenge has the same level of priority in the Cardano mission at this point compared to the other challenges dedicated to the already existing developer ecosystem on Plutus, it would be a level below in terms of priority at this point, not so critical at this time.\n\nThis challenge is in line with items 1 and 2 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.\n", "q0r": 4, "q1": "Challenges dedicated to improving the developer ecosystem have been present in all Funds (since Fund2),  but so far we haven't had any challenges that have had Scala as an option for developing proposals, so there are no solid references to indicate that the Cardano community has already shown significant significance in this topic on Catalyst. There are some developers with Scala expertise in the Cardano community, but there is no solid indicator that this group is sufficient or interested in submitting proposals. In previous funds there were some proposals that offered some kind of support or integration with Scala but the number of proposals related to Scala submitted to IdeaScale is far from indicating a demand that supports the budget offer at $1M ADA.\n\nIt is true that this challenge also mentions Haskell and in that context there would be more guarantees that the community could create solutions for Haskell (due to greater similarity with Plutus and greater number of Haskkel developers in our community), but the challenge mentions Scala and not Haskell on the key metrics defined, so the understanding is that the focus is on Scala.\n\nIt would be interesting to carry out a survey in the community to verify the interest in this type of challenge beforehand, as this would give us data that would facilitate understanding the Cardano community's ability to create projects related to Scala on Catalyst.\n\n\nAnother important point is that there are 7 challenges dedicated to the developer ecosystem, 3 of which (\"Developer Ecosystem - The Evolution, \"OSDE: Open Source Developer Ecosystem\" and \"Developmet & Infrastructure\") have a broad theme and could embrace the theme that was proposed in this challenge.\n\nIt is important that voters understand that the combined budget of these 7 challenge settings is 9,925M ADA, which correspond to about 78% of the entire budget for Fund 10. I have linked links to the challenges listed below. https://cardano.ideascale.com/c/idea/422540 https://cardano.ideascale.com/c/idea/421335 https://cardano.ideascale.com/c/idea/423218 https://cardano.ideascale.com/c/idea/423220 https://cardano.ideascale.com/c/idea/423239 https://cardano.ideascale.com/c/idea/414308 https://cardano.ideascale.com/c/idea/423211 \n\nIt may be that none of the above challenges are funded or that they are all funded, this uncertainty makes it difficult to predict community demand on this challenge. It is difficult to assess the feasibility of this challenge in relation to the community's ability to meet the supply of funds, as if all challenges are funded, the supply of funds intended for this challenge tends to cause low competition compared to other challenges. Low competition tends to result in fewer quality proposals. Judging by Fund8's data, there were two challenges themed to improve the developer ecosystem, \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\". The total requested/available budget ratio was 3.1 and 2.8 respectively, indicating a below-average competition when compared to the other challenges. In Fund 8 the total budget was $16M USD, the budget for the \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\" challenges represented $1M USD(6.25% of the Fund) and $1.2M USD(7.5% of the Fund) respectively . The combined budget available for the development ecosystem at Fund8 was $2.2M USD (13.75% of the Fund). Therefore, challenges dedicated to the developer ecosystem had 13.75% of the total available budget and a competition for funds below average in Fund8, this is an indicator that the combined budget of all challenge settings dedicated to the developer ecosystem of Fund9 is well above of reasonable and balanced demand for Catalyst. Each challenge setting must be evaluated on its own merit, so I don't think it's fair to deduct points due to the excess of challenge settings dedicated to the developer ecosystem in this Fund, but it's important that voters pay attention to this, as it fund most of these challenges can cause a resource imbalance in Fund10, causing other important areas to run out of resources. It is also important that the challenge setting proposers try to collaborate with each other and check the possibility of merging in similar challenge settings or if they do not believe that the best way is to merge, at least try to coordinate the budget definition together in order to make the distribution of more balanced funds. \n\nNote: Due to the similarity between the challenges and the situation I mentioned above, my assessments should present a relatively high degree of similarity, and I will make adjustments in the necessary points.", "q1r": 3, "q2": "The definition of success together with the various constructive points mentioned in the section \"What does success look like?\" make it clear what the outcome is to be explored by proposers. Key metrics relevant to the context of the challenge were proposed, but key metrics associated with a period of time were not established, which makes the outcome assessment more subjective. I would recommend including a time window for evaluating the success of the challenge.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 5, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 426, "q0": "this challenge setting directly meets the criteria for alignment by outright seeking to fund projects that will make the onboarding of new developers easier and faster. these new developers would be inherently part of the open-source nature of Cardano as they are brought in and learn Haskel for Cardano-related projects. these new developers would then go on to create even more wonderful products on Cardano in an exponential feedback loop of success in all of the assessment criteria. \n\nlastly, this proposal is written by IOHK themselves and as a result, is well developed to meet all the alignment demands any PA could ask for.", "q0r": 5, "q1": "like other IOHK challenge proposals, this one has a very reasonable 1 million ADA budget. this gives plenty of budget for a number of well-funded and likely-to-succeed proposals while not asking so much that the breadth of fund challenges is impacted as it was in Fund 9. (two nearly identical challenge settings locked up 70% of the total budget for fund 9.) this well thought out and reasonably budgeted challenge setting has all the marks for a very feasible setting for a great many successful projects to work from.", "q1r": 5, "q2": "The verifiability for this challenge is very high. by seeking to simply create onramps for Haskel and Scalia the eligibility for any proposals would be dead simple to audit. these metrics are well detailed in the proposal and would provide a floor for the quality of proposals that would ensure a great deal of success from this challenge.", "q2r": 5, "assessor": "z_assessor_2082", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 653, "q0": "This challenge proposal’s goal is very clear and direct: to onboard Scala experienced developers into the Cardano ecosystem. Scala is a programming language that focuses on scalability and bas be used for both object-oriented and functional programming, the latter being conceptually equal of Haskell. Currently, is it well known that there’s scarcity of developers for Plutus and Cardano in general, even some projects have left Cardano for other blockchains because they couldn’t find experience Plutus developers to work with - Plutus being Cardano’s programming language, which is based on Haskell. This challenge proposers to solve the scarcity issue by onboard developers that already have a similar way of thinking in relation to problem solving, and this would be the Scala community, since they have the functional programming mindset, and this language could be used to create Plutus smart contracts as mentioned in the challenge brief. This challenge proposal is well aligned with Cardano’s mission goals of preparing a group of people to contribute to the ecosystem and attracting more developers. The alignment of this challenge is, therefore, very high, and it is addressing a real issue that will be fundamental for Cardano to achieve its long-term goals as well.", "q0r": 5, "q1": "The budget requested for this challenge is 1M ADA. This amount will probably end up being close to $500k by the time the results are out. To create proposals to be submitted in this challenge, it would be almost a requirement that proposers have enough technical background to create content to attract, train and mentor Scala developers that are interested in joining Cardano community, but it would also be possible to have proposals related to marketing, advertisement, and awareness, that don’t necessarily require such technical background. For the marketing side, I believe the community has enough people to come up with impactful proposal to onboard Scala developers. For the technical side, I also believe the community has enough people that potentially could onboard and guide Scala developers to the Cardano tech community, but I am not sure it many people would be interested in doing so, since most of these developers are currently very busy working on their own solutions and building their own dApps. The compensation for such a service would have to be higher than the average, I’d say, to attract their attention to this challenge. But since the budget is considerable, it might be possible to have proposals that would accommodate this and thus enough developers interested in onboarding the Cardano community. Overall, I believe the feasibility of this challenge is good.", "q1r": 4, "q2": "The proposing team suggested 4 KPIs to measure the success of this challenge proposal: measure the number of developers reached out through this challenge, new projects on GitHub made in Scala for Cardano, downloads of repos or tools created in Scala for other Scala developers that are related to Cardano and community-building activities focusing on onboarding Scala developers. I believe these are very good metrics to measure the success of this challenge and they cover all its main outcomes. I would also add the metrics of people from Scala communities enrolling in courses like Plutus and Prism pioneers and joining community projects such as Gimbalabs and Catalyst School. But in general, I believe the metrics already presented are very good to measure the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 1497, "q0": "Targeted advertising is a far more efficient vehicle for reaching a specific audience. This challenge setting uses similar practices to reach a targeted community of skilled developers to be onboarded to the Cardano ecosystem. This approach masterfully aligns the challenge setting with all four of the strategic goals identified in fund 9. Mass adoption of Cardano and it’s ancillary applications is dependent on an ever growing community of senior developers with advanced language skills. IOG has the vision to proactively address challenges and allocate funds to areas of critical need. Funding for this challenge is seemingly imperative.", "q0r": 5, "q1": "The strong successes of the Pioneer Programs (Plutus and Atala), demonstrate the institutional commitment made by IOG to give individuals the skills needed to drive innovation and become efficient operators of Cardano blockchain emerging technologies. The new wrinkle here is the targeted recruitment of highly skilled developers from other platforms and languages. This is necessary to facilitate rapid growth and the most efficient use of human resources. This essential challenge is highly feasible due to strong institutional and community support. The groundbreaking technological advancements happening on the Cardano blockchain and the preponderance of truly brilliant people in the community will provide fertile recruiting grounds.", "q1r": 5, "q2": "Transparently measurable KPIs indicate verification of progress can be audited with relative ease. Github submissions are all open source and open for public inspection. The other metrics to assess successful development within the challenge setting are based on the number new developers onboarded, number of new tools and projects initiated by the Scala developers building on Cardano, and total number of Github submissions from the recruited developers. Every key metric is straight forward and easy to verify.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 2684, "q0": "The idea in this challenge setting sounds good but to me, its impact is not big enough to be a challenge. I think that it can fit in a proposal inside a community hub challenge. I don’t know the size of the scala developer community, but it’s not as mainstream as javascript or python etc… I think that the challenge touches one of the three strategic goals specific to fund9. In fact, I can see how this challenge can help Cardano in its open source mission and attract more developers. However, I personally think that the funds can be used better and in due time, focus on the niche programming languages.  The audience is too small in my opinion. Furthermore, we have to focus on the mainstream programming languages such as Javascript which can be used to build financial contracts in marlowe. In my opinion, the Marlowe language will encourage more adoption and I suggest to the proposer to focus on the more popular programming languages. Being part of the first cohort of the Marlowe pioneer program, and javascript developer, I see first hand that this type of application would bring adoption to the masses which should be the focus right now. Other than the small audience size issue, the proposer has done a good job explaining the challenge and guiding the proposers. Furthermore, new developers are going to benefit the Cardano ecosystem. Altogether the challenge is well written, but my only issue is that its impact will not be worth it this time.", "q0r": 3, "q1": "The community should definitely be able to address this challenge. The challenge proposer has provided goals that are achievable and gave guidance to future proposers and pointed them to the directions to focus on. But before we start thinking about building, the proposer has some interesting questions whose answers can reveal more hints on the feasibility of this challenge. What prevents developers from coming into the blockchain space? I think that most of them are not aware of this technology or maybe they are fearful. People fear what they don’t understand. So, in order to solve this problem, an easy solution would be education. I think that the community is capable of educating developers and it’s already happening with plutus pioneer program, Atala prism pioneer program, marlowe pioneer program and more. The challenge proposer has asked how existing skills can be leveraged to gain competency on Cardano? As of now, most programming languages can use Marlowe to write financial contracts. It’s an example of how this problem can be solved. And I think that the community can come up with more creative ways to help utilize more programming languages in Cardano. Altogether, I think that the challenge is feasible. However, my question remains if this is a great use of the funds? The budget of 1000000 usd sounds a lot to me for targeting this small audience. I think that the challenge is feasible but the budget doesn’t convince me.\nI suggest to the challenge proposer to add more details on how he came up with this number.\n", "q1r": 3, "q2": "The challenge proposer has included interesting metrics that should allow the community to track the success of the challenge. First and foremost, proposers of this challenge can focus on helping developers understand the pathway for learning haskell. They can also highlight the opportunities provided by learning haskell. As I said before, the focus should be on education as it will help shed more light on the benefits of Cardano and eliminate the fear of certain developers. Moreover, the challenge proposer wants to focus on bringing more developers in the Cardano ecosystem. This sounds a little bit redundant as it is related to education which we talked about earlier. Another point is to make it easier for developers to understand where their skills are needed. I assume that this can be done by adding documentations, tooling and more. The challenge proposer also wants to support participants in the gig economy. I think that this is not well formulated and lacks precision. I suggest to the proposer to add clarity on this area as success can be difficult to measure if there is ambiguity in the air. Proposers need clear instructions in order to write better proposals. The last point elaborated by the challenge proposer is to help junior developers get more experience with haskell and reactive programming. I feel like the challenge proposer could do a better job outlining success metrics. I suggest to the challenge proposer to put more thoughts on the success metrics as many of them are just telling the same thing.  Altogether, I think that this challenge should not be prioritized at the moment. However, life is also about timing and in the future this may be needed.", "q2r": 2, "assessor": "z_assessor_2332", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3026, "q0": "I believe that the problem stated is one that actually exists and keeps the Cardano blockchain a little behind blockchains like the Ethereum one that has a lot of experienced people working and implementing the smart contract technology. That kind of approach the Cardano ecosystem is trying to adopt with the Haskell devs, from the Plutus pioneer programme for example. However, there is still lack of experienced devs as a lot of newbies tend to give up. That's where this proposal comes to help this situation, in order to help devs understand learning pathways and opportunities for Haskell and senior devs to impart Cardano knowledge to juniors. Solving the problem of talent scarcity, it will be easy to fulfil the Cardano vision/mission so i thibk the societal impact of this challenge is obvious.", "q0r": 5, "q1": "There is a wide variety when it comes to the proposed solutions to tackle the talent scarcity such as \nmaking collaborations with communities such as higher education providers to train junior developers \nor by accelerating pathways or programmes to bring new talent to Cardano and i think that this is a sign that this is not a challenge that is going to fail or not have any visible impact on the next 6 months or so. The results of it will be obvious from the very start by the onboarding of senior Haskell devs  into the Cardano community. There is no Challenge team nor is it mentioned somewhere along the description of the challenge so that will cost a little bit when considering feasibility. ", "q1r": 4, "q2": "There are a few metrics there to measure outcomes as well as the success of the challenge such as the number of developers that can be reached during scope of each project, the number of new projects on Github made in Scala and are based on the Cardano blockchain or the number of community-building activities to bring awareness of Cardano to Scala developers. One thing i would like to point out is why those metrics are headed only towards the Scala devs and not the Haskell devs as well. All in all, the suggested metrics are set correctly to measure progress. ", "q2r": 4, "assessor": "z_assessor_2385", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 3307, "q0": "SCALA is a fast-growing community of distributed application developers who are building out a JVM interoperable language that is supplanting Java as the OOP language of choice.  By making Haskell accessible to these SCALA engineers, this proposal seeks to multiply the talent base significantly, while gaining senior developer experience that is philosophically aligned with the Cardano vision (language interoperability being the main principle supported, along with blurring the lines between functional programming and object oriented programming, allowing all the expressiveness of the dynamic languages and all the static type benefits of the JVM.  This is expressed in the wide adoption and migration of users of Java into the Scala ecosystem, including recent talent-pools like Twitter, LinkedIn, Foursquare, and Quora).\n\nAs a blending of two earnestly opensource communities, both committed to real world solutions and practical applications, this proposal aligns well with Fund10 goals.  Factor in that this is a search for collaboration and tooling that directly supports the people that are seeking to build, and I can find no reason to mark this challenge setting less than 5 stars for alignment.", "q0r": 5, "q1": "The proposal offers some good approaches that proposers will be able to take in prepping the ecosystem for Scala developers.  Organized as questions to ask and directions to pursue, this provides good support for potential proposers to bring their ideas within the scope of the challenge.\n\nOne area where I am unsure of how to grade, is the general idea of duplication of effort, and how it might relate to the budget.  One of the most active areas of Catalyst funds (especially among completed projects) is the developer ecosystem categories.  As a result there have been many builds and proposals for JVM-plutus compatibility, GoLang, Python, Rust, etc., all of which are potential entry points with potentially relevant client libraries, documentation and scripts.  In the current fund there is a proposal for a Scala-Plutus compiler integration (https://cardano.ideascale.com/c/idea/416933), and there is available opensource repos for Scala-Haskell as well (https://github.com/nau/lasca-compiler).  I'll err towards the proposer here, while noting that another deliverable that could be added to the list would be for projects to check the ecosystem for existing tools, and to perhaps build out an actual interoperability \"marauder's map\" that can show us where all the different language entry points are, and the projects that are working on them. (Worth noting that the Adrestia team at IOG is proposing just such an SDK here, check it out:  https://cardano.ideascale.com/c/idea/423220)\n\nBecause the $1m budget aligns with the size and scope of the developer community this proposal targets (essentially JVM), and because the proposal has done a good job of describing how proposals can become involved within the scope of what the community is capable of, I feel that this proposal merits a full 5 stars for feasibility.", "q1r": 5, "q2": "Under \"What does success look like?\" the team has listed 8 objectives that point to measurables like documentation created, users onboarded to Haskell and general education.  I was surprised to see that all the suggestions here were geared towards getting engineers working with Haskell, either through education or through training and mentoring.  Maybe it is just considered implicit in the objectives, but I thought there would be some description of Scala engineers that are still working in Scala, but building on Cardano, i.e. DSL type integrations, Scala to plutus integrations, etc.  There is a short reference to Plutus integration under suggested potential projects, specifically for using the formal verification mechanisms of the Scala compiler, which is sort of what I was talking about, but not really.\n\nI am going to go ahead and mark down for this lack of clarity:  Is the intention here to only bring over engineers to learn Haskell (in which case I would mark Alignment down for not being human or user defined) or to create any kind of bridge that gets the talent building in the ecosystem (which I suspect and support, but which means no specific metrics were provided for the Haskell-to-Scala side of the equation).  4 stars for verifiability.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3371, "q0": "Based on the information provided in this challenge setting proposal, I think that it addresses most parts of the four strategic goals for fund 9. First, it addresses the first strategic goal (prepare a group of people to make contributions to the ecosystem) by providing a well-worded statement about the goals of this challenge setting, which is to bring in more Haskell developers into the Cardano ecosystem. The main aspects of this challenge setting are education and onboarding. By creating proposals to address these main areas, more Haskell developers will enter the Cardano ecosystem and make contributions. Haskell is the foundation of Cardano, so it is critical that more people are taught the language and taught about Cardano. After going through the courses or programs developed under this challenge setting, those devs should be ready to make an impact for the ecosystem as a whole. The proposers also listed some potential directional inspirations, which can help guide the future proposers in this challenge setting to start planning their proposals more easily. \n\nThe challenge setting addresses the second strategic goal (build an open-source ecosystem and attract more developers) through the main goals of the challenge. The entire premise of the challenge is to onboard more Haskell developers and attract new talent. Thus, all of the proposals developed under this challenge setting will align with the second strategic goal. I understand that people most likely would be encouraged to make their work open-source. However, nothing about open-source software was mentioned in the proposal. As a result, it would be unclear to future proposers under this challenge to make it clear that they would tell their students or followers to make their work open-source. I assume that open-source is generally implied in the blockchain space, but wording it out specifically would have improved the challenge setting for this strategic goal. \n\nThe challenge setting addresses the third strategic goal (build real-world solutions on the Cardano blockchain) more indirectly. By onboarding more devs and teaching them how to code on/for the Cardano blockchain, this challenge setting can cause real-world solutions to be built on the blockchain months or years down the road. The developers who pass through the programs funded by this challenge setting will eventually be the ones building the solutions on Cardano. As a result, while this proposal might not explicitly build real-world solutions, it will cause them to be built over time.\n\nThe challenge setting could address the fourth strategic goal (improve tooling for human processes in Catalyst), but again, indirectly. More developers onboarded to the ecosystem could mean that they will be the ones building solutions for tooling in the future. As a result, over time, there will be better tooling solutions on the Cardano blockchain that will support the human processes in Catalyst. \n\nIt would have been great for the proposers to include more information that directly ties this challenge setting to building an open-source ecosystem and improving tooling for human processes in Catalyst. It would be a simple change that involves changing wording or adding a couple extra sentences that make things explicitly clear. In the future, I would recommend doing so in order to align better with the strategic goals. Otherwise, this challenge setting addressed the majority of the aspects of the strategic goals. (score given: 4)\n", "q0r": 4, "q1": "From my understanding of the challenge setting focus area, Cardano, and Catalyst, I think that the Cardano community has the capacity to address this challenge. In the past, I reviewed a proposal called Haskell and Coffee, which has become a successful program that is currently running. It is the proposals like these that I have seen which give me confidence that there are previous projects that actually work, so there will be demand for future projects as well. Plus, there is always demand for well-run Haskell courses, so as long as there is demand for the courses, there will be demand for people to make them (and therefore come to Catalyst to receive funding). Some of the other focus areas also have good demand, such as bringing Scala developers over to Haskell/Cardano and duplicating the plutus smart contract stack and applying formal verification to Scala. \n\nThe budget seems reasonable based on the scope of the challenge setting. 1 million ADA dedicated to this challenge setting makes sense because there are quite a few different focus areas. As a result, there will need to be enough funds for many different proposals. 1 million is a big enough number that it can fund all the key proposals, but also little enough that it doesn’t take away from other important areas for development, either. I did not have any issues with the proposal in terms of feasibility, so I can give it a score of 5. (score given: 5)\n", "q1r": 5, "q2": "Based on the information provided in the proposal, I think that this challenge setting is well-scoped in defining its focus areas. The proposers listed good metrics that can then be taken by future proposers and modified to apply to their projects. For example, bringing in more Haskell devs in the community and helping devs to understand learning pathways and opportunities for Haskell are both great metrics for success. The first metric can be quantified, and the second metric is more qualitative, but also important, especially in the context of online courses or programs. I think the key takeaways from this proposal are increasing the number of Haskell devs, providing programs to teach Haskell for Cardano, and supporting junior developers with their careers. If proposals can address these goals, then they are successful for this challenge setting. These metrics of success can also support healthy competition between proposals because they are slightly vague, so future proposers can fit them based on relevance. Proposals in this challenge setting will each solve different problems and compete to address as many metrics of success as possible. Since I did not have any complaints about verifiability, I can give this challenge setting a score of 5. (score given: 5)", "q2r": 5, "assessor": "z_assessor_2457", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6382, "q0": "This challenge is about onboarding developers from other engineering communities such as Scala. It aims to reduce the knowledge gap between two developers' communities, such as Haskell & Scala, and bring them into the Cardano ecosystem. This initiative is essential as Cardano must onboard more developers to lead the industry.\n\nI concur with the author that it is difficult to succeed in Cardano's vision without ensuring no scarcity of developers on Cardano. Besides, it is also necessary to become the number one in the field, as more developers will lead to more DApps and protocols running on Cardano.\n\nThis challenge helps with the strategic goals as it prepares and educates people who will be able and willing to contribute to the Cardano ecosystem. In addition, with the onboarding of more developers, this challenge will enhance the growth of the developer & DApps ecosystem. \n \nThis challenge would have been more attractive to voters if it had a catchy title such as 'Onboarding Developers'; the current title makes us think it is only about Scala developers. Anyhow, I think this challenge will be a springboard for Cardano adoption as it lays the groundwork for the future creation of DApps and other products on Cardano, which people will use worldwide. Given the above points, this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "Cardano has a robust developers’ community who are likely familiar with other programming languages along with Haskell/Plutus. With this challenge, their efforts to reach out to other languages-based engineers such as Scala will be incentivized, thus paving the way for onboarding many senior developers from other communities. Hence I conclude that the Cardano community is capable of addressing this challenge. \n \nI think the requested budget of 1 million is reasonable considering the importance of this challenge's initiative. But I have doubts about the number of proposals this challenge will see to match this amount. ", "q1r": 5, "q2": "Several metrics are provided in the challenge by the author, which will be helpful not only in measuring the challenge's success and proposals' success and also assist in tracking/auditing the progress of proposals under development. \n \nMoreover, the author provided the potential directions and guiding questions. This information will assist the proposers in selecting the subjects/objectives of their proposals. Also, it will help the PAs to assess the proposals, and the voters to vote decisively. \n \nLastly, as reflected in the challenge, the success will be \"Developer communities understand learning pathways and opportunities for Haskell & senior Scala (& other languages) developers are encouraged to try out Cardano blockchain.\"", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "importance": "Unless talent scarcity is solved, Cardano's vision is difficult to fulfil. Senior devs need solutions to impart Cardano knowledge to juniors", "success": "Dev communities understand learning pathways and opportunities for Haskell & senior Scala developers are encouraged to try out blockchain."}