{"id": 423261, "author": "quasar", "title": "FIFA World Cup 2022", "url": "https://cardano.ideascale.com/a/dtd/423261-48088", "category": 26604, "amount": 50000, "description": "How can the community unite around the World Cup to increase the reach and awareness of Cardano?", "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"id": 189, "q0": "This challenge setting is a draft. There is not enough information to assess alignment.\n\nI recommend that the proposer watch the Catalyst School tutorials and workshops on YouTube if they need help writing a challenge setting.\n\nAnother point is that the proposals funded in Fund 10 will only be funded after the end of the 2022 Cup, so this challenge is not viable.", "q0r": 1, "q1": "This challenge setting is a draft. There is not enough information to assess feasibility.\n\nI recommend that the proposer watch the Catalyst School tutorials and workshops on YouTube if they need help writing a challenge setting.\n\nAnother point is that the proposals funded in Fund 10 will only be funded after the end of the 2022 Cup, so this challenge is not viable.", "q1r": 1, "q2": "This challenge setting is a draft. There is not enough information to assess verifiability.\n\nI recommend that the proposer watch the Catalyst School tutorials and workshops on YouTube if they need help writing a challenge setting.\n\nAnother point is that the proposals funded in Fund 10 will only be funded after the end of the 2022 Cup, so this challenge is not viable.", "q2r": 1, "assessor": "z_assessor_2048", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"id": 654, "q0": "The goal of this proposal is to create awareness about Cardano the FIFA World Cup 2022. It is mentioned that this is the most watched event in the world and only happens each 4 years. This is true, but on the other hand, for this same reason any marketing related to the World Cup is very expensive. If it is desired to reach out to all that people, the 50k ADA budget of this challenge wouldn’t be enough even for a single advertisement. Other ways would have to be found to advertise Cardano in other places where the reach is lower. At the same time, it would be better to have advertisement that is related to the world cup instead of just general statements about Cardano. So, the question would be, how football could be connected to Cardano? There are some answers, NFT for collectible cards, for example. Since the main goal of this challenge proposal is to increases awareness about Cardano, is would indirectly address Cardano’s goals for Fund 10. I believe the aligment of this proposal is ok.", "q0r": 3, "q1": "Since the success of this challenge would be engaging a global audience as mentioned in the success definition of the challenge proposal, I believe the budget wouldn’t be enough even if only a single proposal gets funded. The advertising costs during these events are huge. I’m sure the community would be able to come up with ideas for marketing Cardano relating it to the World Cup and football in general, but the amount of funds available won’t be enough to reach a global audience as expected by the proposer. I believe this challenge is not feasible. Also, there’s no mention about a possible challenge team to manage this challenge in case it gets voted in.", "q1r": 1, "q2": "The challenge doesn’t include any KPIs at all, so the verifiability of this challenge proposal, based on the proposal itself, is null. The proposer could have added some KPIs related to social media engagement, which I believe is all that could be done since this challenge would be mainly focused on marketing and advertising. Maybe some numbers for new wallets creates or people onboarded to Catalyst could also be tracked if they use trackable links for this purpose. But the way the proposal is, the community wouldn’t be able to track the challenge’s success in the future.", "q2r": 1, "assessor": "z_assessor_2110", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 6748, "q0": "This is a very weak challenge. The first argument is that it only contains around 70 words, so don’t expect a very long assessment either. In a nutshell (how else) the proposal wants for the community to unite and increase the reach and awareness for Cardano through the 2022 World Cup. While the growing adoption is laudable, there are no more specific details offered. What kind of proposals are welcomed? What would be the target population to onboard and grow adoption levels? How can such a world wide event be targeted effectively with 50K USD, probably not enough to even buy 10 seconds of mass market advertising. To keep it simple there simply isn’t any alignment between this challenge and the Fund 9 strategic goals, so one star is sufficient. ", "q0r": 1, "q1": "Can the community deliver on this challenge? No it cannot. The 50k USD budget is completely unrealistic, and not enough for anything that has to do with an event as popular as the World Cup. One star. ", "q1r": 1, "q2": "Can the community verify this challenge? There are no details provided, again. We only know that success looks like “social media outreach and engaging a global audience”, while creative teams should find ways to reach the global audience. Perhaps a free little Cardano flag for each spectator? In conclusion, a completely unrealistic and unfinished challenge, without a real idea behind. One star.  ", "q2r": 1, "assessor": "z_assessor_2824", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 7759, "q0": "I am a soccer lover, and I think this challenge has a lot of potential, after all, CARDANO can make more people know through the soccer world cup, and make a name for itself.\nIf we can make the venue, soccer players know and support CARDANO, or even make CARDANO a sponsor of the tournament, or design peripheral products, CARDANO will immediately attract the attention of the world, so I think this FIFA challenge may not be critical to CARDANO's mission, but it will have a critical impact on its future popularity", "q0r": 4, "q1": "I'm sure there are soccer related professionals in the Catalyst community who can run some projects, so there must be someone capable of running this challenge. Unfortunately, the challenge's proposer did not give more details about the possible directions of the project, the aims and objectives of the challenge, leaving the project proposer with unlimited imagination, but also lacking direction.", "q1r": 2, "q2": "This challenge does not set the reference indicators for successful implementation, it is suggested to write some indicators with more reference value, such as how many people submitted FIFA-related project proposals, how many projects successfully entered the soccer market and made CARDANO famous, how many soccer members know and started to support CARDANO, whether there are projects related to becoming a FIFA sponsor, how difficult these projects are to implement,  how many soccer products have CARDANO logo, etc.\nThese are all indicators that can be considered for this challenge", "q2r": 1, "assessor": "z_assessor_2916", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 13899, "q0": "This proposal provided extremely limited details as to how it will achieve Cardano’s mission or the Fund Challenge Setting Strategic Goals. Described only as uniting the community at the FIFA World Cup, the proposers wrote less than 70 words towards this idea. The idea behind the proposal is social media outreach and engaging a global audience, in summary, marketing and advertising Cardano at the World Cup. As an idea it has possibilities, however no details are given. Does the marketing involve team sponsorship? Is it advertising space? Or giving away merchandise with the Cardano logo? Or, anyone who signs up and connects a wallet during the event gets a bonus? Who knows, no details are given as to possible successful ideas, only ‘creative teams will find a way…’ I rate this proposal 1 star for alignment to the goals.", "q0r": 1, "q1": "The Catalyst community is a pool of talented people and organizations, they have the feasibility to complete nearly anything - unless there are no guidelines to follow. Yes, people within Cardano/Catalyst could create advertisements for the World Cup, however, there is no information provided in the proposal as to specific goals for people to aspire to. In asking for 50,000 ADA the proposers need to provide more guidance and support for the community to be able to effectively address the challenge and create something that adds value and meaning to the Cardano ecosystem. I rate this proposal 1 star for feasibility.", "q1r": 1, "q2": "This is perhaps the worst category of this extremely brief proposal. Under the key metrics to measure, there is only one word mentioned ‘Interations’ which, I’m hoping is a typo for interactions? This is not enough detail to measure a challenge’s success. There is no information provided as a guide for proposers to manage their success. Overall, not enough information, I rate this proposal 1 star for verifiability. ", "q2r": 1, "assessor": "z_assessor_3840", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}], "importance": "It's important because the World Cup is one of the most watched events in the world and only held every four years.", "success": "Social media outreach and engaging a global audience."}