{"id": 423220, "author": "kriss.baird", "title": "CARDANO JS SDK: A Builder’s Journey", "url": "https://cardano.ideascale.com/a/dtd/423220-48088", "category": 26604, "amount": 1000000, "description": "What is necessary to realise a community-driven platform that showcases the tools being built and helps accelerate developer acquisition?", "f6_no_assessments": 9, "f6_rating": 4.703703703703704, "videos": [], "media": [], "f6_assessments": [{"id": 186, "q0": "Javascript is one of the most popular programming languages in the world, ranging from first to third depending on the period and research method. This challenge will leverage the Js SDK development that was started by IOG in 2021, bringing a greater number of developers and reducing the complexity for the development and implementation of solutions on the Cardano blockchain.\n\nDue to the fact that the JS SDK is in pre-production and the fact that this challenge has a specific scope (it's a sub-theme within the developer ecosystem) I don't see it as a critical or high priority challenge for Cardano in this Fund.\n\nThis challenge aligns with items 1 and 2 of the Catalyst Fund9 Challenge Setting Strategic Goals mentioned in the Proposal Assessor Guide.", "q0r": 4, "q1": "The Cardano community has been developing SDKs for JS in several applications. Teams like Blockfrost, Tango and Liqwid have developed their own Js SDKs and Javascript is a popular programming language, so I believe there is potential demand for the challenge.\n\nThe fact that the SDK being developed by IOG is in pre-production may limit the feasibility of the community creating solutions.\n\nAnother aspect that casts doubt on the feasibility of the community addressing the challenge is that in this Fund, there are several challenge settings related to the developer ecosystem, this is not necessarily a problem as each of these challenge settings has a different focus, however it is important that voters understand that the combined budget of these challenge settings is 9,925M ADA, which correspond to about 78% of the entire budget for Fund 10. I have linked links to the challenges listed below. https://cardano.ideascale.com/c/idea/422540 https://cardano.ideascale.com/c/idea/421335 https://cardano.ideascale.com/c/idea/423218 https://cardano.ideascale.com/c/idea/423220 https://cardano.ideascale.com/c/idea/423239 https://cardano.ideascale.com/c/idea/414308 https://cardano.ideascale.com/c/idea/423211 \nIt may be that none of the above challenges are funded or that they are all funded, this uncertainty makes it difficult to predict community demand on this challenge. It is difficult to assess the feasibility of this challenge in relation to the community's ability to meet the supply of funds, as if all challenges are funded, the supply of funds intended for this challenge tends to cause low competition compared to other challenges. Low competition tends to result in fewer quality proposals. Judging by Fund8's data, there were two challenges themed to improve the developer ecosystem, \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\". The total requested/available budget ratio was 3.1 and 2.8 respectively, indicating a below-average competition when compared to the other challenges. In Fund 8 the total budget was $16M USD, the budget for the \"Developer Ecosystem\" and \"OSDE: Open Source Developer Ecosystem\" challenges represented $1M USD(6.25% of the Fund) and $1.2M USD(7.5% of the Fund) respectively . The combined budget available for the development ecosystem at Fund8 was $2.2M USD (13.75% of the Fund). Therefore, challenges dedicated to the developer ecosystem had 13.75% of the total available budget and a competition for funds below average in Fund8, this is an indicator that the combined budget of all challenge settings dedicated to the developer ecosystem of Fund9 is well above of reasonable and balanced demand for Catalyst. Each challenge setting must be evaluated on its own merit, so I don't think it's fair to deduct points due to the excess of challenge settings dedicated to the developer ecosystem in this Fund, but it's important that voters pay attention to this, as it fund most of these challenges can cause a resource imbalance in Fund10, causing other important areas to run out of resources. It is also important that the challenge setting proposers try to collaborate with each other and check the possibility of merging in similar challenge settings or if they do not believe that the best way is to merge, at least try to coordinate the budget definition together in order to make the distribution of more balanced funds. \n\nNote: Due to the similarity between the challenges and the situation I mentioned above, my assessments should present a relatively high degree of similarity, and I will make adjustments in the necessary points. ", "q1r": 4, "q2": "The definition of success is reasonable and consistent with the context of this challenge. The key metrics will allow capturing in quantity and quality data on the development of projects, downloads, data on repositories, but there are no time frames both in the key metrics and in the definition of success and this makes the measurement of outcome/success of the challenge less objective.", "q2r": 4, "assessor": "z_assessor_2048", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 425, "q0": "This challenge-setting proposal is presented by IOHK and as a result, is very clean and efficient in its wording and presentation. it is very well aligned with the goals of catalyst. particularly in the training and preparing people to develop for Cardano. being a JS SDK-related challenge it very cleverly ensures meeting the open source, new user, real-world, and tooling support criteria. ", "q0r": 5, "q1": "as with other IOHK submitted fund 10 challenge setting proposals the 1 million ADA budget is both small enough to leave plenty of meat on the bone for other challenges while being large enough to provide substantial funding to a number of projects to accomplish the goals for this challenge. this challenge also easily falls into the skillset and ability of the community to participate in and be successful. it is hard to imagine any Dapp developers who are unable to utilize a JS SDK to greatly expand the capability of Cardano.", "q1r": 5, "q2": "this challenge-setting proposal is extremely well suited to the verifiability metric, even going so far as to outline half a dozen potential project starting points. with the focus on studying and testing the JS SDK there is ample opportunity for any number of regular checkpoints for audits and verifiability and I have no question that this challenge would be a valuable and productive addition to fund 10.", "q2r": 5, "assessor": "z_assessor_2082", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 652, "q0": "The main goal of this challenge proposal is to increase the utilization of the JavaScript SDK for Cardano, built by IOG and currently on pre-production stage. This library has been created to decrease the difficulty in using some of Cardano’s tools to build applications using a well-known language that can be integrated with many others. The proposal is to have the community creating tutorials for this library, case studies, example projects and other content that helps onboarding the developer’s community to use this SDK. It is proposed to use other similar onboarding platforms as a benchmark of what to do and what not to do as well, to make this experience as good as possible for new Cardano developers. This challenge proposal is very well aligned with Cardano’s mission goals of preparing a group of people to contribute to the ecosystem and attract more developers, and potentially to build real-world solutions on that of this SDK. The alignment of this challenge proposal with Cardano’s mission is very high.", "q0r": 5, "q1": "The budget requested for this challenge proposal is 1M ADA, which might be approximately $500k if the exchange rate of ADA doesn’t change much until the time results are tallied. It would be necessary to really understand this SDK to be able to create the content suggested in the challenge brief: documentation, examples, sample projects, use-cases, etc. I believe that the community has enough technical capacity to execute this, although, since this SDK is still in pre-production, I’m not sure how many people are already familiar with it and if most people who submit their proposal in this challenge would have to learn the SDK prior to executing their proposals. This adds additional risk to the execution of the proposal because it would not be easy to estimate the time required to learn it and could lead to unrealistic or insufficient proposal budgets. Also, most of the developers in the Cardano ecosystem are currently working on their own projects and it would be necessary to offer attractive rates for them to get interested in leaving their work to dedicate into a proposal for this challenge but given that the budget requested here is quite large, there might be enough room for this. Overall, I believe this challenge proposal is feasible.", "q1r": 4, "q2": "The proposer has added good metrics to be measure the success of the challenge: number of download of the library, high quality repositories based on this SDK, number of case studies and example projects, and new features requested. I believe these KPIs are good and well aligned with the challenge, and I would suggest adding some more KPIs related to other possible directions that the proposers could go, for example, creation of documentation to use this library, analysis of other onboarding platforms that could be used to define what to do and what not to do for this process. Is it good that they have added as a KPI the sentiment of onboarding platforms, and I believe that this is very important to measure not only the overall results of the challenge, but also projects individually, since it would enable assessing that are the most effective ways to onboard new developers. I believe the community and challenge team won’t have any trouble assessing the success of this challenge, thus its verifiability is very high.", "q2r": 5, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"id": 881, "q0": "There is something very intriguing about this approach proposed by Kriss. The purpose of this challenge is essentially to take advantage of the experience of developers both within the ecosystem as well as outside of it. With the release of the Cardano-js-sdk repository (0.3.0), they aim to facilitate an improved developer experience not only in the onboarding process, but also in how enjoyable the ecosystem is so that developers are motivated to stay. Clearly there is an alignment with Cardano's mission, as well as with at least three of the four strategic goals we have for the next fund.\n", "q0r": 5, "q1": "If there is one characteristic of our development community, it is that it is highly technical, as evidenced by the demand for programs such as Plutus Pioneers. On the other hand, we also pride ourselves on having one of the finest communities of researchers in the industry. Unfortunately within the description of the challenge setting there is no justification given as to why the amount requested is appropriate for this challenge Considering that it is requesting 7.8% of the available budget I would have expected a justification for this. It is not clear if there is already a designated challenge team for this challenge, but I don't think this will be a problem due to the same technical appetite of the community.\n", "q1r": 4, "q2": "I find the proposed definition of success to be appropriate and consistent with the challenge's objective. A success metric is a combination of metrics that attempt to measure the performance of the challenge itself, as well as providing guidance for the proposers. I find these metrics objective and easy to measure. Both the guiding questions and the possible directions for individuals or teams seeking budget allocation within this challenge are described very well. By having open source features, the community is able to audit the system if necessary.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 1496, "q0": "This IOG generated challenge setting is intentionally very well aligned with the strategic goals identified as essential for Fund 9. In order to accelerate onboarding of developers to the Cardano ecosystem, a js-sdk (java script – software development kit) is being built. The creation of a comprehensive toolkit can greatly accelerate the pace of developers migrating to Cardano. By reducing complexity and instituting standards, the Cardano js-sdk allows for a relative ease in implementation and development in the ecosystem. The implication of this challenge is that it could greatly expand the talent pool of qualified developers building on Cardano and grow the entire ecosystem in the process.", "q0r": 5, "q1": "Success of this venture is highly likely but not guaranteed. IOG has an excellent track record, however, the challenge proposal warns that the toolkit is still in the pre-production phase. Investigation of the github repository shows significant activity with the collaboration of 20 distinct contributors. A four star rating is justifiable based on all the information available.", "q1r": 4, "q2": "A targeted KPI schemata offered in the challenge setting provides significant and verifiable auditability based on clearly identified metrics. Starting with the number of downloaded toolkits and working it’s way down through a descending priority list of indicators, the proposed challenge demonstrates a reasonably thorough approach to satisfying the demands of accountability and the need to be audited. One area for potential improvement would be the creation of a positive feedback loop with the community of developers using the js-sdk. This could provide valuable insight into the functionality of the toolkit and allow for community suggested improvements. Dialogue with the end users of any product of this nature is critical to the mission of developing the best tools and best practices necessary to achieve the highest level of success.", "q2r": 4, "assessor": "z_assessor_2252", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3306, "q0": "I have mentioned in another review how nice it would be to have a high level SDK map of the programming language integrations across Cardano, and this interesting proposal from the IOG Adrestia team is presenting here their approach to a similar issue, except across all of Cardano.\n\nThey propose a Typescript based nvm sdk for Cardano that gathers together a relevant collection of developer tookits and APIs to create a integrated, coherent entry point to developing on Cardano.  The base repo has been built and supplied with kits for CIPs 2 and 30, web-extensions and wallets, and several more.  But what ultimately will this all include?\n\nThat is where this challenge setting comes in:  YOU get to decide.  They recognize the importance of an SDK for the community by the community, so this challenge will be for anyone to describe relevant SDKs and their use cases for specific utilities and functions, or to provide research regarding what SDK strategies have had the best implementations from other areas or ecosystems.  Whatever the voting community prioritizes will receive funding to collaborate on a community driven and owned information pipeline that delivers an upgraded developer experience on Cardano.\n\nBecause these objectives align across the board with the Fund10 goals, especially 2 and 4 (and 1 and 3 aren't slouches) I believe this proposal warrants full marks, 5 stars, for alignment.", "q0r": 5, "q1": "It may be challenging for the community to separate the desire to essentially market their project from presenting the broad impact an SDK or API from their project might be worth under this challenge setting, but the proposers have done what they could to mitigate this:  they have included a good high level overview of the approach and objectives, as well as solid guiding questions to get proposers on the same page with the goals of both the fund and the proposal.\n\nThey included the opensource repo for the SDK, where proposers can both do research and collaborate (this documentation portal may be a more accessible version for those who just want to look into its current state:  https://input-output-hk.github.io/cardano-js-sdk/index.html).  Somewhat out of place they have included a KPI for repo stars for relevancy of projects, which can certainly be used here to help proposer's determine if a given project or tool needs to be linked up to the sdk or not.  \n\nFor anyone wishing to add an SDK to their project in order to make it accessible under this challenge setting, you can see an opensource, interoperable repo here for doing that: (https://github.com/guo-yu/sdk#readme).\n\nAll in all the team has provided a good balance of opportunity and guidance here for helping the community to adopt this as their own, and the $1m budget is in line with past developer ecosystem budgets, though the scope is a bit more limited.  As such I see no reason to mark the proposal down, and give it full marks for Feasibility.  5 stars.", "q1r": 5, "q2": "They have included 2 high level evaluation criteria (coherent developer experience, number of uses of the Cardano-js-sdk) and 6 more granular KPIs for measuring success (number of downloads, number of nvm examples submitted, etc.).  Interestingly they provide a metric for feature requests, which I believe will be used as an issues backlog for the sdk...could potentially be enormous.\n\nThe criteria provided should suffice for both tracking progress and success from proposers under this challenge setting, which will end up being a unique combo of voter prioritization and ability to deliver the result in a way that has impact on the repo.  I don't believe there is any reason to mark down this verifiability section, and so give it 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6381, "q0": "This challenge wants to ease the development process on Cardano by formulating 'Software Development Kits (SDKs).' The author wants the proposers to 'prepare case studies on how platforms do (or don't) use sample projects, make fun and interactive education presentations for new & veteran developers, design a product portfolio that captures the tools necessary for developer's success, etc. The SDKs are essential; otherwise, most pre-built functionality must be made by developers from scratch. SDKs let us create new tools efficiently and make the process easier for everyone involved because almost everything is pre-built. Hence SDKs are needed to enhance and smoothen the development process on Cardano.\n\nThis challenge helps with the strategic goals as it prepares & trains the group of people who will be able and willing to contribute to the Cardano ecosystem. It also accelerates the growth of the developer ecosystem and thus accelerates the creation of DApps and other products. I think the SDKs and other allied solutions created under this challenge will be open-source. \n \nThis challenge will be a springboard for Cardano adoption as it lays the groundwork for the future creation of DApps and other products on Cardano, which people will use worldwide. \n \nI think the reason for a separate challenge for the above purpose is that the author wants the developers' attention and efforts in this direction. Without a separate challenge, we may not see sufficient participation in this resolve. But I think the requested budget of '1 million is a bit excess; 500k would have been more appropriate. ", "q0r": 5, "q1": "It is evident that the Cardano community is capable of addressing this challenge in building SDKs & related solutions, given the fact that many developer tools and resources developed under similar challenges in the past funding rounds and seeing many community members contributing on GitHub for multiple open source projects,\n \nAs mentioned above, I think the requested budget of \"1 million\" is a bit excessive, and 500k would have been more appropriate because this is a more confined challenge than a general 'Develop Ecosystem' challenge. Hence I am rating it four stars due to this reason.", "q1r": 4, "q2": "The author mentioned several metrics in the challenge, which will be helpful not only to measure the challenge's success and proposals' success and also to track/audit the progress of proposals under development. \n \nFurthermore, the author provided the potential directions and guiding questions. This information will assist the proposers in selecting the subjects of their proposals. Also, it will help the PAs to assess the proposals, and the voters to vote decisively. \n\nFinally, as reflected in the challenge, the success will be a smooth & systematic developer onboarding experience for Cardano builders' and 'Open source projects, Repos, and documentation that uses Cardano-js-sdk.'", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9797, "q0": "The goal of this challenge is to build a toolset on the Cardano platform, which makes it easier for developers to develop NFTs, games, or wallets… If this challenge is successful, their work will be fast. , simpler and more efficient. With certain benefits, this challenge aligns with Fund 10's goal: to attract more developers. Not just the people in Cardano, building Cardano-jss-SDK will definitely be beneficial in attracting developers in other communities to contribute and implement projects on Cardano.", "q0r": 5, "q1": "The challenge addresses an inevitable need many developers have as they build their Dapps. Therefore, this project will surely attract many ideas, and many related initiatives, and there will be many products and programs for different types of dApps. I think this will be one of the challenges to attracting a large number of projects in fund 10.\nThere are now a number of proposals regarding building libraries and toolsets. That further proves that the Cardano community has enough capacity, knowledge, and experience to complete this challenge well. If this challenge is funded, it will certainly encourage the faster and more complete building of these foundational libraries and toolkits, contributing significantly to Cardano's future advancements.", "q1r": 5, "q2": "The success of the challenge is determined by the number of projects used as well as the experience of the founders. Some pretty clear numbers are given such as the number of downloads, the number of new feature requests, or case studies… I think these numbers are also quite clear, reasonable, and easy to understand. The reporting process is also easy.", "q2r": 5, "assessor": "z_assessor_3096", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 14683, "q0": "This challenge is about building Cardano-js-sdk tool sets for developing applications on Cardano platform. For almost any project on Cardano platform such as NFT project, wallet, game, DEX, developers need this tool set to build projects faster and more efficiently. In the long-term development of the Cardano ecosystem, developing tool sets such as JavaScript SDK is inevitable because it will attract developers from other ecosystems to switch to Cardano. This challenge also aligns with the Cardano mission in attracting more developers. So I think creating a separate challenge for cardano-js-sdk is appropriate.", "q0r": 5, "q1": "In the proposals for Catalyst, there have been several projects geared towards building libraries and tool sets for the SDK on the Cardano platform. This is the same essential need of developers in the process of building dApps and of the Cardano ecosystem itself in the process of development and expansion. We even need multiple teams to build and develop these tool set libraries corresponding to different types of dApps. Up to now, although there has not been any direct challenge on cardano-js-sdk, Catalyst fund has funded and successfully implemented many challenges related to dApps, developer ecosystem. Therefore I think the Catalyst community is fully capable of implementing this Challenge. The estimated budget for this proposal is 1,000,000 ADA in my opinion, which is reasonable and consistent with the general direction for Catalyst development.\n", "q1r": 5, "q2": "Challenge has also clearly defined success: in terms of the experience of developers and projects using cardano-js-sdk. The proposal writer has also provided a set of criteria to evaluate the development of projects such as: number of downloads, sentiment of onboarding platforms, number of case studies, number of new feature requests... These are all quantitative factors, so it can make it relatively easy for the community to measure the development of the Challenge as well as the proposals.", "q2r": 5, "assessor": "z_assessor_4086", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}], "importance": "The SDK formalises interactions with Cardano, giving developers quality foundations that reduce implementation subjectivity and complexity.", "success": "\nA coherent developer onboarding experience for Cardano builders.\nOpen source projects, repos, and documentation that use cardano-js-sdk\n"}