{"id": 381055, "author": "mlabs", "title": "MLabs DTF (Dao-Traded-Fund)", "url": "https://cardano.ideascale.com/a/dtd/381055-48088", "category": 26233, "amount": 70400, "description": "Существующие в настоящее время блокчейн-решения DeFi являются высокорискованными, и некоторые инвесторы предпочитают менее волатильную стратегию инвестирования.", "funded": 2, "upvotes": 153644976, "downvotes": 9582829, "votes_result": 144062147, "votes_cast": 787, "f6_no_assessments": 13, "f6_rating": 4.487179487179487, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение касается потенциально очень большого спроса на пассивное инвестирование, когда цифровые активы станут более массовыми. Чтобы представить влияние в перспективе, я бы предложил добавить количественные ссылки, такие как текущий размер рынка пассивных инвестиций в США, составляющий примерно 50 трлн долларов США или 50% от общей капитализации американского фондового рынка. Наличие пассивного, более простого решения для людей, которые в противном случае не имели бы времени, интереса или опыта для самостоятельного выбора токенов/монет, чтобы получить доступ к цифровым активам, безусловно, полезно для поддержки принятия DeFi и экосистемы Cardano.\r\nЯ хотел бы отметить для постановки проблемы, что один-единственный инструмент пассивного инвестирования не обязательно имеет меньшую волатильность, чем средняя волатильность более широкого криптовалютного рынка. Менее волатильный рынок - это результат наличия крупномасштабного сеттора пассивных инвестиций и институционального/долгосрочного капитала (например, пассивные инвестиции составляют 50% всего рынка акций США). Кроме того, для криптовалютного рынка еще не определен индекс (подобно S&P 500 или Nasdaq на рынке акций), поэтому я ожидаю увидеть больше подробностей о том, как стратегии распределения и балансировки активов, а также целевой профиль риска/доходности будут разработаны для iDTFs. Я профессионально занимаюсь управлением активами и инвестициями в акции, и я буду рад поделиться с командой своими соображениями, если проект будет реализован.", "q0r": 4, "q1": "MLabs явно имеет значительный опыт работы в экосистеме, стоя за некоторыми из крупнейших проектов на Cardano. Для сообщества было бы еще полезнее оценить предложение, если бы MLabs указала и подчеркнула соответствующий опыт человека, отвечающего за этот проект. Предлагаемый бюджет и сроки правильно разбиты на подробные блоки работ.  С точки зрения технической осуществимости, предложение объясняет некоторые технологии и основные функциональные возможности для реализации. С точки зрения финансов/операционной деятельности, я бы предложил автору предложения внести больше ясности, например, какой алгоритм будет использоваться для выбора совокупности активов и взвешивания активов; будет ли он оптимизирован для минимальной ошибки отслеживания или более низкого коэффициента риск-доходность; кто будет принимать решения по инвестиционным стратегиям и как выбрать такого человека. Кроме того, наличие высокоуровневого плана на период после завершения стадии MVP также будет полезно для сообщества при оценке проекта.", "q1r": 4, "q2": "Проект поддается аудиту на основе основных функциональных возможностей iDFT. Но я бы хотел увидеть некоторые метрики для определения успеха MVP после запуска, например, целевые активы под управлением или волатильность по отношению к широкому рынку. Как я уже упоминал в разделе \"Влияние\", я считаю, что пассивная стратегия не обязательно менее волатильна, чем широкий рынок, поэтому постановка задачи может потребовать некоторого пересмотра. Одним из вариантов, который следует рассмотреть, является пассивная стратегия, позволяющая получить широкую экспозицию в криптовалютах, экономя при этом время и усилия инвесторов по проверке.", "q2r": 4, "assessor": "z_assessor_684", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Предложение предполагает создание торгуемого фонда DAO, который позволит людям приобретать корзину токенов различных проектов, ориентированных на конкретные области. ETF являются популярным инвестиционным инструментом в современном финансовом ландшафте, который позволяет людям инвестировать в более широкие сегменты рынка и помогает избавиться от необходимости делать индивидуальный выбор. Внедрение такого типа продукта в Cardano с быстро растущей экосистемой DeFi может оказать большое влияние, позволив новому кругу инвесторов принять участие простым способом, используя торгуемый фонд DAO, который они могут предпочесть. Автор предложения подробно описывает некоторые ключевые причины, по которым такой подход может иметь ряд преимуществ, что свидетельствует о том, что это правильное решение проблемы. В частности, они перечисляют диверсификацию, более низкие затраты и долгосрочную доходность. Единственный отзыв, который можно дать здесь, заключается в том, что еще одно ключевое преимущество, которое это решение предлагает конечным потребителям, - это экономия времени. Вместо того чтобы искать все DEX, как в приведенном ими примере, а затем покупать их по отдельности, инвестор может просто использовать торгуемый фонд DAO в гораздо более короткие сроки. Для некоторых инвесторов это будет жизненно важно, если они хотят легче входить и выходить с рынка или конкретных рынков, таких как Cardano DeFi или Cardano DEXs. В целом, очевидно, что существует потенциально большой спрос на это решение, и, таким образом, оно может оказать большое влияние на экосистему.", "q0r": 5, "q1": "Команда, стоящая за этим предложением, - MLabs, которая работала с IOG, помогая реализовывать части протокола Cardano. Кроме того, они также работают со многими командами DeFi в экосистеме и помогают им реализовывать собственные решения. Команда разработчиков предложения дает ссылку на свой репозиторий Github, где можно увидеть длинный список вкладов в проекты на Haskell и экосистему Cardano в частности. Ключевые части предложения разбиты на бюджет с указанием количества часов, необходимых для каждой из них, что дает итоговую сумму бюджета, где стоимость часа составляет $80. Команда имеет большое количество доказательств своей компетентности, и при разумном бюджете и масштабе этот проект представляется вполне осуществимым, чтобы быть выполненным на высоком уровне.", "q1r": 5, "q2": "Команда разработчиков предложения изложила набор функций вместе с бюджетом на то, сколько времени потребуется для завершения. Добавляется набор точек критериев успеха, которые напоминают точки завершения этапов. KPIs по конечному продукту не добавлены. Команда разработчиков предложения предоставила свой репозиторий Github с большим количеством открытого кода. Команда не уточнила, будет ли это предложение с открытым исходным кодом и доступно ли оно сообществу. Было бы неплохо иметь более конкретные KPI, относящиеся к типу средств, которые, по их мнению, будут произведены, и план с открытым исходным кодом, чтобы дать этому предложению полную оценку.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Здравствуйте, участники голосования ada! Эта задача называется \"Повышение DeFi от Cardano\", и данное предложение соответствует задаче по следующей причине. Defi по своей природе все еще ассоциируется с высоким риском, что может быть сдерживающим фактором для начинающих пользователей. Данное предложение направлено на снижение некоторых рисков Defi путем создания ETF, в которых вы сможете получить доступ к нескольким активам, вместо того чтобы класть все свои \"яйца\" в одну корзину. Это может быть полезно, поскольку многие люди хотят получить преимущества, которые дает новая технология, и при этом максимально снизить риски. Новые технологии также сопровождаются большим количеством проектов, которые потенциально не могут быть реализованы в долгосрочной перспективе, поэтому, получив возможность участия в нескольких проектах в Defi, вы можете действительно воспользоваться преимуществами роста, не перегружая себя одним проектом. Я наблюдаю рост популярности этой концепции \"криптовалюты Etfs\" среди других цепочек, поэтому мы знаем, что при правильном подходе она может вызвать много одобрения и помочь в росте Defi на Cardano!", "q0r": 5, "q1": "MLABS - это организация, стоящая за этим предложением, поэтому мы должны начать с нее, оценивая, есть ли у них возможность его выполнить! Пока еще рано говорить о Defi на Cardano, но после ознакомления с их полномочиями в представленном плане я должен сказать, что с большой долей вероятности они смогут его выполнить. Это потому, что MLABS имеет опыт в разработке Defi и является хорошо известной командой в сообществе кардано и катализаторов. Они являются партнерами iog plutos и нанимают более 65 разработчиков для создания таких потенциальных будущих Defi dapps, как sundae swap (dex) и liquid finance (defi lending platform) и многих других. Это говорит о том, что их уважают и они компетентны. Мы также можем увидеть их способность выполнить начальные этапы этого предложения, когда мы посмотрим на их план по реализации. Например, они дают нам четкие и прозрачные оценки того, как они будут использовать средства, сколько времени займет реализация и сколько человеческих ресурсов им потребуется для начала работы.", "q1r": 5, "q2": "При оценке возможности проведения аудита этого предложения меня поразило то, что они дали нам четкую оценку времени, которое потребуется для реализации этого предложения. Это дает нам, как избирателям, конечный срок для отслеживания хода реализации предложения. Я бы также посоветовал избирателям обратить внимание на раздел ключевых показателей, когда речь идет об аудите хода реализации предложения. Они признали, что Defi on Cardano находится на ранней стадии, поэтому трудно провести такие измерения, как ежедневные активные пользователи или общая стоимость блокировок, и я действительно ценю это, поскольку Defi on Cardano все еще находится в зачаточном состоянии, и у нас нет данных для оценки этих ключевых показателей. Однако они дают конкурентное обещание обеспечить выполнение этих ключевых показателей по мере развития пространства и получения более прозрачных данных. Например, в отношении tvl они говорят: \"У нас будет возможность расширяться, чтобы справиться с любой нагрузкой\", что означает, что нагрузка tvl может быть обработана независимо от объема. Это означает, что мы можем проверить точность этого, увидев, надежно ли готовый Dapp обрабатывает приток капитала или нет. Заключительные мысли для избирателей ada - Если есть что-то, что важно для Defi на данном этапе, по мнению многих людей, это безопасность, поэтому я уважаю то, что они установили флаг в землю, когда дело доходит до способности обрабатывать любое количество средств, которые придут на готовый продукт этого предложения. Как говорит Майкл Сейлор, самые сильные деньги всегда будут привлекать богатство. Для меня это означает, что безопасный способ инвестирования в криптовалюту Etfs является наиболее важным для bosting defi on cardano в настоящее время. Mlabs написали красивое предложение о запуске их mvp (dapp этого предложения) и пообещали в ссылке, которую я указал о работе с tvl, сделать его безопасным независимо от загрузки капитала.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Proposal addresses the problem of users seeking alternatives to volatile markets. This project will ad value to the Cardano ecosystem by attracting new users to Defi on Cardano and connecting to other Defi projects. The key metrics are perfectly aligned with the Challenge as they are identical. This project is able to scale as it will be open source and has a governance system.", "q0r": 5, "q1": "Relevant skills and team is provided via github page. They have been actively working and contributing to many Defi projects in the Cardano ecosystem. The budget seems reasonable and is broken down into identifiable items that shows how many hours are allocated to each item and a total of 880 hours to complete the whole project seems doable. They explain in great detail what they want to build and what the core functions are, but they don't go into the technical details on how they will build this. Providing the reader with the technical details will show them your building process and boost confidence in your abilities. There are considered risks throughout the proposal, it would have been nice to view them all in one place, but at least they are there. They will address the risk of resources lost due to bugs, by submitting their work to the certification process at IOG.", "q1r": 4, "q2": "They provided a roadmap with milestones of different parts of project that gets completed. The milestones can be used as KPIs, but it would help to have user based KPIs and transaction KPIs. The more KPIs you provide the easier for the community to track the performance of your project. They address the problem of volatility in Defi markets being unattractive to some users. They solve this by offering stable alternatives to new and experienced users.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 25, "ne": 6, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "An outstanding idea for pooling investors into a decentralized trading fund focused on Cardano Native Assets.  This is likely to be a popular Dapp if successful since it provides an easier way to gain exposure to a complex marketplace. The plan includes development of automated processes for the vault, distribution of fees/discounts, and governance.", "q0r": 5, "q1": "MLabs is one of the stronger development teams in the Cardano ecosystem with experience with Haskell, Plutus, and Rust developers.  The project plan is broken down into 9 features and funding for changes. A minimum viable product is described for the core functions and deposit options. They have outlined a plan for MVP in 8 months and launch in 12 months.  They acknowledge that the scale of the launch is dependent on the pace of assets available to invest in over the next year. ", "q1r": 5, "q2": "MLABs provides an answer for each of the 12 requested metrics, though most of the answers are either TBD or vague.  Nevertheless, the core goal to facilitate the utilization of dapps on Cardano seems trackable. More importantly, the clarity of the project plan will provide a base upon which progress can be measured.", "q2r": 4, "assessor": "z_assessor_145", "no_vca": 24, "ne": 3, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge.  As someone who has already traded with ETFs, i also know how the fundamentals of them work and am able to assess whether this project makes sense. This proposal offers a good solution to some points of this challenge, like accessability to DeFi. A tokenized asset has the potential to offer DeFi accessibility even to people that don't have a lot of money. This will clearly add value to the Cardano ecosystem if it is done in a comprehensive manner and will support native tokens and DEXs.\r\nThe proposal has formulated metrics that align with the metrics of the challenge.\r\n In the way the project is planned, it should be perfectly able to scale with the growing cardano ecosystem. Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q0r": 5, "q1": "The proposers are very transparent about their background and seem competent and up to the task. They provide proof that they know coding and the different layers of Cardano. It is highly likely they are up to the challenge. The proposer has a realistic idea about the number of people and work hours that are required for such a task. The buget is well-defined, fine-grained and rationable. The different parts of the budget are realistic and clearly show where the money goes. While the hourly rate is a bit high it is comprehensible that a company has a bit higher costs to carry than single people that don't have any of the business costs. The proposers have set out a plan for the case that the project will take longer time and have higher costs. The timetable is realistic for a project of this scope. The plan of implementation is shown and seems realistic. Technical aspects are only explained superficially and could be more detailed to get a more in-depth view of what is going to be done. Challenges and risks to the project that might occur are not really discussed.  Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q1r": 5, "q2": " A detailed roadmap with milestones and a time horizon is presented. The targeted problem and the solution are explaind clearly and comprehensible. Hence, overall this proposal is audible.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This project will help to improve the development environment of DeFi, it will help to mitigate some of the risks associated with cryptocurrency investing as the proposer said in their solution brief. \r\nMoreover, the proposer also lists some important points that this project will impact to the Defi, therefore, impact the Cardano ecosystem. \r\nThe proposer also outlined very detail the project's success will be and described very detail the key metric they choose for this project, and all of them shows that met with the challenge settings. ", "q0r": 5, "q1": "The proposer explained clearly about their solution with samples and feature explanation, that can help anyone to assess their tasks in the \"What success look like\" part, that very details in months.\r\nMoreover, they have a page of budget breakdown that is very clear by work-hour, as if you have experience in dev, it's all reasonable and realistic. \r\nTherefore, I rate 5 for the feasibility. No more comment on it, they're made all perfect and I believe that they will do it right. ", "q1r": 5, "q2": "This proposal is driven by a very experienced team, they're IOG partners with over 65 Haskell developers working on some of the ecosystem's biggest projects - including SundaeSwap, Liqwid... \r\nMore than that, they made this proposal so perfect and clear that will help our community simple to audit the project on single tasks.\r\nThe proposer didn't have a part to show their relevant risks and how they face them, but in the detail of the proposal, I can see some challenges that they also have the plan for that. So I think this proposal is 100% auditable. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 15, "ne": 5, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Mlabs' proposal seeking to create pools of assets that help to mitigate some of the risks associated with cryptocurrency investing. Proposal mentioned importance of such funds like Ardana, CardsStarter, Player Mint etc. - for diversification, lower costs and Strong long term returns. Thus the challenge is effectively addressed.", "q0r": 4, "q1": "MLabs is IOG partner, has over 65 Haskell developers that developed Sundae Swap, Liqwid, etc. The proposal can be successfully implemented. The detailed plan mentioned multi-asset vault structure, tracker, re-balancing functionality, multi-asset dep functionality, The detailed plan will make implementation successful", "q1r": 4, "q2": "The road map structured into 1st , 3rd, 5th, 8th months and the expected launch date of 4th quarter 2022 will make auditing effective. The budget has a detailed breakdown to make auditing easier and effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The ability to create this kind of infrastructure for ETF-like investments is important and would represent an impactful addition to Cardano DeFi. One can argue about the usefulness of curated baskets and rebalancing that the average investor is unlikely to understand. However, it seems to be a worthwhile return on investment and good value for ADA holders.", "q0r": 4, "q1": "MLabs's track record and association with IOG make it highly likely that the project will be a success. This is a very impressive team and one of the largest pools of Plutus talent.", "q1r": 5, "q2": "The amount of detail presented both in the proposal and whitepaper is impressive. The technical detail and cost breakdown are not matched by sufficient performance metrics and it would be difficult to assess before completion if the project is succeeding or failing.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is feasible when creating valuable asset groups and minimizing the risk of high price fluctuations, suitable for investors who do not want large fluctuations. The project is open to everyone and suitable for the challenge. The proponent should add some similar and more prominent utilities than an ETF (for example, if I own a DTF, can I vote for separate projects in the fund? ", "q0r": 4, "q1": "Proposers that mention MLabs as an IOG partner should still add the identities, expertise of the participating members and should include detailed documentation on how/demo/specs/features/ will be apply. The proponent has provided a monthly and quarterly timeline that will perform some functions with an hourly cost, the estimated cost of 160h*80$ should provide more information or predict risk issues.", "q1r": 3, "q2": "The proponent provides a roadmap for the implementation of the functions, but has not yet seen the additional KPIs needed to measure. It is necessary to add the risks, difficulties and challenges of the project, especially the unknown resource portion, how many people and teams are involved.", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal as implemented will not deploy an open financial solution within six months, as indicated in the proposal. Additionally, may increase exposure to security risks given that defi projects associated with indexed assets are maintained separately and outside of the scope of this financial solution. Finally, the proposal as funded wouldn't negate the introduction of venture capital, and may actually make it an easier point of entry into Cardano defi solutions. \r\n\r\nWith that said, basket funds offers users more familiar vehicles that may offer a healthier balance for certain risk and investor profiles. ", "q0r": 4, "q1": "It's clear that the organization is already active in the Cardano space, and very aware and hands on with defi projects that have the potential to form a part of the basket(s). The fact that 60+ developers are already on the books means DD&I can ramp up very quickly. The main variable may be allowing the team time to assess the early evolution of defi projects that have the potential to be indexed over the course of 2022. ", "q1r": 5, "q2": "Good, high-level breakdown of quarterly project timelines and deliverables. ", "q2r": 5, "assessor": "z_assessor_716", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal alligns with the challege goals. Specifically it attempts to solve the problem of decentralized ETFs. This proposal also make it clear that the product will be very attractive for new comers to the ecosystem that want to minimize risks. Furthermore, the proposal includes many metrics like the type of tokens to be made into DTFs and so on. ", "q0r": 4, "q1": "The proposer presented a link to their GitHub account which seems to be very active and includes many Cardano-related projects. The projects are also segmented into steps and categories and into hours needed for each category. They also provide a realistic timetable that leads to an MVP and then to further added features.", "q1r": 5, "q2": "The project presents a clear roadmap with different incremented goals. A lot of milestones are also given divided into categories and monthly goals. Finally, the team seems to understand the problem at hand and has a clear idea about how to solve it.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The creation of a DAO ETF would significantly boost the early Cardano DeFi space with the ability for members to efficiently diversify their risk.", "q0r": 5, "q1": "The MLabs team are Plutus partners and have worked with IOG + multiple Cardano DeFi protocol's during their v1 development. The present a coherent timeline, budget and implementation plan in this proposal. The combination of their team, past project work and plan to implement this solution are all pointing to high chances of a successful proposal implementation. ", "q1r": 5, "q2": "This is one of the most complete/structured proposals in this challenge by one of the strongest Plutus development shops currently building in the Cardano DeFi ecosystem. ", "q2r": 5, "assessor": "z_assessor_769", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "MLabs DTF - ETF создают пулы активов, которые помогают снизить некоторые риски, связанные с инвестированием в криптовалюту.", "experience": "MLabs является партнером IOG. У нас более 65 разработчиков на языке Haskell, работающих над крупнейшими проектами экосистемы - SundaeSwap, Liqwid и др."}