{"id": 383214, "author": "tobrien", "title": "Climate Finance For Small Farmers", "url": "https://cardano.ideascale.com/a/dtd/383214-48088", "category": 26233, "amount": 12000, "description": "Модернизация сельского хозяйства требует от мелких фермеров рисковать средствами к существованию, не имея никаких гарантий.", "funded": 1, "upvotes": 38124024, "downvotes": 31684484, "votes_result": 6439540, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"q0": "Предложение эффективно решает задачу, которая заключается в расширении пространства DeFi Cardano путем предоставления решения для очень важной и эффективной цепи поставок. Я несколько лет работал над цепочкой поставок сельскохозяйственной продукции от фермеров до транснациональных корпораций и могу оценить важность такого предложения и влияние, которое оно может оказать на людей, природу и, предоставляя решения, также на Cardano. Предложение определяет проблему, которая потенциально может повлиять на решение задачи, но все еще требует проведения исследований/составления белой книги. Предложение имеет потенциал привнести большую ценность в экосистему Cardano, но помимо упоминания о размере рынка, было бы неплохо добавить еще немного информации о финансовых правилах и процессе, и как это связано с механизмом DeFi.\r\nНесколько ключевых показателей и целей предложения совпадают с изложенными параметрами задачи. Хотя задачи предполагают некоторые конкретные KPI, которые не упоминаются. Хотя это все еще ранние дни, было бы неплохо добавить некоторые оценки, например, сколько фермеров будет охвачено приложением на каждом этапе. Добавление дополнительной информации о предлагаемом пилоте (фермеры, цепочки поставок, цены, культуры, ключевые задачи) было бы очень полезным.", "q0r": 4, "q1": "Команда обладает большим опытом, и предложение предоставляет достаточно информации, чтобы подтвердить это. Команда также активна в экосистеме Cardano и катализаторов в течение нескольких лет. Было бы неплохо предоставить больше информации о местном проекте и руководстве команды в Гане. Бюджет изложен четко и разбит на идентифицируемые статьи и является разумным для достижения поставленных целей. Будучи сам предпринимателем, я могу оценить, что затраты очень умеренные для поставленных целей, и потребуется больше средств. Замечательно, что автор планирует привлечь финансирование от инвесторов, но это будет в конце года, и, вероятно, в процессе потребуется больше ресурсов (т.е. развитие, ликвидность). Было бы неплохо упомянуть об этом в предложении и предоставить больше информации. Предложение предлагает реалистичный график завершения работы.\r\nЦепочки поставок сельскохозяйственной продукции сложны, и существует множество проблем, которые важно упомянуть и знать о них. Например, цели трейдера, логистика или потребности цикла движения денежных средств. Опять же, было бы полезно получить больше информации о пилотном проекте, чтобы оценить его осуществимость.  ", "q1r": 4, "q2": "В предложении есть четкая дорожная карта, этапы, бюджет, оценка времени и результаты. Проблема, которую необходимо решить, и решение очень сложны, и хотя информация представлена в хорошем порядке, необходимы дополнительные детали, которые будут представлены в whitepaper через несколько месяцев. Потенциальные риски и проблемы, как уже упоминалось в разделе о целесообразности, особо не рассматриваются. Было бы полезно расширить метрики/KPI для измерения успеха, например, ожидаемое количество фермеров и их экономические улучшения. Тем не менее, прогресс может быть проверен на основе этапов, которые должны быть достигнуты в течение 3-6-12 месяцев, и я считаю, что эти этапы дадут большую информацию для сообщества, связанную с крупной, масштабируемой задачей, в то время как бюджет очень разумный - поэтому я указал здесь полную ставку.", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Здравствуйте, участники голосования Ada! Я очень рад этому предложению и своей роли в его рассмотрении, поскольку я вижу, как влияние этого предложения и его связь с задачей могут быть потеряны при переводе. То, как это предложение согласуется с задачей, выглядит следующим образом! 1. Это предложение поможет в том, чего не хватает многим defi dapps, и это связь с реальным миром и активами/промышленностью в реальном мире! 2. Cardano defi все еще молод, поэтому нам нужно будет поддержать множество экспериментов, когда дело дойдет до сглаживания краев Defi на Cardano. Это предложение будет передано катализатору с любыми уроками и данными, имеющими отношение к улучшению defi daps в будущем. Особенно в области брака между Defi и сельским хозяйством! 3. Проблема, которую это предложение стремится решить, создавая белую книгу, рабочий прототип и доказательство концепции для своего готового продукта, уже указала 2 потенциальных игроков, которые будут использовать их Dapp, и эти игроки будут включены в Cardano, увеличивая Defi nativly. Первым \"игроком\" будут фермеры, которые имеют низкую маржу, которые могут извлечь выгоду из этого предложения, выращивая органические культуры и потенциально будучи связанными с покупателями, чтобы смягчить риски их низкой маржи, а вторым - инвесторы, которые могут получить прибыль от притока капитала в сельскохозяйственную/дефи-индустрию. Мы должны сделать шаг назад в этой части обзора и спросить себя, что на самом деле будет способствовать росту Defi на Cardano? Один из выводов заключается в том, что если мы посмотрим, куда движется сельское хозяйство, то увидим, что местом назначения станет пространство данных Defi и климатических данных. Это связано с тем, что сельское хозяйство - циклическая отрасль, в которой есть неэффективность данных, что приводит к снижению урожайности. Существует также множество фермеров с плохими связями, у которых урожай может быть высокого качества, но тот факт, что этот урожай не покупают, приводит к большому количеству отходов. Цепочка блоков может решить эти две проблемы, с которыми сталкивается наша унаследованная система. Блокчейн делает это, во-первых, предоставляя фермерам рынок для продажи и покупки данных, а во-вторых, рынок, который может соединить фермеров с покупателями в их местных и национальных границах и даже во всем мире. Я думаю, что влияние этого предложения будет наиболее полезным в качестве доказательства концепции, чтобы начать движение в решении этих проблем, с которыми сталкивается сельскохозяйственный мир.", "q0r": 5, "q1": "Я не думаю, что у нас есть какие-либо сомнения по поводу реализации этого плана, так как финансирование составляет 12 тысяч, и это не огромная сумма в нашем общем бюджете, но \"ROI\" или возврат на намерения, как объяснялось в предыдущем разделе, намного выше 12 тысяч. Причина моей уверенности в реализации предложения заключается в том, что 1. команда очень опытная и 2. план сам по себе не слишком амбициозный, так как он направлен на создание \"белой книги\" и в нем точно указано, какое финансирование и время для этого потребуется. Он также масштабируется в прототип и доказательство концепции очень реалистичным способом, включая краткое описание каждого шага, который демонстрирует, где это доказательство концепции расцветет в первую очередь (Гана). Я считаю, что когда дело доходит до предложений, \"жокей на лошади\" является наиболее важной частью, и именно поэтому я приглашаю владельцев Ada ознакомиться с полномочиями команд ниже\r\n Джонатан Кох (директор)\r\n\r\nДжонатан имеет более 30 лет опыта в предоставлении решений в сфере торговли. Джонатан имеет практический опыт работы в более чем 40 программах цифровой торговли/таможенных программ/программ содействия торговле по всему миру. Он является экспертом в области торговых платформ, обычно называемых \"единым окном\", которое является одним из основных инструментов содействия торговле, поддерживаемых Соглашением об упрощении процедур торговли Всемирной торговой организации (ВТО), действующим и ратифицированным более чем 170 странами. Джонатан занимал должность директора проекта по реализации многих проектов по упрощению таможенных процедур/торговли, в том числе в Кении, Катаре и Омане. Он принимал активное участие в консалтинге, выступая в качестве ведущего консультанта правительства САР Гонконг по системе электронной торговли нового поколения. Он был ведущим консультантом правительства Греции и помог разработать национальную стратегию и дорожную карту упрощения процедур торговли. Он также руководил оказанием технической помощи/проведением технико-экономических исследований во многих странах. Он выступал в качестве экспертного ресурса для Экономического сообщества АСЕАН и помог разработать показатели упрощения бесперебойной торговли АСЕАН.\r\n\r\nДжонатан также выступал в качестве экспертного ресурса для различных международных организаций по вопросам упрощения процедур торговли и политики. Он был приглашенным ученым Международного валютного фонда, работал в качестве члена Международного консультативного комитета Сети экспертов ООН по безбумажной торговле в Азиатско-Тихоокеанском регионе (UNNeXT).\r\n\r\nТимоти О'Брайен (директор)\r\n\r\nТим имеет 20-летний опыт создания критически важных приложений, работая в Raytheon, Citi Group, Deutsche Bank, Bank of Tokyo, Danske Bank, Philips Health, Cerner Health, Norwegian Air Continental Airlines и совсем недавно в Google. Тим работает с технологией Cardano с 2019 года и является участником программы Atala PRISM Pioneers. В последнее время Тим уделяет основное внимание тому, чтобы сделать возможности блокчейна доступными для всех. Тим уже 6 лет занимается разработкой блокчейна и руководит компанией по разработке блокчейна, в которой работают более 15 работодателей. Тим является членом Singularity University.\r\n\r\n \r\n\r\nКрейг Янг (советник)\r\n\r\nКрейг известен во всем мире как эксперт в области международных платежей. Как бывший технический директор SWIFT и нынешний технический директор ассоциации Diem Крейг неустанно работает над тем, чтобы трансграничные платежи стали реальностью. Крейг отточил глубокие технические знания, что дало мне уникальную перспективу, когда я продвигался на руководящие должности. Я занимал должности вице-президента и директора высшего звена в глобальных телекоммуникационных и финансовых компаниях, включая SWIFT и Verizon, руководил технологиями, разработкой продуктов, инженерными работами и операциями по кибербезопасности.\r\n\r\nГерхард Эшельбек (советник)\r\n\r\nГерхард считается одним из ведущих экспертов по сетевой и системной безопасности, его приглашали представить свои исследования в области информационной безопасности в Конгрессе США, он также часто выступает на крупных отраслевых конференциях.\r\n\r\nОн был назван одним из 25 самых влиятельных CTO по версии InfoWorld в 2003, 2004 годах, а в 2006 году удостоился этой чести в третий раз. Герхард часто участвует в консенсусе экспертов SANS Top 20, определяя наиболее важные уязвимости безопасности. Герхард также является признанным автором и, возможно, наиболее известен благодаря публикации \"Законов уязвимостей\". Он является одним из изобретателей общей системы оценки уязвимостей (CVSS) и имеет многочисленные патенты в области управляемой сетевой безопасности.", "q1r": 5, "q2": "Это предложение определенно \"дружелюбно к аудиту\", поскольку они установили следующие сроки для каждой части финансирования. Документ в течение 2 месяцев, рабочий прототип в течение 3 месяцев, а затем доказательство концепции в течение 6-12 месяцев. Это позволяет нам отчитываться перед командой за каждый процесс работы над предложением.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposal matches the challenge in that it would create a dApp to support investing in smaller farms with the goal to help the farmers change to a more climate friendly farming.", "q0r": 5, "q1": "I will say here, that the majority of the text of this proposal is about the proposing team and their experience and background. This is certainly great but the idea in itself is very complex and would have benefitted from more content and actionable steps of the project itself and the prior work the team has done. It seems that the team focusses on Africa with this project as this is where they are already working on similar projects. It would have been interesting if the team will be expanding this tool, if the tool will be used exclusively in Africa or if it would be a good tool to adopt to other countries. It would have been great to provide the rationale with a comparison of (government) subsidaries in other countries and the impact that these funds had on emissions when smaller farmers changed to more sustainable farming - it would have been easier to understand the impact, that this proposal might create.", "q1r": 4, "q2": "While it is a great idea, due to the lack of actionable steps, this proposal is difficult to audit and transparency is not as high as in other projects. One of the three references provided in the proposal does not work, the budget is broken down too broadly as is the roadmap. ", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 1, "ng": 18, "nfo": 3, "vca_o": 1, "reply": "Why is writing a whitepaper about a project hard to audit?\nThe product of this proposal are whitepapers. "}, {"q0": "The proposal as-is lacks detail to make a good opinion of what its impact would be. The general idea seems good, but the proposal remains vague on the details enough that it's hard to picture what the mission is, how will revenue be generated, why would investors invest in the project, etc... In addition, the project reminds me of Kiva, a cardano-powered lending platform that is already well established and has been mentioned by Charles Hoskinsons himself on multiple occasions. There is no mention of how this platform is different or better than other lending platforms, and how it would attract users and investors.", "q0r": 2, "q1": "The team is small, but with the right people, it could be possible to achieve this in the proposed timeframe. However, the proposal is light on the details as far as planning go, with only some very high-level targets exposed. ", "q1r": 3, "q2": "The proposal doesn't lay out success metrics, and the milestones are very high-level. Risks and challenges aren't adressed, and the roadmap is vague.", "q2r": 2, "assessor": "z_assessor_318", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n\n "}, {"q0": "The problem is not so much tied to this challenge, but the solution and the success metrics in this proposal fit the challenge setting. \r\nHowever, there has no content in this proposal shows that it will bring any value to the Cardano ecosystem and so on the detailed plan. \r\n", "q0r": 3, "q1": "This proposal only overviews about benefits and features for users only.   \r\nIt lacks all the basic info for assessing the feasibility. Include: \r\n- Detailed implementation plan for knowing what will do. For developing this system, it should add more info about: coding, function, technology support below... \r\n- Detailed roadmap: this proposal doesn't have it. All info that relates to the timeline is their success metrics with a short brief without explanation. \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. ", "q1r": 2, "q2": "The proposal doesn't have a roadmap with detail and realistic timeline. So we can audit this project. \r\nThe key metrics are clear but there is no detail for clearing about them\r\nThe proposal has detailed explanation of the problem and how the solution can address it. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n"}], "solution": "написать \"whitepaper\" с рабочим прототипом, в котором описывается выгодный способ распределения риска модернизации методов мелких фермерских хозяйств.", "experience": "https://www.cardanonocode.com/leadership.html"}