{"id": 367503, "author": "", "title": "Lending platform for africans", "url": "https://cardano.ideascale.com/a/dtd/367503-48088", "category": 26112, "amount": 24000, "description": "Cash flow to conduct  business is a big issue for less wealthy people in africa. Loans are difficult to get and with high interest rates", "f6_no_assessments": 8, "f6_rating": 2.2916666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Access to capital is a problem for anyone without it. What this proposal is missing is the mechanism that would entice lenders in. How will lenders have confidence of getting their capital back in addition to the interest charged? Collateral is mentioned, but this has not been expanded upon. ", "q0r": 3, "q1": "There is no detailed plan on the mechanics of technical side of how this would work. The proposer does not seem to have experience in banking or the technology required to build what is essentially a digital lending platform. There is not detailed budget or breakdown of deliverables. Which countries is it aiming at, are there regulation to be dealt with?", "q1r": 1, "q2": "Without a detailed proposal on how this would be delivered with milestones and timelines it is not possible to audit this proposal. What is success? Key metrics should include volumes lent, default rates, interest rates charged/received etc. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is aligned with the challenge since it aims at the African community, more specifically the West Africa community, to access Cardano lending system using stable coins pegged to local coins. On the other hand, some more information about the proposal itself is missing in order to properly assess the impact of this proposal to the whole Cardano ecosystem. It should mention some KPIs and give some metrics about how to quantify the impact and return on intention of the proposal, and also how to expand and sustain such a platform in the future. Score: 3", "q0r": 3, "q1": "The proposer mentions superficially about his experience but doesn't give more information, like a complete bio or link to LinkedIn, for example, in order to increase our confidence in his ability to execute the proposal. Also, one of the proposal's goals is to create an AMM, which requires a lot of knowledge about development, Plutus and economic aspects, which seem not to be part of the proposer's curriculum. The proposal doesn't mention if he is going to implement the project by himself, or if he wants to hire a team to work on it with him. This information is important not only for us to understand the execution, but also the proposal budget, which is not well explained: it is equivalent to a 3 months full time job for a person, but it is not mentioned in the text what is the roadmap and when the project would be delivered. Also, some risks should be evaluated, for example, what is the minimum required money staked in an AMM to make it viable? Is the number of users of a local currency enough to cover this? Is it possible to integrate physical collateral such as land into smart contracts, as proposed? And how would it be implemented? Some of these aspects should be mentioned and discussed as well. Score: 1", "q1r": 1, "q2": "The proposal lacks a roadmap, milestones, deadlines, KPIs, metrics and the success definition after 3, 6 and 12 months. Regarding KPIs, the proposers could include the amount of local currency staked, number of users, number of different regions using the platform and similar metrics. The budget should also be broken down into smaller pieces and explained, in relation to the roadmap and each step of the development. These components should be added to the proposal in order to make it possible for the community to follow up with its progress if it gets funded. Score: 1 ", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal clearly addresses the Challenge problem but will have a lot more detailed breakdown of the solution.", "q0r": 4, "q1": "the proposal provided unverifiable experience without any reference links .\r\nThe proposal clearly highlighted it success requirements but failed to write any description of how it intends to achieve its success requirements .\r\nAn Example is \"The third component will be a system that prevent overcolateralisation. (Allow peaple to provide real life asset like land or house as collateral may be a solution)\" but the proposal did not state how it will get this implemented and its benefits to Cardano (how will the data get to the blockchain, will it require an Oracle? if yes, who will build it, what is the datasource etc).\r\nThe Cost breakdown seem to over-generalise, it will be good to breakdown individual development costs.\r\nConsidering the above , i do not see this proposal being implemented . It requires more depth.\r\n\r\n", "q1r": 1, "q2": "The proposal lacks clearly defined milestones,Timelines and cost implications .This proposal lacks the necessary details to be audited.\r\n", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "This micro-lending solution with the suggested automated market maker solution fits the challenge. The point of over-collateralisation needs to be thought through. Perhaps collateral types should be automated to ensure that the all participants are treated fairly. ", "q0r": 5, "q1": "No references or links are provided as evidence of skills or experience but this can be developed. The budget is not outlined clearly but this can developed over time. ", "q1r": 4, "q2": "The information provided is not sufficient to audit the progress and success of the proposal. However, this is a good proposal which requires further development.", "q2r": 3, "assessor": "z_assessor_348", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge with respect to a wider adoption of cryptocurrency", "q0r": 5, "q1": "The proposer is an entrepreneur, digital marketing and seo specialist thus this background would be relevant to the management and marketing side of the proposal, it would be informative to voters to include a link to the developer's linkedin/github profile as well.", "q1r": 3, "q2": "Given that a  detailed plan wasn't required at the time of writing the proposal, incorporating one together with a go to market plan would be very helpful as it would help chart the way forward for the finished platform. The proposer's responsiveness to comments is key supporting factor as well. Good job!", "q2r": 3, "assessor": "z_assessor_410", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The problem and the proposal are within the scope of the challenge, but the proposer does not seem to understand the concept of an AMM. AMM-type DEXs do not allow loans, only liquidity pooling and swaps, which makes the proposal unfeasible.\r\n\r\nAs the concept presented does not present conceptual feasibility, there is no way to indicate an impact on the challenge.", "q0r": 1, "q1": "The proposer does not demonstrate to understand the concepts of an AMM and the need for overcollateralization in loan protocols. Projects like Aave, Compound or Liqwid are dapp models that allow loans, but the possibility of loans without collateral depends on credit scores, something that was not mentioned in the rationale.\r\n\r\nThere is no information to indicate feasibility.", "q1r": 1, "q2": "The proposal doesn't present a feasible plan, the budget is not realistic and there are no items allowing  auditability.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Access to loan/ credit a big challenge in Africa, and the interest rate is most of the time very high.\r\nAddressing these two challenges may be very helpful for the African population to run business and for individuals to get easy access to loan/credit for various needs. \r\nThe proposed solution presented through this proposal is realistic, even though the feasibility may be challenging.", "q0r": 4, "q1": "No timeframe, no any mention about the team behind the idea.\r\nTechnically, how will you be able to create that platform, and what part of the funds will be allocated to that work? The questions: how & when are not well answered throughout this proposal. To much information missing to make the proposal feasible.", "q1r": 3, "q2": "The issue presented is real and needs to be addressed, but ways of doing this is lacking key elements to be realistic. Meantime there's no a roadmap on the time period needed to realize this project.\r\nI disagree as I don't see how will this proposal be audited.", "q2r": 2, "assessor": "z_assessor_478", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "It's a great idea but the approach of the proposal is confusing.  To create a Lending platform based on. let's say, a market, we have to create the sufficient volume of supply (lenders or liquidity providers) and demand (borrowers).  More than the stablecoin pegged to the local currency, is the volume of providers of liquidity and consumers of liquidity that stabilizes the system and makes the loans really accesible to the people.  \r\n\r\nThe liquidity providers competes each other for provide liquidity.  If we have the sufficient number of liquidity providers, they will compete to death for provide liquidity and in consecuence, the terms would be set for the market (in this case, the platform) and not for themselves.  But we have to have an atrctive volume of demand (consumers of that liquidity).\r\n\r\nOf course, is in that way how occurs in the real economy but the dinamics are the same in any scenario, including bolckchain.    \r\n \r\n\r\nThe idea is interesting but there is a excesive scarce of details in the definition of the problem and its solution. \r\n\r\n", "q0r": 2, "q1": "-\tThe proposer does not provide information, references or links about the team in charge of the proposal's implementation.\r\n\r\n-\t The proposer does not provide a budget clearly outline and broken down into identifiable items.\r\n\r\n-\tThe proposer does not provide a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\n\r\n-\tThe plan does not describe the resources necessary to implement the proposal. \r\n\r\n-\tThe proposal does not clearly explain technical aspects like architecture, language and tecnologies if they are crucial for implementation\r\n\r\n-\tThe proposer has not considered challenges and risks relevant to a successful implementation. \r\n", "q1r": 1, "q2": "-\tThe proposal  does not present a roadmap with milestones and a time horizon for achievement.\r\n\r\n-\tThe proposer does not present metrics/KPIs that define the success of the proposal.\r\n", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "My solution is an Automated market maker that allows lending and borrowing. With a stablecoin pegged to the local cyrrency.", "experience": "Entrepreneur, Digital marketing, Seo specialist"}