{"id": 368791, "author": "", "title": "Scaling up Tontine", "url": "https://cardano.ideascale.com/a/dtd/368791-48088", "category": 26112, "amount": 30000, "description": "Tontine is a popular way usually for women to raise money for micro-business but they hardly scale up to more than a few tens of people.", "f6_no_assessments": 9, "f6_rating": 1.7777777777777777, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an idea rather than a proposal. The proposers need to connect with the partnership actors they have mentioned to develop a detailed proposal on what they would deliver, how it would be built, how it would interact with Cardano, timelines and costings to achieve this, and the impact this could have.", "q0r": 1, "q1": "Currently there is no plan so it will not be implemented. $30,000 to change habits is not a proposal. What would you do, by when? How would you get people to use it?", "q1r": 1, "q2": "This is not a proposal that can be audited as it has no timeframes or deliverables. It also needs some goals for what it would like to achieve so success can be measured against them. Perhaps volumes of funds lent and measuring the impact these loans have had on the recipients.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has identified a problem but the solution failed to emphasize how the Cardano ecosystem could benefit by implementing the proposal. Even the target audience is defined, there are no metrics/KPIs to measure the impact of implementing this proposal. (i.e. users' participating) The proposal isn't able to scale future challenges", "q0r": 1, "q1": "The proposer doesn't provide evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal (set up a team first and assign roles for each member; identify the experience and necessary skill for each one for the proposal to be successful). The budget is not outlined clearly and is not broken down into identifiable items (i.e.: salaries 2 members x 8h x $5/h x 40days = $6.400, stationery - $500, marketing - $2000 etc.). The proposal does not offer a realistic timetable to complete the work (i.e. stage 1: 1 month - team assembling, target audience define etc.). The plan does not describe the resources necessary to implement the proposal (how many team members, what tools/stationery will be used etc.). No risks associated with the proposal's implementation. (i.e. Tontine tuition could be too much from a set level up ($30) and this could lead to losing audience etc.)", "q1r": 1, "q2": "Unfortunately, there is nothing to assess at this proposal as it lacks to provide crucial information for the plan to implement it. (resources, buget break down and allocation, timetable, risks etc.)", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal goal seems to be to scale-up an already existing method of money raising, especially among women, but it does not clearly correlate it to the Challenge where the proposal is submitted, since the focus is the African continent. It may be related, but it's not possible to evaluate its challenge alignment. Also, the proposal seems to be just an idea, or a 'call for action' as it mentioned, and not really a proposal. So it's not possible to evaluate its impact and other relevant aspects of the project. More information should be added, like a detailed explanation why the project is important, how it would be executed, who would be impacted, how the success would be measured, for example. Score: 1", "q0r": 1, "q1": "Since the proposal is only an idea and it doesn't present a concrete plan, it's not possible to properly assess its feasibility. The proposing team should include information about the project itself, besides a roadmap and a plan, with details about each step and how they would be implemented. Without this information, it's also not possible to compare the project plan with the background of the proposing team and see if they match. The budget should be broken down into more detailed parts and explained how it would be used during the development, and related to the team involved with it. Also, some deadlines and milestones should be included, and some possible risks when executing the plan should also be discussed. Score: 1", "q1r": 1, "q2": "The proposal lacks information to properly follow up the development after it's funded. It mentions, for example, that the money will be used to change the habits, rather than to develop an app, but it does not mention how this would be done and within which timeframe. Some partial deliverables and milestones could be added into the proposal, as well as metrics and KPIs, in order for the community to follow up and quantify the progress. In this specific project, the number of people involved, number of lending rings, number of transactions are possible KPIs to track. Also, the budget should be better explained and broken down into smaller pieces in order to improve the proposal's auditability. Score: 1", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal sounds like a real world application to address the challenge but lacks proper depth on how it will be implemented , how they will go about getting members and other important details to help in properly assess it's impact to the challenge.A more fleshed out version of this proposal will give it a better standing in upcoming funds but at it its current state, i can neither Agree or Disagree that it addresses the challenge.", "q0r": 3, "q1": "The proposal lack any reference to experience in the field for any of the proposers or members of the team.\r\nThe proposal lacks a breakdown of timelines and implementation methods .\r\nIt will be helpful if the proposer has highlighted a step by step process of how they will go about enrolling the women, handling lending defaults, managing bad debts , these are very key to any lending service.\r\nConsidering the above mentioned, i do no see this proposal being implemented. ", "q1r": 1, "q2": "The Proposal lacks a breakdown of costs and timeline which makes it hard to justify the requested amount.\r\nThe absence of a milestone and its breakdown makes this proposal difficult to audit or assess progress of its implementation.\r\nThe Proposer should try to give a detailed breakdown of the execution process and timelines to help better position this proposal in future funds.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge as tontine or chama as it is known in my native country of Kenya is the backbone of the informal lending and saving sector.", "q0r": 5, "q1": "The proposer mentioned that this is a call to action thus I am looking forward to the proposed team, their experience as well as partners and connections in the Ivory Coast.", "q1r": 3, "q2": "While a detailed plan - timeline and budget were not required at the time of writing the proposal, providing one would help voters as well as increase the auditability and success of the proposal. Fantastic idea!  ", "q2r": 3, "assessor": "z_assessor_410", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The problem presented is reasonable and the concept of Tontine loans is related to the challenge, but the proposal is only a draft. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 11, "ne": 2, "ng": 4, "nfo": 5, "vca_o": 1}, {"q0": "The problem statement describe a real issue in Côte d'Ivoire and other African countries. But I missed the how the proposer want to approach the other stakeholders of the micro-lending ecosystem. The proposer should elaborate more about the specific actions to be taken. ", "q0r": 3, "q1": "Key details are missing making an independant audit difficult. But the problematic is real and need to be addressed. The proposer need to elaborate more on his solution.", "q1r": 2, "q2": "Unfortunately the information provided is not comprehensive enough to understand how the proposer want to address the problematic. \r\nI encourage the proposer to explain:\r\n- what is the challenge by not scaling up?\r\n- maybe provide figures (number). For example the average number of persons participating into a specific tontine.\r\n\r\nKey details are missing (i.e):\r\n- Budget \r\n- Roadmap\r\n- key metrics", "q2r": 1, "assessor": "z_assessor_457", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is a great idea and highlights the team members strong appreciation and understanding of African context and cultural norms - demonstrating their attempt to identify a problem within the scope of the Challenge criteria.  The proposal is also a clear value add and positive impact to the Cardano ecosystem and further aligns with the vision that IOHK and the community is working towards in Africa.  Leveraging my experience in the strategy consulting sector, I suggest the following changes to turn this from a strong proposal to an excellent proposal. \r\nFirstly, the problem statement can be improved by rewording it to address a much larger issue - the issue of financial stability and access for women in Africa. This provides a much stronger narrative and story behind your proposal. The ability to scale up a Tontine seems to be a by-product of the much larger issue at hand.  Finally, you would benefit from providing tangible goals/targets/metrics in order to align further with the challenge criteria. This would make it easier for assessors and voters to ensure that proposal is in scope of what the challenge is trying to achieve.  ", "q0r": 4, "q1": "The team appears to have a diverse background and existing involvement with the Tontine communities in Côte d'Ivoire.  Both of these are great starting blocks.  A clear strength of this proposal is the ability to foresee and outlines some of the high-level pain-points that they are likely to face - such as the need for partnerships with traditional actors, changing customer perceptions, etc…\r\n\r\nMy recommendation for a future proposal is to add more detail in the budget breakdown and roadmap section.  The requested funds for $30,000 makes up a third of the total funds allocated for this challenge. Given that amount, I would expect an appropriate level of depth when addressing how this budget is going to be spent. Regardless of how good your idea is, having a detailed breakdown of how you intend to spend the funds will provide a far more compelling proposal for those voting.  \r\n\r\nFinally, I am struggling to understand the implementation path that lies ahead. Both from a commercial, regulatory and technical point of view there seems to be a disconnect between the idea and the activities that need to happen to truly reach your aspired goals. Once again, providing some detail and structure around the next steps / roadmap for this project would give more color and evidence that the project will be successful long term. ", "q1r": 3, "q2": "A key strength of this proposal is the tangible nature of the problem they are trying to solve. In order to improve the proposal even further, I suggest outlining important information such as a roadmap, estimate of key activities to be delivered and details on budget allocation. Further, having alignment with the challenge metrics would increase the change of a successful proposal. For example, the challenge identifies success as launching a micro-lending and Defi dApp within the next 3 funding rounds. Forming a view of a roadmap against this metric would have been a great opportunity of showcasing the linkage to the challenge in an auditable way.  ", "q2r": 3, "assessor": "z_assessor_586", "no_vca": 8, "ne": 6, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "Unfortunately, there is insufficient information to assess whether this proposal addresses the challenge. The proposer should provide a better description of the Tontine process and what is involved, in particular more examples of how Tontine works and it's outcomes would help voters better understand. Additionally, the proposer suggest that this is a call to action rather than a proposal, in this instance, the proposers should try to identify other teams with similar interests and resubmit the proposal in the next fund with more information and a stronger plan to present to voters. ", "q0r": 2, "q1": "Unfortunately, there is not enough information to assess whether the experience of the proposers and the plan presented would even be possible to be implemented. The call to action implies that there is not enough expertise within the team at this present moment to move forward. The proposers being \"well inserted in associative life of Côte d'Ivoire\" does provide some strength to the proposal as they are situated in Africa and likely know the local context, but this does not provide the necessary information to voters. If the proposers resubmit in the next fund, I would recommend outlining the skills and abilities of the team, including related work history, and where there are remaining gaps to be filled. As Tontine has a strong history in the region, providing personal experience in operating such a system, including building the necessary structures to achieve desired outcomes, would help build voter confidence that the team is equipped to deliver. ", "q1r": 1, "q2": "Unfortunately, there is not enough information to make this assessment either. Given that this is more of a call to action than a proposal, there is substantial work outstanding to get it to a point where it could even be audited. If resubmitting the proposal in the next fund, the proposers should include clear milestones and deliverables for the proposal which can be measured against. Also, providing examples of how success has been measured in the past in Tontine relationships would provide valuable markers to work towards; what does success look like and how will voters know if it is successful? Exploring such issues in future iterations will strengthen the overall proposal and increase the likelihood of being funded. ", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "The Tontine could use Cardano to connect and participate to other tontines nation wide establishing multi-scale saving and lending rings.", "experience": "We are well inserted in associative life of Côte d'Ivoire but this is rather a call for action to build a multi-disciplinary team."}