{"id": 366711, "author": "", "title": "Fund 7+8 Campaign", "url": "https://cardano.ideascale.com/a/dtd/366711-48088", "category": 26105, "amount": 12690, "description": "Project Catalystの認知度が低いため、カルダノの開発において未開拓の可能性が多いこと", "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": ["https://vimeo.com/587825954"], "media": [], "f6_assessments": [{"q0": "I agree that such a proposal can effectively address the challenge, yet the outcome is uncertain + comparing to other proposals, the advertisement sector is more challenging. Nevertheless, I believe that advertising can increase the proposer outreach. ", "q0r": 4, "q1": "1. video sample provided\r\n2. relevant experience stated\r\n3. linked in profile posted", "q1r": 5, "q2": "key metrics provided, which can result in measuring the success of the proposal. Definetly, it would be nice to see reality vs expectations once (and if) it is approved by the community.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "This proposal perfectly achieves the main objectives of the challenge, because it will certainly lead to a large number of people with information about the Cardano ecosystem, and thus attract new entrepreneurs. I thought this idea is really great because it dialogues directly with the context of a large part of the world population, the internet, more specifically youtube (in addition to other social networks that the author mentioned). With this, it would not be necessary to attract new eyes to the ecosystem, but the content would go directly to people through paths already adopted by them. When reading the proposal, at first I thought it might not work so well because many people skip ads, but the author explains that the amount paid relates to counting who accessed the content, not considering who simply ignored it. O. Once this doubt is resolved, I strongly believe that this is one of the best ways to attract new members to our ecosystem and strengthen it even more.", "q0r": 5, "q1": "The proposal author is highly prepared to carry out the project, as he has a university education and 10 years of experience in the marketing world. And besides saying that, he attaches a website where we can get to know him better, which increases his credibility even more. Not enough, he also provides an example of a trailer that has already been made by him and his co-worker, which I really liked and I think has done very well what it promised. The author is also aware that he could not do all the work alone, and delegates the audiovisual construction of the project to a colleague (from what I understand they have already worked together), in addition to mentioning, in the financial division, that a certain amount would be invested in design (probably contradict a designer too). In other words, for me everything is perfect regarding the ability of this team to make this idea come true (and success).", "q1r": 5, "q2": "About how the project will happen in practice, I also have nothing but praise. The author details in detail what would be done, how it would be done, through which strategy... We are provided with information about how the financing money would be distributed, and also what would happen in the months following the financing. We are told exactly how youtube advertising works, what other social networks would be included during the outreach, what metrics they use to determine the campaign's success, and what is expected as a result of it. In other words, the auditability is explained in an exact, detailed and totally satisfactory manner.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 9, "ne": 9, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "This is a great proposal, marketing is one of the most important aspect of growth in any Crypto ecosystem. The proposal effectively address major key points and details regarding the strategy and experience used in the deployment of its specified solution.", "q0r": 5, "q1": "There is great transparency regarding the experience and details in the roadmap ecpanding on each point taken to reach its plan. I believe is a great proposal and a good one to increase reach for this particular governing aspect in Cardano.", "q1r": 5, "q2": "I think is a great idea and not much can be added to make it better. Perhaps details about demographics in crypto and the reach focus, but thats a internal project that can be done after the solution is implemented to improve on the process.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the challenge effectively, it will lead directly to engagement from prospective proposers. ", "q0r": 5, "q1": "The team is qualified to do the tasks necessary to complete the project. They have previously completed a campaign and has previously authored a campaign video for Fund 6.  The plan is detailed and feasible.  Based on my marketing background, the budget is reasonable. ", "q1r": 5, "q2": "There are clear and achievable metrics and KPIs, giving me high confidence the project will be an objective success.", "q2r": 5, "assessor": "z_assessor_607", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "有意義な参加と提案の質を高めるために、Project Catalystの認知度を高めるマーケティングキャンペーンを実施", "experience": "大学卒業後、10年以上のマーケティング経験\n\n4年以上の起業家およびビジネスコンサルタント\n\nFunded Fund 5提案者\n\nCatalyst Swarmコアチーム"}