{"id": 366968, "author": "", "title": "WADA Proposer Workshops", "url": "https://cardano.ideascale.com/a/dtd/366968-48088", "category": 26105, "amount": 10000, "description": "多くのアフリカ人起業家は、Project Catalystの資金調達キャンペーンや、コミュニティがアフリカ人の提案を奨励していることを知りません。", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "Effectively addresses the challenge by sharing how they will create an impact and by sharing the past success.", "q0r": 5, "q1": "The past success of the widely successful virtual and in-person Proposer Outreach event shows they are capable of a future conference. ", "q1r": 5, "q2": "The road map and past successful impact shows the WADA team has the tools and skills to create and audit the progress and over all success.", "q2r": 4, "assessor": "z_assessor_263", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "A digital transformation of Africa seems aligned with the Cardano mission, and this 2-day workshop seems aligned well with the outreach to proposers, and in person attendance by those in Cameroon, Nigeria, and Senegal.", "q0r": 5, "q1": "The plans seems straightforward and the WADA team seems well experienced to know where and how to successfully host these events, and how to convey the needed information.", "q1r": 5, "q2": "The proposal directly addresses its impact, feasibility, and auditability well. The roadmap seems well thought of. Overall this seems like an important and needed project. I am concerned about the price tag, and wonder if a one-day event at $5,000 would then provide some, but not all, of the benefits without taking 10% of the campaign's budget of $100,000.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The problem stated in this proposal has its place in the challenge, and the proposer has clearly articulated how the project adds value to the cardano ecosystem. But since that is not the first time they have conducted similar projects, I think the proposer could include the results of any previous campaign. Other than that, the goal of this project to attract bright proposers in catalyst, is aligned with this challenge.", "q0r": 5, "q1": "Since the proposers have conducted similar projects in the past, it is likely that they can do it again. I think that the proposer should include the results of the previous campaign as it would be a great help for evaluting the value of the proposal. Nevertheless, the proposer has provided all the informations necessary for the implementation of this project. This proposal includes details on the team needed for the project. It has a detailed budget breakdown which seem reasonable based on my intuition. A realistic timetable to complete the work has been provided. The goal is precise and the plan of execution is also clear. I think that this proposal contains all the informations that it needs to be implemented successfully.", "q1r": 5, "q2": "This proposal includes a roadmap an milestones for its implementation. Key metrics to track the progress of  the project are also provided. The problem has been clearly stated and the solution is precised. ", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\nYes. The problem is that many African entrepreneurs are unaware of the Project Catalyst's funding campaigns and the community's encouragement of African proposals.\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nYes it does.\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes it does\r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nGoal is educating and engaging local communities to get involved in Project Catalyst. Metrics have not been stated.\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nGoals fall within the scope of the challenge, while metrics are not mentioned. How many collaborators, translators, official guests, speakers.\r\nHow many participants \r\nHow many future events\r\nHow many proposals to be received, to submit to Proj Catalyst.\r\n\r\nThese would be metrics that have not been mentioned.\r\n\r\n\r\n\r\nCan the proposal scale to address future challenges?\r\nIF metrics are identified, and is a success, can be scaled for future challenges. \r\n\r\n", "q0r": 4, "q1": "2. FEASIBILITY\r\n\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nThjey state that they conducted a successful proposer outreach event but the only link given is a Twitter Post. There are no metrics from that outreach, nor any websites, photos, or profiles of outcomes\r\n\r\nAre these links sufficient?\r\nNo\r\n\r\nHave you the CA visited these links and contacted the relevant people?\r\nYes\r\n\r\nHave you been able to assess their level of competence?\r\nNo\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nHe has put forward his regular team. \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nTeam structure is clear\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\n\r\n\r\nIS budget reasonable to achieve the set goals?\r\nThere is no way to determine whether Team costs and On site hosting costs nor Incentives are realistic or reasonable\r\n\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nThere is no verifiable plan if additional funds are required\r\n\r\nHave you verified this plan?\r\nNo.\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nProject Time Table is realistic but not specific enough.\r\n\r\n\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nThe plan is sensible and conductible\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nThe plan states but does not describe resources needed.\r\n\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo challenges or risks have been considered other than general Covid related challenges to having online events. \r\n\r\n", "q1r": 3, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nThere is a general time line but no specific milestones have been stated. \r\n\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nThere are clearly defined metrics such as no of new users, proposals submitted, accounts created, users registered. \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nYes\r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nYes\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNone have been identified other than Covid\r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNot defined.\r\n\r\nAre there contingency plans in place for various outcomes?\r\nThere are no contingency plans.", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "good one, minus a star for the scope (regional/local vs worldwide)\r\n\r\nengaging the community and answering their questions can lead to an increased number of proposers. ", "q0r": 4, "q1": "no objections. WADA team is legit + hosting a workshop can be performed with no complications. \r\n\r\nAlso, they already hosted the event - yet some pictures, videos, or outcomes would be nice to see, not just tweet\r\n\r\nlinked in profile provided", "q1r": 5, "q2": "detailed key metrics were provided in the proposal. I did not come up with modifications or improvements. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree with the Impact level of this proposal based on the following rationales:\r\n1. Problem needing to be solved has been identified and well articulated by this proposal.\r\n2. This proposal fall within the scope of the Challenge Brief.\r\n3. Key Metrics of the proposal which can help measure success  have been clearly stated.\r\n4. This proposal states clearly how it would add value to the Cardano Ecosystem by encouraging entrepreneurs across Africa and Diaspora to bring their proposals to the Project Catalyst for review, voting and funding.\r\n5. The proposal can scale to address future challenges. ", "q0r": 5, "q1": "I strongly agree with the Feasibility level of this proposal based on the following rationales:\r\n1. The proposers have provided evidence (reference links, past success, team data, etc.) of relevant skills needed for the implementation of this project.\r\n2. The links provided are sufficient.\r\n3. I have visited these links and been able to make contact with the relevant people involved and everybody can actually do same.\r\n4. Having look at the past success story of this team, there's enough competence level in the team.\r\n5. A reasonable budget which has been broken down into identifiable items is provided by the proposers.", "q1r": 5, "q2": "I strongly agree with the Auditability level of this proposal because:\r\n1. Looking at the roadmap of this proposal, it's clear that the Project Catalyst can keep track of the progress of implementation when funded. \r\n2. Available Key Metrics provided is also enough tangible information to help define the success of the proposal.\r\n3. The proposal itself provides a tangible workable solution to the clearly stated problem.\r\n4. Difficulties such as Covid19 impact on the in-person attendance of events and follow up on attendees after events have been identified by the proposers and have provided tangible potential solution in the proposal.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}], "solution": "ゲストスピーカー、プロジェクト提案、インタビュー、ライブQ&A（多言語）が行われる2日間のバーチャルおよび対面イベント（各地のWADAハブで開催）。", "experience": "WADAチーム：多言語対応の開発者/トレーナー、イベントコーディネーター、マーケティング、ビジネスの専門家。"}