{"id": 368579, "author": "", "title": "Cardano exposure on Times Square", "url": "https://cardano.ideascale.com/a/dtd/368579-48088", "category": 26105, "amount": 56000, "description": "ほとんどの起業家はコミュニティに馴染みがなく、また、ほとんどのADA投資家は世界的な認知度が低いため、意欲的な提案をすることができません。", "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "An interesting and impactful idea which however involves a high level of input from viewers. They would have to be intrigued enough to search and understand blockchain, Cardano and then Catalyst for the challenge goals to be met. At 56% of the challenge budget I believe the proposal's return is rather low.", "q0r": 3, "q1": "It is improbable that viewers are intirigued enough to go ahead and put in all the additional work required and finally end up participating in Catalyst.", "q1r": 2, "q2": "Impossible to track viewers to actual proposal or ideascale registrants.", "q2r": 1, "assessor": "z_assessor_281", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal can be a good idea, depending of the angle one is looking at it. As a marketer, I can see the value of advertising. I think that the king of advertising stated in this proposal is more effective for a brand awarness campaign. In the other hand, the only way to know if this idea can help onboard valuable entrepreneurs to the cardano ecosystem,  is to test it out. Testing  and measuring the results will be a good way evaluate this strategy. This proposal addresses effectively the challenge.", "q0r": 4, "q1": "The proposer stated being part of a organisation in this field, but failed to give details on the latter. The proposer could also provide previous work, in order to built  more trust on his ability to execute the project.\r\nNevertheless the proposal has a detailed plan and a clear goal. This will surely help make the implementation, an easier process.\r\nI think that if the proposer can provide more evidence on his organisation, implementation should not be huge problem.", "q1r": 4, "q2": "I would love to see at least some KPIs . There is no metrics that can help the evaluate the success of this project. Since the challenge is to find a way to acquire new valuable proposer, on important metric should be the number of expected new proposers that will be join the catalyst program.\r\nOther than that, their is a precise roadmap and a detailed budget breakdown.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 5, "ne": 3, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "as the problem needing to be solved been identified and articulated?\r\nYes. Namely Entrepreneurs are not familiar with Cardano and Investors dont turn into proposers as they dont recognize the value of being a proposer.\r\n\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nYes\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nSomewhat.\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nNot really as there is no indication of how many people it reached, how many were turned into prospects or investors or proposers..\r\n\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nNone are mentioned beyond the output of the spending. Even in that the creative cost of the ad is given as 6000 and the rental of the screen as 50,000. Also the running time each day There are no other metrics regarding what the investment will generate as results.\r\n\r\n\r\n \r\n\r\nCan the proposal scale to address future challenges?\r\nNo\r\n\r\n\r\n\r\n ", "q0r": 1, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nOnly that his organization specialises in DOOH campaigns. No organization FB, Linkedin, Website, Instagram are given. No contact details or Linkedin Profiles of key team members are given.\r\n\r\nAre these links sufficient?\r\nNo\r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nNothing to visit. \r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo\r\n\r\n\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nYes\r\n\r\n\r\nIS budget reasonable to achieve the set goals?\r\nNo. Rental cost is very high, and would be half the budget of this fund. \r\n \r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo plan if additional funds are needed\r\n\r\n\r\nHave you verified this plan?\r\nNo\r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nNo timetable is given\r\n\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nImplementation plan is given.\r\n\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nYes\r\n \r\n\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nTechnical aspects include E-billboard marketing\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo\r\n ", "q1r": 1, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo. There is a vague roadmap but its not showing any details, merely actions which may not prove whether this is effective.\r\n\r\n\r\n\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n\r\n\r\n\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\n\r\nYes\r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nNo\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo\r\n \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo plan proposed \r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo\r\n\r\n\r\n\r\n \r\nOverall those this high budget advertising would work for international brands with huge ad budgets it is not worth to spend 56% of a funds budget on an expensive ad campaign that would be so time limited as well as geographically limited. There is no targeting of interested audiences. There is no way to know how many passers by would look at the ad while they are bombarded with ads from all  sides and above them also.. Of those who look at it how many would pay attention? from those who pay attention how many would think about it and consider investing or proposing?\r\nThis would be a high risk investment with little chance of delivering a positive return on investment.\r\n\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1}, {"q0": "marketing is always a good strategy to increase awareness. \r\n\r\nOn the other hand, crypto.com has advertisement sector covered very well, and yet, it is not doing that well (from he price perspective)\r\n\r\nI am putting minus star, because the outcome might not be as effective as planned. Watching the video, there is too many advertisements, and it can be missed. \r\n\r\nDefinitely a good idea, I think cardano is not having such a strong marketing as it could have.", "q0r": 4, "q1": "watched the video, visited the YT channel, I am strongly convinced that they can deliver. ", "q1r": 5, "q2": "we can audit the videos, but we can not audit how many people joined because of this proposal. \r\n\r\n", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "国際的なアンプであるタイムズスクエアで、インタラクティブなDOOHキャンペーンを実施し、カルダノの認知度を高めることで、グローバルな話題を創出。", "experience": "私たちの組織は、タイムズスクエアを拠点に12年以上にわたり、世界中のマーケターにインタラクティブなDOOHのアイデアを提供してきました。"}