{"id": 368555, "author": "", "title": "SMALL GROUPS BETTER UNDERSTAND", "url": "https://cardano.ideascale.com/a/dtd/368555-48088", "category": 26105, "amount": 13400, "description": "YoutubeやTelegramなどは対人関係がない。お金の話、世界の変化や新しい地平線については、面と向かって話さなければなりません。", "f6_no_assessments": 6, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does not effectively address the challenge. Have the proposal proofread in the future and try to write Cardano correctly more often than not.", "q0r": 1, "q1": "While it's great that the proposer brought 10 more wallets into the ecosystem, there's little facts that make the successful implementation of the proposal plausible.", "q1r": 2, "q2": "No KPIs nor info on how metrics will be communicated to Catalyst.", "q2r": 1, "assessor": "z_assessor_22", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The idea of having face to face discussion is not a bad one. This can be targeted to older generations of over 40/45 years. However, one must note that for operating a wallet and participating in Catalyst, one has to possess at least some technical knowledge. The meeting must be focused equally on theory (concepts of Cardano etc) as on practice (managing a wallet, participating in Catalyst). The proposal talk about these sessions but does not describe how people will be compelled to attend such sessions. A breakdown of the $6,000 allocated to marketing should be broken down and explained. It seems counter intuitive to attract people who may not be as technological to decentralised platforms such as this one which are heavily dependent on non face to face communication. Furthermore, these same people would have to be attracted through the internet anyway.", "q0r": 3, "q1": "Proposal does not define how people will be enticed to attend such meeting or how marketing will be done. Organising the events is easy bit actually having these meetings be successful and finally have attendees participate in Catalyst is another thing. Meeting descriptions do not envisage informing participants about Catalyst. This should be included by proposer as ultimately that is the goal of this challenge. Proposer is declaring up front that he will require additional people due to lack of IT knowledge.", "q1r": 2, "q2": "No information is given on the goals of the project besides leading to 'crypto mass adoption'. This proposal is not very auditable since no clear goals have been established. However, if attendees are tracked and these persons (using email address) can be matched to proposals on Catalyst, this project can easily be tracked. Proposer should clearly show how meetings will lead to new proposers and community participants on Catalyst and introduce a trackign system to track results.", "q2r": 2, "assessor": "z_assessor_281", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "If the goal is to scale the Cardano impact and ampliate its Ecosystem, this proposal isn't the answer because it works in a small amplitude per time. Thinking about that, it would take too much time to see the results of this project. Furthermore, I didn't see a focus of the proposer specifically on Cardano - he seems to be thinking about spread cryptocurrencies knowledges in general.\r\n", "q0r": 1, "q1": "The proposal is well explained, has the budget broken down into identifiable items, the timetable is clear. But I don't think this is a good solution to increase the Cardano impact or make Project Catalyst more visible. It's very hard to make it real in a big amplitude keeping the original proposal in order to generate a reasonable impact. Thinking about this barrier, there are other proposals that are more efficient in generating the impact that Cardano Ecosystem needs with the requested funds of this proposal.\r\n", "q1r": 2, "q2": "The proposer doesn't give enough information about how could the proposal be audited. There are missing some points like clear metrics or KPI's, clear goals about the proposal impact in the Cardano Ecosystem and the milestones that should be pursued by the project. \r\n", "q2r": 2, "assessor": "z_assessor_409", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This idea could be great if it was in the right challenge. Unfortunately, this proposal doesn't address the challenge. I think that educating pleople through meetups is far from creating a clear stategy the will help entrepreneurs entering the catalyst ecosytem an propose new projects to the community. I suggest that this proposal gets included in the adequate challenge in order for it to have more chances to be funded.", "q0r": 3, "q1": "I don't see enough informations about a team that can successfully implement the idea. I suggest that the proposer includes a more precise roadmap as well as detailed breakdown of the budget. All  in all, I think that this proposal could better fit another challenge. In that case, they have more chances to be funded.", "q1r": 3, "q2": "It's difficult to be measure the progress of this proposal as it lacks clear kpis. The KPIs should also in correlation with the challenge in order for it to have a high vote. I give this a 3 in this area.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\nYes\r\n\r\n\r\n \r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nYes\r\n\r\n\r\n \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes\r\n\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nNo key metrics have been stated. Goal appears to be to have live discussions in a location.\r\n\r\n\r\n \r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nNo metrics have been stated.\r\n\r\n\r\n \r\n\r\nCan the proposal scale to address future challenges?\r\nPossibly if the proposal is improved.\r\n\r\n \r\n", "q0r": 2, "q1": "Has the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNo team members are specified\r\n\r\nAre these links sufficient?\r\nNo links given.\r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nThere are no links or people listed.\r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo\r\n\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo\r\n\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nIts been outlined clearly and broken down into identifiable items but the basis for the prices cannot be determined\r\n\r\nIS budget reasonable to achieve the set goals?\r\nIt is high.\r\n \r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo contingency plan is available.\r\n\r\n\r\n\r\nHave you verified this plan?\r\nNo\r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nNo proper timetable has been set\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nIt has a plan as to running the live meetings.\r\n\r\n\r\n\r\n \r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nYes\r\n\r\n \r\n\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nThe technical aspects involve equipment used in live meetings.\r\n\r\n\r\n \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo\r\n\r\n \r\n", "q1r": 2, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo roadmap or milestones have been laid out.\r\n\r\n\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nNot really\r\n\r\n\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nThe solution is feasible but the proposal doesnt tell me how effective its going to be in implementing the solution\r\n\r\n\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo\r\n\r\n\r\n \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo plans are indicated\r\n\r\n\r\n\r\n \r\n\r\nAre there contingency plans in place for various outcomes?\r\n\r\n\r\n\r\nI must also comment that this seems to be a first draft of the proposal. There are a lot of spelling errors even in the name Cardano. The idea is good but the proposal needs more work to make it effective. A lot more thought needs to be put into how to bring people into the meetings, how effective they will be in bringing people in, as well as in keeping them interested and increasing their level of interest and involvement.\r\n\r\n\r\n \r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"q0": "The idea is in line with the objectives of the challenge, because it intends to bring together groups of people to introduce them to the Cardano universe, explaining the advantages of using cryptocurrencies and so on. With that, new entrepreneurs would probably be attracted to our ecosystem. Despite being consistent with what the challenge seeks, unfortunately I found the proposal itself a little poorly prepared. Let me explain: David (the author) does not specify how he would select meeting guests. How is he going to decide who are the right people to call for the event, and furthermore, how is he going to convince them to take the time to listen to a lecture on the subject? It was also not very clear how often these meetings would take place, at one point he states that they would be bimonthly, then every 2 months a new meeting would be created, or the same meeting (with the same contents) would be repeated in this period of time ? Another thing, it is not said how long each meeting would last, if it would be all in one day, nor why the city of Moudon (in Switzerland) would be a good place to hold them. For these reasons, I believe it would be positive if the proposal were revised in more detail, so that we would be able to understand more about its impact.", "q0r": 2, "q1": "The author says he has experience organizing events, which is positive. He also claims to have managed to convince about 10 people to use ada... However, he does not prove, through attached contents or a detailed description of his professional performance, that he has solid knowledge about the Cardano universe. I also thought that he needed to demonstrate his intention to form a team of different professionals who would be essential for the proper functioning of the project, such as: speakers specialized in each subject covered on the day(s) of the event (he talks about this at one point in the proposal, but I didn't understand if they already had people for certain subjects or he just indicated where the speaker would be called); production professionals, such as people responsible for taking care of the environment, monitoring sound, providing water, transport, etc; a group aimed at getting in touch with the people invited to the event... I thought that solid trust was not established in relation to the author's preparation and the formation of a team to carry out the project, unfortunately.", "q1r": 1, "q2": "We have some information about the event, such as what would be the main topics covered and how the funding would be distributed. However, many other important information remained pending. For example, it would be essential to understand how (in detail) the events themselves would happen, from their preparation to the day, how long it would last, how the logistics would be; whether guests would be picked up from where they stayed (and where and where); how the Cardano community could receive feedback from these activities, and so on. I also had the impression that the project itself would be quite expensive for what it proposes, for me it would be valid for the event to be recorded, broadcast, posted somewhere, registered and widely publicized so that it reached the maximum number of people. The author even mentions that part of the money would be earmarked for the communication and marketing sector, but it would be positive if he clarified this information further, what kind of marketing would be done, how, where? Therefore, I believe that the notion of how the event would take place was still too abstract, in need of revision", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "ここ、スイスのムードンで、CardaSatelliteのポイントを作る。将来のアイデアや不安を共有するために、小グループで実際のライブチャットを開催します。", "experience": "多くの人にとって、ライブでの議論はウェブ上よりも自信につながります。私は個人的に、周囲の10人の人々に暗号、ADAへの投資を説得しました。"}