{"id": 368721, "author": "", "title": "Cardano & Enterprise Dev Agencies", "url": "https://cardano.ideascale.com/a/dtd/368721-48088", "category": 26105, "amount": 45000, "description": "カルダノは典型的なスタートアップ開発プログラムやインキュベーターなどには含まれていない。起業家がカルダノの可能性を知らない。", "f6_no_assessments": 5, "f6_rating": 2.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "While it is easy to see that incubators adopting Cardano can have a positive effect on the Cardano ecosystem, the proposal itself does not effectively address the challenge in that it lacks clarity.", "q0r": 3, "q1": "The self-reported info is barely usable in assessing the likelihood of the proposer to be implemented. The proposal lacks details. The budget is not explained and thus cannot be evaluated on whether it is reasonable.", "q1r": 1, "q2": "It is unclear how the community can track progress and how it would be measured.", "q2r": 1, "assessor": "z_assessor_22", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Having agencies will take some doubts away and provide more positive feedback towards Cardano and the whole idea of having access to crypto currencies ", "q0r": 4, "q1": "Given the experiences and attachment provided it highly likely this proposal will be implemented successfully. I believe its in cable hands. ", "q1r": 4, "q2": "I believe some details can be included to aid in a more graphical picture of this beautiful and brilliant idea. ", "q2r": 3, "assessor": "z_assessor_280", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Considering that the idea treats of making partnership with programmes for Enterprise, it's possible to see a good way to atract beginners entrepreneurs to join Cardano Ecosystem because is a complementary relation: at one side we have entrepreneurs that need financial resources to get in the market and at the other side we have Project Catalyst that needs entrepreneurs to join the Project. So this proposal is a \"natural\" way to solve both needs. \r\n", "q0r": 5, "q1": "The budget (that seems to be too much for this proposal) could have been better explained and broken down into identifiable items. It's missing a more detailed plan or a scheme to cite some resources that would be necessary: how many people, how much time to plan and draw the proposal path in reality with metrics and milestones, etc. \r\n", "q1r": 3, "q2": "The roadmap of this proposal could have been better explained to show clear ways to audit its success. Despite that, one possible way to audit it is: to mark how many entrepreneurs are coming to Project Catalyst after participate in the programmes or events of the partners per month, for example. This way it's possible to improve the quality and increse the impact of the programmes or events every time that one of them happens.\r\n", "q2r": 2, "assessor": "z_assessor_409", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\nYes, that Cardano is not taught in entrepreneurship or startup development programmes or incubators.\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nYes, it seeks to bring startups and incubators into the Cardano Community\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nNo it does not necessarily add value to implement this course of action since it seems to be very expensive to achieve an unknown and unquantifiable outcome.  There are other more cost effective and more effective ways to reach entrepreneurs\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n No\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n THe goals fall within the scope but no metrics have been identified.\r\n\r\n\r\nCan the proposal scale to address future challenges?\r\n Possibly if proposal is done in a more detailed manner.\r\n\r\n \r\n", "q0r": 1, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNone are provided \r\n\r\nAre these links sufficient?\r\nNo\r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nNo links or profiles are available.\r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo\r\n \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo \r\n\r\n\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nNo \r\n\r\nIS budget reasonable to achieve the set goals?\r\nIts very high, without any basis or plan to achieve the desired outcomes. \r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo \r\n\r\nHave you verified this plan?\r\nNo \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nThere is no timetable \r\n\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nCardano & Enterprise Dev Agencies\r\nA broad plan of a competition is given but no details on the logistics of it.\r\n\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nNo \r\n \r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nNo \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo ", "q1r": 1, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNone\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nThe problem is clear\r\n\r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nBroadly the solution could work if the plan was more systematic and detailed.\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo\r\n\r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo plan is given", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "Proposals which are more of a local or a regional character are less effective than global projects. Also, this proposal is rather having a character of information spread, and forming teams than directly increasing proposer outreach. \r\n\r\nThere are multiple projects with the same idea, but different regions (vietnam, ethiopia), and it feels that the main outcome is to build community at the location, provide support via information spread, and therefore grow cardano. \r\n\r\nOverall, such a project is a good idea, but regarding efficiency related to the challenge, I do not find it as effective. ", "q0r": 3, "q1": "Stated experience sounds bulletproof, but some links to key members or previous works would be required to verify the competence. ", "q1r": 3, "q2": "information sufficient for audit:\r\n\r\n5 key metrics were provided, which I find sufficient.\r\n\r\ninformation sufficient for the success of the proposal:\r\n\r\nit would be difficult to find out how many proposers resulted from the proposal, also, it would be nice to see some expectations", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "政府系企業開発機関のスタートアップ支援・開発プログラムにアクセスし、起業家にカルダノに触れてもらう。", "experience": "私の会社は、Enterprise Ireland、UNDP、USAIDグループ向けに起業家育成プログラムを開発・提供してきました。"}