{"id": 381256, "author": "sessionizill", "title": "Decentralized Music Platform LatAm", "url": "https://cardano.ideascale.com/a/dtd/381256-48088", "category": 26242, "amount": 30000, "description": "Latin American artists only access to a global music marketplace is streaming giants like Spotify.  They need more favorable options.", "funded": 0, "upvotes": 15844399, "downvotes": 20454490, "votes_result": 4610091, "votes_cast": 117, "f6_no_assessments": 5, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal team intends to solve the problem of upcoming artists being unable to access the global music market via streaming platforms such as Spotify. While this may not be a specific problem to Latin America, it is a widespread issue in the music business, I would agree that if the team can develop a viable way to harness Cardano features, it could be a life-changing solution for the artists and revolutionize the music industry in general. This problem will be solved with a SAAS solution (which is proposed in the DAPPS & integration challenge), and the budget request is for a validation concept of that solution for Latin America. \r\n", "q0r": 4, "q1": "Though the names mentioned as \"partners\", or \"close contacts\" are very important people, and they can be verified without submitting references. The information presented about the proposer is very limited, which limits the ability to verify the skills and experience described in the proposal. Since the purpose of the budget is for the hiring of high-level music executives in Latin America, I can understand that there is no budget breakdown. The hiring of music executives is expected, and although I cannot guarantee their budget is adequate, I understand that these are values that are handled in that context. At this point, for me there is much risk associated with the proposal's dependence on the funding of other proposal. Therefore, I cannot agree or disagree regarding feasibility at this time. I recommend focusing on the \"Dapps & Integrations\" proposal once you have an MVP and evidence of implementation. I am sure that the community will fully agree to allocate resources for testing the concept not only in Latin America, but also in other regions. \r\n", "q1r": 3, "q2": "The author of the proposal mentions that, if funds are allocated, he would immediately contact these executives to make a proposal to validate the concept of the application in Latin America, however, there is no mention of when the community could have the result of this exercise. Based on the main proposal, the first pilot of this application will be completed within 3 months. In that case, I would expect the proponent to wait for the pilot to be successful so that, with an MVP in hand, they can approach the executives and make a formal validation proposal. In my opinion, all of these factors make it difficult for the community to track this proposal. It is also mentioned that a metric of success \"could be\" to reach an agreement with one Latin American record label and have them upload their library of content to the application. I would prefer a metric associated with the number of artists onboarded to the application (who have not yet been able to leverage the benefits of platforms like Spotify) as this is more associated with the stated problem. \r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "While this proposal has the goal of implementing a music program for individuals to use in latin america, I do not quite understand how this project will attract new members to the cardano community. What are the incentives for users of the new platform to use this program over a reputable established service, such as apple music or spotify? Is there something in it for users that they can't get elsewhere? What can this proposal do to better the lives of the people who use it? If the proposer could address some of these questions, it would greatly strengthen the proposal. (score given: 2)", "q0r": 2, "q1": "The proposer has only provided that they have over 20 years of experience in the music industry and that they have a friend managing a big latin american artist. However, this information alone does not give me confidence in the capabilities of the proposer because they did not specify what kind of experience they have with the music industry. Do they know the inner workings of record labels and the streaming business? Additionally, do they have the computer science knowledge to develop a platform for this project? The answers to these questions are not clear in the proposal's current state.\r\n\r\nI also do not know what the breakdown of the funds will be -- they are asking for a big sum of money, so it is important that they provide information on how it will be used.  The proposer could potentially elaborate more on what the executives will do for the project. I understand that they have another proposal in a different challenge, but including some more information on this proposal would help voters better understand this part of the multi-proposal project.\r\n\r\nThere are also not many details in this proposal about the workings of the project. Again, including some information from the other proposal would be helpful for voters.\r\n\r\nOne concern that I have for this proposal is the concept of the charging the wallet a fee per stream. Doesn't this concept punish people who stream more music? If a person were to listen to a significant amount of music and then have to pay a fee each stream, they would effectively drain their wallet of funds. I can't see people getting behind this business model. (score given: 2)", "q1r": 2, "q2": "The proposer has provided no good metrics to measure the success of this proposal. I did not notice any KPIs provided in this proposal to help voters have confidence in the project's auditability. I do see that the proposer linked their other proposal that is connected to this one where they listed only one key performance indicator: getting def jam on board. I do not see this as a viable KPI because it is so incredibly variable. One singular KPI that relies heavily on the decision of a group of individuals cannot be a reliable measure of success -- it either succeeds or fails with no possible in between. Thus, I would encourage the proposer to find some other KPIs that can help the cardano community audit the proposal and have more confidence in it. (score given: 1)", "q2r": 1, "assessor": "z_assessor_310", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The Problem being LATAM artists having only access to global marketplace and need for more favorable options. The proposer has crated two proposal in one they wants create a Direct to consumer music streaming platform for record labels and In another they would want to onboarding Latin American Music executives.  In this proposal they would like to focus this proposal onboarding Music executives. Both these proposal together does addresses the problem", "q0r": 5, "q1": "Based on the details provided the proposer and their has required experience to create the music streaming platform and make it work by onboarding Latin American's artists.\r\nThe proposer have given a complete plan and steps they will be taking. This proposal can only be executed once the streaming platform is ready. ", "q1r": 4, "q2": "The proposer has given a timeline and have set goals to achieve within the mentioned time period but in another proposal. It would have helped a lot to audit the proposal if they had provided a detailed budget breakdown, Key performance metrics and roadmap with milestones in this proposal. Therefore the details provided in this proposal won't be sufficient to audit the progress and the success of the proposal", "q2r": 2, "assessor": "z_assessor_419", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal will specifically focus on showcasing LatAm artists. This is a very good project that will solve an immediate need quickly and simply, so it will have a pretty big impact. The proposal is a great idea to build a Direct Consumer online music player for record labels. The given solution completely solved the problem.", "q0r": 4, "q1": "Proposal lacks information to properly track development after funding. The proponents do not provide any information about their skills and experience. I don't see the members' biographies so I can't judge the group's abilities\r\nThere are no obvious risks identified in the documents provided. Since it's not possible to test the proposal, I'll give it a 2, even though it's a great idea. Hope to see your recommendations for funds later with a more complete, positive recommendation that we can easily test", "q1r": 2, "q2": "Multiple smaller milestones within each core milestone will indicate more confidence in the expected delivery to be successful.\r\nI want to see the budget broken down into monthly spend, and I want the team to connect KPI milestones and roadmaps with spending, specific tasks and tasks that employees must deliver and when they must. assignment - this analysis will give a clearer indication of the feasibility of the work done and matching the delivered products with the labor cost. A budget is given but without any explanation of how the budget will be used. Therefore, it will be difficult to audit\r\nAlso no KPIs are presented. To better understand the project better to add your focus KPI (number of fans/listeners, singers, artists) engaged in your app", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 21, "ne": 4, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "To make a fair review of the proposal at hand, the idea is really interesting and addresses a special class of people, the artists, and musicians. However, the proposer makes no point over here regarding the impact it could have on LatAm as a whole. With the likes of Spotify and other huge giants who already allow people to publish their works, the additional impact this particular proposal could bring is not something to look forward to. Moreover, the proposer also makes it clear to have submitted a proposal based on the same application in another challenge, which seems like a better match to the proposal. And how exactly would this Dapp uphold the strength and capabilities of Cardano in particular? And why make a music app that is decentralized? What are the vulnerabilities that the current music apps face having been deployed under conventional networks? With the above doubts, I strongly believe it's quite difficult to measure the impact of this proposal on the LatAm people and on the Cardano ecosystem.", "q0r": 3, "q1": "The detailed plan the proposer provides in the attachment makes complete justice to the proposal under the \"Dapps and Integration\" challenge, but fails to provide the readers the insights into how the additional funds will be required and why need it now? There is also no visible roadmap nor a viable team experience under the proposal. I strongly recommend the proposer provide more details regarding the marketing and publicity approach that requires 30k USD for the community to gain trust and credibility in the project. I would also suggest that if funded in the other challenge, the progress using that could be shown during the further funding rounds so that it adds more value to the 30k being requested now and makes it easy for the community to decide on it.", "q1r": 2, "q2": "The only KPI that the proposer mentions is to sign up 1 Latin American record label and onboard their entire library of content over time. Apart from that, there are no measurable metrics that will provide the auditors the information about the quality, user experience, acceptance rate, number of active users, the outreach of the application. And the metrics provided tend to be a little off compared to the essential metrics of the challenge that measures the increase in traffic across LatAm that comes together to provide more contributions to the Cardano Ecosystem. Thus, I feel this proposal would have been a winner had it been submitted in other challenges such as \"Community events\" or  \"Miscellaneous challenges\".", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "We'll build a Direct2consumer music streaming player for record labels. This proposal will focus specifically on onboarding LatAm artists.", "experience": "Over 20 years in the music business. My friend has years in the biz specifically in LatAm,  managing a huge LatAm artist, Anuel AA."}