{"id": 381777, "author": "vilela", "title": "Cardano Training & Complex Networks", "url": "https://cardano.ideascale.com/a/dtd/381777-48088", "category": 26242, "amount": 14025, "description": "Brazil is a nation in Latin America, and our students, professionals, and entrepreneurs are still unaware of the Cardano Blockchain Network.", "funded": 1, "upvotes": 41958864, "downvotes": 13231604, "votes_result": 28727260, "votes_cast": 154, "f6_no_assessments": 7, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is perfectly aligned with the objectives of the challenge, because the idea is to create a course that can teach professionals in Brazil about the Cardano blockchain network. In this way, it would certainly benefit the ecosystem a lot, as it would bring on board several new and capable members (we know that Brazil is the greatest South American power and that there is a lot to be done there, but what is missing is precisely that, appropriate instruction). And also, obviously, the country, as it could generate a lot of job offers for several professionals who suffer from the country's financial crisis, which was intensified mainly after the pandemic - several qualified professionals have been employed and have a lot of difficulty in finding opportunities. It's very positive how the author determines exactly who the project's target audience would be, which demonstrates a very important sense of reality, he knows what he's going to do and who he's going to do it for, this generates an essential guideline, which I'll comment better in the next few topics. It also outlines some topics that would be covered in the course so that we have an exact preview of what would be working here. It also determines the total duration of the course, generating a good sense of time for us. And most relevant of all is that the course would be free, that is, we can all participate, which breaks down social barriers and fully benefits the Latin American location. In general, I don't think I have anything to criticize about the impact of the proposal, it's something that perfectly meets what we're looking for in this challenge.", "q0r": 5, "q1": "Speaking of teams, I believe the entire project would be carried out by a single person. I really liked this idea, but I think it would be better if we had a group here. The author, who would give the course, is undoubtedly very capable, being a PhD in physics, a professor at a Federal University in Brazil, and so on. But it would be interesting to better understand the direct relationship between him and the blockchain Cardano. How did he find out about the project? How long have you been part of the community? What, exactly, does he develop around here? I would like such doubts to be resolved. I think it would be important to hire two professionals here: a designer, to prepare the visual content of the course and also the graphic promotional pieces, and someone from marketing, in order to weave communication strategies that would make the course have a wide reach of public. As far as the script is concerned, this part is perfect. The author divides the activities based on each month, from 1 to 6, and each month is well explained in topics. What would happen and who what order, so that we have a full understanding of the process, leaving no gaps. Monthly explanations are also accompanied by the cost of firing each month, which also makes the budget yield very plausible. So the only part I think could be improved is to clarify the author's connection with the Cardano ecosystem.", "q1r": 4, "q2": "I believe it is an easily auditable proposal, and I will tell you why. The author provides us with a very well-worked script, extremely accurate and full of details. Through this, we can monitor exactly, each month, if what was promised is being done. I advise that it should be done by members of the Cardano community native to Brazil; in this way, there could be a direct dialogue between the community and the author, and a progressive follow-up, in order to monitor the process and not just the results. But, talking about them, it is important to emphasize the impact of this course on the local population. This part, in my opinion, should be done by the author himself. A kind of post-course data survey, in which he would get in direct contact with some of the students, to receive feedback both on the quality of the course and its impact on their practical life. Did these teachings open doors? If yes, which ones? Do those involved intend to be active members of the Cardano community, either through Catalyst or working as blockchain developers on various proposals? This type of data could be collected and passed on to the community. With these two analyzes together, I believe it is entirely possible to audit the proposal in a very proper and safe way.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 12, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Although there are other proposals with similar obvjective, It's good to have more options of Blockchain/Cardano courses in Brazil as this subject is not so commonly taught in the whole latin american, so its a valide proposal addressing the challenge. I also liked it will be offered both online and face to face and that the course will be free. these things combined help to expand the reach of it across local coomunity and the whole country.\r\nIn general, the proposal is well strucutured and well written.\r\n\r\nIt would be nice to see it mentioned here the number of students it is intended to have (both online and face to face), to assess better the impact and quality, and its recurrence (whether it will be offered once, or more times a year).\r\n\r\nAs further suggestions, I'd try to detail more the communicaction plan/strategy to engage students in Brazil as a whole (I liked though that the target audience is already mentioned). I'd add here some focus on trying to attarct low income students as much as possible; It will be in line with UN SDG 1, 4, 8 and 10 and increase proposals appeal.\r\n\r\n\r\n", "q0r": 5, "q1": "One already commited person with educational experience and knowledge in blockchain seems to be enough to run this project, with no need to extra hirigings. Its rpossible to verify these credential with links and information provided.\r\n\r\nThe plan is solid and time-framed with a planning, implementation, operation and finalization part. the budget is fairly distribuited across project phases, I'd just try to roughly say in which itens of the phase the money is being spent on (materials, paid hours, infrastrucutre, research, communication and so on).\r\nIn general, the project seems really feasible.", "q1r": 5, "q2": "Milestones can be extracted from the plan but the most important ones should be better highlighted. What was called \"milestone\" in the proposal is actually more of a description/goal of the project phase than proper a milestone (an important/key point in schedule with zero duration) itself.\r\n\r\nTheres no numeric metrics proposed - What is called KPIs/indicators here in the proposal are actually activities in the project.\r\nAs suggestions of true metrics, it would be nice to measure the number of people reached in communication, the number of students engaged/registered and the quality of the course (it could be measured by a NPS, for example, at the end of it or a survey with students). They should have some targets to fully assess how successful the project was.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea that would help the Cardano ecosystem to expand and would certainly add value in that way. Especially when it comes to students, professionals, and entrepreneurs. The proposal clearly shows how the Cardano ecosystem can expand its community and what the impact would be. The current problem in Brazil is pointed out, and that is the no knowledge of the Cardano  Blockchain Network, but it also offers an excellent solution to this problem. KPIs in the proposal match the ones indicated in the challenge and yes proposal is able to scale future challenges.", "q0r": 5, "q1": "In the proposal we find a link to the website with all the necessary information about the person behind this project. We can conclude that the course will be led by the person behind this whole project but the question is whether it will be feasible individually or a team is needed? In the detailed CV we can't find the necessary experience, skills and knowledge that the lecturer should have. The budget is clearly presented but it would be much better if it was divided differently. Maybe to require half the budget in this Catalys F7 and half in the Catalsy F8. Holding a lecture for 6 months is a challenging job and is not a safe investment. But if they had a 3-month lecture, it would be easier to follow the development of the project and influence the improvements. There is a detailed implementable plan and it is very well developed as well as details of actionable tasks and order of execution are presented. The proposal offered a timetable to complete the work but in my opinion it is not realistically presented. As I already said there could be a much better brake down budget but also a time frame from 6 months to 3 months of lectures. We can find in the proposal a clear explanation of technical aspects and technologies for implementation but there is a lack of insight into possible risks and they could be especially in online workshops. What if the students don't come? It would be good to address the possible risks.", "q1r": 3, "q2": "The proposal does not have a clearly defined roadmap in terms of date or for exmaple (Q1, Q2, Q3) when the course will take place. It has already been presented in 1 month and up to 6 months. KPIs are well presented and developed and it is very easy for the community to follow the development and success of this project. Especially if every course is going to be recorded.", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 18, "ne": 7, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal stands out for its ambition, professionalism and clarity. Boosting the Cardano ecosystem would be achieved by associating the blockchain with high-quality scientific content in a country that values academic achievement and looks up to its teachers and researchers. By moving cryptocurrencies in general and Cardano in particular out of the realm of a tool for speculation and into the curriculum for higher learning, the continent's view of Cardano will indeed grow. The bilingual presentation effectively demonstrates the proposers ability to combine regional focus with the ethos of Cardano and Project Catalyst.  ", "q0r": 5, "q1": "The proposer seems to be uniquely placed and qualified to fulfil the challenge brief and proposal roadmap. The timeline and milestones appear to be realistic and modestly priced, and the milestone goals build upon each other in a coherent, logical and convincing manner. Although the proposer does not seem to have direct experience with content creation and social media campaigning, this should be possible given the ability to structure and delegate demonstrated in the proposal.", "q1r": 5, "q2": "Presenting the roadmap in the format of six monthly milestones will help to audit the proposal. Performance metrics could be geared more towards successful community reach, mentions, social media likes or other such measures of interaction. The thoughtful presentation and suitable profile of the proposer mitigate some of my concerns in this regard, but more focus should have been given to distribution of quality content as opposed to simply creating.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is about developing a solid blockchain-complex networks framework for Brazilian audience (university students, professionals, enthusiasts, and entrepreneurs) in Brazilian Portuguese, and introducing them to the Cardano blockchain technology (for free). It is clearly within the challenge and valuable to the growth of Cardano ecosystem. It is also able to scale to address future challenge (to widen out of the region, multilingual, to help users around the world – for example).\r\nDue to strong points above, I strongly agree this proposal is impactful.", "q0r": 5, "q1": "The proposal provides a link which is fulfilling details about the proposer to prove he has skills and experience to implement the proposal.\r\nThe budget is devided fairly ($2337 each month in plan 6 months) but not clearly broken down into identifiable items. I understand from month 1 to month 5 KPIs are materials and lessons, so it might be difficult to split costs. However, identifiable items in month 6 should be explained more details and have their costs so that readers are more easy to assess the proposal's feasibility. \r\nBesides, I would like to be more understandable about this statement in the proposal: 'budget already includes an Overhead of USD 2,000 used to cover indirect costs and improve the computational infrastructure used for scientific research in our institution Universidade de Pernambuco' because due to my calculation $2337 x5+$2340 = $14025 total the budget and I cannot find where is $2000 mentioned above. I recommend the proposal should be more details in the finance section.\r\n I also recommend the proposer should consider challenges and risks relevant to the successful implementation.", "q1r": 3, "q2": "The proposal has a roadmap with milestones and time horizon for achievement.\r\nMetrics/KPIs is included clearly to be audited. However, it will be difficult to audit in month 6: I m not sure these items in month 6 milestone are KPIs or not – the proposer did not mention KPIs as he did from month 1 to 5. ('1.Grow Cardano, Grow Latin America', '2. End of course with a Cardano Blockchain Network Online Event', '3. Preparation of the final report') If they are KPIs, they are so difficult to be audit the success. If they are not, so where are the Metrics/KPIs in month 6 to be audited?  Therefore, I recommend the proposal should add more details to be audited month 6 easier.", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Providing course to promote Cardano and its consensus protocol is a great way to raise awareness about Cardano ecosystem and therefore we can attract more member to our community. It is a traditional method but still very effective to PR for anything. With currently pandamic situation, online course is suitable. ", "q0r": 5, "q1": "He has many experience in researching. The course is planed well with detail timeline. I minus one star for the risk that he couldn't attract many students to his course or his ability in speaking/teaching is not good. However I assume these risk is small. ", "q1r": 4, "q2": "The Roadmap and KPIs are very details and easy to track. He splits the plan into phases and lists the action/target topic will be conducted on each phase.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This idea is absolutely great! Brazil consists of the 1/3 of the whole Latin America population and still is not informed about the blockchain technology and how much more about the Cardano network. A completely free online course about all the concepts regarding Cardano would be a step to bring a lot more people into the ecosystem. It would surely have a positive impact on the Cardano ecosystem, as the KPIs match the ones indicated in the challenge. ", "q0r": 5, "q1": "The proposer has a remarkable number of publications and so does have the experience to make this idea successful. He also provides the links to verify that and all of his experience and publications. The proposer by themselves will make the idea come through so there aren't any team mates taking part in this. The funding will be for the course to be a success. There is a fully detailed implementable plan for this project and the timetable seems quite realistic.", "q1r": 5, "q2": "The proposal has a roadmap with milestones and a time horizon and cites every single stage of the course with the budget that will be needed for each stage. There aren't any metrics to measure the success of the proposal. What could be a metric, is how many participants the course will have and how many of them will complete the course successfully. That is probably how the progress of the proposal can be tracked. Would the proposer also provide the success metrics, this proposal would be absolutely exciting!", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 18, "ne": 1, "ng": 15, "nfo": 2, "vca_o": 1}], "solution": "Promote Cardano and its consensus protocol through a comprehensive online course about Complex Network Theory and Blockchain Technology.", "experience": "I'm a Physics Ph.D., Cardano enthusiast, university professor and researcher in complex network science and consensus formation mechanics."}