{"id": 383175, "author": "matifalcone", "title": "Grow ALDEA, Grow Latin America", "url": "https://cardano.ideascale.com/a/dtd/383175-48088", "category": 26242, "amount": 24780, "description": "Despite having created a community to drive Cardano adoption in Latin America, massive growth and outreach is still very hard to accomplish", "funded": 2, "upvotes": 53148830, "downvotes": 4471579, "votes_result": 48677251, "votes_cast": 200, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea in this way a little that are promised and proposals for proposals to increase the group of activities called in parallel, all the proposals designed in large groups of activities, the number of students with diversities. The team exemplifies some of its achievements so far and argues that it needs funding to continue carrying out activities and developing new projects. They provide a little history of what has happened so far and explain what would be done in each part of the ecosystem (twitter, telegram, instagram and etc). I can't really define my opinion, I believe the impact will be positive, because once new projects are created and existing projects are perpetuated and improved, the Cardano ecosystem will certainly benefit. However, in relation to Latin America, specifically, this relationship is a bit abstract. It is true that it is a DAO from Latin America, but it is not very clear to me which countries are worked here, who are the people involved, how, exactly, they are benefited... I am not saying that this proposal is not in line with the objectives of the challenge, because it is a Latin American group carrying out various activities that would promote Cardano in that place. The problem is precisely that there are many activities, many different things happening on different platforms, so that it is not so possible to deeply understand each one of them. I cannot visualize exactly the gains that would be obtained. Perhaps the impact would be clearer if, in addition to listing the activities carried out on each platform, the proponents explained which groups of people would be involved and how they would benefit individually. In general, there is a lot of information that is confused, in my opinion, and does not generate a full understanding of the impact that would be generated for the continent and for Cardano.", "q0r": 3, "q1": "About the team, I think that during the description of the proposal it is not very clear who they are and what activities they develop. However, in the end, they attach linkedin profiles, but the best way to get to know and understand each member was through the website provided (https://www.aldea-dao.org/about-eng.html). There, we have individualized information, photos and a short description of each team member, which, together with linkedin profiles, generate a great and deep understanding of the team, thus ensuring confidence in their work. However, it would be important, in my view, to understand who exactly would do what. As I mentioned in Impact, it is a proposal that encompasses a number of things: varied and diversified activities. What would each of these members do? For example, on the youtube part, they promise the following: \"create simple animated educational videos explaining the main concepts of blockchain and Cardano\". Who would? As in the example cited, they could have informed who would be pending for each of the other tasks. In this way, we would have a full understanding of who would do what, which would generate a more organized perception of the process. And speaking of process, we are not provided with a detailed roadmap. Again, I say: because there are so many activities and so different, it would be important to organize some steps to be carried out. For example, phase 1: focused on youtube and linkedin (hypothetically). Person \"X\" would do activity \"Y\" to get result \"Z\". What we have are the expected results for 3, 6 and 12 months (I'll talk more about this in auditability), but that's not an explanation of the process. That part leaves something to be desired, unfortunately. It is always essential to understand the parts that make up the whole, especially when this whole is so complex, as is the case. And finally, speaking of funding, I believe this part was very good, they share how the money would be used according to the platforms. For example, we know how much it will take to promote \"Twitter, Instagram & Telegram\" activities, and why that amount is required. In the same way, it is understood how the other parcels would be used. In short, I believe that in this topic what was most needed was the presence of a highly detailed script. Otherwise, we have a lot of confidence in the team (although it could be better directed who would do what) and a great understanding of the budget.", "q1r": 4, "q2": "I think it's a very auditable project. As the proponents themselves state: \"the key metric here is how much DAO grows and community participation in its future iterations.\" We need to monitor how the public is engaged in the various social networks and whether, as a result, new Latin American members are entering and remaining active in the Cardano ecosystem. My suggestion is that the team itself take charge of collecting and analyzing such data; these data must, of course, be disseminated in a simple and direct way to the rest of the Cardano community. Some infographics could be made, some visual presentation that would gather data from a certain period of time (monthly would be great, I believe), and such graphics should be sent to the community, either through participation in a Town Hall or some community members could be selected to promote such monitoring. It would be interesting for the proponents to create a detailed roadmap with the phases to be completed, oriented in time, so that we could analyze the process and not just the results. As it is already a very active and experienced group, I believe that they are capable of gathering the promised information (data from the media), creating new qualitative facets that would increase the quality of this follow-up and establish a bridge between them and the community, in order to disseminate the results.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 25, "ne": 14, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is within the objectives of the challenge. It is important to have financial resources to make ourselves known as a community. The problem that ALDEA has not yet defined is what it wants to do as DAO. If you are going to advertise something, you must have that something.\r\nI can contribute an idea, maybe you could produce and finance a documentary about blockchain and CARDANO or its history or something similar, or a short film. It would be excellent publicity.", "q0r": 4, "q1": "The experience is proven and we can meet the people behind the proposal. I believe that creating broadcast content would help us to make our niche bigger and bigger in LatAm. Clearly, if the objectives are achieved, it would generate an impact in the community in general, attracting new participants.\r\nThe project is reasonable, but it is important that we know the productions, perhaps in their next \"Iteration\" they will decide to create a specific site for \"grow aldea\" where we can know the progress of their productions.", "q1r": 5, "q2": "The project is perfectly auditable, both during and at the end of the projected term. The team members are well-known people in the community and participated in Fund 5.\r\nThey have a website and a community, which we must take care of and make it grow.\r\nI could see that on your website they only mention Fund5 ....., this interesting proposal must have a place in ALDEA.\r\nGreetings", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses correctly the challenge, given though ALDEA's growth in social media will potentially make Cardano's latin american community grow as well, especially if they generate quality content about Cardano's ecosystem in practically all social medias, as they're planning to do.\r\nALDEA's marketing onboarding proposal could potentially grow extraordinarily the Cardano's hispanic community in social medias, and attract a lof of newcomers to its ecosystem, which is lacking of good-quality content through various social media platforms for the time being, and \r\nI think there's a demand of such content.\r\n", "q0r": 5, "q1": "Regarding team experience, ALDEA's core team have a wide range of IT and business expertise, and has shown a long-term community commitment with Cardano's project. However, it's not completely clear to me how each participant mentioned in the proposal will get involved in each role, and what are the professionals that they'll onboard for these marketing campaigns across various social medias aside from the CORE team (but I imagine they'll reach out to community members once the project get funded).\r\nApart from that, the plan details are well described and there's a clear road to follow for how approach each social media.", "q1r": 4, "q2": "Budget breakdown is well detailed, and success for the project is described through a 3-6-12 months period. KPIs are also displayed by the team, and it'll be clear if they succeed or not, given that all the platforms in which they'll promote the DAO have built-in metrics and analytics to measure its growth. So the auditability part is in place in my opinion.", "q2r": 5, "assessor": "z_assessor_833", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "While the general idea behind this proposal is well aligned with the challenge metrics and the plan is well described, I feel like this entire project is a bit too broad and tries to cover too many areas without going in-depth into any of its branches. I cannot find an exact suggestion at the moment, but I do commend this proposal, and I hope the team will be able to find the core that will make their project unique.", "q0r": 4, "q1": "The team have taken the time and care to craft this proposal. From the details of the plan, one can tell that this is indeed a long-term project that has already come a long way. This, coupled with the team’s prior experience and skills lead me to conclude that this proposal can be successfully implemented.", "q1r": 5, "q2": "The proposal has carefully included all the required self-assessment checkmarks and detailed each sufficiently. The budget is sensible and comprehensive. While the metrics are clear and easy to track, as the proposers mentioned, more important is the quality, not quantity of their metrics and that will be harder to assess, but not impossible.\nAs such, I can safely presume that the project can be easily and successfully tracked by the community.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 24, "ne": 2, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "The concept of using a DAO to drive cardano adoption in Latin America might seem like a great Idea and if implemented well can Impact the ecosystem. The Team is already collaborating with other SPO and Developers in Latin America which shows their passion towards building a vibrant community hub for that region. I could see how their effort can be used to  onboard new users to the cardano ecosystem. In my opinion , I believe the problem statement and the solution can be improved  to capture and articulate  the Idea very well.  The problem statement recognises that there is an ongoing effort in solving the problem , one would expect the proposed solution to bring in a different approach to solve the same problem. I believe the concept of DAO is that different approach ,  I am Assessing the Idea itself and not how it is structured .", "q0r": 4, "q1": "The Team plans  a 12-months Communications and Inbound Marketing across major social networks with great details in each of the networks. What is lacking is an actionable step by step roadmap to achieve this plan. How many weekly posts to expect in each of the social media? How many Youtube videos and medium blog posts?\nThere is identifying information about the members of the team and experience , I have checked the team website as well for other information , I believe the Team has what it takes to complete this project.\nThe expected public launch date is defined. In general , it's a good Idea and the plan could be improved to increase the feasibility.\n", "q1r": 4, "q2": "The definition of success is defined for 3 ,6 and 12 months. Using quantitative metrics like specific number of followers & subscribers  in 3 months would have greatly improved auditability.\nit is not clear which deliverables will be delivered in the 3, 6 and 12 month periods.\nI like the strategy and the 12 month marketing plan and would also love to see risk evaluation.\n\n", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "With an aggressive comm. plan to reach out using media platforms, ALDEA will bring key players to the ecosystem and be ready for the future!", "experience": "ALDEA Core Team, FALCO SPO & ALDEA Community"}