{"id": 384240, "author": "livingwaters.cr", "title": "Living Waters Costa Rica", "url": "https://cardano.ideascale.com/a/dtd/384240-48088", "category": 26242, "amount": 10000, "description": "There is a lack of exposure of the Cardano ecosystem and its benefits in the Latin American Community", "funded": 0, "upvotes": 16179603, "downvotes": 19174543, "votes_result": 2994940, "votes_cast": 117, "f6_no_assessments": 5, "f6_rating": 2.8666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is a bit confusing. It is understood that the objective would be to cultivate a space and carry out several parallel projects in it that can benefit from the Cardano ecosystem in different ways. However, the idea is very big and it's not detailed, I didn't understand where, for example, growing mushrooms and raising fish would interfere here. Honestly, the part that made the most sense to me was the restaurant's reactivation, as in this space the authors intend to accept an ADA as a form of payment and also promote debates about the ecosystem. Right, but this, at no time, aligned with the specific objectives of the challenge; we are trying to finance projects that are especially beneficial to Latin America, its inhabitants, its microeconomies. I believe that the fact that this location is in Latin America would be where this benefit would be, but I felt the lack of initiatives that stood out in the local context, beyond the limits of the farm. It seems to me that the project is a very good beneficiary of this undertaking, but what about the territory beyond its perimeter? It is not clear what the exact location of this farm is, from the title we know it is in Costa Rica (but we have more details), who would be like people who would be responsible for each project, which groups would be working, if it would be 100% open to public or just on specific days... Unfortunately, there are many details that remain uncertain, ill-defined, I cannot understand the impact that this proposal would have for Latin America, in particular. And with that, I don't think the proposal meets the challenge's prerequisites well.", "q0r": 1, "q1": "About the team, we do not have clear information. We don't know who they are; what their names, professional roles, what role each person would play in the project in a specific way, a small curriculum of what they have done so far, how they got involved with the Cardano ecosystem. The authors cite in the relevant experience part some areas of knowledge in which they work, such as engineering, agriculture and 3d (design?), but this is done in a very superficial way and without a context. That is, who is the engineer? What did he do, what would he do on the project? It would be necessary for us to know the team in a complete way, in this way, the necessary confidence in their preparation to carry out this project would be transmitted. Regarding the timeline, there is a script here that explains, in phases, which activities would be carried out. They are concerned with giving details and enumerating objectives, so that our understanding becomes more palpable. What worries me is that each of these phases represents something very unique, that is, it represents as if it were a kind of mini-project within the project. For example: one phase is about the opening of the restaurant, but we would need to understand a lot of details about that. Since what kind of conversations would be promoted here, what specific issues within the Cardano universe, how often these debates would take place, who would be called to such meetings and much more. In other words, understand each part of the whole well. The same happens for the other stages of the project, each one is unique and full of richness, generating the need for a detail that unfortunately does not exist. And the same thing happens with the budget division; some topics are given, but lack detail. When they ask for $4K to build the pool: why? Which professionals would be working here, doing what tasks? In the \"time and expenses for retail customer integration\" part, what expenses? It would be essential that they specify what they are talking about.", "q1r": 2, "q2": "During the script, the authors establish what the specific objectives of each phase would be. This is very positive and helps a lot in the auditing part of the project. I believe it would be better if some teams were divided to bridge the gap between the project itself and the rest of the community. It would be simpler if one person were responsible for a team and the teams could each work on different parts. For example, a team to work with the restaurant and another with the stake pool; and each team would have a representative who could talk to the community, either through Town Hall or developing a more condensed way to present data from each part of the project. It would also be better if the parts were divided into months, this is usually the suggestion I make, because gathering semesters or quarters is so much time to evaluate. It is positive that the team also included some KPIs during the proposal detailing, this increases the availability of information to be monitored. In other words: I found this the most complete and well-explained part of the proposal, for me the only thing that was pending would be the establishment of this contact between the authors of the project and the rest of the Cardano community.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This proposal problem statement and solution is about spreading awareness and education on Cardano to the Costa Rican community by creating a mushroom and fish farm and making it as a community center for Cardano learning. The proposer mentioned at least 20% of retail clients incorporating Ada payment systems by Q2 2022\r\n\r\nAt least 20% of employee pay in ADA by Q2 2022\r\n\r\nAt least 20% Delegation from regulars to our stake pool for extra benefits at our location by Q3 2022 . Explain 20% of what? How big is the target market? The estimate number of 20% from unknown value is too general.  Therefore the key metrics and goals presented in this proposal are unclear whether it really gives impact to the community and Cardano.", "q0r": 2, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. However, the proposer did not present in details the required manpower and resources to successfully implement the project. Moreover, the budget presented is not outlined clearly and broken down into identifiable terms. For example, in stake pool costs $4,000, which part in running SPO that costs 4000? Is it the hardware? Or the personnel that will be running the SPO?  For time and expenses for onboarding retail clients $2,000, how do you plan on spending that $2000? What expenses that required that amount? Is it on education materials? Or the manpower that teaches the community? What about the community space revival and mini summit that needs $4,000, is it for renovation and organizing events? If it is so, state how much is allocated for renovation and how much is used for organizing events. Therefore it is hard to assess whether the budget requested are reasonable to achieve the set goals. Furthermore, this proposal did not provide a sensible and conductible plan for implementation. Can you share the education materials that you are planning to distribute to the community? How do you plan on onboarding the community to use ADA as payment? How do you plan on processing the payments and how will it integrate with their business?", "q1r": 2, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. However the numbers presented on how many people that they aim to educate or bring onboard Cardano is unclear. Therefore the key metrics and KPI that define the success of the proposal remains vague. Moreover, the proposer did not provide any information for the voters to keep track of their progress. Therefore the information provided is not sufficient to audit the progress and the success of the proposal. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 22, "ne": 5, "ng": 7, "nfo": 10, "vca_o": 1}, {"q0": "Living waters Costa Rica will increase exposure of Latin America community through closed loop mushroom and fishfarm, restaurant site and Cardano retreat space/meet ups. Although it seems beneficial to the community, the proposal might need to share more operational information.", "q0r": 3, "q1": "The budget of $10k ADA to make this project possible is not an issue but how to make the project more sustainable and environmental friendly. The information of which will be crucial for the community to decide should the project be funded. The proposal hasn't provided as much this type of information as in how much has been done on site and more operational detail on fish farm, coffee plantation,  closed loop mushroom or the tavern etc.", "q1r": 4, "q2": "As a community, the operational detail will be much appreciated. The majority of budget will be used for eco-stake pool and the community space revival so most of proposal detail are in those areas. However, it is important to study about the impact to the local ecosystem as a key factor to monitor the project progress and if it enhances the community stance on SDG. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I see little alignment with the challenge, it's a good thing that they accept ADA and provide a space for spreading the word in their premises. Also great that they'll setup a Stake Pool Operator. But other than tha I believe the funds requested are not mostrly going to impact wignificantly the growth of Cardano in Latam.\r\nThe scalability of the project is very limited, so the population that could be impacted by this proposal is not large.", "q0r": 2, "q1": "The team seems to have a good general idea of how to move forward but their profiles don't provide any details about their experience of capabilities relevant to the nature of the project.\r\nThe budget could be more detailed so the reader can have a better picture of how the amount requested is justified.", "q1r": 2, "q2": "The proposal could benefit from having a section adressing how the community could verify implementation and succes.\r\nOne of the main items is and SPO which should be easy to audit.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Using a closed-loop mushroom and fish farm that on boards vendors and creates entrepreneurs through employment and mini summits is great way to grow Cardano community on Latin America since the project brings economic value to people. Farming or agriculture is a traditional field and people from this field who can benefit from this project will be the new commers to Cardano community. People easily be attracted to anything that bring immediate realistic value to them. Therefore this is great way to bring these people into the community, which can make the community more diverse since currently member on Cardano Catalyst community is primaly have tech-base or financial-base.", "q0r": 5, "q1": "The proposer is very experienced in relevant field: farming and system engineering. He/she explains well about the solution. The proposal also includes detail plan with roadmap. All the steps are well-thought and is likely that will be implemented successfully. The team also has clear vision about future expansion.", "q1r": 5, "q2": "The roadmap and KPIs are on point. The roadmap is clear with all the phases and action will be taken on each phase, which is easy to track the progress and the KPIs are detail with number quantity for each goal, which make the proposal become easy to measure the success.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Using a closed-loop mushroom and fish farm that on boards vendors and creates entrepreneurs through employment and mini summits", "experience": "Combined 15+ years in Regenerative Farming, Aquaponic farming, Systems Engineering in permaculture, Property Acquisition and Development,3D"}