{"id": 384294, "author": "danicuki", "title": "Latam Women Cardano Plutus Bootcamp", "url": "https://cardano.ideascale.com/a/dtd/384294-48088", "category": 26242, "amount": 70000, "description": "It is a challenge to bring more diversity to web3 and Cardano developers communities. In Latam, we see too few women present in circles", "funded": 1, "upvotes": 44019535, "downvotes": 13640152, "votes_result": 30379383, "votes_cast": 212, "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea itself is very good and fully meets the objectives of the challenge, because it seeks to create a bootcamp on Cardano aimed at the female target audience. It would be beneficial if the proponents explained in detail what bootcamp is, I didn't know the concept before and had to research it, but it was still a bit confusing. In theory this is a very good thing, because it would benefit 3 very important topics: 1) generation of employment opportunities for Latin American women, responding directly to the objectives of the challenge. 2) new people to work with and spread the Cardano ecosystem. 3) would help fill the gap of women in the ecosystem, which is easily noticeable. However, some details left something to be desired in this proposal. Proponents promise some things but don't really explain what they would be like. For example, what country would these women be from? In which language would these teachings be taught? How would the selection process take place? Would the course be completely free? Who would this specialist in psychology be, and how would she accompany the 30 selected women? How would this community support happen? In my view, some very important questions are left open, undermining our understanding and confidence in the project's impact.", "q0r": 3, "q1": "The bidders are a couple who have some important information about who they are. The details about Daniel are extremely complete, as we were not able to get to know Maria do Carmo that well, with regard to the information given in the proposal. However, this project needs a series of other professionals involved. Although they claimed that they would partner with the NGO Laboratoria, we do not know who from the NGO would work on the project and in what roles. Would it be necessary for us to have more certainty about, for example, would there be people specialized in teaching here? Who would be the psychologist, who would do the marketing, the design? A better understanding of the other participants would be needed, the proponents were. No roadmap is given, so we don't know how long this project would be developed, through which phases, how long each thing would take, in what order they would happen and why, etc etc. It is not possible to have a preview of the process. And about the funding: it's a very high amount, 70k to teach 30 women! Although there is an explanation of how this money would be used, it is very superficial. For example: 5k to advertise the bootcamp. Why this value? And how would that announcement be made? Another 5k for sealing. Again: why so much? What kind of selection is this and why does it require so much money involved? In the same way, the other topics should have been better detailed. Overall, both the team, the script and the budget division leave something to be desired.", "q1r": 2, "q2": "Some KPIs are provided that would help to monitor the results, ie whether what was promised was actually delivered. The first KPI doesn't make sense to me: \"knowledge: 0 to 5,000 talented women in tech aware of Cardano Bootcamp\". How would that be measured? It's a very complicated statistic to define. The others make sense and are good. However, as there is no roadmap, there is also no deeper way to follow the actual development of the project. If we knew the steps to be taken, it would be possible to establish sporadic contact with the proponents and monitor whether these activities were actually being carried out on time and in the planned manner. Therefore, I think it is possible to establish an auditability, but only in relation to the final product and not to the process, which is equally important.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 28, "ne": 17, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "Women are under-represented in the Ecosystem, and the proposal aims to improve that. I believe this is relevant for the community because diversity in any organization promotes factors such as creativity, better decision making, flexibility, respect, and improved brand image. From what they described, their solution would involve conducting a Bootcamp with Laboratoria for 30 women in Haskell and Plutus, which aligns with what the challenge is looking for. I particularly like how they rely upon the experience of such an NGO that has already worked with similar projects and also has a base of developers. Their goal is to have 30 female graduates by November 2022. Would it be interesting to know what the profile of the selected women would be, and from which countries these women hail? And what criteria will be used to select them? It would be interesting to know how they will capitalize on the knowledge acquired by the first cohort of graduates. Will they become part of the educational staff in the future? Mentoring could also be provided for the development of future proposals on Catalyst.", "q0r": 4, "q1": "The author of the proposal does a great job describing the characteristics of the two leaders of the project. Daniel and Maria manage to combine skills and experiences that combined with a partner like LABORATORIA, make a very strong team. For this project it is essential to have a deep knowledge of Haskell or Plutus, which from what I understand will be the mentors they are planning to hire. So the cherry on the cake for this proposal would be to have someone on the team or as a partner with such experience, however, I believe that there are many people in the community who can join this initiative. A detracting element regarding feasibility is the way in which the budget was described mostly because even thoug it was broken down into identifiable items, it would have been of great value to present the hourly cost of the professionals to be hired.Also, I am missing a description of the potential risks or challenges of implementation. Given the self-paced nature of this bootcamp method, I identified a critical risk: dropout rate. As a result, it would have been beneficial if the team had included in the proposal actions to reduce or counteract this risk.  \r\n", "q1r": 5, "q2": "With regard to auditability, the team has provided a successful description. There is a roadmap in 5 phases, which I consider to be well explained, and enables the community to understand what will happen at each stage of the implementation process. Also described are five indicators of success that can be used to evaluate whether the project is having a positive impact at every stage of implementation. I have no other words but to congratulate you for such a thoughtful proposal and I wish you a lot of success. \r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Latam Women Cardano Plutus Bootcamp as a proposal would have an impact to the community as it would help the community to grow its diversity within the Latam region. It's aligned with the challenge by providing an opportunity for more people, particularly women to get trained to program for Cardano stack.\nDiversity has an effect to the numbers (people involved and trained) and scalability (expansion), and this experience if successful would be a reference to the Cardano community in other regions of the world, where this approach would be replicated to allow more women get involved.", "q0r": 5, "q1": "The team is formed by two people who have experience in IT for one, and the other one has been involved with the Catalyst for a long time now. Which give them experience in dealing with such initiative presented through this proposal.\nThe timeframe extends on 11 months, with some specific dates for project activities; however I would like to learn more about the process by which participants would be selected to be part of the bootcamp. What would be the criteria's and requirements.\nThe budget is lacking more details to show how the funds would be allocated in each of the spending section.", "q1r": 4, "q2": "There is a list of KPI with some numbers, but it would be more clear if proposal readers would know how would the Proposers came up with those numbers, especially under the KP1 when talking of 5000 people who would be made aware of the Cardano bootcamp.\nNo risks have been raised, that may be a challenge in the implementation process of this current proposal.\nThe proposers talk about the access to the employment after training, but it's vague to identify what's the strategy in place to facilitate those people to get employment. Knowing that some of the bootcamp participants may have been people struggling to get a job for various reasons, and as such they may need a certain guidance. \n", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 24, "ne": 6, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "A great proposal, problem, and solution are well defined, and as they mention two birds at the same time, boosting LATAM as well as engaging more Women with Cardano. The proposal is well aligned with the challenge objective. It could have been good to show and explain how it will scale over time, maybe include a potential revenue model (investing in students becomes more and more popular from other projects I am working on), and show how the graduates will be integrated into the Cardano ecosystem (how many of the 800 companies mentioned are related to Cardano?). The budget is quite significant so I believe more info re the course and placement post-course will be important to evaluate the impact. ", "q0r": 4, "q1": "An excellent team with relevant experience and a track record within Cardano and Catalyst. The partner NGO also seems the right one. It will have been great to share more details about the course even starting with the syllabus.  More info about the selection process and candidates would also be helpful. The roadmap is clear and reasonable. Missing some risks and challenges assessments. The budget is well described into sections, although generalized i.e. the 40000 is calculated per how a number of teachers? How we include Cardano content. Maybe we can use some available resources such as the Plutus pioneer or Atala Prism resources?", "q1r": 4, "q2": "Great to include some KPI also for early-stage such as awareness creation and engagement. At the end of the course, the KPIs are also easy to audit. It would have been great to have some KPIs during the course as well so the community could measure them. Overall based on the team, plan, and KPIs it will be possible to audit the proposal.  ", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 25, "ne": 6, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "As a woman in the blockchain space I can definitely relate to this proposal, as I have asked myself several times why there’s still a lack of gender diversity and how it can be improved, if it needs to be improved or if it needs to be left to develop organically. While I haven’t come up with answers yet, I see your proposal as paving the way to a possible one. And all the more, since this proposal specifically targets women from Latam and offers them the chance to join the Cardano developer community, thus expanding and diversifying two-fold.", "q0r": 5, "q1": "Not only are both team members skilled and well-known Cardano Community members, but one of them has directly worked with the NGO they will be collaborating with to complete their proposal. They have provided links to their previous work, as well to the NGO (Laboratoria) that will be training the 30 women in blockchain/Cardano/Plutus and from the looks of it, the NGO has been very successful so far in training women to be front-end developers. As such, I can be confident that the proposal has great potential to be successfully implemented.", "q1r": 5, "q2": "Considering the partnership with an NGO that has a provable track-record, the proposal contains all necessary information to be properly evaluated. The KPIs, the roadmap, the budget are rightly interwoven and produce a project with high chances of succes and easily verifiable metrics.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 24, "ne": 2, "ng": 22, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to create an open source bootcamp to train 30 women to program for Cardano stack. This is a laudable proposal to get women onboard to be part of the Cardano circles. This proposal addresses the challenge effectively. According to the proposal, the impact is to bring more diversity to Cardano  . When they bring in 30 women, they boost the developers community and also bring gender diversity.", "q0r": 5, "q1": "Partner with Laboratoria, an experienced NGO that already helped more than 2000 women to  graduate and start working on more than 800 tech companies throughout LATAM. Laboratoria's training methodology, according to the proposal, was proved fast and effective. Detailed course is outlined in the proposal. \r\nThe team is made up of 2 experts- Daniel and Maria Carmo- who have PhD , 25 years software engineer, Stake Pool Admin, Alumni Cardano Ambassador who are capable of implementing the proposal successfully.", "q1r": 5, "q2": "The road map is very clear and concise mentioning that it will start from January 2022 to November 2022 with details in the proposal. Success would be measured by the listed factors as 30 women graduated, Awareness, engagement, retention, . The budget breakdown is comprehensive and will make auditing very effective.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "We will create an open source bootcamp partnered with https://laboratoria.la/ and fully train 30 women to program for Cardano stack.", "experience": "DC: CS PhD, 25 yrs as software engineer in Java, Ruby, Elixir, etc. Entrepreneur, CTO\nMC: Stakepool Admin, Alumni Cardano Ambassador"}