{"id": 384125, "author": "imikushin", "title": "Cardano-Cosmos IBC Bridge", "url": "https://cardano.ideascale.com/a/dtd/384125-48088", "category": 26243, "amount": 50000, "description": "Cardano precisa de interoperabilidade com outras correntes de bloqueio. Pontes para grandes ecossistemas podem criar bilhões de dólares em TVL. Dados: [1].", "funded": 1, "upvotes": 62167841, "downvotes": 23486905, "votes_result": 38680936, "votes_cast": 238, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=9958"], "media": [], "f6_assessments": [{"q0": "I can see how this would encourage more grassroots DeFi projects to emerge. This goes beyond DeFi, however, allowing interoperability between Cosmos/Tendermint and Cadano-based solutions. Interoperability is the key to future success.", "q0r": 5, "q1": "It doesn't look like the proposer has the required Haskell/Plutus skills himself - or at least it is not mentioned. Due to the importance and magnitude of the project, would like to see a team of developers co-proposing this. The roadmap mentions \"Token ISPO\". What is that for? If you create IBC bridge, what do you need a native token for? Shouldn't the bridge be usable by any project building on Cardano/Cosmos?", "q1r": 2, "q2": "It is mentioned that \"The funding requested will help fund the project development towards the first (3 months) milestone.\" However, there is no visiblility into what this 50K is used for specifically. Very difficult to measure progress and audit results. Please re-submit a more detailed plan with a team of developers (and ideally support from Cosmos) into the Fund8 Cross-Chain Collaboration challenge (if it gets funded).", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 27, "ne": 0, "ng": 14, "nfo": 13, "vca_o": 1, "reply": "Feasibility:\nI don't think Feasibility is fairly assessed: while I doesn't have Haskell/Plutus experience, these are just programming languages, and I have experience building software with multiple languages, both imperative AND functional. The stab at \"Token ISPO\" is both unfair and irrelevant with regards to Feasibility assessment: the ISPO will help both fund development and create community around the project. \n\nAuditability:\nI don't think Auditability is fairly assessed as there are clearly defined milestones with clearly specified key results."}, {"q0": "The cross-chain mobility of value has been verified as a necessary mechanism that will add value to both the eco-system. Therefore, building this Cardano-Cosmos Bridge is addressing a core requirement. ", "q0r": 5, "q1": "The proposal is from a Software engineer with more than ten years of experience working with major companies. He has not referenced any other member. However, it is very likely with this experience, and the proposer will be able to implement the proposal. ", "q1r": 4, "q2": "The proposer had assessed the tasks, and the skills needed for each stage. He has also presented the tasks in an easy-to-understand manner with sufficient clarity. This gives lots of confidence. The KPIs are measurable and achievable. I feel the proposal budget is fair, and it is an auditable project. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This proposal addresses the challenge of cardano and cosmos interoperablility. It has the ability to add the large value of the cosmos chain (with a TVL of 170 billion) to cardano. The bridge is well-proposed and is aligned with the challenge to bring more defi developers to the ecosystem and lock up more volume. ", "q0r": 5, "q1": "Success of the project is based on the ability to attract the right developers - the proposer states that they have experience leading teams but would need to elaborate on what the makeup of the dev and execution team would be. The plan and timeframe for three months of initial implementation of plutus smart contracts and relayer node seems feasible, however without a budget breakdown it isn't clear if they have under or overshot the funds required. I would recommend that they re-apply in the next round to something like the Cross-Chain Collaboration challenge if this challenge is approved with more information on the experience and makeup of the team and the structured use of funds.", "q1r": 2, "q2": "Delivery dates and roadmap is clearly defined but it is unclear if the code will be available on github to audit or whether the testnet will be up within the 3 months.  KPIS's ( like number of people participating in the testnet, TVL, number of DEFI apps and trading pairs on DEX's) are clearly defined but we won't see most of them until the 3 6 12 month mark. ", "q2r": 3, "assessor": "z_assessor_699", "no_vca": 17, "ne": 0, "ng": 10, "nfo": 7, "vca_o": 1, "reply": "Auditability: \nThe following phrase in the rationale misrepresents the proposal: \"it is unclear if the code will be available on github to audit or whether the testnet will be up within the 3 months\". \n\nI directly state in the text of the proposal (in the Components section) that the project \"will be developed as open source software.\" Not only the code will be available, it will be developed in the open!\n\n\"The bridge is functional on the Cardano testnet.\" is a key result of the 6 months milestone.\n"}], "solution": "Uma ponte Cardano IBC [2] trará interoperabilidade com o ecossistema Cosmos [3] em rápida expansão e permitirá aplicações em cadeia cruzada.", "experience": "Experimente liderar equipes, construindo software com um espectro de tecnologias: linguagens imperativas e funcionais, pilhas de web, Kubernetes."}