{"id": 384443, "author": "ben.mesnik", "title": "Browser tool- How to use DeFi dApps", "url": "https://cardano.ideascale.com/a/dtd/384443-48088", "category": 26243, "amount": 49800, "description": "A DeFi é difícil de usar e entender. É um novo paradigma que requer o conhecimento de como os componentes DeFi funcionam e os erros podem ser caros.", "funded": 2, "upvotes": 68022355, "downvotes": 5717702, "votes_result": 62304653, "votes_cast": 159, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "O problema e a solução descritos fazem sentido e estão dentro do escopo do desafio. Para que um dapp DeFi seja funcional e útil, ele precisa de uma boa IU (interface de usuário) e esta proposta busca melhorar esta experiência, trazendo uma ferramenta que pode melhorar o uso dos dapps.\n\nEmbora o conceito seja promissor, não está claro como esta ferramenta \"amigo\" seria integrada na dapps. Cada dapp tem sua própria interface e conceito, portanto, uma \"ferramenta de amigo/assistente\" precisa ser pensada individualmente para que seja apropriada para cada dapp.\n\nForam incluídas métricas relevantes, que permitiriam quantificar as dicas para os dapps em 3 e 6 meses e que ajudam a entender o impacto positivo sobre o desafio, mas não está claro como essas dicas serão avaliadas em termos de qualidade. Qualquer dapp financeira precisa de rigor com dicas para os usuários, e embora seja especificado que as dicas serão auditadas, não está claro exatamente o que esta auditoria significa. Quem irá auditar isto? Haverá uma parceria com os desenvolvedores da dapps?\n\nEu recomendaria incluir mais indicadores/KPIs que poderiam indicar o impacto potencial do desafio.", "q0r": 3, "q1": "O proponente descreveu experiências que podem ser relevantes para o desenvolvimento desta proposta, mas não há fontes ou links que permitam avaliar suas qualificações. Eu recomendaria acrescentar links ao Linkedin e repositórios para que a comunidade possa verificar a experiência/qualificação do proponente. Você está participando do Plutus Pioneer? Qual coorte? Você completou o programa?\n\nO orçamento apresentado parece razoável e realista, as tarifas horárias estão dentro dos preços de referência do mercado, mas a carga de trabalho apresentada é difícil de avaliar, uma vez que não há um grande detalhe técnico em relação ao desenvolvimento da extensão.\n\nO valor do orçamento estabelecido para a tradução não me parece sólido, pois não há estimativa de caracteres ou palavras a serem traduzidas, portanto não há como indicar se o orçamento da tradução é apropriado ou não.\n\nHá um cronograma realista para o desenvolvimento do projeto, porém há poucas informações sobre como a extensão funcionará. Cada dapp tem uma interface diferente, portanto a extensão precisa ser personalizada e isto cria uma grande dependência do projeto em relação aos desenvolvedores da dapp.\n\nAcredito que esta proposta tem um conceito interessante que pode ser aproveitado, mas precisa de mais esclarecimentos sobre como as dicas serão integradas a cada dapp. A viabilidade do projeto depende da complexidade da integração com cada dapp, portanto, este ponto é um grande desconhecido.", "q1r": 3, "q2": "Há clareza sobre o problema e como ele se relaciona com o desafio, mas a solução precisa de mais detalhes, principalmente sobre como cada tutorial será personalizado para cada dapp e se isso for viável.\n\nAs métricas definidas são indicadores aceitáveis para avaliar a quantidade de dicas, mas são indicadores de má qualidade. Eu recomendaria incluir KPIs/métricas que permitam avaliar o desempenho das dicas, por exemplo, um simples botão que permita ao usuário dizer se a dica foi útil ou não. Como será avaliada a segurança da extensão? Se um usuário perder fundos devido a uma dica inapropriada, como ela será contada?\n\nHá um roteiro com resultados razoáveis, o que ajuda na auditabilidade.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal satisfies none of the \"Key Metrics\" of this challenge. If we apply a strict reading of the challenge, there's not a lot room for ancillary DeFi resources that's not actual DApps. With that being said, quality education is key maintaining \"daily active\" and other ongoing user driven metrics after novelty wears off. In this sense, this proposal effectively addresses the challenge.", "q0r": 4, "q1": "It is clear that Sir Ben has the technical and leader skills to execute. What is not clear is Ben's chops as an education. It would be helpful for the community to know about who is going to being these videos as well more details about proposal thinking around the community curation of tips.", "q1r": 4, "q2": "The metrics are clear and easy to audit. The community should have no problem tracking whether or not there's 100 tips within 3 months or that there are  tips for 10+ projects. What isn't clear again is how the community might go about verifying that tips are audited before addition to the Tip Genius knowledge base. ", "q2r": 4, "assessor": "z_assessor_336", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea is great and could improve the usability of Defi d'Apps. However, I am not sure re the alignment to the challenge. The challenge focuses more on new Defi d'Apps than improving user experience and usability, which are important but maybe aligned better with other challenges. In addition, to show impact on Cardano ecosystem at this point you could have add also list of DeFi d'Apps that you can work with and give some specific use case examples. ", "q0r": 3, "q1": "While the proposer seems to have a great background and was part of plutus pioneer program there are no links to support it. The website tipgenius.info is offline and Linkedin profile would have been helpful. Again it will be helpful to have a list of DeFi projects they would like to support, discuss with the project potential partnership and maybe focus on this proposal on a first pilot use case. The roadmap is clear, but having the 3month break down will be recommended to be more clear on deliverables. Great to have a 12 months scope of KPIs and deliverables. The budget is well detailed. Good to have some risks and challenges although could be great to add how to mitigate it as well. ", "q1r": 3, "q2": "KPIs and deliverables are clear and could be audited. Could be good to add some KPIs on how the tips improve the usability of the DeFi app. Also for better audibility, especially in the first 3 month, it could be good to break down KPIs and deliverables on a monthly basis.   ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "The proposer want to launch a video that will pop up on a browser extension that will explain how to use specific Defi dApps when interacting with them. ", "q0r": 3, "q1": "The proposer is the founder of Tip Genius, and a Plutus pioneer developer, and is capable of successfully implementing the project. The plan mentioned that they will educate people on how to interact with the Apps; translate tips to 6 total languages and then release Apps. All these facts will lead to successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clear stating 3 , 6 and 12 months scheduled work with details. The budget is broken down in details to make auditing easy.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 25, "ne": 1, "ng": 14, "nfo": 10, "vca_o": 1}], "solution": "Dicas de vídeo educativo integradas através de uma extensão popup do navegador que explica como usar dApps DeFi específicos à medida que você interage com eles", "experience": "Fundador do Tip Genius, um treinador de videogames automatizado que mostra pequenas dicas em vídeo através de uma cobertura ao vivo enquanto você joga\nPlutus Pioneer & Developer"}