{"id": 368427, "author": "", "title": "Scale up Cardano by JPN Publication", "url": "https://cardano.ideascale.com/a/dtd/368427-48088", "category": 26118, "amount": 9900, "description": "Japanese ADA holder have largest class ADA. However only 10% members contribute community and less than 5% member attend Catalyst Voting.", "f6_no_assessments": 1, "f6_rating": 2.3333333333333335, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=25581"], "media": [], "f6_assessments": [{"q0": "The main idea of the proposal is good but unfortunately it is not well structured or planned. Maybe the english proficiency was a limitation to the presentation but it should not be excused as it hinders the ability of CAs to fully comprehend the plan set out here. KPI1 and KPI3 are good goals to meet the desired objectives but KPI3 is a bit too broad. I would also add a KPI regarding the spread of knowlegde about cardano to the general public not just the cardano community. KPI2 does not seem to be as important as the other cited. Finally I would also think about bringing external organization to partner and scale this idea, it could be a powerful catalyst.", "q0r": 3, "q1": "The main idea of the proposal is good but unfortunately it is not very clear and lacks more details about how the objectives will be met. The author could go deeper into explaining what will be approached in the book and how it expects to market it and spread the word about it. Also the book costs presented are a bit odd. Besides that there could be more information on the content expected to be created: amount, timeframe, main topics, channels used and audience pursued. The budget is outlined but once again more details could be given, it is broken down into topics that are very broad. Finally there's no consideration to challenges and risks that could be faced during the project.", "q1r": 2, "q2": "The proposal does not give a lot of details about the stages of the project. It states some of the goals but not the phases necessary to get there. A roadmap with milestones and time horizons is essential to track the progress of the project and very little of it was given. For example, how many meetups are expected which month or how many YouTube videos per month would be easy KPIs to define and would enrich the proposal. Also the content approached or other type of quality measure would be necessary in the roadmap to verify if the result is within the expected region.", "q2r": 2, "assessor": "z_assessor_341", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "A lot of Cardano content's with deep understanding written in Japanese such as books, document, You tube community moderating etc.", "experience": "I already moderate over 2400 member in JPN Cardano Community through the documents & homepage (over 0.2 M word count), you tube and meetups."}