{"id": 368729, "author": "", "title": "Cardano Canvas, Cards & Calculator", "url": "https://cardano.ideascale.com/a/dtd/368729-48088", "category": 26118, "amount": 19500, "description": "Hubs needing to run events to develop local Cardano knowledge lack frameworks and tools based on shared global patterns and language.", "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": ["https://youtu.be/b_lyGiw_gPw"], "media": [], "f6_assessments": [{"q0": "As an entrepreneur and a former co-founder of an Entrepreneurship Academy, I totally agreee that providing and teaching a proper methodology and tools, to Create a Growth mindset can certainly make the difference.\r\nI know first hand the authors, the methods and ideas you have selected for this proposal and I am very confident they are the most adequate to deliver on the objective.\r\nIf this efforts and the tools it will provide are tailored for Cardano's and are truly adopted by local HUBs and there is a good knowledge transfer so the value reaches local entrepreneurs, then it will help to grow our community and its worldwide reach, making more and more local entrepreneurs and wannabe entrepreneurs become interested and fond of the Cardano's vision for the world, helping thus to achieve this challenge objectives.\r\nI do also believe that this proposal should aim for a wider approach within its first 3 months, so instead of just experimenting in Vietnam and Indonesia, I'd rather involve the community and include more countries, to better represent the worldwide Cardano's potential community ( I do understand that Lean recommends starting small, but you can start small but with a more diverse playground, as if you don't, I have some doubts on wether something developed with insights from very unique cultures and reality will serve a wider purpose for the world, the effort to adapt could be too costly, still I love the idea and think it will be of great impact to Scale Up Cardano's community, even if it just for the eastern emisphere countries)\r\nRegarding budget, I think 19500 for a 3 months effort for 3 people, even though it is higher from other projects rates, due to the seniority required, it does seem a good investement of the Treasury funds, and a fair one for the value this initiative can derive.", "q0r": 5, "q1": "The plan is solid, it has clear deliverables, good coverage of what is needed to be done. The first month approach on looking for and identify the insights is the proper one, and shows good understanding of the methodologies involved.\r\nThe estimated effort, in my experience, could be a little low (30 hs per person per month), but will depends on the amount of research, customization needed. I guess as the project mention help from some Cardano's eastern community members, there will be more people involved than just the 3 proposers (and I am counting on it)\r\nWhat seems to be missing is to indicate which experiment/s will you run to understand if the deliverables are fit for purpose within a real local community hub and how will you factor in, the results of that experiments in the evolution of the toolset. I think it will be key to look at a real session with real local entrepreneurs, and local hub coaches driving it to understand that fit.", "q1r": 5, "q2": "Proposed metrics will certainly enable to audit and track desired results. The milestones will enable to track progress.\r\nI really like the commitment implied by selecting metrics  that are going to measure impact and real outcomes. Still think that in order for those metrics to be fulfilled and produced you need to devise an experiment with a local hub (or hubs), so you can measure real life results.\r\n\r\nMetrics and outcomes are vey aligned to the challenge purpose and objectives, as a measure and a how it is provided for each of them.", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "In my opinion this proposal addresses the challenge perfectly. Pre-made materials for Cardano Hubs or even small community meetups (not strictly Cardano-focused) could be a powerful tool to encourage \"regular\" crypto-enthusiasts to meet and get to know Cardano better. I personally plan on running a local meetup focused on Cardano but due to the fact that it requires a lot of preparation to do it properly, I postpone that in time. If I had tools that this proposer plans to offer, my job would be way easier. I believe a lot of people would feel the same way.", "q0r": 5, "q1": "It is clearly stated that the team behind this proposal is experienced in terms of business, relations and blockchain. Ideas are presented clearly and are totally achievable in given period of time. ", "q1r": 5, "q2": "We will be able to see ourselves whether the provided materials are good in terms of quality, quantity and simplicity of adjustment for local needs (translations etc.). To keep track of downloads and where are the materials used, I may suggest you introduce mandatory registration in order to download editable sources of your cards and other stuff. ", "q2r": 5, "assessor": "z_assessor_324", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Cardano Business Design Canvas, Blockchain Economy Card Deck, and a Startup Cost Calculator are tools that would help every local community hub get up and running without needing to spend the time to develop content and resources from scratch.  ", "q0r": 5, "q1": "The team is composed of seasoned entrepreneurs and startup community organizers, and educators.  The experience they have in co-founding a NZ nationwide place-based network of local hubs running events for entrepreneurs would provide them with insight that others not so familiar with the space may not have. ", "q1r": 5, "q2": "Their deliverable are clearly listed and defined.  Auditing their progress comes to to quantifying whether or not their listed deliverables were completed as outlined in their roadmap.  In addition, the team has provided key metrics which can be used to determine where improvements can be made in their content and toolkit.", "q2r": 5, "assessor": "z_assessor_391", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Excellent problem identified and solution being proposed is well articulated. The key element here is engagement and I feel that the team are well aware of this in making this proposal application. The potential to add value to the community is present and scaling should not be an issue. Overall, it takes the complexity of starting a business idea and breaking it down into manageable components with a toolkit designed to step participants through the process. ", "q0r": 5, "q1": "The experience of the team is evident in the research that has already been undertaken. Everything appears to have been sourced from packages already in place and the team will simply modify and design those resources into a Cardano specific tool kit. I did wonder if there may be some copyright aspects to be negotiated but expect that the team have assessed that element. Further to this I question the selection of Vietnam and Indonesia as the first testing sites merely from a language perspective. Perhaps the team has the collaborations from the Eastern Town Hall but have chosen not to include them in this proposal? I would have loved to have seen some preliminary mock-ups of card content/activities with the Cardano/Project Catalyst theme just to put a finishing touch on this proposal. I am very confident that should the team get funding they can deliver on this proposal. ", "q1r": 4, "q2": "The information provided is excellent and meets the parameters of the challenge. I think the budget may be a little optimistic but that will be for the voters to decide. I feel the metrics/KPI's are measurable and reasonable. As stated previously, the inclusion of some examples of work already completed would have added to an excellent proposal.    ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Create Canvas, Card deck & Calculator tools to design blockchain ventures at hub events that are easy to explain, customise & share offline", "experience": "Co-founded nationwide place-based network of local hubs running events for entrepreneurs; Blockchain, Finance, Design, Startups, Education"}