{"id": 368843, "author": "", "title": "YouTube Giveaway Scammers", "url": "https://cardano.ideascale.com/a/dtd/368843-48088", "category": 26118, "amount": 10000, "description": "I was hacked days before my Mother's funeral. What I do is for my son's. They attacked my legacy. YouTube scammers have to be stopped.", "f6_no_assessments": 5, "f6_rating": 1.6, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has a great proposed solution to Youtube scammers  but failed to give more details on how to achieve it goals or provide cost breakdown with timelines.\r\nThis proposal need more details.\r\n\r\nI disagree", "q0r": 2, "q1": "The proposal did not provide verifiable links to given experience and lacks an implementation plan with cost breakdown.\r\n\r\ni disagree", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit its progress and success. i disagree", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Giveaways scams are a big problem in the crypto space and there are some proposals in Fund6 itself that intend to tackle this problem, but this is not the appropriate challenge for this proposal. I would recommend submitting this type of idea to an appropriate challenge..\r\n\r\nThere is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "I don't see the correlation between this proposal and the challenge. I suggest to the proposer to find the adequate challenge in order to increase the chances of being funded.", "q0r": 3, "q1": "Due to a lack of informations about the team and the roadmap, I think that implementation will be an issue. Besides, I think this is in the wrong challenge.", "q1r": 3, "q2": "I think that there is not enough informations on this proposal to allow an easy audit. ", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposer's heart is surely in the right place but I can't find the link to the campaign brief. There is a lack of direction and information on this proposal.", "q0r": 1, "q1": "With 15 years of experience in marketing and project management, I can't give more than one star as there is a huge lack of clarity on how the QR codes would be created and verified and the delivery of it. The proposer needs to give greater detail across the board. The proposer needs to deliver more detail on how the implementation of QR codes would increase the security of Youtube videos against scammers as it is not clear in this proposal at all. There also needs to be a  project plan, including a detailed budget breakdown, resource requirements, risk register and how they will ensure continued security and management going forward.", "q1r": 1, "q2": "The proposer has asked for $10,000 but there is no indication of how this would be spent. The proposer needs to provide a project plan including what their success criteria would be. There is no timescale for delivery, KPIs or risk assessment so not possible to audit currently. If this proposer would like to re-submit, they need to provide information one would expect of a business case throughout.", "q2r": 1, "assessor": "z_assessor_483", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I am an active member of the Cardano community and I have 7 years of experience delivering software projects as a QA. \r\nWhile I agree that scams and especially YouTube giveaway scams are a problem that need to be fixed, the way the problem is stated here is not professional and it does not have anything to do with this challenge.\r\nThe solution is unrealistic, because what YouTube scanners do is edit the video to fit their purpose. They could simply cover up the QR code.\r\nDue to the vagueness of the information provided, the fact that the problem itself does not fit in this challenge and the fact that I can see no metrics for success mentioned anywhere, I strongly disagree this proposal effectively addresses the challenge.\r\nFor the proposal to receive a higher score, it would have to identify a problem pertaining to the challenge (for example, that non-English speakers might be more vulnerable to giveaway scams) and a solution to match.", "q0r": 1, "q1": "I do not think this proposal has any chance of being implemented successfully. Here is my assessment:\r\n- The proposer has not provided any details about himself whatsoever and I cannot count \"Gamer\" as relevant experience here\r\n- The proposer has been a member of Project Catalyst only since the 22nd of August, 2021\r\n- I cannot find any previous contributions of the proposer to the Cardano ecosystem\r\n- There are no details in the proposal about who will do what, when and how\r\n- The budget is very large and there is no justification on how it is intended to be used\r\n- Between 22 and 25 August, the proposer has created 7 separate proposals, all suffering from the same issues as this one. This leads me to suspect that the proposals were created en masse in the hopes of gaming the system and obtaining some funds. I apologize if I am wrong.\r\nTo make this proposal feasible, the proposer needs to provide more information about himself, about the people who will help him and as mentioned earlier, to identify a problem and matching solution pertaining to this challenge.", "q1r": 1, "q2": "I cannot find any information at all that explains how the progress and success of the proposal would be tracked, if it were to be funded.\r\nAs such, I completely disagree that the proposal is auditable.\r\nIn order for this to be fixed, the proposer needs to provide a clear roadmap describing what will be done when and how, with specific milestones and a time-horizon for the implementation. Along with this, key progress indicators also have to be mentioned.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 10, "ne": 7, "ng": 2, "nfo": 1, "vca_o": 2}], "solution": "A QR Code will be placed in all YouTube videos. A second QR Code from a reliable source will be scanned to match.", "experience": "User of YouTube"}