{"id": 369133, "author": "", "title": "DisCO of Urgency", "url": "https://cardano.ideascale.com/a/dtd/369133-48088", "category": 26118, "amount": 9862, "description": "Cardano Community is limited to male-dominated tech sphere / Potential adopters outside tech sphere don't know how to engage with Cardano", "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=5490"], "media": [], "f6_assessments": [{"q0": "This proposal effectively meets the challenge in that it will set up a hub for a specific community to introduce members of the community to Cardano. Seeing, that this is an initiative that values diversity I would highly recommend inclusive language in the problem statement. Cardano is not \"limited to\" but moreso the overall diversity in the space is lacking. Overall, the proposal meets the criteria of this challenge fully in that it - focusses on a specific community, provides a hub that enables accessibility for new members - wants to look for ways to contribute instead of just educating on crypto and would support onboard new members and enhance contributions. Especially with the field of NFTs growing, the arts and culture community is a valuable group that might find great ways of utilizing Cardano for arts, NFTs... projects of all kinds.", "q0r": 5, "q1": "The plan that is outlined in this proposal is very feasable and the proposer is already committed in this community and would be able to set up the hub in the community. Established initiatives in the arts and culture szene are part of this group so it would be an additional topic that interested members could make use of. Implementation is highly likely. The budget is borken down into the salary for 4 people that would engage with the hub.", "q1r": 5, "q2": "Auditability is high since the proposal gives exact numbers of who will be involved and what will be done, starting with contributing to a conference on disruptive technologies and following up with workshops and documentation via discord, miro...", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Given the challenge of Scaling up the Cardano Community Hubs and your goal of Actively strengthening connections/alliances between the GADAC Hub and Cardano Catalyst Community.  I 'Strongly Agree' your project addresses this challenge.", "q0r": 5, "q1": "Having managed projects and budgets for many years I have reviewed your goals, timelines, budgets and areas of expertise.  I believe you have a good team to execute this project on the communications efforts I see you will need to recruit the technical staff to move forward. This may impact your timelines also I'm not sure if you included a technical perspective when you created your timeline and budget.  Having 4 part time technical folks may not be as effective as having two full time.  I'm also concerned about the small budget for these folks. I do like this project and it's in line with your other proposal so I hope you will focus on the technical staffing right away. If you can get them in place you will be able to make your deadline. I'm marking 'I Agree'  ", "q1r": 4, "q2": "Given the High Visibility of the proposed task I believe the voting community will be able to audit the progress of this proposal. I 'Strongly Agree' ", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposal addresses the issue of outreach and lack of representation in the Cardano community. From my understanding of it, the proposer aims to introduce and connect Cardano to a number of culture & queer focused communities all around the world in order to balance the problem of having a predominantly male user base. Since these communities and ecosystems already have a wide social network around the world, it will hopefully attract an underrepresented demographic (artists/queer community) to eventually start developing on the Cardano Ecosystem. The problem statement is clear and reasonable, and the solution addresses the problem in an equally clear way. There is also a clear path of scalability, moving forward with the growth of adoption through presence at relevant conferences. \r\nWith regards to the challenge brief, the proposal seems to focus more on a pre-stage of the challenge, with the potential of giving more concrete results in direct correlation to the challenge in the future. Inviting underrepresented groups and communities into working with Cardano (especially if it's also an underrepresented field of expertise, arts and LBTQ-movement) will always be a relatively good investment, increasing the field, network and scope of adoption for the Cardano community. The budget is also fairly reasonable, consisting of around 10% of the total funds of the Challenge. I agree that this proposal effectively addresses the challenge, albeit in an early stage. \r\n", "q0r": 4, "q1": "The teams expertise offer an extensive experience of community building and organizing events and conferences, and links to their social media/LinkedIN profiles and project website are sufficiently provided in the proposal. The competency in global networking and outreach within the artist/LBTQ community is substantial. The budget allocated in the proposal (around 10% of total challenge budget) is realistic in order to achieve the set goals, and clearly presented. Maybe an estimated table of the labour hours could be added in order to further increase the transparency of the budget. The proposal also features a detailed plan with complete timeframe (presented in three steps, on a 3-month timeframe), with a list of tools that the team intends to use for outreach. \r\nIt is promising to see that the plan not only focus on creating a presence in the conferences, but also building a community outside these events via discord etc. In my experience of network and community building in the artistic space, a place where community members can communicate, reflect and exchange ideas with each other regardless of geographical location or time, is incredibly important. \r\nI would have liked to see a consideration or backup-plan if the intended milestones are not met, or at least a list of potential challenges in order to increase the feasibility of the proposal. Overall, I agree that it is likely that this proposal will be implemented successfully. \r\n", "q1r": 4, "q2": "A clear roadmap with milestones spanning a 3 month period is provided. A whole section with easily monitored KPIs along with a short list of future plans after the initial 3 month period increases the level of transparency of this project and proposal. The milestone goals and measurements of success are very concrete, and the progress could be easily followed since most goals are based on interaction with the ecosystem publicly. As long as you follow the project on social media, you would be able to follow the development, basically. The team emphasizes the importance of the projects transparency by aiming to upload as much material on social media as possible, also making it easily accessible. I still would've like to see some examples of potential challenges or risks with the development of this proposal, and how the proposers intend to deal with these. That would increase the credibility of the proposal, and show that the team understands and acknowledges potential risks. Apart from that, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "The proposal fits the challenge with the potential to reach new groups of contributors. ", "q0r": 5, "q1": "The proposal has noble goals.   The proposal would benefit from some concrete examples of Cardano use cases, but I think the goal is to uncover use cases.  The team is well qualified to reach the target groups.  The timeline mentions using the Cardano Catalyst Community and will be reliant on their availability.  Although the budget is broken down into roles, the proposal could benefit from more specifics about the tasks for these roles.  ", "q1r": 5, "q2": "The definition of success section lays out the success criteria well. The timeline is reasonable and the budget is within reason.  ", "q2r": 5, "assessor": "z_assessor_607", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Introduce Cardano into an established, worldwide arts & culture ecosystem including queer & female communities with large social impact.", "experience": "Board members, creators and artists from SpaceofUrgency, \"Frei(t)räume\" & \"Stadt Nach Acht\" conferences in Berlin, UnitedWeStream."}