{"id": 369688, "author": "", "title": "Cardano Learning Centers", "url": "https://cardano.ideascale.com/a/dtd/369688-48088", "category": 26118, "amount": 100000, "description": "In Mexico, many communities lack support an access to the tools and training that can unlock a better future and prepare youth.", "f6_no_assessments": 3, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposed idea and the problem that is being raised addresses the challenge effectively in that education about blockchain and about Cardano can enhance global adoption and targeting specific communities. However, the proposal does not contain necessary information on what a \"learning center\" would be.", "q0r": 4, "q1": "Relevant experience of the proposer is not supported by further information or documentation of prior work. Definition of success is not set, the budget is very high and would need to allocated to understand if the budget plan is necessary to support the project. The proposer did not explain what kinds of learning centers he would want to set up. Are they online or in-person? How would he himself maintain learning \"centers\"? Would he set up a team or not? What is the timeline on this project to start and how many youth would he want to include for the first 6 months? Relevant questions that would need to be considered for future funding are:\r\n\r\n    How many new Hubs were launched in the next 6 months?\r\n    How many developers did this community-focused challenge bring into the Cardano ecosystem?\r\n    How many new users of Cardano were onboarded?\r\n    What was the total reach of the Hub's initial marketing launch?\r\n    How many external organizations did this community-focused challenge bring into the Cardano ecosystem?\r\nWhat kind of education would Leonardo want to teach those youths and how would he even reach them? Does he have connections to schools or youth initiatives?", "q1r": 1, "q2": "No information about any relevant aspects are given, making the proposal not auditable. The proposer would have to add the following parts to his proposal to make the idea assessible:\r\nRoadmap and milestones\r\nDefinition of success  (e.g. metrics or KPIs appropriate to this challenge)\r\nClear understandable description of problem and solution\r\nChallenges and risks \r\nAt the moment it does not seem reasonable to ask for 100.000 Dollars without providing relevant information on auditability. Documentation would have to be included as well.\r\n", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 9, "ne": 7, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The idea of a learning center is too broad . I think that the proposer should have provided more details on the project. The proposer could be more precise on the community they target and the learning materials. This idea is not precise enough to have a impact on the community.", "q0r": 3, "q1": "This proposal doesn't contain a roadmap and a detail plan. The goal of this project is not clear, which make the implementation a guessing game. I suggest that the proposer refine his idea to increase the chance of being funded.", "q1r": 3, "q2": "This project is not easily auditable. It lacks the key metrics and a roadmap that will allow the community to track its progress. The proposer should consider adding more informations on this proposal like a roadmap, a detailed plan, some KPIs and a budget breakdown.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Cardano learning centers could be a place where youth can develop critical skills through hands-on activities.", "experience": "I was in charge of a similar project for a retail  (500 fortune) company. I am an enthusiastic promoter of ecological sustainability."}