{"id": 369986, "author": "", "title": "Cardano Vietnam Information Centre", "url": "https://cardano.ideascale.com/a/dtd/369986-48088", "category": 26118, "amount": 10420, "description": "A survey on Cardano Vietnam community shows that about 90% do not know or incorrectly answer basic knowledge related to Cardano blockchain", "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is clear with its aim and expanding Cardano in Vietnam is a great opportunity for cardano.  Increasing Cardano literacy among the people is a great way to scale up the community, aligns very well with the challenge. ", "q0r": 5, "q1": "Each of the authors looks oriented with the proposal and the project's timeline looks achievable, along with the provided content would love to see how to get people involved with this, because attracting people towards these systems is also a challenge.", "q1r": 4, "q2": "The timeline provided is detailed and can measure the progress of the proposal for the next 6 months, At the end, it would be seeing more people from Vietnam in Cardano.", "q2r": 5, "assessor": "z_assessor_208", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The problem is identified and a solution to solve the problem is provided. A little bit unclear how the 'info centre with website, youtube, blog' will look like, and my guess is that most of the actions/interactions/reactions will be online. Maybe a further step forward is to bring the disparate communities together in a real life reunion.\r\nThe proposal shows how it could add value to the Cardano ecosystem.\r\nThe key metrics and goals of the proposal align with the outlined challenge settings.\r\nThe proposal is able to scale to address future challenges. I recommend the proposer to add, in the synopsis, references/deliverables abut other features of Cardano ecosystem (SC, Atala PRISM, NFTs etc.) to be up to date with the evolution of the Cardano ecosystem.", "q0r": 4, "q1": "The proposal provides info about the team and the roles of the team members and their experience/skill is sustained by references/links. (A translation in English, for some references, will make them even more visible).\r\n\r\nThe budget of the proposal is outlined clearly and broken down into identifiable items.\r\n\r\nThe proposal offers a realistic timetable to complete the work.\r\nThe plan describes the resources necessary to implement the proposal. (good job).\r\nThe proposer should take some risks and challenges into consideration when implementing the plan (what is o be done if the threshold set for new onboarded subscribers is not achieved?)", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. There are several metrics that measure the success of this project. I recommend adding further metrics like: how many downloads/views of the documents/articles are done in 1 week (or 1 month), feedback questionnaire about the quality of the materials shown and what is to be improved etc. so that more areas of this project are auditable. If the proposed solution is successfully implemented it provides a useful solution to the targeted problem. The only thing I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them. (set alternatives if some goals set are not achieved)", "q2r": 4, "assessor": "z_assessor_309", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement points out 90% in Vietnam Cardano community doesn't know basic knowledge related to cardona blockchain the proposer is offering to establish a knowledge centre about the cardona in Vietnamese hence this effectively addresses the challenge.", "q0r": 5, "q1": "The proposer and their team has relevant experience required for the proposal. they have provided detailed roadmap to implement the proposal. Therefore it's highly this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided detailed timeline with fund breakdown which will be sufficient to track the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is a good one, focusing on the Vietnamese community interested in Cardano (40k strong) and serving the particular gap necessary to scale up and improve the involvement in the community (lack of quality information translated into their native Vietnamese). The idea appears to be that by delivering quality information about Cardano and about Blockchain to this community which is already curious about Cardano, that would lead to more traction and involvement of said community. ", "q0r": 4, "q1": "The proposal is a simple but necessary one for getting this community involved. The hard work in many ways has already been done, which is to get the following of people interested and curious in Cardano. The proposal fills in the necessary gap of quality accessible information to help turn those interested into getting involved. The tech is simple, the idea seems quite achievable.", "q1r": 5, "q2": "The proposer gives clear KPIs broken down month to month, which involves creation of key pieces of content per month. Metrics of success can be outlined as simply as creation of the content, though it would be good to plan and outline downstream KPIs such as downloads, hits, user engagement vs. churn. But the content outside seems measurable with ease.", "q2r": 4, "assessor": "z_assessor_517", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Reading between the lines a bit I gather that the Cardano community in Vietnam is substantial (40k members). This proposal seeks to both expand that membership and deepen current members understanding of Cardano via Native language resources on publicly available platforms. While the scale-Up and multilingual F6 focuses have significant overlap this proposal clearly articulates a synthesis between both Funding Themes and fits into this, it's home theme. The proposal does a good job of articulating the content topics covered, video production goals, and subscriber reach through the life of the project. The open platforms of YouTube and to a lesser extent Wordpress will afford a wider audience than Telegram (where the team's content started). Unpacking how they might leverage that existing content to the value of the Cardano ecosystem would be a welcome, as yet, unrealized fascet to the plan. ", "q0r": 5, "q1": "The team's project team is strong on project management, marketing, and design which is suitable for this project as it involves communication and information design than software development. A professional translator or linguist as a team member who specializes in Vietnamese would be welcome. The budget is reasonable only in that the four members of the group have stated that they will work for $4 per hour. This seems rather low, making it a good deal for the Cardano community but less of a good deal for the team members. Equipment and infrastructure needed are adequately spelled out. ", "q1r": 4, "q2": "There is a clear roadmap toward goal attainment with artifact production goals and community uptake targets delineated on a monthly basis. Upon a second reading, the description of the problem is understandable and the solution is clearly articulated.  ", "q2r": 5, "assessor": "z_assessor_524", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is well addressing the challenge and provides a great local solution for Vietnam. The problem is well detailed and well explain that it is not enough to have a local hub (which is already significant with 40k members) but need also to make it effective with strong knowledge sharing and engagement. Developing local content could be an important step to have more local engagement and grow membership. \r\n\r\nThe proposal is important, but the impact you show on the community is somehow limited. You already mentioned a low % of knowledge out of 40k members. Yet, your KPIs are 300 youtube subscribers by month 5 and 1,000 user access every week to the website. Those numbers will not show a big change of trend from the current situation, although engagement and knowledge might be improved. It might be helpful to add marketing activities and budget into the proposal to be able to reach more developers, users and bring onboard external organizations all as key metrics of this challenge.  \r\n\r\nAs someone who lived and worked in many countries including developing countries and rural areas (i.e. in Indonesia), I appreciate the importance of local languages to increase results and engagement. Therefore, making efforts to improve the tools available for the community around localization seems very important and will support the challenge objectives. \r\n\r\n", "q0r": 3, "q1": "The plan seems feasible. The team is local with experience is well detailed, they complementary relevant experience and has a good knowledge of local market need as well as of the Cardano blockchain. \r\n\r\nGood efforts were made to describe the content that will be translated and offer through the hub. The monthly plan seems reasonable and feasible as well as the budget requested which is well detailed. \r\n\r\nI would have recommended thou to dedicate more resources and thoughts to marketing to show how the information center could have a bigger impact.\r\n", "q1r": 5, "q2": "The deliverables are clear and will be a great resource center for locals. The KPIs are well described and can be easily verified, but seems to me that they could be higher for the challenge objective (as described above). \r\n\r\nIt would have been helpful to have a section of risks and challenges, for example, what will happen with the information center after 6 months. ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Establish an info centre with website,youtube,blog...to provide the community official information and documents about Cardano in Vietnamese", "experience": "Team: Marketing specialist,Community Outreach, Project Management, DevOps,Technical Content Writer & Analyst, Fluent in English & Vietnamese"}