{"id": 370194, "author": "", "title": "AtalaGotchi's Community", "url": "https://cardano.ideascale.com/a/dtd/370194-48088", "category": 26118, "amount": 1250, "description": "Scaling up community hubs requires more than business and marketing, it requires cultural collectiveness, fun freedom, and laughter.", "f6_no_assessments": 6, "f6_rating": 1.4444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no real plan in this proposal on what will be delivered or how it will be delivered.\r\nQUASAR has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details ", "q0r": 1, "q1": "Please provide a plan so that it can be evaluated. As it stands, there is not plan so it cannot be implemented successfully. Given the widely varying experience quoted for QUASAR in all the other proposal submitted, some evidence should be provided.", "q1r": 1, "q2": "No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposer has not defined what success would be. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "There was no problem in the problem statement. Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. There is no way to assess the qualification of the team, as a plan wasn't presented. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "While I appreciate the enthusiasm and interest, there is essentially no detail or specifics of this proposal, what it is, how it works, or how it serves to answer the specific challenge. AtalaGotchi isn't defined, nor how this helps to connect to or grow Cardano's community.", "q0r": 1, "q1": "The team appears to have some legitimate and relevant experience, and they may have quality internal plans on how to execute on their vision, but these are not at all communicated in this proposal. ", "q1r": 2, "q2": "There are no outlined KPIs in the proposal aside from a reference to defining success at 3, 6, 12 months somewhere (some external document, possibly). ", "q2r": 1, "assessor": "z_assessor_517", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal unfortunately does not explain anything and thus does not fulfill the formal requirements.", "q0r": 1, "q1": "There is no plan presented.", "q1r": 1, "q2": "No information required for auditing is presented.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Please give more information on how you would address this challenge as this is a great idea", "q0r": 3, "q1": "Experience given by this proposer is relevant and gives confidence this proposal would be implemented successfully ", "q1r": 4, "q2": "As mentioned more information is needed to see how this project would come into fruition, details of a six month plan? Without this it's hard to see the success of the proposal ", "q2r": 3, "assessor": "z_assessor_523", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does not address the challenge at all as it just uses buzz words and mentions important parts of cardano. This does not seem like anything with a real plan or a real team. This proposer has flooded CAs with subpar proposals that do not give enough info and do not have any real plans or supporting material.", "q0r": 1, "q1": "This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q1r": 1, "q2": "This proposer has flooded catalyst with subpar proposals, and many of which are very similar if not identical. Contradicting claims have been maid throughout their proposals, and none of them provide any real plans or any real supporting material.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "AtalaGotchi's aim is to be an open and organic ecosystem, there are no hard coded limits and strengthen delegation to single pool operators", "experience": "Senior Engineers, AWS, Enterprise Tech/Systems, Risk Narratives."}