{"id": 366882, "author": "", "title": "Cardano Project in Spanish", "url": "https://cardano.ideascale.com/a/dtd/366882-48088", "category": 26111, "amount": 6000, "description": "カルダノプロジェクトのスペイン語コンテンツの不足", "f6_no_assessments": 8, "f6_rating": 4.041666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This project clearly addresses the challenge by providing 6 months worth of Spanish language video information on Cardano. They have a large number of subscribers to their channel which are an important segment to keep informed on Cardano.  It would be nice if the proposers included a description on what content they would be covering. Is it technical, are they just translating Charles videos, or weekly town halls etc.?", "q0r": 4, "q1": "The proposers have already been producing these videos for 2 years with a significantly amount of videos, subscribers and watches, and obviously have the capability to continue this. The budget covers are certain number of words per month at a rate per word. There is not discussion of exactly what content is going to be provided or translated though. ", "q1r": 5, "q2": "It will be relatively easy to audit whether they have produced the quantity of work given the monthly budget provided. It would be nice to see some goals. Perhaps metrics around future viewer numbers and growth, or perhaps increased participation in the community from their audience in terms of SPO's, project catalysts advisors or proposers etc. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "- It's a good proposal, making videos to tackle this problem. Although Cardano Community is already writing several contents in other languages, Spanish including, in several different sites, I really think that the more methods the better.", "q0r": 4, "q1": "- One point that troubles me is the way the proposal is priced. I'm imagining how many words there are in a video of 10 minutes. That said, I'm trying to imagine how many videos it has to be done to achieve this $ 1000 (I'm imagining that maybe this number is one). Therefore, I wonder which will be the incentive to do more than one video per month, since just one would achieve the maximum and the number is not defined in the proposal. Since the proposer is doing this 2+years, this is a way to monetize the work which is already being done, which is legit, I am just questioning the incentive asked.", "q1r": 3, "q2": "- As explained in the proposal, every release is going to be a way to audit. However, it is not defined how many is the minimum number of videos we may expect, and since the payment is per number of words, we do not grasp how many minutes of video will be needed to consume that much words.\r\n- The video provided as a proof of work is an official video. Therefore, I'm imagining that you're not going to produce anything. Thus, which are the videos in the line to be dub.?", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "It's true that we are still lacking of Spanish content for Cardano. And this proposal addresses that gap. Providing video materials would be one of the way to spread the knowledge to Hispanic community. And not all of the people are willing to read articles sometimes. This would be a good alternatives for that.", "q0r": 5, "q1": "I know Seba is a good Spanish translator. And his works is already proved in the community. The budgeting is also make sense for the translation, dubbing, editing, etc.", "q1r": 5, "q2": "Community could easily track the progress via Cardano Forum and also his Youtube channel. Maybe adding KPI would be nice, so we know how many video are going to be launched via this proposal.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal was able to identify the problem of few educational materials available about Cardano. He also presented as a solution the translation of videos from Cardano into Spanish but did not specify how many videos will be made. It presents the translation in number of words but this makes it difficult to assess what the impact will be. The objective of the proposal is in line with the challenge, but there is no way to assess what the impact will be as no indicator of success is presented. The project did not have any revenue planning beyond Catalyst so it is not possible to assess whether it will be financially sustainable in the future.", "q0r": 3, "q1": "The proposer showed that it has a youtube channel with many followers indicating that it has the necessary experience to achieve the objective of the proposal. The budget is reasonable but it is given by number of words and it doesn't make it clear how many videos will be delivered. The suggested deadline for the proposal is realistic. The proposer does not present a plan for how the videos will be made. The proposer does not specify whether he will do all the work himself or if he will need a translator. The proposal does not pose major risks to prevent its implementation.", "q1r": 4, "q2": "The proposer does not present a roadmap nor milestones throughout the development. It also lacks metrics or KPIs to enable proposal auditability. The proposal is expected to have an impact on the community but lack of information to measure that impact. It would be interesting to know how many videos will be made, what is the average number of people who will watch each video and how many people will be impacted in total.", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "A great way to continue its support with the Hispanic community within cardano", "q0r": 5, "q1": "With experience noted with videos and translations already existing im confident in the success of this proposal ", "q1r": 5, "q2": "The information provided is sufficient enough to see the success of the proposal and given more allowances planning and details will emerge. ", "q2r": 4, "assessor": "z_assessor_523", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The proposal fully meets what the challenge seeks, which is to take the contents of the Cardano community to people who do not speak English. In this case, the target audience is people who speak Spanish, which, according to the author of the proposal, represents the second largest community involved in our ecosystem. Therefore, translating content into this language is undoubtedly a very relevant activity and will bring a lot of feedback to the community, the problem I noticed in this proposal is that it is a little vague. We know that the present author translates contents, but which ones, exactly? We also know that the chosen platform is youtube, where videos will be posted. But how often? What is the average length of videos? How will these videos be disseminated, will they reach the target audience? It is true that the author already has a considerable audience on youtube, as he declares in the proposal. However, it is essential that this content is widely disseminated so that it reaches the maximum number of people. So I think the idea is very good, but it would be interesting to have more details regarding how things would be put into practice.", "q0r": 3, "q1": "The author already has a channel on youtube and Odysee (I don't know about this platform, it would be good if the link was made available), and also a good amount of subscribers (7k). He knows how to communicate very well and has a broad command of the Spanish language, as can be seen in the video attached to the proposal. In this sense, it is clear how much he is able to handle the communicative part of the issue. What I was a little doubtful about is: who is this author, exactly? What is his background, how does he understand the Cardano universe? It would be very interesting if we were provided with more details about their history, their knowledge, works that were not necessarily linked to the videos. I think a lot of the confidence we already have, if a linkedin profile were added or even a more detailed description of the author's trajectory, his credibility would certainly be strengthened.", "q1r": 4, "q2": "As with the items previously evaluated, we have positive and negative points here. It is very good that the author explained in detail how the requested money would be used, his accuracy is really accurate here. However, there is a lack of detail regarding two things: how often the videos would be posted (and their average duration) and what content would be taught. It would be good if he drew up a plan of goals, showing us what each video would cover, the date on which it is intended to be published and its estimated duration. The notion of how this work would be in practice became somewhat abstract. Despite all that, the attached video brings a lot of assurance that the author knows how to perform this task, after all, it's 49 minutes of explanation in Spanish of the neglected subjects. In this way, we do have a trust. What I missed was understanding the details of how it would actually happen, as well as the success metrics that would make it easier for the community to follow up.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal effectively addresses the challenge because they already have a successful Spanish youtube channel with many views. They have achieved this goal because they have a plan and have already been completing that plan for the last 2 years. However this could be improved by more details, such as information about their videos as well as their content.", "q0r": 4, "q1": "It is likely that this proposal will be implemented successfully because the proposers obviously already have an expertise in this area as they have been doing this for 2 years. The plan is simple but it achieves the goal of delivering content on Cardano to the Spanish speaking community.", "q1r": 5, "q2": "This proposal is easy to audit because their plan is to deliver more translations services for six months. They haven't mentioned anything about getting more Spanish people on Cardano. It would be nice for them to have included this and to use it to measure the success of this project.", "q2r": 4, "assessor": "z_assessor_585", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": " I agree with the proposer there is a vast amount of countries out the in south america and the Caribbean that are in the dark about the Cardano potential or access to educational conversations that take place in Cardano. This would definitely expand the Cardano community with the information needed to be transcribed in their native tongue language.", "q0r": 5, "q1": "Spanish speaking is my first language and after checking the white board video transcribed I can attest to the great work done in translating such a valuable piece of material that is the essence  of Cardano.", "q1r": 5, "q2": "There are key metrics shown and track of the funds breakdown. But more information regarding the stage by stage progress needs to be highlighted. Perhaps 1st month what material requires the most attentiom, 3 months have a key metric of atleast 10 translation done and 6 months 30? or how will the reach will be measured on each stage.", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "ヒスパニック系コミュニティにカルダノプロジェクトの情報を提供するためのビデオ資料の提供", "experience": "\\+ YoutubeとOdyseeの両方で、1k以上のビデオが公開されています。\n\n\\+ 7,000人以上の購読者\n\n\\+ 400k Total Views\n\n\\+ 40k Total Watch time (hours)"}