{"id": 370032, "author": "", "title": "Catalyst Course in Vietnamese", "url": "https://cardano.ideascale.com/a/dtd/370032-48088", "category": 26111, "amount": 10420, "description": "ベトナム人コミュニティを対象とした調査では、89%がカルダノのエコシステムを促進する重要なプロジェクトであるCatalystについて知らない、または関心がないという結果が出ています。", "f6_no_assessments": 7, "f6_rating": 4.142857142857143, "videos": [], "media": [], "f6_assessments": [{"q0": "This plan is to produce information the bring more of the Cardano community in Vietnam into Catalyst. They have done some research and found 89% have not even heard of Catalyst. The catalyst community globally is quite small, how does this number compare to the rest of Cardano users? Perhaps a smaller project on outreach to build a community that wants to know more about Catalyst would be better than come back with funding for the course if there is demand?", "q0r": 4, "q1": "The team have the experience to be able to produce the content described. The plan is still a work in progress with the first month involved in writing the white paper and designing the courses. Whilst the budget included a line for marketing, more detail could be provided on the size of the community and how they intend to market to it. Are they are already heavily involved?", "q1r": 3, "q2": "Audit of delivery of the content should be realtive simple and they have included a plan to survey after the courses to measure how successfully they were. It would be good to have some goals around the number of people they expect to take the courses to measure the impact, and then around how many will become active members of the Catalyst community.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As Vietnam is an emerging market in Asia and rapidly expanding economic influence, it is favorable to enter this market early on and establish a presence there. Courses in Vietnamese are more likely to attract people to the innovative incubator that is Project Catalyst. These people could in turn identify needs in their homeland and beyond in that region of the globe, accelerating the process of Cardano developing high-impact projects. ", "q0r": 5, "q1": "Marketing, translations, content writers, the team has all elements that are needed to create this and provided verifiable accounts. ", "q1r": 5, "q2": "Well written proposal. There is a detailed budget, plan and roadmap. In the problem statement it is claimed that 11% of the Vietnamese community knows/cares about Catalyst. Is that the Cardano community or the entire Vietnamese population? Because if it is the latter, that would translate to ~10M people being aware of us in Vietnam alone, which is massive. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Very well written proposal, with a consitent problem (Vietnam Cardano community not knowing or caring about catalyst) statement and a clear and solid plan to adress it, based on consolidated management methods (e.g. PDCA, 5W2H).\r\nHowever, one thing that it would be nice to add here, and that why its not scoring 5 starts, is the size of vietnam cardano community that the 89% was bases upon. it could be said here both in absolute and relative (in relation total cardano community) numbers. it would help to address the total impact of the iniative. I'd add also the source of the survey to verify this number which generated the stated problem.\r\n\r\nAs further suggestions,  there could be an increase in the target audience to look for potential vietnamese people that are not engaged in Cardano yet but could, as, for instance, university students from several areas (programming, arts, business, egineering) or even companies. It would recquire and extra step of engagement with them, probably more laborious and it would be necessary to educate them in Cardano/blockchain/smart contract at first. It could have also more information on the course itself like, saying whether it would be live or recorded, if the record will be available aftewards, basic content, if there'll be a space for Q&A, etc.\r\n\r\nOther thing that would be nice to see is a more detailed \"next steps\" sessions. After first round of courses is concluded, is there a plan to have more rounds? it seems it does but how would it be funded? via another catalyst fund or the intent is to become self funded? if it is the latter, how? These info would help to have some sense on sustainability of the course.\r\n\r\nMoreover, i'd also consider a proper communication/marketing strategy to annouce the course within and outside Cardano community. It should include emails, anoucements in general telegram channels, paid posts in social media, etc.\r\n\r\nLast, thinking of scalability, if this iniative does get funded and is a success, the proposers could have everything well documented and engage with partners in other countries to replicate the methods and lessons learned to other languages of high impact.", "q0r": 4, "q1": "4 experienced people with diverse background, including development, project management and online marketing seems enough to put the project in place. It was very nice they put references (Linkedin, twitter, etc) to verify the information provided on their experience/background is true!\r\n\r\nRegarding the plan, it is robust and well writen. The only thing that seems not much feasible is translating, editing, and updating all advanced Catalyst content from the official Catalyst information in only 1 month. it seems a lot of work, especially if carried out in parallel with other activities. Maybe some section in the content should be done (or, if this is already the intent, make it clearer in the proposal)\r\n\r\n\r\nAs for the budget, it seems fair, for all the work that will be necessary in the plan, and with a sensible cost breakdown.", "q1r": 4, "q2": "There are some milestones that could be drawn out from the plan/schedule and even some metrics related to number of lessons but it doesnt seem to be enough.\r\nIt would be interesting to follow up with the total numbers of people reached in anoucement/communication phase, the number of people attending both basic and advanced course and have an update on the number of \"89% don't know/don't care about Catalyst-an important project that promotes cardano ecosystem\" which motivated the project, after each course round and also the growth rate of Vietnam Cardano community (maybe this course can increase its rate, right?). Some quality indiactors could be nice as the satisfaction or knowledge of the students after the course, which could be measured by a survey.\r\n\r\nAs for challenge/risks, I'd consider really reaching target audicence, keeping the interest after course finishes (maybe some mentoring, a discussion channel or at least a regular follow up could exist aftewards) and not  meeting the proposed timeline, which is very challenging.\r\nThe risk on the quality was managed and mitigated by \"Community Survey about Catalyst Course -->Get Feedback --> Review --> Improvement according to PDCA (Plan-Do-Check-Action) -->Community Report.\"\r\n\r\n", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The Catalyst Project has to have in mind that reaching more people, respecting and embracing the diversity of people and ideas we have more chances to impact the world with Cardano and improve its ecosystem. Thinking about that, translating and teaching content about Catalyst to Vietnameses is a good way to reach more people that can start to contribute to Cardano ecosystem. The potencial impact is big due to the Vietnam population (~96 milions of people in 2019 - Statista) - most of these people don't know about Cardano existence because they don't speak English, even less about Catalyst. This proposal shows a good way to start to solve this problem. \r\n", "q0r": 5, "q1": "The co-proposers explain the project step to step and put the price of each necessary item. They are clear about the deadlines but they could be clearer about the number of Vietnamese they want to reach per month. The team seems to be complete enough to make the project happens due to the specialization of each co-proposer.\r\n", "q1r": 4, "q2": "Considering the idea of making a course to teach about Cardano and Catalyst, a usefull way to audit the project success is monitoring the number of people participating in the course. It's necessary that the proposers establish a goal of number of students getting in the course per month and even concluding the each course. Other way to audit deep is to account how many of these students are starting to join Catalyst Project. This last one is a good way to audit this project impact directly in Catalyst Project. \r\n", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The solution for the problem would benefit the vietnamese Community allowing people who doesn't speak english learn about cardano, expanding cardano ecosystem", "q0r": 5, "q1": "The team has relevant experience to put the plan into practice. The budget was very detailed and looks in line with the proposed work.", "q1r": 5, "q2": "The proposal presents a well-defined roadmap and key metrics providing a clear understandable description of the solution and information to assess the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Perfect initiative to be a Catalyst for the Cardano ecosystem. Seeing that Vietnam is still an early Country in development this could be a cruel step towards building a community. Providing the necessary documentation is the native language is what we need. This aligns perfectly with the challenge.", "q0r": 5, "q1": "I really like the details given in the proposal. Everything needed for this proposal is here in the team. Marketing specialist, outreach in the community, management. I have full trust that the team will make this work. It's rare to see a plan as well-written as this one. There isn't anything that is missing to give doubt that this proposal will not be implemented successfully. ", "q1r": 5, "q2": "Every aspect needed for audit in the later stages is present, a plan, budget breakdown, and a proper roadmap. The proposer gives a clear view that he understands what needs to be done. Even metrics are given. One thing that could've been included is the survey that was done by the proposers because I'd like to know what the user group was for this proposal. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This focuses specifically on learning about Catalyst, rather than general learning about Cardano, which is a useful idea, relevant to the challenge, and with potential to improve engagement and participation in the Cardano ecosystem. And the survey result quoted in the proposal shows there is a knowledge gap that needs to be addressed.\r\n\r\nBut that survey result also shows a potential problem with the proposal's impact – it says that many Vietnamese people not only don't know about Catalyst, but don't *care*. If they don't care, and nothing is done to raise their interest, will they attend the course? There is some attention given to marketing the course in the proposal – but not really enough, given that this seems to be the main hurdle to overcome. Or, if the proposal will focus on those who *do* care, and are already in the Vietnamese Cardano community- they're already engaged with Cardano, so the impact in terms of the challenge's metrics is not large.\r\n\r\nBut it's very good that the proposal includes time for collecting community feedback and reviewing; this will increase the likelihood of creating something with impact.\r\n\r\nThe proposal addresses similar concerns to the Catalyst School's proposal to work with Eastern Town Hall to train bilingual trainers – but the difference here is that this proposal is specific to Vietnam, and it doesn't require bilingual trainers, since it's more about sourcing and translating materials for an online course that people can follow at their own pace. This seems like it might reach a different (maybe earlier-stage?) audience from the Catalyst School proposal, which is good – the two proposals seem complementary – but for maximum impact, it might be good if this project signposted participants on to Eastern Town Hall's training.", "q0r": 3, "q1": "I find it hard to feel confident of this. First, nobody on the team has any background in, or experience of, developing online training, and there are no plans to bring those skills in. Developing training is quite specialised work, so they would need that expertise. I also feel  (as someone who *has* developed online training) that their month-by-month plan is quite tight, and they might have underestimated how long it will take to complete some of the tasks. For example, they only allow 5 minutes per video for post-production and editing, which is not really enough to produce something engaging, and allows no leeway if there are any issues with a recording.\r\nThe budget seems reasonable apart from this; but overall I can't be sure it's feasible.\r\n", "q1r": 3, "q2": "The audit metrics are not very clear, so I don't feel I can know whether they'll be sufficient. Obviously we can audit whether the course is created, and how many attend it; but I'd like to see measurement of things like how many drop out, how many go on from the \"basic\" course to the \"advanced\", how many report that they have learned something about Catalyst, and how many go on to have any longterm engagement with Catalyst. It's not clear how or whether these types of things will be measured and auditable.\r\nThe team will do a community report/survey at the end of the project, which is great – but it would be good if they had included some information on what types of things the survey will ask and measure. ", "q2r": 3, "assessor": "z_assessor_540", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "ベトナム語でのDesign Catalystコース", "experience": "チーム：マーケティングスペシャリスト、コミュニティアウトリーチ、プロジェクトマネジメント、DevOps、テクニカルコンテンツライター＆アナリスト、英語＆ベトナム語堪能"}