{"id": 414002, "author": "konmaorg", "title": "BigBucs- Crypto Cashback Platform", "url": "https://cardano.ideascale.com/a/dtd/414002-48088", "category": 26593, "amount": 50000, "description": "The Cardano ecosystem has avenues of having e-commerce platforms associated to the blockchain. An incentivizing factor which drives individuals to use ADA pay or e-commerce sites on these platforms. ", "f6_no_assessments": 7, "f6_rating": 3.2380952380952377, "videos": [], "media": [], "f6_assessments": [{"id": 4766, "q0": "This project is not on the ETH or any other platforms, so we cannot say that the project aligns with the outlined challenge settings. The proposal does not state how the project will add value to the Cardano ecosystem. The project was launched a couple of years ago and did not achieve promising results, as we can see from the negative user comments. The idea of Konma Org to guide, help this project to start working on the Cardano platform in the future could have a positive impact on the Cardano ecosystem. It would be good to develop a plan for future sustainability so that the community can be sure that this project will come to life and be self-sufficient.", "q0r": 3, "q1": "Both teams BigBuc and Konma Org are transparently presented via links in the proposal. We can clearly establish the number of people in the team and how the teams have the necessary knowledge, experience and skills to implement this project. My advice is that the budget and verifiable plan should be better elaborated and presented to the voters. It would be good to present clear time frames when exactly the work starts (eg.November 2022 till May 2023). For such great ideas, it would be good to have a plan for implementation and worked out possible risks.", "q1r": 3, "q2": "Although the roadmap with milestones was presented, my advice to the team is to work out the time frames for achievement in more detail, and the milestones themselves would be good if they were worked out more precisely. KPIs are presented in this proposal, but I would also like to see a little more elaborated models in which way the community will be able to monitor the updates and development of this project.", "q2r": 3, "assessor": "z_assessor_2616", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7401, "q0": "The proposal presents an e-commerce platform called BigBucs, which is conceptualized to launch on the EVM (especially Ethereum) ecosystem. They then consider building on the Cardano ecosystem, helping to attract new users, so the project is suitable for this Challenge.\nAs far as I know, the number of users on the Ethereum ecosystem is very large, developed for a long time, suitable for e-commerce services. Can you clarify why you chose the Cardano ecosystem over Ethereum? To make your proposal more convincing. For example, the Cardano ecosystem is built using the Haskell language, running more properly. The eUTXO ledger makes data easy to retrieve, reliable. The fee per transaction on the blockchain is much lower than on Ethereum, which gives more discounts to consumers\nYou guys listed market opportunity metrics, the growth margin is huge, which is great. This proposal wants to create a place for e-commerce transactions and users to be discounted through a token called BUCS. So what are its advantages, is it really better than traditional e-commerce sites? Please exchange for a better understanding of the community.\nAfter consulting the links and suggestions provided, I was really surprised at what the team did. App has, full basic features, intuitive interface. The next important step is to build on the Cardano ecosystem. With small exchanges like the above, I rate this section 5 points\n", "q0r": 5, "q1": "The project lasted for 8 months, divided into phases such as design, development, testing and evaluation. The stages are divided into small steps that are quite detailed and relevant\nThe detailed project budget should list more specifically through small steps like on the plan, how much each step accounts for. For example, developer costs, front-end costs, back-end costs, etc. Make it easy for the community to assess the correctness and relevance. The total budget I see is 6k + 6k + 8k = 20k, a different number than the [GENERAL] Requested funds in USD section is 50k, is there any confusion?\nThe team consists of 4 members, social networking links are provided. The team has extensive experience in building application platforms, including Haskell developers, administration, and marketing. Diverse capabilities in areas to build projects. I rate 4 points in this section\n", "q1r": 4, "q2": "You mentioned 5 indicators, but only the app download index is intuitive and easy to quantify. I really don't know how to quantify metrics like story scores, weekly reviews… Instead, you can add metrics like app features, service providers connected connections, the number of customers using the service, the number of BUCS for discounts. I think they are easy to measure and quantify. At the same time, these metrics have the power to help the project assert its effectiveness.\nThe success of the project is very expected, the e-commerce segment has many users, the growth margin is still very large. Hope I have helped the project through the suggestions. I rate this part 4 points\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10459, "q0": "This proposal wants to create an e-commerce platform where people will buy products where they can also pay using ADA Pay and also wants to address the problem of long waits for cashback on purchases. The app in question will serve as a second layer of e-commerce e-stores through which users can make purchases and this should encourage more customers to come to the Cardano platform. I don't think this is in any way related to migrating users from the Ethereum ecosystem to Cardano, and thus unrelated to the message of the challenge, as the proposer themselves mention that they only planned to develop this idea in the Ethereum ecosystem. At the same time, it's not entirely clear to me why another cryptocurrency called $BUCS is good for customers to receive with every purchase, which they can then stake or use to buy other products. I don't see the connection to the Cardano ecosystem with this and what value it would add to Cardano.  It would make more sense to me if the cashback were paid with ADA. At the same time, I don't see a process or model that would guarantee the self-sustainability of this project. Rather, all I see is that funds will be exhausted and then more will be requested. ", "q0r": 1, "q1": "There is plenty of information and links in the proposal about the Konma team, whose previous work can be seen in other proposals on Ideascale or Linked-in. The timeline is expected to take 8 months and is divided into 4 phases namely design phase, development phase, audit and deployment. It is described in detail what problem the team will be working on, but there is no justification as to why so much time will be spent on each problem.  I also miss a more precisely calculated rate per hour for each team member. If staking and DEFI cryptocurrencies of BUCS don't add any value to Cardano, I don't think there's any need to develop it either. The plaintiff is asking for $50,000, and the budget feasibility description says he only needs $6,000 for Beta App, $6,000 for Beta Webapp, and $8,000 for smart contracts. Which is a total of 20,000. Why these amounts? But why does he need another 30,000? It is not mentioned in the proposal. The budget description doesn't include justification for these amounts, and these are only prototype concepts and not real products. It is not clear from the description who will do what. Overall, the feasibility of this project strikes me as very unthought out and with very little information on what will be done with the funds. On the positive side, the proposal provides technical details, e.g., in which programming language the application will be developed, what user environment will be implemented, etc.", "q1r": 1, "q2": "The plaintiff states that success will be measured by a \"Kanban board of features back log sheet\", it is not clear to me what this is, what it looks like and what it will measure. He further states that it will be measured by story points, number of app downloads and number of transactions in Cardano. There are no milestones listed in the proposal, no specific accomplishments they would like to achieve with this project. I agree that this proposal is easily measurable, but I am no longer sure that the activities measured will contribute to the Cardano ecosystem.", "q2r": 2, "assessor": "z_assessor_3187", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13585, "q0": "First, in the content presented, the author should limit the use of images. Because it's a huge barrier for non-English speakers to understand the author's presentation of the proposal.\nThe image the author put in the proposal is so small, I can't see what the picture is about. I scrolled to the bottom of the suggestion and couldn't find the attached image that can be viewed at a larger size. This is an omission that the author did not anticipate. The author should draw lessons for future proposals.\nAs for the impact, I have not seen the author describe how the process will go into implementing this proposal, so I cannot understand how the author and team will complete the proposal.\nNext in the solution presentation, the author talks very briefly and completely about the solution they will tackle the challenge. I have re-read this content 3 times and think it is very complete.\nFinally, in the risk assessment section. I would like to add a few pointers on other risks the project may face. For example, the infrastructure on cardano does not meet the requirements of the project, Smartcontract fails due to inexperienced programmers.\nI found this proposal to be an interesting idea and has a solution to the requirements of the challenge which is quite specific but needs more detail. However, the author encountered a few errors in the presentation and did not anticipate all other risks.", "q0r": 4, "q1": "In the implementation plan, I don't see the details and need to be added: Who is this task performed by?\nI don't see any mention of the person in charge of performing the task for each job.\nThe description of expenses is not detailed and clear. Another big mistake is using acronyms without captions. I don't understand what the word MVP means in the article, even though I searched for this acronym on Google, it didn't come up with a suitable meaning. The lesson here, the author should limit abbreviations or, if any, should have clear captions.\nIn the cost description, I see the cost that the author mentioned has 3 items and total is 20,000 USD. But the required budget of the proposal is $50,000. These two numbers are completely different, I don't understand if this is a typo or the author has not list all other expenses.\nLooking at the team members on Likedin, I see that they are a team with a lot of experience working in Blockchain and have the right skills to complete this proposal.\nTo sum up, I think they are not a good and clear planning team. This will hinder them in the implementation process and the risks will come a lot if they do not anticipate other big risks.", "q1r": 3, "q2": "The content presented in the proposal lacks a lot of information and is not detailed. This error comes in part due to typographical errors and the way the content is presented. The implementation plan is not clear and there is a discrepancy between the total cost listed and the required amount. It is two completely different numbers.\nIn this business model I do not see its sustainability. For example, when a user makes a purchase and is rewarded with $BUCS, then they use $BUCS to stake. The question here is whether that interest is generated with the $BUCS token itself or out of another token. And who will buy $BUCS to avoid this token from inflation and devaluation.\nHere is a share of my perspective on this business model. This is just to give voters another perspective.\nI find the information presented in the proposal is incomplete and needs more information. Due to the lack of specific planning can lead to slow progress of the team, this will cause the team not to complete the proposal.\nIn my view, the team still has a 35% chance of completing this proposal.", "q2r": 3, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13666, "q0": "This proposal idea is simple and easy to understand. This idea may seems old but if we use this in crypto it will change the e-commerce market. This proposal deploying in Cardano instead of Ethereum is a good oppourtunity for Cardano community and the person who wants to shop in Amazon etc can pay using ADA coins. It will increase the transactions in Cardano too and creates a better e-commerce website in blockchain ecosystem. This proposal has effectively addresses the challenge. This proposal mostly depended on its token named BUCS. It is a utility token which has staking feature, payment feature, a credit system using this token. In very drastic bear conditions  every token will be down even this token too. After that,some tokens will survive. Their is a great chance this proposal is in for a long run. ", "q0r": 4, "q1": "Their is a high chance that this proposal is in for a long run and it is highly likely to be implemented successfully. They are developing a consensys of proof of concept mechanism. To develop that the team needed 8 months time. I checked their website and they even had an in playstore. It’s up and running. The UI is good and has no disturbances, it went smoothly. The budget is clearly explained and it is enough to develop a poc mechanism. The timeline is accurate and it is enough to create a stabilized and a better UI platform. The proposal explained the challenges facing in web2 and brought solution in this platform which solves major problems in e-commerce like Instant cashback feature, zero fee transactions, unique credit system, rewards in crypto etc.", "q1r": 4, "q2": "The proposal has all the required information to audit the progress and the success included all the relevant links, images, website, team information etc. Their is one thing that concerns me that their is no tokenomics i can find about the BUCS token. BUCS token plays a major part in this E-commerce platform. Tokenomics help the token how much circulating supply and total supply available in the market. The team clearly described the budget for developing the proof of concept in 8 months. This proposal is a well-planned project and it clealy shows the success of the project. This proposal satsisfies the targeted   problem against proposed outcome. The project partnered with with affiliate brands like Amazon,boat,Oneplus,jbl etc. The team provided a public channel if their are any queries that can help a community member. ", "q2r": 3, "assessor": "z_assessor_3735", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14115, "q0": "The linkage between e-commerce and blockchain is a pretty good idea. This can be an effective marketing way for Blockchain. It likes Blockchain applications in daily work life. Since then, many people have been approached and encouraged to use the platform's tokens. The platform has its own native token $BUCS. Users can get refunds quickly at a much lower cost than traditional methods. They can use these tokens to make purchases. The market volume of E-Commerce is huge so a small change can bring big benefits. In addition, this platform also has several utilities to help users make more profits. This is a win-win cooperation model for both the platform and users. So I can conclude this proposal quite effectively solves the posed challenge.", "q0r": 5, "q1": "They estimate the proposal is implemented in 8 months with 4 main phases. The work items are quite clear and detailed. The team consists of 4 main members and they all have experience in operating loan applications. They have been trained in Haskell and Plutus, they are experts in different fields. However, with a lot of work, I'm a little bit concerned with the completion time of this project. They mentioned two risk factors of the proposal: The support of CIP; scalability and adoption of the platform. I think these factors are not enough and should be added: User acceptance; Bucs price stability; Is the Bucs guaranteed in real value? and why not use a popular and stable coin like USDC, BUSD, or USDT,... So that it can be used on different trading floors, creating convenience for users. And cashing flow management is also a dilemma.", "q1r": 3, "q2": "Their goal of success only stops at a POC and they need money to continue the deployment MVP in the following rounds. The factors that evaluate the credibility and success of the proposal are not appropriate. I would like to see this information presented in more detail and clarity. It is possible to add detailed indicators: the number of users who have been refunded in crypto; How much total refund value? or profits that users have earned from APR on staked tokens, Buy Now Pay Later (BNPL) - decentralized credit system & NFT as rewards. In addition, a dashboard that directly tracks weekly reports of long-term projects like this is needed.", "q2r": 3, "assessor": "z_assessor_3906", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14145, "q0": "This project was originally planned to work on the EVM ecosystem, but has since changed to the Cardano ecosystem and is planned to integrate with ADA pay. This aligns well with the challenge because this project would be a new project for the Cardano system that would incentive users to use the Cardano ecosystem rather than the EVM. The authors state that they can go live in 50+ countries, but it appears that they currently only operate in India (from information on the app page – not given in the proposal). However, that’s a good start and not a concern at this stage because India is such a large market.", "q0r": 5, "q1": "The budget requested is $50 000, but no detailed information on the budget breakdown is given. The authors state that they need $6k for a beta version of the app, $6k for a beta version of the webapp, and $8k for the smart contract, but this only accounts for $20 000 of the requested $50 000. No pay rates or further breakdown is given. This should be addressed by the authors as they do not sufficiently explain their use of funding. The team appears to have the relevant experience in technical fields and planning. However, the team member names given on the proposal in Catalyst is not the same as those given on the BigBucs website - three members are the same and one is different and there are several more team members mentioned on the website that are not mentioned in the proposal. So it is unclear who will be doing what exactly and if the other team members on the BigBucs website will also be involved. \nThe authors mention that they could run into problems if CIP (Cardano Improvement Proposals) standards are not supportive and that they would submit another proposal with solutions to deal with that. However, they don’t provide any more information on this nor do they provide a link to the other proposal. This is a major issue because the fund needs to be sure that the authors have a good plan to deal CIP standard issues if need be.  \nThe budget the authors requested is only for a POC and so the MVP will not be achieved with just this funding. It is not entirely clear whether the authors intend on raising more funds via Catalyst. They give some detail about how they intend raising more funds, but nothing more specific than “challenges such as dapps and integration or developer ecosystem”. Without a MVP at the end of this funding and with a great deal more funding required and without a detailed plan for obtaining it, this project leaves many unanswered questions about how the MVP will eventually be obtained.\nThe website states that they are affiliated with brands such as Amazon and Lenovo (and many others) which is promising as these are brands with huge international presence. Also, on their app page on PlayStore, they currently have more than 500k downloads which is also promising. However, this raises the question of what exactly the POC will entail because they appear to have a functioning app but also require the funding to develop the app. This is confusing. The roadmap they provide in the proposal is detailed and provides a good indication of what they want to achieve and in what timeline. From the roadmap, it appears the app is not yet developed. Some clarification on what exactly currently exists would be useful. The whole project (including parts that are outside the funding scope of Catalyst) is predicted to be completed at end of 2023 and their website specifies what their goals are for each quarter until then which is useful. \nThe authors state that multiple cryptocurrencies can be used in the app – this will appeal to consumers and broaden the customer base.\nThe authors state that their project will allow anyone to get instant credit for Buy Now Pay Later schemes, but it is not explained how this credit will be secured and how they plan on mitigating the risk of people not paying.", "q1r": 2, "q2": "Measures to keep track of progress seem clear with a mixture of quantitative (e.g. number of downloads) and qualitative (e.g. weekly reviews) measures provided that will be shared with the Cardano community. They do not give an indication of how many downloads is considered success so a more concrete KPI would be useful. \nAs mentioned before, what the POC entails exactly is unclear – the authors state that success would entail “a successful POC, where users can download an app and buy products on Amazon and other ecommerce websites” which is confusing given that their website provides a link for the app to be downloaded already.", "q2r": 3, "assessor": "z_assessor_3925", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Users will be able to buy products and services through an app & receive cashback on our native $bucs token . The tokens can be staked for passive rewards and used for buying products as well. ", "experience": "Previous ran a lending app platform which has around 10,000 concurrent users. Konma Labz has in house talent of Haskell developers who are undergoing Plutus course.\nThe team also consists of experts in various factions such as legal, governance, marketing, and programming"}