{"id": 417658, "author": "ebenkohn", "title": "Cardano NYC 🤝 ETH NYC Communities", "url": "https://cardano.ideascale.com/a/dtd/417658-48088", "category": 26593, "amount": 65000, "description": "New York City serves as an influential hub for the crypto community (locally and globally) yet Ethereum's ecosystem takes the center stage while new/old crypto folk ignore Cardano's growing ecosystem.", "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 1290, "q0": "The proposal aims to participate on a seminars focused on the Ethereum community with a collaboration with CryptoMondays, by becoming a PartnerHosts of these events, or at least one of four weeks every month, for the duration of 3 months. So it makes 3 to 12 Mondays, where the proposer intends to be a partner host. By becoming the partner host, they will provide support with venue and arrangements, offer onboarding materials and coordinate in-person seminars. Regarding the content, the they plan to address the low recognition of Cardano within NYC (information, guidelines, and hopefully redirect the new inflow from ETH to Cardano) via these meetings, which we can categorize to the form of marketing and providing information source. About risks – I completely agree that the most significant risk will be rejection from ETH maxis, good luck tackling that one. Since the goal is to migrate these ETH users to Cardano, it would be nice to know how many participants are actually coming to these CryptoMondays, how many are actual users of ETH, or just visitors (or at least rough estimation, what the outreach will be). I have found, that there is 9k members of CryptoMondays, and selecting a random meeting, it appears that the attendance is approx. 100 people, then I have checked another, and there were 1k attended, so I selected the third, and there was 200 attendees…from that, it is unclear to me how many people proposers plan to outreach, which is posing the question how impactful it will be.", "q0r": 4, "q1": "The roadmap is set for three months starting in September, and the content of these meeting is to show cardano ecosystem, networking sessions, chats with devs or project founds and eventually on-boarding of new members. The budget requested is 65k, which again, is hard to judge given that there is no information of how many people they plan to accommodate, and what spaces will be rented. \nNevertheless, more detail could have been provided on the following: 1. Cardano material – what exactly it will be? Some work in process to display props, or what is expected to be delivered? Or at least list of possible items e.g. posters, flyers etc. 2. Food and beverages could have been set per meeting, not per month. (since the number of meetings is 1-4 per month, the calculation for food and beverages could have been as well). The last item – Cardano NYC community coordinating team – 5k/month – what actions does it involve? What is the expected time donation? For how many people? \nAbout the team, there are three members, with a short bio and twitter links provided, and also some relevant experience is stated on the top of the proposal. The only proof of already organized meetings I was able to dig was from 2019, in the album in the meetups, so some update on that would be nice to have. (proof of meetups, to assess meetups quality, records, pictures). Overall, if being a partner host is the ultimate goal, it is feasible, but more information is required on some items to obtain a better picture regarding to coordination of seminars, and onboarding itself. ", "q1r": 4, "q2": "As for auditability, the problem solution is clear (lack of Cardano recognizion -> make cardano more visible by spreading information about it, during crypto meetups). Regarding KPIs, there are responses from ETH to Cardano events, new Cardano wallets created during meetups (but I am not sure if it is a reliable metric, unless you plan to track on-chain activity for these wallets too), and the number of participants on these events. I suggest to provide some posts(articles, blogs), records and pictures from meetings. That is the best and easiest way how to allow community to track it. Maybe set up a twitter/IG account, and make a live videos, stories. Regarding the success of the project, the first two metrics are not really helpful, only the third one – participation – is a relevant metric that can be tracked. Basically you wan to see an increasing trend over the time in the number of participants, and you can also disclose discord, and track these numbers too. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3613, "q0": "Cardano Community Development Topics Through ETH NYC Workshops\nSolution: organize community events to introduce Cardano to the ETH NYC community (build and develop Cardano right in the ETH community) with the name of the event CrytoMondays.\nbringing ETH NYC community and resources to Cardano solving the challenge:\n- lack of recognition,\n- lack of community information and guidance,\n- pick up new people with the pipeline through Cadano.\nWith this proposal, it will help to increase the number of old and new members in the Cardano ecosystem.\nCurrently the Blockchain Community Center in New York, the future will be many cities around the world\nThen there will be an Ethereum to Cardano migration.\nRisks are reasonably challenging and predictable.\nEach risk has a solution associated with it\nĐịa điểm được nhắc tới là New York, dường như tương lai dự án chưa có kế hoạch tổ chức mở rộng sự kiện ở thành phố khác", "q0r": 5, "q1": "The detailed planning process is concise and reasonable in 3 months, each month will have at least 1 day.\nDetailed budget allocation for all related stages. The budget allocated to personnel is quite small, less than 10% of the total proposed budget, is it too little. Organizing the event will need a lot of support staff, I don't think the budget reallocation is so small.\nThe proposed budget is reserved for any stage or thing, I don't see the reason, the proposal needs to add details for the community to evaluate its reasonableness.\nThe proposed team of 3 people are all senior coordinators of the Cardano community, what documents prove their position, why the proposal does not include a detailed link for the community to refer to, no specific information How can time experience stick with blockchain especially in terms of time.\nTeam members are also not assigned specific tasks\nThe minus point of this team is to reduce the feasibility of the project, this is a completely new project", "q1r": 4, "q2": "There are 3 defining KPIs: - RSV count for Ethereum - Number of new Cardano wallets created at the event - Average amount for Ethereum. These indicators will be verified by the community if publicly reported. The successful description of the project shows that the real challenge has been solved - Lack of recognition => Ethereum community experiences more than the ecosystem - Lack of Cardano related information => more participation in weekly Cardona NYC community events - Newcomers to Ethereum, the destination is Cardano => Ethereum community members join the Ethereum ecosystem.", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 5087, "q0": "This proposal is a $65,000 ask to co-host a NYC networking party one week a month for 3 months to explain Cardano to possibly Ethereum Devotees at events already being held by “Crypto Monday”. The solution to the Challenge in the proposal problem statement of “Ethereum ecosystem takes center stage … while Cardano is ignored in NYC”, is to “ …spotlight Cardano by organizing seminars…” . The impact statement includes : 1. Lack of Cardano recognition in NYC, 2.lack of Cardano related info & guidance for Ethereum members”, & 3.redirecting pipeline to Cardano.\n——————————————————————————————————————————\nThis Challenge is one of the most simple and straight forward write ups’ as far as Challenges go: “How to make it easy and fast for dApps and other projects to expand or completely move from Ethereum to Cardano”?  Other side notes all refer to “projects”, EVM - based Blockchain, IELE, Milkomeda, ERC20 Converter. The Challenge Success statement is also about projects.\n—————————————————————————————————————————-\nThis proposal does not appear in my assessment to focus on the challenge. It is solely based on individuals, parties to onboard individuals to Cardano, Networking in clubs in NYC but nothing about making it easy to move from Ethereum to Cardano. On the other side of the story some may feel networking and handing out merch and free food and drink is a methodology to bring in projects from Ethereum. \n——————————————————————————————————————————\nMy Assessment is a three ( I am neutral about this meeting the objectives laid out in the Challenge) star.", "q0r": 3, "q1": "There are two main overriding questions in the Feasibility section: 1. How likely to be implemented and 2. Does it solve the problem. With a number of minors sub questions e.g. Skills, Experience, Budget Clarity, Timetable, Risk Management. For the first question I believe that it is fairly easy to implement. Pay money to an existing and successful 50 or so franchise Crypto Networking business - Crypto Monday, hand out merch, free drinks and food and get the Cardano name exposed to those attending and some press.  On the second question it is not explained and I have not gained an understanding of how this proposal will Solve the Problem of -“Answer\nRisk: The lack of good cooperation from \"old guard\" Ethereum folks a.k.a. Ethereum Maxis\nSolution: Build a warm and inclusive atmosphere that is considerate and acknowledges bias while delivering factual information and engaging experience.  “How to make it easy for DApps and other Projects to move from Ethereum to Cardano”.\n—————————————————————————————————————————-\nOn the other criteria for the Feasibility assessment, Budget Clarity is murky. The budget breakdown per month, for one evening of networking as a co- host to Crypto Monday is : 1.$10,000 rent; 2.$2,500 Swag; 3. $2,500 Food and Beverage, 4, $5,000 Team Support and lastly 5. $1,670 Reserve. There are no real further explanations of the budget.  Three team members are listed, who may be qualified to network but is that $5,000 divided by three for several hours of “networking”? What is the $1,600 + reserve for? The Risk Management is also unclear to me.  The prime risk listed is “Answer\nRisk: The lack of good cooperation from \"old guard\" Ethereum folks a.k.a. Ethereum Maxis\nSolution: Build a warm and inclusive atmosphere that is considerate and acknowledges bias while delivering factual information and engaging experience.” My suggestion to the proposing team would be to further explain in add on notes for the voters who may not know the NYC street scene how someone named Ethereum Maxis is a risk to making it easy to move Ethereum projects to Cardano. Also, regarding the Implementation plan, while there is some mention in press pieces, etc of seminars there is no schedule or listing of what topics and what dates the networking would occur to help sway Ethereum individuals to Cardano. \n——————————————————————————————————————————\nMy Assessment of the feasibility mainly due to that it does not address the problem as stated in the Challenge is a two( disagree that it will be successfully implemented) star.", "q1r": 2, "q2": "The proposal lists three measure to measure: 1. RSVPs, 2. New Wallets measured the night of, 3. Average count for participation of the event. For success the proposal lists three items - only one in my assessment is actually measurable - more participants in NYC weekly events. The other two ‘success’ items : Ethereum members in NYC learn about Cardano and participation in NFT/Defi are not explained how they would effectively be measured or audited. There also is no explanations of how audits of new wallets would be accomplished.\n——————————————————————————————————————————\nThe Challenge statement has two metrics that it required: 1. Number of projects that migrate and, 2. Number of users of these smart contracts once migrated to the Cardano ecosystem.  It does not appear the proposer(s) took these into consideration.  My suggestion for the proposers is to understand and address the Challenge prior to designing your Proposal.  The voters need a clear and concise explanation of how you Plan on solving the Challenge problem, how you will successfully do that and how it can be measured so the voters and the community know their confidence in funding a project was well placed. Based on your statements and lack of milestones the Challenge required my assessment is a one (I strongly disagree that it has milestones with KPIs and identifiable measurements of success) star.", "q2r": 1, "assessor": "z_assessor_2671", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6753, "q0": "The proposal describes how NYC is becoming more and more of a crypto hub in the US, and yet the events hosted there are mainly centered around Ethereum.  In order to solve this problem the team plans to increase Cardano’s representation in NYC by organizing seminars that target the Ethereum community with the intent of educating them about Cardano in a friendly and welcoming way.  They plan to do this by becoming partner hosts of a well known crypto event in NYC called “CryptoMondays”\n\nI believe the goals stated in this proposal align closely with the goal of the challenge it was submitted in, which is to aid in the The Great Migration of developers and users from Ethereum to Cardano.  They also provide KPIs relevant to the challenge, like, “number of RSVPs for Ethereum to Cardano events” or “number of new Cardano wallets created at events.”", "q0r": 5, "q1": "The proposal describes who the team is and how they have hosted Cardano related events in New York before that have done well, which indicates they have an experienced and reliable team.  I would’ve liked to see a more in depth description of the roles and responsibilities for each team member for this particular project though.\n\nThe team provides a detailed breakdown of what they plan to use the funds for over a 3 month period at the end of the year. I think explaining what they have planned for the 3 months between now and then would also be good info to include.\n\nLastly, I believe the team does a good job of acknowledging the largest risks associated with this proposal. They state the community in charge of the CryptoMonday event are mainly focused on Ethereum, a.k.a Ethereum Maxis, so there’s a chance they don't allow the team to become Partner Hosts.  The provided solution to mitigate this risk is to be warm and welcoming while delivering factual information.  This solution is ok, but I think describing a backup plan of what the team plans to do with the funds just in case they aren’t able to become partner hosts would be good info to provide.", "q1r": 3, "q2": "The team provides very clear KPI's that measure the project’s success as well as where the data for those KPI’s can be collected.  The main place the community will be able to keep track of the team's progress is through the site called “Meetup,” where the team plans to schedule every event they hold. The community will be able to keep track of certain milestones like the weekly events they plan to hold from October through December.  \n\nI noticed there is a discord link in the about section of their group on “meetup.com” which could also be a good place for updates on the project, but the proposal doesn’t mention this.", "q2r": 5, "assessor": "z_assessor_2826", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 7414, "q0": "CryptoMondays is the largest weekly crypto community event in NYC, most of which focuses on ETH. The proposal wants to create a strategic partnership between the Cardano NYC community and CryptoMondays. This is a great idea. With careful preparation, the proposal will help popularize the Cardano ecosystem for ETH users, so it is a perfect fit for this Challenge\nCryptoMondays has a high rate of ETH-related events, they have a large and strong community, so is it difficult to reach them? If the proposal already has a plan, please specify. I think the first thing to suggest should focus on giving the practical benefits that CryptoMondays need and make them enjoy, in addition to sponsoring the costs of the events. For example, presenting two leading ecosystems that will join hands to help blockchain develop, CryptoMondays has more meetings, more loyal members from both groups, is a place to exchange quality technology, build a construction community for the world\nAs for the risk, and lack of cooperation from the people of Ethereum Maxis, I have an option as follows. Always listen to them, because they represent a miniature ETH society. At the same time, the Cardano community must have veteran programmers, developers, and investors, deeply knowledgeable about the technology, about the Cardano ecosystem. From there, it will create a balance, respect each other, and listen to each other. After many times of contact and interaction, if it is true that the Cardano ecosystem is better than the ETH ecosystem, for the common good and personal benefit, they will immediately realize and change themselves, because they are knowledgeable people, knowledgeable about the industry and also want to optimize their work or investments\nProposing a specific, highly impactful solution, I hope the above comments will help improve the proposal. I'd be happy to give it a 5 in this section", "q0r": 5, "q1": "You come up with a plan consisting of 5 actions, the proposal is expected to last 3 months. I think you should detail each job and the accompanying timelines. For example: preparing documents for events, meeting with CryptoMondays representative, week 1 introducing Cardano ecosystem, week 2 introducing dApp, NFT, week 3 introducing Project Catalyst, a large decentralized fund... From there, you will list the detailed budget accordingly. Currently, I see the total proposed fund is 65,000$ ~ 13% of the total Challenge fund. Proposal to apply for $20,000 per month, but there is still no agreement on how many meetings to hold each month. This makes it difficult for Catalyst disbursements and oversight from the community\nAs for the team, you have 3 main members, all of whom are veteran members of the Cardano community, which is a big plus. However, to reach the ETH community, members with experience and understanding of the ETH ecosystem are needed. In the summary of experience, the proposal states that the coordinator team has more than 3 years of experience and relationships in the Ethereum community and ecosystem, but in the details, the people working on the project do not see, please clarify this issue. With the above, I can only give 3 points in this section\n", "q1r": 3, "q2": "The proposal outlines three appropriate KPIs for evaluation, all of which are easy to quantify. Where are project results and progress updated? Please provide a specific path for the community to follow and support. In addition, I would like to add 2 more indicators such as the number of dApps moving through Cardano, the amount of ETH converted to ADA, and staking into the pools, from the number of proposed Cardano wallets will determine this index. The success of the project is very expected, the ETH community is a large community, and if they see good benefits from Cardano, they will move like a wave. I would be happy to rate this section 5 points", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We propose to spotlight/elevate the Cardano community/ecosystem in NYC by organizing seminars focused on the Ethereum crypto community in New York City via a strategic collaboration with CryptoMondays", "experience": "Team of coordinators have:\n\n2+ years of experience in hosting/coordinating Cardano Summit and weekly Community events in NYC.\nProduced and hosted the first ever Cardano Community Event at NFT NYC.\n3+ years of expertise and relationships in the Ethereum community and ecosystem.\n"}