{"id": 417615, "author": "raz", "title": "ETH NFT Artists->Cardano workshops", "url": "https://cardano.ideascale.com/a/dtd/417615-48088", "category": 26593, "amount": 15000, "description": "Despite relatively expensive and higher fees than Cardano + greater negative environmental impacts, Ethereum has the largest NFT market size. Incentivising Ethereum artists to use Cardano is key.", "f6_no_assessments": 20, "f6_rating": 4.366666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 624, "q0": "One of the ways to migrate developers from Ethereum to Cardano is to migrate their customers. This is what the current proposal is aiming for. Instead of creating assets to facilitate the migration of developers directly, the goal of this proposal is to bring artists from Ethereum to Cardano. The problem stated by this proposal is very important: the cost of minting and everything else involved in Ethereum is prohibitive for many, and on top of that, all the environmental issues of Ethereum make it a very costly platform to mint and market NFTs. As stated, many artists even give up on minting their work because of the environmental impact, for example. And since artists are not usually tech people, information about other options don’t naturally reach them. The goal of this proposal is to host events and workshops to create awareness about the qualities of Cardano to artists that are interested in minting their work but are currently using Ethereum or not minting at all due to the mentioned down sides. During these events, a comparison between Cardano and Ethereum would be made, and all the benefits of using Cardano would be presented, which would definitely be enough to convince NFT artists to use Cardano instead of Ethereum. This way, the demand for NFT marketplaces and platforms in Cardano would increase, and consequently the number of projects and developers that would tend to migrate from Ethereum as well. This is a very good way to indirectly meet the challenge’s goals. The proposal added some KPIs that track the success of the proposal: number of workshops, attendees, artists from Ethereum and artists opening Cardano wallets. I believe this proposal is very well aligned with the challenge, the impact might be high depending on participating on these workshops, and the ways to measure the success based on the KPIs mentioned previously is good.", "q0r": 5, "q1": "The team behind this proposal has already delivered a workshop previously, as mentioned in the proposal, and the feedback they received was very good. Therefore, they know how to organize and execute such an event. The team has also provided their bios and verifiable links, such as their LinkedIn pages, and they seem to have the necessary background to make these events successful: in the team, they have very seasoned Cardano community members, experts in finance, technology and education, besides other areas. The team will still look for a workshop coordinator, so I believe the mentioned team will be supporting the initiative, but most of the work will be done by this individual who is yet to be found, which is not ideal, but they’ve set the first step of their roadmap to look for the ideal person for the job. The budget of the proposal is good and based on the cost of the workshop that already took place, seems to be appropriate. Although, I believe there’s a small imbalance in the costs related to the coordinator and the events themselves. The coordinator is more expensive than the workshops. I don’t believe that the budget allocated to the coordinator should be lower, but maybe increasing the budget of the workshops to make them better could be a good cost/benefit for the project, without increasing its cost to much, proportionally. Also, the proposal misses some budget for marketing. They mention that they would partner up with some existing workshops, but it’s important to also create marketing specifically related to what’s going to be presented regarding Cardano, so not only people who would already attend to these workshops would see the presentation about Cardano, but also people who would like to go to these events specifically for that. The execution of this proposal is divided in 3 phases: 1st phase lasts for 4 weeks and will be dedicated to find the coordinator, 2nd phase lasts for 2 weeks and will be for planning the workshops, and 3rd phase is the execution of workshops. Since there’s no budget for the planning, I believe it will be done voluntarily by the team members, as well as the work to find a coordinator. The timeline seems realistic and feasible. The only things missing is how long it would take to host the 12 workshops, but I assumed it would be 1 year, since the salary of the coordinator was budget for 1 year. The proposing team says that the risks of this project are very low, since they already delivered one session successfully, but I think that there’s a risk of the coordinator disengaging from the project during this year. Unfortunately, this is something that has happened to some of the projects in Catalyst. Nevertheless, I believe that this proposal is highly feasible.", "q1r": 5, "q2": "The roadmap presented in this proposal might give enough information for the community to keep track of the execution of this proposal. Since it is quite simple, the proposers could easily report, for example, when they find out a coordinator, share the plan for the workshops and later share evidence that these workshops took place. Even though this is not stated in the right entry in the proposal form, these can be easily tracked. The definition of success presented in the proposal is quite subjective, since they want to see the enthusiasm of artists who attend to these workshops. This is not easily measurable, and therefore I believe some goals for the KPIs presented previously, i.e., number of participants, Cardano wallets created, etc., should be used to measure the success of the proposal. Overall, the auditability of the proposal is good, but there’s information lacking from the proposers on this regard, and this is why I’m not giving a 5 rating for auditability here.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12750, "q0": "The NFT ecosystem of Etherium is by far bigger than the CNFT ecosystem. The problem is clearly stated and the main goal of the proposal is to poach NFT creators from Etherium with workshops and bring them to Cardano. The creation of these workshops shows Cardanos technical features and helps the creators to deploy their project on the Cardarno blockchain by teaching them how they do it . By this the proposal could bring many new projects to Cardano because the Etherium Blockchain has some technical problems/ shortcomings and creators search for an alternative. The team has provided some proof for the last statement in the proposal. This pushes Cardano with its better feature directly in their mind. Therefore this higher the chance of changing the blockchain. \nThus there is a strong match between the proposal and the challenge. ", "q0r": 5, "q1": "The team has already made a successful workshop in Barcelona. This creates confidence in their ability. But they have also linked several websites and data about themselves. IN summary their skills and experience looks matching for the proposal. \nThe Budget is detailed and everything is in a reasonable pricerange. In total they will make 12 workshops which is fair number in comparison with the budget. \nThe timeline is split into three sections. The first section for the hiring and preparation. The second is for the more detailed planning and the third is for the workshops themselves. Form their current point of planning they have communicated all their infos and they will create the workshopdates in the second phase. Therefore their plan in completely communicated and comprehensible. \nThe data is reasonable and the skills of the team are matching the proposal. Therefore I strongly agree that their could implement it successfully.", "q1r": 5, "q2": "The KPIs are matching the goal and they are measurable with numbers so they are easy to evaluate. \nThe problem is clearly stated in the beginning. The goal of creating workshops could lead to a migration of NFT projects to Cardano and therefore solves a part of the problem. \nIn total it is very easy to audit this project because the KPIs are easy to evaluate and you can check whether they made the workshops. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12091, "q0": "Hello friends . The problem of the project is stated clearly and in detail . The process done by inviting potential customers to attend a meeting so that they can meet and discuss problems face-to-face is very accurate . I am a sales person and I find that there is nothing better than a face-to-face meeting . As you mentioned in the project , I see that you have been and are gradually achieving your goals , which makes your project more prestigious . I find this project refreshing as the goal of the project is related to projects and artwork . In the current market economy , art works are not as valued as before , artists are also gradually declining because their income is no longer enough to support themselves and their families . This project gives artists a breath of fresh air to change their lives . The works of art they make will be widely spread to everyone . The timeline of the proposed project is reasonable to accomplish the goal . The links to the project bring full information  on the reader . I see that this project has a lot of enthusiasm for the author team . I have high hopes for this project .", "q0r": 5, "q1": "The project budget is shown in great detail of each job . With the experience of using money to accomplish the previous goals of the project , I have confidence that when there is a budget , it will be used most economically and reasonably . the members participating in this project are those who have had certain experience and success in their field . Tasks are assigned in accordance with each person's expertise . The link to each member's profile is detailed . With a team with such expertise I have great confidence that the project will be successful .\n", "q1r": 5, "q2": "Right The information provided is sufficient to assess the progress and success of the proposal . I have full confidence that the project will succeed . I hope in the future more artists will use the service of this project to positively change their lives . Artists need to have a forward-thinking mindset and are always looking for something new to change their lives . meetings and seminars will help weed out those without a growth mindset , then the project will know who to focus on , thereby thriving . Good luck .", "q2r": 5, "assessor": "z_assessor_3357", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11933, "q0": "The proposal intention is to make a workshop to show or demonstrate minting NFT in Cardano towards the Eth-minting artist. The idea is very important to introduce NFT in Cardano to unfamiliar NFT artists. The project will then give impact by increasing value to Cardano network by onboarding new NFT artists that will catalyze transactions in the network even further, while also increase the number of users and spread Cardano’s popularity even more. The proposer had also done a prototype event before, making the idea should be very feasible since they also included a very thorough plan in the proposal.", "q0r": 5, "q1": "The milestones included are very clear. The proposers has also outlined the budget breakdown very concise and logical too, mentioning the material creation and the salary for a year. The required expenses including space rent, teacher, advertising, and even catering has also included. The proposal has also provided a very detailed background and relevant experience of each team member including their social media account (twitter), however, it would be even better to include a reference to their portofolio accounts such as Linkedin, since checking credibility on Twitter account is not very convenient. Honorable mention that the team also mentioned various other proposal that lines up to the proposal objective, making the project is even more feasible with its support worldwide when each of the other proposals are approved too.", "q1r": 5, "q2": "The proposal has also used various metrics as their progress measurements, such as numbers of workshops, attendees, new artists, and migrating artist from Ethereum. The success objective of the project has also explained. It should also be better to include quantifiable items on the objective as main goal and measurement, just like their progress measurement, for example ‘n’ number of migrating artists opening Cardano’s wallet.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11904, "q0": "The proposal is about incentivising Ethereum artists to use cardano and to do so workshops will be organized in which all the good reasons to mint art on cardano will be presented to the artists minting on ethereum and then accompain and guide them on how to do so and thus this proposal dialogues very well with the goal of the challenge and it is aligned to the challenge statement. \n\nThey have already done a prototype event with respect to this challenge in a hotel in Barcelona however, I think they should have provided details regarding how many artists from ethereum moved to cardano, how many new artist created their first cardano wallet and how many people attended the event.\nThere are details but the details that would show how successful the prototype event was and ultimately their  ability to scale to address future challenges are not provided.\n\n\nArt is everywhere around the world, in every aspect of life and also as there is a great hunger and desire in the artist community to learn and mint their NFTs, this proposed solution if financed well then it will have an immense global impact as connecting people in the real world leaves a huge impact. \n\nThey have got a strong strategy regarding environmental impact of Cardano to present it to existing ETH NFT artists and new artists as well, along with some other presentation videos which definitely will add value to the cardano ecosystem. \n\nI suggest they should present a short discussion on the possible risks and challenges that might occur during the development like what if artists are not willing to switch to cardano because they already have their own audience on ethereum. In my opinion the proposed solution requires great diligence for execution.\nOverall I agree that this  proposal effectively addresses the challenge.", "q0r": 4, "q1": "The proposed team is certainly qualified to carry out the project well.\nThe proposal provides information regarding the team members with their names, small description about their background, their experiences and also their social network profile links has been mentioned like LinkedIn and Twitter using which we can get to know each of them in detail . \nAs stated there are few members of the team already contributing to the cardano ecosystem . Their relevant skills and experience will ultimately help them in executing the proposal . \n\nThe plan and time frame has been provided along with the tasks to be under taken which looks realistic and conductible. \n\nThe deliverables and KPIs are also given. However, in order to be a bit more credible , I would have liked to see a bit more detail in deliverables and KPIs. \n\nThe mentioned budget is reasonable and divided with respect to the tasks to be undertaken. The proposal is not certain as to they will return to catalyst or not for the funding. \n\nAs mentioned they are submitting total five proposals in this fund 9 which of course shows their credibility and competency after going through other proposal submitted by them. One of my concerns is that how will they manage all the workload. I was  expecting little more information regarding this one aspect because it will be a big task to provide information regarding auditability on regular basis for all the five projects simultaneously . \n\nOverall with the evidence provided by the proposal I believe that the team have expertise in several areas important to the projects conduction and thus I agree that it is highly likely that this proposal will be successfully implemented.", "q1r": 4, "q2": "The proposal provides clarity in the description of the problem, solution and their alignment with this challenge . \n\nThere is a road map which is pretty good along with deliverables and milestones which makes it easier to audit the proposal . \n\nThe proposal also provide us with key metrics which helps us in having quantitative information and data that leads to the point if success is achieved or not . \n\nI believe it would benefit the proposal further if they provide details regarding how and where the results and process will be shared like they didn't mention anything regarding sharing on any online sessions or channels or in town halls. \n\nThe level of detail provided is good for me to be comfortable with the auditability but I would have liked to see what channels they would take up to communicate with the community to get feedback or to be in track for successful project implementation. \n\nHence I agree that the proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_3312", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11507, "q0": "Proposal clearly targets the goal of challenge to migrate people and projects from Ethereum blockchain to Cardano by organizing local workshops that are primarily targeted to Ethereum artist audiences. Through prototype event that took place, proposer identified need to educate artists that better alternative to Eth exists, because currently NFT marketplace is associated with Eth, even though people don’t like the fees. By creating a live event where artists can make connections, view Cardano NFT price and climate footprint superiority, and get hands-on “how to create Cardano NFT”, proposer will create a space for growth of blockchain and NFT community, this will eventually help The Great Migration. The proposal is able to scale by creating more events in different cities. There is not so much detailed plan for future self-sustainability. As a general idea, the proposal's claim that it will reach a select group of influential individuals who will disseminate it to others and increase its impact is accurate, but it is highly speculative to build project success on targeting small audience with assumption of them reaching larger audience and creating chain reaction. Therefore, with little budget for proposal advertisement it is hard to believe that information of Cardano NFT superiority will reach thousands of artists.", "q0r": 4, "q1": "Proposal team has experience with organizing event similar to proposed event. The team hosted self-financed prototype event in Hotel Ginebra Barcelona which shows that it has capabilities to do it again. Proposal defines plan with phases to fulfill the proposal and has capable team to do it. While team is capable to do it, proposal states that workshop coordinator will be recruited for this, so no validation of this person is possible. This is the main person that is identified as paid in this proposal so ability to successfully implement this is not guaranteed. Proposal also lacks more detail on event coordinator job description. Tasks needed to organize workshop are split into bulleted list but no price estimates are set for them, only for whole workshop. While more than half of the budget is spent for workshop coordinator, a detailed description his duties is lacking.", "q1r": 3, "q2": "Proposal specifies 3 phases, last phase is split into 12 smaller parts approx. Delivery of each phase and subphase could be easily tracked. Proposal defines project success by tracking workshop attendees, artists opening Cardano wallets, from Eth or from else. This can be done directly in workshop and data and videos can be published to some online database (this is not defined in proposal but could be done easily so that Cardano community can check). The proposal lacks information how to track new artists joining who are informed and motivated to transfer to Cardano from workshop attendee, this could be done by sharing some promotional code to attendees so when they share it further it can be tracked in theartsuite.io.", "q2r": 3, "assessor": "z_assessor_3255", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10461, "q0": "This proposal aims to organise meetings and workshops for local artists in European cities. The focus is mainly on artists who create NFTs on Ethereum and to convince the proposer to migrate to the Cardano ecosystem. Artists creating on Ethereum will be persuaded on the basis that Cardano has several orders of magnitude less negative impact on the ecology and minimal fees to create and transfer NFTs. What I rate as positive is that the argument is carried in the spirit of an invitation to Cardano with an emphasis on the positives and not as an attack on Ethereum. The proponent wants to focus mainly on individuals in terms of artists and their creations, which I believe will yield more satisfactory results than if they were to focus on quantum of artists. Of course, success depends on artists embracing the idea of creating content at Cardano and as for artists who are not yet doing NFT, they will have the opportunity to see and learn about the process, so there may be a benefit of new artists overall to the creation of NFT. This project, if successful, can be scaled up to a global level and does not have to be organised only in Europe. Overall, the impact of this project is positive for me as it creates a platform for networking artists and highlights the positive aspects of Cardano, which may result in new artists contributing to and using the Cardano ecosystem.", "q0r": 5, "q1": "The timeline is laid out in 3 phases, with the first phase lasting 4 weeks which is planned to recruit a workshop coordinator, the second phase lasting 1 to 2 weeks where the team will focus on organising the time and location of the events. After that, they will start already with the sharp operation of the events, organizing one event per month for a total timeframe of twelve per year. Given that a similar event has already been done by the proposer's team, they have gathered valuable experience and a realistic reflection of the costs of such an activity. The team so far consists of six members whose work history is relevant to the proposal and is traceable on Linked-in and Twitter. The budget is budgeted at $15,000 and consists of: $600 to create the workshop content, with it not entirely clear who will create it, where and how; $700 will be the monthly salary of the coordinator; and $500 for the workshop itself. The budget is planned for a pilot project but if the proponent wants to scale the workshops to larger venues and for more people, they will need a larger budget as well. As for the budget itself, it strikes me as justified and reasonable.", "q1r": 5, "q2": "The KPIs are well set, as they will measure the number of workshops, the number of visitors, the number of artists who start creating on Cardano, regardless of whether they were previously creating on Ethereum or something else. The number of people migrating from the Ethereum ecosystem requires separate tracking, as it is very difficult to track this activity on the blockchain, but if the project has some sort of separate questionnaire implemented for this metric, it will be easier to track. At the same time, it is quite difficult to track the creation of new wallets on the blockchain and then matching them with specific people, this obstacle can be solved by either making a record of the workshop or writing down the newly created wallets somewhere to achieve transparency and better control. Direct success is registered by the number of new artists, and indirect success is in the form of impact on workshop attendees, as they can go on to report positives from these workshops in their art communities or collecting communities.", "q2r": 5, "assessor": "z_assessor_3187", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8691, "q0": "This proposal suggests holding one-on-one consultations in different localities, then expanding to different countries. The focus of the consultation is to introduce how the Cardano blockchain's cost optimizations, technical characteristics, and energy consumption will create favorable conditions/spaces for the development of NFT projects, The main audience will be NFT artists on Ethereum and artists in the NFT community who are having a hard time creating works because of concerns it will have an adverse impact on the environment. Determining the right target audience for the project will be a successful first step in assessing the degree of connection between the project and this Challenge. I completely agree that this project fits Challenge's requirements as ideas and solutions that can promote the expansion and conversion of projects and users from Ethereum to Cardano. However, the project currently lacks predictions/commitments about the user conversion rate from ETH to Cardano to be able to see the real potential of the project.", "q0r": 4, "q1": "The plan for the implementation of the preparation and organization of the workshop is designed to be easy to understand and clear with the necessary information such as the implementation time, the work to be performed at each milestone, and the output product. Because of previous workshop experience, the proponent can list the resources needed for the organization and provide appropriate cost estimates. It will be a plus if we can know the working hour of the coordinator position mentioned in the budget table so that we can see if their work efforts are suitable for the remuneration offered or not. The descriptions of the project implementers show that they have a deep understanding of blockchain technology, NFT and have active activities related to NFT and Cardano, which proves their ability to implement their good project is very high.", "q1r": 4, "q2": "The proponent is only stopping at providing concepts of success metrics. While these metrics are ideal and are the primary project output, the lack of concrete estimates and stages in which to measure makes audits difficult. I encourage the author to be able to design an audit trail that includes the elements I mentioned. This proposal suffers from the same shortcoming that most other proposals have in not providing the community with tools to able to track project progress, some of which are convenient for monitoring. be it community reports, GitHub, blog posts, or social media updates.", "q2r": 2, "assessor": "z_assessor_2996", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 7658, "q0": "This proposal aims to address the challenge by targeting the NFT community and artists in particular. They plan a series of workshops directed at artists working on Ethereum or other blockchains to educate them about the advantages for NFT creators on Cardano.  Implemented successfully, this project would raise awareness for Cardano and potentially result in new NFT projects or the migration of projects.\nI rated this proposal at 4 stars because it does not directly address making it \"easy and fast\" for projects to migrate to Cardano.  This proposal is more of an educational initiative, however, awareness must precede action.", "q0r": 4, "q1": "The team has completed several Catalyst projects to date per the proposal.  They have already hosted an event similar to what has been proposed and it seems likely the team will be able to successfully implement these workshops as described.  I appreciated the completeness of the proposal including related links, videos and team bios.  The team appears to be well organized and have the technical abilities to deliver on this proposal.\nThis proposal could be strengthened by including the content they have developed for the workshop.  I also was concerned about the team's ability to complete multiple funded proposals if successful.  Please see the attached google doc \"Managing Workload\" where this is addressed.", "q1r": 4, "q2": "The team plans to track the number of workshops held, attendees, Eth artists attending and new wallets created.  These metrics will be easily tracked and give an accurate measure of the impact these workshops are making.\nWhile I could not find where the team plans to report this information, the team is very forward facing and involved in the day to day life of Cardano.  It seems reasonable that any community member could reach out to the team for the info if needed.\nThe proposal could be further improved with plans to obtain feedback from attendees to make the events increasingly impactful.  As a community member, I would be interested in what the team learns in the process.", "q2r": 4, "assessor": "z_assessor_2911", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7300, "q0": "The proposal aims to hold Cardano seminars to introduce the world's artists to the greatness of the Cardano ecosystem and point out the superiority of the Cardano platform over the Ethereum platform in NFT minting. , it's Ethereum's fees are relatively expensive and the negative environmental impact is much bigger than using the Cardano platform, for the artists who are using the Ethereum platform and those who are new, understand and have a new perspective and be more objective about the benefits of using NFT minting on the Cardano platform, from which they will consider choosing the Cardano ecosystem to be more correct because of the benefits described above, especially in the community. In the workshop, artists will be directly guided on how to create a Cardano wallet, so it is easy for anyone to participate. Therefore, more and more people know to trust and use the Cardano platform. The workshop will take place in many different countries and the proponent team has also committed to work towards a sustainable model step by step so that their events are self-funded to work in the long run. , so the project is scalable in terms of space and time, thus having a huge impact on the present and future Cardano ecosystem.", "q0r": 5, "q1": "With a well-organized plan, detailed description, listing of contents and divided into 3 phases in chronological order, so it is easy to follow and evaluate, the Proposing Team has put their own pocket to implement the project. prototype event at the Cardano Ginebra hotel and were quite successful at that event, and they had real experience, so I think they have the experience to be able to successfully do similar events in the future. Through the Linkedin, Twitter and Web site and what the referring team can see the team is a team with the right experience and skill set to successfully execute the proposal. Members are assigned appropriate and clear work according to their ability and experience. The Proposal Team considered the challenges and risks and identified constraints for successful implementation of the proposal. The required budget is clearly presented in easy-to-identify item-by-item items, appropriately allocated for each item to achieve the set goals.", "q1r": 5, "q2": "The project has provided data, comparison and evidence through links such as the Web site very accurately and objectively, the implementation contents are described and listed in detail according to specific timelines. Evaluating progress is very easy. The implementation solutions are presented clearly and understandable to solve the proposed objectives. The KPIs include: Number of workshops, number of attendees, number of artists from Ethereum and number of artists opening Cardano wallets, which I find very clear, relevant, enough to be measurable and identifiable. project success. Furthermore, the success of the project summarized by the team seems to be quite accurate in relation to what the plan lays out.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 7001, "q0": "    -  As the project thread says Ethereum has a large NFT market size, but when artists discuss it, it incurs expensive fees, and a larger negative environmental impact, so with the idea of ​​bringing Artists ETH NFT->Cardano Workshop, is a very good idea.\n     \n    -  I see here that the team has raised a number of issues to reduce fees and be less negative in the Cardano environment. that will invite Ethereum Mining Artists to a location. Here, a video presentation will be shown illustrating and explaining the properties of the Cardano blockchain. will compare the cost to mint on Ethereum and on Cardano. with Ethereum as a blockchain is not eco-friendly, while Cardano has been designed and optimized to be eco-friendly. I find the issues raised by the topic very reasonable and suitable for the challenge.\n\n   -   About the presentation of solutions to solve the challenges. The team has determined that will drive Ethereum passionate artists as well as NFT lovers buying on Ethereum to migrate to Cardano. With a workshop already organized by Hotel Ginebra Barcelona, ​​The Art Suite continues to introduce and educate residents in Barcelona and visitors from around the world on the benefits of migrating from Ethereum to Cardano. This will be supported by fully automated development tools and platforms. I find the solutions outlined to be very suitable for solving the problems of the challenge.\n       In addition, the group also pointed out the risks that the project may face. the risk is not possible. However, this is in my opinion very unlikely, as a lot of the artist community wants a better experience on Cardano.", "q0r": 4, "q1": "   -  When asked about providing a detailed plan, including progress and milestones. The team has determined the milestones that will complete all the work in a period of more than 1 year and has divided it into 3 phases to perform each step of the work. I think with the timeline as stated above, it is perfectly suitable to complete the set tasks. The objectives to be achieved for each phase have also been stated as, phase 1 is Recruiting a workshop coordinator. Stage 2 is Place and Time Planning. Phase 3 is the Workshop Kick-off. However, I think the project topic should create a link so that the community can track the progress of the project, it will be very reasonable.\n\n    -  As for providing detailed budget analysis. The total budget is 15,000$ and has been divided into 3 stages to complete the work. I think with the splits as the project mentioned is reasonable. However, the group should have backup plans in case of extra budget.\n\n    -   in the section that provides details about who will work on the project. I see the group has mentioned 6 members. assigned specific tasks to each person. Through research, I found that the experience and capacity of each member is very good. The identity of each member is also easy to authenticate.", "q1r": 4, "q2": "   -  Describe what you will measure to track project progress. I saw the proposed topic mentioned 4 metrics that are Number of Workshops, Number of Attendees, Number of Artists from Ethereum, Number of Artists Opened Cardano Wallet. However, the indicators are not easy for the community to track.\n\n   -   When it comes to what does the success of this project look like? The theme of the project has shown some success that the artists feel happy and excited when participating in the workshops. I find the successes mentioned above to be very relevant to the problems in the challenge. However, up to now, the project is still in the concept section, not in actual testing.\n\n   -   about funding because this is a new project, so it has not been funded yet. However, I think this project is very good and if the project is successful, it will be very effective, I hope that the project will receive a lot of support from the community.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 5745, "q0": "The NFT market is a great expansion of the various uses of blockchain. There are more and more adopting of NFT in mainstream and different blockchains other than ETH have proved to attract big artists and NFT makers to increase the market in their respective blockchains. \nAt cardano the NFT market is growling aggressively and provide many benefits. The team for this proposal has already introduced to ETH NFT artists in Spain the benefits of adapting to the cardano NFT space. For various reasons of sustainability and proof of work benefits are attractive for the environment. But also lower fees and ease of minting is another benefit listed by the team. \nActively working with artist and exposing to the cardano ecosystem will shine the light on the many benefits they are utilise. \nAlso I see that these local workshops may be a good spot to onboard new cardano users in the near future. ", "q0r": 5, "q1": "The team is requesting a very respective amount to ensure they perform various workshops around Europe. \nThe main budget allocation would be for coordinating the workrshops and delivering the material. \nOverall the timeline is feasible and is not in risk of going off track. In addition if these workshops start scaling it would mean attention to cardano ecosystem is growing and overall interest for crypto space is important on People’s mind. \n\nFinally I have seen that they have previously performed similar workshops and had a good attendance. So the chances of repeating that success over various cities in Europe is even larger. ", "q1r": 5, "q2": "The proposal focuses on onboarding artistic looking to provide their work in the NFT space. And allow them to understand how the space in Cardano is managed and he’ll offer the tools to reach a successful audience. \nThey intend to deliver multiple classes and will publish rhei attendance and schedule publicly. Finally the material they work on will also be shared for people to benefit from. Which I feel is great to ensure the mass adoption of NFT collectors and artists in Cardano ", "q2r": 4, "assessor": "z_assessor_2745", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5563, "q0": "Proposal to host local workshops in which Ethereum mint artists are presented with all the good reasons to mint their art on Cardano, and are accompanied and guided on the journey to do so. This is a good idea, but I think it only partially meets the requirements of this challenge. The goal of the challenge is to bring projects planned or launched on EVM to the Cardano ecosystem easily. In addition to this proposal, the team has 4 other proposals submitted in fund9. The group will collaborate with existing art project workshops so that local infrastructure and knowledge can be shared. One possible partner is Regiforma and the team also held their first self-funded workshop at Hotel Ginebra Barcelona. The group will also hold many such sessions in many different locations and countries, I wonder if this solution will continue to work in the following funds and how?.", "q0r": 3, "q1": "The project plan is divided into 3 phases, phase 1 and phase 2 will be implemented in 6 weeks (Recruitment of workshop coordinator / Planning on location and time), and phase 3 is the start of the workshop. 1 session per month and do 12 sessions. The content of the seminars has not been detailed, including how activities, inviting marketing and promotion to attract the community to participate, the number of participants is small or very large. affect the script of the conference?. The total proposed budget is 15000$ broken down into sections, however, the cost of organizing a 1-day workshop of around 500$ is too little for the requirements (Lease of space/Teachers/Advertising/Travel expenses) / Catering services), the team recommends to further subdivide each item because as far as I know the cost of renting the premises can take up 500$ excluding other costs, consider to make sure the cost is enough for the operation to happen. out with the best quality. The group has 7 members and the information about each member is provided with full details of identity, expertise, skills, and social networking site links. However, I don't know if the group has its coordinator position, if, in phase 1 hiring more coordinators, there will be 2 people to do this or not?. The risk stated by the proponent is very low and will have no effect", "q1r": 3, "q2": "The roadmap as stated in the previous section is divided into 3 phases and has specific goals for each stage. The team should add a full scenario for each job so that it can clearly define the work to be completed, for example, renting space, advertising should be done early from stage 1 and who on the team will do any work. The metrics are easy to measure (Number of workshops / Number of attendees / Number of artists from Ethereum / Number of artists opening Cardano wallets) but it will be difficult to judge the quality of this session, so adding Add survey forms to understand more about the community's assessment and needs when participating. The team defines success as when we successfully hold seminars and watch the joy and excitement come to life", "q2r": 3, "assessor": "z_assessor_2714", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3612, "q0": "I am picturing the excitement of Ethereum artists as they attend the Cardano showcase with the awesomeness of Cardano NFTs, they will be more cost effective using the NFT platform on Cardano.\nThe first challenge every project faces is spending time, effort, and enthusiasm in consulting and persuading artists to accept the platform transfer. Why are they still accepting Ethereum despite the high cost? The proposed solution is to cooperate with art workshops and implement it in many countries with the theme of Ethereum- Cardano. From my experience and knowledge, successfully organizing the Cardano Ginebra hotel conference, I am confident that the risk is very low, but in my opinion there is still a risk of affecting personnel, language differences. To be able to successfully organize seminars in many parts of the world, it is not easy to recruit experienced staff who are knowledgeable about blockchain and enthusiastic about the project.\nThe problem of the earth is gradually warming, the greenhouse effect, the protection of the environment is always responded, environmentally friendly projects will always be welcome.\nIt takes a lot of energy to keep your money and assets safe on Ethereum, if there is a platform that still helps you keep your assets safe without spending too much energy, why don't you change.\nI love this suggestion and look forward to participating in the workshop if you host in Vietnam.", "q0r": 5, "q1": "The cult team of the proposal is all talented in finance, media, society, event organizers, technology and also veterans in the blockchain field, there is no reason why the proposal is not enough. confident to successfully run workshops that can resonate in the NFT artist community.\nWorkshops in Barcelona costing $3,500, at the Hotel Cardano Ginebra between 4000 and 5000 euros were held before you submitted your proposal for funding from Catalyst showing that the project was up and running. The topic of the workshop, the operation team is still active, the proposed blueprint process is not a problem for me because as you say, the desk team is a decentralized, experienced, multi-faceted group. skills, globally available, connected and working across multiple time zones.\nIt's dynamic and enthusiastic.\nI know the proposal is still in operation and the budget is still being allocated to each stage for each employee, but in the budget analysis, I still can't see the details of the allocation table for each stage: rental, delivery. members, advertising, travel costs, meals specifically. It is recommended to add a more detailed table for each item. Other than that I have no doubts about the feasibility of the project. I think the project will be successful and will be funded", "q1r": 5, "q2": "Excitement, change of look, change of mind of artists about NFT on Cardano, they see many benefits in using Cardano, opening new accounts, this is a measure of the success of the project. export. There will certainly be a lot of new artists in attendance, moving the project from Ethereum to Cardano. Since you have been running the project with your own money and have plans to expand it even more globally, I have no doubt about the opacity of this proposal. Your team is awesome and so knowledgeable about Cardano. I hope you have a successful funding call from Catalyst in this round", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"id": 3092, "q0": "The NFT market on the Ethereum ecosystem is very large, attracting a large number of artists in different industries and fields to participate in the market. At the same time, the NFT exchange on the market of the ETH ecosystem is very active, but its disadvantage is the very high cost. Therefore, this proposal to organize NFT seminars to guide artists who are active on ETH gradually moving to the Cardano ecosystem is fully meeting what the challenge poses.\nThe proposal will host local workshops where Ethereum mint or NFT artists are presented with all the right reasons to mint their products on the Cardano platform. The proposal would be to host cross-chain NFTs at events to showcase the amazing world of NFTs Cardano artists. Thereby helping them better understand the Cardano ecosystem, creating a strong Cardano community in each locality where the event is held.", "q0r": 4, "q1": "The team involved here is certainly qualified to implement the proposal well; The team is supported by The Art Suite platform, which is an NFT trading place for artists, generating income for artists when artists participate in creating and exchanging products on that platform.\nThe proposal also clearly states, details their bio, background and experience as well as profiles on Twitter, LinkedIn, where we can learn more details about each of them. Thereby increasing my confidence in the successful implementation of the proposal.\n\nThe proposal sets out a 1-year budget cost of $15,000 with the costs of educational materials for the conference, the salary for the part-time Ethereum/Cardano event coordinator, and the cost of organizing the conference. Proposing the cost of organizing 12 seminars for 1 year, with such time and progress, I think is reasonable.", "q1r": 4, "q2": "The information provided is sufficient to fully assess the progress and success of the proposal over 12 months. With the organization of seminars for artists to entice artists who are active on the Ethereum ecosystem to switch to the Cardano ecosystem with outstanding advantages, especially the platform transaction costs are a huge advantage for Cardano. At the same time, it also promotes the community to know more about Cardano. Especially with the new field of NFT on Crypto and Cardano platforms, it is possible to allow and attract more artists to participate to increase their personal income. With internal resources about people and apparatus, I evaluate the information provided to meet the progress and success of the proposal.\nIn addition to this proposal, the authors have 4 more proposals for this and other challenges.", "q2r": 4, "assessor": "z_assessor_2397", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2822, "q0": "\"realized the potential of the NFT Ethereum market to be very large but still limited for artists, so the proposal provided a solution to meet the requirements of the challenge and set the stage for the development develop cardano NFTs by creating seminars explaining to them the merits of the Cardano platform, with the aim not to migrate but directly mint NFTs on our platform, the proposal has been out-of-pocket ($3,500) to conduct a conference in Barcelona, ​​and received complaints from developer artists about their experience on Ethereum-based platforms like OpenSea,\n  this shows that cross-platform comparison seminars are essential just to let artists on other platforms especially on Ethereum know their platform limitations will be easily resolved. on Cardano, and compare its transaction costs as well as its environmental impact and sustainability, so summarizing by hosting workshops for artists and developers on other platforms will have an impact. influence the marketing of our platform. they will understand more about the great features that Cardano has to offer.\n  Since this solution has been actively tested by the team before and has had an effect on the perception of the target artists, the big risk is almost non-existent. I love proactive pre-test projects like this that shows that the team is very passionate about this idea. \"", "q0r": 5, "q1": "Very detailed for the roadmap and budget details you seem to have been very careful with the words presented in this summary. The team announcement is also complete and easy to understand when you provide both the links to the social networking sites for each member and also have detailed work assignments to each person this is great to experience. adventure experience with the group's presentation, in addition, the group also mentioned that it will sponsor partners to stand up to organize designated content seminars in other countries during the implementation roadmap, and about The proposed future will be self-funding from NFT minted revenues.", "q1r": 5, "q2": "this would be a perfect proposal if the team claimed to have video or images featured during the conferences available on the most popular social media sites like Twitter or other social media platforms to The international community may have had the same emotional experience as the project team participating in such workshops. and also for the verification of the proposed progress and success metrics.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 1975, "q0": "The proposal has provided a clear definition of its problem statement and proffered a sufficient solution. The idea is to provide workshops for educational and onboarding of Ethereum NFT Community (ies) to Cardano through direct invitation. The proposal is also resonates with other related proposals for a wider and long-term view of their intent; The ArtSuite. The proposal is intended to be scalable, learning from their initial MVP events. The proposal's goals are definitely in line with the goals of the challenge and should be supported by the community. ", "q0r": 5, "q1": "The proponents has shown that they have the competence, expertise, experience and capacity to deliver the proposal within the timeframe. Considering the fact that an MVP event had been conducted, they can learn from this experience and make it scalable globally in the nearest future. in addition, there are other proposals that complements the proposal for an effective implementation. \nThe proposal has provided adequate information on how to achieve their goals and objectives. The Budget estimates were elaborate and reasonable in conformity with the timeline and roadmap provided. The proposal also indicated that due to the successful hosting of the MVP event, the feedback and experience showed that the proposal is a low risk event beacause of the perceived positive overwhelming support and interest from the audience. From the foregoing, am convinced that the proposal will be effectively implemented ", "q1r": 5, "q2": "The proposal has provided enough and reasonable success metrics however these basis seem to be vague and non- quantifiable or unverifiable. The proposal has to provide a means for the community to actually monitor and assess the success and performance of the project that are quantifiable and not mere vague promises.", "q2r": 3, "assessor": "z_assessor_2292", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 1289, "q0": "The goal of the proposal is to organize workshops for local artists (primarily focused on artist having their projects on Ethereum) with the aim to migrate their projects to Cardano blockchain. The team already held a prototype venue in a hotel in Barcelona, where they obtained some information that will serve for composing the content of the workshop. The idea is to organize a local workshops in Europe, and collaboration with other art workshops is expected. As the proposer state, the first workshop will be held again in the Barcelona, and some of the topics will be: advantages of Cardano vs Ethereum (focus on mint fees, and transactions costs, introduction of Cardano wallets, and invitation to the proposers NFT platform – The Art Suite).  I like this idea, and it appears that its focus is mainly on the “true” artists, 1of1 pieces, rather than 10k collections. At one side, it can potentially bring some new Eth artists to Cardano, but at the same time, it can also onboard new NFT artists. I am decreasing one star, because I think that the focus group will be slightly narrow (not whole Ethereum NFT space, but only EU Ethereum artists, and primarily 1of1 creators).", "q0r": 4, "q1": "The time map is divided into three phases, where 4 weeks (whole phase 1) is focused on hiring the workshop coordinator, and another two weeks will be focused on the schedule. The aim is to host one workshop per month during a year, which seems feasible. Regarding the team, there are already 6 team members, who have their bio and twitter/linked in links posted which I find sufficient (both to verify expertise or competence). The budget is set to 15k USD, divided into the following items: 600 dollars for the creation of a workshop content (it would be nice to know who will be creating it), 700 USD is a monthly salary for the workshop coordinator – since the most load will be on this person (to rent a space, to find a teacher/speaker, obtain catering) the monthly salary is reasonable as well. The last item is 500 USD per workshop, which I find slightly undervalued…it will definitely depend on what space will be rented. I am taking an example from the prototype venue, therefore a hotel conference room, where I believe the amount per a day workshop can vary a lot across different countries. Nevertheless, I keep the score at full.", "q1r": 5, "q2": "The problem is actually not very well defined. It is not clear whether the proposers consider the amount of Eth artists not educated, or the information is missing, or why it needs to be solved by artists workshops. Regarding KPIs, these are quite clear to assess the progress, such as: number of workshops, number of attendees, and the KPIs regarding the goal of the proposal – the number of Eth artists actually switching/migrating from ETH to Cardano. The metric will have to be tracked via maintaining the touch with these artists, or at least keeping the attendance of the workshop public (or stored) so we can track the people who attended the workshop actually migrated. The proposers are also stating “the number of users opening their Cardano wallets”, I consider these metric quite misleading –1. Even non ETH artist can open Cardano wallet 2. We can not link it to the proposal (unless it will be tracked at the end of each workshop) 3. The future monitoring or collaboration would need to be maintained to actually assess the results of this metric to the final outcome of the proposal. I would also add a metric e.g. recording from the meetings, just to increase the auditability, but overall, I keep the score at full.", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 13377, "q0": "The content described in the proposal has a positive effect on the Cardano network and matches the challenge, by encouraging artists who have been and intend to mint NFT on Ethereum to switch to Cardano with outstanding advantages. that Cardano has.\nWith workshop experience, your team will host local workshops in which Ethereum mint artists will be presented with all the good reasons to create art on Cardano, which will make the CNFT community larger and more prestigious in the eyes of the blockchain community as more and more famous artists join and have a strong global impact.\nWith the migration of NFT artists from Ethereum to CNFT, this proposal meets the goals set out in the challenge.\nAnd as you said, reaching out to the many artists who are minting their art on Ethereum requires a long-term vision by changing the mindset and changing a platform that has followed them in one year. time is very difficult, although it is difficult but we can do it with effort and perseverance.\nIn the long run, do you have any ideas to scale up, such as seminars that will take place in many countries, and many big states?", "q0r": 5, "q1": "The roadmap for the implementation of the plan is divided into 3 phases by the team, of which phase 3 is not clear how long it will take, although there is ambiguity at this stage, I can believe that the team has made a plan. blueprint for phase 1 and phase 2.\nThe implementation cost has been broken down by the group for each work content to organize the workshop such as renting space, hiring teachers, advertising fees, travel expenses and other food and beverage services, and I see the cost of this fee can be reasonable although there are different types of costs in each location, I bet you have averaged out for different workshop locations.\nThe information about the people working on the project described in the proposal is quite detailed, the experiences described and the work you have done in the past indicate a high probability of conference events. will be a great success.", "q1r": 5, "q2": "The team has described the problem and the goals to be achieved are clear with indicators such as: the number of workshops, number of attendees, number of artists from Ethereum and number of artists opening Cardano wallets.\nI have a question here, how do you know how many artists open Cardano wallets to measure?\nThe obvious thing when it comes to success would be to successfully host the workshop and see the fun and excitement come to life with local artists, creators, and people as they join the conference and understand the benefits of using Cardano.\nI look forward to this myself, looking forward to attending your workshop, and looking forward to seeing attendees leave with the inspired and empowered vision they have now found true love. change their lives and have a positive impact on them and those around them, I look forward to your success and so does the Cardano community.\nAnd to assess whether the information provided is enough to assess the progress and success of the project, you should give a specific target number, such as how many workshops (2) or 3, 4..), how many attendees (40 or 50..), and you should provide a link for the community to click on and track your project progress.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 14663, "q0": "I found this idea totally aligned with the challenge. This aims to organize workshop to encourage artists minting on Ethereum to move to Cardano. The author gave very detailed information about this project such as its potential, its operation and the picture after being funded. With all of those, I strongly believe that this project would be big help in the progress of provoking projects into minting on Cardano  instead of Ethereum. I like the idea of inside-out marketing to solve the problem of getting more artists participating in the workshops. I do agree that ratio of not successfully delivering this is very low, because of all the disadvantages of Ethereum. But I have one suggestion that the proposer should include the exact number of artists expressing interest in your project. That would make the proposal much more persuading. ", "q0r": 5, "q1": "The author did a pretty good job on describing the picture of the team member. We got the information of who they are, their names, their backgounds and the related experiences and even the link to their personal accounts to get know more about them. My advice here is that the profiles provided should be the Linkedin ones instead of Twitter, so that it would make it look more professional. The plan to complete this project is divided into 3 phases which is about recruiting a workshop coordinator and making plan for the onsite day. One thing I wonder here is that do they have any phase to plan about the content of the workshop like the activities or the information would be given in that day. On the fiancial split, I think the proposer gave a quite clear picture of how the money will be spent. However, if the budget breakdown was detailed into each small part like the cost of advertising or so on, that would be much better. And also, I do not see any information about the salary for the coreteam, which should be included. ", "q1r": 3, "q2": "The proposer provided us with 4 KIPs which could serve as guides to measure the project's progress. I absolutely apreciate the fact that all of those were such as the number of workshops or attendees, which makes it easy to keep track. If I were a team member, I could understand what is going on and could know exactly whether this project is on right track or not to plan out for the next thing. The team's definition of success is really ideal. They picture the successfull workshop for us. However, I wish there were a specific KIP such as \"100 artists opening their Carnado wallets after the first workshop\", or so on. That would make the success picture much easier to imagine. ", "q2r": 4, "assessor": "z_assessor_4079", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Organize local workshops in which artists minting on Ethereum are presented with all the good reasons to mint their art on Cardano, and accompanied and guided on the journey of how to do so.", "experience": "The https://theartsuite.io team just hosted a cross chain NFT event at Hotel Ginebra Barcelona. \nPurpose of the event was to present artists with the wonderful world of Cardano NFTs. \nArtists of other NFT chains were invited to a 1 on 1 where we helped them create ADA wallets."}