{"id": 418068, "author": "newmindflow", "title": "Attract ETH NFT Projects & Talent", "url": "https://cardano.ideascale.com/a/dtd/418068-48088", "category": 26593, "amount": 28837, "description": "How do we get the interest of artists & developers planning to release NFT projects on ETH and onboard them smoothly to Cardano?", "f6_no_assessments": 10, "f6_rating": 4.633333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1291, "q0": "The aim of the proposal is to provide a one-to-one consultancy & onboarding sessions to both new and developing projects intended to launch on Ethereum. The proposers state, that these sessions will be supported by the series of visual guides, performed via video calls (even tough it is not mentioned by what apps it will be performed, I assume the free-version of skype, zoom or teams will be utilized.) The idea is that these sessions will be approx. 2 hour long, and according to the proposal, it will have two outcomes – information materials and marketing & promotion to attract new projects to Cardano. The proposers already outlined the contents, and just to name a few, these include: low transaction fees, low minting costs, etc. whilst the most appealing I find the fact of non-failed transactions. It is important to note, that these sessions will be free for those who will request them (so catalyst will cover the fees), and the estimation is to held approx. 2-3 sessions in average per project, and the range of projects consulted is 20-25. Regarding the assessment of the impact, I am strongly convinced that one-to-one free consultancy sessions can have a positive reaction from the community, both by the fact (obviously) it is free, and also, that usually when you launch a project, not every general guidelines might be applicable, thus, it can be very beneficial to have such a guidance (one to one) available. I believe that this proposal is in alignment with the challenge goal, and even tough it appears that it will have not so big impact (in absolute numbers), I actually feel that it can get the traction they expect. ", "q0r": 5, "q1": "Regarding the roadmap, the proposer state that the estimate is for 2-3 months. I must say, that in order to actually be able to assess the feasibility with relation to the roadmap, I would expect at least detailed plan for the first month. Now it is not really compelling, that it has some reasonable grounds. To have a better proposal, I would suggest to have the first month divided to weeks, describe whether marketing and guides creation is sequential or simultaneous activities. As well as, I would consider more details regarding the implementation plan, e.g. “Market Research: we need to check this, and that, because etc.” Right now, it is not very clear what is actually meaning by some of these items. On the other hand, the budget is very detailed, calculated by expected hours spent on some activities (so it could have been implemented in the roadmap, for the better picture). Nevertheless, I would still appreciate some more information such as – who will do the guides writing? Guides design? Marketing? Etc. because the sum of expected hours is 180, and it is not clear whether it will be performed combined, or some of these tasks will be performed strictly by one, or the other of proposers, or potentially by someone else. Regarding the team, as it appears, the proposers are two, and I would describe them as “artists”. They also provided linked-in profiles and I have visited their webpage, they already have some projects running from the past, which I am familiar with, thus I have no doubt they have the capacity to actually develop and launch a project. The only part that is not really covered is “ability to be a consultant”, so will take a leap of faith here, and say that as they mention, they already have offered consultancy sessions (but some sort of a proof would be nice to see.) Even tough my assessment might seem as contradictory, the overall impression from this proposal is that it is feasible, and all the negative aspects I have mentioned are considered as minor flaws.", "q1r": 4, "q2": "The problem solution is clear from my perspective – how to attract new people to Cardano from ETH? -> offer them one-to-one free consultancy sessions, by people who already launched their project on Cardano. Regarding KPIs, they plan to measure  number of visits, number of sessions, number of projects who actually migrated. I would also add (since I am convinced some twitter, or any sort of medium will be used) to track also engagements – visits, likes, posts, shares, followers. The proposers also set their  success after 3 months (10-15 projects sessions) and after 6 months (20-25 project sessions). The final goal (I would say) is to have 5-10 projects launching on Cardano due to these sessions, and the guides reached to the audience of several thousands. I consider all of these being relevant to the project goal and find them reasonably set. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5376, "q0": "There is no doubt in NFT will have huge marketplace in Cardano. Many projects already in working. It is brilliant idea getting more artist and developers who already worked in ETH.\nIts similar to many proposals like ETH rehab.\nHere proposer tells he/she will consult each \nartist one on one and they can explain about flaws and gas fee problem and how cardano is better in many things and how it works and value will be in future.  As people would already worked in developing field in ETH and would already faced problems explaining them and making them understand will surely possible.\nAll examples provided by proposer how cardano way better than ETH can be noted and it shows they have already prepared and have necessary things ready to start project.\nAs attracting all developing ETH projects to ADA will surely help Cardano Ecosystem. \nSo, This proposal effectively addresses the challenge\n\n", "q0r": 5, "q1": "As proposer has involved since F3 and many projects already. They already have working experience in  Trybbles & Icons Cardano NFT projects. The link provided looks great. \nThe budget breakdown is feasible and looks doable. There way of attracting many artist and developers also given which looks doable.\nThey are planning to provide support also which surely attracts many people.\nAs they have explained already in detail and requested funds also looks sensible.\nAs building consultant will surely helps Cardano community. By this project if quite number of developing projects if transferred to  ADA then it will be huge to our community.\nThere implementation plan looks great,\nThey have experience  and  plan also explained. So,  Given experience and plan presented it is highly likely this proposal will be implemented successfully and I strongly agree with project. \n\n", "q1r": 5, "q2": "As for any projects it can be measured only by KPIs, The proposer will be providing metrics of Number of view and consulted persons count and feedback which will be enough for auditing. As they will be providing monthly report  which is great. The success report will be given quarterly after 3-6 months.  \n As they are already worked in previous projects and ranked 3rd in previous round Surely they can complete the project and funded. So they given all details correctly and sensibly so   information provided is sufficient to audit the progress and the success of the proposal and it can be funded.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 6904, "q0": "Based on the problem statement on this proposal I can see some challenges to get more NFT of ETH users joining Cardano Ecosystem. This could consider as \"hijacking\" current NFT markets in ETH. There are 2 side on my mind about this hijacking markets. 1st one is good thing because we get more traction on the competitive NFT Market, the 2nd one is bad thing when we couldn't maintain people traction when people joining. I think those things need to consider on this solution challenge. I can see some traction action in this proposal solution. But it would be good to put how to maintain after people attracted, that's another thing after we get people from another market share of NFT joining. and this could be more challenging the team into another level.", "q0r": 5, "q1": "I can see some plans from previous fund actively running into some big goals. And I also can see the proposer team broken down some tasks into small pieces even submit another proposal that related to this big goal. I think the team is doing big things. it would be good if we can find the progress of the previous action / done, with the milestone and the goals in each milestone. Again the purpose is to get more visibility on this proposal implemented successfully.", "q1r": 5, "q2": "I can see some progress running that displayed in this proposal. I also can see this proposal linked with another proposal which I think It's still relevant with the purposes. The only suggestion I can say here is, that would be good if we can see the bigger point of view that can be accessed publicly about how the bigger plan of team has been achieved and what would be achieved in the near futures. So we can see how the team can maintain market and traction on each proposal sending in this Project Catalyst.", "q2r": 4, "assessor": "z_assessor_2847", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6931, "q0": "This is an extremely effective proposal when it comes to it's ability to migrate ETH projects to Cardano because they specifically chose 1-1 onboarding with high quality content creation. It probably comes from their onboarding experiences while consulting other chain projects already or competely new projects. I know because I have lead onboarding of 1000s of companies to adopt software products that went against their daily routine. The points about Cardano's strengths that this porposal also mentions are spot on selling points for the NFT projects to join Cardano and it's not only high gas fees that other projects are quoting in this challenge often because of the challenge setting itself. Super impressed and wishing the team best of luck! This is definitely a high impact project.", "q0r": 5, "q1": "The team has been dedicated to change and creating proposals that relate to NFT ecosystem for a while. They both have LinkedIn profiles that have real activity and content make them not a rug project. The proposals I'm the past funds although not funded or perfect by any means they are decent and worth the read. The plan is solid and clear. My only problem and suggestions is that 12 hours per week may not be enough to move the needle in the four months that the proposer is expecting to close on this proposal. However, likely what will happen is they will either see a lot of success and come back for additional funding to do more 1-1 onboarding time and consulting or this will die off. For the price of sub $30k this is a solid bet to onboard more projects and possibly develop content that other people can use to also onboard more projects. My hope that this is going to be an open sourced content and shared to increase the efficiency of shilling, marketing, and onboarding more projects.", "q1r": 5, "q2": "KPIs are clearly outlined and measurable and easily trackable by the team. The number of meetings are probably the main activity objectives but more than anything bringing five to ten projects over is worthy of the investment. I do wish that the project would go above the monthly project report and proactively reach out to the community to keep tabs on the success and also source feedback on the progress of the project as well to increase the efficiency of the project and so improve success rate. The team can also measure after meeting Net Promoter Score to know what effect they have on their customers and users and how effective the meetings are. The team also clearly outlines the stages of reactions with 6 months reaching: \"Between 20 - 25 projects show an interest in launching on Cardano and book free consultancy sessions to find out more about the process.\"\n\nand\n\n\"Between 5-10 different NFT projects and/or creators are successfully onboarded onto Cardano by either choosing to migrate to the platform or launching directly on Cardano.\"\n\nand finally:\n\n\"The guides reach an audience of several thousand.\"\n\nThis is an acceptable SMART goal that is specific measurable achievable relevant and time-bound. Kudos!", "q2r": 5, "assessor": "z_assessor_2855", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7772, "q0": "The problem raised in this proposal effectively adresses the challenge, the proposer is providing a solution to support the onboarding of ETH NFT  projects to cardano though consultancy and onboarding sessions by series of comprehensive and appelling visual guides. The elements given by the proposer are clearly showing the high performance of the onboarding and attractive  model he defends. This proposal is going to have a great impact on cardano by onboarding projects, things that the team says has done in the past. The proposal is able to scale and address challenges in the future. Reason why i strongly agree with 5 stars. ", "q0r": 5, "q1": "The proposal is likely going to be implemented, relevent experience and links are clearly described and are aligned with the described solution which is detailed on how it will be implemented by activities. The budget is missing some details and i think the proposer could cut down the cost of these activities to reduce the global amount, the proposal was submitted in Fund 8 but not funded then this is adjusted for this Fund.  The timetable, milestones and implementation plan are well designed and these give an image of the outcome, the proposer took in consideration major risk (like lack of interest, reservations…) and gave ways of mitigating them.", "q1r": 4, "q2": "The targeted problem is well described and the solution proposed is well detailed by the proposer, A roadmap KPIs and milestones are clearly mentioned, dates and estimation numbers are presented to allow the community to measure the success of the proposal after the Funding process. The proposal is auditable by the community.", "q2r": 5, "assessor": "z_assessor_2918", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8692, "q0": "Clearly identifying the project's target audience as NFT projects in development that have not yet been released or already exist on ETH makes this proposal more relevant to Challenge's key metric than ever before. The main purpose of this project is to organize consultation sessions and visual introduction for new or developing ETH NFT projects the advantages of Cardano will create a great development space for NFT projects, thereby promoting the expansion and migration of NFT projects from ETH to Cardano. It is proposed to clearly present the organization of educational activities for the target audience, including the form of organization, the time for each consultation session, the topics and materials that will be included in the consulting content, KPI of projects participating in consulting. The biggest challenge of this project is being able to convince the number of projects to participate in following the set targets, the proponent also has solutions to this problem, which are marketing campaigns and providing advertising and marketing materials.", "q0r": 5, "q1": "The proponent still does not have clear estimates of the timelines for the implementation of the proposed tasks as well as the completion of the master plan. Timelines should be specific numbers rather than an estimate to facilitate tracking of project development. The plus point is that the budget plan table is allocated by work items and calculated according to the formula of corresponding working hours for each task x level of remuneration. The hourly rate budgeting will be a very good basis for future audits. The descriptions of work experience, previous successful projects, outstanding activities on Cardano and NFT, etc, show that the people implementing this project are fully qualified, qualified, and deep understanding to be able to do a good job advising on topics related to NFT and Cardano utility.", "q1r": 4, "q2": "The proponent has designed a clear and ideal audit trail consisting of two stages for conducting the audit, the definition of success indicators, and the target for each definition. However, the provision of tools/methods for the community of project enthusiasts to monitor progress and update relevant announcements has not been completed yet.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11668, "q0": "The proposer has done so well by outlining solutions that effectively addresses the challenge. The proposer and team have been able to identify a problem which is a problem to the growth of cardano and has provided concise solutions to solving this . Also the value it would add to the cardano ecosystem and blockchain technology are enormous as outlined by the proposer in that projects would transfered to the blockchain platform and carried out,  new onboarders would be onboarded, wallets created etc and I believe this a plus to the blockchain technology and cardano and should be funded. Furthermore, the key metrics of the proposal aligns so well with the outlined challenge settings.  The proposer has also done well by been able to scale future challenges to the adoption of cardano blockchain and addressing this challenges. ", "q0r": 5, "q1": "The proposer and  has outlined a detailed plan to execute this particular project of which I think is attainable.  A time line has been attached to the proposed plan in order to measure progress and achievement of goals. Furthermore, a clear budget was provided and even broken down into identifiable items which is reasonable in achieving the goals of the proposal.  Resources needed for the implementation of the project were also stated in the plan. Moreover, the proposer has carefully selected resourced persons to  carry out the project and I trust it can't fail if funded. The proposer is an artist and entrepreneur in CNFT space since day 1, creators of the troubles and icons cardano NFT projects,  he had also been involved in project catalyst since F3, a member of the cardano initiatives and communities  and a core member of the cardano NFT guild.  This are all relevant experiences and skills needed to implement this proposal of which the proposer stands to possess them all.", "q1r": 5, "q2": "The proposer has done great job by stating 3 KPIs under which the proposal would be measured in terms of success ; 1. Number of visits to the online guides. 2. Number of 1 on 1 in person consultancy sessions,  and 3. Number of projects onboarded to  cardano that migrated from EVM based blockchains. How success would look like for this proposal if funded and implemented have also been added with numerical figures which can be measured.  With this information,  I believe that the progress of this proposal can be audited. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 13382, "q0": "The presentation of the proposal is quite good and solves this challenge, and I appreciate the quality of your proposal because it helps attract people who are intending to Ethereum or those who are already with Ethereum and want to move to Ethereum. another platform to get more convenient points, and at this moment Cardano is the most appropriate name that we want to suggest for them.\nYour solution is to set up one-on-one mentoring and mentoring sessions along with informational support materials on topics such as the following: CNFTs are real native tokens The reality of living on the blockchain is at the same level as ADA, ADA is more eco-friendly because it has very low energy consumption, extremely low NFT minting costs, very cheap transaction fees, most transactions are done The show is successful, the community thrives.\nAnd the 1:1 consultation is extremely high quality because you are also an artist, so it will be easier to convince, I hope your project will be successful.", "q0r": 4, "q1": "Your estimated time frame for planning is about 3 months and with 9 clearly outlined action plans.\nBut there is a problem here is that I don't know where you will hold the tutorial, offline or online, if it is offline then it is better to have a specific address, the marketing part you intend to market through which channel? Google, Facebook, Tiktok, or online newspaper sites, be as specific as possible.\nIt seems that the detailed budget has been broken down by specific tasks, but I have a small suggestion that the writing of the instructions should be based on output quality rather than hourly, so should the design part, calculated on the final product.", "q1r": 4, "q2": "You will measure the progress of the project by the number of visits to the online link, but in the plan section, you did not specify where the online link is, from which social network or platform. so it is very difficult for the community to verify.\nThe second is that the seminars do not know where to take place?\nThe information you give here is only close enough to assess progress, you need to provide more detailed information.\nKPIs to describe success after 3 months and after 6 months have given specific numbers with the number of projects, you should provide a link for the community to click on to see the details of the project progress", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 13473, "q0": "The fact that artists and developers plan to release NFT projects running on the ETH platform and bring them into Cardano is a problem that needs to be solved in this challenge. The author's well-defined solution solves this problem by including mentoring sessions and introductions for new ETH NFT projects into courses that help more people understand the issue. This proposal is scalable to a large scale it can solve the problems of the future and help people know more about the Cardano ecosystem. The biggest risk of this is the lack of interest from projects involved in the discovery and consideration of Cardano as a viable blockchain to launch. This is one of the risks that the author sees that could affect this project of proposal. However, they also offer a reasonable solution to this problem.", "q0r": 5, "q1": "The estimated timeframe for this funding if funded is between 2-3 months. To-dos: market research, drafting guide, guide design, publication guide, marketing, consulting session, results analysis, translation and publication, analysis, presentation and marketing display successful results. Here's what to do after the project is funded. This is a perfectly reasonable timeline to be able to successfully implement this project. The success of the project is that after 3 months it is possible to reach 10-15 projects showing interest in presenting on Cardano and reaching several hundred readers. Success in 6 months can reach 20-25 projects that show interest in showcasing on Cardano and signing up for free consultation sessions and reaching out to several thousand audiences. This will be a great success with this challenging thread. Projects planned or launched on an EVM-based blockchain implementation in the Cardano ecosystem and can do that easily. This is exactly our main goal with this proposal. I think if this project is funded then success will surely come to their proposal.", "q1r": 5, "q2": "The project team consists of artists and entrepreneurs, in the CNFT space since day one, the creators of the NFT projects Trybbles & Icons Cardano. Award-winning filmmakers, film and animators, and game and app developers. The team consists of Anamaria Kövesdi, Rares Kövesdi.. and longtime crew members these are elite members in 2021, they move to the web3 economy, giving new life to one of our projects. them as an NFT collection on Cardano. The proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous. The author has given 3 main KPIs for the project which are: the number of visits to online tutorials, the number of one-to-one, in-person consultations and mentoring sessions held, number of projects launched into Cardano have migrated from EVM-based blockchains. These are the success indicators that the author has measured for the project. The funding applied for this proposal is $28.837. The author's budget is divided into two main expenses: the human resource budget is $ 28.000, and the fixed price is $ 837. For each expense, the author divides the amounts by the hour, how much money will be equivalent to 1 hour. I found that the team was too detailed in listing the budget.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 14556, "q0": "The team has done a great job working out a detailed solution to draw the attention of artists & developers planning to release their NFT projects on ETH and onboard them smoothly to Cardano. This is essentially well-aligned with the challenge. Their proposal is so well-written and evidence-supported, thus really easy to understand. The team offers a detailed description of their solution, which consists of 2 parts: online guides and on-demand, in-person, one on one consultancy sessions with NFT project creators and developers. These two components work in tandem with each other to bring in the best results possible.\nThe proposal has very clear key metrics to picture the project progress. The time for consultancy sessions for each requested project may vary, depending on its own demand, however, the team sets the maximum number of 5 sessions for each project over the course of its development, and therefore, they have good control of their consultancy length.\n Some artists and creators may wonder if Cardano works way better than Ethereum when it comes to the realization and promotion of their NFT projects. The team members themselves are artists and creators with already existent successful projects on Cardano. They have abundant first-hand experience, so setting themselves as an example for other NFT artists to follow is quite a reasonable solution to avoid the risk of artists having poor interest in or some suspicion against the Cardano ecosystem.", "q0r": 5, "q1": "As the proposal is based on the completion of an MSc thesis, it has a clear timeline. I see that the roadmap of completing the First Chapter, Rough Draft, Final Draft, etc. is required by the school and it’s a bit general and objective. If the proposer breaks it down by presenting some more details like his thesis outline, the number of the chapters, the number of pages in each chapter, etc. the timeline for each of these mini phases and their expected results, the proposal plan will have a higher sense of feasibility.\nThe proposer is the only one member in charge of this product, and the description of the project team member doesn’t come with any reference to verify his competence. I supposed some links for reference should be supplemented.", "q1r": 4, "q2": "Regarding the auditability of the proposal, the proposer still attaches to the key milestones of the thesis progress, which I find a bit too general. Again, if there are some specific numbers, for example, completing 25 pages of the first chapter by December 15, 2022, the project progress can be tracked and measured conveniently. I totally agree with the proposer’s answer to the question: What does success for this project look like?. Of course, it will be a finished Master’s thesis (MSc Finance) on Catalyst as a decentralized VC solution ideally suited for developing country entrepreneurs. I hope the thesis will be completed with the highest quality possible to inspire more students entrepreneurs to get onboard on the Cardano system.", "q2r": 4, "assessor": "z_assessor_4072", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "One-on-one consultancy & onboarding sessions for new & in-development ETH NFT projects supported by a series of comprehensive & appealing visual guides.", "experience": "Artists and entrepreneurs, in the CNFT space since day 1, creators of the Trybbles & Icons Cardano NFT projects.\nInvolved in Project Catalyst since F3.\nMembers of various Cardano initiatives & communities.\nCore members of the Cardano NFT-Guild."}