{"id": 418348, "author": "flantoshi", "title": "Educational Content in Human Terms", "url": "https://cardano.ideascale.com/a/dtd/418348-48088", "category": 26593, "amount": 6650, "description": "There is very little non-technical content that explains blockchain and Cardano in human language and without being BORING! This leads normal users into the arms of shady social media influencers.", "f6_no_assessments": 10, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 2836, "q0": "\"The problem here is that very few articles are written about Blockchain and Cardano, so it leads to distorted and incorrect thinking from people who have little contact and as well as the Ethereum ecosystem community. new to the feature of the platform they are developing without knowing the difference and great features of Cardano, with solutions to meet the requirements of the challenge, the proposal came up with an idea that: The project will provide articles written about Blockchain and especially Cardano.\n  The inspiration for this idea is the impact from the Ethereum ecosystem community which is already evidenced by the proposed offer. so we can understand that they also have a lot of people who want to migrate over to the Cardano platform\n   * I very much welcome and support the arguments and solutions of the proposal as well as the ambitions of this idea writer: the project commits to creating content and providing weekly articles on preliminary content. about Cardano's features to increase community curiosity and encourage them to come to our ecosystem, about the ambition of the proposal to want to be a neutral platform for the Ethereum community to access and Read the information related to displacement with this in mind. I have a suggestion to you that you can consider partnering with an organization or individual with in-depth technical knowledge as well as experience for the transfer. hey i can introduce you to an alliance of Defi array managers and they will give that data to you for free and you just give it back to your community and you're done. the title of that proposal is \"\"CDA DeFi Education\"\".\n   There is no risk to worry about in this proposal because it is mostly about gathering writing and community development knowledge, no technical elements. \"", "q0r": 5, "q1": "\"The proposal's commitment will deliver the articles as promised to Twitter, and this serves the community that views them.\n   all proposed team and budget presentation requirements provide a complete explanation of time and spend per hour generally specific and documented to verify you work consistently You and I are a writer. suitable for developing this idea. \"", "q1r": 5, "q2": "The community that can check weekly on Twitter will have verified jobs on it on a weekly basis, which is the claim of the proposal, but to expand the impact the proposal should consider posting Post on other social networking sites for wider community interaction. The success of this idea is determined to introduce some people to migrate into our ecosystem and expand the community of the proposal to be more Cardano and financially savvy.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 4786, "q0": "This is a great initiative! The proposer points to the problem of lack of content, which is very little non-technical content that explains blockchain and Cardano in human language and without being born, and proposer claims that his solution will make it much easier to make someone pay attention when you can excite them, interest them or amuse them - I can do all three! He claims to produce weekly educational content regarding Cardano, TradFI & crypto. As I already wrote, this is a great initiative, but this proposal is not in line with the challenge settings, nor is there a developed idea of how users of the Etherium platform will move to the Cardano ecosystem. It would be great if the proposer presented how this proposal will add value to the Cardano ecosystem. As key metrics and goals have not been elaborated and presented, this proposal is not aligned with the challenge settings and the proposal is not able to scale to address future challenges.", "q0r": 3, "q1": "The proposer introduces himself to the community with his pseudo name via Twitter and his website. I would love to see who is behind this pseudonym! The proposer provides the articles he has written so far as evidence of his skills and knowledge in writing texts. Budget is presented and it is very modest. A budget breakdown and a work plan were made with a clear time frame within the work plan will be realized. The proposer states that one of the biggest realistic risks is his wrists hurting as he spends too much time at the computer but he has taken steps to acquire ergonomic equipment, and some is even considered in this proposal.", "q1r": 4, "q2": "The proposer claims that he will write one article and Twitter thread weekly for a period of 4 months and that the community will be able to see his progress on Medium and on Twitter, as well as pointed monthly updates on www.catalystaudit.com. I would like to see a detailed plan for how the content written by the proposer will encourage users of the Etherium platform to switch to Cardano and how it will be possible to measure how many users or companies will eventually switch from the Etherium platform to the Cardano ecosystem. For that, it will be necessary to work out KPIs and generally prepare a proposal to go in that direction. ", "q2r": 3, "assessor": "z_assessor_2616", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6597, "q0": "This proposal aims to catch people who are not technical-related and who are not aware of the Cardano jargon. The proposer states that through a more basic language, more people could be attracted and so the ecosystem grows. This proposal is to require funds so that the writer can reduce the opportunity cost of doing this activity and stop doing other jobs. Translating technical jargon into “human terms” is one of the easiest ways to encourage large amounts of people to jump into our network and help its development. This idea is a win-win for both the proposer and Cardano because if it is done well and calls many people´s attention, a significant impact could be made. (Rating given: 5)\n", "q0r": 5, "q1": "The proposer is a man with a large experience in writing articles, who has already worked for Cardano before, and who shows to have the will to show how much he believes the Cardano ecosystem is worth. Due to the characteristics of the proposal, it does not require an extremely specific milestone roadmap. On this occasion, it is enough with presenting how the proposer plans to achieve his goals and how is he going to develop his work. Regarding the budget, it is specific enough for the funds requested, since it explains where the values come from and how the proposer calculated them. Overall,  this is a feasible proposal because the proposer offers a realistic timetable and the budget is reasonable to achieve the goals. (Rating given: 4)\n", "q1r": 4, "q2": "This project is easy to audit because of its intrinsic characteristics. As the articles and threads are going to be public, it will be simple to track the progress and measure the engagement of the people with them. Moreover, the progress will be also available on “www.catalystaudit.com”, so that it is open for audition. I recommend some other metrics such as clicks on the articles or interactions on Twitter to measure the success of the project. This success, considering that the main goals of this project are aligned with the settings of the challenge, should lead to a significant number of people jumping into the Cardano ecosystem, especially from the Ethereum network which is the reason this challenge was created.\n\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8015, "q0": "This proposal addresses the problem of lack of content about blockchain and Cardano written in plain language. I personally think a lot of educational content about Cardano is already out there. The project will not add value to the cardano ecosystem. There is an image about a member of the Ethereum community for advice on Cardano. There is no proof that this message is real. A few future challenges are included in the proposal. (wrists aching, too busy) The proposal is full of jokes and sounds unbelievable in some respects.", "q0r": 1, "q1": "I can't find anything about the author of the proposal. There is only a link to his website and a link on twitter. (Flanotshi) The petitioner works alone. Sometimes he enlists the help of his girlfriend and boyfriend to edit articles. The budget is clearly defined. The budget is sufficient to achieve the stated goals. The petitioner will come back for further funding. It will be counted for 8 hours to work on 1 article. I think this proposal comes across as very unprofessional and too many jokes are made. It states what the money will be used for. No technical aspects that are critical for implementation are included. A few risks are included. Many more useful risks could be included than just those 2. The project is certainly feasible to execute. I think it will have little impact on the cardano ecosystem.", "q1r": 2, "q2": "No roadmap is included with clear milestones. It only states that 1 article will be written per week with 6000 words. You will be able to follow the progress of this project on www.catalystaudit.com. It does not say what will be measured in this section. The petitioner has described the problem in terms of lack of educational content. I don't think this submitter will address the problem by writing 1 article every week. The project would have a greater impact if there was a clear website with a clear subdivision in terms of topics related to cardano.", "q2r": 1, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8882, "q0": "People always love to learn new things in always unique way where these unique ways help the audience to get more attracted towards a particular subject, The proposer wants produce a weekly thread on twitter and article on topics that the community finds valuable , so this idea of using cartoons , memes in the article is an excellent idea where readers never finds to get bored, which even helps them to be more engaged towards cardano and other crypto coins.\nThe proposer wants to make his article look like a novel so that people will always be interested and concentrated about the future developments of cardano. hence his proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has clear idea on what are topics that he must add in his article so that his article becomes more effective which might be  financial matters, tutorials and guides on how to stake and take self-custody, and overviews of elements of Cardano.\nThe proposer has also presented us he's previous article https://flantoshi.com/2022/04/29/why-you-should-invest-in-cardano where he has made use of memes, cartoons to make his article more beautiful ,with the proven experience in writing articles in most unique way adding those in thread will not be difficult task to achieve, hence given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal contains the proven experience work of the proposer and the proposer has immense confidence on how alone he can complete the project, and the proposer is even confidence about his economical skill where he has produced a well-received economic history book.\nThe proposal has even explained about the proposer punctuality of completing the project, the proposal has even proved on how Ethereum community members contact proposer for advice and guidance regarding how best to make sense of Cardano as an ecosystem. so this idea will definitely boost cardano ecosystem to gain more members in it , The presented plan has decent budget breaking and decent well structured timeline to complete the project by deadline, with proven experience the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11184, "q0": "Im not convinced that this is an effective way to address the challenge.  There are numerous resources out there for learning about Cardano.  Tons of content is already there.  I don't think that adding more content that may be easier read because it is more interesting is the answer.  Although, having fresh content may be more valuable than making it fun to read.  Also, I believe that making the content easy to find is key.  There is also the point that many people are already writing about Cardano because they love it, not to profit from writing about it.  A quick Google search can yield a ton of information that is free and relevant.  Reaching new people is important.  I would like to know how he will reach people outside of his following.", "q0r": 3, "q1": "I have no doubts that Flantoshi can write.  I have seen his articles before.  I also know that he has a lot of followers.  His work would definitely be seen and received well by many.  He does have a very good creative style and his articles are interesting to read.  I think the timeline and the cost of the work makes sense, although who knows what other obligations that he has that would prevent him from meeting deadlines.  One week does seem very reasonable to submit one article.", "q1r": 5, "q2": "Auditing the progress of the writing would be easy to do simply by looking at what he has posted.  Clicks on the article and followers with comments as well as twitter likes on content can also be tracked.  However, because he has so many current followers, it would be hard to distinguish among them who is clicking links or liking things that is already a follower.  He needs to make sure he is reaching new people, not just the current people that he already has on board.", "q2r": 5, "assessor": "z_assessor_3230", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11512, "q0": "Proposal suggests amplifying the Great Migration from Ethereum by creating educational articles for Twitter and medium.com. As proposer has personal account with 4k twitter followers and 400 medium followers. I doubt that this will help migration in a big way. I would suggest proposal owner to find and reach some additional friendly sites who would reshare created articles on Facebook/LinkedIn/Discord/Reddit, to reach different groups and improve impact. Also, I would suggest applying for some additional funds to market articles by paid advertising. The proposal does not specify topics which would be covered so it is unclear which parts of migrating from Eth to Cardano will be done. No plan for future sustainability or scaling is set. It is clear that good articles with good marketing could be highly beneficial for migration, lack of detail of this proposal makes me unsure about its impact.", "q0r": 3, "q1": "The proposer provides link to this work and according to his medium posts he is equipped to make valuable contribution to migration. Proposer states that he is professional writer but there are missing references to verify this claim, some LinkedIn or other resource would be beneficial. Budget for work to be done is reasonable and split into identifiable terms, realistic timetable is set and as one person project it is clear who will do what. Proposal identifies some challenges that might prevent successful implementation of proposal. For example, difficulty that proposal doesn’t identify, is determining topics to cover and having enough knowledge or time to get familiar with it. Some headlines for at least first 4 articles would improve the proposal and improve trust that proposer has enough knowledge to write different articles about Eth to Ada migration.", "q1r": 4, "q2": "Proposal defines clear roadmap by splitting 12 releases of article every week on public media, where community can check progress, plus states that it will publish progress to catalyst audit. Success of project by proposal team is defined to successful delivery of project. Better metrics like estimated reach of articles on media are missing. Example could be 4k views of article on Twitter etc. Also, as proposal targets to improve education of Eth migration to Ada, but doesn’t state domains that it will target, and no fine-grained problem definition that it would solve is there, proposed outcomes are insufficient to what they could be if proposal was better defined. Only delivering articles is very low standard for measuring of project success.", "q2r": 3, "assessor": "z_assessor_3255", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12572, "q0": "There is very little non-technical content explaining blockchain and Cardano in human language that is not SURVIVAL! This leads the average user to fall into the arms of shady social media influencers which is a matter of a challenge that needs to be addressed. it will add value to the Cardano ecosystem by creating weekly topics and articles on topics the community finds valuable. Each article seeks to educate the audience and make them think about cryptocurrencies in a novel way, thus enhancing financial literacy and increasing audience knowledge. Additionally, the proponent will provide an easy introduction point for the Ethereum community to interact with Cardano content without having to know Cardano-specific jargon in advance. With this proposal I believe that it is possible to scale up to solve future challenges. Can help people understand more about financial matters, guidance and guidance on how to bet and self-govern logic, as well as an overview of the elements of Cardano. With the impact of this project I rate 5 *.", "q0r": 5, "q1": "The proponent also gives the number of members involved in the project including him and sometimes asks for the help of girlfriends and friends to edit the article. The proponent also provided a budget breakdown, with a reasonable amount of the budget, for a total of $6650. And the proponent presented a timeline and milestones that were unclear on how much would be spent. details. How long will this project take the proponent? During that time, what should be done?... Unfortunately, the proponent did not make it clear. Besides, the proponent mentioned the risks when implementing the project, according to the risks that the proponent took. Recommendations made are at his risk. With this project, I rate it 4* because it is still lacking.\n", "q1r": 4, "q2": "As mentioned on the feasibility side, the proponent has not yet given a clear roadmap with important milestones and time to achieve them. When implementing the project, the proponent also determined the success of the project. This project will seed a new era of enlightenment and reason.\nAt the end of the four months, it hopes to further educate its community and create a platform that encourages discussion and enhances Cardano knowledge and financial literacy. With this recommendation I rate 4*.", "q2r": 4, "assessor": "z_assessor_3438", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 13064, "q0": "I agree with the author that there is very little literature out there that simplifies blockchain and Cardano, that you can immerse yourself in without yawning yourself to sleep. The few available are very technical, very boring and dare I say it ‘useless’ to inexperienced folks, who find themselves duped by scammers.\nFlantoshi’s project addresses the challenge. He’ll produce a weekly thread and article on topics the community finds useful. \nFlantoshi’s exciting and amusing, and will captivate readers who seek tutorial and guidance on financial matters, especially on cryptocurrency, and overview of Cardano.", "q0r": 4, "q1": "Yes, the proposal looks nailed on for success.\nThe author seems vastly experienced, and is backed solidly by his writings on Twitter and Medium. \nHe aptly provided links to his personal website, his Twitter feed and articles published in Cardano journals.\nReading through all these writings, he captivated your attention, and is able to get you to agree to his reasoning.\nIn his article, ”Why You Should Invest In Cardano -Part 1” he gives you valid reasons why you should join Cardano, and authenticates his judgement by stating that 90% of his personal net worth is in the Cardano ecosystem. He builds trust, and he builds a relationship.\nDedicating on an average 8 hours a week to working on this project is very achievable, and he comes across as someone who’ll do a lot more than he has put forward in his proposal. The projects bodes well.", "q1r": 4, "q2": "In Flantoshi’s own words, “By the end of the four months, I hope to have continued educating my community, and created a platform that encourages discussion and promotes knowledge of Cardano and financial literacy”.\nThere are no clear roadmaps stated, and attached means of checking whether the audiences are up to speed on what he’ll be teaching. For example, there is no weekly or monthly means of gauging the knowledge acquired by the community he’ll be teaching.\nThe 1 thread on twitter and 1 article every week are laudable and easy to check, and know whether he is doing what he says he’ll do,  but they do not categorically state the knowledge he seeks to impart from one stage to the other", "q2r": 2, "assessor": "z_assessor_3555", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14838, "q0": "I, at the end of the day, am very keen on what is written by the author in this segment. In the event that somebody isn't keen on innovation or things connected with virtual money, it is hard for them to spend quite a while perusing and finding out about it. Hence, making fascination and uniqueness is likewise a decent plan to assist more perusers with getting to information. I went over certain articles composed by the proposer on his own site about Staking center and Reasons for purchasing ADA, and they have a very friendly design with novel textual styles that make certain to dazzle anybody who visits. Also, the proposer utilizes a large portion of straightforward language, staying away from specialized words with the goal that the peruser isn't exhausted or feels like reading an economic newspaper. Specifically, there is an enormous number of devotees on the creator's Twitter account as well as somebody requesting help from the proposer to begin developing Cardano, so there is no great explanation to decline this project any longer. Nonetheless, just design and easy-to-understand words are adequately not, instead, the proposer can add some of the following options to improve the quality of the article. First of all, make a unique title, in light of the fact that better title, more individuals will be keen on the subject you referenced in the article. Moreover, toward the finish of each article or on your Twitter page, the proposer should try asking questions and giving multiple choices to assist the peruser with surveying what they have perused and assist the proposer with understanding that the peruser is somewhat intrigued with what is composed or not.", "q0r": 4, "q1": "Perhaps since you are a writer, what is written in this part is made sense exhaustively, reasonably, and straightforward. First of all, as per the plan, there will be around 24,000 words in no less than 90 days with the number of articles arriving at in excess of 12 articles, a great number. However, I have not seen the topics that the proposer plans to write on soon. Obviously, to come up with all 12 topics at once is inordinately difficult, ainstead, attempt to give instances of subjects for your next article, so that the voter can judge if it is really appropriate and timely.\nThe budget plan is determined by hours including 3 sections research, writing, and editing. Proposer expects to spend around 8 hours on every post for $ 400 and when added up, it surpasses the financial plan considered for this Challenge. The overabundance sum is for the most part not excessively enormous for a decent proposal and carries many advantages to the Cardano ecosystem, but so the project is easy to be judged harshly and requires more than what the proposer intends to do in this proposal.\nAt long last, as a proposer, you will likewise carry out and compose articles with intermittent assistance from your companions. Overall, for the primary work, this is very great, yet to get more individuals to be familiar with your posts quicker, you might need the assistance of social networks. Ask your companions or find a colleague to run promotions for your posts on Instagram or Facebook.", "q1r": 4, "q2": "This section is written quite briefly but is full of what is needed. Voters instead of following the progress of the article on the proposer's homepage can visit Catalyst Audit's website to easily follow the progress of the project. The success that the author wants is also completely consistent with what the proposer intends to do in this project. Overall, I have nothing to add or edit in this section.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "It’s much easier to make someone pay attention when you can excite them, interest them or amuse them - I can do all three!\nI'll produce weekly educational content regarding Cardano, TradFI & crypto", "experience": "I’m a grown man who pretends to be a flan on social media…that’s gotta count for something!\nBesides the content I write as Flantoshi, I’m a content writer. I’ve also written well-received economic history books, worked for investment banks and I used to be a financial journalist"}