{"id": 419167, "author": "sebastiengllmt", "title": "Accelerator batch #3", "url": "https://cardano.ideascale.com/a/dtd/419167-48088", "category": 26593, "amount": 120000, "description": "Grow an ecosystem is hard even harder is doing it in a speedy manner. Some startups that are already in Ethereum need convincing and mentoring to join the ecosystem and growth fast.", "f6_no_assessments": 19, "f6_rating": 4.017543859649122, "videos": [], "media": [], "f6_assessments": [{"id": 2888, "q0": "The proposal's goals  align with that of the challenge. I'm in agreement that start-ups need to be incentivized and incubated to onboard them onto Cardano-funded solutions. However, I'm not certain that the proposer effectively addresses the challenge. \n\nThe proposer explains that they received 60+ proposals yet only funded five proposals. It's not clear what the gap in quality between those that were funded and not funded is, but this is something that should be remedied by revamping the accelerator process. \n\nThe proposer goes on to explain that once Catalyst funds are used to incentivize developers, other monies from Dlabs can be used to further fund projects that the team vets and selects. Therefore the proposer currently has access to fund more developers. \nFinally, as important as it is to support start-ups, the proposer identifies a fundamental problem that they have experienced: \"The main risk is to not have enough good quality startups applying for the program.\"\n\nI'm not convinced that offering more funding or even more support solves this fundamental problem. If I could, I would encourage the proposer and team to come up with more innovative approaches to attracting the quality developers they would like instead of focusing on the known classes of developers. If that new and innovative approach is their partnership with SOSV then that should be emphasized and elaborated upon. ", "q0r": 3, "q1": "To my knowledge unrelated to what is communicated in the proposal, the dcSpark team and SOSV team have the necessary skills to deliver. However, the proposer does not explicitly provide for these skills. \n\nAdditionally, the team only allots for one month to interview potential start-ups, and for activities to begin two to three weeks after selecting start-ups. It is my belief that this is not an adequate enough time period for the relevant skills of SOSV to be leveraged. SOSV would seemingly not have enough time to scout quality projects, coach them, and guide them. The accelerator program does not necessarily have to imply that it is on an accelerated timeline. \n\nThe dcSpark team has the technical know-how, but the team has not provided enough evidence to show that they also know how to  single out projects that can provide real utility and growth to the ecosystem. \n\nFor these reasons, I disagree that the budget and plan are feasible to deliver on the project goals. ", "q1r": 2, "q2": "I don't believe the proposer provides me with enough information to audit the progress of the project including the desired outcomes. The proposer is looking to evaluate success by increasing the number of applicants beyond the approximately 60 applications received last round. One would expect that to easily be achieved given that they are offering significantly more funding. Going further the proposer describes a measure based on the number of \"quality\" applicants; however, there is no description of how I am to objectively measure quality applicants. \n\nGiven that the team is looking to select the same number of start-ups with double the funding this time around, they could have used the previously funded start-ups (and measures used to audit their progress) as some sort of benchmark. Of course, this assumes that they continue to evaluate already funded projects in an objective way. If that is the case, the proposer should have leveraged that structure for the next round of start-ups, and committed to making such information accessible via public channel to the Cardano community. ", "q2r": 1, "assessor": "z_assessor_2358", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1024, "q0": "Milkomeda is doing an important thing in the Cardano ecosystem by creating an EVM bridge for non-EVM blockchains. \n\nThis proposal signals the next step in the journey that Milkomeda started. A lot of Ethereum apps might be skeptical about moving to Cardano but this will help hold their hand and lead them safely to the chain. \n\nIf successful, this will help in setting off a chain(😏) reaction that will bring other apps on board. Speed and accuracy is at play here  and Milkomeda has hit the core of the issue with this proposal. ", "q0r": 5, "q1": "The Milkomeda team has a track record of delivering on the projects they have embarked on. This is highly likely going to be a successful project as it lies on the path of the EVM apps adopting the path of the bridge between Ethereum and Cardano. \n\nThen there is the SOSV which is an early stage VC that has a history of taking projects to great heights. They had 1.2 billion dollars in assets under management and over a thousand portfolio companies in January 2022. \n\nBoth teams are perfectly alligned to deliver a great migration of Ethereum apps to Cardano. ", "q1r": 5, "q2": "While there's confidence in the team delivering the project, it is difficult to track progress based on the information provided. With the kind of budget being asked, it would be great to see a more concrete roadmap that implies the monthly or weekly reports on progress of the project. \n\nAsides that, we can work with the information provided to see how we can track the project. ", "q2r": 3, "assessor": "z_assessor_2186", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 12721, "q0": "This Proposal has correctly addressed the Challenge Topic of \"The Great Migration (from Ethereum)\" as it aims to attract start-up projects to join the Cardano Ecosystem.\nAs a serial start-up myself, I find the Team's solution very helpful and practical. There are also acceleration programs in Vietnam which I find very helpful to young entrepreneurs and start-ups. These programs equip Vietnamese start-ups with the basic skills and knowledge to carry out their new ideas and correct their business plans if there are deadly flaws that need to be addressed. Most of the start-ups chosen to be in these programs are doing well in the Vietnamese market.\nThe Team has a good idea to attract start-ups to migrate to Cardano Eco-system from Ethereum, it does not only bring start-up users to Cardano but also promotes Cardano as a platform that is active in encouraging, facilitating, and coaching start-ups to be better funded, better planned, and better executing their ideas and inspiration. I believe this is beneficial to both promote Cardano's reputation and eventually bring about financial benefits.\n\n\"I believe the idea can be scaled internationally to every country in the world. A lot of successful and inspiring people around the world would be willing to share their time and experience with younger generations as a whole, and young entrepreneurs in particular. \n\nIn addition to this, the Team (supposedly) is made up of English native speakers, which would be vastly beneficial in promoting their ideas and communicating with participants of the program. \"\n\nI find the team's objectives unspecific and unmeasurable. While the fund amount that they are asking for is high at USD 120,000, it does not show how Cardano can benefit from this program. In addition, the Team has not demonstrated how the collaboration with an outside partner SOSV can be executed: How is the collaboration planned out? Who will bear the cost? At what amount? Who will take care of marketing and finances? And so on.\nFor the above-mentioned reasons, I give the Team an average of 3/5 for Impact.", "q0r": 3, "q1": "I think the Team's budget is sufficient to carry out the planned goals. USD 120,000 is a lot of money to be paid in one go just to be funding a start-up accelerator program. Having some experience with start-up accelerator programs in Vietnam, I trust that the majority of the program's costs would be to pay venue expenses and mentor's compensation. The Team has not stated how they would pay these costs. What kinds/standards of the venues that they are going to use? How are they going to compensate their mentors/speakers? This important information is not shown in their proposal.\nThe team has put good effort into preparing their proposal. with The live streaming of their Accelerator program is daring, yet effective to promote the Project and the Cardano Eco-system in return.\nThe proposed idea is not tech-related, hence the proposed Team of famous social figures is appropriate. In addition, I believe the Team would be able to attract a lot more attention once they have got funded by Cardano Catalyst Fund Program.\nI agree with the Team on their assessment of the biggest execution risk, which is the inability to attract quality start-ups to the program. I suppose they also look beyond the UK's borders to search for the best start-ups in the world to be admitted to their program. There is no reason for the Team to be bounded within the country's border.\nThe Team seems to be experienced in social media and business consultation. However, I truly believe that they can involve more affluent members of the public to participate in their program once they can prove it is educational and beneficial for the whole economy.\nFor the above-mentioned reasons, I give the Team an average of 2/5 for Feasibility.", "q1r": 2, "q2": "Since this proposal does not involve technical issues, and the Team seems experienced with relevant background in start-ups, I trust that they will be able to implement the timeline successfully. However, the team needs to clarify the important milestones with more specific details for readers to assess their projects more easily.\nWhile the Team has provided the solution to the problem, they have not stated the expected outcome of their solutions. There are no measurable qualitative or quantitative goals after the program has been implemented. How do the Team know if the start-ups have learned and grown from the coaching activities? How can they measure the effectiveness of the program based on the start-ups' key figures? How do they know that they are doing a good/bad job so that they can improve in the next program? I, as a Cardano Community Member, want to know these important details to evaluate the success of this program later on.\nThe Team's solution is not carefully elaborated in their proposal, and I don't think that they have put enough effort into doing so. I think the Team is capable of composing a more detailed proposal with specific cost items, KPI items, and measurable outcomes. While I find the Team's idea very inspiring, I do not value highly their devotion to the presented proposal.\nFor the above-mentioned reasons, I give the Team an average of 2/5 for Auditability. ", "q2r": 2, "assessor": "z_assessor_3470", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11475, "q0": "This proposal is aimed at startups from other blockchains that need to migrate to the Cardano blockchain; they need the advice and assistance of a reputable and experienced organization to solve problems and work toward a roadmap. The propose will assist startups in moving their projects to the Cardano blockchain more quickly and successfully. \nAlong with that, collaboration with the SOSV organization increases the proposal's credibility and influence, allowing the proposal to select the most suitable startups. However, I'd like to know if the team has a plan in place to mitigate the risk that all five startups will fail on demo day, such as a few extra weeks to advise on improving the idea. This is to ensure that the proposal is effective.\nThis proposal perfectly fits the chapter's challenge, and I have high hopes for it, so it gets 5 points.", "q0r": 5, "q1": "A perfect combination of a startup investment organization and a group of experts with extensive experience in their fields to assist startups in developing better projects.\nHowever, it is preferable for the team to have a better understanding of what the 20,000 USDC funding is intended for, such as project survival, marketing hype, or obtaining the first round of funding and then monitor the progress to fund the project in the next. Because 20,000 USD is not a small sum, but it is also not too large to fund a project.\nBecause the budget stated is not clear, it is difficult to determine the likelihood of success of the proposal, but I believe the team will have a separate plan for each different project, so I give this section 4 points.", "q1r": 4, "q2": "The group's measurement indicators are adequate for meeting the challenges requirements as well as evaluating the proposal's success.\nHowever, if the team can more clearly state the metrics that the team expects the startup ideas to be able to achieve after this training, such as marketing skills, design skills, or important knowledge in the process training program. This provides the community with more information to accurately assess the project's success and understand the quality of this proposal.\nBecause there is a lack of some information and the indicators are not clear for the community to understand how successful demo projects are, I give this section 4 points.", "q2r": 4, "assessor": "z_assessor_3250", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10898, "q0": "Milkomeda C1 is an Ethereum Virtual Machine, EVM, based sidechain connected to Cardano. With this proposal they team up with SOSV (sosv.com), one of the most active early stage investors in the US, to attract new startups.\n\nIt is essential that new projects seek to exploit the communication between Etereum and Cardano. This proposal focuses on helping and incubating these types of projects so it fits perfectly with the challenge.", "q0r": 5, "q1": "In this proposal we have two brilliant teams. On the one hand, the Milkomeda team has proven their great technical skills by developing one of the few ways to migrate assets between ethereum and cardano today. On the other hand SOSV in one of the most active early stage investors in the US. Over 1000+ investments and multiple acceleration programs including one for blockchain. This makes the chances of success very high.\n\nI would like to see a more detailed explanation of the project budget. For a big budget of 120,000$ only these two lines are shown:\n- 20k USDC per startup in funding\n- 20k USDC for program cost during almost three months of work (~6k per month for a team of multiple people)\n \n", "q1r": 5, "q2": "The metrics for measuring project development are sufficient. It is considered successful if at least 3 startups are able to present a demo of their MVP after the programme. If this happens we will benefit from at least 3 new high quality projects interested in Cardano-Etherum interaction.", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7659, "q0": "This proposal addresses the challenge by attempting to accelerate the adoption of Cardano and Milkomeda by providing mentorship, funding, technical support and other benefits to projects/startups considering Cardano.\nThere are many barriers to migrating to a new blockchain. This project facilitates the process for adoption by providing the support and expertise needed to successfully launch.  \nThe team has already implemented this idea and have at least 5 startups in queue per their Medium article on 6/7/2022.  This proposal would allow them to fund an additional 5 startups in the accelerator program.\nTo better understand some of the marketing strategy, take a minute to read about growth hacking if you're unfamiliar.\nThis project, by it's nature, encourages migration from Eth and Eth compatible blockchains and is deserving of 5 stars in effectively addressing the challenge.", "q0r": 5, "q1": "This proposal is a continuation of this team's accelerator program originally proposed in Fund7 and will allow for 5 additional startups to be funded.  This initiative is still relatively new, but the team has started to implement this program with a group of 5 startups from 60 applications, which does give some credibility to the need for this type of program.\nThe team themselves have proven to be innovative and hardworking, delivering on multiple core projects.  Review of team bios reveals a wide variety of expertise and accomplishments both inside and outside of Cardano.  Members of this team are considered to be some of the brightest devs in Cardano.\nThe process for each startup is around 12 weeks from marketing and gathering applications to deployment of a MVP on the blockchain.\nI rated this proposal 5 stars due to the team's track record of delivering products themselves and the prior implementation of the program with 5 startups participating already.\nOne opportunity for improvement to this proposal might be a short description of some of the challenges the team has faced to date in implementing this program and how they might change the process for future participants.", "q1r": 5, "q2": "KPIs monitored will be the number of applications, acceptance of quality projects, teams finishing the program in 6+ weeks and deployment of a MVP. \nWhile it's not a big concern due to the public nature of this team, I would have appreciated knowing the location of information to track the progress of this project.\nThe Cardano community will be able to easily track the startups participating in this accelerator program, prompting a 5 star rating in auditability.", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7420, "q0": "The project is a 4-6 week accelerator program in partnership with SOSV and industry leaders in the Cardano ecosystem to invest in startups growing on Milkomeda, a full sidechain that corresponds to ETH. The project will make a big impact on developers, what can be done on ETH can be done easily, better and cheaper on Cardano. Therefore, the project is completely suitable for the Challenge\nThis is a good opportunity for startups, with technical support from dcSpark, dLab, and the core developers behind Milkomeda. Aside from the main risk that there aren't enough good quality startups to sign up for the program, I think there's also the risk that the whole community is waiting for the Vasil hard fork to come, everything is compressed.\nIn terms of the impact of this proposal compared to the Challenge, I rate it 5\n", "q0r": 5, "q1": "The detailed plan is divided into 5 major steps, the total proposed implementation time is 4-6 weeks, excluding the first month for the interview. Specific work topics. With 20k USDC funding for each startup, I fully support it. Budgeting 20k USDC for program costs for almost three months of work (~6k per month for a large group of people), it's a reasonable cost and somewhat underwhelming. Because all members are veteran developers. However, the project should break down and list in detail the costs in the work program for the community to monitor and evaluate.\nMembers of both groups please list social media links for the community validation, all for the sake of Project Catalyst's consistency. I rate this part 4 points\n", "q1r": 4, "q2": "The project presents 4 KPIs for evaluation, all of which are easy to quantify and objective. However, the project should provide specific update links for the community to easily track the results and development of the project. The success of the project is very desirable, creating all conditions for the startup to develop, attracting more community, and helping the Cardano ecosystem to be strong. Everything that happens on Milkomeda generates great attention from the ETH community. I give this part 5 points", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5708, "q0": "This has been extremely beneficial in drawing numerous new projects and investors to Cardano and facilitating the expansion of the Cardano ecosystem. The proposer will be able to draw in many new projects by running a 4-6 week acceleration program, which will accelerate the growth of the Cardano ecosystem. This proposal can be scaled to meet future challenges because a similar type of acceleration program can be run to draw numerous new projects in the future. The proposal's metrics and goals are in line with the issue. As a result, this proposal effectively addresses the problem.", "q0r": 5, "q1": "To put this proposal into action, the proposer will collaborate with SOSV. The main creators of Milkomeda, Flint, and cardano-serialization-lib are the proposers. One of the most active early-stage investors in the United States, SOSV has made over a thousand investments and is a part of several acceleration programs, one of which focuses on blockchain technology. On the basis of this, it can be said that the proposer has the necessary expertise and supporting to carry out this proposal successfully. The proposal has a rough distribution of funds but no clear fund breakdown. It would be difficult to determine whether the fund of 120000 USD demanded is reasonable or not without a clear fund breakdown. Additional funding would be necessary because this acceleration program will be run frequently to draw new projects to Cardano, and they have provided justification for the same. A clear description of the accelerator program for startups to build on Milkomeda has been provided by the proposer. They have also stated that they will use a growth hacking outbound strategy to attract top-tier startups to use Milkomeda to expand to Cardano. As a result, a proper plan has been provided in the proposal. The risk of not having enough good startups apply for the program has been taken into account by the proposer. They've also offered a way to reduce it and It is very likely that this proposal will be put into action.", "q1r": 4, "q2": "The proposer has specified key milestones and a timeline for implementing the proposal. One month will be dedicated to interviewing startups, and after a few weeks, a startup will be chosen and the program will begin. The next six weeks will be dedicated to the acceleration program. This rough plan, as well as the proposer's suggestions for measuring project progress, will be sufficient to track the project's progress. The proposal will be successful if 5 good startups are chosen and at least 3 startups complete the program successfully by presenting an MVP at the demo day. The proposer has provided a clear and understandable description of the problem and also a clear explanation of the solution. Cardano has a very strong technical foundation; the only thing it lacks is marketing in order for it to reach its full potential. As a result, the proposer will be able to attract new startups and investors from other chains by implementing this program. Through the program, startups and investors will be able to learn more about cardano and begin developing new projects on the cardano network, which will provide a significant boost to the growth of the cardano ecosystem. As a result, this proposal can be described as a small step in the right direction. Other then budget breakdown the information provided should be adequate to assess the proposal's success and progress.", "q2r": 5, "assessor": "z_assessor_2736", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5171, "q0": "The proposal is a continuation of the previous Milkomeda accelerator program, a 6-week acceleration program that consisted of various support, guiding, and funding for startups. This time Milkomeda is partnering with SOSV. The proposal is concise but provides enough information on critical parts. With the experience Milkomeda has had on previous accelerator programs and the dire market situation where funding is in high demand, the risk of the project is very low. The proposal provides the main risk of the project as a low number of good quality startups applying for the accelerator. However, they provide a mitigation plan by using an outbound strategy.", "q0r": 5, "q1": "The timeline and what is the activity for startups in the accelerator are very clear and informative. The budget breakdown is concise but is containing enough information. With 20K USD for 5 startups, and 20K for running the programs, totaling 120K. The proposal provides team members' names and their respective roles. However, it will be better if the proposal also gives concise information on background, experience, and a LinkedIn/Github account for each member. The external link can make the team more easily verified by the community.", "q1r": 5, "q2": "There is 4 point used to measure the project progress, the number of applications, acceptance of good projects, finishing the program in 6+ weeks, and demo day presentation. All of it is clear and quantifiable. The defined success is very clear and measurable. By selection of 5 startups and 3 startups finishing in the demo day with an MVP.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 4789, "q0": "The proposer claims that growing an ecosystem is hard even harder is doing it in a speedy manner and claims that some startups that are already in Ethereum need convincing and mentoring to join the ecosystem and grow fast. In this proposal proposer offers a solution, which is to create a program lasting 4-6 weeks in partnership with SOSV (one of the most active early stage investors in the US) that scout, attract, support, guide and fund startups with high potential of growth. In this proposal, key metrics are listed that satisfy the challenge settings and the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "There are three links in the proposal that take us to the Milkomeda pages, but I would like to see links from the teams so that the community knows which people will work on this project. Two teams of people who will work on this project are listed with their names, but unfortunately we do not have a clear insight into whether these are real people. The budget was presented and is $120,000, and the total budget of this challenge is $500,000. In my opinion, the requested budget is huge. Perhaps it would be better if the requested funds were divided into two funding rounds. One part in F9 and the other part in F10. It would be great if the proposer made a budget breakdown so that the community would have an insight into how and for what obtained funds will be invested in. I would like to see what the roles of the two teams mentioned in the proposal are and what their tasks are. The idea of the plan was presented, but the work plan itself needs to be worked out in more detail. The time frame for the realization of this idea together with the possible risk during realization is presented. ", "q1r": 2, "q2": "I would like to see a detailed roadmap with milestones, especially when it comes to larger requested amounts like the one in this proposal. It would be great if the KPIs were worked out in more detail and a public channel was presented through which the community could monitor the development and success of this project.", "q2r": 1, "assessor": "z_assessor_2616", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3618, "q0": "How Ethereum Startups Join the Cardano Ecosystem and Grow Fast.\nThe author says that the project is collaborating with one of the most active investors in the US (SOSV) that this project is proposing to support capital from Catalyst. That is, this project is calling for round 2 capital.\nThe project's target audience is quality Statups with the potential to expand to Cardano through the project:\n- Acceleration program within 4-6 weeks for startups such as funding, practice, promotions....\n- Advertisement\nAs mentioned in the topic section this project seeks to attract, support, guide and fund potential startups.\nThere will be many good projects but not enough development capital so this project is very necessary for them, it can be said that this is the virtual Shark Tank project.\nThe risk is that if the problem is correctly predicted, the project will be difficult to develop if enough potential startups are attracted.\nI agree with this project", "q0r": 5, "q1": "Project appraisal often takes time and manpower, I wonder how long you and your team can complete in 1 month, this shows that you are very professional.\nActive investor + blockchain developer = Milkomeda C1.\nThe timelines in the process are also very specific. If there is a more detailed table that would be great, we can follow the project step by step.\nThe goal is to help startups migrate to Cadano through the prediction that the first week is crucial in influencing investor decisions.\nAs a funding project to call for capital, the budget must be correspondingly large and appropriate. As well as a detailed budget sheet we need you to provide us with a more detailed budget allocation table.\nThe team of the project, whose composition is the largest investor in the United States, ceases to believe that this project is very feasible.", "q1r": 5, "q2": "Indicators to measure progress are given reasonably,\nwhat apps have been developed for the accelerator, how many good quality projects have been appraised by the scheme, the program is completed on schedule and finally a demo showcasing the startups.\nIf the proposal provides a more detailed allocation table, it will show the transparency of the project.\nIf 2/3 of the companies are successfully supported, it will create credibility and trust for other startups to grow on Cardana through Milkomeda C1.\nIf successful, you will bring many entrepreneurs to Cardano", "q2r": 3, "assessor": "z_assessor_2464", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2878, "q0": "The transition between Ethereum and Cardano is one of the most noticeable events in term of cross-chain integration. As the challenge stated about how significant projects on Ethereum could be benefit from Cardano by utilizing the platform and the problem statement in the proposal, it’s concludable that “Accelerator batch #3” could potentially be a substance that will increase the migration speed. From the Impact viewpoint, it can be inferred that the proposol articulately solve the problem of improve,diversify and expand the ecosystem of Cardano by their work description and also partnership with Milkomeda, SOSV. Even the team listed in the proposal is already collaborating cross chain from blockchain and business organizations. With the listed team in their success in Batch 1 in the medium page, there are already a range of projects that has been participated into the program including Djed (Cardano stable coin protocol). Speaking of linkage, the proposal has linked start up, accelerator features to Cardano but should also specify the targeted amount of Ethereum project they want to bridge and run on Cardano Blockchain to adapt correctly the challenge of “ The Great Migration from Etherum “ from Catalyst. As they stated in the risk manangement section, “..we were able to get over 60 applications to acceleration program. Unfortunately we ere only able to accept 5 startups.” , from this point the project impact could be decrease since the point of the challenge focus on the quantity of transited project into Cardano. In order to manage the program’s own risks, there should be a criteria or investment that would likely expand the capability of the program. Or one feasible suggestion would be the classification of start up based on their size, from that the team could design a specific budget to sponsor for the small size one to continue growing. The team can take the 10th topic in SDG goal “Reduced Inequalities” to boost the impact by explaining that between Blockchain system there are integration process that can be universalized (like this accelerator batch) for business, organization to join into a more sustainable platform. ", "q0r": 5, "q1": "The provided plan in the proposal as summary will approxiamtely be more than 3 months. The listed task for the project is clearly written per each stage of time however there are specific area where proposer needs to go in detail. For example. between the 3rd and 4th bullet point the assistance from the team need to be clarify to whom, while it’s understandable that in the first week the selected start-ups will be supported but after that the “Marketing support, OKR follwo up, technical support, podcast interviews, content creation, etc” will be done for whom and what purpose? As they also mention some of promotion through social media, what platform and community the project will be heading to? Besides, the funding breakdown is considered simple to split into half 20K for USDC per startup in fuding and another same amount for the program cost while the total requested 120000, therefore there is only one third of budget amount is used and there should be transparency of how the rest amount of the fund will be spent. ", "q1r": 3, "q2": "For the audit section we need to talk about the quality of the metrics that is being used in the proposal. The first numeric metrics on the number of applications is considered acceptable but when it comes to “Acceptance of good quality projects”, what type of acceptance criteria would there be used to qualify projects? And the last metrics on “demo day presentation and MVP by startups”, what specific number of MVP by startups will there be heading and what criteria is taken into account to measure the success of the presentation day? Speaking of the success for the project, the proposer should explain clearlier on the number 5 that they’d chosen. If that considerably small number was taken, there should be explanantion on the quality of chosen of the selection process (ex : criteria on the size, impact, budget and scalability of the project).  PA could also be question about the continuation of the project since there are numerical labels of “batch” like batch 1,2 and now is 3 in the proposal. The proposal have to also specify the difference between each batch to ensure that their goal is cleared. This happens since the project could repeativly be executed after receiving funds, with the same goals but what Catalyst want to sponsor for these pariticularly continous projects are their purpose after each fund. If there are positive, innovative and scalability proven for the batch, the project will be more capability of funding. Or instead of increasing the size of the programme, the project can extend the programme network by building communities, dApps or promoting strategy for their program. ", "q2r": 3, "assessor": "z_assessor_2356", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2698, "q0": "dcSpark, the creators of Milkomeda have a proposal for an accelerator program for startups that want to transition to Cardano from Ethereum.\nThis will be done in partnership with a company called SOSV that has a lot of experience in this field (over 1000+ investments and multiple acceleration programs).\nI think this is a great idea and a great fit for this challenge, of course. Transitioning from Ethereum to Cardano will be difficult for lots of developers, due to differences in code, infrastructure etc and having a dedicated company that has already proven itself on this blockchain to support you with the transition would be extremely valuable.\nThe main risk that the proposers identified is the fact that not enough good quality startups might apply to the program. The plan to mitigate this however is to have lots of applications and scrutinize them thoroughly, before ultimately accepting only a few.\nI fully agree that this proposal effectively addresses the The Great Migration (from Ethereum) challenge. Score: 5.", "q0r": 5, "q1": "The proposers have provided a detailed plan with every step that needs to be taken in order to accept a startup and then work with them to fulfill their goals and ultimately have a demo or presentation of their product / MVP. This entire process would take about 3 months. The requested amount is not trivial at 120000 USD, but this will be split between each startup as follows: 20k to support the startup and 20k to cover dcSpark and SOSV’s costs. I’m not very experienced with accelerator programs, but this seems like a feasible approach.\nRegarding the people that will be working on this, we are given a list of names from SOSV and from dcSpark. I was able to find them on LinkedIn (it would have been nice if links for this were added to the proposal to begin with) and the track record of dcSpark makes me think this proposal is highly likely to be implemented successfully. Score: 5.", "q1r": 5, "q2": "As measures of progress, the proposers suggest the number of applications to the acceleration program, how many of them will be accepted, how many finish the program and how many demos / MVP’s result. My only comment is that for these to be proper key progress indicators, we should have had some estimations of what to expect here so that we can later compare them to the actual results.\nSuccess for the project is defined as “at least 3 startups finishing the program successfully by presenting their demo / MVP”. This seems clear enough and I believe the information here is sufficient to audit the proposal. Score: 5.", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2681, "q0": "This proposal addresses the challenge by trying to attract high quality startups from Ethereum to Cardano. The main goal of this challenge is to facilitate the migration of Ethereum dapp to the Cardano ecosystem. The team has partnered with an early stage startup investor organization, to launch an accelerator program for Ethereum startups. This is because building in a new ecosystem can be hard and overwhelming and startups may need mentorship and guidance to be able to properly build on Cardano. That’s why an accelerator program makes sense and should be very useful and add value to the Cardano ecosystem. The chosen startups will also receive great benefits ranging from funding to support from top Cardano developers. In fact each startup will get 20k usdc and 6+ weeks of technical support from the Dcspark team. I think that this is great but, it will only make sense if the projects that get chosen are high quality with awesome potential of growth. There are also other benefits for the startups that will join the accelerator program. They will be promoted through Milkomeda communication channels which is a great marketing opportunity. There is also the possibility to livestream the demo of their products. Altogether, the proposal should have a good impact on the Cardano ecosystem.", "q0r": 5, "q1": "I think that the proposal has high odds of a successful implementation. The team behind the proposal is already well known in the Cardano community. They have created numerous tools and have also created the Milkomeda chain. That is to say that the team has enough experience to deliver to work. The roadmap provided sounds good as it’s well formulated and contains enough details. The plan to take one month to vet the startups and make the appropriate choices. Then the program would start 2 to 3 weeks after the startup selection. There is a partnership with an organization that invests in early stage startups. Now I don’t know what role they have on the program as it seems that the startups are funded from the budget. I suggest to the proposers to add details to the partnership and explain in detail how they will benefit the project. Other than that, the proposers have identified the number of team members that will be working on this project. The team has asked for 120000 usd which is broken down like this: each project will get 20000 usdc and 20k for 3 months of work. I think that it’s pretty fair as people working on the project have to get compensated. The startups need seed funds to run their operations also. So the budget sounds reasonable and If additional funding is needed, they plan to return to catalyst to get the funds needed. I’m an advocate of finding ways to self-sustain a business rather than relying on Catalyst everytime. The problem is that, since funding depends on the community vote, there is never a guarantee to get fundings. If all your business relies on that, the risk of losing it is pretty high. Other than that, I believe in the feasibility of this proposal.", "q1r": 5, "q2": "I think that the proposal is auditable because they have included a roadmap with milestones. They also have included the metrics that should help track the success of the proposal. The roadmap is divided into phases which will start with a proposer vetting of the startups. After the selection of the startups, the program will start with team introduction and various plannings. Then there will be mentoring sessions for the startup teams and other benefits such as marketing boost among other things. Lastly there will be a demo presentation which is great for the startup because they will have the opportunity to showcase their product and attract potential users and investors. The team has also added metrics that they will use to measure the success of this proposal. The first metric is the number of applications to the accelerator program. This number should indicate clearly the demand level of the program. The community should be able to estimate the future of this concept based on the number of startups trying to join the program. There is also the number of good quality projects that join that program. If high quality projects are not willing to join the program, we can consider the project not successful. We will also track the demo of mvps presented by the startups. Altogether, I think that the proposal includes enough information that should help the community track its progress.", "q2r": 5, "assessor": "z_assessor_2332", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2630, "q0": "Addressing the need to support startups on Cardano to accelerate deployment and rapid construction through Milkomeda (A bridge network between Cardano and Ethereum). When projects are supported through the Milkomeda bridge, it will be very convenient to speed up the implementation as well as be supported by experienced people including both financial and human. In the future, this is really necessary because the previous projects built on ETH are very large and the migration to Cardano is inevitable because of the technical factors of Cardano and Ethereum. This proposal is in line with the Challenge given by supporting the transition from Ethereum over. The plan is well thought out, predictable, and ready to go, but needs more clarity and detail on the content for better practical implementation and future development platform", "q0r": 3, "q1": "- Need more documents about project content or related information such as project, related people, mikomeda,... Need more specific related links for further analysis, for example such as the current situation between Ethereum and Cardano, the future transition, the parameters of the Applications developing current indicators for project participants to understand and the information to be clearer and more specific.\n- The proposal mentions the information of the project participants but only the name and title working at SOSV and Mikomeda, no additional information including\n - Past field experience\n - Experience participating in blockchain\n - Experience related to the project will do\n - Profile: LinkedIn, Twitter, Youtube.\n - Budget allocation is listed but quite simple, not really clear and detailed, needs more details For example, by month, by phase, individual and organizational resources, by the hour or by month, number of actual participants,... Need to be more specific about the work each person will undertake and perform than just the title for each position, Also have it time by month but not yet specific, need more clearly divided by phase, for example, 3,6,9,12 months and have the items to do during that period. Have not specified the necessary technical factors, or combined them with mikomeda to perform? Is it possible to raise the risk here that there are no good quality companies to register, so need more filters or marketing channels and more quality outreach channels, low-quality startups in the crypto/blockchain field must be a new story", "q1r": 2, "q2": "There is no clear roadmap for implementation, this is different from the project completion timetable, the proposed roadmap has specific timelines for what the project will achieve, here it could be 3,6,12 months, the milestones that the proponent thinks will achieve specific results, the time to achieve the results should be listed in detail at least by month and each item to be completed, The exporter has not established specific KPI measurement indicators, only talking about the parameters to be monitored in general, this helps both implementers and interested people to monitor the project, making the project easy to implement and transparent. More transparent, there is no public channel for people to track how the project is progressing and what results have been achieved.", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2615, "q0": "To grow the Cardano ecosystem quickly and attract developers who have understood and built projects from scratch on Cardano, we also need to convince and support an exodus of Ethereum projects to Cardano. This is one way to have the fastest-growing ecosystem. This proposal aims to build a chapter from search to comprehensive support for Ethereum startups moving projects to Cardano's Milkomeda C1 sidechain. Once this proposal has started, the Cardano user community has more options for using the service. I rate this proposal as excellently meeting and solving these challenging installation requirements. However, it can still be further enhanced if the proponent can build a portal or community to support other developers from Ethereum. They want to migrate to Cardano without receiving direct support from this program.", "q0r": 5, "q1": "This proposal is a partnership program between dcSpark and SOSV: dcPark is the unit that builds and operates the Milkomeda sidechain delivering EVN on Cardano along with many other ancillary projects such as Flint wallet, cardano-serializaion-lib; SOSV is an experienced investor looking for and investing in potential projects that are in the early stages and also they are an initial investor in Milkomeda. To have this cooperation, they also carefully divide the development tasks, in charge of each item for each party reasonably and in accordance with each person's expertise. The project implementation roadmap has a short time of 4-6 weeks, and I evaluate their ability to work focused and dedicated. With its proven ability and vision through many completed projects, this will also be an excellent project that, in a short time, will have a strong impact on the expansion of the Cardano ecosystem. However, the time for this proposal is short, and we will likely miss some other potential startups. I suggest the proponent should expand and keep this program further.", "q1r": 5, "q2": "This proposal is a program for technical support and funding for potential startups, so this project management team also has perfectly reasonable goals and KPIs that give the community and me thorough evaluation and testing. This is the proposal I would most like to provide them with funding.", "q2r": 5, "assessor": "z_assessor_2324", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2567, "q0": "The proposal addresses a real and well defined problem where startups face challenges to migrate from Ethereum to Cardano ecosystem. Besides the funding required, the proposal highlights the importance of accelerating all activities needed for the migration. Although the suggested acceleration program can attract more projects to the Cardano ecosystem I think it meets partially the goals of this challenge. According to the shared publications in Twitter and Medium.com Milkomeda has already sorted 5 startups in a previous batch and they will utilize the Milkomeda C1 sidechain that connects to the Cardano main chain. However, it is not clear how the selected startups will become part of the Cardano ecosystem. It looks that no implementation will take place to fully deploy projects from Ethereum to Cardano. Also it is not clear the role of SOSV and why partnership is needed with an external VC, as funding has been already requested in FUND9. \nThe above doubts lead me to the conclusion that the KPIs of the challenge are not fully aligned with the proposal.", "q0r": 3, "q1": "The team to be involved in the project consists of people from SOSV and Milkomeda. Although the names and the job roles are mentioned there is no further information about the experience of each person. Although such details may be found in LinkedIn or on the companies' websites it would be more convenient for the reader to see those in the proposal. It would be also nice if the roles within the project were defined for each listed person and add any references for past experience in regards to previous Catalyst FUNDS.\nThe proposal does not provide a detailed budget breakdown and it should explain at least why each startup will require 20k USDC funding. Based on what criteria is this funding derived from? What is the business case for each startup that will support the requested funding? I think these questions should have been answered by the proposal. Additionally,  the work activities that require 20k USDC are not defined at all.\nThe time plan provided is very basic without further insight on how the work will be executed and by whom. I would recommend that the proposal should break the work into more detailed tasks and assign them to project team members so the reader can better understand the involvement of SOSV and Milkomeda.", "q1r": 2, "q2": "Although the proposal provides some metrics to track the progress of the project it lacks some further clarification on specific KPIs. For example, how is good quality justified? How does the number of applications relate to the progress? Also, \"Acceptance\" is an action, not a KPI. The MVP acronym is also not explained to understand how the KPI gets affected by it, or maybe not? Even further, it would be nice to state the means to view and track the KPIs by the Catalyst community.\nMeasuring the success of this project is quite clear and accurately defined.", "q2r": 2, "assessor": "z_assessor_2322", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13610, "q0": "The total value of assets locked on Milkomeda has dropped from approximately 100 million to about 26 million. Mikomeda needs more teams to develop more useful decentralized applications for users.\nTherefore, Mikimeda is focusing on supporting startups to help them raise money to develop ideas and create valuable products for users on Cardano.\nThis proposal may help address the challenge's claim:\n\"Projects have planned or launched on an EVM-based blockchain implementation in the Cardano ecosystem and can do that easily.\"\nThe proposal will help teams or startups that are intending to develop products on ETH that will think about developing on Cardano's Mikomeda sidechain. With the benefits of consulting support from Milkomeda and sosv venture capital fund, at the same time, there is money to cover the initial costs but also support advertising to attract users to use the product. At the same time, support the next round of funding, for future product development.\nThis proposal very effectively addresses the requirement of the Challenge and I love it.", "q0r": 5, "q1": "The ability and experience of the members of the Milkomeda team is undisputed. They are talented members and have a lot of experience and skills in developing applications on Cardano. Help Cardano in scaling and convert projects on ETH to Cardano easily.\nThey are the strongest team on Cardano that I know of.\nNext, in the content of the proposal I did not see any quests that were too difficult given the current capabilities of the Milkomeda team. Even in the risk section, they have fully assessed the risks they may face and the solution. I think that is enough.\nI find this proposal very well presented with the implementation plan and the capacity of the members is sufficient for the successful implementation of this proposal.", "q1r": 5, "q2": "Cardano and Milkomeda need to have more accelerators like this one to make it easier for more teams and startups to join the ecosystem. Help them easily have the cost to maintain and advise on how to create a good product for users. At the same time, support advertising to attract users, help the product generate revenue and profit so that the business model becomes sustainable.\nHelping these startups create products and good cash flow will greatly accelerate the growth of the Cardano ecosystem.\nI believe this is an extremely useful proposition that voters should not ignore to help Milkomeda fund this accelerator program.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14476, "q0": "This is the second proposal of the dcSpark team in the Great Migration and this is very much well-aligned with the challenge setting. The problem is really well-defined with the deep understanding of the current team/start-ups in Ethereum ecosystems. The solution is the 4-6 week accelerator program with the commitment from the team not only during but also post of the accelerator. What would be greater is the scope of the Migration should be expanded moreover the US. The team  anticipates the main risks of this proposal is the insufficiency of the quality startups applicant. I highly appreciate the team humbleness and leverage the SOSV team for the community expansion and attractions, especially this related  a new kingdom of the Ethereum ecosystems.", "q0r": 5, "q1": "The budget is very high of the total challenge setting, accounting for 24% of the total challenge setting. Moreover, the budget was listed down just 40k USDC while the total required budget is 120k. What could be greater is the explanation of how much the remained 80k USD should be spent, the PA assumed that this should be for the core team and all the related cost to organize and marketing this Acceleration program. The milestones are broken down especially for the 4-6 week mentoring agenda, and the first inbound and outbound start up selections, and the final week demo day. It is a suggestion for the post-acceleration result updates and followup needed for the acceleration to make it not a once time 3 months and then just ending the whole project. What is positive is that the team already did the previous 2 Batch and learnt the lesson ahead of this Batch 3 within the Mikomeda core team. The team is what make this proposal really special with the top experience Devs and the mentors/advisors in dcSpark. The team would also know the strength and weakness by involving the SOSV team in terms of promoting and selecting the best potential startups. ", "q1r": 3, "q2": "The OKR/KPI indicators are very simple and easily to be tracked. What should be improved is the number of inputs (the number of applying teams from the whole applying funnels: knowing about the programs/Applying/Selecting/Mentoring/Delivering the MVP.) What could even be more impactful is the end product delivery after MVP stages. There should be a source of tracking so that the Cardano Community can follow and track the project. There should also be mentioned what is the tentative start day and end date so that the community know the milestones instead of just the total duration and a draft budget also it is not sufficient to be audited at the end of the proposal (if funded)", "q2r": 4, "assessor": "z_assessor_4056", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "A 4-6 week acceleration program in partnership with SOSV (one of the most active early stage investors in the US) that scout, attract, support, guide and fund startups with high potential of growth.", "experience": "There are two teams involved:\n\nSOSV (sosv.com) one of the most active early stage investors in the US. Over 1000+ investments and multiple acceleration programs including one for blockchain.\n(us) we are one of the core-developers behind Milkomeda, Flint, cardano-serializaion-lib\n"}