{"id": 421543, "author": "gondlr", "title": "1st Traceable RewardCurrency FLORAS", "url": "https://cardano.ideascale.com/a/dtd/421543-48088", "category": 26593, "amount": 68000, "description": "We are building a reward currency (FLORAS) to be spent only on Sustainable Projects. We need a smart contract to trace issuing & spending. Solidity is our solution but is too expensive per transaction", "f6_no_assessments": 7, "f6_rating": 4.523809523809524, "videos": [], "media": [], "f6_assessments": [{"id": 510, "q0": "This is a well written proposal that answers the call of the challenge well--it The team was previously pursuing building their smart contract in solidity and if funded will instead be writing their contract in Haskell and deploying it to the Cardano blockchain. I am not as confident that they've done adequate research and scope of what it will take to build this on Cardano. I am mentioning this because a key metric of the challenge is \"Number of projects that migrate\" and without a full scope of what it takes to \"migrate\" risks its ability to meet the challenge desired impact. I know this because I myself am a developer in the cardano ecosystem, acutely aware of the talent pool and robustness of developer tooling. \n\nA five star proposal would sit longer with the question that asks about risks. Would have also love to see honorable mentions of the project future sustainability and scalability.", "q0r": 4, "q1": "The proposal has detailed monthly deliverables and milestone. They are using a software development framework that makes it spot upcoming roadblocks and challenges  sooner. This increases the project odds of delivery. \n\nThe budget breakdown does well itemizing many of the web 2 components of this proposal. The 15k for 1 full stack developer full time to do blockchain integration and tokenization seems unreasonable low to complete this work. I am an unusual 'full stack' dev with loads of experience DevOps and system architecture. Devops work, secure server and key management and processes alone would easily consume that 15k budget (for European markets). \n\nWhat about smart contract integration work? Smart Contract validation script development? Is the team expecting additional funding from elsewhere? Token sale? ", "q1r": 4, "q2": "Dashboard, Sprint Plan, Backlog list, and Grooming are all jargon to say that there will be a place to see exactly what working is coming down the road, what is being worked on now, what is queue up, and what work is defined that may or may not be worked on. Would have love to see the proposal spell out to the voter if this magical place will be publicly accessible. \n\nWill there be public monday, trello, or asana boards? The proposal does layout 3 explicit deliverables the Cardano community can watch for to see and audit completion. \n\n", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3625, "q0": "The proposal recognizes Cardano's low-cost advantage.\nThe Haskell and Plutus solutions on Cardano will be more cost-effective than choosing Solidity.\nIf the project is successfully developed, known to the community, there will be many smart contracts that will continue to be selected to develop on the Cardano ecosystem.\nThe goal of the proposal is to build a common currency for sustainable projects.\nThe awarding method of the proposal is very meaningful for protecting the environment, protecting the atmosphere and saving the earth. Rewards customers receive they will support the proposed projects for funding and those rewards are converted into budgets and disbursed for those projects.\nI agree that the suggestion that will help is to increase the value of the Cardano network as transactions increase if the currency can be driven by ADA.\nI support this proposal", "q0r": 5, "q1": "A detailed budget table with a detailed plan with a specific timeline.\nFrom the detailed plan sheet, I can see that your team will complete each work goal set out.\nThe proposal provides a 5-month plan to complete the project and put it into testing, of which the first 2 months will be spent on planning and implementing the work. The integration will take place in the 4th month of the Cardano Blockchain integration into the Wallet, which is also the test month for the integration of the carbon credit exchange.\nI am very excited if my purchase discount is used for environmental projects so if selected as a tester I will participate.\nIt is recommended to have an excellent member with extensive experience in all stages of the project. I think the team will do a good job at all stages.\nWe await the monthly report submitted to Catalyst of the proposal.\nI think this project is possible and I support you", "q1r": 5, "q2": "Work details are clearly stated for easy inspection by the community.\nIt is suggested to create a dashboard that reflects all project progress by date, specific jobs completed: wallets, exchange modules, Earn, Spend, Payments, movements and notifications to be captured fast and record. This recognition makes it easy for the online community to check and evaluate the transparency of the project.\nThrough the detailed work table, I can see the seriousness and preciousness of the team. You will complete the work accomplishing the goal\nA Web is complete with full features, the main feature of which is issue tracking and currency conversion such as a Cardano native token. This is the success point of the project. Great", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5551, "q0": "The problem of this proposal fits into the challenge since it’s concerned with building some smart contracts. Solidity has and is been used to build smart contracts on Ethereum and even other blockchains such as Monax: having the proposer to build a smart contract that’s a rewarding currency called FLORAS on cardano is a big win for the ecosystem because in that sense, a new project with some satisfaction and service have been provided to the cardano isers. The key metrics are in alignment with that of the challenge settings and so do too the goals.\nRegarding the sustainability of the proposal, the proposer has indicated that they are not closing the window on requesting more funds in the future, hence I believe that the proposal is sustainable.\nThe proposal here is impactful.", "q0r": 4, "q1": "Information provided about the team and their relecan’t experience and considering the relevant links and references, I am confident that the team is well equipped to implement the project. Considering the details and information given about each team member, means that the proposer actually knows the people to be working with.\nThe budget provided is well presented with understandable items. The project is a heavy one, hence I believe that the $68,000 is reasonable for the execution of the project. The plan presented is very detailed and the timeline provided is very clear as the project is expected to last for 5 months. I must appreciate the effort of the proposer for clarification of some terms used. \nIt’s also good to have foreseen the possible risks/challenges that may arise during the implementation of the project.\nThis project I must say is feasible.", "q1r": 4, "q2": "The roadmap has clearly outlined milestones and time horizon. The milestones for each of the five (5) months are clear and the roadmap tells how those milestones would be achieved. \nThe metrics/KPIs were wisely picked and I Sam confident that they are good measures for evaluating the desired outcome of the project as the chosen outputs indicate the users that would adopt Cardano to collect Floras amongst others. The problem described here is clear and I believe that the proposed solution is viable in addressing the problem. The proposer has indicated some ways the progress of the project would be shared, however I also recommend the cardano/catalyst channels on Telegram.\nI will conclude by saying that the project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 6936, "q0": "This is a team coming from Ethereum into Cardano because of quoted lower gas fees. However, the project itself doesn't add to the migration of ETH projects to the Cardano ecosystem outside of migrating themselves. The impact of the proposal itself is quite large due to converting loyalty points into sustainable products and services purchases. This could potentially onboard a lot of users but not necessarily from Ethereum but the general public to Cardano some of which can be ETH users. However they will be using the Floras token instead of ADA. I am assuming Floras is native Cardano token since this token is posted in this challenge. Something that could be improved is open sourcing this so that other ETH projects that want to do the same can do the same quicker and provide a platform of sustainable loyalty token as a service instead of just Floras reward currency.", "q0r": 4, "q1": "The team is strong and seems like it has the chops to pull this off, however, building tokenomics and smart contracts requires Haskell/Plutus knowledge that the team is missing at the moment. The plan doesn't mention that they are going to hire a Plutus developer but others. Additionally, the CTO who is paid, and by the looks of it from their LinkedIn profile they are only a fractional CTO. The team was indeed part of the Skydeck with Aeros in Spring 2020 but that was 2 years ago and the website http://aerosnetwork.com/ doesn't lead anywhere, unfortunately. This is a mixed bag because the team is strong but leaves something to be desired. With all this, nothing is wrong but it's not strongly agreed upon from the feasibility side. I do like their breakdown of month-to-month achievements and tasks.", "q1r": 5, "q2": "The auditability of this project is quite clear. The proposer breaks down the budget for the team and development sufficiently. The milestones would have been desired to be broken down further for example what is the sprint and what is the desired outcome of each spring or what is being worked on is desired even high level but more in depth than the proposal provides. I am by no means asking for a detailed plan but more detail would improve the strength of the proposal.  The selection and partnership process of which sustainable products would also be desired to know more about. Good luck!", "q2r": 4, "assessor": "z_assessor_2855", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7429, "q0": "A separate type of bonus only for sustainable projects that add value to each other. Really an interesting concept. The project intended to build smart contracts using ETH's Solidity programming language, however the flexibility and lower costs of developing the project on Haskell and Plutus convinced the developer to migrate the project. The Proposal is really suitable for the Challenge.\nI was really intrigued by the definition of a “Carbon credit,” a permit that certifies that 1 ton of carbon dioxide has been removed from the atmosphere, helping to quantify efforts to clean up the atmosphere. Users have just bought products, accumulated Floras money, then donated to the project of afforestation, helping to improve the environment. A humanistic circle. The circle is a collection of small, highly automated transactions that require traceability to trace. From there, we can see that the Cardano ecosystem can completely provide a full range of tools for developers to build dApps, the cost is very cheap, many jobs can be processed in 1 transaction.\nRisks have been planned and mitigation plans are provided, proving that the project team has extensive and in-depth expertise from many sides. The development of Floras will have a far-reaching impact on the Cardano ecosystem, which is a new development. With what the proposal presents, I really have nothing to say. 5 points absolutely\n", "q0r": 5, "q1": "The proposal lists detailed, 5-month work items with milestones to be completed, all with explanations for the reviewer's understanding. The budget table lists specific expenses, the total required funding is $68,000 ~ 13.6% of the total challenge fund, with a team of 8 members. They all have impressive experiences when I check social media links, they have distinct expertise, covering many aspects. In my opinion, the total cost is very appropriate. I would like to give 5 points in this section", "q1r": 5, "q2": "The project outlines four main indicators, which contain very detailed and easily quantifiable sub-indices. The project please provide a specific path where the project updates progress and reports results, so that the community can easily follow, monitor and interact. The success of the project is to create a humanistic circle, from which to develop widely, helping to raise environmental awareness. When successful, the project will be a huge hit in the Cardano community. I look forward to that very much. 5 points for this part", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10910, "q0": "Floras will be a loyalty currency issued by a group of European companies to support sustainable projects. The currency will be based on the Cardano blockchain and will be used to offset the carbon footprint of the companies that issue it. This project was going to be developed on Ethereum but it is not possible due to high transaction fees. Cardano is an ideal network for this project due to its transparency, low energy consumption and low transaction rates.\n\nThis project fits perfectly with the campaign guidelines: \"Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily.\"", "q0r": 5, "q1": "The team behind the proposal is highly competent, there are members with connections to universities and big companies. All members have a linking profile where their work and experience can be verified.\n\nThis budget is broken down into the expected salary per worker, it is detailed by months of work and monthly salary. No mention is made of the possibility of delays in the development of the project and how this could drain funds from the budget.\n\nPart of the project has already been developed which shows the capabilities of the team. On the other hand, they present a phased implementation plan of the proposal. Some of the implementations consist of adding features to existing applications which increases the chances of success.", "q1r": 4, "q2": "As a measure to track the progress of the project they propose the use of dashboards, sprints and a backlog list. These measures are typical in the software development industry.\n\nThe success of the project is to publish an MVP of the product where users can earn and spend their token. I am missing some metrics related to the usage and engagement of users. ", "q2r": 4, "assessor": "z_assessor_3205", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13799, "q0": "\nThe author of the proposal recognizes the problem here: building bonuses (FLORAS), only for Sustainable Projects. A smart contract is required to track issuance and spending. Solidity: solution but too expensive per transaction. Therefore, the author came up with the idea that: Building smart contracts on Cardano, for currency tracking, is less expensive and more flexible than Solidity. The proposal, impact on the challenge posed, and description is rich and detailed. The group was approached by a group of European companies, who wanted to join the Union's reward scheme, to support sustainability projects. Treat currencies, Rewards, like any other currency, they have supply, demand and value. Like Airmiles, the solution consists of two main actions: Earn and Redeem. With traceability, we can connect both ends. Cardano Blockchain will also provide a lot of transparency; Through Cardano to collect Floras. New revenue will be generated from ADA transaction fees. Besides, the author has recognized the possible risks. At the same time, the team also uses its capacity and experience to reduce the risks that may occur when the project is implemented.", "q0r": 5, "q1": "\nThe proposal provides us with the necessary information about the project plan, to evaluate this section. The first is about the route. The team said that the team worked on Sprint technology. It is estimated that it will take at least 20 development sprints, or a total of 5 months, to launch a custom fully operational MVP. Each run is reflected in a live document with the Dashboard. The team presented the work for 5 months and explained in detail the work to be done in the project. A detailed roadmap, we know what will be done over the course of the project. Next is the budget. The proposal requires a budget of $68,000, which is more than 10% of the total challenge budget. In my opinion, the requested budget is reasonable given the complexity and timeline of the project. At the same time, a detailed budget sheet is also presented in a transparent manner. We know how the funding is used, for what purposes. Finally, the team of team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides texts presentation about each member, and attaches links to let us know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is transparent and the members are skilled and experienced, increasing the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "\nAs the author showed, all sprints are reflected in one live document: Dashboard (reflecting all project progress by day); Sprint plan (divided into 5 sprints); Backlog List (with its own ID with corresponding extension, Minimum requirements, sprint status and allocation, Release date); Release date. We have multiple metrics, to measure project progress, goals to be achieved, and benefits to the community and ecosystem. About the final product, is the success of the project. Proposal well planned. Transparent budgets are easily audited. The roadmap is detailed and the members have enough skills and experience to complete the project on schedule.", "q2r": 5, "assessor": "z_assessor_3820", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "After researching more about Haskell and Plutus, we find that we could build our smart contract on Cardano in order to trace our currency in a less expensive and more flexible way compared to Solidity", "experience": "We have been building reward programs and currencies for the last 15 years. Part of the UC Berkeley accelerator.Team: Ph.D., 1 economist & 3 engineers. We developed a white-label mobile wallet complemented by a web marketplace for products, all connected through a unique currency"}