{"id": 422411, "author": "williamofthesun", "title": "International Cyber Genesis", "url": "https://cardano.ideascale.com/a/dtd/422411-48088", "category": 26593, "amount": 25000, "description": "Cyber real-estate across channels will need to be a real conversation at some point when migrating from ETH to Ada. James Carleton, Unix Guru, spent the last three years building a solution. ", "f6_no_assessments": 10, "f6_rating": 2.6333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 208, "q0": "Yes. It addresses the Big Migration directly, focusing on digital real estate tradable with crypto and available to both chains, Ethereum and Cardnano. \nThe idea is bold, but a new piece in the ecosystem and certainly a different way in which the Migration can occur. \nI think having ideas like this one tends bridges that could result in new ways in which to deal with cryptocurrencies and interoperability.", "q0r": 5, "q1": "Yes. The Developer is a highly experienced CS and has done all the legwork.\nThe project is fully functional and just requires the funding to turn it on. The budget is clearly explained and is well balanced. \nWe never know where the next piece of technology is taking us until we try it out in the open, and the way I see it, this one is hard to pass. It has all the components in place, practically at cost, and addresses interoperability between Ethereum and Cardano in an unexpected way.\nI see no danger in funding this idea, and another piece of infrastructure built on Cardano.", "q1r": 5, "q2": "There are no KPI´s in this project because the work is done, the funding requested is just for hardware and its maintenance. Other than that, the proposer offers help with code and data to assist the migration. \nThere is a github repo and a web documenting his work. I do not think there is a need for further clarification on the milestones and goals.", "q2r": 5, "assessor": "z_assessor_2060", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}, {"id": 1318, "q0": "The proposal is describing a currently running service called International Cyber Genesis, while connecting the buyers and sellers of Cyber real-estate. By cyber real estate, according to the video, we can imagine domains (websites) and domain names. Then the proposer claims that he created a cyber nations – which is a space where the domains can be accommodated, and allows only subnets owners to make transaction within that space. The specific goal of these transaction is then crypto commerce (crypto marketing). Then owners of domains accommodated within “Cyber Nations” can post ads about stuff they want to buy or sell. Actually, this is the most tangible information – you can post your ad, you can get in contact, you can buy and you can sell….using crypto. To somehow wrap my head around that, it appears that it will serve as a free-accessible marketplace where people can advertise anything they want, and then these items can be bought/sold using cryptocurrencies. Other than that, many is remaining unclear, such as – what does it has to do with migration? How is it related to Cardano? Except you can use for paying. Also, there was no connect-wallet button on the website, so how this will work. Will the Cyber nation also be able to perform transactions, or it will just serve for reaching out and advertisement? The thing I am missing the most, is a practical example, but as for now, I failed to see the connection to Cardano, migration, and why is this even needed. I have tried to play with the website for a while, and then it was something with parcels…which was evoking METAVERSE, and then there were pictures of spaces for rent - offices, …maybe the idea is that if you will want to post advertisement to that specific website, you will have to rent a place there, and then you can post advertisements. But it was not elaborated in detail. Even if it was that case, there is still no connection to migration, and no supporting information why it would gain any traction.", "q0r": 1, "q1": "As the final outcome is already running, I guess it is feasible. The budget requested is solely for HW upgrades and seems reasonably set. Regarding the team, there is only one person who developed International Cyber Genesis. From my perspective, I am unsure whether such designed website will sill find its audience at these days. But purely from the perspective of feasibility – can the proposer deliver what he is promising? Since it is already developed, then yes. ", "q1r": 5, "q2": "The problem solution remain unclear. I could not find the problem statement nor a response to what is this proposal solving. Regarding KPIs, these are not mentioned either. The proposer states, that the success of the proposal will be a successful use of the service to assist with ETH migration. Unfortunately, there is no definition of “successful use” and how it will assist with ETH migration. Public channels are also missing, there is a much more information required to assess with a better grade. ", "q2r": 1, "assessor": "z_assessor_2222", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2571, "q0": "After putting some effort to understand the problem statement and the proposed solution I cannot find any clues how this proposal fits in to the current challenge. The current implementation of the International Cyber Genesis website does not have any reference to an Ethereum wallet so it questionable what is the EVM to be migrated to Cardano. Most probably this proposal would better fit in to the \"Dapps, Products and Integrations\" challenge.\nThe proposed solution refers to an existing deployment of Cyber Nations where users can trade these properties by using cryptocurrencies but Ethereum or Cardano is not mentioned at any point.  It is not also clear how the proposal will assist the migration from Ethereum to Cardano as it is described in the section Addressing the Challenge.\nThere are not any real risks identified in the proposal although there are plenty like low adoption by users, technical challenges, performance issues etc.", "q0r": 2, "q1": "The project will be executed by a single person, a Unix-Guru worked for many years in Bell Labs and other companies as stated in the proposal. According to his video presentation, his software development background is mainly Unix shell scripting, HTML and CGI. I do not think that these programming skills are enough to support the project. Knowledge in Solidity, Haskell or Plutus would be much more applicable for developing or migrating any solution in Cardano. Besides this, I would expect more resources in the project team with various roles, like a project manager, an IT architect, a blockchain expert etc.\nThe project plan is quite surprising as it shows the hardware infrastructure layout with some associated costs to it. There is no implementation plan, no working tasks, no milestones, no roles, nothing relevant mentioned anywhere.\nThe budget also covers only some fixed and operational costs for the hardware and yet another surprise is the point of an ICO token generation. The proposal confirms that it will request further funding in the future to maintain the servers, nothing is stated about EVM migration and Cardano.\nAs a summary, the big question is how the hardware infrastructure is related to the proposed solution and further on to the specific challenge?", "q1r": 1, "q2": "The proposal does not provide any roadmap, milestones and criteria to measure its progress, so there is no way to track it by the community. Furthermore, no KPIs have been specified to determine whether the project will be successful or not. The only statement is about is the \"Successful use of the service\" but this leaves a lot of gaps on how this success is defined.", "q2r": 1, "assessor": "z_assessor_2322", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4807, "q0": "Proposer claims that Cyber Real Estate across the channel will have to be a real conversation at some point when transitioning from ETH to Ada and offers a solution. He claims that James Carleton has launched test servers and now needs financial support to scale the hardware to support Ethereum migration in a high-traffic commercial environment. The question is why should Ethereum Migration happen? I would like to have an idea and a plan worked out, key metrics and a goal that aligns with this challenge. It would be great if the proposer elaborated on how this proposal will add value to the Cardano ecosystem and if KPIs that align with this challenge were presented and worked out.", "q0r": 2, "q1": "In the video via Youtube link, the proposer presented himself transparently and the community has an insight that the proposer could have the necessary knowledge and skills to implement this idea. The budget was presented, but the budget breakdown itself, in my opinion, needs to be worked out better. It would be great if the proposer would present a work plan, what will be done and how, how many working hours are needed for the realization of this project? I would also like to see realistic time frames within this idea will be realized. I would like to see if there are any challenges or risks in this project and how the proposer would solve the possible challenges/risks.", "q1r": 2, "q2": "\nThis is a great idea, but it is necessary to better prepare a proposal for obtaining funds. It would be great if they had a clearly defined beginning and end of this project. It is necessary to have a developed roadmap with milestones together with KPIs that meet the challenge settings. My suggestion to the proposer is to join the Cardano community and connect with the community in order to get more information on the Catayst project, Catalyst school and proposal preparation itself. \n", "q2r": 2, "assessor": "z_assessor_2616", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6766, "q0": "The problem outlined in this proposal is that the Great Migration will cause an increase in traffic and that better hardware will be needed for this particular project when that happens.  Nowhere in this proposal does it describe how it plans to help make the Great Migration happen, which is the goal of the challenge that this proposal was submitted under. There are also no KPI’s provided that are relevant to the challenge.  I believe this proposal would better fit in the challenge called “Dapps, Products, and Integrations.”", "q0r": 1, "q1": "There is some evidence provided that the person behind this project is an experienced coder with over 40 years of experience in coding, but I don’t see any evidence that they have experience working with the Cardano blockchain.  It also is concerning that this is a one person team considering the ambitiousness of the project, however the proposal does state that all the code is written and ready to roll out on the new hardware, when that hardware is obtained.\n\nThe proposal includes an image of what specific upgrades would be made to their hardware as well as the costs associated with the upgrades, but I see no timeline or roadmap provided.  The breakdown of the budget contains some items that I think are a bit vague, like “Incorporating” which is allocated $600.\n\nDue to the fact that the only goal of this proposal is to make upgrades to their current hardware, I believe it is likely that the proposal will be implemented successfully.", "q1r": 4, "q2": "No progress indicators are provided in this proposal.  Given that there is no roadmap provided, I assume the only milestone to look out for is when the hardware of their systems have been fully upgraded.  Unfortunately the proposal doesn’t explain where the community can expect to receive updates for this project.  For these reasons, I do not believe the proposal provides enough information to track the progress in achieving its goals.", "q2r": 1, "assessor": "z_assessor_2826", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 9902, "q0": "International Cyber Genesis has software that is ready to test.  Their Problem Statement does not seem to define what is being discussed in the video.  They are using the term “Cyber real-estate” which is confusing with “real-estate in the real world” and “real-estate in the meta verse”.  It sounds like Cyber Nations will be, or also be, a marketing site that allows the exchange of cryptocurrency.  This proposal does meet the challenge in there is some talk about migration.  The proposal is requesting funds for setting up the servers but does not address the sustainability in regards to keep everything running.  I wish there was better clarification on exactly what the code will do.", "q0r": 3, "q1": "This project seems to be complete, so it scores high in regards to feasibility.  They is ample evidence provided to show the skills of the developer.  The budget is broken down and reasonable.  This project is really asking for funds to setup the production servers so the bulk of the work is done.  Feasibility, at this point in the process, isn’t even really a concern since it is done, just not deployed.", "q1r": 5, "q2": "This project seems to be at the point where it needs to be deployed so the success will be based upon user acceptance.  The weak points are the lack of clear understanding on what exactly the solution will provide and how it will benefit the community.  There were no real metrics provided that will show a proof of success.  The code is ready to go but just not sure exactly what it will do.  Better detail on the functionality would help.", "q2r": 3, "assessor": "z_assessor_3130", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10917, "q0": "The proposal has hardly any information on what the project consists of. With this information it is not possible to know what the project wants to achieve. According to the authors the code is complete but there are no links to any place to check this code and understand what it is about. Therefore I cannot say that the proposal is in line with the campaign guidelines: \"Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily.\"", "q0r": 1, "q1": "According to the proposal James Carleton has over 40 years programming experience working for Bell Labs, IBM, and as an independent contractor. But it does not provide any way to check this information such as linking.\n\nOn the other hand, he claims to have the code developed and only needs a budget of $25,000 for server costs. However, there is no link to the code and no way to check that this code exists without the need for trust.", "q1r": 2, "q2": "The proposal has no way of measuring the outcome as it claims to have the code completed. The success of the proposal is defined as: \"The use of the service with feedback to assist with the ETH migration. To provide data and code as needed to assist other developers.\" But the funds requested are unrelated, it are being requested to upgrade servers, it would make more sense to take success as the correct deployment on this new hardware.", "q2r": 1, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11333, "q0": "The proposer is needing funding to create a company called International Cyber Genesis. The idea here is that websites, as well as other things are \"real estate\" and should be treated as such. \n\nWith this proposal come Cyber real estate, and not only that but resident owners of parcels can post ads and trade CNFTs and buy and sell Cyber Nations properties using cryptocurrency.\n\nThis can be done between Ethereum and Cardano as well as other chains. This proposal would effectively address the challenge of the great migration.", "q0r": 5, "q1": "Considering that James Carleton has over 40 years programming experience working for Bell Labs, IBM, and as an independent contractor, is a veteran, and ALREADY has the coding complete and only in need of funding to get the company up and running, I would suggest that it is highly likely this proposal will be implemented successfully.\n\nFurthermore, the proposer has listed what the funding will go to step by step, and if you take a look it is only for creating the business called International Cyber Genesis as well as the infrastructure that will be needed and seeding for an ICO. ", "q1r": 5, "q2": "Considering that this proposal already has the completed code and only needs funding to start up a corporation, get the serves and bandwidth needed for the Cardano community, it would be easy to audit the progress of this proposal. You could easily verify with the State that it has been incorporated. Once that is done, and the infrastructure is in place, it is merely moving the completed code over to it and getting it up and running.\n\nHowever, with that said, I would have liked to have seen the proposer put into wording how exactly we would be able to see that the servers and gigabyte internet was purchased, as well as a way to know who was hired for the accounting, and a basic idea of when the ICO (initial coin offering) would take place. This would allow for more transparency as well as auditability, but since the code is done, and the funding is basically to establish the business entity, it is not truly required. ", "q2r": 5, "assessor": "z_assessor_3237", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 12700, "q0": "This proposal does address the challenge of having virtual real-estate and migrating tools such as decentraland and sandbox to Cardano in the form of Cyber Nations. It is a very innovative idea in a way that brings more awareness to the Cardano community and might even attract many others as another form for owning virtual land. The idea in essence is a suitable and much required idea to be migrated from Ethereum. However, this proposal lacks in effectively describing the challenge it faces, solutions it brings, and the attractiveness/need among the community to be able to use this project. Currently, this proposal (including the video) describes the process as buying cyber nations properties using cryptocurrency, but there is no indication of why ethereum fails to adapt this properly and how Cardano can be much more efficient in solving this issue.", "q0r": 3, "q1": "James Carleton is branded as the Unix Guru which I do agree with after looking at his extensive experience in programming (over 40 years). Web 3 has been a very recent industry and it is awesome to see people like James also taking part and working with everyone for a decentralized path in society. Given his experience alone, it would be possible that the project can be implemented. However, the team currently consists of James and him only. James claims that everything the \"code is written and ready to be rolled out\", but there is very little reputation to check if that were true. If James was truly the only one to exist as Cyber Genesis' team then it would be highly likely that this proposal will fail. This is simply because the project can quickly scale and this lack of structure and force from the backs of the team will ultimately end in Cyber Genesis' demise. The cost breakdown seem fair and with the 19,000 categorized for just servers and internet which should last them a good couple of years (assuming it does not scale too high too soon), but if they do plan on coming back at a later Fund then there is no need to request such a high amount for just running servers and internet. It would be in the benefit for the team and the community to first run the project and test its use cases and then get a good estimate of whether this is a feasible project. Overall, there is a matter of missing proof of reputation, lack in force for the team, and high cost for early stages for this plan to be implemented successfully.", "q1r": 2, "q2": "The ability to audit this proposal is also lacking in several ways and structure. It is reassuring to know that James can hold after town hall breakout meetings to share the progress and future plans for Cyber Genesis. However, apart from this clarification, there is no other way to audit the software or the use of funds for this project. The claim of the code already being written is also not verifiable as they have not made it open-source. There are no success metrics to measure progress. Having milestones for a developing project is a crucial need. One cannot just simply launch a project and assume its done, there are going to be several updates and improvements that need to be made to sustain the project. This proposal lacks in describing that process and there simply exists no information to sufficiently audit the progress and success of the proposal.", "q2r": 2, "assessor": "z_assessor_3454", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13628, "q0": "Looking at the information presented on the impact in the proposal is very sketchy. The information in the work is not clearly described by the author, lacks a lot of information such as\n- What benefits does this proposal bring to users?\n- Who is the end user?\n- Describe the implementation process\nIn the solution description, there is no mention of how this solution will help ETH projects or users migrate to Cardano. The lack of a specific presentation solution is a huge minus.\nNext, for risk assessment, the research team and the author did not come up with a specific risk prevention plan. I don't understand their meaning and implementation method in quote from proposal: \"Programming code is done so ICG is turnkey after funding.\"\nI ask the question: What is ICG, What is Turnkey Programming? Who is it given to?\nIf there are acronyms, the author must have a footnote to help PAs like me better understand the meaning of this word and will clarify the content in the sentence that the author wants to convey to the audience.\nThe author may be someone with poor writing skills, leading to confusing and lack of information. I hope my suggestions here will help the author improve his writing skills in the upcoming proposals.", "q0r": 2, "q1": "Looking at the information presented on the impact in the proposal is very sketchy. The information in the work is not clearly described by the author, lacks a lot of information such as\n- What benefits does this proposal bring to users?\n- Who is the end user?\n- Describe the implementation process\nIn the solution description, there is no mention of how this solution will help ETH projects or users migrate to Cardano. The lack of a specific presentation solution is a huge minus.\nNext, for risk assessment, the research team and the author did not come up with a specific risk prevention plan. I don't understand their meaning and implementation method in quote from proposal: \"Programming code is done so ICG is turnkey after funding.\"\nI ask the question: What is ICG, What is Turnkey Programming? Who is it given to?\nIf there are acronyms, the author must have a footnote to help PAs like me better understand the meaning of this word and will clarify the content in the sentence that the author wants to convey to the audience.\nThe author may be someone with poor writing skills, leading to confusing and lack of information. I hope my suggestions here will help the author improve his writing skills in the upcoming proposals.\nAll the information posted is extremely sketchy and lacks serious investment. If the author wants to be noticed by voters, he should invest more seriously in his presentation in the following Funds.", "q1r": 1, "q2": "This proposal presented by the author lacks a lot of important content and is not detailed. Information about solutions, implementation process, risk assessment, member information, skills and experience of members is not clear and the information is very serious.\nThe author spent very little time writing the proposal and thinking about other issues that could make the proposal successful.\nFinally, the proposal does not clearly describe how to deal with the challenge posed, which is a very heavy minus point to show that this proposal does not meet the funding conditions from the Challenge.\nI hope the author will spend more time perfecting the proposal so that it can attract voters in Fund10.\nAs for what the author has presented in this proposal, I only think it is at 1 star.", "q2r": 1, "assessor": "z_assessor_3702", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "James Carleton has test servers running, and now he needs the financial backing to scale hardware to support the Ethereum Migration in a high-traffic, commercial environment.", "experience": "James Carleton has over 40 years programming experience working for Bell Labs, IBM, and as an independent contractor. He is a Vietnam veteran, and senior citizen who is actively building cyber real estate solutions for the Cardano community. It's retro, stylish, and awesome."}