{"id": 396627, "author": "mybrandt", "title": "OMIMIMO The Pure Water Game", "url": "https://cardano.ideascale.com/a/dtd/396627-48088", "category": 26440, "amount": 59000, "description": "We all need pure water to survive and the OMIMIMO game protects nature and pure water while gaining knowledge and having fun through CNFT's.", "f6_no_assessments": 11, "f6_rating": 4.090909090909091, "videos": [], "media": [], "f6_assessments": [{"id": 7277, "q0": "This proposal relates well to the general goals of our Cardano blockchain. Cardano aims to promote not only a technological leap, but also to establish positive impacts in several areas for the planet, such as the environment. In this sense, the game intends to work with the protection of clean water, which would be very much in line with this principle of our blockchain. As we are told, in addition to water protection, the game would also aim to protect species and plants and animals, thus intensifying its environmental value. I believe that the proposal also aligns with the specific objectives of the challenge, which are, in general, to create games that can be engaging and make use of Cardano ecosystem technologies, in order to popularize our blockchain. It is said that players would possess a “piece of nature” in the form of NFT (which logically would be coined in Cardano, thus achieving the specific objectives of the challenge). We also know that some data, such as water purity, would be measured live and networked, so that everyone could have access to such information (and in a non-corruptible way too), which once again meets what the challenge seeks. The main objective of the game, as I understand it, would be survival, through escaping from traps and hunting for supplies. Through these tokens, you would own a piece of nature, benefiting it, and you would also learn more about the ecosystem as a whole: what happens and why. It's a good idea. But one thing that came to my mind about the impact here is why the currency in circulation in the game couldn't be Ada instead of Omimimo. Our blockchain is expanding, and in my view it is important to measure efforts to increase the adoption and circulation of our own currency, rather than creating or financing the use of new types of crypto. The part of the team organizing a physical camp, where players could move around and have the real experience of all this seemed a little disconnected from the rest of the proposal. Where would that be, exactly? The players would cover all the costs of this trip, right? And where would the money go? What activities would be developed in this camp? What would be the impact of this part of the project for Cardano? This part seems to have been included to add value to the proposal (another interesting thing), but it needs a better detail so that we can understand how this would happen and with what objectives. In the proposal, we see this topic addressed in the following excerpt: “Q3-22 real-life visits to Nordic Wild camp. As a holder, you will be able to visit the water it owns, see the real world heritage and spend some time in real nature...”. However, it is a very short explanation and it was not enough to understand exactly how this part of the project would take place. \n", "q0r": 4, "q1": "The team starts this part by explaining which phases would make up the game's development, which is necessary to understand how the project creation process would be. I found it very positive that in the first stage, the creation of visual material would be carried out so that the public understands how the game works, in my view this is a great strategy to draw attention and encourage people to play. It would be interesting to understand a little more about this part: where would these materials be released? I would like to see how that would turn out. Furthermore, the phases are divided into blocks of time, where each one of these divisions is composed by the listing in topics of which tasks would be developed. I feel like we can get a solid view of what will happen from the data provided. Another note regarding this division of phases: in phase Q3 22, the team claims that it will be possible to visit the physical camp. Again I touch on this point: where will this be, exactly? We know it's Nordic, but in which city, will this be accessible to the wider audience or is it something more geared towards those who live nearby? Finally, about these phases: they are the best part of the feasibility topic because they allow us to understand exactly what would happen and in what order and what the team's ambitions are for this project. However, when it comes to staff and funding, unfortunately, the same richness of detail is not found. For example, in the explanation of the requested money. The team claims that 12k is required for coding the game, I agree that this work is complex and requires a high investment, the problem is that it is not detailed how this work would be done. It's five weeks into this development, we don't know exactly what would happen in the first, second and so on. It is important to understand who would be doing this, what their work routine is and the small tasks that would result from the whole, the coding of the game. The same is found in the other parts of the budget, the conceptual design for example. How would it be developed? Why would that last 3 weeks? And finally, about the team, I think the proposal lacked detail about who is who, what they do, their resumes, etc. For example, Maria is the creator of the game and advocates for greater inclusion of women in Cardano. But what role would she play here, exactly? What do we know about her curriculum, projects developed previously? We have the “K”, who would provide technical support and be a consultant. First, what is this person's name? What is your professional training? How does he or she relate to Cardano? What kind of consultancy would he/she provide? How can we get proof of your CV? It would be necessary for team members to include more information about themselves, their full names, linkedin profiles (if any), their detailed roles in this project, etc. In this way, more confidence in the team's ability to successfully carry out the project would be conveyed. \n", "q1r": 3, "q2": "The team provide us with good data that serve as ways to audit the proposal. Starting with the fact that, in the previous topic, we have divided project phases, with respective tasks about what would happen in each stage. In this way, we are given information about what would happen and when, so it is very possible to monitor whether the activities that were promised were actually being carried out, at the appropriate time and in the right way. And in relation to the final results themselves, here the metrics of success in the short, medium and long term are established. I think it's very positive how the team believes in the project (it has to be that way), setting horizons of success for a very long period, for example, beyond two years, when the game would theoretically be self-sustainable. The objectives are divided with the notion of time according to the months, in which several goals to be achieved are listed, allowing the community to monitor whether what was intended was achieved. For a very complex and expensive project, there needs to be a very accurate and close monitoring, this could be done from a team of professionals who understand both games and our blockchain and its technologies. Ideally, these people could establish direct and periodic contact with those who develop the project, in order to trace an accurate follow-up that can be shared with the rest of the community. It would also be interesting if some representatives of the game were present at Town Hall and presented progressive results, as is already the case with some projects. In general, in my opinion, everything is in line here, the team establishes very well what we need to monitor and what specific goals to achieve (which also includes the wide adoption of Cardano and popularization of the blockchain, fully meeting what is requested in the challenge). \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 338, "q0": "Given the characteristics described by the proposal, we note the existence of several important points for the project to be successful and together lead to greater visibility for the entire Cardano ecosystem. Looking at the uses of blockchain technology for creating NFTs and storing data about nature, we realized that the game has a particular idea.\n\nUnlike other games that also use blockchain technologies in their development, the great distinguishing feature of this game would be the appeal to environmental issues. Therefore, the fact that the items sold in the game have this awareness characteristic makes their eventual success of great importance to the entire Cardano ecosystem.\n\nIt would be possible to see in the future, even, future partnerships with environmental movements that sponsor the game as a source of exposure of the initiative. The budget consists of a considerable amount of capital, but for the success of a game it is necessary to focus not only on development, but also on all its marketing structuring and on maintaining an active and relevant community, which is constantly engaged in debating about the game.", "q0r": 5, "q1": "From the description of the professionals involved in the proposal, we realized that some important points for the execution of the project are fulfilled. Describing these, it is possible to note that there is development experience in the technology area by the team, including the name of the developed application being mentioned.\n\nHowever, we were able to notice the fulfillment of not only technological requirements by the team, we also found experience with entrepreneurship and philosophy. Finally, there is still a base of knowledge and interaction of more than two years on the functioning of Cardano and the technologies necessary for the game.\n\nThe stages of development are clearly explained, with funding for each one indicated. The value of each step seems to be consistent with what must be accomplished. An example of this would be that the investment in marketing will take place from Q2 onwards, which seems like a good choice because at that moment there is already a structuring of the front-end and it is easier to advertise a game more visible.\n\nWe also have that capital has been allocated accordingly, with a good part of the funds ($12000 in Q2 and $5000 in Q4) being allocated to game coding, but there is also a considerable allocation to game development ($12000 in Q3) and for other aspects such as the conceptual design and animations of NFT's.\n\nThere is also a suggestion of an organization of project expenditures to possibly aim at a slightly higher allocation for marketing. It is known that today the promotion of a game can end up being as important as its development.", "q1r": 5, "q2": "As the game has ambitious goals and a dense development process, it is crucial to follow the delivery of each of the stages described by the creators of the project, especially regarding the demo of the game, which is an essential part of the process so that future stages of the project can draw more attention.\n\nIt is quite expected then that there will be a playable and testable demo. Such gameplay tests can be targeted not only to members of the Cardano community but also to gamers not necessarily familiar with blockchain technology, so that acceptance can be analyzed.\n\nIn addition, it is also important that project professionals who have a greater affinity with the technical part of the technology behind the game periodically demonstrate the expectation of acceptance of NFT's and how much is actually being sold. It would thus be crucial to follow the evolution of the game both in its aspects of a traditional game (how playable and fun the game is) but also in how Cardano's blockchain is making the game more unique.\n\nIn the ideas conveyed by the team in this section, we can find that good milestones are being defined to audit the development, showing that it is well understood where the game intends to go. But it would also be interesting if some quantitative parameters were established. For example, it was mentioned that organic growth of the community is expected, but what would be the number of players to be reached in this initial phase? Regarding the demo, a survey could also be carried out to seek a certain level of average satisfaction from those who tested the game.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1589, "q0": "A really thoughtful game that can both entertain and educate players, improving life skills. I have a question, how do you guys encode pure water into blockchain? 1 CNFT = 1 m3 of water? An outline of how to do this will be specific to the problem so that it can be easily understood by everyone. Also in the proposal, this is a 3D survival money game, I have opened the attachments but can't see anything describing the economy in the game, how the money comes from where to pay the rewards for player? I think a cash flow diagram will probably be needed for your project to be easily funded.", "q0r": 4, "q1": "I completely agree with the development roadmap that you guys give. Appropriate budget for each stage of development. But I'm a little curious about how your project membership is, a link to linkedin or github describing each developer's experience would be needed to understand what resources you have.", "q1r": 3, "q2": "Lack of metrics to measure success. I agree with the goals to be achieved for the future of the project but it will take concrete numbers to visualize them. I suggest more reports showing that the project provides knowledge about survival and protecting the environment through playing games.\n", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 1712, "q0": "With the current actual situation, not only one country but the whole world. Water resources, resources and rare animals are gradually threatened. Recommended with a good and humane idea. Bringing people into the game, generating revenue and most importantly, helping them to love and absorb knowledge of protecting nature. The overall proposal addresses the challenge. Bring everyone together on the same blockchain. In the game they will have empathy, passion. pave the way for innovation, conservation and development of natural resources. Generate bonus revenue with Omimimo and grow Cardano. You have identified some risks in your proposal. However, it will be better if you have a timely and reasonable solution", "q0r": 4, "q1": "The proposal offers a clear plan, a detailed roadmap for each quarter, and an estimate of worldwide expansion in 2025. However, I would like to be more detailed in terms of the time and budget to be broken down, it let the reader know the goal is achieved within the time frame. Example: Concept Design, 3 weeks $4000: How many ideas, how many people and cost will be allocated to them.. The team consists of creative members, technical engineers and developers. Cardano game. The members are all fully skilled in the context and experience. Increased confidence in the development of the proposal.", "q1r": 4, "q2": "The Proposal provides a plan with a detailed road map showing the measure of success and what was achieved each quarter. The total requested cost of $59,000 is reasonable. However, the proposal will be more transparent and easier to audit if the budget is broken down and more detailed. Detailed budgets will show specific value, providing insight into the success of the project. Proposal is almost funded from fund7. Proposal with experience and advantages for successful development", "q2r": 4, "assessor": "z_assessor_1409", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3560, "q0": "At my first glance, I could argue that the idea behind the game does hold some potential, as it aims to raise users’ awareness of the significance of nature and the desire to preserve it. I must add that I myself haven’t come across a game that combines the genre of survival (also a genre that excites millions of players with current popular titles such as the Far Cry franchise, Dying Light 2, The Forest, etc.) with the urgent global mission of natural preservation and enhancement. So I have high hopes that this Cardano-based game will tempt a large number of gamers to join the ecosystem. \nHowever, there are a few things that I find unsettling.\n1. While the proposer does pose a main challenge for this project for the foreseeable future, I believe a viable and suitable solution hasn’t been brought up yet. Perhaps a cooperation with the nature-preserving organizations or a small extraction of cryptocurrency to donate to said organizations would make more of a case.\n2. Despite the mention of this being a 3D survival game, other than the game mechanism, not a lot of details are laid out regarding the gameplay, game lore or open world setting (as to my knowledge, survival games usually take place in an open world in order for gamers to explore and interact) \n3. I would also suggest that the proposer add some figures of key metrics in order to make the proposal more viable and attention worthy. For example, an estimation of an user base at a time mark, how many Omimimo tokens crafted for the game or perhaps how much value players could potentially earn during gameplay.\n", "q0r": 2, "q1": "From the road map and timeline presented by the proposer, I have faith that the proof of concept will be able to deliver the visualized outcome, and the suggested fund seems quite well grounded also. A great commendation on my part for the highly detailed budget breakdown as well. The only small tweak I would like to add is the inclusion of team members’ information and their respective background checks, as the only name to pop up in the proposal is that of the game creator.", "q1r": 4, "q2": "From what is being offered up the table here, I would argue that a certain level of auditability is achieved. The team did put together a rather detailed representation of what is hoped to acquire in terms of success, with 3 phases ranging from short to long term, including what content of the game is ready for launch and what features that players can interact with. I especially compliment on the fact that all of this info will remain on blockchain permanently for the community to double check, and the project is capable of self-sustainability in 24 months. The visualized success for the project closely aligns to the objective of the challenge setting, which is the great immigration of users to Cardano, while aims to a more noble cause of protecting and preserving wild nature and pure water.\n", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4071, "q0": "I strongly agree that this proposal aligns with the challenge. Not only will it bring games to Cardano and make Cardano a more familiar platform but also bring a new idea about Cardano to the community as a blockchain that can have an impact on the planet for future generations based on values, knowledge and care for every species. The idea is creative and the team has shown a huge commitment to the project. This project has such a big vision and its will attract gamers to Cardano, not only because of the entertaining aspect but also the bigger impact on the world behind it. It can make the gaming a lot more meaningful for gamers and I think it’s the selling points here. The project has its detailed plan, its aims and its targets. In my opinon, the proposal also inspires a broad set of use cases within the same topic, within the same platform, you could do so much to support the work of different organization out there saving our resources and endangered animals. The scale of this proposal is huge which can explain the substantial amount of funding. However, I believe that it can vary on many different levels all over the world. ", "q0r": 5, "q1": "I like that the team has tried to cover all the dimensions and not only one or two, for instances, coding, art, game design, marketing and such. It’s a good preparations and shows that they have the abilities and people who can cover this proposal from every direction. The fund allocation is well explained and hourly distribution is explained. Overall, very well articulated proposal and hence I fully agree that experience and plan presented it is highly likely this proposal will be implemented success. The only thing that I would like to see more is more detailed of the core members in the team so that we can see a bigger potential of success here. ", "q1r": 5, "q2": "The proposal has shown that it is possible to audit the progress and the success of this proposal. We can see where the catalyst funding comes into pictures and it certainly give the community the confidence to vote for this project. The milestones are well presented and can be used to determined a vision of how the short term and long term success will look like. Also with all the outlined risks, the community will be able to give the fairest justification when auditing the progress of this challenge. In conclusion, I see absolutely no issue to track the progress of this proposal. ", "q2r": 5, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4264, "q0": "For me, the proposal was written pretty well when it showed information about the game on the Cardano blockchain. The team has managed to explain about what they were going to do in the project, and also what is their goal. The activities in the project they are going to to were also listed out in the proposal. In addition, they have also foreseen the possible challenges in the future. They provided their point of view of the problem and gave a brief solution to it.", "q0r": 5, "q1": "It can be seen from the proposal that the plan, timeline and budget breakdown of the project was displayed by the writer. The team has provided specificallly information about what they would do in each phase or activity of the project. Therefore, readers can know more about the game. The team members who are in responsibility to deliver the project were also mentioned in the proposal. However, it seems a bit confusing to me when they didn't write the name properly, instead, they wrote just the first letters of the names. So I think they should have been careful about this. ", "q1r": 4, "q2": "Overall, at this part, the team has provided almost essential information about how they would measure the project's progress. I can see that they explained pretty detailed activities, including the time needed. And I think by implementing those activities, they would deliver the project. One thing that I think they have missed to mention in the proposal is if this is an entirely new project or it belongs to a funded one before.", "q2r": 4, "assessor": "z_assessor_1714", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4284, "q0": "In my opinion, it is not an exaggeration to describe this proposal with the word “outstanding”. The idea of creating a game based on NFT and blockchain (which is about protecting pure water and rare species so that it can build gamers' cognitive abilities & knowledge of nature) seriously just overwhelmed me. The author’s multi-year experiences in various fields, especially 2 years of being a Cardano enthusiast and researching Blockchain studies, show seriousness and enthusiasm. The solution and the method of addressing the challenge are very detailed, with smart, creative approaches closely tied to the project's core value, which is “Nature”. Additionally, the proposal is written in a way that is easy to understand, along with a clear presentation and a link attached leading to a beautiful website where everything about the project is already provided. Last but not least, the part which I love the most is a Nordic wild camp prepared by the team, which I believe will provide great value to the Cardano ecosystem since it can strengthen the bond between members and make the Virtual World more realistic. The only imperfect thing in this part is that the author did not write about what exact problems the team is going to deal with in the process, however, even that does not stop me from giving this a 5.", "q0r": 5, "q1": "The feasibility part, in my opinion, is even more impressive than the impact part. The author must have a very deep insight into the project, proven by the proposal’s comprehensive plan with a remarkably detailed roadmap and conspicuous milestones. The timeline is split into different quarters, with important work items listed covering almost every aspect of making a game, from developing a website, coding, creating visual material, minting tokens,... to advertising, marketing and the most lovely part - organizing a Nordic Wild Camp for gamers. All these works are listed in a very realistic order, companioning with a detailed budget breakdown that describes specific amounts of money needed for each stage. Besides, the positions needed to complete the project is also provided detailedly, and with all of the above mentioned, my rating for this is an obvious 5.", "q1r": 5, "q2": "In this part, the measurement of the success of the project is defined very clearly with specific deadlines and goals to reach. I love how the author split the success into short-term and long-term, as well as the prediction of future development with potential VR integration into the game. The lofty intention of the team to store knowledge about nature forever in the blockchain for the future generation to learn from also hugely impressed me. Therefore, my rating for this part is, of course, another 5.", "q2r": 5, "assessor": "z_assessor_1716", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5958, "q0": "This proposal aims to develop a game that will support the preservation of natural resources and wild life. They intend to create a 3D survival game, free to play and play to earn. It also says that the revenue of the game will be used to pay for the preservation of a real location in Sweden. It is a noble goal, but for it to reach the impact it plans to, I believe the plan should be improved. It is currently not clear how the game is going to create revenue, if players would be buying NFTs as a way of donating to the project, or if they foresee another way to raise capital. I believe this project is well aligned with some Community goals, like SDGs end ESG, and it could have a big impact in the Cardano blockchain, but I also believe the business plan should be improved for it to be successful. There are some information about the impact and explanation of the proposal spread out in feasibility and auditability sections that should actually be places under impact. ", "q0r": 3, "q1": "The team presents a roadmap for 2022, divided in quarters and starting with deliverable milestones at the end of Q1, which seems challenging specially if funding is needed to deliver them, since funding will be available only at Q2. Some of the developments mentioned in the proposal are not accounted for in the budget, for e.g., the real life Nordic Wild camp, as mentioned in the first section of the proposal. There are some points on the budget as well that are a bit vague, like ‘Coding’ asking for $5k, it’s not clear if it’s for the game itself, website, or something else, since there’s a ‘Game Development’ budget afterwards asking for $12k. Considering it’s for the came development, than it’s $17k in total to build a 3D game, which seems not to be enough since these games are usually expensive. It should be said if the idea is to create a MVP or some kind of limited version of the game, or if they plan to get extra funding somewhere else, or through a NFT sale, for example. The team is presented, but there is no way to verify them, no links for personal webpages or LinkedIn, or previous work. It also seems that they still need to onboard designers, web developers and marketers, at least.", "q1r": 2, "q2": "The auditability section of this proposal is not well defined. It sets success for 3-6, 6-12 and 12-24 months, but the roadmap presented earlier only goes from Q2 to Q4 (with funding), which would be a maximum of 9 months development. It also has some information in this section that doesn’t belong to it, like “Collect different rarities and improve your survival skills in the OMIMIMO game”. Besides that, it includes some developments that are not going to be funded through this proposal, such as VR development. Some of the success criteria are not easily measurable (’Awareness about real world assets raising’, ‘Preparing the unique NFT's for 1st Launch.’). Some of the milestones presented earlier are also not present in the audit section, for example, development of the website, improvement of game mechanics, etc. Also, there are no KPIs to keep track of the development of the proposal, although some could be created for, for example, ‘Community organic growth increasing.’.", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6688, "q0": "I really admire this proposal as this is as close as some ideas can get to the vision of Cardano that Charles Hoskinson proposed in 2017. This proposal wants to use gaming and blockchain to spread and evolve consciousness in us towards our natural habitat Earth. The proposer provides a detailed overview of how the game will work, via owning NFT (as well as fractionalized NFTs) and owning NFTs related to rare animals, pure water and having mystery boxes, challenges etc in the game. The proposer details out that by tokenizing the pure water anyone could participate and do some real contributions to make our habitat a better place to live in. \n\nThis idea, if successfully implemented, could potentially also become a good use case for school kids, universities and  non profit organizations. We need to have self sustaining and fun ways to be aware and learn about our planet earth. The next decade or more is going to be highly focussed on renewable energies, global warming and sustainable growth. The key metrics and goals of this proposal perfectly fits with the vision of Cardano and this challenge settings. Therefore, I strongly agree that this proposal will bring a lot of value and hence impact to the Cardano ecosystem.\n", "q0r": 5, "q1": "The proposal plans out quarterly milestones, and each quarter milestones are split further into a set of features that the community can expect. Therefore, the timeline is clearly explained, although I could not see the details of the team members, such as public Linked in profiles, OR whoever the developers are who will work on the implementation of things such as development work during the Q3 12 weeks of $12k budget. It is not clear from the proposal what kind of skills the team members have in terms of achieving the milestones presented in the proposal.\n\nBudget seems reasonable and is well split and explained. I would have loved to see more architecture/technology specific details, as game development is a fun area for me, and as a developer myself I love to dig into such details. However, I could not find any of these details. \n\nOn the risk/challenges front, I agree that there are challenges associated with how they would connect the real world protection to this game and make sure people actually do enjoy the game and this indeed reflects back to the more conscious behavior of humans towards nature. Therefore, technical details are very important in this regard, a lot of which will depend on how well versed the team is. This proposal also came very close to being funded in the F7, and based on all the information here, I agree that this proposal is likely to be implemented successfully.\n", "q1r": 4, "q2": "From the perspective of auditability I strongly agree that this proposal will be easy to track by the community. The team has provided both  the short term and long term success metrics. Since all the milestones and timelines are split well into further details, the community would have a pretty good idea on what is being implemented or worked upon at present and what is in the backlog.\n\nThe metrics/KPIs clearly define how the success of the project looks like. In an ideal condition, the game could become really popular across the globe and a lot of real users will not only onboard Cardano through this game but also help improve the environment and hence change the world for the better. An overall, very well written proposal and I wish good luck to the team this time.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8440, "q0": "\nThis proposal gives an exciting idea about cool NFT game, namely Omimimo, to bring people together on Cardano blockchain to protect rare species and water on earth. Aparting from on-chain activity to raise community' awareness, the proposer and team members also dedicate themselves to take care of nature reserve by pratical activities. By that, community could learn about Cardano through playing games and brings positive changes to the environment. ", "q0r": 5, "q1": "The proposer gives a detailed one-year plan in 2022 for each main tasks from completing game, VR possiblity, team expansion,...which I find promising and feasible. Besides, they have vision for the next four years which shows their seriousness. The required fund is clearly broken down for each phrase. The proposer combine online activities on gameplay on Cardano and real activities from Non-profit organization are also their strengths. However, I would like the proposer to give more detailed background information concerning their expertises and experience for community trust and support. ", "q1r": 4, "q2": "It is possible to check the development of this project based on some key milestone by game release, community feedback, real activities from non-profit organization,.. However, I would like the proposer to provide more communication way such as Discord, social media channels,..for community concern about your project.", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Developing a future store of value by protecting pure water and rare species.\nBuilding gamers cognitive capacities & Knowledge of nature.", "experience": "+20 years as a Social Philosopher/ Futurist/ScentDeveloper/Entrepreneur.\n+10 years App development. AppScent.\n+15 years Author of \"31 Ways to be Free\" and \"Anthill Warriors\", upcoming futurist book.\n+2 years as a Cardano Enthusiast/ Blockchain studies and research."}