{"id": 397365, "author": "tesla", "title": "NFT Battle Royale Game for Cardano", "url": "https://cardano.ideascale.com/a/dtd/397365-48088", "category": 26440, "amount": 100000, "description": "The blossoming NFT technology has seen poor adoption globally. The space demands easier ways for blockchain enthusisasts to own NFTs", "f6_no_assessments": 14, "f6_rating": 3.5714285714285707, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=0"], "media": [], "f6_assessments": [{"id": 1707, "q0": "This is an interesting proposition, an NFT game genre with a collection of ideas from popular games that are a collection of ideas from Clash of Clans, Age of Empire, and Diablo. The game in this proposal describes many properties: war, diplomacy, and leaders as well as kings, conquering lands and expanding the territory map. This can be the type of game that appeals to players in my opinion. With the solution of building game ideas related to NFT and aiming as an Axie Infinity Marketplace, the proposal has oriented the solution for the development of this project.\nI see there is a large number mentioned of 50,000 users within our first year for the game, this is the only KPI the author gives, I think there is still some lack of necessary salary metrics to achieve be successful.\nThe risk section is clearly written with difficulties such as development team, lack of marketing budget, and misunderstandings about NFT technology and solutions are also described to solve the above problem. There is a small part that I didn't see when the author mentioned “This has grown our Discord channel to hundreds in less than 3 months” I searched in the recommendation but didn't find your channel. Moreover, the YouTube channel only has 60+ views and ~20 subscribers. Please update more information and develop your project better.", "q0r": 3, "q1": "The proposal provides a development roadmap from Q1 to Q4/2022, briefly listing the project's functions. Unfortunately, the proposal does not provide the short- and long-term success milestones that Catalyst's question established.\nYour team as described has a lot of experience and with specific roles in the project, it is very good to run a project. The information of those who manage and have a key role in the project is identified with identities on social networks such as Twitter @GoldenBoyGrey1, @shammahgodoz_. I looked for more real coders in staff roles but couldn't find any more information about them. Of course, this is not important and they can outsource if they want. As for the project funding, which is $100k, it accounts for 1/5 of the total budget of this challenge. Expenditure items in the budget are divided into each work in the project. There is a large $60K ($60,000 - Unity features and Networking) part that I don't quite understand, which needs to be described in more detail. There are also 2 items that are timed 4 weeks, but the rest are not accompanied by hours, which is inconsistent when applying for funds and confusing for sponsors.\nI have not seen the cost of in-game sounds, sounds or music indicated, nor the cost of royalties or taxes during the development of the project.\nTell us more about the 3-6 months or 12-months project success milestones?", "q1r": 3, "q2": "The proposed project progress tracking section offers tools such as GitBook, GitHub, Titan Email, and Trello. Besides, they use Gantz Chart to manage tasks. In my opinion, the proposed tools to manage this game project are appropriate. The author also talks about the vision of the project with the common benefits of a successful NFT game product. What I'm looking forward to is to state something concrete with transparency that is easy to measure success in the project. If you add more differences compared to other NFT game projects as well as your own strengths, I think voters will easily choose. I think you can write better and add the necessary things to make the proposal more persuasive. From my point of view as a CA as well as with my experience as a gamer I would like the project to be written more properly and expect it to be better for investors as well as voters.", "q2r": 3, "assessor": "z_assessor_1408", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 2546, "q0": "Battle Royale games since Fortnite and Similar FPS titles, became a live streamers paradise for content capturing millions of viewers basically overnight, and have become widely successful within the gaming community and content creators. Bringing that style of play and it's audience into the Cardano ecosystem seems like a noble venture, allowing crypto users and NFT enthusiasts to thrive together within the gaming market. This 'bridging the gap' concept between cryptocurrency and gaming, especially the P2E aspect which is appealing to many, is quite possibly the most effective way to grow both communities allowing for adoption and education simultaneously. This project which started shortly after the NFT craze happened on the Ethereum network, has been much more accessible on Cardano's blockchain given the fairly priced entry level of most projects launch so far ($100's vs $1,000's). This proposer has explained many aspects of the game itself and has shared in regards to the solution to the main problem, bringing Gamers On-chain, and how it will accomplish such goals. One thing that stands out is the education needed for a more thorough understanding of the non-fungible token for no crypto users: \"onboarding traditional gamers about Non-Fungible Tokens and Decentralized Exchanges until it becomes a common knowledge\". This line acknowledges the necessary involvement within the community to fully comprehend what an NFT's role in this game and future games can be. It would be great to have more on how this proposer plans to accomplish this enormous obstacle. Marketing a game to crypto-friendly users already involved is becoming easier with the use of discord and twitter, but finding gamers who are crypto-friendly is another hurdle this proposer must take seriously if and when funded this round or the next.", "q0r": 4, "q1": "The proposer has described a solid foundation of team members and expertise in fields that would be required to accomplish this idea to it's full potential. Many young software engineers are enthusiastic creating a synergy in the world of gaming and crypto. With the team members referenced, they're perhaps more than qualified to deliver on such a challenge. The timeline to which this proposer has drawn seems reasonable yet somewhat undefined in regards to identifiable items. It would allow for better understanding if some areas of the available plan were shared within this proposal, for i.e.: in Q2 \"Team Expansion\" and \"Marketplace Launch\". These two stand out as it is not mentioned what outside sources could add value to the already aforementioned team members. As for Marketplace Launch, has there already been \"Land Pack Sales\"? Upon further investigating within the project's discord, the question of are there existing NFTs for in game use that have already been minted and distributed, the answer is yes! Partnerships can benefit any project/game development and funding, but these have not been shared. Perhaps these are not yet finalized or the proposer has not reached this point thus far? The funding of this idea is one of many that is requesting nearly half of the budget for this funding round in Gamers On-Chain. The risks involved with any game is time and money. With a successful round of funding, can this proposer guarantee delivery of what's been outlined, or does the proposer understand there could be additional funding needed before completion? Overall this project seems well on it's way to overcoming the gaming and community building obstacles, starting with an organically grown discord membership (just under 1,000 engaging members) but it's marketing strategy and as mentioned above, education efforts for traditional gamers about NFTs still remain the highest hurdles to expanding the Cardano ecosystem and driving demand.", "q1r": 4, "q2": "Having a game already in the development stages; see attachments and links here (https://pangaea-kingdom.gitbook.io/whitepaper) the proposer has presented an excellent visual of what *Pangaea Kingdom Universe* has to offer it's user base and what's to come. The team emphasizes the use of \"agile methodology to organize tasks using Gantz Chart\" as well as weekly progress reports through various communication and documentation methods mentioned: GitBook, GitHub, Titan Email, and Trello. The Milestones of the project's roadmap are defined quarterly, but it would be best if more details could be explained within the whitepaper itself. Given a checklist format, there are no clear descriptions of each criteria or accomplishments made thus far. Further research into the proposal, the best way to access any public updated information, questions or concerns seems to be through the Pangaea Kingdom Discord server, where the most recent announcement is promising to the overall Marketing value with a listing on CardanoCube.io. Upon viewing the website, browsing the discord server (850 members since May 2021), it's clear the team has been hard at work building on the Cardano blockchain, engaging and building a organic community and attempting to bring Gamers On-Chain.", "q2r": 5, "assessor": "z_assessor_1529", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7296, "q0": "The game works on top of one of the most famous technologies that involve the Cardano ecosystem: NFTS and CNFTS. As I understand it, it is a strategy game, where players (Pangaeans) would face challenges, trade NFT and transact in cryptocurrency. In this way, various parts of the Cardano ecosystem would be used and the objectives of the challenge would indeed be achieved, not least because all transactions (from what I understand) would be made on our blockchain. It is very positive as the author already has experience with NFT (according to him, he has 9 collections) and as he already has defined what would be the native token of the game: $PG(PangaeaToken). In my view, this experience is quite significant to shape the impact of the project, because the author already has some background with this technology and trying to align it with the objectives of the challenge (i.e., increase the number of transactions on our blockchain, NFT exchange , people who know and use Cardano) can bring great results. That is, the theory here is very good. However, I think it lacked detail in explaining the game itself. What would be the main goals of the players? What would a match be like? Would it be an online game? How players could profit from it (it is said that they could, but not explained exactly how). We have several similar projects trying to be financed or even already winners on Catalyst, I would like to know specifically what the differential of this one is. In this way, I would be more confident, as an AC, in classifying this proposal with a maximum grade. Due to this lack of detail regarding how the game itself works, I couldn't be too sure about the impact. \n", "q0r": 3, "q1": "We do have all the information that is needed to measure the viability of this project, although it could have been better organized and more detailed. For example, when we talk about roadmap, the team tells us what would happen during each quarter of the development of this project, however, the activities are listed (I believe in order of occurrence) but without us being able to understand and place ourselves exactly in time and in the space. How long would each of these activities take to complete? Who would be responsible for each of them? I believe that the information given is good, but it could be better if it were explained to us in what period of time exactly they would happen. Three months is a very long time, it would be better to divide the activities within this larger block into weeks, for example. Regarding the financial amount, a similar thing happens: we know how the total amount would be divided into large parts, but each of them could have been better explained. To cite the example of marketing: they ask for 10k for this, it is a very high value, it would be important for us to understand exactly what marketing strategies would be used, how the target audience would be approached, how long this process would take and who would be in the line of forward here. Because they are high values, the more detail there is, the better. And finally, the team presentation is the best developed part here. We know the names, roles and a little background of each team member; What I wanted, however, is that they had attached a linkedin profile or a website where we could see, demonstrably, the experience of each of them. It's true that they attach the contact, either through twitter or discord from almost everyone (I think Frederick's was just missing), which is great, but for this part to be complete I would like this extra detail. \n", "q1r": 4, "q2": "Unfortunately, in my opinion, this part left a little to be desired. The team informs that it will distribute the tasks weekly (this could have been included in the previous topic, as I mentioned), that they will have a meeting (almost) every week and use online tools for work collaboration, in addition to creating graphics that allow a better visualization of the realization of these processes. Theoretically, this is perfect. The problem is that they seem like they intend to organize themselves among themselves, but it doesn't show that they intend to take it to the public. All these strategies and solutions would be ideal if everyone could see how things are going, that is, how would they expose such information to the Cardano community? It is essential that they think about how to bridge the gap between these internal organizations and the rest of us. I think it might be useful for them to publish these graphs on one of our various communication channels, who knows, at the end of their meetings, they would prepare reports that would be sent to the Cardano community. We know what your goals are, but they are quite broad, it would be more appropriate if the team set some more specific and objective goals, easier to verify (did this actually happen?). If the activities were organized in weeks and this organization was taken to the rest of the community, we could verify, in addition to the results, if the development of the project was also happening in an adequate way, that is, if each task was happening in the foreseen time and etc. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 351, "q0": "The proposal has as its main goal the creation of a Battle Royale game that uses the concept of NFT's in its gameplay. Due to the described objectives of the project, we have a framework with the goals of the challenge in which this proposal finds itself, since the success of the game brings greater notoriety to the Cardano ecosystem and to the use of the blockchain concept in the gaming universe.\n\nIn terms of innovation, the idea structured here does not present any considerable novelty, since the universe of Battle Royale games has been extensively explored lately, and the mixture of this concept with the use of NFT's does not create such a great differential for the game. .\n\nWith the eventual success of this game, in the medium term, we would have an increasing number of people aware of the possibilities of linking games with blockchain concepts for their monetization. However, from what was described in the proposal, there was the feeling that the game's great differential would not be its unique and differentiated gameplay, or the guarantee of an innovative experience, but the presence of NFT's in the game.\n\nIt seems more interesting that the use of NFT's was a differential for the game and not its main feature or the main reason to attract players. Given this factor and also others that will be analyzed in the future, we realize that the amount of capital being asked of $100,000 is very high.", "q0r": 3, "q1": "Regarding the definition of stages and professionals involved in them, it is necessary to make some observations. All professionals involved in the project seem to have good technical skills, as well as relevant previous experience for the game's development to be successful. It is even possible to observe a video of the game being developed, which is a very positive point and the engine being used, Unity, is also one of the most famous for game development.\n\nAnother positive that can be mentioned here is the possibility of contacting the game's developers through their available contacts. In fact, the skills of the professionals involved here are not limited to the development itself; Gray (@GoldenBoyGrey1) for example, has experience with digital marketing, an essential skill for a successful online game.\n\nThe project development stages are indicated, as well as the budget for each one of them. We can see that the largest allocation of funds is actually destined for the creation of the body of the game itself, for this step $60,000 will be allocated. As for the creation of NFT assets plus specific blockchain development, $10,000 will be allocated. These proportions seem quite correct, since the differentiating feature of the game must be, as mentioned before, its gameplay, mechanics and possibilities that the player has in the Pangaea world.\n\nHowever, we once again fall into the contradiction mentioned at the beginning of this analysis, the proposal did not demonstrate a great differential of the game itself, which went beyond the existence of NFT's in it, which makes the $60,000 allocated purely for development perhaps not be utilized in the best possible way.", "q1r": 3, "q2": "Regarding the established ways of measuring the development of the game, we noticed that the team was very precise in explaining which tools would be used to monitor the project (and many of them are widely adopted for monitoring goals). In addition, the time for the dissemination of progress was also stated, such as through the weekly progress reports, as well as ways that will demonstrate this evolution, in this case the snapshots. This leads us to believe that the team will know how to drive progress consistently. As for the ideas conveyed about the perception of success, we also noticed that the team understands very well what the impact of the game should be.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1717, "q0": "I think the overall proposal meets the challenge and I personally like the idea. Cryptocurrencies have existed for more than a decade and are now widely known and used by many people. The proponent has drawn up a plan to bring Blockchain lovers and enthusiasts into a game in Blockchain, evolving under the Cardano ecosystem. With a familiar and entertaining game like today. Gamers can both easily play and raise awareness of Catalyst, join and grow the Cardano ecosystem through the game. The proposal has a clear solution that recognizes the risks and has a solution for the risks when the proposal is implemented. I admire you for reducing risks, putting effort rather than money to reach the world.", "q0r": 5, "q1": "Roadmap with milestones divided into 3 quarters. However, it would be nice to propose a detailed timetable explaining what is to be done. The proposal offers a total budget of $167,000. I'd like to see a more in-depth explanation. Example: It is possible to include an estimate of how many people are involved in this project, their working hours and their allocation of funds...a detailed budget allocation will add to the accuracy of the project. reliability of the proposal. The strength of the proposal is having a strong team, full of technical expertise and experience to execute every step of the project well.", "q1r": 4, "q2": "It is beneficial if the proposal has several KPIs that will be easy to test, track progress and develop the proposal. The team uses Gantz charts for fast development and transparency in their GitBook, GitHub, Titan Email, and Trello tools. I look forward to the success of the group.", "q2r": 4, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 1899, "q0": "The author proposes to build a \"3D Builder MMORPG\" game named Pangea Kingdom, which fits well within the challenge description, however the generic language used and the scope described raise some red flags. There is a video that describes what the game might be, but going to the youtube channel for that video shows an assortment of different types of gameplay demos that seem hastily \"kitbashed\" from unity store assets. This is fine, but should be declared as placeholder assets and not sold as NFTs. The author raises some challenges including \"the general misunderstanding of NFT technology\" that seems worrisome.", "q0r": 2, "q1": "The language used by the proposer to describe the work that has been done to date is difficult to understand; The content on the gitbook and youtube channel are very recent. Some of the team's bios seem a bit generic and I wasn't able to find linkedin profiles to back up the claimed experience; Given the scope of the project, and how the budget, tasks and timelines are broken down, my opinion as a game developer with 20 years of experience is that this game has a very low chance of delivering. ", "q1r": 1, "q2": "The proposer discusses how the team manages its progress, but not how that progress is communicated to the Catalyst community; There is no mention of a deliverable and the key metric is the creation of a community specified in very generic language. ", "q2r": 1, "assessor": "z_assessor_142", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3564, "q0": "I believe that the proposed solution meets the challenge setting of creating a gaming application to attract more users (which are, in this case, gamers)  to the Cardano ecosystem. As a gamer myself, I am convinced that the gaming world has yet to fully welcome cryptocurrency into its ever-growing scene. Therefore, introducing a Battle Royale game (a gaming genre that is currently blooming vastly) that integrates cryptocurrency-based rewards should generate high interest amongst the gaming community. The proposer also succeeds in pointing out the possible problems that might occur during the execution of the project and offering some effective solutions as well, which are even more commendable considering that the solutions take up work rather than diving deeper into the suggested fund.\nWhat I find as shortcomings, however, are \n1) the lack of key metrics to make this project seem more viable. For instance, they should add the amount of value that players can potentially earn during their gaming experience, or the number of CNFTs or fungible tokens made specifically for the game. \n2) the lack of details regarding the gameplay experience, the game lore, or perhaps the open world, its various game modes and quests. Adding those details should make the project sound more informative and fascinating, at the same time celebrate the creativity and dedication of the proposer to the project.\n\n", "q0r": 3, "q1": "From the road map the proposer laid out, I do believe that the whole project will be met with success should everything work out accordingly as the road map itself is quite detailed and informative, and the requested fund seems reasonable enough. The future seems even more certain when what the project members are capable of is taken into account. The only recommendation I’d make is that the detailed budget breakdown section should work better if all branches include their time frames rather than just two of them.\n", "q1r": 4, "q2": "i agree From the road map the proposer laid out, I do believe that the whole project will be met with success should everything work out accordingly as the road map itself is quite detailed and informative, and the requested fund seems reasonable enough. The future seems even more certain when what the project members are capable of is taken into account. The only recommendation I’d make is that the detailed budget breakdown section should work better if all branches include their time frames rather than just two of them.\n", "q2r": 3, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3742, "q0": "Basically,  I found the proposals met the challenge. It focuses on increasing the users of the game developed under the Cardano Ecosystem, thereby helping to expand the NFT knowledge of the gamers. However, since the description for the proposed solution is quite short, I can only understand Pangea Kingdom in general, not too clearly. It would be better if the writer could describe the main activities of this game more clearly.\nBesides, the solution part is not really detailed, the writer only lists two main activities that the team has performed. If some future plans to address the risks could be listed here, this section would be more complete.", "q0r": 4, "q1": "With the current road map, the project can meet the outline. I am pretty impressed and believe in the members involved in this project. The team members are knowledgeable and have many years of experience in the gaming field. The member profile like Twitter is also updated. However, because this project is developed under the Cardano Ecosystem, It's would be better if there is member with much experience in the blockchain field. In addition, I think the writer needs to outline a smaller roadmap for the first year: have monthly goals and plans for readers to have a clearer picture of the implementation process.", "q1r": 4, "q2": "For now, The proposal shows the development of the project and the completion goals as creating the community of like-minded humans and harnessed. The way project progress is measured and its development is described in pretty detail. Tools and ways for the community to monitor the project are also mentioned. However, it would be great if the writer should provide a clear and quantitative final result for the reader to easily follow and compare during implementation. ", "q2r": 5, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4044, "q0": "The game project proposed in this proposal is quite compatible with the challenges. The game is developed under the Cardano Ecosystem and the Unity Engine, both of which are good platforms for game development. The Unity Engine is a cross-platform game development tool that can help players play on phones or computers, so this helps to reach more people to the game. \n        The idea of the game helps players to own NFT assets, breed NFTs, exchange cryptocurrencies and these things help players enjoy the game while generating income for themselves. \n        The team has a specific goal of how many players they want in the first year. They want to see players create stories about the game that will help them measure understanding of non-fungible tokens. Game stories like this will be widely spread and the number of people who know the blockchain will increase and participate in the Cardano system.\n\n        They point to two existing problems such as the lack of marketing costs and the misunderstanding of NFT. They also offer a marketing solution that is the least expensive but requires effort in getting public information about the project and helping people understand the NFT. So they also developed the Discord group and now it has more than 800 members. \n", "q0r": 5, "q1": "The team provided us with a description of each member so that we could get to know them and understand their work on the project. They have members with quality experience in software using the Python programming language, Unity game experience, or marketing. They are all assigned clear job positions. Their skills give them more confidence to make the project more successful if supported by the community. \n        The team gives a clear schedule with each month what will be prepared and completed. This helps participants follow the project's roadmap more clearly.\n        As for the budget, the team has clearly divided costs into parts to build the project. In my opinion, if the team can provide more details on what to do in that section plus the cost, it will help the reader to track the costs better.", "q1r": 4, "q2": "In this section  the team talked about how they track project completion and the tools they use explicitly. \n\nThey have the goal of wanting everyone to develop together despite their different cultures, to exchange and to have their own NFTs.\n\nHowever, the team should come up with KPIs data to measure how the project is achieving what it intends to do. \n The team is still communicating with the community via discord and this is pretty good to let everyone know the project is still under construction. \n", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4471, "q0": "The NFT  functionality is quite amazing and corresponds to the challenge setting. However, in order to assess the game's attractiveness level and so get more players, it is vital to address more about the game's features. I recommend that the team additionally give information about the NFT exchange structure or the rewards won in the game. Numbers and key performance indicators (KPIs) must be presented to demonstrate that the game is superior and unique from others. Involving fans in submitting ideas is a smart way to promote engagement with the game, and it will also be an excellent word-of-mouth marketing technique. Building an ecosystem that has the same features as the Meta version can be an opportunity as well as a challenge. We can learn the highlights from the Meta, but it's difficult to keep up with the release's success; we also need breakthroughs to draw players and separate apart from the Meta. The issues have been recognized and partially overcome in reality, but more solid proof of how much of the problems have been solved by those solutions will be required. Simultaneously, there will be additional challenges in project implementation, such as human resource management, market changes, and so on. More technical explanations and solutions will be required to assess the impact of this initiative on the intended audience.", "q0r": 3, "q1": "The proposal currently includes a raw plan and timelines, but we encourage that you go into further detail on how you will manage and deliver the project. For example, what measurements or key performance indicators (KPIs) are utilized to ensure that the project meet the schedule requirements? How do you determine quality measurements? What programming languages are used for website development? How do you intend to conduct advertising campaigns? The precise plan that we require includes not only the work that has to be done, but also how you accomplish it, as well as the techniques and means that you will use for implementation. You must clearly indicate how those expenses will be split down and used for each work in the proposed budget section. For example, $5,000 is mentioned to be used for security, testing, and optimization in four weeks; is this simply remuneration for team members or does it include operating costs? And how is this salary determined? How many staff are there? And how many hours a day must they work for four weeks? Thank you for providing information on the team members; however, is this your full team? Is it necessary to hire someone else? These people are all accomplished in their respective industries, but we will need a few more references, such as LinkedIN profiles, to validate them.", "q1r": 3, "q2": "It is good that the team mentioned their Agile methodology and other tools such as Nuclino, Github, Google Workspace for us to verify their auditability. We will also need some reports with clear metrics of the project process. Or even more, an estimation of user gaining, gamers feedbacks, traffics on social media that can leads to a stable proof of Cardano growth. The team’s vision on success is clear and focused enough to know that the team understand the challenge setting quiet well. All of their targets can contribute to increasing ADA usage and enjoyable gamer experience.", "q2r": 3, "assessor": "z_assessor_1726", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5339, "q0": "Although NFTs have gotten much attention in the blockchain space, NFTs have not been adopted successfully by the global gaming community. The team has identified this problem and wants to address it with their Battle Royale game.\nThe game specifications and the preliminary game design (as seen in the Youtube video) sound and seem intriguing and could potentially attract new gamers that are used to nice graphics and well know battle royale games (like e.g. Clash of Clans). By educating traditional gamers about CNFTs, exchanges and trading crypto assets, the team wants to facilitate the onboarding to Cardano and blockchain games. Unfortunately, no detailed information is provided on how the educational aspect will be achieved. It would have been helpful if the proposal had highlighted some of the ideas at this point. \nWhile educating people on these exact topics is the right way to attract more gamers to Cardano, I am not entirely sure how this connects to the game itself and the comparatively high funds requested. \n\nOverall, I don’t think that the game by itself will be enough to onboard new gamers since traditional gamers commonly lack knowledge of NFTs, their use cases and general knowledge on blockchain systems (wallet creation, private keys and so on). Thus, a stronger emphasis on the educational aspect would have made the proposal align more closely to the challenge and consequently would have increased its impact.\n", "q0r": 2, "q1": "The proposal outlines a relatively detailed roadmap for 2022 with many features and aspects. The game launch is expected to be in Q3 which might be possible to achieve as some of the developments are ongoing. However, this is still a very tight roadmap given the complexity of battle royale games and the major marketing efforts required to promote the game. \n\nSince 500k USD will be funded in this category, the requested budget of 100k USD seems quite high for one project. The team should consider reducing the budget to increase their chance of getting funded. As the proposal has indicated a main focus on educational aspects, the low marketing budget (4k USD) is a bit confusing and not in line with the earlier statement. Speaking from experience, reaching masses, and educating them requires a lot of effort and money. \n\nDue to the strong technical capabilities of the team (several engineers with many years of experience in game development, full stack development and game design), I believe the implementation of the proposal might be possible. Nevertheless, the requested funds are too high for this round and not enough funds are allocated to the educational aspect which was initially stated to be crucial for the success of the project.", "q1r": 3, "q2": "Several productivity tools (like Github, Gitbook) will be used to efficiently collaborate, organize the project, and track the developments. The link to the Github repository is provided. In addition, weekly progress reports will be used to track the progress. It is not stated where these reports will be published. Although no milestones were defined in this section, I assume the roadmap (outlined in section 2) will be used to audit the project’s developments. \n\nNo clear KPIs are indicated based on which to measure success. The development of a thriving and diverse community is of course appreciated and important, but cannot be used as success metric since community members are not necessarily active users. Overall, the technical developments of the proposal can and will be sufficiently audited. However, success metrics are not clearly defined, thus making it difficult to assess the success of the proposal.", "q2r": 3, "assessor": "z_assessor_1939", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5961, "q0": "The proposing team aims at developing a NFT Battle Royale game, called Pangea Kingdom, that will include CNFTs and breeding, besides having its own cryptocurrency called $PG. This proposal is clearly aligned with the challenge since it proposes the creation of a new game and to bring new players to the Cardano ecosystem. Unfortunately, the proposer didn’t add much information about the game itself, besides explaining about it just in a high level and mentioning its goal of number of users in the short term. I would like to see more information about the game itself, the history behind it and how they would measure the impact of this project. Ideas that could be added here: since this game is part of Pangea Games, is it going to integrate with any other games in the platform? The currency is going to be exclusive the ‘Kingdom’ or will it be used in other games as well? The CNFTs are going to be characters, items, land...? Is the game going to be a real time, or turn-based? What is going the be $PG tokenomics? How is it going to be used? Answering these questions would really help to increase the understanding of the impact of this project.", "q0r": 3, "q1": "The road map of this proposal is presented in quarters, at least Q1 and Q2, there’s a 3rd stage that’s not clear if it’s just Q3 or Q3 and Q4. The first quarter has some milestones that would require funding, although if funded they money will be received only in Q2, so this could affect the feasibility of this proposal and the development might be delayed. It also mentions the release of road map in Q1, which I believe would be for the whole project and not only for this proposal, because there would be an inconsistency in this case. The milestones of the other quarters/stages are clear, and it also includes a game expansion in 2023, but I believe this is not part of this proposal and this information should be highlighted, because if not, when being audited, this could be required. The budget is described in a high level, and it seems to be adequate with the proposed development. The description of the team is good, and their experience seems to be enough to deliver this proposal without much problem. They provided social media links to almost all team members, and shared their past achievements, which cannot be easily verified but gives an indication of the team’s ability.", "q1r": 4, "q2": "I believe the proposer has not understood the auditability section, at least partially. The idea is to inform how the community will be able to audit the progress of the proposal, instead of just its internal management. They seem to be well organized, but they should have presented ways for the community to see the progress, which is going to be a condition, in the future, for funds to be distributed. Some metrics and KPIs should be added to this section, for example. The definition of success is clear, although it’s very ambitious when it states that the idea is to ‘help us look past out differences and join humanity as one’. I believe that, unfortunately, this is not achievable through a game only. It would be good to add here as well some way to measure the success of this proposal quantitatively.", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8450, "q0": "The proposal addresses ideas about playing Pangaea game to increase NFT adoption developed under the Cardano Ecosystem and Unity Engine. As far as I'm concerned, there are some projects having similar idea of creating games. However, there are not many teams that could show their project clearly and easily to understand for community like this project. This game not only contributes to the entertainment industry but also brings benefits for players to own NFT assets which creates an ecosystem for NFT exchange. If successfully, this project could help NFT technology more common among members. ", "q0r": 5, "q1": "I appreciate the feasibility of this project as it shows a very clear and detailed plan when the proposer breaks down its timeline into three phases during the year. Each phase would deal with some particular jobs. Moreover, the project has a very qualifed and experienced team members which could be checked on Twitter and Discord. Also, Also, they shows their vision of creating a thriving and safe community where players can communicate, play games and store NFTs. In addition, the proposer shows required budget for complete jobs, but I would like to see a little bit more explanation for these expenses. I hope this project could get funded and supported from the community. ", "q1r": 5, "q2": "The proposer shows a very strategic and efficient way of executing and tracking this project. By  seeing their weekly reports, semi-weekly standups and snapshot of achievements on mood board, community could have the lastest updates on the progress of the project. The team also makes use of Agile methodology to organize tasks and Gantz chart to visualize projects. Also, the team cooperate using other tools such as Nuclino, Github, Google Workspace,Trello. They shows their seriousness and confidence in this project. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8829, "q0": "Seeing the intentions and construction of this project so far, it seems like the type of game that would appeal to a significant amount of people.  The art is attractive and the examples are agreeable and interesting.  I believe it likely that gamers would find this project enticing.  Strongly suggest proposers put a link to their actual website as I didn't notice it here and had to search to find it.", "q0r": 5, "q1": "Based on provided information it appears the developers of this game have considerable skill and have already built the project to a significant degree, as well as their community.  It seems very likely they could bring this to a successful implementation.", "q1r": 5, "q2": "Auditability section is weakly written.  It mentions Trello and other collaborative tools which would greatly ease auditing progress, but as a whole they need to provide more links to these resources so they can be looked at, as a significant amount of funding is at stake here.", "q2r": 3, "assessor": "z_assessor_708", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Pangaea Kingdom’s solution is to create an interactive play-for-fun-and-earn concept which is the Social-GameFi.", "experience": "More than 7 years of experience with Ubisoft and MicrosoftMore than 5 years of experience on Unity Game EngineMore than 8 years of experience with MarketingFormer Digital Manager and Marketing Team of Bondex AppPreviously worked for NotScared, SeeAlgo,Four Pillars Ent"}