{"id": 397499, "author": "alfred.pham", "title": "HQ GRAPHIC FOR MIVERSE METAVERSE", "url": "https://cardano.ideascale.com/a/dtd/397499-48088", "category": 26440, "amount": 78120, "description": "Play-to-entertain gamers hate NFT game graphics because it's terrible, that's one of the reasons why they don't want to play NFT games", "f6_no_assessments": 8, "f6_rating": 4.291666666666667, "videos": ["https://www.youtube.com/watch?v=wpm7uZ1b40E ", "https://www.youtube.com/watch?v=ojOanrFLqqY ", "https://www.youtube.com/watch?v=c7qKtaDt7q0 ", "https://www.youtube.com/watch?v=9xhCe6eaT6o ", "https://www.youtube.com/watch?v=RIjBlnbxNKQ&t=23s", "https://www.youtube.com/watch?v=DxKtSamw_GI "], "media": [{"title": "Proposal summary page", "url": "https://miverse.io/one-page-proposal-catalyst-fund-8/"}, {"title": "Art Concept Examples", "url": "https://www.artstation.com/artwork/6aGm0N"}, {"title": "Art Concept Examples", "url": "https://www.artstation.com/artwork/ym38R"}, {"title": "Art Concept Examples", "url": "https://www.artstation.com/artwork/Oy2k1k"}, {"title": "Proposal summary page", "url": "https://miverse.io/one-page-proposal-catalyst-fund-8/"}, {"title": "Art Concept Examples", "url": "https://www.artstation.com/artwork/rRaAo2"}, {"title": "Project summary in one page (Japanese)", "url": "https://miverse.io/one-page-proposal-catalyst-fund-8-jp/"}, {"title": "Infinitive benefit loop for gamers in Miverse multiverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-Gamers-28ede2.png"}, {"title": "Infinitive benefit loop for developers/game makers in Miverse multiverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-dev-f90525.png"}, {"title": "Infinitive benefit loop for investors in Miverse multiverse ", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-Investors-289a3f.png"}, {"title": "Infinitive benefit loop for content creators in Miverse multiverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-Creators-fb3a86.png"}, {"title": "Main activities in Miverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Activities-483084.png"}], "f6_assessments": [{"id": 1487, "q0": "Graphic design plays an important role in success of a game. Besides graphic design, game story and marketing strategy are also crucial to make a game successful. This project is part of Miverse game project. I think this proposal is a good supplement for the big project", "q0r": 5, "q1": "Unicorn studio portfolio looks impressive. I really like their graphic design of characters and game items in their launched game. Team qualification in game graphic design is undeniable and their Miverse game project looks very promissing. I would like to appraise the team for a very well documented project. Each phase contains very detailed small tasks with weekly timeline. Project documentation shows the team's professionalism on this work", "q1r": 5, "q2": "This propostal is a part of an ambitious game project which is planned for 2 years. The deliverable outputs are described comprehensively and detailed cost break down in a monthly basis for auditability. I think they did a very nice job writing a very elaborated project documentation.", "q2r": 5, "assessor": "z_assessor_1385", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3352, "q0": "The team’s solution has been described in detail. They first provide a useful introduction to their project (MIVERSE & GRAPHIC), which allows the community to have an initial overview of its background. Then, they identify their main targeted groups (play-to-entertain gamers) and the beneficial impacts of their project on specific targets. By clearly determining these targets, they will be able to shift their focus on the key areas and ultimately achieve their goals, which are designed to expand the Cardano system through their project. The community can easily assess the impact and effectiveness of their Miverse by closely following these expected results. \nThe key metrics and project objectives are presented respectively, providing the community with reliable sources to track and review the progress and development of the project. They also ensure these metrics are well aligned with the challenge KPIs. the community can use these specific indicators to evaluate whether their deliverables can address the posed challenges and at what level.\nThe main challenges that they have to confront are well portrayed. They also propose a strategy to address these issues, keeping them stay proactive in the operation process. The community can base on this to assess their risk management and their ability to prevent any failure. There will be constant updates about the plan on the additional file attached to the proposal.", "q0r": 5, "q1": "A clear roadmap and milestones during the duration of the project are indicated in the proposal. For each period of time, they highlight what exact steps that need to be accomplished and also update the current status òf some activities. They also divide the project into 3 main phases, allowing the community to clearly understand their plan and development orientations. The community can apply this framework in their evaluation to track and follow the team’s way towards achieving the set goals. All the information is also written in a concise form and is very easy to grasp.\nTheir budget breakdown has been built according to the action plan, thus ensuring transparency and rationality. They explain clearly how they spend money in this phase of the project (Q3/2022). Although they only present the summary of the operation cost, that is adequate and clear for reviewing their financial allocations. For further information and a more detailed budget breakdown, the community can access the file attached to the previous part of the proposal. \nThe team members are well illustrated with specialized skill sets related to games, blockchain, and marketing. All the information including names, positions, working experiences, and contact information are covered. The community can base on this information to examine their potential of running this project effectively and bring in the promised outcomes. ", "q1r": 5, "q2": "The key metrics and tools are proposed for the track and trace process. Viewing these metrics, the community can easily assess the project’s development and success. Besides, the community can take a look at the reference link and their website to get a clear picture of the measurement and ensure the team is on the right track.\nThe project’s goals in 3 months are firmly set with specific numbers, which describe a clear vision of success. By focusing on these goals, they will stay motivated and put their efforts in the right place. Also, these numbers can help the community identify the degree of the project’s success and its sphere of influence. \n", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3565, "q0": "My initial impression of this proposal is how well-detailed every single section is, though there are some grammatical errors, I still have quite a firm grasp on the overall concept of the game. It’s not everyday that you come across an idea for a 3D Metaverse game revolving around the galaxy exploration theme, which is quite fresh and unorthodox. The game features a wide number of assets and domain, which is guaranteed to come with eye-opening graphics and, more interestingly, having a game is not the only branch that this proposal plans to reach out to. The target audiences are varied from casual players to skilled developers and creators, which I believe to be valid to this project. One detail that I find quite pleasing is the full listing of KPIs and metrics used for measuring the project objectives, and It is really nice of the team to assure that those metrics all align with those in the initial challenge setting. The proposal also notes down a number of potential issues that the project may face during the execution, accompanied by solutions for each, though I’m not quite sure the solutions will be fully effective.", "q0r": 5, "q1": "Even though the presented road map, timeline and milestones are meant for the whole project while this proposal only applies to the art development, I feel like congratulations for the team are in order since they have done such a well-done job whipping everything up. Otherwise, focusing on the part which will be pitched for budget funding, which is Q3 of 2022, all listed tasks seem relevant to the process, though I don’t have much expertise on this regard to actually weigh in. The requested budget sounds quite reasonable, given that this stage involves professional artists to carry out the process. All key team members of this project are properly described in detail, followed by affiliated links to further verify them (there’s also another link at the end of this section that leads to a PDF describing each member’s capabilities, which is very appreciated).", "q1r": 5, "q2": "In terms of clarity, I believe the team has achieved a certain level of it, as seen through the use of GitHub, Google Docs and their own website for the public to keep track of the project. And desired the milestones used to describe the envisioned success are closely related to what the team has set out to achieve. Nevertheless, I feel the need to emphasize that this section doesn’t include the advantageous end result for Cardano, which to me is a pivotal feature for the budget approval.", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3743, "q0": "I believe the proposal aligns well with the challenge.\nThe impact part of the project is well written and easy to understand.\nThe features and concepts of the game as well as the game's outstanding features for each audience with different purposes are also explained in detail.\nThe author also uses many quantitative KPIs (Total users of play-to-earn & play-to-entertain gamers, amount of value made by gamers in play-to-earn, number of CNFTs made, number of fungible tokens made...) and describe the specific project's goals.\nThe 5 main risks are also thoroughly analyzed and reasonable solutions are given.", "q0r": 5, "q1": "I believe the proposal will meet the outline well because of the following reasons:\nA whole feasiblity part is well written and reasonable. All sections have detailed files attached for readers to refer to.\nRoadmap is detailed and divided into 4 phases lasting from Q4.2021 to Q1/2023. The detailed technical process is also well analyzed and easy to understand.\nThe budget is properly allocated into many sub-sections under each work item, the costs for each of these sub-items are described quite fully.\nThe author also mentions information about 3 main members and main partners (Unicorn studio) with full information about experience, outstanding achievements and attached detailed profiles qua social media as facebook, LikedIn, Twitter.", "q1r": 5, "q2": "Proposal is providing all the necessary information in the auditability section so that the community can monitor and evaluate the project's progress after being funded.\nProposal provides a detailed estimated roadmap so readers can compare and evaluate actual project progress. Readers can do this tracking through the website: www.miverse.com with information about roadmap for users, release information, guidelines for developers, ...\nThe success of the project is clearly described by specific KPIs such as the number of ships and ship parts, the number of NFT character design, assets on map and items, battlefield map and the number of subscribe to youtube channel.", "q2r": 5, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4111, "q0": "To solve the problem of poor graphics for gamers, proposals came up with the idea of ​​creating Miverse to provide the entertainment industry with high-quality games but also invest in graphics. Personally, I think this is a very good idea and has the potential to accelerate the development of the Cardano ecosystem.\nThe proposal introduces in detail the concept of the project. This gives the viewers an overview of the project so it's easy to see the project's impact on the community. The proposal also outlines the audience the project is aimed at and also outlines how the project will affect each audience. Miverse features are also covered by the team in the proposal in technical detail.\nThe project's general KPIs are geared towards the key metrics of the challenge and completely match. Going more specifically into the KPIs that the project sets, each stage has specific KPIs. These KPIs are closely related and based on the main key metrics of the challenge. The proposals were also explained very clearly and in detail to each part, each stage. This shows that this will be a project that will have a direct impact on the Cardano ecosystem when it is completed.\nThe biggest challenge that the project poses for the team is also the point that the project wants to improve to improve the user experience, which is the graphics issue. The team has researched deeply and gradually come up with appropriate solutions to gradually improve this point. In addition, investment is also a challenge for the team. They have also made plans to allocate and call for many sources of investment capital as a measure to prevent risks from occurring.", "q0r": 5, "q1": "Roadmap of the project is presented concisely and fully detailed by the proposers. Attached is a specific roadmap so that viewers can dig deeper and have a more detailed view of the project's progress. Roadmap breaks down into milestones with actual timelines to complete the set work items. The roadmap summary should clearly state both technical and technological requirements for the proposed work items. This way the viewers can more easily evaluate the results of the project. The strength of the proposal is that it has suggested strategies to accomplish the set goals. Strategies are presented in stages and each period is very specific.\nThe budget plan proposed in the proposal is for the third quarter of 2022. The budget plan is very detailed, giving reasonable numbers for the items to be invested. The budget presented is easy to grasp by breaking it down and corresponding bullet points for each investment item. In general, the plan that the team builds has a lot of potential to achieve the set goals.\nThis project is jointly implemented by 3 companies in 3 important areas contributing to the project construction. The team leading the project includes members with extensive experience as well as specialized knowledge and skills. Their profile provides the necessary information to be trusted to bring the project to completion according to plan and goals.", "q1r": 5, "q2": "Quantitative indicators are clearly stated in the attached files so that the community can easily assess the success of the project and check the progress of the project regularly. However, if possible, please present the quantitative indicators for this proposal in a concise manner so as to be less confusing when viewing the attached file.\nBased on Key metrics, it can be a specific number of users that the project will attract in the future or the amount of traffic that the project wants to achieve.\nThe criteria to evaluate the success of the project have been clearly defined by the products the project promises to release when completed.\nRelated proposals are also provided showing that the team is seriously implementing the set goals.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7527, "q0": "Very interesting proposal and the experience and resources presented are quite transpatent in approach and detailed on the strategic planning involved in such a large project. It would be interesting if proposer provided previous work or conceptual examples of the studio's plan with miverse, but overall I think that is in the plans for the first round of funding to make it more tangible for future funding opportunities. More clarity as in if its built on Cardano blockchain and the mechanism of connecting the solution to the blockchain.", "q0r": 5, "q1": "There is an abundance of experience in all the matters of the gaming development, planning and marketing. Didn't  see anything related with blockchain advisory panel or consultancy for the blockchain aspect of this solution, Andy shows interest in expanding and focusing on that industry but not clear if has had exposure in building on blockchain or plutus pioneer.", "q1r": 4, "q2": "The solution is quite huge and would take years to complete but the planning and management is very well documented in how to proceed with a comprehensive breakdown of tasks involved per stages of development. The funds allocated are quite modest and in par with the needs of the solution.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8091, "q0": "The HQ Graphic For Miverse Metaverse proposal addresses Gamers on-chained proposal by developing a 3D metaverse game. The proposal aims to make this 3D game attractive to both Play-to-Earn Gamers and Play-to-Entertain Gamers (main targets). There are many challenges for this project mainly about high budget and low adoption. From my experience playing 3D metaverse games, other metaverse gaming platforms are not really small as the proposer stated and their graphics are also high quality with active communities so the proposer might experience tough competition in this market segment and it will be quite hard to stand out without a unique selling point. It has high potential to bring in the gamers who care high quality graphics and will increase the adoption of Cardano among this group. ", "q0r": 5, "q1": "The project has been divided into 4 phases. The team won't try to sell NFTs to raise fund for the game but instead releasing the game for free then forming game features based on players demand. The entire project could take 1-2 years from the start to completion. As the proposer state in the challenge portion that they will need million or billion of dollars. The cost for this project only takes into account the art development in the third quarter of 2022. The monthly salary is set at $3000 for senior artists without specifying the number of hours worked on this project. There could be a budget hurdle to bring the project into completion. The Catalyst funding would only go towards part of their Q3 & Q4 art design and leave out game development itself for second round of funding or perhaps more round in future with no clear specific detail of budget allocation for other areas to alleviate this budget concern.", "q1r": 3, "q2": "The link they provided for track & trace the project require a \"click up\" sign up to view the files complicates the auditing process as the community might not want to sign up to the unknown platform. The proposer team should consider other venues for easy audit purpose. The proposer team has a clear understanding of challenge and offers a set of well planned actionable items and project development in phases. The proposal also offers the benchmark figures which reflect their definition of project success. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10611, "q0": "The proposal states that low quality graphics hinder the onboarding of gamers on to blockchain games. The solution to the problem according to the proposal is a high quality game with high quality graphics. However, based on my research on the proposal's past games, I have little conviction that the team could deliver what's promised. There is too little details on what the game will be, the Google sheets for the tokenomics is locked, and the team lacks evidence of their ability to deliver HQ graphics. In my opinion, this proposal does not address the Challenge properly.", "q0r": 1, "q1": "Unicorn Studios' website track record could indicate the success of this proposal.\n\nDragon Warriors's graphics does not seem any better than Axie Infinity or Crabada. It seems like a poor use of Catalyst's resources to devote a huge portion into HQ Graphics of MIVERSE. Furthermore, it is unclear if the game is in development or a dropped project. The same goes for Startverse. The Google Play and App Store buttons for Age of Empires and Horse Racing cannot be clicked. Fat 2 Fit has a 1 star review on not being able to open the game.\n\nI have little conviction that a game would be delivered at the end of the timeline. ", "q1r": 1, "q2": "The proposal includes a link to Clickup where the progress of the project will be shared. The website for Miverse, where the proposer says updates on the project will be shared, points to a clothing brand. There is a roadmap with timelines, but the deliverables at the end of the project do not warrant the budget, in my opinion. Cardano NFT projects have done more with less money.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Miverse will attract millions of play-to-entertain gamers in the mainstream gaming industry by not only great games but also high graphic", "experience": "Our core members are all entrepreneurs with more than 10 years in the marketing, gaming industry. We also have a development team of 20 developers, and a marketing agency with 10 core members to cover this project in the first phases"}