{"id": 398168, "author": "edwint", "title": "World of Pirates", "url": "https://cardano.ideascale.com/a/dtd/398168-48088", "category": 26440, "amount": 20400, "description": "Regular gamers don't believe in blockchain games, because these games are another way for game studios to get money from the players.", "f6_no_assessments": 13, "f6_rating": 4.512820512820513, "videos": [], "media": [], "f6_assessments": [{"id": 63, "q0": "Collectible NFT Cards in Chess RPG game i must say it sound really interesting, and definetly fits well in the Challenge.\nFocus on creating fun, free2play game with esthetics items. I like that aswell, sounds like casual player could fit well.\nGame has good potential to have impact, and bring new people to the ecosystem.", "q0r": 5, "q1": "Proposal has detailed plan, budget breakdown, challanges and risk informations. \nInformations about the team - 5 people, which 2 of them were in Plutus Pioneers program.\nAnd the website looks great.", "q1r": 5, "q2": "Proposal provide metrics to measure the progress, and development. We also have short, mid and long term success goals, and timelined roadmap", "q2r": 5, "assessor": "z_assessor_1038", "no_vca": 24, "ne": 2, "ng": 12, "nfo": 10, "vca_o": 1}, {"id": 1647, "q0": "The problem statement and the proposed solution go well together as they should. The proposal in the impact section further clarifies how the project will attract gamers in that the project/game developed will be reach in lore. The proposal goes in to detail on how CNFT’s will be used but also includes links to the site where they are displayed in the existing marketplace. The proposal provides brief input in future expansion, introduction of fungible tokens. The proposal identifies well with the existing Cardano ecosystem thus I feel if funded would add positively to the same. Another very positive aspect of the proposal is identification of existing / on-going fund-raising campaigns that the team is supporting, and are suggesting that the game/games will include aspects to make the gamers more aware of environment issues, yet another positive. \nThe project seems to be moving and growing in well thought out phases thus giving it more of a chance for overall success, this is further noted considering the team has participated in prior challenges, shows commitment to the long-term vision / end goals.", "q0r": 5, "q1": "The Team members identified is a good mix, including both managerial as well as technical depth. Having a member/s developing the code with experience in working with the Cardano ecosystem and the managerial / marketing guidance gives me confidence in success for the funding requested.\nThe proposal lists out key deliverables and estimation of how long each will take, also mentions that freelancers may be used to achieve the goal in addition to the core team.\nThe deliverables are not overly ambitious which gives more credibility to the expectations that they would be achieved in time scale promised.\nThe project greatly benefits from existing project web site links to actual in circulation NFT’s.", "q1r": 5, "q2": "The project has well-documented KPI’s, these are further sub divided in timelines and fit well with the deliverables to be worked. \nExample of auditing against key Metrix of the project might be via bi weekly presentation or call advising status of progress/completion, another might be a specific owner that community could reach out to get status or a webpage publishing the updates, the projects auditability would greatly benefit if such were included, that said the project notes and does have social media links such as discord, telegram and others, so could well publish its progress via those vehicle’s.", "q2r": 4, "assessor": "z_assessor_1395", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3570, "q0": "From my perspective on this project, I would say that It’s nice that the game will be geared towards a player-centric experience by integrating a fun yet competitive gameplay, no Cardano-based NFTs needed for entry and appealing rewards that can turn into a source of income. One feature that I’m personally in favor of is the main objective of this project, that is protecting and preserving wildlife, minimizing climate change and saving our planet. The target audience aligns perfectly with the aim of this challenge, which is to bring in gamers from the outside world into Cardano. And it’s a bonus feature to see a figure of a core metric being listed, specifically, the amount of CNFTs minted for this game. The team also manages to put forward a possible obstacle to the project, and surprisingly, followed by 2 viable resolutions to mitigate the obstacle. However, the only shortcoming that I must point out is that while this game is claimed to be, and I quote, “a fast turn-based strategy online card game”, there’s barely any details regarding the gameplay mechanism, lore and setting of the game, all of which I find to be crucial factors of a game that all players wish to know more of", "q0r": 4, "q1": "From the roadmap and timeline laid out by the proposer, I can see that this is quite an ambitious project, going so far as to host an Esports tournament of its own in 2024, and if should every steps of the process turn out accordingly, I have faith that this project will likely be able to generate desirable outcomes. The budget breakdown is quite detailed and self-justifying, and the total number sounds reasonable, given that it’s moderately less than previous proposals I’ve encountered. All members of the team are sufficiently enclosed with respective background, expertise and achievements, though I feel as if dedicated LinkedIn profiles or website links to further verify their capabilities could prove to be useful, and It’s a nice bonus to see the cooperation with outside freelancers. ", "q1r": 5, "q2": "As far as auditability is concerned, I believe that the team has yet to provide a method to track the project progress, so I would suggest the use of tracking tools such as ClickUp, GitHub or Trello for more convenient access and tracking by the team and the public as well. Nevertheless, the team does come up with a list of relevant key metrics to measure, and their 3 versions of success over different periods of time all deliver the desired outcome of the project and the benefits Cardano is looking for as well. That being said, while the SDG goals and related KPIs all point towards the improvement of the environment, which, don’t get me wrong, is a great and crucial cause, I would recommend that the proposer include Cardano in the mix as well, for the sake of long-term funding in the future. \n", "q2r": 3, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3747, "q0": "The impact part of this proposal is presented well and easy to understand. I think this proposal can address the Challenge by Bringing More Gamers to the Cardano Blockchain and Increasing the Total Users of Gaming Based on Applications Build on Cardano. KPIs are clearly shown in the proposal: the number of CNFTS made specifically for gaming, the number of fungible tokens made specifically for gaming, and the number of proposals submitted to this challenge. \nHowever,  I'm kind of confused about the connection between the game and the protecting environment. I think the writer can try to make this part clearer. \nFor the solution, The risks and countermeasures are also presented in detail. And it'd be better if the proposal has more information about the community team already built and the projects that the team is getting in touch with.", "q0r": 5, "q1": "The project has a good team as all 5 main members have many years of experience in related fields, including blockchain, graphics, gaming and other. It would be better if the writer could attach descriptive profiles of the members (attachment or profile as linkedin)\nIn addition, the roadmap and budget are being described quite briefly. There should be a detailed timeline with more specific activities based on the old slope. Thus, readers can visualize and identify the roadmap of proposals as well as the cost level for each item more easily.", "q1r": 4, "q2": "The writer has shown specific quantitative targets with specific timelines from June 2022 to December 2023. These metrics have been well provided so the reader can measure success. However, I have not seen any mention of reporting each time and how the community can track and check the progress of the project once it is funded. It would be better if it was possible to add ways to check the results of each batch according to the roadmap such as providing a certain tool or the official website of the project.", "q2r": 4, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4081, "q0": "A very well articulated and presented proposal that fit in perfectly with the challenge settings. The intention of the team is using an online cards game to bring regular gamers to Cardano blockchain environment which seems to be a very simple idea but in my opinion, it will be very effective, especially cards game is a very popular genre for gamers all over the world. Like most of the games, it’s free to play and players can decide if they when to invest on more game items. This is very crucial to get player to try a new project. Moreover, I like the idea of running a campaign to raise funds to protect wildlife, fight against climate change and such, it’s an ambitious idea, since the players will need to see that those efforts are actually taking place or it can backfire the entire project. I hope that the team can build connections with some decent organizations in those field and work it out. The team has a clear aims and KPIs aspect for each task that they are putting out. With the vision of the risks and potential solutions, this proposal will certainly not make the team overwhelmed in the long run. ", "q0r": 5, "q1": "The timeline of this project seems to be well designed and align with the idea. I’m very interested in the idea of an E-Sports tournament. I hope that the team already had an overall plan for that tournament and share more information about it. The budget breakdown seems to cover all aspects and steps that you have planned. However, in my opinion, it should have extra calculation for HR element such as salary and benefit for developers and other departments to keep the team running without a lot of changes in the core members. And last, I really appreciate the team’s effort to introduce the core team’s members with us and help people to understand your resources, experiences and potentials.", "q1r": 4, "q2": "I'm very satisfied with the auditability aspect of this project. The team has provided a cannot be clearer key metric to measure. The project has specific short-term , mid term and long term success, and they come with a clear aim in numbers for everyone to audit it from the get go until the end. It also will help the team to be able to constantly check in with every step, make sure that nothing gets lost in transition and have suitable adjustment if needed. With a strong commitment from the team, I have nothing else to say but a big good luck for the team and this project. ", "q2r": 5, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4271, "q0": "The proposer has given information of a fast turn-based strategy online card game – World of Pirates. The proposal has showed some characteristics of the game, as well as some benefits that the game will contribute. In addition, the team has described pretty well how their proposed solution will address the challenge, they mentioned what they would do which aligned with some key metrics listed in the brief of the challenge. They also have foreseen the challenges or risks that they might have to face. And the good thing is that they have talked about how they would do to overcome those risks. They knew what they were missing, what they need to improve and knew what they need to do to deliver the project successfully. And they haven’t thought of only one way to solve the problem. This is a good point.", "q0r": 5, "q1": "The team has provided detailed information of both plan and budget for the project. We can see that they have already made plan until the year of 2024 which is in 2 more years, this shows that they have thought carefully when coming up with the project and when writing the proposal. It can be also seen that their team members are those who has knowledge and working experience in the field of the challenge so that the game might be ensured to have good quality. Also, they said that they would work together with freelancers for creating the best game, I think this is a good move because the more people work together, the more ideas might come.", "q1r": 4, "q2": "Very detailed information of how the team would measure their project’s progress was provided in the proposal. They even listed out their short-term, mid-term and long-term success. And we can see that the criteria they mentioned aligned with the challenge’s key metrics. More than that, the team also talked about SDG goals, in which they even showed us the subgoals and their KPIs, showing how much effort and care they put into the project. As they have said, this is the 3rd proposal they sent to this challenge.", "q2r": 4, "assessor": "z_assessor_1714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4474, "q0": "Lots of highlights are found during this proposal. First of all, it comes up with clear missions-a good, free game for everyone and increasing people’s awareness of protecting our environments. Basically, this game has great features that will easily attract and keep people playing. However, I would like the team to provide the detailed game functions and systems to consider a higher score of possibility. Secondly, The team statement ensures to raise community awareness, it also hits on topical issues such as protect wildlife and our planet, or fight against global warming. For all the reasons above, this proposal kind of reach the challenge requirements since it is easy to attract attention and it also aligns with Cardano ecosystem, which is already well-known for projects with high humanitarian and community values. Move to the next point, the team gave a proven KPI with an impressive CNFT number (2000), it also comes along with the good content and joyful launched game, which will help us to maintain a low risk level. Moreover, with the experiences that already earned, the team will know how to deal with real risks and give the best solutions. Last but not least, they even know what they are missing in the team and suggest future companion with expert ones. To sum up, I strongly agree that the proposal has an extremely high potential to affect our ecosystem positively.", "q0r": 5, "q1": "Throughout the proposal, plans with timelines are given effectively. I love how the team listed the budget, very clear and reasonable. It is also a good match with the plans. Likewise, another selling point is all of the team member information are included with relevant experience. For a better consideration, I would like the team to add on the details of all tasks, break it down to week or month target with clear reports, they can also attach sales KPI for the report to be more persuasive. Furthermore, I would like to have the team member LinkedIn profiles to verify them easily.", "q1r": 4, "q2": "It is so great to see all of the realistic metrics to measure the feasibility of the project are given in an understandable way. A clear vision of success is described convincingly. The team has shown 3-year-long target to be reached with proven rate comes along. They also catch up with all the trending social media such as Tik Tok, Twister, Facebook and Discord, which will attract young generation-main target of the game projects. Just a small suggest, in order to put a stronger faith in this proposal, I would like to have the similar funded projects for the team to be included.", "q2r": 5, "assessor": "z_assessor_1726", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4773, "q0": "According to my understanding, the goal of this project is to (in the long term) produce an entertaining online free-to-play game that any gamer may play for free. I liked the overall concept, the project proposal, and the overall stated tasks and milestones, which seemed like a reasonable notion to me, not only for the desired investment value but also for the entire project proposal. Furthermore, the project's concept and design appear to be well-thought-out. The idea of this plan has a strong humanitarian flavor in that it attempts to limit the number of gaming firms who willfully take money from gamers. Furthermore, I would have loved to see more particular facts about the project's progress. The underlying idea and concept are fantastic, however additional detail is required for me to evaluate the proposal. However, in terms of impact, I agree that this idea adequately addresses the challenge.", "q0r": 5, "q1": "There is an outstanding description of talents and expertise; unfortunately, no links were supplied to verify the proponent's and team's skills and experience. I urge that you add some LinkedIn profiles to the team. The degree of detail offered in the \"\"project detail\"\" section helps the community comprehend the implementation procedures. The explanations of the budget items are likewise quite detailed, touching all facets of the budget.", "q1r": 4, "q2": "They did an excellent job of outlining the three phases, from short term (June 2022) to long term (December 2023), each with a concise overview of what would occur. The team went a step further by informing the community about what will happen in the short future, including recruiting, development, and research activities. Furthermore, the team outlines in detail what success measures they anticipate to have, which I believe are important, especially in year two because they will be the ones that have a concrete impact. The proposers have supplied enough information to assess the proposal's development and success. The roadmap will not only give checkpoints for the community to audit the proposal, but the key performance indicators will allow the community to audit the success of the final product. With the aim, there are good time-framed KPIs. The KPIs are more focused on the operation and the milestones to development/implementation, which makes sense for a project like this and ensures that all stages are covered and auditable.", "q2r": 5, "assessor": "z_assessor_1772", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5342, "q0": "Although the global gaming market is increasing year by year, a wide adoption of blockchain-based games has not been observed so far. A major hurdle are the comparatively high costs (often in forms of NFTs) that are required to start playing a certain game. \nThis proposal is addressing this problem by developing a free-to-play game that will attract more gamers to the Cardano ecosystem, by offering a low/non-existing entry barrier. Thus, this proposal aligns well with the challenge. As the proposal states, a major focus will be to make this game as enjoyable as possible without the need to buy expensive skins or skills (as often seen on other gaming platforms). The in-game rewards (CNFTs or consumable items) could potentially keep the gamers attracted to the game ecosystem (and Cardano) and encourage them to learn more about Cardano and the blockchain technology. Consequently, if successful, it could help onboard more gamers onto the Cardano game ecosystem. \n\nDespite addressing the challenge closely, an important factor that should be kept in mind, is the community building process. Although the team has stated this in the proposal, I suggest the team to put a stronger effort into this, as community building efforts can be decisive in the onboarding of new gamers and especially blockchain beginners.", "q0r": 5, "q1": "The timeline for the different types of developments seems vague to me, as for instance the release of the beta version is stated to be between Q1 and Q3 which implies a time frame of up to nine months. I would have liked, if the proposal had given additional information on the available functionalities of the alpha/beta release, respectively. It is also not clear, whether the alpha version will already be playable (and importantly enjoyable). More information on the onboarding starting date and detailed descriptions of this process would have made this part of the proposal complete. \n\nThe requested funds are reasonable for the respective hours, although I am unsure whether the stated working hours are enough. Out of experience, AI development and a fine combating system take time and I am not entirely sure whether 120h are sufficient. However, it might be that the team builds on available code/knowledge, consequently reducing developing time required. Moreover, the fairly diverse team might be experienced enough to stay within the indicated hours. Overall, the team has experience in different fields including web development, blockchain development, marketing, art and entrepreneurship.\n\nAltogether, I am not entirely sure whether this project can be implemented within the stated time frame. However, I believe that with certain strategical modifications it might be possible to implement it the successfully.\n", "q1r": 3, "q2": "The proposal provides several metrics based on which progress can be measured. Most of them, however, seem a bit vague and do not actually measure the technical development of the project. Updates, reports or code (e.g. Github page) should be included to allow auditing the progress of software developments. \n\nMost of the KPIs provided rather focus on community building. Here in particular, it should not be entirely focused on absolute numbers (due to bots for instance). Unique engagements on the different social media platforms are a much more robust measure to assess community building efforts. The success metrics are stated clearly and also include many more technical aspects, based on which success can be measured. A specified number of total active users should have been included, as eventually this metric will determine long term success of the game. \n\nAltogether, the proposal provides several points based on which progress and success can be audited. However, certain key numbers are missing and information on technical progress updates is lacking.", "q2r": 3, "assessor": "z_assessor_1939", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6248, "q0": "Awesome graphics and beginnings of what looks to be a great project and game. Pirates is indeed popular, and there are many past game mechanics from past games like Sid Meier's Pirates. The progress makes me fairly confident this is not a rug pull. Not that I get a sense that this project is, but this is sadly popular in the NFT gaming world. The passion is evident in the artwork and progress, and so there seems to be more \"soul\" behind this that a rug pull would not have.", "q0r": 5, "q1": "The crew (links hopefully of use for CAs):\nEdwin Tuzar - Founder of WOP\nhttps://edwintuzar.com/\n\nAlicia Mehlich\nhttps://aliciamehlich.wixsite.com/aliciamehlich\n\nTorben Poguntke - software developer\nhttps://www.linkedin.com/in/tpoguntke/\n\nPraveen Pinto - Serial entrepreneur\nhttps://www.linkedin.com/in/praveenpinto/\n\nCristian Iordache\nhttps://www.linkedin.com/in/cristian-iordache-b445a1/\n\nhttps://edwintuzar.com/\nEdwin Tuzar | Portfolio\nWET Portfolio\n\nEdwin Tuzar | Portfolio\nhttps://aliciamehlich.wixsite.com/aliciamehlich\n\nThis appears to be a team that fulfills the wide diverse needs of a game development team. They have presented aesthetics as well as some technical details that gives me confidence in giving five stars.", "q1r": 5, "q2": "Good presentation materials, websites, and with links: routes to their portfolios and LinkedIn pages. Their main website merits a visit and for CAs to explore more than what they have in their proposal, although there should be enough info in it alone to see good progress on this project already.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7035, "q0": "The proposal addresses the challenge as it aims to deliver a  free to play game with optional buying items.\nPart of the revenues for NFT purchases on the game will be used to help the planet (sustainability projects).\n", "q0r": 5, "q1": "\nThe team members did not provide any reference of their linkedin profiles/webiste, but they provided a working website with a marketplace for collectibles already in place, showing that they have the right expertise to lead the project.\nRisk mitigation is in place: as the team might not get enough resources they are planning to hire two failure senior game developers with expertise in the areas we are missing (3D Modelling, Sound SFX) and planning to use tools to test the concept, design, and later on the game that big companies are using, by getting in touch with these projects and getting startup/indie studios discounts.", "q1r": 4, "q2": "The team explained the game concept in a youtube video https://youtu.be/CHXI_MBLCRs \nThe team offered a precise budget breakdown and outlined a top view timeline with quarterly checkpoints until 2024, and a more detailed timeline based on KPIs until december 2023. \nAmong the objectives for december 2023 there is reaching 2000 installs (mobile app), increase the community members ( 10k+ Discord users, 100k+ Twitter followers, >5M social engagements), sell more than 5000 NFTs.", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8350, "q0": "Yes, it does address the challenge. The concept seems interesting, especially as players can participate in game for free and in later stages can buy NFTs if they find it interesting, nothing is forced. The game itself is nice, seems to have good potential. Additionally the idea that part of the funds will be given to preserve the oceans is a nice touch and what in general in Cardano community spirit.  ", "q0r": 5, "q1": "The team involved seems to be experienced and deeply involved in the project. They have participated in previous Fund, meaning they have experience with community. Web page is already available and as can be seen some NFTs are already sold which is a good indication of the progress of the project. Idea of the game seems to have potential.", "q1r": 5, "q2": "The KPIs are nicely explained, the progress of the game and number of people in the community involved can be monitored over social media and by NFTs sold. Which as I mentioned is already happening. Which is an indication that project is heading in good direction.", "q2r": 5, "assessor": "z_assessor_672", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8686, "q0": "The proposal is about providing online fun for the gamer without the gamer paying anything. No new gamer pays NFTs. The proposal is focusing on creating a fun that any gamer will love to play to win points and get rewards in the formof NFTs. The proposers believe that the earth needs to be cared for so they run campaigns to raise funds to protect life. If gamers are increasing then the gamers will be aware of their surroundings and problems they were not seeing before. \nIn addressing the challenge, they will be bringing more gamers to the Cardano blockchain and increasing the total users of gaming based on applications built on Cardano. Their focus is on gamers who are not familiar with crypto gaming but want to bring them on board. \nThe main risk in this proposal is the need for more resources to develop the game. But their solution is to invest in knowledge and their own money in the game. \nThis is a laudable proposal and I rate 4 for their effort. This proposal can impact positively in the future. ", "q0r": 4, "q1": "The plan provided is detailed informing us about different periods for specific activities, Q1 2022 is for concept and game design; Q2 2022 is for prototype development etc. Q3 2022 is for Alpha version development ; Q1 and Q3 2023 for beta version and Q4 2022 Q1 2024 for final release. This is a long term project that may need other sources of funds other than the Cardano Catalyst fund. \nThe budget presented is well detailed and broken down into costs of Playtestcloud.com, video token, etc. \nThe team is made up of 5 people with experience of many years in web2 and web3 development. blockchain, illumination and art concepts, startup growth, Their names are Edwin Tuzor(Founder of WOP, Alicia  and Torben, to mention a few. With all this essential information, it is likely this proposal can be implemented successfully. I gave 4 star rating.", "q1r": 4, "q2": "The road map for progress is outlined in the proposal as how many NFTs are sold; new followers on Twitter; how many engagements on social media; new members on Discord and Telegram, etc. \nTo measure the success we will look at the game  prototype built on Cardano blockchain wallet integration, increased community members (Discord 1000 users; increased number of engagements in social media; increased awareness of Cardano . ADA, NFTs. The success metrics are divided into 3 terms; short term success in June 2022, Mid-term success in December 2022, and long-term success in December 2023. All this information is sufficient for successful auditing. I have given 4 star rating for this laudable proposal.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "World of Pirates puts the gamer first by providing a fun online free-to-play game, that any gamer can play without paying a dime!", "experience": "We are a small indie studio with 60+ years of experience in areas like web development, blockchain development, game development."}