{"id": 398534, "author": "openlittermap", "title": "Gamifying Littercoin (Take 2)", "url": "https://cardano.ideascale.com/a/dtd/398534-48088", "category": 26440, "amount": 50000, "description": "About 1 billion people have powerful devices that can collect data but we have yet to unlock our data collection capacity by making it fun", "f6_no_assessments": 8, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"id": 375, "q0": "We can indicate that this proposal presents an undoubtedly innovative idea, and the path indicated by it to make this innovation actually happen also fits the goals of the challenge. One of the main differentials and positive points of the project is having a database and work already carried out to support what is intended to be done here.\n\nThe central idea of ​​gamifying the use of the database by creating a new mechanism to provide information on pollution and, at the same time, rewarding users for this with their own currency, confirms the innovative nature of the proposal. The impacts brought about by this proposal would be more effective in the long term, with indications of locations running environmental risks becoming more abundant; also in this context, we have the use of Cardano technology, in the universe of games, to increase its influence.\n\nHowever, all these positive points are considerably impacted by a lack of greater specificity about how this gamification of existing data will occur. We use the term ‘considerably impacted’ here because the requested budget, $50,000, is a very considerable amount, which makes us also seek a greater level of specificity of the steps to reach the objective.", "q0r": 3, "q1": "Regarding the detailing of the budget to carry out the gamification of the project, we were able to find some inconsistencies. As we seek to bring greater attention to the cause by applying gamification to the database, we believe that the development of the story behind this game should be one of the main destinations for capital allocation.\n\nHowever, we can see that only $5,000 is being earmarked for the development of the game's story, or 10% of the total budget. In addition, a clear proposal on how this gamification would be carried out was not presented. It would be interesting if some paths were traced and already indicated that would make the action of exploring data more 'playable'. Some possibilities for this would be the creation of a main character for the game (which could also be used to publicize the project) or indication of what other possibilities for exploration within the game would be, such as making friends with \"cleaners of the world\". Since the core of the idea is to increase people's interest in environmental issues through gamification, the 'game body' should be better constructed in advance. This even makes the amount of $25,000 going to LitterWeek a little inconsistent; why dedicate 50% of the contribution to the promotion of the product before it is more polished?\n\nRegarding the professionals involved in the proposal, they all seem qualified and able to carry out the work, a positive point is also the previous success in raising funds for the project in previous phases, which increases the credibility of the professionals currently involved.\n\nEven with these caveats, it is important to cite excellent ideas that were brought up during the proposals that have a great possibility of increasing engagement around the project. The idea of ​​users acquiring LitterNFTs as a reward for accumulating a certain amount of experience in the game and for participating in scientific discoveries are sensational ideas that bring great notoriety to the game and the cause around it. We noticed the presence of several concepts and ideas that, if better polished, will help the project to reach exactly the proposed goal.", "q1r": 3, "q2": "Regarding the ways to measure the success of the project, given the breadth that it wants to achieve, it is essential that plural ways to confirm the completeness and success are established. But what we see here does not match these expectations, and on the contrary, there is a lack of greater specificity about the only stated way of registering the scope of the proposal.\n\nThe spreadsheet to account for transactions and expenses involving ada and euro is important, since one of the central ideas of the proposal is to obtain the platform's own cryptocurrency as a reward for the environmental work performed. But several steps can take place before such a transaction actually materializes, and keeping a record of these steps seems fundamental to understand the initial steps of the project, and if the players are really engaged and bringing back the cause.\n\nIn this context, auxiliary tools to measure engagement around the game would be essential, such as looking for the number of daily references being made to the project on social networks (possibly using the hashtag search). Another good initiative would be the establishment of communities for the game on the main platforms that gamers use to interact, such as discord; this initiative is especially important because the evolution of a game is often linked to the engagement of its players' communities. As a positive point we can mention that the initial idea is to test the pilot project in Ireland, to later expand and reach other locations, which makes a lot of sense given all the variables existing in the project.", "q2r": 2, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2}, {"id": 3571, "q0": "From my basic understanding of the proposal, it would seem that the aims of the proposal include achieving mass adoption of users to the Cardano ecosystem through the game OpenLitterMap and the platform LitterWeek, aligning with the challenge setting. Nevertheless, I do notice that apparently only nature is reaping benefits from this project, so I suggest the proposer add more information regarding the benefits that Cardano may receive as well. \nThere are two features of interest to me mentioned in the proposal. Firstly, one of the target audiences that the project has in sight is school. Now I’m given to understand that “school” here means “schoolchildren”. If that’s the case, I believe that they have an increasing potential to become long-term users of Cardano, for children are likely to be motivated to act if rewards are to be granted to them, thus, they should participate in the project fondly. And even though they might be too young to understand the definition of a cryptocurrency blockchain, we could still have hopes that they would stick with the project long enough to get intrigued and gradually turn themselves to Cardano. Secondly, I’m in favor of the idea that Littercoin is a non-tradable token on any exchange market, except for zero waste stores. As the author mentioned in the proposal, Littercoin may sound fascinating and rife with potential to climate economics while mitigating the doubt of crypto hurting the environment. Furthermore, given that Littercoin is Cardano-based, climate economics might turn into a potential target audience as well. I also like the rewards that participants may acquire if they complete their specific given tasks.\nThe proposer also addresses a challenge that the project is facing, followed by a solution, regardless that the solution depends on the approval status of the funding. A small adjustment that I would make is adding some content of the gamification process, such as what exact tasks will participants have to carry out in the LitterWeek event or how much LitterCoin could someone potentially earn?", "q0r": 4, "q1": "From the timeline and milestones provided in the proposal, I believe that the project holds some prospects for great success, in a positively short amount of time, that is. However, apparently the team hasn’t deducted a specific budget number yet, and while there are names and positions provided in the team members section, I would persuade that this section could perhaps use some affiliated links from Linkedin or Youtube or similar websites to further verify the expertise of each individual.\n", "q1r": 3, "q2": "As far as I’m concerned, the project does possess some credits for auditability, as a data sheet is provided for the community to monitor all the transactions and spendings the team has made. Yet, this proposal, similar to some others that I’ve come across before, fails to deliver the desired outcome that this challenge seeks. Yes, I admit that environmental preservation is something we all yearn for, but in order for the proposal to sound reassuring and trustworthy, I believe the beneficial conclusion for Cardano must also be put up in par.\n", "q2r": 2, "assessor": "z_assessor_1664", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3748, "q0": "The main features and activities of the project are described quite well, links for further descriptions are also attached. According to the author, they can fix 2 important barriers to the mass adoption of crypto, and I like this idea because it makes the game easily attract players at first. \nHowever, the proposal's results are not so clear, it's more about the game's features, so it is a bit difficult for the community to assess whether the proposal aligns with the challenge or not.\nA risk has been raised, but there are no specific solutions have been taken. It would be better if the author can add more detailed solutions implemented or plans for this risk.", "q0r": 3, "q1": "From what is described in the possible section, I think the proposal can meet the outline.\nThe detailed plan is described in detail and reasonably, the timelines from 1 month to 12 months and the work items at each timlines are mentioned.\nThe budget is also reasonably allocated into 5 main items. But it would be better if the author could add the details of the work in each item, as well as the time to complete these items.\nIn addition, the description of team members needs to be more detailed. Currently, the information about the work experience, outstanding achievements as well as the attached profiles of the 4 members has not been described in this section. The author can add this section so that readers can evaluate the feasibility of the project more easily.", "q1r": 4, "q2": "The project mentioned the targets to track the project (the number of ADA transactions and ADA/euro) and the way for the community to track the project (google docs), but there are no KPIs at each milestone time for comparison.\nThe success of the project is also described quite fully that LitterWeek will become the biggest and most successful citizen science initiative in Ireland which will result in the most comprehensive baseline dataset of litter and plastic pollution created so far. However, I think it would be better if the author can describe these indicators in a more quantitative way to improve the ability to evaluate the feasibility of the project.", "q2r": 4, "assessor": "z_assessor_1674", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3818, "q0": "My congratulation to the team for the previous success in Fund 4. It’s good to see a successful project continues to be developed. And surely, such project would have much better potential than those who start from scratch. Wanting to utilize current user base, the team is heading toward making openlittermap.com more interactive by integrating gaming experience and collecting data. From a quick search on google, I see that they do have actual support from environmental-concious community and attracted quite a lot of attention. So I think the LitterWeek challenge will be a great success in terms of participants. However, in my opinion, the users’ experience with the token would be quite limited due to the the fact that only zero-waste stores will accept Littercoin. I suggest that the proposer could work with many other retails so the coin’s liquidity is better. The easier Littercoin can be spent, the better user experience is and faster adoption would follow", "q0r": 5, "q1": "The proposed plan is clearly described and divided into actionable items within 12 months of development. Consider the previous success and how well openlittermap.com is performing, there is no question about the team members’ capability. The team’s founder - Seán Lynch - is a well-known environmentalist and even has his own TeDtalk. One critical point I’m suggesting is that the proposal team should include someone with experience in developing NFTs and blockchain. And since gathering data is one of the main goal, someone with Bigdata background will also be needed, I assume", "q1r": 4, "q2": "The team provided a template file about how to keep track of the funding, recording all the transaction for clearance. However, there is no other metrics listed to help the community evaluate the auditability. I would recommend the team to include the following metrics:\n- Number of schools participating in LitterWeek\n- Number of new users from this campaign\n- The amount of data collected (new locations, photos …)\n- Number of retails accepting Littercoin\nand some other metrics to evaluate Littercoin’s and NFTs’ usage", "q2r": 3, "assessor": "z_assessor_1685", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4475, "q0": "generally, this  proposal has the potential to meet the challenge KPI. This project proposes a game with clear mission and an outstanding way to on chain people. I tried the openlittermap.com website, through which I realized the contribution of this project for the environment as well as its impact on public awareness not only that, this project is also motivate everyone's action to save the earth at the same time. The systems will help a lot of people on-chain, as well as promote environmental protection to be rewarded. However, I would like to know more about features, like what gamification side that you guys are aiming to build? How to earn rewards? Any tutorials for newbies? Besides taking photos and picking up garbage, are any other lively activities that can be added? For example, the estimated carbon footprint created by the power plants supplying such electricity is a source of concern for the environment. We can lower our carbon footprint by planting more trees and limiting the usage of power and motors that aren't essential. Can we get rewarded by doing that? Moreover this can also help to change perception that Crypto are harmful to the environment due to using lots of energy. However, the not-moving-fast-enough is not the only risk in this project. We can name some other risk like the ma rketing one. To be specific, based on the website, most of your users are mainly located in the lower half of North America, Europe and South East Asia. How can we spread out this project? We will also need your team to provide suitable solutions for all of the risks that can be addressed.", "q0r": 3, "q1": "According to the proposal, it appears that all of the team members have already worked together, which will aid in teammate understanding. However, there is no Linkedin links to check the team's skills, qualifications, and experience. Furthermore, their proposal lacks specifics about their goal. We can just see the basic plan with timelines, but we will need them to offer additional technical details. What coding language or research approach is used, for example? The funding is divided into five major sections, the largest of which is for software and website development, story writing, and prizes, but there is no clear indication of how many people will work on it or how long it will take for them to accomplish the job on time. Additionally, I would recommend the team to spend time to evaluate the PR budget, as this would assist this proposal to receive a better feasibility score.", "q1r": 2, "q2": "I highly appreciate the easy to understand spreadsheet. It will be a trustworthy source for us to track the process. One success should be mentioned in this project is it solves real-world problems. Although I would like to know more about their plan to approach new users. Moreover, I suggest the team to give more metrics on not only the ADA spent but also trading volume, new user and engagement rate, etc. In addition, since this is an environment purpose project, I think everyone will also care about other side like is the project supported by strong community and developers? They will check by going through their Reddit, Twitter or Discord page and see how active their channels are. Hence, we should also have report on new followers or traffics on these social media too. ", "q2r": 2, "assessor": "z_assessor_1726", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5963, "q0": "This proposals aims at continuing a previous funded proposal, which was funded in Fund 4 and which objective is to map litter around the world. The idea here is to expand it a create events to mobilize people and companies around weeks where they would focus on specific targets of litter mapping, and prizes will be distributed to the winners, possibly in form of LitterCoin (was not specified in the proposal). They will limit the usage of LitterCoin in waste zero stores only, with the idea of minimizing the environmental impact of its usage. As this is framed as a game, with competition between players interacting with the real world, this can be considered a game and fits well within this challenge. Also, this proposal will help to considerably leverage the impact of the previous proposal, which already has users, as seen in their website. The proposal, although, lacks some information about its sustainability, and how they expected to provide prizes in the long term, and how the price of LitterCoin will be defined since it’s not going to be listed in exchanges and therefore not exposed to the offer/demand open market. Anyway, the idea of this proposal is to leverage something that’s already happening and to make it evolve faster, and I believe this is achievable and could have a good impact if executed properly.", "q0r": 4, "q1": "The team provides a good roadmap and milestones for 1, 3, 6 and 12 months. The milestones seem to be feasible according to the timeline presented. The budget is explained, although it would be better to have the time commitment of the team, to know what’s the hourly or monthly rate and also the time they are going to take to develop the platform, so we can better assess its feasibility. Also, the team is presented but there’s no way to really check their background, it is, no links to LinkedIn or personal pages. To increase the feasibility of the proposal, I’d add more information about the time commitment of each role, or at least the time per deliverable, and also more details in the budget breakdown.", "q1r": 4, "q2": "The proposer presents a sheet that will be used to keep track of all the project expenses, but what is missing is a way to keep track of what’s actually being developed during the execution of the proposal, for example, reports, demos or videos. The success of the proposal is defined as being successful in Ireland and then exporting this achievement to other places. Although, some metrics are missing here to really measure the success of the proposal, for example, number of players, number of registered locations or volume of litter, something in this regard. They mention that this proposal is a continuation of a previously funded proposal, which is good for transparency and let’s us see the big picture as well.", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6113, "q0": "The problem identified is an important one (empowering citizen science by gamification], while also having the potential to have a huge impact on the Cardano gaming ecosystem. The proposed \"non Trade-able Tokens (NTT?)\" (non trade-able being in relation to trade-able on secondary markets, like exchanges) could be a gaming game changer and offer something truly exclusive to the Cardano (gaming) ecosystem. The Github repositories are operating under open source (GNU-General Public) license, from the community for the community.\n\nThe value added to Cardano (gaming space) is maybe not immediately apparent, but becomes clear if one acknowledges that the gamification of Littercoin will be successfully implemented and played with. It would mean large scale exposure of Cardano in ecological conscious communities and (purpose) corporations; purpose companies will become the default legal structure in the years to come. \n\nAs I understood Littercoin has no on ramp, but can only be spent in Climate neutral (zero waste) stores, making ADA the default off ramp currency for all those businesses.\nWhich leads to the next important impact factor.\nEven if the Littercoin implementation  will somehow not be successful in itself, the mechanics and proof of concept for a \"Non Trade-able Token (NTT?)\" might prove highly valuable for others looking to integrate easy to stabilise fungible tokens within their gaming ecosystem.\n\nCreating a fungible asset that can't be bought on an exchange (decentralised or centralised) - essentially a \"Limited Fungible Token\" - seems challenging and if done right will be a great addition to the Cardano ecosystem.\n\nTurning gaming achievements into NFTs is a nifty idea and most likely will be picked up by other gaming projects as well. Most likely there are other proposers working on this as well, it would've been amazing to see or hear about any possible collaborations around this. \n\nThe goal of creating a gaming experience that both has positive environmental impact and is bringing exposure to the Cardano (gaming) ecosystem (by gamifying citizen science) is well aligned with the Challenge setting and Cardanos' greater mission as well. \nIt would increase users of Cardano based gaming apps by ten or even hundreds of thousands (if 50 (of the mentioned 100) schools sign up each with 2000 (low estimate) students). The mechanism proposed is essentially a play to earn mechanism, but rewarding positive behaviour in the real world - genius! The number of fungible tokens (Littercoins) would increase the total # of FT's and also create a new sub-type of fungible token (Non Trade-able or Limited Fungible Token - as in non trade-able on secondary markets, only in climate neutral shops, maybe the wording could be more positive).\n\nThe proposal doesn't mention how it will scale or become sustainable. Other open questions: how will code maintenance be covered? Who's doing \"Prosumer\" support, how will this be remunerated? How or who will cover costs for future development? Given the past and present engagement of the proposer, the assessor decided this will not impact the 5 star rating on impact. \n", "q0r": 5, "q1": "One of the few teams that only have developers (that's awesome!), however budget breakdown and milestone plan need to be defined in more detail, especially when asking for 50k of funding. A project manager would've come in handy here.\n \nNo space for iterations for the Litterweek app can be found in the planning or the budget, which is a little bit worrisome from an agile / project management perspective. On the other hand the team, especially Sean has shown great commitment and has built trust within the Cardano (4 Climate) community.\nThat's why the assessment score will be higher in comparison to a proposal with the same level of feasibility but a different, not so well known team.\n\nIt remains unclear where additional funding will come from in case development takes longer or needs post production bug fixing et al. Here again I feel that, since this is a passion project that Sean has been diligently working on since Fund4 (also with missing funding from Fund7), these costs will be covered out of his pocket; which I have to subtract some points still as this is not sustainable in the long run, but doesn't impact feasibility too much.\n\nEvidence of relevant skills are presented through github. Project Planning skills however are completely missing from the team, which lowers the score only a bit, for the before mentioned reasons.\n\nThe necessary resources and potential future \"prosumers\" (schools and purpose driven companies) are already at hand - except for the new graphic designer that shouldn't be too difficult to find.", "q1r": 4, "q2": "A very rough roadmap with milestones and a 12 month timeline is presented. It only satisfies the assessment criteria on feasibility to a bear minimum. With a project of this size it would've been advantageous for the assessment score to break down the budget and milestones onto a finer level of granulation.\n\nThe success criteria are impressive (100+ schools waiting to signup!), however are not fully defined, but only hinted at. Some more thought into how success will be precisely measured (using leading and lagging KPIs, e.g. x amount of schools and companies: have been contacted; signedup; x schools or companies actively engaged, engaged schools rising x% over time) would help the assessment score tremendously. However this might be done during the course of the coordinator or on-boarding meeting.\n\nIt is mentioned how the basic spending of funds is being tracked, but not the project itself or what the funds are specifically spent on.\nThe fact that 50k will pay for 1 full stack and 2 front-end developers for about 12 months reduces the relevance of the sub optimal project tracking situation. Since the team already started delivering until now also without proper project management / tracking. It would make sense to plug someone in for the future development, also to help with planning and proposal writing. \n", "q2r": 3, "assessor": "z_assessor_334", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6938, "q0": "Suggested characteristics of an impactful proposal:\n\n1. The proposal identifies a problem within the challenge which needs to be solved. & 2. The proposal clearly articulates how it will add value to the Cardano ecosystem: This proposal not only addresses the challenge, \"What Blockchain gaming applications should be developed to achieve mass adoption of Cardano,\" it addresses an environmental issue, gamifies it, and promotes the power of citizen science. On top of this, by including the element of a circular economy, this application introduces Cardano to anyone with a phone & gamers plus zero waste store merchants who may in turn accept ADA. The educational & competition components bring in generations of new consumers. \"Littercoin is being engineered so that it can be spent in zero waste stores only, making it a climate currency that not only stimulates climate economics but addresses crypto environmental skepticism.\" As an environmentalist seeking a shift away from capitalism based on the few getting \"wealthy\" from the printed paper we are led to believe has some sort of value, Littercoin adds an underappreciated value that is gaining traction amongst forward thinking companies recognizing the importance of impacting climate change and the real eco-nomy: the well-being of the whole.\n\n3. The key metrics and goals of the proposal align with the outlined challenge settings: \"There are 2.5 billion gamers out there. These gamers are looking for their route into crypto in a fun and rewarding way.\" Everyone of these gamers probably has a phone. This project also redefines the legacy idea of value to be solely monetary in this challenge key metric: \"Amount of value made by gamers in play-to-earn applications.\" This proposal fully addresses the Gamer's On Chain Challenge and it is aligned with Cardano's mission of \"Making the World Work Better For All\". It proposes \"a way for gamers to be onboarded into the Cardano ecosystem through the thing they love, gaming\" AND passionate citizens who value the environment into gamers AND adopters of Cardano. \n\n4. The proposal is able to scale to address future challenges: This proposal IS already scaling and addressing future challenges.\n\nThank you, Mr. Lynch, for your dedication to this work. Knowing there are individuals such as yourself, building useful, impactful gaming applications on Cardano, makes me proud to be an ADA holder. Thank you for thoughtfully addressing the Sustainable Development Goals (SDGs) impacted by your project & proposal through the article linked in your proposal.\n\nActionable coaching points & Own domain expertise: I would suggest the reader take your app for a test drive. Using your application is not only fun & intuitive as it is, it is perspective shifting & habit changing. I do not look at litter the same way anymore, I am motivated to help others see the litter we are no longer seeing & I find myself picking up those small pieces of litter on our own property.\n\nFor Impact on all playing fields: the F8: Gamers On - Chained, Cardano's mission, environmental impact, accessibility via an application on a phone leading to increased adoption of Cardano, raising the level of fun in collecting significant impactful data, I give this proposal a rating of 5 stars although it deserves 7 for taking the challenge and upping the game to new levels & purpose. ", "q0r": 5, "q1": "A feasible proposal has considered the following aspects:\n1. The proposer provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal: All a voter has to do is open the github link https://github.com/openlittermap to know this is no fly-by-night operation. Further details to the project not outlined in the ideascale proposal are easily accessible to anyone at: https://github.com/OpenLitterMap/openlittermap-web#readme\n\n2. The proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal: This is not a new project. I have attended Littercoin weekly meetings and listened in to discussions around improving this application & user experience. I know & trust the developer is basing his projections on experience rather than google searches.\n\n3. The budget is outlined clearly and broken down into identifiable items. & 4. The budget is reasonable to achieve the set goals: I am not an accountant nor a developer. From many years of experience hearing about a big mega project running into snags and doubling the initial projection, I know that budgets are \"flexible\" and based on speculation without knowing ever possible risk or outcome. I also know that projects based on passion & purpose like Open Litter Map will be successful with or without Catalyst funding. I am not one to promote FOMO. However, I feel very strongly that this project is a gamechanger and that we as a Catalyst community & we as ADA holders can allocate the requested funds with a high level of confidence the work will be done & through this project, the Cardano blockchain will gain recognition & adoption from a wider audience than if this project is once again overlooked and funding is by-passed. This would indeed be a missed opportunity to be feared.\n\n5. If additional funding is required to implement the proposal, the proposer has provided a verifiable plan in this regard: This project is actively working towards meeting their goals with or without funding. It appears that obstacles are little bumps in the road compared to the momentum generated by this project.\n\n6. The proposal offers a realistic timetable to complete the work. & 7. The proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how: Although not fast enough to meet the growing demand, and knowing the developer, I believe that this project has a reasonable, manageable timeline in which to complete the tasks outlined.\n\nI trust my rating of 5 stars will bring attention to this project and the opportunity it gives us as the Cardano community to gamify impacting In Real Life issues we can no longer ignore by escaping into virtual realities. Imho, this proposal deserves at least 6 stars for feasibility based on the sheer perseverance of the developer.\n\nActionable coaching points: Video Link starting at Open Litter Map presentation 10:48 to 1:05:24 (instead of beginning) https://youtu.be/Pe4nHdoAlu4?t=648 This is a great representation of what you are doing. Hearing the Q&As including Dan's (as a devils advocate) is helpful to understand the bigger picture and long-term roadmap of this well thought out & executed project.", "q1r": 5, "q2": "An auditable proposal has considered the following aspects:\n\n1. A roadmap with milestones and a time horizon for achievement: Clear & succinct. See detailed timeline under Feasibility section. Although somewhat redundant it may be helpful to clarify specific goals related to \"prizes to whoever made the biggest impact\" & \"quantified open source environmental impact\" for those who are not familiar with your project. \n\n2. Metrics/KPIs that define the success of the proposal: A simple & clear form to track all funding & expenses is given. Although no future events are guaranteed to happen as planned, measuring the success of \"LitterWeek\", a \"comprehensive baseline dataset of litter and plastic pollution\", and a \"university partnership with UCD... 100+ schools... a range of corporate partners who want to showcase their social and climate commitment and demonstrate their leadership in the community\" are all solid, measurable, auditable indicators of the success of this project. There are significant pieces of information in the Impact & Auditability sections that although repetitive could be added to the roadmap to help flesh out the roadmap and clarify where & when these bonus activities will take place, knowing full well, that they are highly contingent on receiving funding.\n\n3. Clear understandable description of the targeted problem. & 4. Clear understandable solution that addresses the problem: \"About 1 billion people have powerful devices that can collect data but we have yet to unlock our data collection capacity by making it fun.\" No extra devices, no fancy, expensive equipment, just a simple phone and user interface to make this game accessible to everyone through the innovative & creative Littercoin application. Easy onboarding. Easy adoption. In my opinion, the fact that individuals are so easily onboarded into crypto & Cardano with your application and a smart phone could use amplification.\n\nFuture work growing out of this open source pilot project will impact not only the Cardano blockchain, it could have measurable, science based, impact globally. \n\nThe only improvement to this proposal imho, is the use of definite numbers instead of the superlatives \"best & most.\" in the Auditability section (although clearly defined milestones are indicated in the Feasibility section). However true the words \"best & most\" may be, they lack measurability. That being said, I am confident this gaming terminology will be clarified for non-gamers in your progress reports in the form of another \"leaderboard.\" \n\nFrom the information given in this proposal, as a committed Catalyst community member, I am confident we can determine the success of this project and return on intention. I give a rating of 5.75 stars. (6 - .25 for my nit-picky \"improvement\")", "q2r": 5, "assessor": "z_assessor_500", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We are turning cleaning the planet into a game. Schools & corporate partners will take the LitterWeek challenge with LitterNFTs & more", "experience": "14+ years independent R+D developing openlittermap.com. Littercoin idea born in 2015 after writing the openlittermap dissertation and being introduced to tokenisation. First funding on Project Catalyst in Fund 4 which is still ongoing. Looking to do a PhD once app is developed."}