{"id": 399175, "author": "doogyhatts", "title": "Littlecube Valley (game project)", "url": "https://cardano.ideascale.com/a/dtd/399175-48088", "category": 26440, "amount": 50000, "description": "Virtual worlds such as Metaverses can often be lonely and boring, lacking a meaningful single-player experience with daily user engagement.", "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 380, "q0": "The game in question of this proposal brings very innovative concepts with the potential to captivate many players to explore a living and unpredictable world. A good feature of the game is its own personality and quite original, having a unique plot and we clearly see that it is not being built with the simple objective of selling NFT's. Thus, players who enter its universe will certainly arrive attracted by the gameplay and the game's lore, which is a good way to start an engaged community. With this, we observe that the project reflects the metrics established by the challenge in question, with a chance to positively impact Cardano's ecosystem.\n\nThe budget being requested of $50,000 is adequate for all the steps that still need to be completed for the project to be successful. However, it is necessary to mention that the stages may be considering so many production details that the project becomes too extensive or not viable. Undoubtedly, this is a proposal that, if successful, could bring unique visibility to Cardano, however, it seems to be a very ambitious project and, consequently, with considerable inherent risk.", "q0r": 4, "q1": "One of the great differentials of the game, and what makes us believe in its chance of success, is the way in which the NFT's are being used. We realize that there is a whole construction of the game environment and its atmosphere, the use of innovative concepts for the generation of the world and several possibilities of gameplay that make up the universe in which the game takes place. Within this universe there will be stories and events, and as a reward for participating in these events, the player will earn NFT's. All this shows us that the sale of NFT's is used here as an additional way to involve the player, and not as a mandatory purpose to generate capital. The idea of ​​a living world, in which the elements change over time and their actions can influence the environment, is also a great attraction.\n\nWith all this, we can see that the storytelling element of the game is very well built, being the success really viable. However, procedural generation, one of the project's differentials, ends up also being one of the worrying factors here. As can be seen in the proposal, the level of detail that needs to be implemented for the universe to be as planned is extremely thorough, and several researches are necessary throughout the process. Coupled with this level of detail, we realized that the team is not composed of a large number of people (despite the fact that the author of the proposal has a lot of impressive specific knowledge). This means that the total time can be very long until the game is in a state that attracts players and revenue, or that the budget to complete it may not be enough.\n\nAlso in relation to the budget details, we see that there was not a very comprehensive way of distributing the funding, all expenditures were titled as development basically. So we don't know what amount would be allocated to the production of NFT's or marketing, for example. In general, the game has several captivating elements and perhaps a better polishing of the strategy to be adopted, simplifying some points, can make the chances of the project achieving success be greater.", "q1r": 3, "q2": "Despite all the details present in the game, we see that the ways to track success are not very specific. It was announced that progress would be tracked through the development and research blog, but we are left with some questions such as, what parameters will be used to track progress? Have goals been set for launch, such as an expected number of active players? Is there an expectation of revenue from the first sale of NFT's?\n\nWe see that the objective of having players in functional cycles at a given moment is an interesting indication, it would be nice if more parameters like this were suggested. It is also worth mentioning that this is a proposal, although quite ambitious, with a real possibility of being a success and attracting players who were not involved with games that use blockchain concepts until then. It would be interesting perhaps if some points were revised to increase the viability of the game.", "q2r": 3, "assessor": "z_assessor_1146", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Perhaps one of my goals was not clearly conveyed in the proposal, that is to build up the treasury first. Then understand and address challenges posed by government regulations such as taxation and cryptocurrency payment, before any professional collaboration could take place. Unfortunately, we have rather strict guidelines on cryptocurrency usages in Singapore as well.\n\nThe initial treasury will be staked in order to account for the cost in taxation of the sale proceeds of the NFTs. Subsequent NFT sales will continue to build up the principal sum for staking. A small portion of the staking rewards can also be used for minting NFTs that are meant to be used for in-game achievements or for any marketing campaigns.\n\nThe procedural generation solutions are used as tools in order to build the game world, so the game world is generated by mostly algorithms as opposed to other methods such as world building in a visual editor.\n\nWith regards to collaboration, one way is to look at how Veloren runs its open-sourced solution for an alternative version of Cube World. It started in 2018 with a small team of people and only Zesterer being the lead developer. Their community rallies behind their passion for Cube World, with a non-profit motivation. \n\nI will have to identify if such similar strategies can be used, even if this is for a commercial project.\n\nAnyway, thank you for your insights!"}, {"id": 3751, "q0": "The impact section is presented in a complete and easy to understand manner.\nThe main functions and activities of the game are described thoroughly and additional articles about the game are attached for readers' reference.\nProposal also meets the challenge: players choose Cardano blockchain as their preferred blockchain for gaming to collect NFT-artwork in order to gain access into the game world.\nThe risks raised by the author such as finance, time, manpower, deployment of certain unique concepts, and other properties of the game are all addressed by detailed solutions from the writer.", "q0r": 5, "q1": "based on what has been shown on this part, I think the proposal can meet the outline. The roadmap of the proposal is presented clearly and in detail for 20 months. The project is divided into sections with completion time and is broken down into detailed items to be completed. Thanks to that, readers can know the specific progress of the project.\nThere is one point that I think I can add to complete the roadmap more, which is to add a specific timeline such as 4 months from ... to...\nThe budget part is clear and understandable.\nThe member description is very detailed when the writer clearly describes the member's experience, outstanding projects were done as well as attached related reference articles.\nThe writer also mentioned that this is a solo project, but since this game is related to the blockchain field, it would be better if the project had more members in this field or found a good outsourcing service in this field.", "q1r": 5, "q2": "The project does mention the way for the community to monitor and check the project by blog. However, it would be better if the research and development blog section is presented in more detail. The writer can add quantitative KPIs with time during project implementation (20 months from April 2022 to November 2023). Mores methods for project tracking should also be added to make it easier for the community to evaluate projects after they are funded. \nFor example support tools or website addresses, social media so that readers can look up and check KPIs at a fixed time, from which they can assess whether the project is making progress as expected plan or not.", "q2r": 4, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your insights!"}, {"id": 4087, "q0": "The idea is very interesting, it’s all about building a place where players can all engage and experience an living and exciting virtual world. Since simulation games have always been very trendy with some other famous games such as The Sim or Minecraft, I strongly believe that this idea can get players’ attention and if it works, it will help to determine whether players choose the Cardano blockchain as their preferred blockchain for gaming. In this proposal, the team has greatly presented every single aspect of the project, from the ideas, contents, maintenance and all the other background works. The team aims to create a world with every daily life aspect and spice it up with extended storyline. I can easily imagine how the concept of this game comes into real life. Also, I strongly agree with the plan of building the game on iOs and Android (mobile platform) before porting over to desktop platforms since it seems to be able to reach out to more players with only just a mobile phone or a tablet. I imagine players can easily look after their gameplay anytime, anywhere with cellular data. The game also aims to have an effective rewards system with fungible tokens, premium characters and specific NFT-characters.  to encourage players to stick around and attract new players. \nBesides all the positive outcome, the team has also successfully addressed a whole picture of difficulties from simple problems to more complicated things like human resources, network, capital & Sustainability and copy rights. However I don’t find the long list of struggles is going to be a big hassle when the team has also provided their idea of solutions for each problems that they pointed out. It gives the whole project a lot more reliability. A huge applause for the team!", "q0r": 5, "q1": "Since the team has such a detailed plan of this project, I’m not surprised that they also provide a greatly detailed timeline. Each stage of the project comes with the most completed description of what is going be built in which amount of time. And the budget breakdown also seems to be fair. With a thorough introduction of the team member who runs this project, I believe that they have the exact skill sets to make this project a success. ", "q1r": 5, "q2": "For the auditability, I honestly don’t have a doubt about this process. If anything I want to ask the team to add, it will certainly be a clearer key metrics to measure for the community to audit. For instance, the number of new players register, active players’ account, and more numbers to show the contribution of the game to Cardano.", "q2r": 3, "assessor": "z_assessor_1703", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your insights!"}, {"id": 6081, "q0": "I fell in love with the art  visiting the website (https://www.littlecubevalley.com/).\nThere are lots of challenges for the team looking at the challenges/risk section  and i like the fact that you addressed ways to try and solve them when they arise.\nI think marketing should be considered as there are so many games being made everyday?\nThere is an associated video link to showcase the art style and i immediately fell in love.\nThis proposal have already started its positive influence to the cardano community  as i am first encountering \"Living Game\" for the first time and its an interesting subject i never looked at as a game developer.\nI am giving 5 star for impact.", "q0r": 5, "q1": "The proposal did a great job of detailing every activity with a 20 month timeline and a very detailed cost breakdown to per hour charges.Even though a linkedin link wasn't provided , the proposal shared lots of links to blogposts, demos of the work being done.I am giving 5 star as i believe the team are capable of delivering this proposal to success.", "q1r": 5, "q2": "The proposal provided links to blogpost to track the progress of the work done .\nI don't have much to add and i am giving 5 star according to the CA guidelines for the Auditability section.\nI wish the team good luck and hope you find a team to assist with the workload when funded.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thank you for your insights!"}, {"id": 6224, "q0": "The goal of this proposal is to create a voxel-based sandbox-RPG single player game on Cardano blockchain which fits the gamers onchain challenge. The proposal will allocate all of its funding on the development of the game, which is a good thing in my opinion. Some proposers are getting into marketing and hype without focusing on the product and user experience first. Without a fun and entertaining content, the success of the game will only be short-lived. Although the proposer only target the single player users, which limits the opportunities for a wider audience, it is better to start small and target a specific niche and evolve towards the demand of the players in the future if the opportunity arise. In conclusion, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer did not provide any verifiable credentials of previous experience on creating a game. Although the proposer seems to have made his own research before. By the budget presented, it looks like it is a one man show which can be really challenging when creating a game with this magnitude. It is best to delegate the work to a few team members that specializes in their own trait, like a sound engineer for example, to create your game SFX library with better quality, or a plutus developer to integrate your game verification using NFT with the Cardano blockchain etc. There is too much work to be handled by a single person which greatly increases the risk of failure. However, the proposer did provided with a comprehensive plan on how he will execute the project, and also identifies the risks and challenges that he may face during the implementation of the project. In addition, the proposer also clearly explains the technical aspects related to the development of the game. With the above argument, I am neither agree or disagree that this proposal will be implemented successfully. ", "q1r": 3, "q2": "The proposer presented with clear and sensible roadmap of 20 months of development that will be recorded on their research and development blog, therefore it is possible for the community to keep track of the progress of the project. The KPI and key metrics are well presented in the feasible section on a quarterly basis. However the definition of success is vaguely presented. It is stated that the success for this game project can be viewed by the completion of a vertical slice, but there is no information regarding the content of it. ", "q2r": 3, "assessor": "z_assessor_357", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "With regards to collaboration, one way is to look at how Veloren runs its open-sourced solution for an alternative version of Cube World. It started in 2018 with a small team of people and only Zesterer being the lead developer. Their community rallies behind their passion for Cube World, with a non-profit motivation. \n\nI will have to identify if such similar strategies can be used, even if this is for a commercial project.\n\nThank you for your insights!"}], "solution": "Create meaningful single-player experiences with stories that live on a persistent virtual world, storing historical events on blockchain.", "experience": "Research and development experience on procedural world map generation and procedural grass generation using a custom voxel-based game engine solution.\nSkills: Computer Science, Computer Graphics, Computational Geometry, Artificial Intelligence, Machine Learning"}