{"id": 399118, "author": "newmindflow", "title": "Trybbles:Blockchain-Enabled AR Pets", "url": "https://cardano.ideascale.com/a/dtd/399118-48088", "category": 26440, "amount": 239900, "description": "Gaming will catapult Cardano to next levels of adoption, yet a large part of the gaming community is actively opposed to blockchain & NFTs.", "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 3573, "q0": "My first impression towards this proposal is the overall great quality that has been offered up the table, as the proposal is very meticulously written, organized in a logical order of presentation, the intention is valid and clear with a constructive methodology. This is one of the few proposals where I’ve seen the efforts being dedicated to illustrating the current obstacles that cryptocurrency blockchains are facing, to a great extent no less. For the most part, it is a fairly accurate description as now, in the year 2022, cryptocurrency and NFTs are still not receiving the credits and trust they deserve due to the numerous scandals and rug pullings within the scene. Therefore, it fascinates me when I’ve finished having a look at this proposal, as not only does it offer the commitment to elevating Catalyst, but also it offers to live up to the promise of delivering a purely fun gameplay experience while doing so. And the proposal makes quite good of a case, that is. \nAnother part that the proposal nails is the devotion to making the game stand out from the other NFT-featuring games on the market, most of which focus more on the income-earning attribute rather than the gameplay itself. Therefore, Trybblers is aimed towards being a genuinely enjoyable experience while also celebrating the merits of Catalyst, by focusing on making the AR pets as lively and interactive in a natural manner as possible rather than soulless creatures that serve some particular purposes. And in order to make that possible, the team turns to one factor that I find particularly thrilling, which is the integration of the Unreal Engine, and in case you’re not familiar with it, basically it is the most powerful real-time 3D creation tool made especially for game developing and has resulted in a vast plethora of titles ever since its release in 1998. \nThe team has also mentioned that the project has already met with some popularity in the community, having minted over 4000 NFTs and gathered a number of followers as well. However, those are only some initial successes, as the proposal claims its main obstacle for the time being is the recruitment of suitable team members for the project to be developed in the desirable direction, which is something yet to be addressed. Nonetheless, I believe the policy to treat the human resources involved in the project sounds decent and interesting enough to gain some attention from talented and skilled developers.", "q0r": 4, "q1": "In terms of feasibility, there will be another congratulation on my part to the team for the content they lay down. The roadmap and timeline provided are extremely detailed, and the most welcoming fact is that they also include the past occurrences of the project development process as well, whereas many other proposals would have left out that section of information. Now, I cannot argue whether the requested budget makes sense or not since I don’t have enough knowledge to come up with a decision. Still, the team has managed to display a very specific breakdown of the budget allocations, and, to my surprise, plead their own case quite persuasively as well, another thing I have yet to come across in previous encountered proposals. Another interesting thing to notice is that all personnel involved are respectively paid, except for the first two positions, which may sound quite baffling, yet the team specifies firmly that they have taken every single thing into account, so I guess that is plausible. And even though the team is still looking for more hands on deck, the already available members are enclosed with their respective background checks, valid expertise and affiliated links to further verify them. The proposal also doesn’t leave out the duties and tasks of the positions in search, and to score more credits, there is also the information of an NFT from the collection of the project as well. Judging from those details above, I would confidently say that the proposal has justified itself very decently for the approval of the budget.", "q1r": 5, "q2": "From my comprehension of this section, I could safely state that the project does possess a good level of clarity, as demonstrated through the use of the Catalyst Monthly Reporting form for progress tracking. However, I wonder if the form allows for public access also or just for the participants of the project, so some information to address that would be appreciated. Nonetheless, the team has deducted their envisioned versions of success in various time periods, from short-term to long-term, and their SDG goals for the foreseeable future, both of which I believe to be relevant to what the investors at Catalyst are looking for. That being said, I do notice one small flaw in an otherwise flawless and promising presentation, which is the lack of affirmation for all the benefits and profits that the Cardano blockchain can expect to reap from this project, thus I suggest including some mention of it in future proposals.", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4289, "q0": "Among many other proposals, this one is outstandingly well-written and logically organized with problems and solutions are clearly stated and explained. Unlike many others, this proposal does not only go deep into how their proposed solution will deal with the problems but also give the reasons why they see it as being a necessity along with a very thorough analysis with attached links providing information about the current gaming market and the reluctance, sometimes active opposition of mainstream gamers and game developers toward blockchain technology. This, besides providing readers of this proposal with both insight and overview into the present situation, also gains credibility for the project and serve beautifully as an explanation to the proposed reasons. The solution of the team is another bright spot since the author has given a detailed and inclusive description of the game features, the scope of the project and the team's approach. In plain words, this project aims to build a traditional story-driven gaming experience, coupled with a companion blockchain-enabled AR virtual pet Dapp which is called Trybbles. Impressively, Trybbles is already a successful CNFT project created by the author (him/her)self, and this explains the sufficient granularity indicating the author's great understanding of the project. It is absolutely not an exaggeration to say that the person writing this proposal is really serious, enthusiastic and know exactly why and how he/she is doing this. I do not have much experience in blockchain technology and cryptocurrency to be able to accurately predict the success of this project, but with this much carefulness and effort put into a proposal, I am confident to say that this proposal provides me with more than enough to assess its impact, and if successful, the project will bring great benefit to the Cardano ecosystem since it can not only bring in more users for Cardano but more importantly, also gradually and positively change people's perception towards blockchain and crypto. ", "q0r": 5, "q1": "Regarding feasibility, the author has made this proposal stand out. Unlike many other proposals, the roadmap here is not only about the future vision and goals to be accomplished, but the author does also include in the proposal the team's achievement in the part listed in chronological order. Going into details, from September 2009 to December 2010 is the time when the idea was formed, along with script and concept art and it was shelved only because of financial constraints. From April 2021 to the early of 2022, the team has done a decent amount of work including launching the project, introducing it to the community, constantly making improvements and now they are calling to get funded to have money for future plans and milestones. However, despite a very detailed timeline describing the team's accomplishments in the past, it lacks sufficient information to make it clear how they will continue the project in the future. I would only ask if the author can provide readers with more details about the tasks set for each quarter, for example, instead of just writing \"Full-scale recruitment for the project begins.\", some information can be added to cover more specific factors such as the standard that people need to meet in order to take part in the project, etc... Although the roadmap still requires improvements, the budget breakdown, on the other hand, is nearly perfect, with extremely detailed allocation of money towards different expenses, from the payroll with hourly wages for many positions to other crucial things like legal, accounting or office space,... And not just make a list of payments, a deeper description of how the money will be spent and some data about Sandbox, another blockchain game that is under development, are also provided. Furthermore, it is such a glad to see LinkedIn profiles of proposers with multi-year experience and a complete list of the skills required to successfully implement the project. Reading this proposal is not like watching a presentation but rather like having a conversation with the team behind the project. And with all of the above mentioned, I strongly believe that this proposal is highly likely to be implemented successfully.", "q1r": 5, "q2": "It is wrong to say that the auditability part of this proposal is a disappointment, but in fact, much less impressive than its previous 2 parts. Instead of describing how the team itself and stakeholders can track and measure the progress and the development of the project, something that looks like a roadmap with stages and time/money needed is given. I understand that it is reasonable to do so, but according to my experience, this here should be added with specific numbers and key metrics to help monitor the project's progress and make the project more \"audit friendly\". Apart from that, it would also be great to see more specific KPIs measuring the project's success, and this would give a lot more confidence that the team fully understands and can make necessary adjustments in case of receiving poor results. Overall, more specifications about the proposed application and the figures to track its usage and success are required to help the audit easily and also help the community to track its effectiveness.", "q2r": 3, "assessor": "z_assessor_1716", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 5343, "q0": "Although blockchain technologies are now becoming more and more mainstream, most of the gaming community still perceives NFT/blockchain games (that are play-to-earn) as cash grab or scam. To attract new gamers to Cardano and the blockchain generally, the entry barrier (costs and knowledge of NFTs or cryptocurrencies) should be as low as possible. The team has understood this problem and is trying to address this with their proposal. \n\nThe proposal can be divided into two separate titles, the first one being a story-based game that can be played on the PC or any console. With this game, the team wants to introduce the world and characters to the gamer. As this will be not blockchain based, the entry for a conventional gamer should be fairly simple. With the second title, the AR pet experience, the team wants to introduce blockchain and NFTs to the gamer. Nevertheless, it is stated that the main story (the first title) will be closely connected to the AR app. The AR app will be freely available and will come with basic functionalities (Trybbles NFT) to start playing. However, by connecting the game to a Cardano wallet, additional features and functionalities will become available. Consequently, there is an incentive to get familiar with Cardano and the blockchain system. If the main story is exciting and can attract gamers, there is a high chance that the NFT-based functionalities will be explored as well. Thus, this proposal addresses the challenge closely and could onboard traditional PC/console gamers as well as AR game enthusiasts.\n", "q0r": 5, "q1": "The team has provided a fairly detailed roadmap with clear descriptions for the year 2021. The roadmap for 2022 and onwards is not really specified. In this section a detailed descriptions of the individual steps should have been given. Based on the information provided it seems that many developments have been carried out in 2021 and before. \n\nThe budget breakdown is quite precise, however the funding requested (~240k USD) is unreasonably high for this Catalyst round as 500k USD are allocated for this category. The team should really consider reducing their budget to have a chance of getting funded. It is noteworthy, that the team is aware of this and has provided a statement on that. Nevertheless, for this F8 round the requested budget is simply too high. \n\nThe core team consists of two people with many years of experience in film making and animation. To successfully implement this proposal, the team wants to hire several people for different positions including a project manager, and NFT and smart contract consultants. As the team itself has no software development skills (based on their LinkedIn page), the implementation of this proposal will highly depend on the new hires.\n\nTherefore, at this state it is quite difficult determining the feasibility of the proposal given the high costs and missing software/game developers. Thus, it is not likely this proposal will be implemented successfully.\n", "q1r": 2, "q2": "The team is quite transparent about reporting each of the deliverables via the Catalyst monthly reporting form. However, no milestones were specified based on which to track the actual technical developments. The success metrics are also not clear to me. Hiring new people and building a proper team is not an appropriate success metric. Reaching developmental milestones, or certain active user numbers would have been much better metrics to audit the proposal’s success. The sentence “work can begin on all aspects of the project” is confusing and cannot really be considered a success metric. \n\nOverall, important milestones and KPIs are missing, and no numbers or estimates are given based on which success could be measured. Thus, although the reporting will be transparent, it will be challenging to properly assess the progress within the indicated time.", "q2r": 2, "assessor": "z_assessor_1939", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "The main reason provided for the low feasibility score is the fact that the CA doesn't think that we will be able to hire the right people for the project. Even if this is an area the CA might have doubts about, we think that the rational provided doesn't match the score, as this doubt alone hardly justifies reducing three points from it.\n\nThe Auditability section of the assessment states that “no milestones were specified based on which to track the actual technical developments”, however this indicates that the proposal has not been carefully read as we clearly state that “developing code is not planned for Phase 1 of the project”. In addition we have clearly defined success metrics for what is in the scope of the first phase of the project, covered by the proposal, such as: “recruiting highly skilled individuals for art & community development” and “World-building and a game mechanics prototype are finalised. A production draft of the script for the adventure game is written.” Because of their nature these metrics are not quantifiable, thus the objections raised by the assessment are general ones, that don’t apply in the case of our proposal."}], "solution": "A fictional world w/ 2 initial releases: a traditional adventure game & a blockchain-enabled NFT-based experience, bridging the communities.", "experience": "New Mindflow - 30 years of combined experience in film, TV, apps & games production\n\nCreators of 2 successful CNFT projects: Trybbles & Icons"}