{"id": 399637, "author": "gondlr", "title": "PlayCardano.com ADA Prediction Game", "url": "https://cardano.ideascale.com/a/dtd/399637-48088", "category": 26440, "amount": 55000, "description": "Gamers don't have a gaming destination to spend and win ADA coins. There is also a need for an easy, fast, and fun game everyone can play.", "f6_no_assessments": 5, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 3577, "q0": "For this matter, I would like to congratulate the team on delivering a very intelligible presentation of the game. It is well-written, sufficient in length, the objective and intention are clear and closely align with the desired effect of the challenge setting. I’m aware that the prediction game scene (sometimes misinterpreted as gambling) focusing on grand sports tournaments like the World Cup itself is not an unprecedented thing in the current society setting. Yet, I believe that the cryptocurrency token integration into such games is a fairly new idea, so this project should have the untapped potential to lure in a large number of gamers to Cardano, and the proposal suggests doing just that. I genuinely like the exclusive attribute of the game where it is only accessible to players who are part of the ecosystem, which should create a tingling urge within the non-Cardano gamers to join Cardano. There is also a detailed description of content and features taking place in the game, along with the attractive reward mechanism that, in theory, should be of great interest to players. The proposal also brings along a possible obstacle to its future, and quickly addresses with a rather viable solution, though I’m not sure whether it will be 100% effective or not. The only small flaw, to me at least, in an otherwise great presentation is the missing of core metrics. Given that the game already guarantees to pack a fun and rewarding gameplay experience, It would be logical for the proposer to add details or figures of key metrics to further captivate the audience, such as an approximated number of a user base or how many ADAs or Tokens are expected to be utilized for the game.", "q0r": 4, "q1": "It’s interesting to note that this is the first project where the development process would take place in sprints rather than a specific timeline. However, the team mentions that they were able to make it work with past iterations of the game, hence I cannot argue about the effectiveness of sprints. Still, I would prefer that the team included what specific tasks would take shape during each sprint, supposedly the team has decided on assigning such tasks into each sprint. Though the roles of 5 team members are listed, I’d like to recommend the proposal to add more of their data including background, expertise and some form of visual evidence to further attest their capabilities. Thus, I cannot specify whether the demanded budget is reasonable or not.", "q1r": 3, "q2": "In this regard, despite there being an evaluation criteria for the team to resort to, I sense a lack of auditability since they fail to mention how the community would keep track of the project development progress, hence, my suggestion for the adoption of tracking tools such as ClickUp, which is an effective platform for such purpose. Nonetheless, the intended success for the project is also relevant and adheres to the desired outcome of the challenge setting, which is commendable.", "q2r": 3, "assessor": "z_assessor_1664", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3753, "q0": "The Impact part of the project is well written. The goal of the project is clearly described, showing the impact on the Cardano ecosystem, so I can say that the project is aligned with the challenge.\nThe functions of the game are described quite easy to understand. but it would be nice if the author could attach more references to this game and similar games the team has built before.\nThe risks and solutions are also mentioned, but the solutions on the methods of integrating with a cryptocurrency directly are not really clear, I think the author should describe the solution more clearly.", "q0r": 4, "q1": "Unfortunately, this part is covered very little. This makes it quite difficult to assess the feasibility of the project.\nThe roadmap part has an estimated time of 6 months but lacks a detailed plan description with quantitative indicators at each timeline.\nThe budget part is also quite short, making it a bit difficult for me to visualize the specific tasks and completion time of 3 parts: Technology, Project Orientation, Marketing Cost.\nMembers also lack specific information. I think the basic information about full name, resume, work experience, outstanding achievements and references should be added to this section.", "q1r": 2, "q2": "The measure the progress and the development section is still generic. The author does say that the project will follow a weekly and monthly developing structure with goals and milestones, but the author has not provided good KPIs to measure quantitatively and how the community can proceed with project progress tracking. Items showing that the project has achieved its goals should also be described in more detail.", "q2r": 2, "assessor": "z_assessor_1674", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4090, "q0": "As the proposer say it themselves, this project will meet a clear objective \"propose a way for gamers to be onboarded into the Cardano ecosystem through the thing they love, gaming\" and I agree with them. Betting football games is very simple and enjoyed by a lot of people. If it’s quick and easy to access, run fairly and a tempting rewards system, it’ll be a solid success. The team has an advantage that they has run a similar project in the past with some airlines, and I’m sure they can use those experiences effectively in this challenge. The proposal has addressed clearly its target, its purpose and how it’s going to help achieving a mass adoption to Cardano. Not being overly confident, the ream also has a clear of idea of what they are missing and show that they have some idea for that. In conclusion, in my opinion, this idea is simple but yet has a lot of potential to it. What lacking here is more description of how the betting system works and the system security aspects to make it a fair and safe platform for all players. \n", "q0r": 3, "q1": "Although i like the idea, I think that this proposal is lack of a detailed timeline with set milestones and target. There should be an outline of what the team is working on to see if the plan is actually aligned with the idea, and also from there we can also have a fair justification of the requested fund. Even for the team’s member, it’s good to have more descriptions of the team like what type of skills and experiences that the proposer will need from the team member to get the project run smoothly. Without those details that I mentioned above, this proposal still looks like a very vague idea only and there’s nothing there to help the community to picture how the product will look like. ", "q1r": 2, "q2": "Since there is no  milestones or key metrics provided, i don’t find that this proposal has a reliable source to be audited. The team really need to have a lot more research and work on more planning to come up with a clear KPIs with time-related target, otherwise, it shows nothing to the community that this proposal can actually achieve what it promises us which is “ \"propose a way for gamers to be onboarded into the Cardano ecosystem through the thing they love, gaming\" ", "q2r": 1, "assessor": "z_assessor_1703", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4303, "q0": "I would like to appreciate this proposal of the author; it's not only a good fit for the challenge's goal, but it's also incredibly interesting; the content is presented in the manner it should be: directly, succinctly, and precisely. From my perspectives, the proposal is intriguing, and it fits the challenge perfectly: \"propose a way for gamers to be onboarded into the Cardano ecosystem through the thing they love, gaming\". By creating a game for Cardano members and non-Cardano gamers, I believe that this would certainly help in get more members, retaining users, which gives them more entertainment and enhance their loyalty. Firstly, the author has offered us product features like it is a gaming system that works with different currencies (airmiles) and allows members to Earn or Burn that currency in all games. Also, target users are indicated. Anyone can play this game but only Cardano members who win ADA or Tokens can exchange for prizes. The game's operating principles are as follows: players will engage in guessing the results of matches in the FIFA Qatar 2022 Football Worldcup, and  the rewards will be based on their predictions whether they are coincident with the consequences of each match or not. Moreover, in this section, I noticed that the proposer stated who could join the game, what they achieved, but did not mention the specific amount,which I think is not synchronized with key metrics. In addition, I think that the Impact section of the article would be better if the author clearly demonstrated the benefits to the project in general and to the developers, investors and participants in particular. It is also positive that the proposer presents a challenge they faced. It's that they haven't found an alternative since they've never integrated directly with cryptocurrency. And of course, the author offers a solution to the challenge they face, but I think they're not quite sure how to do this when they use the word \"probably\". If possible, they should explain more clearly what \"the tools we have\" includes? Generally, the idea is very interesting, and it also can fit the challenge and benefit the Cardano ecosystem users, perhaps bringing in new participants; However, I believe that it would be better if updated some details which I discussed.", "q0r": 3, "q1": "If this proposal is to be carried out successfully, I believe the team should gather profiles containing various skills and experience. This includes expertise in establishing, designing, developing and managing web games, project, budget, staffs, etc. Regretably, no links or documents were furnished to verify the experience or skills of employees depicted in the proposal. I suggest that the team should add a detailed description of the team's skills and experience be included. Besides, the article has a clear timeline but has not gone into details of what to do and the tasks of each person in each estimated period of time. The team approximated the budget that will be spent on the project, mostly in developing and integrations. In addition, it is obvious that there is a detailed allocation and listing of the budget to be spent on what positions and tasks, taking Technology, Project direction, Marketing expenses for example. But they have not planned the backup budget and expenses yet. Furthermore, although it is possible to indicate the number of people for each position, I encourage you to be more specific about the total number of people employed and an estimate of the number of people involved if possible. Likewise, it would be good to have a detailed record of the job and duties of each job position that you assign. Along with the above comments, my rating for this feasibility part is 2.", "q1r": 2, "q2": "The proposal lacks a roadmap and a schedule for the delivery of the various elements of the projects, as stated in the feasibility, and this type of information could be crucial in assisting the community in keeping track of the proposal's progress. In addition, I am quite disappointed to see that the team has not really invested a lot of brain in this project. No KPI are shown, for this project it would be good to keep track of. For instance, Number of CNFTs made specifically for gaming, amount of comments and kudos given to submitted proposals, amount of ADA and Wallets voted on proposals in this challenge or amount and evolution of gaming based tokens and wallets, etc. Due to the inability to assess the required skill set, auditability is also challenging. There have not been any risks identified or addressed. According to the comments I pointed out above, this proposal should be improved if the team want their project to be invested in the future.", "q2r": 1, "assessor": "z_assessor_1717", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 6086, "q0": "This is a very clear proposal and fits in this challenge ,i put some of my questions on the comment section to the proposer.\n\n\"note this is covered by insurance\" - This line should have clarified how it will insure bets/winnings from people all around the world and the logistics since crypto is slightly different from a loyalty program because it covers a wider audience of different locations and laws.\n\"Members will complete a short registration form on the gaming site, selecting a unique username that is required for leaderboards, as well as providing limited personal information. \" - why isn't Atala prism (https://atalaprism.io/app) used for this since it handles Identity well and can help cut down development cost.\nThe technology used to integrate with cardano was not discussed, will the predictor game depend on an Oracle(external source of data) to resolve winners or will this be manually done?\nI will be giving a 5 star despite the issues raised as they do not affect the impact of playcardano.com if implemented and therefore i am not taking any points off and also The proposal acknowledge the lack of experience with a crypto project.\n", "q0r": 5, "q1": "The proposal provided a detailed cost breakdown with verifiable links to team member with a very well written roadmap.\nIf i am permitted to advise , i would like to encourage the proposing team to break the project across funding rounds to give the team ample time to adopt and get familiar with a crypto project.This will also lower the requested amount and further get this proposal to be funded.\nI am giving a 5 star.", "q1r": 5, "q2": "The proposal provided all the necessary information to audit the progress of the proposal though i will encourage the proposing team to provide links to github or management tool for the community to also be able to track the project independently.\nI am giving 5 star.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "A proven successful WorldCup prediction game at a new gaming destination: PlayCardano.com\nSpend and win ADA on all games in the platform.", "experience": "We have +10 years of experience in gaming and loyalty, we've been selected by British Airways' incubator to integrate games and miles. We build white label game solutions on different currencies. Our system has many games plus an administrator to manage leaderboards and winners."}