{"id": 400008, "author": "heinz.gassner", "title": "DLT360: Metaverse - Requirements", "url": "https://cardano.ideascale.com/a/dtd/400008-48088", "category": 26440, "amount": 25000, "description": "WEB 3.0 and Metaverse recently became inflationary used buzzwords, but minimum requirements regarding solid tech-foundation are lacking", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2131, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: Behind the wider DLT360 umbrella lies another sub-project focused on the Metaverse, with 4 branches. This proposal focuses on the 4th branch - Investigating the necessary technical requirements behind WEB 3.0 and the Metaverse.  \n\nI see striking similarities with the other 3 branches of the same sub-project and I highly encourage merging them in scope for future iterations. ", "q0r": 3, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: project would comprise a literature review,  expert interviews and most likely an academic paper together with University of Malta. For budget core-work rates are 50-75 USD/hour. Literature review and analysis take up 60% of the budget. \n\nAgain, striking similarity in scope to the other 3 branches and again, suggest merging them for future iterations. ", "q1r": 3, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.   \n\nSpecific part: Basic KPIs are offered, a few of them a bit unclear, for instance it would be useful to explain a bit better what kind of ratings would be used and who would perform the academic quality check.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3375, "q0": "This proposal is a continuation, so it will focus on the fourth aspect of the big picture. They have updated some information related to their past work, allowing the community to review their current progress and achievements so far. They explain the motives behind this project and their main goals in supporting the Cardano network. The expected outcomes have been well aligned with the key metrics of the challenge. These results are believed to grow the Cardano ecosystem and help the clients make the best of WEB 3.0 and Metaverse. \nThe team state that there are no specific challenges and risks since this is an ongoing project. The community can see the effectiveness of their operation process and thereby have more trust in their ability to ensure smooth work. The upcoming challenge is foreseen, and with their experience, they will be able to propose a good addressing plan and overcome it.", "q0r": 5, "q1": "Their project's activities are monitored by a business model canvas and segmented into specific elements, empowering the community to easily track. They have listed these elements in a clear and logical order, benefiting the community in close assessment. They also keep the community updated about their work status in fund 6 and 7, which helps increase the clarity and feasibility of the project. A detailed action plan for this proposal during Q3/2022 is noted with key activities and deliverables that need to be accomplished. This plan is suitable for the development path of the project. \nAccording to their key activities and resources, they offer a detailed budget breakdown. The costs are well estimated and calculated, double-check can be easily done if needed. This financial strategy helps the community evaluate how the team allocates the fund and avoid capital deficiency. \nThe information about the team members is provided. They have covered their positions, a brief description of background and LinkedIn accounts for further consideration including working experiences and activities. The community can base on this information to examine their strength and ability to develop the proposed project.", "q1r": 5, "q2": "They have provided necessary KPIs supporting the progress and success measurement. These KPIs are closely linked with the activities and objectives of the project. The community can use these indicators as a source to follow the execution process, ensure these results are effectively attained. These are also the vision for the project’s success. Achieving these KPIs, the team can assure the project’s positive impacts on the targeted audience and the Cardano community in general. ", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3755, "q0": "The author has described the features quite detailed and easy to understand in supporting Cardano in making sure that the fund is wisely invested. As a result, readers can understand the main operating mechanism of the project as well as more easily assess the impact of the proposal.\nHowever, the solutions to the risks that come from the need to pack their activities into single projects have not been well analyzed and are still general. Specific measures should be analyzed and added to this section.", "q0r": 4, "q1": "I think the project can meet the outline.\nThe budget section is quite reasonable when divided into sub-sections that fully detail information on the number of hours completed and the unit hourly price of each item. The information about the members of the team is also mentioned with full information about work experience and detailed profile attached.\nIn addition, the author describes quite carefully the detailed plan and time of the plan (Q3/2022), but I think it is better to have a specific time for each main activity in the plan.'", "q1r": 5, "q2": "The progress monitoring indicators of the project are described by 4 specific quantitative KPIs (Progress of activities as outlined above, Number of partners and interacting projects / initiatives, Passing academic quality check, Overall Ratings of the Result) with specific time (Q3/2022). The success of the project is also described by clear indicators.\nHowever I think it would be better if the author could describe more the tools used as well as how the community can use to track project progress (website or other tools). From there, it is easier to evaluate the auditability of the project.", "q2r": 4, "assessor": "z_assessor_1674", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5346, "q0": "NFT (CNFT) games are becoming more and more popular in the blockchain community. The recent announcements of Meta (Facebook) trying to build a metaverse has caused global interest and motivated companies and developers to start building their own virtual universe. As the team states correctly, this has led to an inflationary use of terms like “metaverse”, “Web 3.0” and “blockchain technology”. Even within the Cardano ecosystem several groups have joined forces to build “THE” Cardano metaverse. Although the efforts are good, we are far away from seeing a true metaverse. This is mainly due to it being a novelty and clear technical requirements are not specified, need to be researched on and actual frameworks are missing.\n\nThe proposal is addressing this problem. With literature research, the team wants to come up with the minimum requirements for building a solid metaverse and Web 3.0 applications. With a good and viable tech stack, metaverse projects could be implemented faster at potentially lower costs. Exciting and safe metaverses that are build this way could attract many users to the Cardano blockchain. \nThus, this proposal closely addresses the challenge and could have a strong impact on the Cardano gaming ecosystem.", "q0r": 5, "q1": "A detailed roadmap with dates was not provided. However, since this proposal does not cover technical developments but rather aims at doing literature research (and publishing the results in an academic paper), providing specific dates might be difficult. The proposal states that all of the work packages will start and finish in Q3 2022. While this seems very reasonable for the literature investigations themselves, I am unsure whether a paper can be published within that time frame.\n\nThe budget breakdown is detailed but the overall requested funds are quite high given that no technical developments will be under carried out. Money spent on the bi-weekly meetings (3,750 USD) could be reduced for instance. As we all know, many of our daily meetings could be shorter and most things can be typically answered in an email. I am also not sure what “Active cooperation with partners from inside and outside Cardano” refers to. Consequently, I would suggest the team to either specify this point more precisely or reduce the requested budget. \n\nThe team has strong experience in DLTs, blockchain technology and project management, showing their capability to deliver a research summary. Thus, I am certain that the proposal can be implemented successfully, but given the comparatively high amount of funds requested, a 4-star rating is appropriate.", "q1r": 4, "q2": "All progress updates can be tracked in the team’s DLT360 MIRO environment. This allows for transparent progress and success auditing. The KPIs are stated clearly, and detailed numbers are provided if applicable. The academic quality check will be an important milestone and will enormously contribute to success or failure of the project. Overall, the information provided is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_1939", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will do literature review, research and discussions with gaming & cross-chain experts, aiming to propose a minimum viable tech-stack", "experience": "The DLT360 Domain Expert Team and the contributing network with\nSenior industry leadership experienceSpecialised University experts, assistants and studentsIndustry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}