{"id": 400284, "author": "wynwyn87", "title": "Find & organize eSports tournaments", "url": "https://cardano.ideascale.com/a/dtd/400284-48088", "category": 26440, "amount": 167000, "description": "The majority of gamers don’t earn any real-world value from playing video games or competing in tournaments.", "f6_no_assessments": 7, "f6_rating": 3.380952380952381, "videos": [], "media": [], "f6_assessments": [{"id": 7399, "q0": "I think the proposal aligns well with the objectives of the challenge, although the matches themselves could be better explained. Our goal in the present challenge is to fund games that help popularize Cardano and its technologies to the gaming public, games that make more people know and understand the advantages of our blockchain. This game involves several Cardano technologies: it would be a “play to win” style game, where players would participate in rounds (tournaments), in which: to enter the game, they would need to pay a small fee; if they win, they will be rewarded in Ada or NFTs minted on our blockchain; players would be free to choose the characteristics of their matches, such as the number of players at a time, the minimum level of each to participate, whether players would have to broadcast their games, and so on. From what I understand all rewards and payment of fees would be done through smart contracts on Cardano. In other words, the game addresses technologies relevant to our blockchain at various points, as I said, and this makes those who play enter the community kind of unconsciously. In case the people that the game is profitable and it becomes popular, new members would be attracted to Cardano in an organic way. What I think was pending here was to explain the exact functioning of these games. Would it be a poster game? How would players compete? It would be interesting for the proponent to explain to us in detail how this gameplay would be in practice, even to understand if it is a more accessible game or more geared towards those who already have the habit and ability to play. Therefore, I think the proposal is good, but to be 100%, more explanations would be necessary. \n", "q0r": 4, "q1": "The viability of the project is not very good, unfortunately. Starting with the script, we don't have a schedule per se, we don't know which phases would make up a whole and how long each one would take. What we have is a list of activities to be developed, but this is not a roadmap, this is really information about how the process is divided into actions, but do you understand that to be a roadmap such actions would need to be organized in a timeline? The bidder says that the requested funding would last 12 to 24 months, but let's use the 1 year example to make it easier. In 1 year, how would these activities split up? In the first month, what would happen? And in the second? It would also be necessary for the proponent to attach a brief explanation of each of the tasks, so that we can better understand each one and how it would work. We need to understand if some depend on others, and how this relationship takes place, that is, some could only start to be done after the completion of previous tasks and so on. The establishment of deadlines would also help us to audit the proposal, as I will comment on the topic below. Regarding the budget, very high funding is requested, 167k USD, and I don't think it's argued well because it would take so much. The bidder divides this amount into smaller parts, which is correct, but would it be necessary to detail why, for example, just the smart contracts + wallet integration part would cost 96k alone? Who would work on it, what would their work routine be like, how many hours would this job be done, and how long would it take to complete? As in this example, the other parts could be better explained, such as the marketing part. Despite being one of the cheapest (5k), I would still like to understand who would work here, doing what and for how long... Regarding the team, finally, we don't have an individual detail of who would be the team's professionals . We know the type of professional involved: developers, manager, designer... But who are these people? What are their names, what have they done so far in their careers, how do they relate to the Cardano ecosystem? Without knowing each one of them in depth, trust is not transmitted in the team. Therefore, I think the feasibility of the project still has a lot to improve. \n", "q1r": 2, "q2": "In my view, the proponent lists good indicators to measure the success of their project, such as the number of CNFTs minted on the platform, number of active members versus players, value earned by players, etc. Success would be a new blockchain gaming platform that manages at the same time to expand, benefit its players through the possible profit generated and popularize the Cardano ecosystem in the meantime. I believe these are really the necessary monitoring statistics, but how are we going to audit this? Regarding the results, the proponent should monitor such data and after that, take them to the knowledge of the Cardano community. This could be done through the preparation of monthly reports or even by the participation of the proponent and his team in some room after Town Hall, in order to explain what final results the game has been achieving. Now about the process, the proponent does not outline any form of auditing, I think this part is really difficult to follow since we don't have any exact timeline for the development of the project. As I suggested earlier in feasibility, it is necessary for the proponent to establish dates, deadlines and a maximum time for each thing to be done, in this way we would have an idea if the construction of the whole is going as desired. This would also need to be brought to the community constantly, as it is a game, and games are almost always complex projects, I suggest that some members of the Cardano community closely monitor the progress of this process and gather the main updates, taking them to the rest of the community members. This could also be done on a monthly basis, I think it's not too big and not too short a time interval for us to audit the progress of the proposal. With that, I conclude that: the proponent places us well on the auditability, of the final results, but not on the process of building the game. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1737, "q0": "The proposal touches on the core of the challenge. The proposal is therefore highly impactful and meets the challenge. The proponent has properly adopted the digital game on Cardano. Helping gamers have fun with their favorite games. You can have the opportunity to fight, promote your technique and experience to get revenue from in-game rewards. Incentivize the Cardano ecosystem. It will be a big effort for you to apply globally. You have seen the risks and have had solutions when implementing the project to create more confidence for your project. Players will become part of the Cardano community. Raise income and develop the ecosystem.", "q0r": 5, "q1": "The proposal includes a detailed roadmap. However, it would be beneficial to have a timetable and budget broken down into milestones. That will make your proposal even stronger. With a total proposed funding of $167,000. I'd like to see a more in-depth explanation. For example: Developers ... will be how many people, how long they will work and the funding allocated to them. I lack confidence in the success of the project when the identity, skills and experience of the core team members are unclear.", "q1r": 3, "q2": "It would be difficult to audit and measure project growth without KPIs with milestones. Adding good key performance indicators will be valuable insight into the success of the project. A brand new project will be a profound experience for you.", "q2r": 3, "assessor": "z_assessor_1409", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3580, "q0": "Overall, I find this project to be highly engaging, viable and beneficial for the Cardano ecosystem, while aligning with challenge setting of drawing more gamers to Cardano. Based on my knowledge of the gaming community, a majority of eSports titles do not currently include a tournament-hosting feature for common players, and grand tournaments can only be held by numerous sponsors at spacious locations such as an arena or a stadium, involving the professionals of a particular title. Therefore, the thought of putting together a tournament for me to compete with my friends or other gamers in the community (or just simply joining a local one and enjoying the showdown) does sound intriguing. \nThe proposed solution does exceptionally well on demonstrating how the system functions in practice, with all features laid out in detail, and mentioning how the participants are rewarded for their victories using Cardano’s native token, ADA and/or NFTs, resulting in more players coming to this platform.\nThe proposal also brings up the possible challenge and risk for this project, and also manages to come up with resolutions that could prove to be fruitful.\nThere are some tweaks, however, that I would like to add. Firstly, in the target audience section, I think the proposer should also include console gamers into the mix as the number of console gamers is steadily climbing, and specify on what counts as “skill based online games”, as there are a number of game genres currently (for instance, Battle Royale, First-person Shooting or Multiplayer Online Battle Arena), each containing various titles to take into account. Secondly, in the certain rewards/perks for players section, a few more examples should better make the case. Last but not least, I believe the proposer did not state any particular figures for the key metrics, other than the reward for early adopters. For instance, they could give an assumption of an user base at a time mark or how much the players could earn by participating.\n", "q0r": 4, "q1": "From the listed plan and suggested budget, I can assume that the project may hold potential for success, as the plan consists of specific stages and the budget is quite reasonable. I especially welcome the included financial forecast, as it indicates the proposer has made careful calculations for the project. Personally, I strongly suggest that the milestones for each stage be added, or perhaps divide the stages into quarters or other time periods to better grasp the timeline of the project. And while the duties of the team members are categorized, It would be a wise decision to add the information and background of the existing team members (if there were any).\n", "q1r": 3, "q2": "In regards to auditability, I believe the proposed KPIs do align with the key metrics posed in the challenge setting despite the fact that this is a new proposal, though I feel like it could always use the addition of a measurement system or methodology. And for the most part, this project promises to deliver success and favor the Cardano ecosystem, as it aims to bring in more players to this platform based on the Cardano blockchain.\n", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4092, "q0": "I think this proposal somehow aligns with the challenge settings as I understand the team wants to add a function for players can create their own tournaments using the existed games resources of the ecosystem. I think this function can help the community become tighter and players can actually compete on a fair platform using their gaming skills to bring more benefits for themselves. I think competition is one of the best ways to keep gamers interested in a game. With the concept of this proposal, games can be more than just playing around but also a way for gamers to invest their time and effort to achieve somethings else. The team can take advantage of the ecosystem’s resources such as tokens, pre-existing games, platform, reputations and so on, that sounds like a lot of steps ahead to me. The awards system is built on players’ entry fee can also motivate gamers to keep coming and try to win matches. And I also like the idea of using smart contract to build trust between gamers. It creates a huge funding security for both sides involved, the tournament creator and gamers. I also agree with the risk that the team has addressed which is match adjudication for non-integrated games and an implement step is certainly needed to keep it a fair playground and no loophole in the reward system. However, when it comes to results being validated via on-chain consensus voting by users, i suggest the team should also have a solution to prevent the risks from hackers who can sabotage the vote. ", "q0r": 4, "q1": "In term of feasibility, the plan that the team provided seems to follow your promised plan. Each step has been considered thoroughly. However, I want to suggest to add more milestones or a clear short and long term plan. 12-24 month is a long time with a huge gap, hence we would like to see how you arrange every stage around that time. The best way, in my opinion, is splitting it into smaller time durations and let us know what exactly you will do in each period of time. It also helps the team follow up and check in with the whole project and make adjustments (if needed) easily. For instance, 1 month to create social media accounts for community engagement, release lite paper, mint the platform’s native asset, build a community. For the budget breakdown and team members’ role, i think it already fairly fits with your aim.", "q1r": 3, "q2": "For the auditability, thank you team for giving some clear bullet points of different aspect to audit the project in the future. I think these aspects will be very effective. With a correct tool, it’s totally possible to get those numbers. If anything I want to advice, it’s the closer look of your potential success. With a clear key metrics, i hope that the team can share some of their expected numbers to define success. For instance, total number of community members vs active members after a certain amount of time, how many percentages of the budgeted financial forecast will be met and so on. ", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4291, "q0": "From what I can understand, this team is trying to build a platform that allows gamers to self-organize eSport tournaments. In my opinion, the author has done well in thoroughly describing the main features, functionality and components. It is also remarkable that this proposal has a part showing the group of people the team is initially focusing on - PC gamers along with the future target - mobile gamers of skill-based online games. Another bright spot of this proposal is that it does clearly explain how the Cardano ecosystem can benefit from its win-win platform/infrastructure. In more detail, this platform does not only provide players with a place where they can train their skills and use them to earn value but also serve as a lure to attract gamers joining the Cardano ecosystem since the in-game currency is in the form of ADA/ Native Tokens/ NFTs, and if they want to get the most value out of it, some knowledge about Cardano is undoubtedly important. Challenges and possible risks being staff recruitment and match adjudication are also foreseen, and the author does suggest some potential solutions to solve them. However, with my experience of several years in trading crypto and NFTs, information security and hacking are two huge predictable issues, and as people are capable of making real money using this platform, it is even more urgent for the team to add some of their thoughts about how to deal with those issues. In conclusion, with all of the above mentioned, I have a firm belief that with a few improvements, this project can achieve success in the future and simultaneously bring great value to Cardano.", "q0r": 5, "q1": "In terms of technology and architecture, the roadmap of this proposal has provided everything necessary to understand the process of creating the platform. However, it does lack an important factor for the community and stakeholders to assess its feasibility, which is the timeline. There is not even the estimated amount of time required for different steps, and since there are numerous things to do in the worklist (at least 27 work items from the beginning till the end), I wonder whether the time that this team must take to complete the project would be too long or they already have some kind of solution to this, for example executing some parts simultaneously by building a big team with many members who are responsible for different parts of the project. There is also another point that needs to be improved, and that is the step “Mobile app coding and UX design”. This goes after the sponsorship functionality of the platform is finished, and with my experience, instead of taking the completion of the “For PC gamers” part and the start of creating the “For mobile gamers” part as two continuous, non-stop phases in the plan, it would be better if the team put in some market surveys or user polls in between so that they can get statistics which are crucial to the platform’s development. However, besides some fields in need of further improvements, information about the budget breakdown and details of team members required are sufficiently provided, and they are closely aligned with the given roadmap.", "q1r": 3, "q2": "Despite the two previous parts which are relatively well delivered, it is almost impossible to accurately assess the auditability of this project with so much important information being absent. Yes, there are key metrics to measure the progress, however, there is no specific number or KPIs given so it is difficult to evaluate the team’s effectiveness and the project’s quality. The success for this project is also vaguely described in the proposal. The term “see consistent growth and uptake from new users participating in tournaments”, for instance, is too general since which level of growth rate defining success is not clarified. Overall, almost everything here is not detailed enough to decide whether this project succeeds or fails.", "q2r": 2, "assessor": "z_assessor_1716", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4479, "q0": "it is obvious to me that the team worked really hard on this project. There is no doubt that eSports are becoming more and more popular in this day and age. Features and functions of the platform are described clearly and completely. The audiences and users are targeted logically, PC users on the first step and mobile users for the next step. I wonder can we concurrently deploy the PC and Mobile platform at the same time since mobile users are an extremely potential market. Generally, this proposal meets the challenge setting KPI by increasing the demand of using NFT’s. Attractive promotions and rewards are given, which will create an enjoyable environment for users. The first risk that is mentioned is hiring problem, working remotely can cause lots of management issues during the project. The team already had a plan to raise the employee awareness, although I suggest good salary and benefit policies can also be a solution for the employee willingness, loyalty and contribution. The second risk is an inevitable problem which also comes with a reasonable solution from the team. Mainly, this is an interesting proposal to know, highly appreciate the creative and significant side of this proposal.", "q0r": 5, "q1": "from my point of view, the author has a good vision of the detailed plan, all stages of the project are listed logically. However, we would like to have a timeline for these steps. To be specific, how much time will we need to complete these tasks, how many people will be in charge, etc. Furthermore, we also need the KPI or target to measure the possibility of the project. A pipeline with breakdown metrics is a necessary thing for this proposal. The team provided a good detailed budget which matched with the plan, but I am convinced that we will need the number of team members and their information to consider the feasibility of the proposed budget. Please inform us about your targeted team members, such as their work experiences, similar projects that they have joined or their LinkedIn profiles.", "q1r": 3, "q2": "the proposal has clear validation to maintain the project, however we will need the verified metrics for each validation and also the similarity between these validations and the challenge KPI. The team can give us an estimate number of community users, trades, or tournament arrangement and website growth rate, etc. Let break it down with aligned roadmap and timeline to scale success or to find out the solutions for any failures. The team can also do some researches on similar projects to have improvement on their own. In conclusion, we will need realistic numbers to guarantee the proposal possibility.", "q2r": 3, "assessor": "z_assessor_1726", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7036, "q0": "the proposal addresses the challenge as its trying to provide tournament infrastructure as an additional value layer for gamers to earn an income over and above a native play-to-earn game.", "q0r": 5, "q1": "The proposer did not present a team, he is still seeking for members to join his team and no proof for the skills claimed by the proposer was provided. \nThe only exception is for the website, which is just one page and links are not working \nMoreover, the benefits of the proposal are merely listed as a series of bullet points, without synergistic effect.\nTokenomics of the Dapp is just mentioned but not elaborated. \nAt this stage, financing this proposal with more than 150000 USD as requested seems definitely a risk.", "q1r": 1, "q2": "The timeline is not outlined (for each deliverable there is no estimated time for completion and no explanation on how that target will be reached) and the budget breakdown is estimated to be sufficient just for the first year (out of 2 year of project development). \nAt this point one might argue that as the project is at its initial stage, the description of each deliverable cannot be so precise, however for the same reason, the budget required should be lowered to create a first proof of concept and then request for additional funds.", "q2r": 2, "assessor": "z_assessor_530", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "To provide tournament infrastructure as an additional value layer for gamers to earn an income over and above a native play-to-earn game.", "experience": "+9 years as a Crypto enthusiast (+3 years Cardano)\n+5 years Consulting experience\n+3 years Business Analysis & Project Management experience\n+4 years Entrepreneurship and start-up experience\n+1 year Cardano stake pool operator\neSports fan with a lifetime of gaming experience"}