{"id": 400760, "author": "renemacarthur", "title": "Road To Royals Card game", "url": "https://cardano.ideascale.com/a/dtd/400760-48088", "category": 26440, "amount": 22000, "description": "Many NFT Card games require large amounts of cards that are inaccessible to many cardano new comers and smaller Ada holders.", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea of implementing the use of NFT's in a card game is a great combination, since naturally games of this style have rarer and more sought after cards, so when establishing the commercialization of these through NFT's, there is an additional incentive to play. Additionally, we realized that the game (now using NFT's) will be based on an existing one, which is a good indication, as it was not an idealized project aimed only at the commercialization of the cards.\n\nThere is also a website already built that explains the game's story and shows already made characters, helping to bring credibility to the project. With that, we realized that this proposal fits the goals of the challenge in question. In addition, the success of the game also indicates that new users will be using Cardano's technologies and increasing their visibility, so there is a positive impact in the medium and long term.", "q0r": 5, "q1": "However, it is not possible to point out so many positive points in relation to the feasibility plan, as we realize that it is not very structured. It is well known that the long-term success of a game is highly related to maintaining an active and engaged community of players. And although the proposal mentioned a concern with the creation of this community, we see that the development of the game will be carried out by other professionals who are not fully connected to Road To Royals. This fact of outsourcing the production of the game can cause it not to get the necessary personality to remain interesting in the long term.\n\nThis point is even one of the negative points of the feasibility project as a whole. As mentioned, the game is expected to become quite popular so that a player doesn't have to wait long to find a match online. But achieving such visibility for the game with a team that currently only has one professional seems unlikely at the moment. It would be nice if a more complete team were formed, with people with different experiences and knowledge that complement each other, also with the availability of CVs. Regarding the budget breakdown, it also seems interesting that a greater amount of resources was allocated to marketing, currently only about 10% is being earmarked for this, and today it is quite remarkable that games use more and more capital to gain visibility.", "q1r": 2, "q2": "Regarding the metrics chosen to monitor the success of the game, we note that there are good indicators to observe different aspects of success. This shows that there is a plural concern not only in relation to what was spent to make the game, but also with the consequent engagement, a fundamental characteristic to keep the game alive. Another interesting point is that the value of rare items in the game will be observed, which helps to validate the success of the NFT model in the game.\n\nComplementarily, it would be nice if metrics were added that help measure the direct impact of the game's possible success on Cardano's ecosystem. One idea would be to conduct a survey to try to find out how many players created wallets to obtain ADA solely because of the game.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "I love the proposer instinct to switch from physcial card game to NFT game. Proposer's game ideas meets very well what the challenge seeks. The idea to make it cheap and more accessible will encourage small (quantity) ADA hodlers to try this game. If the project succeeds, it would be a good gateway for new users to the Cardano ecosystem then they maybe could make new users curious about everything in Cardano Ecosystem. So I believe the project would benefit the Cardano ecosystem.", "q0r": 5, "q1": "The website are already build (early phase) and seems like it's promising games! Outside of that, there's no link to check proposer's credential. I try to find it in About page, but I found nothing except well written bio and the company which I can not search its credential too in Google. I think if proposer attach some previous portofolio (previous board game), it will be great! While the roadmap seems like it is realistic, proposal's budget are not clear and broken down. It only tell about Developer Consultation and Marketing. What about website maintenance? Creating a game app and maintaining it? Any detailed information will help readers to make sure if this proposal get a funding, Proposer will run it smoothly.", "q1r": 3, "q2": "Love the author's determine to explaining the project with a clear and understandable explanation about the problem and the solution author want to solve. While the website already there, we (the community) can easily audit your progress. Adding some roadmap in this Game's Website will help prospective player take interest to this project. Overall the auditabily is perfect, no need to criticize.", "q2r": 4, "assessor": "z_assessor_639", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "After reading this proposal and visiting website, I think this is quite a promising project. The proposer plans to create a series of games, however in this project, the proposer mentions a NFT Card game, namely a Road to Royals which is not only accessible to new comers and smaller Cardano holders but also easy, quick and cheap game for everyone. Its main customers are audience of board game, card game, fantasy and social gamers who only pay a low cost entry to play. After all, the proposer does quite well at the early phase of this project. ", "q0r": 4, "q1": "Well, it is clear for about concerning his plan and budget for this project. There might be one typing mistake in the timeline is Q1 2023 instead of Q1 2022 to develop a next game. Also, the proposer knows that to develop this project, he need more dedicated and talented team members as developers and experience in marketing as he is the sole member of this project at this stage. However, the proposer is ready to launch project this year as he have developed a board game over the previous year. It shows that the proposer is serious and confident about this project. My concern is that I would like to see more marketing strategy for this project in the long term to make this project more popular to community.", "q1r": 4, "q2": "Well, it is possible to track the progress of this project by some key metrics: visiting his social media channel such as Twitter, Discord,..or see how active the community members are, or check the growth of card sales,...I hope this project receives more support from community for the next phase of the proposal. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Concept is good, the proposer has a solid point that the entry cost to NFT card games is often quite high.  Creating a game system that reduces entry barriers and encourages more players is sound, however I do not see a lot of information on how exactly they intend to accomplish this.", "q0r": 4, "q1": "The developer has some attractive art to show at the moment, as well as some claims that they are in contact with other potential developers capable of producing the game, however the proposal is lacking specifics, and I am unsure what \"$20,000 USD Developer costs as per consultation\" means.  A better breakdown of what is being spent on what would be helpful.", "q1r": 3, "q2": "Developer's proposed metrics are somewhat questionable.  \"Community member comments\" seems like a meaningless statement for instance, it doesn't address any specific measurable result.  However the concept of keeping a low cost of entry so that anyone can play does seem like an appropriate way to keep a large playerbase, and in keeping with the overall theme of the proposal.", "q2r": 3, "assessor": "z_assessor_708", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Road To Royals Card game is a cheap and accessible card that requires a minimum of 1 card to play, with larger decks also being accessible.", "experience": "I have developed a board game with extensive testing for balancing the cards within the board game. This NFT game uses the systems from this board game. I have paid work in game testing and I am also studying a master degree in business psychology."}