{"id": 400983, "author": "freedmedia1", "title": "METACARWARS, P2E Staking NFT", "url": "https://cardano.ideascale.com/a/dtd/400983-48088", "category": 26440, "amount": 25000, "description": "Purchasing an NFT can be a daunting process for casual gamers due to a lack of interactive and entertaining entryways for first-time buyers", "f6_no_assessments": 9, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7420, "q0": "I think the proponent started the description of this project by promising one thing, but I don't know how it would be fulfilled. He says that, many times, players who are not familiar with the cryptographic world and have never bought NFT are scared by it, because they don't know where to go, basically, and that this project would have the differential of being simpler when buying NFT . But why? How is this action easier here than in other games? This is not clear in the course of the proposal. But anyway, analyzing the impact of the game, I think it can be a good idea, in general it's a racing game in which each car is an NFT, and your objective is to defeat bosses until you pass the level (each race would be in a city, in a hypothetical future). According to the proponent, 10,000 car NFTs would be launched later this year and whoever acquired them would have an advantage over those who would start the game from scratch, let's say. I think this could be interesting for Cardano since the cars are CNFTs, that is, NFTs minted on our blockchain, but I would like to know two things: 1) how players would know Cardano differentials from the purchase of these NFTs? How would you realize the advantages of buying/selling active tokens on our blockchain and not on others? 2) is there any other way in the game to benefit our ecosystem? For example, would there be some transactions in smart contracts? Some shopping in Ada? Would players have to link their digital wallets to the game at some point? In general, I like the idea, I think it can work very well because the racing game audience is considerable, it's already a popular style, and if added to the recent NFT boom, this can generate a good adoption of Cardano for new users. But, it is still a little difficult to understand precisely to what extent this game would relate to our blockchain and what advantages it would bring beyond the minting of some NFTs, or if it would be just that. \n", "q0r": 4, "q1": "The feasibility of the project is good, but not perfect. In general, we have the basic information we need to understand about the roadmap, budget division and staff, but each of them could be explained more (especially for staff). The script is good, the project is divided into 3 phases, each one being a quarter. The activities carried out in these time intervals are mentioned, however, I think it would be better if the time scale adopted was shorter, for example, monthly. Every 3 months is a very long time to follow the progress of such activities, I would like them to be divided like this, by month, so that the understanding of the process is more solid. The level of detail of these activities is medium, some are more detailed than others, it would be interesting if they all had the same level of detail. The requested budget is quite compatible with the dimension and complexity of the project. In other words, I found it a fair value. It is divided into several small parts, so that we can understand the need for such funding. Each of these parts gets a fairly fair share as well, but what I think could have been done to improve this part was the inclusion of the working hours of the professionals involved. I mean, 4.5k requests in 3d modeling, for example. How long would the designer responsible for this work to achieve the end result? If we had such information, we would know the hourly rate of work required for each small part, which would generate an even stronger understanding of that part. And regarding the team, I think that part was the one that left something to be desired, because we don't know exactly who the team members are. We know which professionals would be involved (such as modeller, 2d pixel artist, etc.), and what their skills are, but that alone doesn't give us so much confidence; we would need to know: their names, examples of work they've done before and how they relate to Cardano. In this way, our knowledge about the team would be fully, and not partially, as it is presented then. Therefore, my suggestions for improving feasibility are: specifying the roadmap in shorter time intervals, explaining all parts of the requested funding equally, and introducing more properly the professionals who will be part of the team. \n", "q1r": 4, "q2": "I didn't find the game's auditability very good, it exists but it's not enough, because the ways to monitor its success are very basic (game downloads, website visits and social media engagement), just like the biggest success scenario is plotted abstractly (create an exciting and easy way for players unfamiliar with cryptocurrencies, NFTs and the metaverse to start their journey on the Cardano blockchain). Let's try to delve into this here. Starting with the fact that it's not just the end results that matter. It's important for us as a community to measure all the variables, from the point when the game got off the ground, started its construction, until the moment the final version is delivered and the public starts playing. I believe it is necessary for the team to prepare a summary of the activities carried out each month and make this information available in some way to our community. This can be done through online tools, such as a simple google docs, or something more, such as monthly meetings with some members of the Cardano community, who feel engaged to follow the development of this project more closely. In this way, we would also monitor the process, not just the results. However, it is also important to track whether what was initially intended was achieved, and this could be done by measuring the statistics suggested by the bidder, and putting these research together into perhaps infographics that could be presented again to the rest of us. This is something that would happen towards the end of the project and would perhaps require a single meeting with more participants, so it could be done in some debating room after Town Hall, for example, or if the team prefers they can prepare a full report and send it to them. it to the community on some communication channel, such as Discord or Telegram. It is important that we understand if the final scenario has been reached, that is, create an easier way to deal with NFTs, cryptocurrencies, etc. Therefore, I suggest that there is a small questionnaire in the game itself, which could be made available after some time that players have started playing there, trying to ask if such questions actually happened. So I think the auditability would be deeper. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 399, "q0": "We noticed that the game has a good plot and scenario for the concept of NFT's to be introduced. From the beginning, the use of this dynamic was thought, but we realized that the game does not seem to focus exclusively on this, as it appears that it will have good gameplay, without the need for exorbitant expenses on the part of the player so that he can have fun. The description of the environment in which the game takes place also seems quite interesting, a near future where cities are dominated by corrupt rich in cryptocurrencies. As it is a mobile game, we see that its success could also imply a wide adoption, increasing the visibility of Cardano's technologies being used, which can have a positive impact on the ecosystem. Given the goals you're aiming to achieve, the requested budget of $25,000 doesn't seem too out of the ordinary, but some points seem to need to be fixed for the game to achieve considerable impact.", "q0r": 4, "q1": "Among these points mentioned above, we realize that many positions in the team still need to be filled. This is a negative factor because in order for a game to reach visibility and be a constant success, one of the things to consider is the game's personality. This personality is more easily built when there is an in-house design and development team that is very connected to the game, and knows well what direction the project should take at any given moment. It is true that the game is a racing style, and it has a great popular appeal, due to the ease of learning and low difficulty barrier in general. But even with this factor, it still seems interesting that a more complete team was structured to improve the viability of the project. It would also be interesting if the CVs of the professionals involved in the project were made available.\n\nRegarding the steps described for the construction of the project, we see that they are organized and it is interesting to note how engagements with different social media are taken into account since the first quarter. Regarding the details of the budget, the amounts allocated to each area seem reasonable, but again, the observation is that it would be important if more professionals had already been assigned to these areas. Aside from that, spending $1,500 on marketing doesn't seem to be enough either, because today one of the most conditioning factors of a game's success is how well known it is, and allocating approximately 6% of the total budget seems a little low. So we see that there are some gaps to be filled in order for the viability of the project to be better polished.", "q1r": 2, "q2": "Regarding the metrics chosen to monitor the evolution of the project, we see that plural parameters were established, aimed not only at the number of players or downloads, but also in relation to the engagement generated around the game (when monitoring the number of members on the server from discord).\n\nAn also interesting factor is trying to predict the initial number of players from the amount of NFT's sales, before the game's launch itself. It is also interesting to see that numerical goals were exposed that will help in monitoring the evolution of the project, such as the objective of reaching 3000 followers on Twitter.\n\nDespite the negative points mentioned in the previous section, it is worth remembering that this game has an interesting premise, and with some adjustments the project can become much more viable. A final suggestion would be the presence of an 'extreme' game mode in which, given some limitations, players could challenge someone to a race (with only 2 participants) in which the winner wins the NFT being used by the other player.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1709, "q0": "This is a proposal for a casual game, a game idea familiar to those who play games on the phone, it appears a lot on the android app stores and has nothing special. Your solutions come up as “P2E Staking NFT” without explaining how to solve it, this is vague and not really strong in how to solve your problem. Being clear about how your NFT works and how it works for gamers is essential to know the balance of in-game item values.\nYou have not mentioned the difficulties and challenges in your project, the potential risks and risk management have not been mentioned. You only write 1-2 lines about the solution and the risks of the project, it looks sketchy and you haven't thought through your project. It lost the opportunity to further explain how to deal with this proposal.\nPlease clarify the issues I mentioned, we are waiting for you ahead.", "q0r": 3, "q1": "The project is not small but in my opinion, it needs a team of many people to work. The project team is quite solitary here with only 1 proponent with 5 years of LUA programming experience, which is not enough. A game project will need more people and the proponent has not yet presented a recruitment or hiring plan, not mentioned. The roadmap is given in each Q of 2022 the items listed, I have not seen the game system design, server, or web game. \nEspecially at the fund, the images that I see are 2D but the author is asking for funding for the 3D part, which makes me feel conflicted. Personally, I think that a game needs to be consistent in its visuals and graphic style. More importantly, I can't find any information to authenticate the author, no link, Twitter, Facebook, YouTube, or something can be connected with the creator of the game. Please include additional information if possible to make your proposal more credible.", "q1r": 3, "q2": "The proponent gives numbers like 3000+ Twitter, 5000 members in discord in 3 months, I think it is not too difficult to achieve this number but if you mention a certain marketing solution for it, it is very good. Moreover, in addition to giving these KPIs, you need a workflow for the project. Why is the project development process important? it will help you to ensure the progress of the project, detect the problems that are about to happen, and help you to quickly come up with a solution to them. That's my advice for this proposal, please make me feel better.", "q2r": 3, "assessor": "z_assessor_1408", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2551, "q0": "The proposer is attempting to solve the issue for non-crypto gamers to safely purchase NFTs and play blockchain games by offering users entry-level NFTs with real utility by creating a mobile friendly game, where players can use those assets on the Cardano blockchain, (10,000 token supply) that can be altered/upgraded in various ways, not limited to airdrops to holder, staking of game tokens and through the purchase of $hyrdo coins (not yet created, price TBD). The means of distribution and cost of these on-chain assets are not clearly defined within the proposal but some design concepts can be seen from the proposer's attachments. The problem's solution, bringing more gamers to the Cardano ecosystem, is not necessarily solved by simply adding a new game idea and minting of NFTs. This proposer has failed to mention exactly how they would accomplish such an accelerated timeline given that this funding round is successful or not. Is there already a community built who follow the game development, i.e. a Discord server dedicated to the project, or a formal twitter page with strong community support? There is no doubt this proposer could add value to the Cardano ecosystem upon a successful launch of NFTs and a working, developed game nearing completion, but to date, the goals of the proposal are not aligned with the challenge.", "q0r": 2, "q1": "The proposer is confident with the given skillset of perhaps one person to manage and complete all allotted tasks presented in the timeline and roadmap with the help of minting NFTs from SeabugNFT Market. The references of said skills cannot be validated from the information presented in this proposal. The artistic quality of concept art and animations are a promising selling point as an Non fungible token if priced fairly to ADA holders, but the building of community interest is lackadaisical to say the least. From a non developed website to a Twitter account without a discord, the amount of accomplishments and milestones outlined here by the proposer are unrealistic for the timetable. The budget from the proposer is an estimated amount as stated and fairly reasonable, but the actual identifiable members that will be taking part in such tasks is not clearly defined here. Are these developers being outsourced from reputable companies or community standing? How many members will be involved in the project? Without a more clear representation of where funds will be going or to whom, it's difficult to verify if the timeline is far fetched or an accurate description of what can be completed given funding. The impact within the ecosystem for Cardano does not seem feasible at this time. Presented with a working website and being able to communicate with community members/developers, would add more merit to this proposal. Not having any solid updates or ways of verifying the work that's been done already, and for the accomplishments to follow is something the proposer should consider when attempting to create a game specifically for inexperienced on-chain users/gamers, that could and would feel truly safe when buying in. For these reasons along with the uncertainties left unanswered, this proposal only raises red flags without lowering them. ", "q1r": 1, "q2": "As stated above, there's no clear understanding of the targeted solution to the overall problem. Bringing gamers on-chain is the main focus and how to introduce those users to a safe and friendly community like Cardano. The lack of information in regards to the timeline and game development makes understanding how the launch of said game (METACARWARS) will result in the hopeful numbers by Q2 of this year. Twitter following must grow 1000% given the current total, while a discord following of 5,000 members within 3 months seems unrealistic without a current discord community backing of loyal followers before minting of in game NFTs. Having a strong community is everything to the success of any NFT project and the longevity within the Cardano ecosystem. From this proposal, those features are practically nonexistent, which makes the timeline and impact possibly months behind in terms of this funding round. Justifiable means of production must be included to determine beyond reasonable doubt for this proposal amount.", "q2r": 1, "assessor": "z_assessor_1529", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3584, "q0": "Overall, I’m thoroughly tempted by the idea behind the project. The author mentions that the game will be launched on the Seabug NFT market, which is one of Cardano’s properties, so apparently Cardano will be able to acquire some form of beneficial inheritance from the project. I must also add that I’m a fan of the extra security and protection from theft feature that the Seabug NFT possesses.\nThe team shall receive praise on my part for being able to deliver such well-written and engaging content of the game. The proposal basically covers all aspects that would give increasing rise to players’ interest in the game. Specifically, the author states that this is a game for both NFT holders and non-holders, boasting equality in the community; offers a stimulating game lore and setting with various missions to complete in exchange for valuable rewards. The game also features different game modes, customizations that players can apply to their BattleCar to compete with others, and 6 rarity rankings for players to distinguish their possessions. The target audience aligns closely to the challenge setting as well. The only small tweak I’d like to make is that though a particular obstacle to the project has been brought up, yet there seems to be a fitting solution to the obstacle. Therefore, I suggest the proposer come up with one, preferably one that does not interfere with the funding. \n", "q0r": 4, "q1": "From the road map provided by the proposer, I have high confidence that the project will manage to deliver a commendable outcome. I also notice that the timeline for the completion of this project is considerably shorter than the previous proposals that I’ve encountered, which I assume is a good thing if the eventual quality of the game is guaranteed. I would argue that the proposed budget is admissible, especially given that the proposer based it off careful research. The duties and capabilities of team members are sufficiently provided and relevant to the project, yes. However, I recommend that the proposer include some background information or affiliated links to further verify the proficiency of the team.\n", "q1r": 4, "q2": "In terms of auditability, in support of the information given by the team, I strongly agree that this project will be met with great success. The metrics chosen for keeping under observation are closely related to the key metrics of the challenge, and with the approximated figures of initial success of the project, the future seems even more strengthened and brighter. As for the visualized long-term success, it also falls within the range of the challenge setting, that is the huge integration of worldwide gamers to the Cardano ecosystem.\n", "q2r": 5, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3760, "q0": "I was quite impressed with the game description of the proposal. The game's features and salient features are described in detail and are easy to understand.\nPersonally, I find the idea and way of exploiting the game's space very interesting.\nProposal also align to the challenge and affects the Cardano ecosystem by providing gamers with experience and has a safe and easy gateway to the Cardano blockchain.\nHowever, the solution to the challenge is missing, I think this section would be more complete if the author could add an analysis of the solutions in promotions that are not reaching the target audience", "q0r": 4, "q1": "From the feasibility of proposal section, I think proposal can meet the outline.\nThe roadmap is described in detail from the first quarter of 2022 to the third quarter of 2022, the tasks in each milestone are also described in an easy to understand manner.\nThe budget analysis is also reasonably broken down into the subsections . However, I think the feasibility assessment will be easier if the information on completion time, unit price per hour is added.\nFor the team member section, although the necessary positions have been listed, I think the author should add specific information about the members of each position such as name, brief description of work experience, outstanding achievements and attachments.", "q1r": 4, "q2": "I thing the audit part of the project is well written so that the community can easily track the project's progress.\nThe way to measure project progress is described in detail by the author with quantitative KPIs at specific times (The number of Twitter followers, visits in landing page, members in Discord community server in 3 months).\nThe success of the project is also presented clearly and understandable. Thanks to that, readers can rely on these criteria to easily assess whether the project is successful or not.", "q2r": 5, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4096, "q0": "This game idea remind me of a very famous racing game Need for Speed and I personally love it. I like the idea of racing game that the team is proposing here. The idea is described in fairly good details and I think it has some certain potential. The first reason is racing game is very excting and it always encourage competitive gamers to join and stay, hence, I think it can contribute more with getting playing joining Cardano gaming platform. The second reason is the game’s rewards system has its own advantage and I agree that it will help gamers experience and learn more about Crypto/NFTs a safe and easy gateway to the Cardano blockchain. I find myself agree with the difficulty that the proposer addressed and I would like to see the team come up with some ideas of the solution for that said problem. ", "q0r": 4, "q1": "Alongside with  a very detailed budget breakdown and a thorough introduction of the requirements for team’s members. This proposal has a clear roadmap with detailed outlines of the work that needs to be done. This roadmap also closely aligns with the whole project’s idea. However what I want to see more here is an est. duration for each step of the work, for instance, how long will it take to complete the designs of MetaCarWars BattleCar NFTs with weapons and gadget attributes or how long will promoting NFTs socials and community chat services are created (Discord, Telegram etc.) take? and how will you promote them?? With those information being provided, this proposal’ll get a full score in term of feasibility. ", "q1r": 3, "q2": "In term of Auditability, the proposer seems to have a clear set of key metrics and those number can be easily measured. It’ll provide the auditors necessary information to give the project a fair judgement. However, the team should also work on a KPIs for a long term plan with a clear target in number so that the community can follow up with the success of the project. At the same time, I also understand that without a test run, it won’t be an easy job on the off.", "q2r": 3, "assessor": "z_assessor_1703", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4482, "q0": "This proposal presents an awesome game with well-designed graphics and cinematic features, promises to catch gamer and movie fan’s attentions. The modes, car colors, weapons and backgrounds can be good reasons to spend NFTs on. On the other hand, the team only consider one risk of lacking engagement without giving any solutions. In fact, there are a lot of threats for game projects such as: the scale of the game, unrealistic expectations or publishing. If you're creating a game in an existing genre, you'll have to compete with everyone else on the market. Often, the competition is made up of large corporations with a lot of money, who will not suffer if their game fails. Hence, in order to get a good knowledge of the game and how it works, you'll need to have a solid core and meta in place for a soft launch. An early soft launch will allow you to understand the game's attractiveness. The only validation to look at is based on the game's playtesting and analytics to reduce the possibility of unreasonable expectations. Sequels are effective when the target audience has demonstrated a desire for one. The requirement has been discovered using data that supports the premise that the target audience is interested in playing comparable titles with a high level of novelty. Validation decisions that aren't based on evidence might have serious repercussions. Therefore, I will need more researches with chart or metrics to consider a higher impact score for this proposal.", "q0r": 3, "q1": "The team has the basic plan with timelines even though I would like to take a deeper look at the detailed plan, for example: how the marketing campaigns are planned? KPI and deadline for each phrase along the roadmap, any other tasks need to be done to reduce the risks? For example: targeting or hiring people, doing more researches of similar games that are available on the market to gain improvements and make your game a special one. Same problem with the budget, number of team members, working hours need giving. The author only has vision on team members without hiring action that can lead to delayed hiring process. What can you do if you don’t have all the people in place to run a live game?", "q1r": 2, "q2": "Maintaining is crucial, thus I'd want the team to give a report or tool that we can use to monitor the project's progress. Not only launching or after, but also during the construction phase. Additionally, estimated download and interaction data should be provided to gauge success. Will the team be working on a PC version as well? I am looking for more detailed assignment for clarity part. ", "q2r": 2, "assessor": "z_assessor_1726", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8844, "q0": "This is a good idea, an approachable, easy-to-play NFT game.  How is this made easy for inexperienced gamers to buy into, though?  It doesn't look any easier than any other NFT game?", "q0r": 4, "q1": "Developer does not appear to have a team yet, does not provide examples of previous work or own capabilities.  Developer does know what team members will be needed.  There doesn't seem to be a website yet although there are some nice logos and art images.  Although the developer has some rather beefy \"expected\" social media community sizes, there doesn't seem to be any social media presence at all yet.  Budget breakdown is detailed and seems reasonable.", "q1r": 3, "q2": "Auditability has several reasonable potential KPI including following, downloads, other interactions.  Developer expects to have a following over thousands within only 3 months, seems very optimistic.  However with a game like this if it is up and running it's likely to attract more people over time, which will be visible in the KPI.", "q2r": 4, "assessor": "z_assessor_708", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "The development of a fun, and simple NFT game with staking, airdrops and p2e benefits, allows inexperienced gamers to buy and play safely.", "experience": "Diploma in Computer Systems and Software Engineering\n\n5 yrs of Lua programming experience\n\n3 yrs worth of game development experience on popular UGC platforms such as Roblox\n\nCountless hours of play, testing various games ranging from the retro arcade, shooters and mobile games"}