{"id": 400988, "author": "captainhaiti", "title": "Captain Haiti on FIFA22, Miami FC", "url": "https://cardano.ideascale.com/a/dtd/400988-48088", "category": 26440, "amount": 19000, "description": "Under privilege kids from Little Haiti deserve the chance to to be introduced to Cardano at the same time as others.", "f6_no_assessments": 10, "f6_rating": 1.5, "videos": [], "media": [], "f6_assessments": [{"id": 2205, "q0": "As it is stated in the challenge’s “about” section, we are looking for gaming Dapps that could potentially drive the masses to use Cardano. I’m having difficulties understanding the proposal and the goal of the proposer.\nFirst, It feels like the title and the description of the problem don't match.\nWhat does FIFA 22 have to do with the Captain Haiti game? What do these things have in relation to Cardano?\nI kindly suggest the proposer include more details so we can really assess the proposal.\nWe can’t check details about the meeting with Microsoft that should have been taking place the 4th of march, since there is no additional information nor report about it.\n \nI would like to advise the proposer to check out the proposers guidelines: https://cardanocataly.st/en/proposers/ \n", "q0r": 2, "q1": "The only way to have an idea about the experience of the proposer is a link to a browser game and the existence of a token that seems to be available on multiple chains, however, it is not clear what these coins will be used for.\nIt is not very clear to me why 19k $ are needed for: “token distribution”, it would be useful to have a budget breakdown to assess the feasibility part correctly.\n", "q1r": 1, "q2": "Unfortunately, we won’t get enough information to judge the progress of the proposal.\nOnly one metric has been suggested by the author to audit it, we definitely need more data, in that matter.\nWhen asked about what the success would look like, the only thing proposed to measure it is that “haïtian kids know about Cardano”, very hard to audit!\n \nI wish the author to build a more detailed proposal for the next fund, with this in mind, it could be a good idea to attend some Town Halls and proposer’s workshops.\n", "q2r": 1, "assessor": "z_assessor_146", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3585, "q0": "I must admit that on my part, this is a highly insufficient proposal. Given that this is basically a bonus reward given to the target audience, which, in this case, are “kids”, by playing the game FIFA22, there is absolutely neither an explanation or breakdown to why this idea should be approved nor what tasks the target audience must complete in order to receive the $CaptainHaiti tokens. Still, the proposal does include a solution to a possible problem of the project, albeit vaguely viable. Overall, not so good of a performance", "q0r": 1, "q1": "This is a section that majorly lacks the necessary information to be acceptable. Namely, there is an expected date on which the project is hoped to finish, but no details whatsoever regarding the prior development process and its timeline and milestones; and there is no information to either identify or verify certain facets of the team members, such as background and related experience. And I argue that the Microsoft Team is remotely self-justifying enough. Therefore, I cannot offer my support for the requested budget.", "q1r": 1, "q2": "Once again, this is another section that suffers massively from the lack of information. What is listed by the proposer in this section is by no means a method of progress tracking, but rather the imagined success for the project. And even though that imagined success includes more awareness of Cardano, I highly doubt that Haitian kids are the target audience that the maker of the challenge setting initially had in mind", "q2r": 1, "assessor": "z_assessor_1664", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3761, "q0": "The function description of the game is quite sketchy. This makes it quite difficult for me to understand the main operation of the game. For example, we Give away $CaptainHaiti Tokens to kids playing the game under what mechanism? How to give away?\nThe description of how the proposed solution address the challenge is ambiguous and lacks information. How the proposal affects the Cardano ecosystem and the challenge needs to be analyzed more clearly.\nThe risks and solutions are mentioned, but it would be better if the author could elaborate more on the difficulties in not having the proper programming to distribute the tokens.", "q0r": 2, "q1": "Currently, this section lacks a lot of information.\nThe roadmap needs to be broken down into detailed sections and timelines to increase the feasibility of the project.\nThe budget and team members are quite meager, it is difficult to judge that the project has met the outline. For the budget part, the author needs to add detailed items for two main items (Token distribution, Event Launch with Miami FC). It could be: completion time, details of completed items, number of employees, order hourly rates,...so that readers can easily comment on whether the costs are reasonable or not.\nFor the team members section, information about work experience, fields, outstanding projects, and attachments should be added.\nWhere the project is still lacking the necessary positions and recruitment plans should also be added so that the project has more information for evaluation.", "q1r": 2, "q2": "This proposal lacks information regarding its auditability. There are no quantifiable KPIs, reporting of results, or how the community can track projects.\nThe criteria to determine the success of the project are also quite general: Haitian kids know about Cardano. This indicator needs additional quantitative, for example, the number of children participating in the Cardano ecosystem, the number of people accessing it. More clear indicators also need to be shown so that readers can easily judge the success of the project. ", "q2r": 2, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4097, "q0": "I don't find this proposal is giving any informations to get its idea. The idea is getting kids involved in the game by seeing themselves through Captain Haiti by giving away $CaptainHaiti Tokens to kids playing the game by creating a portal connected to XBox's API. I can say that the idea aligns with the challenge. However, the proposer hasn’t given any information of how the work will be done. I can see that this project is built as a function on the foundation of an ongoing game. But I think a lot of information is missing here. The proposal has not convinced me why it can benefit Cardano. I would like to see more description of the rewards system that the proposer wants to build to give away token, more idea of applying it into the game’s function and events. ", "q0r": 1, "q1": "In term of  feasibility, since the idea seems to still be very vague, so I don’t find a real plan here. There’s no short term plan, no long term plan, no milestone or whatsoever. As the proposer mentioned, there’s no proper programing to distribute the tokens according to the score. So I think a timeline for this progress is essential. Besides that, the proposer also mentioned Event Launch with Miami FC, when is it happening? There’s not outline to follow up with the work, hence it’s very difficult give any comment. For the budget breakdown, it’s almost impossible to have any justification of the amount request since it has absolutely no connection with the timeline (that also doesn’t exist). Moreover, I don’t find many informations of the team member and requirement skills to back the success of this proposal. ", "q1r": 1, "q2": "This proposal genuinely has zero key metric. There’s no KPI for the auditors and the community to audit it in the long run. What is the number that can show Haitian kids know about Cardano? How many kids do you expect to involve in the game? How many token (in specific number or in percentage) do you plan to give out to achieve the target? What is the plan for a long term development? There are a lot of questions that I don’t find the answers here. The image on a success has not been delivered and I think the proposer can do more work to introduce this great idea to the community in better details.", "q2r": 1, "assessor": "z_assessor_1703", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4483, "q0": "congratulations on the team for having a good launched game with excellent rating and great number of downloading on CH Play. Basically, this proposal helps to on chain Haiti children but it has the potential to achieve the mission globally. I mean, the scale of this project is limited, why go home when we can go big? I advise the proposer to address more about his game features and how it will align with our challenge-to boost Cardano networking and ADA usage. The proposer must present a chart or report with established KPIs to demonstrate the results of their project and whether they are suitable and in sync with the key metrics. In addition, what will we be able to achieve after the project is completed? All metrics must be explicit and in line with the team's and Cardano's missions. For the risks and solutions section, I would like the author to clearly detail the difficulties in order to demonstrate a clear understanding of what they are doing. The answers must be provided in great detail, with extensive technical explanations. Otherwise, they can explain the functionality by giving the case studies, examples or research methods. One more thing to concern is the process and result of him working with Microsoft. What is Microsoft's comment on this", "q0r": 1, "q1": "specific deadlines and strategies are not yet tied to this proposal. To successfully fulfill the assigned duties, authors must include an accurate timeframe. Furthermore, they must demonstrate a realistic strategy not only for what they intend to do, but also for how they plan to accomplish it. They must provide technical elements such as the language and technology required to carry out the project in their description of how they achieve it. The budget strategy was not thoroughly and appropriately estimated. The budget should be divided out and properly labeled with the activities for which it is spent. Moreover, the budget needs to be reasonable compared to the plan set out in the proposal. The author must also consider and develop contingency budgets to assure the project's success. The position and number of persons-required to carry out the proposed project-must be explicitly defined by the author. Furthermore, the Proposer must give information about the team members' abilities and expertise that are required to carry out the tasks described in the proposal. We will need a clear and defined assignment to avoid problems such as delays hiring, publishing or unrealistic expectations.", "q1r": 1, "q2": "this proposal has not yet provided specific quantifiable metrics to track the project's development. For example, the time required to accomplish project tasks, social media engagement, the outcomes obtained following the marketing strategy with the milestones in the roadmap, and the time required to achieve the target. Furthermore, the author has not yet articulated the criteria for defining how the team met the purpose of this proposal. To demonstrate the project's success, the team must explicitly articulate the important measurements or particular KPIs.", "q2r": 1, "assessor": "z_assessor_1726", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5966, "q0": "This proposal is very brief and it seems to be also very simple. They propose to create $CaptainHaiti tokens and give them to children playing an already existing game, called also Captain Haiti. They propose to integrate it through Xbox’s API. And the risk mentioned was just the one related to not being able to distribute the token according to their score. Since there isn’t much information in the proposal, there are many questions unanswered. For example, are these tokens going to have any utility? Are they going to be tradable? What’s the tokenomics? Since not of these were answered and not much information was provided, it is really difficult to believe that this proposal will have any significant impact in the Cardano’s ecosystem.", "q0r": 1, "q1": "The feasibility of this proposal is very low. The detailed plan is just a date, which actually is already in the past. The detailed budget breakdown is not detailed, there are just two values: $19k for token distirbution and $6k for event launch, and they even don’t sum up to the total proposal budget, which is only $19k. Information about the team is also very limited and there is no way to get more information about them, no links provided. There’s no reason to believe that this proposal is going to be implemented successfully, unfortunatelly.", "q1r": 1, "q2": "There is not enough information in this proposal to evaluate its auditability. The proposer doesn’t mention how the progress will be tracked, there are no milestones to be verified, and no deliverables as well. The success of the proposal is just having Haitian kids knowing about Cardano, but it doesn’t set goals with a timeline or a KPI to track it somehow. There is a lot of information missing. If the proposer wants to reapply, I’d suggest to go over Catalyst documentation to better understand what is expected from a proposal.", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6093, "q0": "As much as i will want an on-chained game that has the potential of helping poor kids in Haiti and potentially round the world through this proposed game/service . I am having a hard time to understand the impact of this as the proposal lacks details.Below are some reference funded projects from the previous funding (fund 7) for the proposing team to help them in drafting a more clearer proposal and in turn increase their chances of being funded:\nhttps://drive.google.com/file/d/193GZulHuk0zhpTrMiLhcNC4OeEMoRyIa/view\nI am giving 1 star for effort.", "q0r": 1, "q1": "Although the proposal have verifiable links to show capabilities to execute this proposal to which i played one of the game which is similar to fruit Ninja(https://play.google.com/store/apps/details?id=com.halfbrick.fruitninja&hl=en&gl=US), the team lacks a properly detailed information on how they will arrive at the solution.There cost breakdown is not detailed enough and it is hard to give a good score despite playing one of the provided game links.\nI am giving 2 star due to so many missing information.", "q1r": 2, "q2": "Honestly nothing is provided in this section to help audit the progress of this proposal and the proposal needs more details.\nThe proposing team should please use the link(provided in the impact section of this proposal) of previously funded projects and see examples of good proposals in the category as Fund 7 had this same category and some projects were funded .\nI am giving 1 star.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 6226, "q0": "The aim of this proposal is to create a system to distribute their ingame token for their users, specifically for Haiti children while promoting Cardano. The objectives of giving charity and promoting Cardano are commendable, unfortunately this proposal does not give a clear problem statement and solution. First of all due to the unsustainability of the plan, how do you propose on adding liquidity to your token? Second, once all of the treasury of the token is exhausted, how do you propose on adding the treasury so the players/users can continue playing and onboarding more people to play? It is best to have a plan on the tokenomics of the game for your next attempt on submitting your proposal. By giving away tokens alone will not help the children of Haiti in the long term, try to create a plan that is sustainable not only for Haiti, but the rest of the world to play your game.   You need to provide value for the tokens first in order for them to exchange it to usable currency. Next is, try to think of scaling your game whereby you can onboard millions of users and help the impoverish children around the world. Do proper research on it and include it on your next proposal. On distributing your tokens, there is a token distribution service in the cardano ecosystem called dripdrop. You can contact them for collaboration. ", "q0r": 2, "q1": "This proposal lacks information on the team members, even though there is link to their website and games that they claim have been created, it is not verifiable whether it is genuinely created by them. Some references of their work or verifiable credentials such as linkedin or github page would help to convince the community. Try to put it in your next attempt of making the proposal. The budget presented are also unclear. The requested funds are 19k USD but in the budget breakdown, it is stated that they needed 25k USD. Please include clear budget breakdown for your next proposal. Furthermore, there isnt any roadmap or timeframe to deliver the project. Moreover, the proposer fails to provide sensible plan on what and how to execute to the project. There is also lack of information on the required manpower and resources to successfully implement the project. In addition, the proposer did not consider the risks and challenges on executing the project. In conclusion, with the information provided, it is highly unlikely that this proposal will be successfully implemented. ", "q1r": 2, "q2": "As I mentioned before at the implementation section, the proposer did not provide any information on their roadmap or any milestones which makes it hard for the community to audit. Moreover, there are no key metrics nor KPI that defines the success of the project. The description of the problem and solution are also confusing. With the information provided by the proposer, it is not sufficient to audit the success of the proposal.", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8360, "q0": "The idea of giving tokens to kids playing video games so that they can learn more about other cultures is a good idea. What I lack to see is how this token will be implemented inside the FIFA game, by who and how will this be done? There is lack of information at this point. I would like to see in more detail and plan how this will be achieved. ", "q0r": 2, "q1": "What I can see there are certain project available and links to these projects for people behind this proposal. But there is only one name mentioned and there is no certainty or background that can approve (or disapprove) that the person is in position to finalize the project. What would be nice is that a little bit more background is presented and team in general.  'Microsoft team' mentioned as team member is a bit broad.", "q1r": 3, "q2": "I don't see enough information on how the progress will be monitored. There is only small budget breakdown with only two points mentioned, on time table there is only one date mentioned. No clear dates or targets are mentioned besides that, only possible meeting with Microsoft team. I do understand that in theory this is not a complicated challenge but it seems to be a bit rushed and lacks more information in general. ", "q2r": 2, "assessor": "z_assessor_672", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8532, "q0": "The main point of this proposal is creating Captain Haiti goalie. As provided by this proposer, the problem seems to be quite vague, because limited information provided. It is unclear whether the necessity or authenticity of the issue is raised due to the lack of information on the background of children in Haiti. Moreover, the solution stays abstract due to the lack of vital information, such as a roadmap with a timeline, KPIs/metrics for measuring success. The information from this proposal raises a number of questions such as: what is the relevance of the game FIFA 22 (from EA Game ?) and Miami FC (from the MLS) to this solution?\nAs a result, I disagree with this proposal's impact", "q0r": 2, "q1": "As one can see, this proposal lacks context about the proposer and team [only described as \"Martin Jean-Baptiste\"; \"Miami FC's VP; and \"Microsoft Team\"], making it very difficult to assess its feasibility. In the event that this proposal involves the above parties/stakeholders, their description, as well as their confirmation of participation, should be fully stated in the proposal. In addition, the proposer did not provide any information that show their demo/pilot/prototype/similar works completed in the past. As a consequence of the shortage of a target/goals, indicators/measures, timeline, or budget breakdown in this proposal, it is hard to assess feasibility from this viewpoint. Risk is also not provided, this shows that the proposer has not fully looked at what could happen during the implementation of this proposal.\nAs a result, based on the provided information, I disagree with this proposal's feasibility", "q1r": 2, "q2": "As could be shown, this plan has little or no info about the proposers [as mentioned above]. Secondly, there is no road map, no KPIs/metrics in place. Additionally, this proposal did not provide the budget structure with cost items, only the total budget of $19k.\nAs a result, based on the information provided, I can give this proposal's auditability only 2 points. I hope this proposer will improve and complete this potential idea in the future.", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Captain Haiti and Miami FC are creating Captain Haiti goalie. Each score against Captain Haiti gives them free $CaptainHaiti tokens.", "experience": "Already a few games online:\n\nThe Captain Haiti Game listed on Play Store is rated 4.6 stars with over 10,000 download: https://play.google.com/store/apps/details?id=com.haiti.captain&hl=en_US&gl=US\n$CAPH Gaming Token at: https://cardanobeach.com/soup1/index.html\n"}