{"id": 400975, "author": "anushajain", "title": "Play To Earn Marketplace", "url": "https://cardano.ideascale.com/a/dtd/400975-48088", "category": 26440, "amount": 64500, "description": "Is there a single platform where you can play 1000s of Play to Earn games? Making a living from gaming is still for a selected people.", "f6_no_assessments": 5, "f6_rating": 2.066666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes the proposal fits the challenge setting. Creating a marketplace for gamers to choose games that most suit their interests, without having to be in 100 different Discord servers and YouTube channels would be ideal. This would allow an open onboarding experience for gamers that are not privy to blockchain gaming, or Cardano specifically. Conversely, those who are blockchain enthusiasts but casual gamers, will find it refreshing to be able to be presented with a concise selection set of gaming options.\n\nWith that said, the proposer could do a better job of describing the mechanics of the market place. Please describe how the token will be distributed, it's total supply, and how developers and gamers will be rewarded for the work. \n", "q0r": 4, "q1": "Plan given is too vague, as it does not clearly identify the deliverables at each stage in the road map. There is no mock up of the project and it is assumed that the team would be starting from scratch. The timeline given is not realistic. A project such as this would require a much larger team to accomplish the roadmap's plan of launch by September.\n\nThe amounts given for developer salaries seem low, but perhaps it is a result of the location of the proposer and their respective local economies. In addition no details are provided on what platforms or development stacks will be utilized for the project. \n\nNo references, resumes, Linked In accounts, or prior experiences specified for the team. The proposer doesn't provide specifics examples of how their skills relate to the challenge of the proposal. Creating a blockchain based market of games, along with a tokenized game theory will require an amazing amount of study, design, and engineering, especially if it is to scale. In order to be successful it will need to scale as developers will not be interested in building on a platform with little to no usage. \n\n", "q1r": 1, "q2": "The points outlined for auditability, although great aspirations, do not directly relate to the project itself. In this section it would be desirable to see what metrics the proposers will be collecting data on, what goals they plan to hit, and how they will communicate that progress back to the Cardano community. I want to believe that creating a gaming market place will eradicate poverty, but the proposer is lacking a demonstration on how their product will achieve that goal. Additionally, eradicating poverty is not a goal or metric of the challenge setting. ", "q2r": 1, "assessor": "z_assessor_1003", "no_vca": 19, "ne": 6, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "If done well an app certainly could work for the proposed project. In many cases the developers may be focused or interested in writing the gaming part of the game, parts / functions such interaction with the tokenomics ecosystem of the app could be done by others and this grouped arrangement of developers could play well. The idea of the gamers and developers getting a share of the generated revenues is good / appropriate and lends well to solution of the problem statement.\nThis is proposal is aiming high but seems to not have supporting documentation or writeup (or if have not shared as part of proposal) with more details on plan that might be expected of such a project endeavour, including such would have greatly increased its attractiveness for funding.\nI very much like the app idea, the metaverse is certainly in its infancy but has great potential.", "q0r": 4, "q1": "The Team members identified seem to be a good mix, the proposal would be greatly enhanced if members developing the code and their experience in working with the Cardano ecosystem were included, without such confidence in success is not as high as it could be.\nThe proposal would greatly benefit from more detailing of each deliverable and how and by who it will be achieved, currently only the key milestones are listed without detail, identifying who was working at each stage with further breakdown of the key components would greatly enhance the proposal and chance of success.\nThe project would also benefit if some example NFT’s were included or a link to a video of them was included.\nThe Airdrop to attract gamers is a plus to the project and more details on this would have been positive.", "q1r": 3, "q2": "A good set of Key Metrix are established but no drill down of auditability of them is included. \nExample of auditing against key Metrix of the project might be via bi weekly presentation or call advising status of progress/completion, another might be a specific owner that community could reach out to get status or a webpage publishing the updates.\nAdding such road map or drill down for auditability would greatly improve the proposal thus with current level of input on auditability confidence in success is not high. A great deal is listed to be done, many moving parts, needs more granularity to ensure success.", "q2r": 2, "assessor": "z_assessor_1395", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies a realistic issue that there is no single hub for cardano P2E gamers to come to. The concept of creating a unique marketplace is worth exploring further in depth.", "q0r": 4, "q1": "The proposal is not thorough enough to have a high likelihood of being successful. Creating a marketplace will require ongoing active maintenance, in-house game development is a huge task, there is no tokenomics structure but mention of a token. The author wants to have a marketplace \"like a metaverse\", however there is no budget mention about this part of development.  The auditability mechanisms don't offer any means to audit the actual proposal moving forward. The budget breakdown lacks serious detail.", "q1r": 1, "q2": "The roadmap proposes that everything will be completed by Q4 2022, however considering how many things are on the proposal, this seems unrealistic and the team lacks transparency in a huge way. \n\nThe proposal aims to make a \"metaverse UX\", In-house games, a marketplace, a one stop hub for P2E gaming, a native token airdrop and they plan to have all of this done in a 3 month span between 5 developers and 1 graphic designer, this not including the author who will be assuming approximately one third of the funding for 6 months of marketing. \n", "q2r": 1, "assessor": "z_assessor_1930", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The goal of this proposal is to create a marketplace for play-to-earn games. Gamers would earn native tokens by playing the games, and game devs would earn a small part of it. This way, the proposal mentions that both gamers and game devs would have incomes. Although, the proposer doesn’t mention the utilities of the token. How is it going to be used? Fees to pay games? Governance? Based on the information provided, for me it looks like the tokenomics model is not sustainable. The tokens would soon be worth nothing. They also mention NFTs to be used as avatars, which is actually a plus and possibly create revenue for designers as well, but as before, I don’t see the model as sustainable. The proposal, nonetheless, is aligned with the challenge, and the mentioned risk, which is to attract the initial developers, would be solved through an affiliate program. I don’t believe this would be enough to attract people if a solid tokenomics plan is not presented. Overall, I think the idea is good but tokenomics should be worked out better so all the other parts could work.", "q0r": 2, "q1": "The proposal has a timeline and milestones to be delivered starting on September 2022. The timing is good and might give the team enough time to build and launch the marketplace, but it would be good to include in the proposal when the development would start, how long it would take and specify when the devs are going to be working, specifically. The budget for each role is well explained, but the background of the team was not provided. They just say the there are people there and that they have already developed some projects in blockchain in the past, but there are no ways to verify it nor their background. Also, it looks like they will need to more game devs that they don’t mention if they are onboarded already or not. To increase the feasibility of this proposal, it should include more details in the roadmap and also more background about the proposing team.", "q1r": 3, "q2": "The team doesn’t add any way to check the progress of the proposal and audit it, so the community could know how the progress is being done. Some KPIs are provided to measure the success of the game, but there are not any numbers set as goals, and the only number indicated there is to have 10k people earning a full time wage through their platform, which I think is very optimist. To improve this proposal, the team should include more information about how they are going to show that they are progressing in their development, and also set some realistic metrics to measure the success of the proposal, along with a timeline.", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal lacks clarity on the technical side of things. Does this marketplace reduce development time of games by taking care of some aspect of blockchain games? How does the payment system work? How will accessories be equipped on to the avatars? In terms of income streams, where will this capital come from? Is it bootstrapped from the games' selling their NFTs? An incentive plan? More elucidation on technical matters would greatly improve a proposal with a good idea. ", "q0r": 2, "q1": "There is very little information on the team's ability to deliver. Sharing the blockchain projects that have been started by the tech team would add confidence for what is being proposed. \n\nThe proposal states that the Referral program will begin on September 2022 and inhouse games launched on October. More details on the inhouse games being built and the Metaverse would strengthen this proposal. There is a risk or possibility of slow onboarding of developers, in which case, voters can judge this proposal on the strength of the inhouse games themselves. \n", "q1r": 1, "q2": "The roadmap could be more fleshed out so readers can understand what is being proposed. A CEX listing is dependant on a few factors and probably be much further down the road. \n\n10k people earning full time wages would mean a bustling economy -- this proposal should include a roadmap on how the team plans to get there.  \n\nThere is no website or social media on which the community can track the progress of the project. Preparing a news source for the project and including them in the proposal would be beneficial.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "I want to create a revenue stream for gamers as well as developers.Like being a youtuber became mainstream, I wanna make gaming a profession", "experience": "I have been in the crypto industry since 2020. And I have been a gamer almost all my life."}