{"id": 400905, "author": "mmahut", "title": "Milkomeda for Cardano unity assets", "url": "https://cardano.ideascale.com/a/dtd/400905-48088", "category": 26440, "amount": 13200, "description": "Unity, the game engine, is getting assets to interact with Cardano and we would like to extend it with Milkomeda side-chain support.", "f6_no_assessments": 5, "f6_rating": 4.066666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3759, "q0": "I like the idea and believe that the project aligns with the challenge of creating a tool to assist game developers, contributing to the development of gaming applications in the Cardano ecosystem.\nHowever, it is quite unfortunate that the feature introduction of the proposal is still quite short, it is difficult for viewers to fully understand the project. Authors should add explanations, examples to illustrate these features.\nBesides, the results section of the project is a bit general, not mentioning specific KPIs to describe how the proposal address is challenging.", "q0r": 3, "q1": "The budget is reasonably built according to the total number of working hours and the unit price per hour. The author also introduces the organization to implement the proposal in detail, including outstanding achievements as well as working experience, and the reference links are also attached.\nHowever, the roadmap of the plan has not been mentioned. The author should divide the plan into specific steps, the amount of work at each step as well as the time to complete these steps. As a result, readers can more easily assess the feasibility of the project.", "q1r": 3, "q2": "Tool and ways for the community to track the project in question is through github.\nHowever, there is still a lack of information about quantitative KPIs as well as specific time so that readers can compare whether the project has been carried out according to plan or not.\nIn addition, the success of the project is described in a rather general way. The author needs to add indicators that describe the success of the project in a more quantitative and specific way.", "q2r": 3, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3791, "q0": "From all the things that I have read in this section, I would like to notice that your proposal doesn’t provide adequate information about the target customers and good values they can reap from your game. Even though this proposal mentions the game’s features, it is also pretty meager and not focused. Likewise, I know your proposed solution aligns with the key metric of the challenge, which is the number of values made by gamers in play-to-earn apps. Yet, stating that this project will enable developers to create games and their extensions on Milkomeda, in addition to Cardano, which extends its functionality, you had better put more detail in their functionality. I mean you should explain them by naming which functions will be increased so that the values the developers can create can be clearly indicated and emphasized. Besides, the difficulty that you have recognized in the project conducting is close to the reality because nowadays there are moderately many teams and organizations stuck in porting existing games on Ethereum to work on their platforms. However, giving an applicable solution to this issue is of essence since it reflects the developmental potential of your team on this project. Most importantly, it’s evident that the ability to address the foreseen challenges is a necessary condition to build trust among the community.", "q0r": 3, "q1": "It's plain to see that there is an absence of a detailed timeline in this proposal. Admittedly, you were able to list many required activities for the project progress; nevertheless, the thing that you need to show the community is an explicit plan with specific timeframe and milestones. To be concrete, please add the time to complete some targets, like developing Unity assets, building game logic, and the so-called “simple proof-of-concept game” running on Milkomeda. Your cost allocation is sensible but personally I think it could be more detailed. In terms of your working team, it’s irrefutable that you have introduced your team in the most condensed and proper way. However, I think you fail to mention how many members your team consists of at the present. At the same time, my suggestion is to give a brief introduction of your teammate’s profile, Matej, covering his working experience, position of responsibility, and even much better, his relevant credentials to prove that he is absolutely eligible for the project implementation and able to help the project move forward instead of only attaching a link of his game portfolio.", "q1r": 3, "q2": "Well, the information of the measurement tool for the project is acceptable because it mentions enough information: technical tool (GitHub) and its content to be shown (number of commits). Nonetheless, I believe that you could write this content in more detail rather than only one sentence like that. In addition, your success metrics are linked to your suggested milestones, namely related to the hope that Milkomeda assets will be included in these of Cardano. Well done. But  when it comes to the proof-of-concept game running on Milkomeda, as mentioned above, I advise you to give the voters some information about it so that they can figure out what it is and how successful it will become.", "q2r": 4, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5458, "q0": "I agree that this proposal meets the goals of the challenge. The proposal is seeking to extend the functionality of Unity, a tool that already has widespread adoption by developers, to their EVM sidechain.\n\nThe solution is clearly stated and easy to understand. More tools for developers to more easily develop games should equate to more development on Cardano, and thus more onboarding of gamers to the Cardano ecosystem. ", "q0r": 5, "q1": "Given the track record and development experience of the team behind the proposal, their previous successful Catalyst proposals, and their development of tools that are widely used by the community such as Blockfrost, I feel highly confident about the team. Moreover their partnerships with entities such as Trezor and the Cardano Foundation only add to their credibility.\n\nFrom the plan perspective, the amount of money asked for is reasonable given hourly breakdown of cost and amount of work expected. \n\nAn overall very feasible proposal that I feel has a high likelihood of being successful.", "q1r": 5, "q2": "The plan clearly explains to the community what problems exist and what this proposal is doing help solve them. Timelines for completion are clearly laid-out and well communicated.  \n\nMoreover, the proposal has a link to a github repository where progress is visible to the community.  \n\nGiven the easily verifiable and trackable metrics of success, combined with the proven track record of the team in previous Catalyst proposals, I am highly confident that information provided is sufficient to audit the success of this proposal.", "q2r": 5, "assessor": "z_assessor_1995", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5964, "q0": "The impact of this proposal is clear. They want to extend what’s already being developed in Cardano to the side-chain Milkomeda, an integration between Unity and Cardano’s blockchain. This will allow a possibly less expensive usage of this integration between Unity and a blockchain, since the side-chain will have lower transaction fees. It will be open-sourced, which increases a lot the impact of this proposal in the community, if done properly. And since the proposal is building tools for other games, this is very well aligned with the challenge, since it will help and increase the number of games being built on Cardano and consequently almost all the other challenge KPIs. The risk mentioned is real and it will not be so easy to bring games from Ethereum to Cardano, but this will definitely help and also it’s not only this proposal’s responsibility to do so. The extra 2 weeks in the timeline also seem to be a good risk management decision to delver ‘in time’.", "q0r": 5, "q1": "The plan presented in the proposal is just high level and not very detailed, but since the proposal is relatively simple, this is ok. The steps are somehow mentioned and also how it would be used when ready. It is stated that the development will take about one month, but it doesn’t mention when it would start, if it’s right after the funding is released or at some point in the future when the team is available. The hourly cost is above the average seen in other Catalyst proposals, but since it’s for a specialized role, it’s understandable. The Five Binaries team is well known in the community and trusted by big players of our ecosystem, so I don’t see any trouble in trusting that they will deliver what they are promising.", "q1r": 4, "q2": "It is well stated how they are going to make the development visible to the community, through their GitHub repository. Also, the success is defined as the completion of the project, but it would be beneficial to include some more information about expected usage and some metrics to measure the success of the proposal. They also mention that this proposal is an extension of a previously funded proposal, but it would be ideal to know the status of this proposal.", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7243, "q0": "This is another good proposal from Five Binaries, a company which has been active in Catalyst from the first funds and which has delivered over a dozen proposals successfully.\nFor this project, they want to build Unity GameObjects assets that will allow developers to easily interact with Milkomeda and possibly port content from Ethereum to Cardano (on the Milkomeda side-chain). \nThe main risk the proposers outline here is that porting a completed game from Ethereum to Milkomeda might be more difficult than expected, but a 2 week buffer has been allocated to try to mitigate this risk.\nAdding this capability to Milkomeda and also making it easier for Unity developers to build assets that can be used in blockchain gaming, would of course be a huge boost to our ecosystem, so this proposal addresses the challenge effectively. Score: 5.\n", "q0r": 5, "q1": "The proposers have provided an estimation of 120 working hours for completing this proposal, for a budget of 13200 USD (110 USD hourly rate, which is in line with their prices on other proposals in this fund). They estimate the work here would be done during the course of a month, after which a basic game showcasing some assets and interactions with NFT’s would be done, which I find a bit ambitious, especially with such a low price tag, but Five Binaries has already delivered a lot of tech on Cardano, so I do not doubt they can do it.\nThe budget is not broken down into separate parts, but they have explained in other proposals that their hourly rate includes infrastructure costs, costs with office rent etc, so this is more thoroughly planned than can be seen at a glance here.\nMy recommendation is only that you repeat what your hourly rate includes in every proposal, to make sure no one is confused by this.\nAs I mentioned in the beginning, the proposers are the team behind the well known Five Binaries company (https://fivebinaries.com/), which has been building infrastructure on Cardano since the beginning of project Catalyst and that recently have implemented native support for Cardano on Trezor hardware wallets: https://blog.trezor.io/trezor-suite-update-march-2022-3e1823fa22d7 (kudos for that by the way!).\nThey have created https://blockfrost.io/ along with a very impressive portfolio of projects funded and delivered from previous Catalyst funds: https://catalyst.fivebinaries.com/. \nThis proposal will mainly be handled by Matej, whose Unity game portfolio can be found here: https://rplnt.itch.io/. It’s easy to see that he has experience with the game engine. \nI have no doubt whatsoever he and the team are capable of completing this proposal successfully. Score: 5.", "q1r": 5, "q2": "There is not much information to go by in the Auditability section, but, the proposers mentioned they will be providing a Github where progress can always be tracked via commits. There is also the Catalyst dashboard, where one can find all the materials related to their individual projects.\nAs I mentioned in another one of your proposal, I feel it’s important to point out that even though you have a good track record and your accomplishments should be proof enough that your proposals are auditable, it’s still important to add some KPI’s and success metrics to your proposals, since these criteria are actively sought out by CA’s to establish a score. It’s best to avoid the risk of getting downvoted by CA’s who judge proposals solely based on the information provided in them and don’t infer anything from who the proposers are or what their track record is.\nYou can simply add a few targets, like for example 5 commits per week, the game you build having 2 hours of gameplay at the end etc and you should be covered.\nThese being said, I’m certain the progress and success of this proposal will be auditable, especially since that game will be playable by anyone. Score: 5.\nCongratulations once again to the people at Five Binaries for their work and for this proposal, keep it up and I hope you get funded!", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create Unity (the game engine) GameObjects assets that will allow Unity developers to easily interact with Milkomeda.", "experience": "We are the creators of Blockfrost, creating services and tools lowering barriers to entry for developers.\n\nWe are working on the Cardano assets integration into Unity and we would like to extend this feature to the Milkomeda EVM side-chain as well."}