{"id": 401034, "author": "nfc", "title": "NFC Play to earn cloths battle game", "url": "https://cardano.ideascale.com/a/dtd/401034-48088", "category": 26440, "amount": 10000, "description": "Every day in Bangladesh 3.5 million children aged 5 to 17 work to produce clothes. With our idea, we want to change the working conditions.", "f6_no_assessments": 8, "f6_rating": 2.7916666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 4292, "q0": "The problem described in this proposal is very topical, which is the poor working conditions for children in many countries nowadays, and its aim to raise funds in order to improve the situation is really humane and such a noble gesture. However, despite the lofty intention, this proposal does not do well in terms of clarifying its solution. The content is mostly about how it will use the money raised, assure transparency to the public or protect its privacy and data from hackers but barely gives a clear overview of the most important part - the game itself. There is scarcely information about its gameplay or method of raising funds and attracting public attention. The Website/Github repository attached with this proposal is also poorly made with almost nothing about the project except for an email address to contact the team in case somebody may want to send a message. This leaves the author room for further improvements, and I believe with some enhancements this proposal is able to provide the Cardano ecosystem with great value since it is already a great, potential idea being closely aligned with the challenge.", "q0r": 3, "q1": "First of all, it is fair to say that the team really did well in terms of separating the whole progress into smaller phases following a logical order being Fund - Prelaunch - Website launch - Stalking and Scaling. They also describe very carefully what needs to be done and the results or milestones to reach after each phase, which indicates an experienced and reliable team. However, I would only ask the team if they can put in some pieces of information about the time needed to complete each phase, hence this roadmap can gain more reliability. Secondly, the budget breakdown is another bright spot in this proposal since it does not only describe the allocation of funds toward different parts of the project but also describe what those parts look like and how they contribute to the whole project. I also love the creative idea of a “Recycle System” as an in-game feature, which offers players a chance to acquire more valuable NFTs by taking risks to upgrade. Last but not least, the information about the team provided in the proposal is detailed, the required skills and abilities for working in this project was clearly described showing that this team fully understand and are enthusiastic about what they are doing.", "q1r": 4, "q2": "Regarding auditability, the author does mention the clarity of the project will be ensured by putting shareable information and a detailed roadmap on Github as well as a progress bar on the information site so that community can easily keep track of the progress. The method is indeed amazing, however, there are no specific metrics or KPIs provided so that people and stakeholders can not only track the progress but can also evaluate the effectiveness of the team, thus assessing its future potential. Overall I think the traceability of the project might be a little troublesome unless the author can deliver some reliable and detailed numbers.", "q2r": 3, "assessor": "z_assessor_1716", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 400, "q0": "The purpose of the proposal is to use blockchain for the commercialization of NFT's within a game that has a social initiative to help children's working conditions. With that, we realized that the proposal fits the goals of the challenge in question. In addition, the possible success of the game could bring greater visibility to Cardano's technology in the long term and influence other projects with similar purposes to also use this technology.\n\nHowever, although the budget of $10,000 is not exorbitant for the realization of what was proposed, we realized that some fundamental points were not fulfilled so that the game had more chances of success. We were able to notice throughout the proposal that there is clearly a great objective to help children with the project's income. However, fundamentally, this revenue will come through the marketing of NFT's of the game and it would need to have some relevant differentials to attract a good amount of players. We know that the game is a combat between players, but beyond that we don't have much information about how things happen.\n\nThere are some doubts in the air such as: what is the story behind the game? How will players fight each other? What are the forms of interaction between players? How will the gameplay be? It seems that some steps in the elaboration of the idea were skipped and there was a lot of concern about how to market the game before making it more attractive.\n\nSo, it would be more interesting if the team could better structure the game's story and try to engage a community of future players before putting so much effort into the NFT concept.", "q0r": 2, "q1": "Regarding the project team, we can mention as a positive point the recognition that some of the concepts to be used in the project are not very well understood by the team, and that, therefore, more specialized professionals are needed in these areas. However, a worrying factor is: one of the central points of the project is the marketing of NFT clothing and the team points out that it has never had a business in this area before.\n\nDuring the elaboration of the stages, we see a clear concern with the dissemination and marketing of the project, including one of the objectives is to establish a public relations team to promote the game. But the predominant characteristic of the ideas described in the feasibility of the project is still that a lot of efforts and planning are being directed to more advanced stages in terms of marketing game items.\n\nWe observed a plan regarding how many coins will be released, how they can be traded, what security holes there may be in the system, but it was not established what the lore of the game would be according to the team, as well as this role was not assigned to any professional specifically. On the project website we can find an email to contact about the project: nfclothing2021@gmail.com\n\nBut it is not possible to easily find the resumes of the professionals involved in the project. Regarding the budget breakdown, we have a plausible distribution of the amount that was requested, with the largest capital allocations going to design ($3,000) and development ($4,500). However, we couldn't see a cost being directed towards creating the game's story.", "q1r": 2, "q2": "As a way to measure the game's progress, the team has established that there are very detailed goals to be met, and that the results of these goals will be posted periodically on the project's website. This seems like a good plan in a game project, which really involves a lot of updates, which the community should be aware of.\n\nHowever, we noticed that some parameters were not established that could inform us if the game is really reaching certain achievements. For example, it was not established how many players are planned to reach at launch, the amount of clothes traded, how much these trades would move or what engagement generated by the game on social networks.\n\nIt seems interesting for the project that the game's lore is better modeled and that initially the greatest efforts are focused on this aspect of storytelling before properly entering the scope of NFT's.", "q2r": 3, "assessor": "z_assessor_1146", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3586, "q0": "This is by far one of the few projects that aims towards a noble and humane cause, which is improving the living conditions of the unfortunate children in Bangladesh, and the proposer claims that the total revenue generated will flow straight towards. And I’m also quite surprised to find that this is the first project I’ve seen where the game doesn’t target a specific group or crowd in the gaming community, but rather focuses on an age group (a rather big one at that), which should boast availability and accessibility. The proposal is also able to put forward a possible obstacle to the success of the project, and encloses an associated solution, though I’m not quite sure if that should address the problem entirely.\nThat seems to be where the merits end, as I spot the following shortcomings in this proposal:\n\nGiven that this project is categorized as a “battle game” in the title, the proposal doesn’t comprise any specific details regarding the gameplay, game lore and setting(s) or reward mechanism. In order to captivate the attention of gamers, I believe those sets of categories are necessary for a quick visualization of the game. \nI highly doubt if the target audience really fits into the main objective. For the most part, I find the adults and elderly tend to focus on more crucial aspects of life such as work, family or socializing rather than gaming. And as mentioned above, the proposal lacks heavily on the details, which will be difficult when it comes to attracting the remaining age group of gamers.\nWhile the aim of the project is honorable, this is still pitched to be Cardano-based. So it is pivotal that details of the benefits that Cardano can expect to acquire from this project are included and highlighted in the proposal, which is something I find missing. Plus, core metrics for the measurement of initial success of the project are also not present.", "q0r": 2, "q1": "From the content provided in this section, I must say that each stage of the plan consists of highly specific steps and tasks, all of which guarantee to deliver the desirable outcome. Still, I could always use the addition of a timeline and respective milestones. The budget breakdown includes 4 sections, all of which enclose relevant information that justifies their allocations of the budget, and the total number sounds alright. The team is divided into 3 groups, each with certain duties and tasks, though I feel the proposer should have been more generous with the details.", "q1r": 4, "q2": "In terms of auditability, I believe the team has possessed a certain extent, as evidenced in the use of GitHub and their own website and the inclusion of the community in keeping track of the progress. And of course, the envisioned success includes the end results that the main objective of this project sets out and the adoption of an active community to Cardano, though the former tends to receive more focus and details than the latter, which is unfortunate since the likelihood of getting the budget approved requires them both to be equally concentrated.", "q2r": 3, "assessor": "z_assessor_1664", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3762, "q0": "I'm quite impressed with the idea that the game's motive is to support the children in Bangladesh have better working conditions.\nHowever, the features of the game have not been described specifically, how the game works has not been mentioned. This makes me not have the opportunity to understand the game well.\nThe writer should also describe the impact of the project on the challenge by analyzing the key metrics more clearly.\nThe solution section for the risk describes quite general, there should be more specific solutions for the Hackers/privacy case.", "q0r": 3, "q1": "I am quite impressed with the budget section because it is broken down and allocated quite reasonably for 5 main activities, these items are described in detail and easy to understand.\nThe tasks in the plan are also described quite fully, but the roadmap does not include the estimated completion time and quantitative targets (For example stage of Funded will last for X weeks, with x NFTs generated from the Design team)\nThe required positions as well as the duties of each position are mentioned, but basic information about these members has not been described. The author can add members as well as their work experience so that the community can more easily assess the feasibility of the project.", "q1r": 4, "q2": "The criteria for determining the success of the proposal are presented quite easily.\nAudit tools and methods are also clearly presented. The community can track the detailed progress of the project using the Github tool as well as the project's website. However, as mentioned in the  feasibility section, I think it would be better to have quantitative indicators and specific timelines to be able to comment on whether the project's progress is on track with the goals or not.", "q2r": 3, "assessor": "z_assessor_1674", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4062, "q0": "The idea in this proposal is to help local children with good working conditions. This is quite interesting and meant to help society. But I still don't quite understand what the main activity of the project is to do in this project. If the team can clearly state a few key details about the game system you want to build, it will be easier for people to understand it.\n        And it would be great if the group had a list of places that want to raise money, the community could more easily follow.\n        It is good for the team to be able to recognize the risks of the project. If the team can come up with some ideas on how to handle those risks, the credibility of the project will be much higher.\n", "q0r": 3, "q1": "In the planning part of the project, the team specifically outlines the milestones and tasks at that time.\n\nI appreciate at the cost section the team came up with the requirements of each job to make the project the best it could be. The team has divided into 3 teams to work as developers, PR, and design, but did not say in detail who will do it, so maybe the team is still under construction. But I encourage this proposal to add details about the people responsible for the project and what skills and experience they have on the project. This is quite important for projects because people will trust the proposal more.\n", "q1r": 3, "q2": "I think key metrics should be included in this section as it will help the evaluators know the numbers the project wants to achieve. From those numbers, the team will be able to gauge the success of the project.", "q2r": 3, "assessor": "z_assessor_1702", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4279, "q0": "I would say that this part of the proposal wasn't written so well. The team has talked about some general information of the project but it was still not clear enough to be aligned with the challenge's key metrics. So that I couldn't make sure if their proposed solution could address the challenge or not. They even said that for some reasons they themselves couldn't really control the KPI, so how can we ensure that the proposal would address the challenge? About the risks in the future, I appreciate them for giving out their vision and expressing their concern of saving their project.", "q0r": 3, "q1": "The proposal has covered the team's plan and timeline and budget breakdown. The difference in the way they write the timeline when compared to other teams is that they didn't give specific time but they divided into 4 different phases, they are: Funded, Pre-launch and Testnet, Swap and Website launch, Staking and scaling. In the part of budget breakdown, they have explained what is it in each section that they spend budget. They have mentioned that their team consists of 3 groups: Developers, PR, Design.", "q1r": 5, "q2": "The proposer said that the team had a detailed roadmap. They also revealed that on their information site, they would add a progress bar so that everyone could see all the progress they would made. I think this is a good thing to do, not only the team but also website's visitors can know how the team's project is going. They have also brought a pretty clear vision about what the success would look like. However, I feel that they still need to point out if the proposal is a whole new one or it belongs to a previously funded project.", "q2r": 4, "assessor": "z_assessor_1714", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4484, "q0": "idea and purposes are the selling points of this proposal, I personally appreciate the humanity effects of it. The attached website is well-designed and as the team planned, will show the progress will all of the small steps for us to follow, one more thumps up for the team.  However, the team didn’t give a clear description on the game functions for us to catch up. We will need to know at least the basic game system and how the players can earn rewards and how to exchange it into cash. These are not only increasing the enjoyable and trustworthy side of the game but also give us a vision of how this game can meet the challenge KPI. In addition, the team needs to show more metrics for us to have a better vision about the proposal’s possibilities to align with the challenge. One more thing to be talked about is: the team didn’t address all of the risks generally, only one risk of hacking are shown without a reasonable solution. There are lots of other risks that can happen during a game project such as: delays, cost overruns, coder and designer risks or changes in the game market, etc. More risks and solutions will need providing to make this proposal a higher score in Impact and also can help the gamers chained. To me, this is a 2 over 5.", "q0r": 2, "q1": "a well -noted on detail plans are given with verified steps. The team are doing great on showing a clear vision of what to do during all stages of the project. However, I would like the team to address more about the roadmap and milestone for a better review. The budget is reasonable and aligns with the detailed plans, this is another praise for this proposal. Attached those with a timeline will make this proposal a worth funded one. On the other hand, the team didn’t have the exacted team member list, this maybe will cost more time and money on recruiting and will lead to the delay of hiring or hiring the wrong people. Please do some researches and target the team members to have a list of them, this can help the proposal possibilities increase. For the Feasibility, the team scored 3/5.", "q1r": 3, "q2": "the team has good idea of how to maintain the project, for examples: the code on Github and the website for us to track on the progress easily. As stated above, the website is user friendly, I’m looking forward to seeing the project updates on it. However, the team should work more on how to report with KPI and sales target on a fixed timeline. To be specific, please show the metrics that can aligns success on the challenge setting. Move to the next step, I would like to have a clear vision of success, since I can only see the statement of the problems. The team can provide the detailed plan of what they will do to help the children or the metrics how percentage children can be helped. Otherwise, this seems unrealistic to me. Clarity score for the team is 2/5.", "q2r": 2, "assessor": "z_assessor_1726", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6227, "q0": "This proposal aims to create a clothing battle game with the intention of giving all the profits to charity. While the purpose of creating this game is noble, the proposal fails to provide the basic information about the game. Without proper information on the game, it is hard to assess whether this game will give any impact to this challenge. The most important thing before thinking about profits or charity is the game itself. Without a working and fun game, there will be no user. Without user, there is no money to be made thus failing your mission to giving out to charity. Therefore, in future submission of proposal, it is suggested to explain more details about the game itself. What will be the attraction of the game and how can it onboard millions of users.", "q0r": 1, "q1": "The proposal does not provide any verifiable relevant experience nor skills to successfully implement the project. The required manpower and resources to implement the project are also incomplete. The team does not have any experience in writing plutus code, therefore there is a need to hire a plutus developer. With the budget provided, it is impossible to hire the required manpower to successfully implement the project. Furthermore, there are no detailed roadmap or timetable to complete the work. The plan provided are unclear and not related to the development of the game. There are no explanation on the technical aspects of the game nor the technology that will be used to create it. Therefore, the proposal should include a step by step plan on how the game will be developed with details of its technical aspects and technology. Moreover, should the proposer plans to submit again in the future, it is advised to explain the mechanism of the game first and foremost, before getting into promotion videos and creating hype. Consequently, it is hard to assess whether the proposal can be implemented. ", "q1r": 1, "q2": "This proposal does not provide any milestone or time horizon to complete the project. Moreover, there is no KPI both for progress and success measurement. There is also lack of information regarding where the voters can keep track of the progress. The website provided by the proposer is a default web template without any information about the team nor their project at the time of the assessment. In the future, should the proposer resubmit the proposal, it should be included with progress and success timeframe in a monthly basis preferably, with its KPI for auditability purpose. In conclusion, the information provided is not sufficient to be audited.", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will be raising money with all the revenue we get from packages (explained later). And we use that to improve working conditions.", "experience": "We have never started an NFT business. We've been in crypto for 1.5 years now and ever since we saw Cardano's vision, we were inspired. Because one of us knows more about making games and the other knows more about the business behind it, we hope this will be a success."}