{"id": 401098, "author": "educhainment", "title": "Aedou - Realm of Languages", "url": "https://cardano.ideascale.com/a/dtd/401098-48088", "category": 26440, "amount": 57900, "description": "Education is often expensive, separated from its context, demotivating and dependent on your language. It's hard to find language tandems.", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": ["https://www.youtube.com/watch?v=rD6HKOkjddo"], "media": [], "f6_assessments": [{"id": 7423, "q0": "This proposal fully fits the objectives of the challenge, I believe it can be a gateway to an audience that is not necessarily blockchain enthusiast, but wants to learn languages, and if the game is successful it will automatically attract people, because of its premise , who organically became members of the Cardano community. It is a world creation, in fact several worlds, in which the player will interact with the environment to learn a language. Each language is a world, and each world and the little things within them will be DAOs, which is where Cardano's technologies come in. It is also said that Atala Prism DIDs will be integrated into the game, so that the advances made can form a kind of curriculum of proficiency in that language, which can be used for game purposes or for real life. It is interesting that the environment adapts to the player and not the other way around, as it is said, many times in the traditional learning process the student needs to \"force the bar\" to fit the context, and here the learning would be in its own time, at least. As I understand the challenges will become more difficult as the student/player improves their proficiency in the chosen language. Multiple languages ​​are listed, I think the game will appeal to a very wide audience (I would play this myself, and I'm not a traditional player). I think it was very positive how the proponents explained so extensively and in such detail a) the concept of the game b) the gameplay c) the target audience d) how this all relates to the Cardano ecosystem. So I'm sure this project deserves full marks, it seems to be a fun way to learn that will benefit the entire gaming community that wants to venture into new languages; it looks a lot like exploration and world building games, which are very successful; and it seems to me a project that will have a high positive impact for our blockchain, as it will adopt our technologies in many ways. \n", "q0r": 5, "q1": "I think the game's script is good, but it could be a little more detailed. The activities that would be developed each month are mentioned, but more information could have been made available; such as, for example, a more in-depth detail on these activities, the division could also contain what would happen each week, in addition to the months, it could be said that professionals would be responsible for each task and so on. I think the action schedule is good, but it could be even better, we could have a more specific view of this development process. About the budget, I also think the explanation is good, but somewhat superficial. We know that the money requested would mostly be used to pay the salaries of those involved, but we could know, for example, how many hours they would work per day, if they would dedicate themselves every day of the week to this project... the value of their working hours and our understanding of how the funding would be used would be much more in-depth. That is, both the script and the budget are explained in an ok way, but not ideal. Now talking about the team, this is the best part of the feasibility, we know a lot of details about the professionals involved, such as their names, what professional area they work in, a good resume with previous experiences and their linkedin profiles. We have complete confidence in them, as their descriptions are very rich in detail, I really think they are technically prepared to successfully execute the project. The attached video is super cute and already demonstrates a little bit of what they are capable of doing, as if it were a kind of project trailer. Finally, my view is that feasibility is good, but not perfect, as I've mentioned; the first two topics should be more deeply detailed and the last topic (from the team) is perfect. \n", "q1r": 5, "q2": "This topic is very good, but I still have suggestions to make. Several KPIs are pointed out, for short and long term, which can serve as measurable consequences to verify if partial results would be obtained. It is not so clear, however, with these data they will come to the knowledge of the Cardano community. Would there be monthly reports? And if so, through which communication channel will they be made available? We have several ways to do this, such as our telegram groups, discord channels, even online platforms like google docs (just that everyone who has the link can access the document). In general, I think we do have something to audit, I just don't know how, because they don't make this bridge with the Cardano community so clear. Now about the final results, some successful statements are not given, such as: “we intend to finish the base content of the game and iterate on the MVP”, “the finalization of the basic linguistic content for each language to define common bases and approaches for learning ” and “we hope to include some first PRISM components and start the formation of test-DAOs”. Again, we know what would be measurable, but we don't know how; I would very much like the proponents to make it very clear how they are going to get this data to all members of our ecosystem. I think that, in general, the auditability is good, but it could be improved, a survey could also be carried out with the players, trying to understand if they sought to learn more blockchain, if they were captivated through the game to get more involved with Cardano, in particular. I always think it would be a good idea for a general meeting to be held after the game's full release and a few months of activity, so that we could understand if everything went as planned in the game's development process and also study more carefully the consequences of this for Cardano. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thanks so much for your detailed feedback, appreciate it!! Definitely took some notes to improve our auditability of outcomes even more, like setting targets (thought them too obvious). We will also use the Coordinator monthly report to follow up on the results of our KPIs and milestones, and as I am part of the Gamers On-Chained challenge team, we will report on the progress of all funded proposals back to the community in townhall etc., and this will include hopefully Aedou. :)"}, {"id": 4, "q0": "This one fooled me at first. My initial reaction was that it didn't belong in \"Gamers On-Chained\" because at face value it resembles more of a educational tool rather than a game. However after further reading it became clear that the project, if funded and successful, will bring a metaverse inspired environment where people can play and learn to earn, or as a member in a DAO, set up a plot of land for a business, or just contribute language data for a contextualized environment. It also gives the user the choice to participate in the play to earn settings, or to just use the platform for learning only. There is planned support for several languages which will give the opportunity to onboard many users. The project is planning some big things, and if successful will not only bring value to Cardano gaming, but Cardano in general. The are plans to integrate with Atala Prism, and bring in the functionality of a DID scheme, and no KYC. The demoed project looks really interesting and would make a great addition to the Cardano ecosystem. ", "q0r": 5, "q1": "This is quite an ambitious project. To be able to pull together Godot, Cardano, Atala Prism, DAO formation and tokenomics scheme together with a fully built out Alpha project by 2023 seems unreachable. However, because the project is well put together, and seemingly has a workable demo product that looks and feels appealing, I am willing to believe it might be accomplished, but I am not going to give 5 stars.  Obviously, if Cardano, Godot, or Atala have any setbacks, this project too, will be set back as well. In addition, I feel that the budget break down is rather vague and not clear enough. For example how did they arrive at 14 languages times $600? I would recommend spending a little more effort here, so that the voters feel more confident in the fiduciary competence of the project. ", "q1r": 4, "q2": "It is recommended that the proposer explain how the goals and KPI's will be measured, tracked, and communicated to the community. This can be in the form of YouTube video updates, a section on the website that provides written details about the progress of the project, or Catalyst presentations. ", "q2r": 3, "assessor": "z_assessor_1003", "no_vca": 19, "ne": 9, "ng": 9, "nfo": 1, "vca_o": 1, "reply": "Thanks for the detailed feedback, we took some notes in this general CA-period to improve our proposals even more! As I am part of the Gamers On-Chained Challenge Team, this proposal will get audited according to the KPIs and milestones, based on the Catalyst's Coordinator monthly progress report, and reflected in the monthly update that the Challenge Team will provide on all funded proposals for the community - so hopefully ours as well. :)"}, {"id": 6614, "q0": "This is the part one of 2 proposals that aim to build as interactive gaming platform. I like the idea of the gamification of learning a new language. In addition to that there are also play to earn functionalities that are optional. Altogether, I think that this is a great idea and will bring a lot of value in the cardano ecosystem.", "q0r": 5, "q1": "The proposers have done a good job explaining how they will build the platform. Furthermore, they have provided all the necessary information about the team members. The budget is also broken down and looks reasonable. I think that this proposal can be implemented successfully by this team.", "q1r": 5, "q2": "I think that the proposers have done a good job providing the necessary information that will help track the progress of this proposal. They have included a roadmap that goes until Q4 22.  Moreover, the metrics/ KPIs are strong and clear. Altogether, I think that the have done all in their power to ease the auditability of this project.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thanks for the feedback!!"}, {"id": 10619, "q0": "This proposal has a lot of promise. If successful, it can capture players from outside the blockchain space, both in the education space and the gaming space. The optional approach to blockchain technologies is also optimistic -- gamers naturally repulse from NFTs and crypto as they see it as a form of greed. Whether this opinion holds any water is beside the point; this popular perspective can be a major obstacle for onboarding players. The proposer seems to be taking steps towards presenting NFTs in the best light possible, namely digital ownership instead of speculation. Despite that, the proposed game is open-source and thus offers many benefits to the blockchain/NFT/crypto space. Smart contract treasury could be used by other DAOs and NFT projects. Atala PRISM DID is utilized for proving player progress, reputation within the community, and monetization of their anonymized data. Players can play-to-earn, basically rewarding them for their education. The proposal shows deep comprehension of Cardano's vision, as even the language choices like Swahili and Oromo make sense in context of where Cardano wishes to expand. In short, Aedou could have a massive impact on Cardano if it successfully delivers its vision.", "q0r": 5, "q1": "The proposal includes the experience and proof reference for the team members. What is shared is enough for confidence in delivery of game design and graphic design aspect of the game. The proposal could benefit from including more proof of crypto expertise however. Smart contract treasury, Metaverse(plot land; pet, collectible, mount NFT), wallet integration, Atala PRISM DIDs, tokenomics... the ambitiousness of Aedou could mean longer development time. The proposal has awareness of plausible roadblocks/challenges which can be out of their control. Lack of collaboration and community engagement could be a difficult one, but the financial incentives proposed may solve one of those issues. \n\nThe proposal is ambitious and the timeline provided is tight -- if there is not enough collaborators then the language aspect of the game might not be finished in time. The deliverable suggested is a public alpha on Q4 or Q1 2023, which means the key metrics of the Challenge can only be measured much later down the line. ", "q1r": 3, "q2": "The KPIs listed are perfect for auditing the progress and success of the proposal. It would indicate development progress, interest level of the market, and level of collaboration in language development. It would be helpful to include links to Discord server, github page, and social media links for the community to follow along progress. Currently, the website has a Reddit page but the majority of the NFT community spend their time on Discord and Twitter. ", "q2r": 4, "assessor": "z_assessor_948", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thanks for the detailed feedback! It's true, we cannot predict too long into the future with this open community process, but we are in no hurry and here for the long run, and want to include as many people and institutions as possible!"}], "solution": "Aedou, an accessible/inclusive play-to-learn-and-earn MMO. Learn and teach languages together in engaging, safe, active & explorable worlds.", "experience": "Educhainment Collective (funded in Fund 6 & 7)\n\nFirst-Cohort Plutus Pioneer\n\nFull-Stack & Godot Game Dev\n\nProtonGraph-Creator, an FOSS procedural 3D-generation tool\n\nFrond-End-Dev\n\nSound/Visual/Generative Artists\n\nUX/UI\n\nCultural Scientist (game-based learning)\n\nSocio-Linguistics"}