{"id": 403708, "author": "quest.zwerg", "title": "AdaQuest ARENA - Finalize", "url": "https://cardano.ideascale.com/a/dtd/403708-48088", "category": 26440, "amount": 40000, "description": "Arena mode is currently in Alpha and needs further polishing, balancing & testing to deliver a F2P and NOP2Win gaming experience for players", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "We realize that the game of the project in question has a solid foundation in relation to its plot and the characteristics that make up its universe. These are great indications for us to understand that the project was not created just to explore the NFT feature, but that it really aims to bring fun to players. With this, we see that the proposal fits well with the goals of the challenge, as it has the potential to bring new people to Cardano's ecosystem, through a game that will use technologies from this ecosystem as an additional attraction. In addition, the possible success of the project induces greater visibility for other games to follow this path of using the Cardano blockchain. All this leads us to believe in a positive impact of the proposal over time.\n\nFurthermore, we note that the total amount being requested of $40,000 is consistent with what you want to accomplish at that time. This will also make sense as this analysis continues.", "q0r": 5, "q1": "Regarding the professionals being involved in the proposal, we noticed that they have an immense experience with development, but especially in the area of ​​games. The team's stakes in gaming giants such as EA, Ubisoft and Rockstar are cited. Additionally, CVs were made available to verify these experiences. This shows that the team certainly has the knowledge to structure a good planning in the feasibility plan. And in relation to these stages of the plan, we note that they are well divided in time, with what should be done each month being detailed. We also note that the logical structuring of these steps makes sense, initially game mechanics will be finalized, and in consecutive months adjustments will be made based on the information collected. A general feature of the feasibility plan that conveys a lot of confidence is the idea of ​​continuing a project already in progress and which even has a release date for a beta version in June.\n\nRegarding the breakdown of the budget, we noticed a coherent distribution of expenditures, with the largest portion being earmarked for development (approximately 82% of the budget). But we see capital allocations taking into account not only development but also testing and game design. Additionally, the game's website is very well structured and rich in information, demonstrating the team's concern to create a lively and captivating ecosystem. Looking at the information there, we see several ideas that integrate the game concept with Cardano characteristics, such as the possibility of allocating ADA in specific stake pools and receiving as a reward, in addition to ADA, also in-game currencies.", "q1r": 5, "q2": "As for the ways to track the game's progress, we see that the team exposed clear ways to observe periodic development results. Among these, we note that tools such as JIRA and Slack, very common in software development, will be used, in addition to weekly meetings that will also be held.\n\nAnd in relation to the perception of success pointed out, we see that the main idea exposed makes sense, but it would be interesting if numerical goals were exposed describing what reach you want to achieve with the game initially. We are left with some questions like, what is the expected amount of players at the launch of the beta? How many NFT's of cards are you planning to sell or what is the average revenue generated by this sale?\n\nIn general terms, we realize that this is a project being carried out by a very competent team and that aims to reach a large potential audience. For all the characteristics described, there seem to be great chances for this game to be successful.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Overall, I would say that this is quite a rounded description of the project. First and foremost, I would like to talk about how much thought dedicated to the gaming community has gone into the making of this project, which is an admirable effort by the team. The proposal focuses heavily on the various features built into the game, which is also one of the rare games I’ve seen that comes with both the PvE and PvP game modes. In addition, the proposal claims to prioritize a fun gameplay experience for all participants and at the same time utilizes what properties Cardano has to offer. Another bright spot of this proposal is the wide array of target audiences, all of which hold the prospect to strengthen the game in particular and Cardano in general. The team has also managed to include a number of slightly pressing obstacles and risks, and while I believe that the offered solution should somewhat minimize them, the budget could enable the team to fully eliminate the “threats”. \nHowever, if possible, I would prefer the proposer add more specifics relating to the game lore, setting and reward mechanism. Furthermore, some accompanied figures for those specifics to act as core metrics would also be appreciated and make the proposal more convincing.", "q0r": 4, "q1": "The roadmap established by the team is transparent and I absolutely welcome the insertion of the number of members for each stage, though I usually imagine this section to be longer than what I’ve been provided. Yet, despite the lack of length in the roadmap, the proposer more than makes up for it in the team member section, as it covers basically every pivotal aspect of the participants, including the relevant background, expertise and further verification via the provided LinkedIn profiles. And this performance also applies to the freelancing factors, which is very commendable. Therefore, I would confidently say that all of those mentioned merits would suffice for the approval of the requested budget.", "q1r": 4, "q2": "From my understanding of this section, I believe that this proposal does hold a certain level of clarity since it acknowledges the use of tracking tools such as JIRA, GitHub and Confluence, all of which offer a more convenient experience for both the team and the community to monitor and direct the project. While the envisioned success for the project does seem to meet the requirements of the challenge setting, the proposal lacks some assumption of core metrics to support their statements, for instance, the expected user base or an approximated immigration of users to Cardano", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This is yet another module of the project AdaQuest, which seems to be growing into an inspiring RPG game with different modes. They are going in depth to build this little playable universe (including integration of NFTs to the gaming aspect of it). This proposal of theirs amongst all the others of theirs, fits very well into the challenge, being the creation of a game based on Cardano that will for sure draw attention and a reasonable playerbase if the end product is well finished based upon their previous work. . ", "q0r": 4, "q1": "As I’ve assessed before the other proposals, I still believe in the team behind this project. In this segment they’re asking for funding to finish their ‘Arena-gamemode’ so that they can progress it from just an alpha stage. Falling in the trap of repeating myself, that with the timeline presented and the credentials exposed I’m still fairly confident on their capabilities on moving forward with all the multifaceted parts of this project, going from gamedev to marketing(etc.) . ", "q1r": 4, "q2": "AdaQuest’s team are very clear and transparent on their work methodology and have shown their progress made through previous funds. In terms of auditability, it's simple and straightforward to see and look for their progress on tools like Github among others. \n\nWhat troubles me the most still, is the multifaceted aspect of the project by reaching out to  Catalyst through several proposals. That if one is not approved they face some delays. But regardless I’m confident in their persistence to reach their goals. \n", "q2r": 4, "assessor": "z_assessor_416", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Since everything is statet out a great by the Accessor(Impact & Feasibility) why we are getting only 4 stars in this both Notes? The Auditability Note is fair and we are okay with this."}, {"q0": "The idea is great, about to polishing, balancing & testing the ARENA, which is the first game mode of the team as the product of the funded proposal in Fund5. We need to see what ARENA is by clicking into the link https://ada-quest.com/ to understand how great it is (playing free without any paywall, being easy and user-friendly, involving the community into the development). Besides, I found this: after successful implementation of the project ARENA since Fund5, this round of Fund, the AdaQuest authors propose 8 proposals (6 proposals for ARENA mode and 2 proposals for Phase 2 of AdaQuest). I think we should read all of them to understand the AdaQuest project as a whole. They are:\nhttps://cardano.ideascale.com/c/idea/403708 (polishing, balancing & testing the game - this is the current proposal we are assessing)\nhttps://cardano.ideascale.com/c/idea/405445 (enhancing the graphics of the game: re-design, create and enhance characters)\nhttps://cardano.ideascale.com/c/idea/405317 (marketing strategy)\nhttps://cardano.ideascale.com/c/idea/404315 (delivering adventures within the game  for PVE players)\nhttps://cardano.ideascale.com/c/idea/404938 (hiring the sound designer for AdaQuest and creating a free sound library for Cardano game projects)\nhttps://cardano.ideascale.com/c/idea/404893 (creating a module for socializing and housing in the world of the game)\nhttps://cardano.ideascale.com/c/idea/404544 (creating the concept for Phase 2)\nhttps://cardano.ideascale.com/c/idea/405375 (developing a prototype for Phase 2)\nThis proposal not only fits the challenge “Gamers On - Chained” but also add value to the Cardano ecosystem because if it is successful, the project will help to increase: number of users of gaming based applications built on Cardano, number of CNFTs made specifically for gaming, number of fungible tokens made specifically for gaming, which are in the success metrics of the challenge. Additionally, the challenge “Gamers On - Chained” was initiated by the team, so that they are well-known about which proposals will address the challenge, therefore the impact of this proposal should not be a problem.", "q0r": 5, "q1": "The authors provide information in full details for us to assess the proposal’s feasibility, consist of team’s information, detailed plan, marketing strategy, KPIs, target groups, budget breakdown and challenges/risks related to the project’s success. About the team who makes up the project and their partners (freelancers who are they working with), the information is provide very detailed, we have their names, their professional majors, number of experienced years, their roles in the project, their skills and experience related to the project conducting, we also see their social links to get more information about them. Especially they delivered the first mode ARENA successfully and truly great, I think that is the strongest evidence to prove the project is in expert hands. The clearly understandable plan allows us to see what need to be done in a chronological order in term of 3 months. The target groups as well as the interesting marketing strategy are also explained reasonable. Regarding to the financial amount, we can see it is broken down reasonably well into identifiable items: tech lead, support coder, testers, game designer, and development of advanced game mechanics. Additionally, the team foresees challenges/risks that they may face when conducting the project, and they also gives solutions/ mitigation, helps us underrstand more about the project and raise the trust from readers that the proposal will be implemented successfully.", "q1r": 5, "q2": "This part of proposal is provided in a good level of information, consist of roadmap, milestone, time horizon and KPIs, help us easy to understand what will be measured or monitered. The “success looks like” section is explaned very well for us to understand what result would be expected, give us to have the vision of the project. The team also explains that the progress of the project will be upload on well-known tools like like JIRA, Github and Confluence, so it would be easy for tracking public.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Polishing, balancing & testing needs time and resources. Our team already working on the Alpha release will require both to finalize it!", "experience": "Code: Dirk 20 y, Victor 6y, Daniel 5 y, Pavel 4y\n\nArt: Christian 15y, Robert 10y, AnnKa 4y\n\nGame-Design: Alex 5y, Mike 5y\n\nBiz: Marcin 15y\n\nLore: Tom 25y\n\n----\n\nTeam worked already for THQ, Ubisoft, EA & Rockstar, several Indie dev-studios\n\nMore info: https://ada-quest.com/about"}