{"id": 404260, "author": "drep1990", "title": "The next generation Tower Defense G", "url": "https://cardano.ideascale.com/a/dtd/404260-48088", "category": 26440, "amount": 150000, "description": "Many blockchain games these days are unappealing and have a lack of depth as gameplay along with an unsustainable reward economy.\n\n", "funded": 0, "upvotes": 24980059, "downvotes": 22225177, "votes_result": 2754882, "votes_cast": 107, "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 3590, "q0": "From what I’m given to understand in the proposal, I would say that this project is one of the bright candidates for a spot in the list of projects that Cardano can keep hold of in the long haul. And I state this comment for a number of reasons. \nFirst and foremost, I would like to point out that to my knowledge of the gaming world, I haven’t seen a lot of renowned titles that sport the Tower Defense genre, so this “market segment” could very well be worth the attention. And with the introduction of a play-to-earn cryptocurrency-based mechanism, the appeal should grow even stronger. \nThe second part that this proposal nails is the specification of the features and content of the game. Namely, the listings include, in presented order, the actions that players can make to generate passive revenue from the game by making use of their NFTs characters and land assets, the gameplay mechanism which recites various PvP-based game modes, main objectives and tasks, and a very reasonable reward system focusing on the native token of the game, $SPIZE, which can be used to deploy to other actions in the game. My personal favorite feature has to go the Create-To-Earn game mode, since not only is it uniquely native to the game, but it also requires players to tap into their creativity resource in order to customize their land assets into a challenging battlefield for other players.\nLast but not least, the team also lays down some fundamental problems that the challenge may face in the foreseeable future, followed by a very intricate description of how the team plans to solve those problems. My kudos.\nAnd I believe that this project shall align comfortably with the main objective of this challenge, further supported by the given figure of a core metric to measure, which is an estimated 50,000 people for a user base, though I suppose more figures as such would further solidify this proposal.", "q0r": 5, "q1": "From the road map provided, I can safely claim that the project should be expected to meet a resounding success, as approximately 50% of the project has been finished prior to this proposal, although I would suggest the proposer add some envisioned milestones for each stage of the process, or at least for the 2 phases. As for the requested budget, the amount of money required for each stage is very organized, however, I think it would be grasped more quickly if the proposer listed each part under specific numbers rather than percentages. Over at the team member section, the information given is quite sufficient, providing the background and expertise relevant to the project of each member, yet for further verification and reassurance I recommend adding a dedicated website link to respective profiles. Having considered everything, I am confident that the requested budget is fairly grounded.", "q1r": 4, "q2": "In regard to this matter, even though there are criteria from which the team can measure progress and development, I believe that the for the sake of achieving full clarity in the eyes of the community, I’m not sure if the Github link provided at the top of the proposal is also for the community to keep track of progress or only accessible by the team, so some specifics on that note would be appreciated. Other than that, according to the proposal, the Cardano blockchain is highly guaranteed by the desired success of the project, as demonstrated by the core metrics chosen by the team, all of which also share similarities to the ones in the challenge setting", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3825, "q0": "The proposer aims is to make a blockchain tower defense game. Some following points in the proposal that makes me believe they have good foundation for success:\n- tower defense is a classic game genre that can attract entry level gamers\n- combining with deck building element which will keep seasoned players insterested as well\n- PVP mode is a new mechanic in this genre that makes the game stands out from competiors\n- the ability to attract content creators and encourage input from players with create-to-earn system\nOn top of that, understanding the Oversupply of Gamefi projects in the market, the team also point out a clear emphasis on community building - an essential element often get overlooked by many proposers. \nFor those reasons, I think that this proposal has high potential.", "q0r": 5, "q1": "The team provided a clear plan with many action points completed in advance. This show the preparedness and commitment of the team. I see that there is a game trailer completed but can't find it on website. My suggestion is to include it in the proposal so we can have a view on how the game would look like.\nThere is a very detailed budget breakdown for phase 1 with $300k investment which I find reasonable. The proposer expects to spend $USD 1-2mil raised from selling NFT, Private Sales. This heavily depends on how well phase 1 and the market positivity at the time, so quite unpredictable I would add. Considering the enormous budget required, the team could elaborate more about the scope of 2nd phase and from that, justify the $1-2mil budget.\nThe team provided the qualifications and experience of each member whose backgrounds are very diverse and impresive. Although there were no profile link provided, I can verify via websearch which is legit", "q1r": 4, "q2": "The team suggest a list of metrics for both for phase 1 and phase 2 separately. They all match the challenge success metrics quite well and reflect the preparedness of the team accordingly. I suggest including these as phase 1 get developed:\n- Providing tools for the community to keep track of development progress: reports in different platform, Github commit ..\n- Mini game performance evaluation after release\n- Feedback on the minigames from community\n- Community growth during and after phase 1", "q2r": 4, "assessor": "z_assessor_1685", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4503, "q0": "This proposal has identified a problem within this challenge and clearly articulates how it will add value to the Cardano ecosystem as gaming is a crucial, but not exclusive, element to a sustainable long-term crypto ecosystem.\nTheir goals are aligned with the outlined challenge settings and the proprosal is able to address future challenges. ", "q0r": 4, "q1": "Although the proposal provides references of relevant skills and experience, it does not provides links or evidences to sustain it.\nThe team seems capable enough to implement the proposal.\nThe budget is clearly broken down into identifiable items, however the items budget don't show enough rationality to sustain reasonability.\nThe proposal has provided a verifiable plan to additional funding needs, although it's success depends of incountable variables.\nThe proposed timetable seems realistic enough, although it will depends of previous achievements and the path to measure success isn't provided.\n The are no technical aspects explained.\nChallenges and risks are considered, however there is no plan to outcome adversities.", "q1r": 3, "q2": "The proposal only mentions superficial milestones and time horizon for achivement, KPIs are well defined to understand how successfull and sustainable the project is.   \nThe project is designed with the targeted problems well understood, however the solutions to the addressed problems don't seem sufficient.", "q2r": 3, "assessor": "z_assessor_1738", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5112, "q0": "A lot of respects have been defined. Very impactful in a large wild. The problems were stated very clearly, suitable for challenge questions. The proposed solutions are also very reasonable", "q0r": 5, "q1": "There is a detailed implementation plan with reasonable timelines.. There are 2 phases to building Alonia project, most of the milestones have been done in phase 1. This proposal is mainly for completing the milestones in phase 2. Total requested 130k USD and has been allocated to specific tasks by percentage. There are 2 Co-founders and 8 other members, specifically assigned, however, it lacks the profile links. Hopefully, in future funds, the team will provide some link profiles of members, at least with the top 2 members: PERD HANG TAN and JOSH ANG to help the community know who you are, how experienced and background knowledge you are.", "q1r": 3, "q2": "For metrics to measure, there are a lot of KPIs were defined. Easy to measure, easy to check. One important indicator is DAU (Daily Active Users). The success full of the project is very clear. Integrate to the Cardano blockchain and an ecosystem of players with 10k-15k Daily active users. This is the first time this project requested funds in Catalyst.", "q2r": 5, "assessor": "z_assessor_186", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5971, "q0": "This proposal aims at creating a new Tower Defense game based on the Cardano blockchain. It intends to solve some of the recurrent issues that we see in the other games, like unsustainable economy and boring games. It aims at offering also governance mechanisms, career path for gamers, competitive and fun game and a create-to-earn mechanism. The latter would be a passive income for gamers who manage to create compelling enough maps so other players would pay a fee to make use of it. Also, they want to bring back a legacy kind of game, which is tower defense, and it will be very compelling specially for more veteran gamers (which has a large interception with crypto community). They mention a mini-game as well, but don’t provide much details. The mechanics of the main game are well described and very similar to traditional Town Defense games, so the gaming experience will probably be very pleasant. They also describe the utilities of the token and mention that they would be enough to guarantee the economic sustainability of the game (I’m not sure about that), and describe one of them, which is the mentioned create-to-earn mode, which is indeed well thought and quite interesting. They cover the main risks for the game: the development of Cardano itself, and the amount of games being developed, and the solutions proposed solutions are good: migrate temporarily to another blockchain (not ideal but understandable) and focus on delivering the game (since they mention a lot of games are currently more marketing than anything else).", "q0r": 5, "q1": "The proposal presents a high level roadmap and milestones, which is not very detailed and might make it difficult for the community to keep track of the progress. Although, the steps listed there are good and aligned with what’s proposed to be developed. They provide an estimate of a total of $300k to be spent on Phase 1 of the development, but they ask for $150k in the proposal and don’t mention the reason behind this difference. There’s a NFT sale planned, but that’s just for after Phase 1. Also, some milestones of Phase 1 are already complete, and it’s not clear if they are included in the $300k or not. The lead team seems to be very experienced and capable, although there aren’t links to validate their background. Also, since this is the lead team, they are probably not going to do the ‘hands-on’ part of the work and they don’t mention how the actual working team is, or if they are going to still look for people. This could be clarified.", "q1r": 4, "q2": "The proposing team mentions that the audit of the proposal could be done through the delivery of the milestones mentioned in the proposal, what is fair. They also mention the KPI of NFT sales, token sales numbers and active users. For phase 2, the text seems to be incomplete, since it looks like there’s some information missing. Also, it was not clear previously that phase 2 in actually included in the proposal, since only phase 1 would required more than the requested budget of the entire proposal. The success criteria is the successful development of mini game and main game, as well as having a fair amount of players in the ecosystem. Some metrics for the next months would be good, because they mention 10k to 15k players but don’t define a timeframe for that achievement. Also for phase 2 there’s a similar problem, they describe some KPIs and goals but without timeframe, which doesn’t make it possible to really use it to measure success properly.", "q2r": 4, "assessor": "z_assessor_31", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6102, "q0": "This proposal is a strange one because i had to read it twice to understand what is happening.I will be giving this proposal a 3 for impact and below are my reasons:\n-This proposal is way too focused on how to extract money from the players at every turn. I believe the proposer felt some guilt that they had to add just one paragraph at the end of the impact section to say they care about the gamer.\n- In the risk and challenges section, the Proposal did not touch on the issue of transferring NFTs between chains as this is a big blocking problem with crypto-assets.\n\"Alonia aims to hit at least 50000 organic followers in the next two months.\" - THIS IS UNREALISTIC anyone who knows the TAM(Target Addressable market - https://corporatefinanceinstitute.com/resources/knowledge/strategy/total-addressable-market-tam/) for crypto gamers will tell you that number cannot be gotten organically in two months.\nThere was no conversation about servers and management though multiplay co-op (Create-to-Earn Co-op Game mode) was mentioned except if the multiplayer being referred to is a couch co-op which in turn is modern day gaming blasphemy with the existence of the internet and covid. \nwill we be paying rent in a game to play on a new stage?(Someones Land),This is pure money grab tactics ignoring the fun aspect of the game building mechanics around money making.\nI am giving 3 star according to CA guidelines as i can hardly tell the impact this game will have to cardano as it can easily become negative if gamers perceive that the game is focused on money grabbing as regards to fun and everything gaming is about.\nI am a gamer,I own my esports game and i love the art of game development (\nIOS :   https://apps.apple.com/us/app/id1488600103\nAndroid :  https://play.google.com/store/apps/details?id=com.sourcecard.whotfire)", "q0r": 3, "q1": "In  the \"Please provide a detailed plan and timeline for delivering the solution\" Section, the proposal provided a plan divided into 2 phases but failed to go into details on how long each individual activity will take to help the cardano voting community peruse the provided timeline.\nPlease kindly look at some previously funded proposals(https://drive.google.com/file/d/193GZulHuk0zhpTrMiLhcNC4OeEMoRyIa/view) on the On-chained category to see what is expected of a detailed timeline for delivering the solution.\nIn the \"budget breakdown\" Section, There seem to be a mismatch between the estimated amount ($300000) from the requested funds ($150000) making it difficult to know which of the amount is intended to execute the proposal.\nThe requested amount of $150000 out of a pot of $500000 is kinda highly and the proposal will benefit from breaking it into smaller parts across several funds to improve the chances of the proposal being funded.\nFinally the proposal failed to provide verifiable links for the listed team and therefore there is no way to verify the capability of the team.Please the proposer should checkout previously funded projects (link provided above).\nConsidering all of the above issues raised, i will be giving 3 stars as i have not been provided with enough to think this team is capable of delivering the proposal to success and according to the CA guidelines.\n ", "q1r": 3, "q2": "The KPI for this projects are the same as the timelines in the feasibility section which would have been fine for audit-ability but because the timeline is very broad(broken down by activities with associated cost).It will be difficult to closely track the progress of the proposal. There was no mention if a public link to a git or project management platform to help the community track the progress of the project.\nConsidering the above issues, it will be difficult to audit the progress of this project and the proposing team did no do a good job at detailing the costs, breaking it down to what it will be used for , when it will be used and how much will be used for that activity.I will be giving 2 star and i genuinely hope the team take this and used it to have a well written proposal.\ngood luck.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Alonia aims to provide a game with:\nCompetitive depthFun & appealing charactersSustainable EconomyAdditional Income for gamers\n", "experience": "Co-Founder of Alonia\n3 Years Experience working for Tata Consultancy Services as a Data Analyst and Software Engineer\nReal Estate Investor since 2011\nCrypto Investor since 2016\nProfessional Dota 1, Starcraft 2 and League of Legends Player\n\n\n"}