{"id": 404245, "author": "dao.coders", "title": "A2T: Alternative to Tyranny", "url": "https://cardano.ideascale.com/a/dtd/404245-48088", "category": 26440, "amount": 64000, "description": "Authoritarians use wargame simulations to refine their agenda strategies however decentralization advocates do not.", "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is well written and easy to understand. The main mechanics, features, and operations of the Alternative to Tyranny (A2T) game are described in detail, and examples of comparisons are also mentioned in the project.\nThe results of the proposal are defined by clear KPIs such as the number of users, gamers, the number and value of Popular and Freedom tokens that are specific to gaming, the number of content creators and new games created through A2T.\nThe three main risks are also carefully analyzed by the author and given specific measures.\nFrom the above points, we can conclude that the proposal has an impact on the Cardano ecosystem and aligns with the challenge.", "q0r": 5, "q1": "I believe the proposal will meet the outline.\nThe information on the feasibility of the project is presented quite fully.\nRoadmaps detail the amount of work to be completed each month over a period of 6 months. The information about the members is also presented specifically the positions required as well as the reference information of the members for each position.\nHowever, I think it would be more complete if the budget section could be further described the completion time of the 3 cost items as well as the number of employees and the unit price per hour or day.", "q1r": 5, "q2": "Overall, I think there's enough audit information in the proposal.\nThe criteria to determine the success of the project are clearly described (5 criteria).\nThe KPIs to measure the progress and development of the project are also quite specific and will be reported on a weekly basis. However, the methods that the community can use to monitor the project are quite general and the KPIs are not yet quantitative. The author should include detailed information on methods and tools that the project can use as well as describe more clearly the KPIs mentioned in the project.", "q2r": 4, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement and solution align well with the \"Gamers on-Chained\" challenge. This simulation game has some unique and interesting implications, that can help educate and experiment with a large number of users on various ideas that are central to the decentralization movement. While this can be built as a fun and engaging game, it has wide implications for creating a culture of decentralization advocates, and/or recognizing and improving on weaknesses in strategy that can be implemented outside of the gaming universe and in the real world. Lessons from this game, and experiences had, and experiments run, will inevitably cascade over into the Catalyst ecosystem. Additionally it has a high probability of bringing gamers into Catalyst that may have not otherwise had any previous interest in \"governance\" The KPI's are aligned with the challenge, and the open source nature of this work will provide a valuable resource for future projects and scaling the successful ideas and tools across various projects. The proposal includes \"Specific quantitative indicators to be tracked will be Total Number of Pull requests in Github, Total Numbers of Github commits and the Total Number of Errors Fixed.\"", "q0r": 4, "q1": "The proposing team has the technical experience required to implement this proposal, and to bring in and manage additional collaborators and developers where required. The budget is reasonable and clearly broken down with a realistic timeline. ", "q1r": 5, "q2": "The success criteria is clearly outlined in this proposal, and they have provided a roadmap with key milestones, KPI's and a timeline. This open source project will be easy for the community to audit through github. The DAO net team has successfully received funding in past rounds, and has shown progress on those developments. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal being put forth is a bit complex, and would benefit from being explained in better details, show some sort of infographic or mockups to understand exactly what is being proposed. It seems to me like the concept of the proposal is to create a framework for which anyone can build modules, but they restrict the system to making it about autoritarian control twarthing games which seems unecessary. In addition, the way the tokens system works is a bit complex (hence my suggestion to include an infographic of some sort), and while I can understand why players would want to fund games, I fail to see what the in-game purchases would be. In addition, the use of the words Freedom token and Popular token definetly brings the \"typical patriotic american\" stereotype to mind, which might rebuke a lot of users, reducing potential player base. As it is, in my opinion, the proposal is too abstract and should include a clear example of a typical game that would be in the framework. This comment applies, knowing that another proposal in fund 8 is literally a module for this proposal. The module is also very vague on details and does not go into details of what the game/module actually looks like", "q0r": 3, "q1": "I don't like that the proposers have 10 proposals up in fund 8, in which either the lead dev or the project manager are present. While it is possible to work on multiple projects at a time, I think this is stretching it. The lead dev's linkedin mentions that he is full time on another blockchain project, which makes me wonder if they would really have time/intend to deliver on their projects. In addition, the proposers claim to have had multiple successful funding in Fund7, but I could not find any information regarding what they delivered. Granted, I did not search for hours, but their website should be at least somewhat reflective of what they are working on.  ", "q1r": 2, "q2": "Proposer uses github as way to track progress, which makes sense. Success would be monitored through deployment of smart-contracts and actual use on-chain, which is clearly transparent.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to deliver an open source decentralized wargame simulator, where the community will propose various scenarios as the game content. Then these proposals will be voted for, and those successful will receive funding in ADA. The proposal contains mechanics to incentivize players, proposers, and so called \"purchaser\" - these are buying the \"freedom\" token. The game will have two tokens - freedom token (ingame currency) and Popular token (received daily to all users, used to support the proposal). The part I was not able to understand is - \"The Proposal budget is divided by the number of Popular tokens it has received to give a Freedom token purchase price.\" This should have been elaborated more clearly, also preferably with an example of some demo. At the same time it appears that proposers will have to be skilled enough to be able to turn their scenario into a game content. \n\nTo sum it up - the proposal is aiming to develop a game, which might have a large traction, if the proposers will be funded in ADA for the content by solving \"Tyranny\" issues. Even despite a detailed description, the solution lacks a clarity on some parts, and along with the fact, that it will focus a narrow group of people, I am decreasing one star. ", "q0r": 4, "q1": "The proposal is very detailed, and it contains a lot of useful information e.g. team members are currently two, with their linked in profiles, and there is also stated, that they are having three contractors - Plutus developers, so from this perspective, it seems feasible. \n\nThe roadmap is set to 6 months, but only end goals of each month is provided. More details could have been elaborated, at least for the first one-two months. \n\nThe budget of 64k is divided into 2 plutus developers, third party smart contract audit and a product manager. For plutus devs - 4k/month/dev, which is approx 25 dollars per hour (full time), so it is unclear whether the price will be so cheap, or they expect the work to be performed part time.", "q1r": 4, "q2": "The auditability of the proposal will be done via agile methodology and weekly meetings (but there is no information where to find these meetings). The open source code will enable to track the progress of the proposal via commits - this is always sufficient regarding the progress, but given the roadmap being not so detailed, it might cause issues to audit the progress, since we do not know at what week, what task should be completed (so the weekly meetings might not be so useful).\n\nThe success of the proposal is defined as a working MVP, with some community using it, working functions and features, along with passing the security audit.  I find these sufficient to audit (again via the github, along with the working product page - once set up)", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create an open source decentralized wargame simulator with community developed modules for specific scenarios.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals."}