{"id": 404315, "author": "quest.zwerg", "title": "AdaQuest PVE Quests & Stories", "url": "https://cardano.ideascale.com/a/dtd/404315-48088", "category": 26440, "amount": 35000, "description": "We like to reach a wider audience with AdaQuest.\n\nProblem!\n\nARENA mode is only ⚔PVP⚔. Not everyone likes this kind of game 😱", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=29325"], "media": [], "f6_assessments": [{"id": 3230, "q0": "The project is well aligned with the challenge. It demonstrates the need of combining three different game phases into one whole Fantasy World Game Experience. Adding Quest stories to the Player versus Player (PVP) is reasonable to achieve the proposed objectives - cover bigger Player versus Environment (PVE) audience. The proposal seeks to maintain GAME experience First - to keep the community excited and curious, while reaching a wider gamer-centric base and at the same time ensuring the development cycle. The proposal reveals that it will have a huge global impact and it has high level of scalability. ", "q0r": 5, "q1": "The information in the proposal reveals that the proposer has a great history with Cardano funds and seeking funding to build upon the previous funded projects. The media information provided, past history with the Fund, the will power to scale-up the ideas, the team experience is enough evidence to conclude that the team’s experience and credibility is sufficient for the kind of work. The strategies and activities proposed are sufficient to achieve the objective the proposal. The budget is defined and well explained. The risks are taken into consideration and the expected outcome/impact of a successful implementation surpasses the expected risks and cost of fund", "q1r": 5, "q2": "The KPIs, roadmap, milestones are defined. The team intends to provide “well-know”n tools like JIRA, Github, and Confluence to track the progress and success of implementation and I believe its adequate for the purpose. ", "q2r": 4, "assessor": "z_assessor_1629", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5972, "q0": "This proposal’s goal is to create a new game mode for AdaQuest. They are proposing to create a PvE (Player vs Environment) mode instead of just the usual PvP mode already being developed and/or covered by other proposals. The idea is to have a more broad audience since many people prefer PvE over PvP. This is a fair point and something that other game developers on Cardano are also thinking about. And it’s very well aligned with the challenge since this will increase adoption and consequently the number of minted CNFTs, total amount of transactions and all related metrics. The risks and challenges as well mapped and they make sense based on the kind of project they propose to develop, but based on their proposed mitigation and on the team’s experience, I believe they will be overcome without much trouble.", "q0r": 5, "q1": "There is a good roadmap presented, with a set of milestones per month, which makes sense according to the proposed development. Although, a single developer working for 3 months doesn’t sound to be enough to build an entire new game mode, so this makes me a bit skeptical about this development. But since they mentioned that parts of the code are going to be re-used from a previous development (ARENA mode), it’s difficult to evaluate it properly. The budget is aligned with the roadmap, and values are fair. The team’s background seem to be very appropriate and enough to execute the project, also considering the help of freelancers that might participate in the development as well.", "q1r": 5, "q2": "It is well stated how they are going to keep track of the progress internally, using project management tools. What’s missing is some way for external auditing, i.e. how the community will keep track of the development and check if everything’s going well with it. The success definition for the proposal is not well defined, unfortunately, since the statements there are very vague. Even though some metrics are mentioned in the impact section, there are no numeric goals to go after and any way to really measure the success of the proposal. The information provided about previously funded and non-funded proposals in Catalyst is good and improves the project’s transparency.", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6230, "q0": "This proposal aims to add another mode called quest and stories in their game. Adding more variety is good to cater wider audience that leads to more user/player onboard. With the introduction of single player mode also can create more business opportunities for the devs. More users means more transactions which gives more value to the network. As a hardcore gamer myself, I used to spent countless of hours playing RPG games such as final fantasy. It will be interesting to see a blockchain RPG game that is entertaining and also easy to access through mobile app. A pocket adventure game that can be accessed anywhere, anytime. Therefore, this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposing team provided their verified background in gaming industry, also they have been with catalyst since fund 5 therefore it is unquestionable that they are able to implement the plan. The proposer identified the required manpower and resources needed to effectively complete the project. The roadmap provided in details and realistic. They aim to release the first version on September 2022 which I am looking forward to try out. The budget presented seems appropriate, although the coder salary is quite on the high side. The proposing team presents a very good and detailed analysis of the proposal risks and challenges, and suggests possible mitigations \nin a good manner and most of them make sense. Based on all of this information, I believe that this proposal is highly feasible.   ", "q1r": 5, "q2": "The proposing team presents a very detailed roadmap with milestones and steps every month up to the final delivery, \nwhich makes it quite easy to audit this proposal. The success metrics are very well explained and can help to measure the impact of the proposal, as well as the KPIs, \nwhich are very easily trackable and very relevant to the proposal scope, and also aligned with the challenge goals. The auditability of this proposal is very high.\n", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6404, "q0": "AdaQuest’s project consists in developing a game on Cardano to help attract gamers into our space. This proposal of theirs shows their intent of being a well rounded game catering to all different kinds of tastes from PvP-scenarios to PvE ones. This falls very well under the impact of this challenge.", "q0r": 5, "q1": "Being that this is one of many proposals under their Project AdaQuest, their timeline and credentials still remain realistic. As this involves developing the PvE aspect of the game, they are synerging mechanics developed in their Arena mode to the PvE mode making it faster to work and progress their timeline. \n\nAlthough from an outsider perspective one can ask that, if going for a broader available experience ranging from different modules and scenarios (PvP , PvE), one might be neglected or that both might not be as top quality as it could’ve been. That if their focus were put only into mastering/finishing one aspect the end product could’ve been higher quality instead of being this solution to fix all sides of the gaming aspect. We’ll have to wait and see how the end product is released to make such judgements. \n\nRegardless for the goals that were set, I believe that they are capable of pulling this off.  \n", "q1r": 4, "q2": "In terms of auditability, there is plenty of content and KPIs to easily check through and verify their work. Not being their first proposal under this project, they are very clear showing all of their progress and previous work. This is an aspiring game project reaching out to different target audiences, they may face delays but as shown through previous funds they are persistent and capable. ", "q2r": 5, "assessor": "z_assessor_416", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8963, "q0": "The idea is great, about to reach a wider audience by delivering adventures within AdaQuest, which is the game of the team as the product of the funded proposal in Fund5, for PVE (Player Versus Environment), because the first game mode (ARENA) is PVP (Player Versus Player). We need to see what AdaQuest is by clicking into the link https://ada-quest.com/ to see the first mode ARENA, to understand how cool it is (playing free without any paywall, being easy and user-friendly, involving the community into the development). Besides, I found this: after successful implementation of the project ARENA since Fund5, this round of Fund, the AdaQuest authors propose 8 proposals (6 proposals for ARENA mode and 2 proposals for Phase 2 of AdaQuest). I think we should read all of them to understand the AdaQuest project as a whole. They are:\nhttps://cardano.ideascale.com/c/idea/404315 (delivering adventures within the game  for PVE players – this is the current proposal we are assessing)\nhttps://cardano.ideascale.com/c/idea/403708 (polishing, balancing & testing the game)\nhttps://cardano.ideascale.com/c/idea/405445 (enhancing the graphics of the game: re-design, create and enhance characters)\nhttps://cardano.ideascale.com/c/idea/405317 (marketing strategy)\nhttps://cardano.ideascale.com/c/idea/404938 (hiring the sound designer for AdaQuest and creating a free sound library for Cardano game projects)\nhttps://cardano.ideascale.com/c/idea/404893 (creating a module for socializing and housing in the world of the game)\nhttps://cardano.ideascale.com/c/idea/404544 (creating the concept for Phase 2)\nhttps://cardano.ideascale.com/c/idea/405375 (developing a prototype for Phase 2)\nThis proposal not only fits the challenge “Gamers On - Chained” but also add value to the Cardano ecosystem because if it is successful, the project will help to increase: number of users of gaming based applications built on Cardano, number of CNFTs made specifically for gaming, number of fungible tokens made specifically for gaming, which are in the success metrics of the challenge. Additionally, the challenge “Gamers On - Chained” was initiated by the team, so that they are well-known about which proposals will address the challenge, therefore the impact of this proposal should not be a problem.", "q0r": 5, "q1": "The authors provide information in full details for us to assess the proposal’s feasibility, consist of team’s information, detailed plan, marketing strategy, KPIs, target groups, budget breakdown and challenges/risks related to the project’s success. About the team who makes up the project and their partners (freelancers who are they working with), the information is provide very detailed, we have their names, their professional majors, number of experienced years, their roles in the project, their skills and experience related to the project conducting, we also see their social links to get more information about them. Especially they delivered the first mode ARENA successfully and truly great, I think that is the strongest evidence to prove the project is in expert hands. The clearly understandable plan allows us to see what need to be done and what are the goals of each month in a chronological order in term of 2,5 months. The target groups as well as the interesting marketing strategy are also explained reasonable. Regarding to the financial amount, we can see it is broken down reasonably well into identifiable items: coding, testers, game designer, and illustrator. Additionally, the team foresees challenges/risks that they may face when conducting the project, and they also gives solutions/ mitigation, helps us underrstand more about the project and raise the trust from readers that the proposal will be implemented successfully.", "q1r": 5, "q2": "This part of proposal is provided in a good level of information, consist of roadmap, milestone, time horizon and KPIs, help us easy to understand what will be measured or monitered. The “success looks like” section is explaned very well for us to understand what result would be expected, give us to have the vision of the project. The team also explains that the progress of the project will be upload on well-known tools like like JIRA, Github and Confluence, so it would be easy for tracking public.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Quest & Stories will deliver adventures within AdaQuest. With this mode, we will aim for the PVE players thus reaching a wider target group!", "experience": "Code: Dirk 20 y, Victor 6y, Daniel 5 y, Pavel 4y\nArt: Christian 15y, Robert 10y, AnnKa 4y\nGame-Design: Alex 5y, Mike 5y\nBiz: Marcin 15y\nLore: Tom 25y\n----\nTeam worked already for THQ, Ubisoft, EA & Rockstar, several Indie dev-studios\nMore info: https://ada-quest.com/about"}