{"id": 404544, "author": "quest.zwerg", "title": "AdaQuest - Concept Phase 2", "url": "https://cardano.ideascale.com/a/dtd/404544-48088", "category": 26440, "amount": 23000, "description": "Ensure the start of production of our 3D isometric Dungeon Crawler. \nThis mode stages Phase 2 of AdaQuest and will need additional funding!", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Phase 2 of AdaQuest game - Isometric Dungeon Crawler - Whole AdaQuest is mainly focused on core gamers, later on NFT & blockchain enthusiasts, \nwhich in my view is really good sign to bring more players to the ecosystem. Fits well in the challenge. Concept art graphic look insanely good.", "q0r": 5, "q1": "Experienced team, with informations about each of them provided + linkedin profiles. Timeline, budget breakdown, challanges and risks provided.\nWe have also progress report as youtube video + another video with presentation.", "q1r": 5, "q2": "Proposal provide success metrics and KPIs, also informations about the roadmap, and milestones. The team report progress by youtube videos, and also on their social channels.\nWeekly updated roadmap.", "q2r": 5, "assessor": "z_assessor_1038", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is seeking for funding to evolve the Phase 2 of AdaQuest gaming experience from concept to prototype. It’s going to be a dungeon crawler type of game, and there is very good explanation about the gameplay in the IdeaFest video attached to the proposal. This is a project that’s been voted previously and is very known in the Catalyst community. The team focus on creating a good community, grow organically and to develop the game based on what is expected by the players, which creates a very good feedback loop. The KPIs stated are very well aligned with the challenge and are a good way to measure the success of the proposal. Besides, knowing very well they target audience really helps on creating the best marketing and growth strategy possible. The mentioned challenges and risks make sense based on the development proposed in the game, and the solutions to them are also appropriate to handle them. Based on the experience of them team, I believe they won’t have much trouble dealing with them. If successful, I believe this project will bring a lot of value to the Cardano community.", "q0r": 5, "q1": "The proposing team added a clear roadmap and milestones that make sense to the completion of the prototype. It is a short project, lasting for 2 months if all goes as expected. The required roles are well described, as well as the budget for each one, relating to the time required for them to execute their tasks. They mentioned that these rates and time are based on previous experience, which gives more confidence that they are accurate. The presented experience of the team is great, and they are already delivering other parts of the project, so we know they are capable of doing this. They have also added a list of all freelancers that might work on this project, depending on their availability, and links to their profiles in LinkedIn. Overall, the information provided in the proposal makes me believe it’s very likely that they will deliver what they are promising here.", "q1r": 5, "q2": "The proposing team included an explanation about how they are going to handle the project management internally, based on JIRA, GitHub and Confluence. Although, some information about how this is going to be reported to the community is missing. Since it’s a short project of only 2 months, this is not a big problem, but the information should be there ideally. The success of the proposal is defined as the accomplishment of all defined milestones, what makes sense, and the metrics included in the impact section are a good way to measure the adoption of the game, although they are related to other proposals that also influence these KPIs. They mention that this proposal is related to a previously funded proposal and also add their non-funded proposals, which is great for transparency.", "q2r": 4, "assessor": "z_assessor_31", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Auditability:\nWe are informing the community through our social media channels and discord server. Each Monday after our team meeting we are submitting the outcomes to our community. As a matter of fact, this kind of information is sometimes smaller, sometimes bigger. We do not like to promise things that we can´t hold too but if we got something important to communicate we do this. Like the last roadmap update: https://twitter.com/AdaQuestGame/status/1506192923146309634?s=20&t=Lk-zVMId8BHuWSo_0yaePQ"}, {"q0": "This proposal is continuation of the Fund 5 funded AdaQuest game .The current phase is tagged concept(designing game concepts with art etc).\nAs a game developer , i do understand the importance of this phase in development which is in-fact the game itself because without the concepts, there is no direction(Though indie developers would kinda boycott this phase).\nThe impact of this proposal to the cardano community is not in doubt as a request for further funding clearly indicates progress and the willingness of the community to see the project through to the end.\nI am giving 5 star.", "q0r": 5, "q1": "This proposal have titans in game development that have worked with big studios and they provided verifiable links to support that.\nThe cost breakdown is very detailed with a clear roadmap with timelines.\nI cannot say much as the team did a good  job.\nI will be giving 5 star as there is no complaint here as regards the required guidelines.", "q1r": 5, "q2": "This team is the reason why this challenge exist as it is also stated in the proposal and this team progress have been tracked via various method like JIRA, Github, and Confluence as stated in the proposal.\nEverything necessary to audit the progress of this proposal have been provided to make it auditable.\nI am giving 5 star.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Being one more proposal under the AdaQuest project, the development of a multifaceted game ranging from PvP-PvE modes and including NFTs, It very well fits the challenge of Gamers On-chained. As they intend to attract players to the Cardano space through this Fantasy world game. This proposal tackles their Dungeon mode, where co-op gameplay is intended but not restricted.", "q0r": 4, "q1": "As their project AdaQuest is well rounded and not being the first proposal assessed, I find it that their work method is still commendable, that their timelines are very well thought out so that the delays are minimal. But this all depends on the approvals of their other proposals, one tiny disadvantage to their grand and wide project. \n\nThe credentials of the team presented should be more than capable and their timeline is realistic. Even if they face delays or other obstacles as shown on the participation of previous funds, they are a persistent bunch and that goes to show that sooner or later they will reach their goal . \n", "q1r": 5, "q2": "Last but not least, their overall project is very transparent and well detailed to help in terms of auditability. They also use common tools to show their progress and are bold enough to even present it on youtube. The description of the timeline and their fund allocation seems also to be realistic and clear. \n\nBut don’t forget that this is a multifaceted project and this is just one of their proposals, as all of them are connected. In the end the success of one is dependent on the success of all. \n", "q2r": 5, "assessor": "z_assessor_416", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Impact: Since everything is allright, why only a 4 rating?"}, {"q0": "This is an interesting idea, it is about to create the concept for Phase 2 of  AdaQuest, which is the game of the team as the product of the funded proposal in Fund5. We need to see what AdaQuest is by clicking into the link https://ada-quest.com/ to see the first mode ARENA, to understand how cool it is (playing free without any paywall, being easy and user-friendly, involving the community into the development). Besides, I found this: after successful implementation of the project ARENA since Fund5, this round of Fund, the AdaQuest authors propose 8 proposals (6 proposals for ARENA mode and 2 proposals for Phase 2 of AdaQuest). I think we should read all of them to understand the AdaQuest project as a whole. They are:\nhttps://cardano.ideascale.com/c/idea/404544 (this is the current proposal we are assessing)\nhttps://cardano.ideascale.com/c/idea/405375 (developing a prototype for Phase 2)\nhttps://cardano.ideascale.com/c/idea/404315 (delivering adventures within the game  for PVE players)\nhttps://cardano.ideascale.com/c/idea/403708 (polishing, balancing & testing the game)\nhttps://cardano.ideascale.com/c/idea/405445 (enhancing the graphics of the game: re-design, create and enhance characters)\nhttps://cardano.ideascale.com/c/idea/405317 (marketing strategy)\nhttps://cardano.ideascale.com/c/idea/404938 (hiring the sound designer for AdaQuest and creating a free sound library for Cardano game projects)\nhttps://cardano.ideascale.com/c/idea/404893 (creating a module for socializing and housing in the world of the game)\nI find interesting with the features which will be designed for the concept, I can say it make the game will be so much more interesting, so it will help attracting more users to the game, lead to the mass adoption of the Cardano Community. This proposal not only fits the challenge “Gamers On - Chained” but also add value to the Cardano ecosystem because if it is successful, the project will help to increase: number of users of gaming based applications built on Cardano, number of CNFTs made specifically for gaming, number of fungible tokens made specifically for gaming, which are in the success metrics of the challenge. Additionally, the challenge “Gamers On - Chained” was initiated by the team, so that they are well-known about which proposals will address the challenge, therefore the impact of this proposal should not be a problem.", "q0r": 5, "q1": "The authors provide information in full details for us to assess the proposal’s feasibility, consist of team’s information, detailed plan, marketing strategy, KPIs, target groups, budget breakdown and challenges/risks related to the project’s success. About the team who makes up the project and their partners (freelancers who are they working with), the information is provide very detailed, we have their names, their professional majors, number of experienced years, their roles in the project, their skills and experience related to the project conducting, we also see their social links to get more information about them. Especially they delivered the first mode ARENA successfully and truly great, I think that is the strongest evidence to prove the project is in expert hands. The clearly understandable plan allows us to see what need to be done and what are the goals of each month in a chronological order in term of 2 months. The target groups as well as the interesting marketing strategy are also explained reasonable. Regarding to the financial amount, we can see it is broken down reasonably well into identifiable items: tech advisor, game designer, art direction, illustrator, and lore & quests. Additionally, the team foresees challenges/risks that they may face when conducting the project, and they also gives solutions/ mitigation, helps us underrstand more about the project and raise the trust from readers that the proposal will be implemented successfully. I would like to ask: is there a mistake about the fund resquested $23000 while the total buget breakdown is $22600?", "q1r": 5, "q2": "This part of proposal is provided in a good level of information, consits of roadmap, milestone, time horizon and KPIs, help us easy to understand what will be measured or monitered. The “success looks like” section is explaned very well for us to understand what result would be expected, give us to have the vision of the project. The team also explains that the progress of the project will be upload on well-known tools like like JIRA, Github and Confluence, so it would be easy for tracking public.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Experienced Game Designer, Illustrator & Environment artist waiting in the wings! We bring the skills and YOU the votes! How about that?", "experience": "Game Design\nAlex - 5 years of relevant g-design experience\nhttps://tinyurl.com/yv56r2pf\n\nGraphics & Concepts\nChris - 15 years of finest artworks\nhttps://tinyurl.com/y45vctsw\n\nAnn - 4 years wild art style\nhttps://tinyurl.com/2p8ex8cp\n----\nMore info: https://ada-quest.com/about"}