{"id": 405096, "author": "dao.coders", "title": "A2T: 5th Gen Info War Simulator", "url": "https://cardano.ideascale.com/a/dtd/405096-48088", "category": 26440, "amount": 54000, "description": "5th Generation Information Warfare is being used extensively by countries and other entities but not by decentralization advocates.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3766, "q0": "I was able to understand the main mechanics and operations of the game through the author's introduction. The possible risks about not be funded of the main proposal and the possibility of being censored or shut it down are described in quite detail by the author and given specific measures.\nHowever the project results are quite general, it would be better if the author could mention more detail outcomes which communicated via Town Hall and the DAO-NET & A2T Marketing campaign.It will be easier to determine the impact of the project with challenge.", "q0r": 4, "q1": "There is enough information to judge the feability of the project.\nProposal has a team with a lot of experience in related fields, the necessary positions, both available and not yet available, are also mentioned by the author.\nThe project's roadmap is quite reasonable and divided into 6 sub-sections lasting for 1 month, the workload of each item is also described quite fully. The budget is quite reasonable when dividing the average cost per month by each cost item (Plutus Developer, Game designer, Product Manager)\nHowever, I think the plan will be more detail if the author can write the roadmap for a longer period of time instead of 6 months like now.", "q1r": 5, "q2": "The criteria to determine the success of the project are presented presented in an easy to understand manner. The KPIs to measure the development of the project are also detailed (Total Number of Pull requests in Github, Total Numbers of Github commits and the Total Number of Errors Fixed). And the project will conduct weekly team meetings. However, there is no specific quantitative number for these KPIs. The specific tools that will be used for the community to monitor the project are also not mentioned.\nI think the author can increase the auditability of the proposal by adding the above details.", "q2r": 4, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3795, "q0": "Talking this  impact section into consideration, I believe your team will be able to achieve various votes from the community because of such a detailed description of this proposed solution to the challenge. You manage to predict many drawbacks that your team can get into while implementing the project in the near future, as well as come up with respective workable solutions to cope with. Most importantly, this project is described detailedly with adequate key features and how it operates, too. Yet, to my way of thinking, you should explain more about the positive impacts your platform can bring on the gamers, especially as a useful way to convince them to enter your platform and increase the Cardano adopters. However, one issue appears in this section, the way your solution will handle the challenge. Actually I can’t see any key metrics of your project matching with the requirements of the challenge. You said: “the platform is a blockchain game that has the potential to achieve mass adoption if the prevalence of social media disputes are any indicator of the human desire to engage in information warfare” but this statement is too general without any key metrics to measure. For this reason, I think you should fix this problem by putting information relevant to your missing part.", "q0r": 4, "q1": "From my standpoint, your project was able to lay out a work plan with proper milestones and timeframe. But as usual, for many roadmaps like this, I always suggest you add more information, or rather some typical activities, which serves as the key steps to achieve your goals. Considering your budget breakdown, I don’t think your statistical list is detailed enough since it’s kinda general. I advise you to supplement some extra figures which aim to authenticate the salary to three determined positions, for example, you could explain about their hourly pay rate in some detail. Besides, the full list of your team members really satisfies me because of its clarity, and on top of that, the striking experience of some key positions in their career. The product manager, Dwayne Collard and Lead Developer have seasoned experiences in their job Jude Ben, which are 20 years and 9 years, respectively. This factor tacitly demonstrates that they are qualified for the advance of this project.", "q1r": 4, "q2": "Wow, far beyond my expectation! This project appears to be trustworthy and highly potential since you are able to provide the community with particular tools for tracking. Every measurement tool is associated with each essential data that would be published on, as well. Hence, these tools will help the users to keep an eye on your project without much effort. Above all, your given success criteria is very adequate and close to your milestone. From all of these factors, this project promises to make progress and succeed, from my viewpoint.", "q2r": 5, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4609, "q0": "Since every great war happens due some or other misinformation led by the middlemen, hence this simulator will provide a great experience in understanding the scenario of every community and not take to any quick decision just by relying  on one sided story, the proposal has given reality touch by providing data of conspiracy theorists which opponents will use memes, independent media, encrypted messaging and other tools, so the presented idea helps in learning reality facts before taking any judgements, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed game is definitely not a easy task to achieve even with a expert team since it needs data of ML and AI of neural network which are still in developing process .\nAs some of the team leads have experience of 20 years model can be implemented slowly, as DAO-NET had previously did some of the task which was not completed due to some funding issues, experience of the past can be used as weapon in implementing this project hence with provided experience proposal can be implemented successfully.", "q1r": 3, "q2": "The proposal has failed to explain the marketing strategy of the simulator that will be developed, other than that proposal contains all the data of lead, developers and manager of the program.\nThe proposal even contains excellent timeline of the model and has provided data of budget breaking in good manner, the proposal has even mentioned about providing the software developed as open source , where people will love to use for their personal development ideas ,and documentation license will also be provided for the end users ,hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6105, "q0": "As stated by the proposer, this has a potential to be controversial and it is also for such reasons that decentralisation was made in the form of blockchains-(Warfare Simulator ).\nI believe if there is one game that needs decentralisation , it is this game as that is the only way it can work transparently.That being said, A2T(Alternative to tyranny) has a huge potential to blow up and in turn boost exposure to cardano.\nAnother thing about the game is that it seems to be unique, i am a long time video gamer and it feels fresh.\nI will be giving 5 star.", "q0r": 5, "q1": "There is a detailed timeline for delivering this project and the team show experience both while addressing the potential risks and challenges (I hope A2T gets funded) and with verifiable links.\nThe cost breakdown is detailed enough and it should be noted that it is in cost/month\nI have no complaints.This team is capable of delivering the proposal o success, giving 5 star.", "q1r": 5, "q2": "I am finding it hard to understand the below as a KPI :\n\"Development progress will be tracked using an agile methodology and weekly team meetings. Specific quantitative indicators to be tracked will be Total Number of Pull requests in Github, Total Numbers of Github commits and the Total Number of Errors Fixed\" - as a programmer for 10 years (IOS :   https://apps.apple.com/us/app/id1488600103\nAndroid :  https://play.google.com/store/apps/details?id=com.sourcecard.whotfire), i do not see this as KPI's but just development tracking especially for a game.I will recommend looking at the provided KPI's by these funded proposals (https://drive.google.com/file/d/193GZulHuk0zhpTrMiLhcNC4OeEMoRyIa/view).\nconsidering the above issue i am giving a 3 star because with the provided information, it is very difficult to follow progress and audit the proposal.\nI will also advice the team to keep every proposal independent of the other or focus on prerequisite projects that can break your planning due to dependency .", "q2r": 3, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6232, "q0": "The team is proposing to create an info war simulator game on the Cardano network. This will not only be entertaining but educational as well. According to statistics done by Qutee survey, games can inspire people for their future career whether its in science, art, history etc. There is no doubt that it can influence our perceptions and decisions consciously or subconsciously. Therefore, it can be a tool for spreading awareness and information directly or indirectly to the masses in an entertaining way. The content of using memes as a means to counter disinformation is a brilliant content as it can attract more users not only just to play the game but also as a spectator for its funny content. It has a potential to be in the esports arena at par with the biggest game. In conclusion, this proposal effectively addresses the challenge.  ", "q0r": 5, "q1": "The proposing team behind the project are veteran community advisor and plutus pioneers with experience and skills in software development which shows they are capable of delivering this project. Moreover, the proposer provided with a clear and realistic timeframe that shows what is being done during the duration. The budget presented are also straight forward and the requested funds are reasonable. This proposal also identifies the required manpower and resources needed to successfully implement the project. They are currently negotiating with a game designer to bring them onboard the team. The team members acknowledge the possible risks and challenges when implementing the plan which is the risks of being shut down by the authorities due to its controversial nature but they are confident with the decentralization infrastructure that makes the game censor proof and the risks of getting shut down can be mitigated. Therefore, in my opinion, this proposal is highly likely to be implemented.", "q1r": 5, "q2": "There is a clear plan on how to execute the proposal. The proposal also states that the community can keep track of the progress of their work thru github pull requests. The KPI and success metrics are clearly defined and easy to understand. Therefore, with the provided information, it is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A 5th Generation Information Warfare A2T module that tests decentralized strategies to spread ideas despite censorship and misinformation.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals."}