{"id": 405267, "author": "revelar", "title": "Duo - German Gameplay", "url": "https://cardano.ideascale.com/a/dtd/405267-48088", "category": 26440, "amount": 4750, "description": "NFT based play-to-earn games often focus on natively English-speaking cultures, which diminishes the possibility of a rich global community.", "funded": 2, "upvotes": 50103735, "downvotes": 5617461, "votes_result": 44486274, "votes_cast": 157, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 1215, "q0": "The proposal’s goal is to bring people with different linguistic and cultural backgrounds closer to the Cardano world by collaborating on the translation of a play-to-earn NFT card game. This is generally a good idea and it will benefit the community by bringing together gamers, interested to have some fun in a card playing game in their own language and simultaneously increasing their awareness towards Cardano as the go to blockchain for gaming. The proposal clearly identifies that gamers are ready to enter the crypto world and aims to make a simple card game enjoyable to the wider gamer centric user base by solving the problem of linguistic and cultural barriers. The proposal explains that by removing these barriers the Duo game can be a door opener for new players, which will ultimately add value to the Cardano ecosystem. The goals of the proposal are clearly inline with the outlined challenge settings by developing a Cardano based NFT game and wanting to increase brand awareness by closing linguistic and cultural gaps by collaborating with multiple native speakers from different nationalities. Considering the background and accumulated experience of the individual team members, the fact that the Revelar team is not new to the Catalyst Project and has already had previous proposals funded in the previous funds, as well as the active discord community providing valuable feedback on new updates of the project, it is evident that the team is up for the challenge and the proposal is scalable for future challenges. Something small, that is missing in this proposal is that in the mentioned challenges the team might face, point 4 “Product fit” abruptly ends in the middle of a sentence. Kind suggestion to the team is to complete this point as well, so that the message can come fully across to the readers/CA/voters.\nAll of the above-mentioned lead to me to believe (as a passionate card gamer myself) in the impact of the proposal.\nScore 5.", "q0r": 5, "q1": "Based on the LinkedIn profiles and the shared relevant background information in each individual field the author of the proposal and the gathered team of experts seem to have the necessary knowledge for a successful proposal implementation. In addition, important feedback and insights can be gathered and analysed from the discord community, which will allow the team of developers to further identify potential improvement possibilities to their proposal. What I am somewhat worried about is the budget breakdown. Despite the small requested budget compared to the total budget set for the challenge, I would have really wished to see a deeper explanation on to how the costs for each segment of the budget are calculated, so I can get a more tangible understanding on where these money will go. My suggestion to the proposers is to provide more clarity at least on the highest two parts of the planned/requested budget – translation services and marketing e.g. hourly or daily pay out rates to translators, type of marketing to be used and target group, etc. This way voters will get more hands-on understanding on costs spent and be more likely driven to upvote this proposal. The next thing I am not entirely sure about is the timetable for completing the work. The milestones they want to achieve are understandable and reasonable, although feeling vague. In addition, generally, ambitious targets are always good, but we must keep our focus on the feasibility of the proposal. My kind suggestion to the proposal members is to re-evaluate, if the short timings are enough to find the proper contacts, train them and do all needed linguistic and cultural cross-checks. Despite the experience of the team and previous goodwill, the vague budget explanation as well as the less realistic timetable do not provide at this stage a sensible action plan for implementation.\n\nScore 3", "q1r": 3, "q2": "Good information provided concerning project traceability and progress check via the discord community and the Revelar platform. The team has proven background of transparency and audit possibilities via the two information platforms to check the development progress. Going on to both platforms I could see active users, quick responses and exchange of opinions, as well as quite important – good vibes and having fun. \nThe provided metrics and KPIs are easy to relate to how the increasing number of active users will lead to the broader implementation of the project, benefiting the Cardano community. This gives me and will probably give the voters a clear overview of what the specific goals in numbers are looking like. The description of the problem and the provided solutions are quite clear as well as understandable and they aim to do good to the community by increasing Cardano brand awareness combined with having fun via this CNFT based card game. \nOverall, I do believe the voters have good channels for audit and progress development of this proposal. I wish the team good luck and hope this proposal gets funded!\nScore 5", "q2r": 5, "assessor": "z_assessor_1316", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Very well written review thank you to the reviewer!\n\nFeasability: We had a tough time writing the budget in any more detail than a high level estimate. We figured the cost of having a less detailed budget was the amount of funding we could request, that is why we made the budget smaller. We will definitely look towards updating with more information as the project progresses"}, {"id": 1657, "q0": "They have a pre-alpha version of their game already being tested and played by their community on Discord. This proposal aims to translate the game into other languages which solves the problem of getting more gamers on the Cardano blockchain. Getting more gamers to play their game, they will automatically ad value to the Cardano ecosystem as these gamers will have to familiarize themselves with Cardano wallets, do transactions and if successful create conversation amongst these gamers and their communities about the user experience on the Cardano blockchain. Onboarding new users to their game aligns with the Challenge settings' metrics of increasing users of gaming based applications built on Cardano. Including all these new languages and cultures into their game enables them to scale to a global level and solves the challenge of inclusivity.", "q0r": 5, "q1": "The team already has a pre-alpha version being tested and used. They have proven being capable of building and delivering this. One thing this proposal is lacking though, is more detail on the translators they will use. It is not clear if they already have a translator in mind and no evidence of the translator's work has been provided. This proposal is specifically written to translate their product into German. Showing the community the work your translator has done will increase confidence in the success of this proposal. The budget breakdown they provided seems reasonable and capable of achieving set goals. The time allocated to the specific tasks seems realistic and achievable. The gameplay of  their product is quite simple and translating this should be simple as well. What is being done is simple and clear, but there isn't much detail provided on how the translations will be done except for the fact that they will take into account how humor differs across cultures, meaning that a joke in English may not be funny at all in another language. Taking these into account shows that it wont just be direct translations, but that they actually cater for the  culture of the  community as well. They don't mention anywhere who will be responsible for the tasks in the  budget breakdown. It's good to know that these tasks have to be completed to achieve the main task and it would drive even more trust if the community knew that you already have a team in mind to execute these tasks. They have considered a few valid challenges/risks and the way they mitigate them shows that they are considerate to their users as well as to the project itself. Keeping the gameplay simple certainly helps in a lot of aspects.", "q1r": 4, "q2": "A clear indication is given one how many members they target to onboard and makes it easy to measure the performance of this project. No indication is given specifically on when they will start and when they intend to deliver. It is stated how long it will take to deliver, but it would help a lot if they could dedicate specific dates to the tasks. They have provided gitbooks of their previous funded proposals showing constant updates on the progress of the proposals. They invite the  community to visit these gitbooks to track the progress of all their projects. This makes it extremely easy to track their work and they will do the  same for this proposal if funded. The problem of onboarding different cultures and  languages onto Cardano and their product is clear and  they solve this by not only translating their product, but also taking into account the culture of the language, which in turn will make the product feel more native to the  end user.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1925, "q0": "The proposal is thematically well aligned with the Challenge. It is a new proposal, but builds on an already existing successful project. The game Duo by Revelar, which is integrated into the Cardano ecosystem, is now to be translated into other languages, here into German. Language translations increase the player community worldwide, which will have an immense effect on Cardano. The team attaches great importance to an exact translation in order to guarantee an optimal game experience. Players from German-speaking countries should be introduced to the Cadarno Blockchain. By means of NFTs, a play-to-earn experience is to be created. Risks are not disregarded and are considered realistically. Approaches to solutions will be provided.", "q0r": 5, "q1": "The team has chosen a manageable time frame for this task. Since it is an extension of already existing structures, it seems realistic to carry it out. The requested budget seems appropriate. Overall, the team members have good references and have proven their competence in the past.", "q1r": 5, "q2": "The team is committed to transparency and invites you to follow the project, the development phases and achievements on their website https://www.getduo.gg/ and their Discord channel. An email address is also provided, inviting people to contact them and ask questions. All information, including that on previous projects, is neatly catalogued.", "q2r": 5, "assessor": "z_assessor_1433", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5977, "q0": "This proposal’s goal is to translate the Duo’s first deck form English to German. Duo, as a card game, could be quite easily translated to other games since the content is sizable, limited and well known. With this, the reach and therefore impact of the game would be increased to other communities, specially the German community. This is a quite simple proposal, which aims at expand the impact of an already existing game. This is aligned with the challenge’s goals since it would increase the reach of the game and onboard new gamers that otherwise couldn’t be comfortable with entering this world. All the mapped risks make sense - since this is a joke based game, it’s not guaranteed that it would work in different languages because of many linguistic and cultural reasons, but it’s expected that the majority of the jokes would still work. To lower the impact of such a thing, it would be interesting to also include the original version in English, so some curious players could look for the right meaning, if they don’t understanding already in English. This team is proposing similar proposals to other languages, and for German I believe the impact might not be the biggest out there, since most people in Germany (at least gamers) speaks English already, but it’s still valuable, specially based on the low budget asked here. [For QA: part of this assessment is similar to the assessment of their other translation proposals.]", "q0r": 4, "q1": "The presented roadmap seems to be feasible for the execution of the plan, and it makes sense according to what was proposed to be developed. The budget is also well explained, but it looks quite low and seems to be short, but the team must have done some research to come up with these numbers, therefore they are probably enough to deliver the content. The proposing team from Revelar is well experienced in game development and they are known in the community. Although, the translator themselves are yet to be found, what adds a small uncertainty to the execution, but what shouldn’t represent any high risks to the timeline presented. [For QA: part of this assessment is similar to the assessment of their other translation proposals.]", "q1r": 4, "q2": "The Revelar team keeps track of the development of their Catalyst funded proposals in a dedicated webpage, which is very good for auditability and easy to track. The success of the proposal is well described and there are KPIs to track it’s success after launch based on the number of new players from this new community. To make it better, I would also include some KPIs related to the sale of the translated NFTs, at least. At stated, this is not a continuation of a funded proposal, but it is attached to another ‘main’ proposal submitted in Catalyst in this same fund. It would be good to have better explained the relation between theses proposals, is this somehow depends on the main one getting funded or not. [For QA: part of this assessment is similar to the assessment of their other translation proposals.]", "q2r": 4, "assessor": "z_assessor_31", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Impact: The reviewer provides well written comment however the deduction in stars seems to stem from the reviewer's opinion that most Germans speak English. While this may be true, that is not in line with the spirit in which this proposal was crafted.\n\nAuditability: We didn't think to connect together the language proposals in the continuation section however we can see that it may benefit the context so we will update that going forward.\n"}, {"id": 6108, "q0": "Localisation and internationalising a game has great benefits of reach to a much wider audience as the whole world all don't speak english.\nThis proposal will really benefit the cardano CNFT ecosystem as they already have a working discord community which is obviously global.\nI would have loved to hear about what is in the works to help mitigate the problem of buying the Duo card from exchanges as this seem to also be a problem for beginners in the crypto world as they most likely wouldn't want to maintain a yoroi wallet etc.\nin the aspect of impact to the cardano CNFT and On-chained gaming i am giving 5 stars.", "q0r": 5, "q1": "The proposal was provided with links both youtube , website and linkedin links for all the members of the team and they do have a solid team.\nThe cost breakdown was detailed enough highlighting where and what the funds will be used for.\nI like the fact that the proposer offered some possible solutions to the potential risks and challenges presented but i will like to add that simplifying the card purchase especially using crypto exchanges like coinbase (as shown in your tutorial video) should be included as potential challenges as it will help to encourage quick adoption of the game .It is good that the rules of the game is simple to follow which i like as a game developer(I have been developing games for over 10 years).\nI will be giving a 5 star as i believe this team can deliver the project and also have a shown a proven track record.", "q1r": 5, "q2": "The proposal contains every necessary information to audit its progress .\nCost breakdown are detailed, there are very clear timelines and milestones.\nI will be giving 5 star for clarity and audibility.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Partner with native speakers of a different language and culture to expand gameplay reach to reach more people.", "experience": "The Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds. We have a growing team of experienced software architects & engineers from around the world, Plutus Pioneers, & startup experience to manage a bootstrapped project."}