{"id": 405261, "author": "revelar", "title": "Duo - Spanish Gameplay", "url": "https://cardano.ideascale.com/a/dtd/405261-48088", "category": 26440, "amount": 4750, "description": "NFT based play-to-earn games often focus on natively English-speaking cultures, which diminishes the possibility of a rich global community.", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a new proposal, this proposal complements the game Duo by Revelar which is included in the Cardano ecosystem and was chosen in F7. The game will now be made available to the Spanish player community. As Spanish is one of the most spoken languages in the world, the expected impact will be extremely important for the Cardano ecosystem. The team is committed to providing an accurate translation to ensure the best possible gameplay experience. People from the Spanish-speaking world should be familiarised with the technical possibilities of the Cardano Blockchain in a playful way. Risks are conveyed realistically and appropriate solutions are provided.", "q0r": 5, "q1": "The team plans a fairly short time frame for the project, which is clearly listed and easy to follow. The team members have the necessary professional skills to lead the project to success. The requested budget is not set too high and is appropriate to the expected added value for Cardano.", "q1r": 5, "q2": "Traceability is guaranteed by offering personal contact via email. Furthermore, the individual steps and results of the work can be followed transparently on the website. The entire project with all stages is also neatly listed in a separate Catalyst area.", "q2r": 5, "assessor": "z_assessor_1433", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The main features of the project are detailed to make it easier for the reader to understand the operation of the project. The result of the proposal is also clearly shown, which is to support players to cross language boundaries to access the Cardano ecosystem. The four main risks of the project are also analyzed and specific solutions are given for each risk.\nHowever, I think the author can add persuasiveness to the impact of the project by adding quantitative KPIs to the description of the project's results.", "q0r": 4, "q1": "Co-Founder members, CTO and founder of the project all have a lot of experience in the field related to the project, information about work experience, outstanding achievements and attached profiles on social sites such as: LinkedIn, Discord, Twitter. As a result, readers can more easily assess the feasibility of the project.\nThe roadmap of the project is also presented quite detailed and divided into 4 small sprints, each sprint lasts from 2 to 4 weeks.\nThe budget section is quite reasonable however I think the author needs to describe in more detail where the cost of each of these subsections is by adding the number of hours completed as well as the hourly unit price of each item so the reader can compare and assess proposal easier.\nBased on the above factors, I believe that the project will be completed as planned.", "q1r": 4, "q2": "I believe that with the information presented in the audit section, the community will have enough information to evaluate and monitor the progress of the project.\nThe community can track progress in real-time until the final reports via the project's website https://catalyst.revelar.co.\nThe author also describes the success of the project in detail, including specific quantitative KPIs according to the timelines from 3 months, 6 months, 9-12 months.", "q2r": 5, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Feasibility: Determining a detailed budget for this one was tough, we're not entirely sure how many hours to allocate. So that is why we decided to make the requested budget so small."}, {"q0": "This project is quite align to the criteria that need to be met in our challenge setting. First of all, you already have a game with a steady stream of players, so having more versions in different languages ​​will definitely help on-chain a lot of gamers. However, we will need to know more about the features and tournaments that will be available on the occasion of this new release. You need to give specific numbers so that we have more confidence that this project will help the Cardano ecosystem grow clearly. For example, you can talk about growth rate, number of users, deposit and withdrawal rates, etc. The second point is that you have made a detailed prediction of problems and solutions. But since this is a game project, we will need you to talk more about the possible technical problems and how you will solve it.", "q0r": 3, "q1": "This proposal already has a broad idea of what should be accomplished, but we'll need you to be more detailed about how you intend to perform it. For example, what tools would you use to find people in the phase of searching for and cooperating with translators? What skills does the Translator have that would be useful for this project? How many translators will you require? What are the key performance indicators (KPIs) to ensure the project stays on track? Do you guys put it through testing before publishing the official version? What is your marketing strategy? What marketing channels will be used? What factors influenced your decision to use those channels (please supply relevant metrics or reports)? In the suggested budget section, we'll need you to break it down and be more specific about how you plan to use it. For example, for the use of translation services, how many people do you plan to pay? How many hours a day will translators have to work? How many days a week? Other costs should also be suggested in a similar way. The introduction of your team members is quite clear and detailed. We highly appreciate that you have clearly stated that the skills and experience of the members will be suitable for the project. In addition, you have also provided social media accounts for us to easily verify members. Is this, however, the case for all of your team members? Do you think you'll need to recruit more people? If so, how many more employees do you intend to hire? How will you manage them? Please offer additional information to ensure this project's feasibility.", "q1r": 3, "q2": "Congratulations to the team for establishing a website for reporting and publicizing project progress. Through this website, we can also know more about previous projects you have worked on, thereby increasing the auditability rate of this proposal. However, because this is a new project, I recommend that you offer specific metrics so that we can track its progress. For example the number of words or pages translated per day, the number of players in the target language that are interested in the project, thereby giving possible impact on the Cardano ecosystem or ADA usage. The successful part of the project has been made very clear by the predictions of the newly joined gamers, I believe this project will have a high probability to go further in the future and make a positive contribution to the NFT based play-to-earn games.", "q2r": 4, "assessor": "z_assessor_1726", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for the super review! There are really a number of excellent points that will allow us to expand on future proposals!"}, {"q0": "This proposal’s goal is to translate the Duo’s first deck form English to Spanish. Duo, as a card game, could be quite easily translated to other games since the content is sizable, limited and well known. With this, the reach and therefore impact of the game would be increased to other communities, specially the Spanish speaking community. This is a quite simple proposal, which aims at expand the impact of an already existing game. This is aligned with the challenge’s goals since it would increase the reach of the game and onboard new gamers that otherwise couldn’t be comfortable with entering this world. All the mapped risks make sense - since this is a joke based game, it’s not guaranteed that it would work in different languages because of many linguistic and cultural reasons, but it’s expected that the majority of the jokes would still work. To lower the impact of such a thing, it would be interesting to also include the original version in English, so some curious players could look for the right meaning, if they don’t understanding already in English. This team is proposing similar proposals to other languages, and for Spanish I believe the impact is going to be huge and probably the biggest between the submitted proposals, since there are many Spanish speaking countries, specially in Latin America. [For QA: part of this assessment is similar to the assessment of their other translation proposals.]", "q0r": 5, "q1": "The presented roadmap seems to be feasible for the execution of the plan, and it makes sense according to what was proposed to be developed. The budget is also well explained, but it looks quite low and seems to be short, but the team must have done some research to come up with these numbers, therefore they are probably enough to deliver the content. The proposing team from Revelar is well experienced in game development and they are known in the community. Although, the translator themselves are yet to be found, what adds a small uncertainty to the execution, but what shouldn’t represent any high risks to the timeline presented. [For QA: part of this assessment is similar to the assessment of their other translation proposals.]", "q1r": 4, "q2": "The Revelar team keeps track of the development of their Catalyst funded proposals in a dedicated webpage, which is very good for auditability and easy to track. The success of the proposal is well described and there are KPIs to track it’s success after launch based on the number of new players from this new community. To make it better, I would also include some KPIs related to the sale of the translated NFTs, at least. At stated, this is not a continuation of a funded proposal, but it is attached to another ‘main’ proposal submitted in Catalyst in this same fund. It would be good to have better explained the relation between theses proposals, is this somehow depends on the main one getting funded or not. [For QA: part of this assessment is similar to the assessment of their other translation proposals.]", "q2r": 4, "assessor": "z_assessor_31", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Partner with native speakers of a different language and culture to expand gameplay reach to reach more people.", "experience": "The Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds. We have a growing team of experienced software architects & engineers from around the world, Plutus Pioneers, & startup experience to manage a bootstrapped project."}