{"id": 405225, "author": "revelar", "title": "No-code NFT minting - Revelar", "url": "https://cardano.ideascale.com/a/dtd/405225-48088", "category": 26440, "amount": 36000, "description": "The process for creating generative NFTs is complex and hard for artists who want to create NFTs for games without an expensive developer.", "funded": 2, "upvotes": 84209462, "downvotes": 11073296, "votes_result": 73136166, "votes_cast": 462, "f6_no_assessments": 9, "f6_rating": 4.740740740740741, "videos": [], "media": [], "f6_assessments": [{"id": 5, "q0": "The proposal meets the challenge setting.  By provided a no-code, GUI based experience for minting gaming assets, it will accelerate development for gaming on Cardano. As an NFT artist, without much blockchain technical experience, this approach will take the complexities of minting with a CLI out of the picture. One point I feel the proposer could elaborate more on, is how minting gaming assets is much different than minting jpegs. Other NFT services exist on Cardano, such as Tokhun.io, NFT Maker, and JPEG store, none of which have a GUI based builder approach like the one demoed in the video. Honestly ,it looks very nice just from the demo. Good work. If successful this application should increase the nunber of games on Cardano, the number of users, and the total value of CNFTs on Cardano by opening up the space to artists, who may or may not be blockchain professionals. ", "q0r": 5, "q1": "The funds requested, and hours provided are justified to deliver the project as described. The dollar amount proposed to be paid to a senior developer are comparable to market prices in the U.S. The proposer gives summary descriptions of the proposed development path with the use of sprints. The sprints are broken out into reasonable time frames, with just one sprint on the UI/UX, as the team already has a demo project, as shown in their YoutTube video. I work for a local municipality in Information Technology (Specifically GIS), and I have had to work with several application development companies, and have seen the time and effort that is required for development. The time and effort as described are reasonable. \n\nAdditionally, the resumes provided for the team members are excellent. Thank you for providing detailed information on who the project is in command of, and how their qualifications and experiences can give the voters ease of mind that the funds, if awarded, will be put to capable hands. \n\nLastly, in terms of giving the voters a more informed view into the project, it might be beneficial to provide some information on Revelar's API. Perhaps a link to what services the API offers the DUO team in regards to this project. ", "q1r": 5, "q2": "The project might be a gold standard in regards to auditability. The use of a website to specifically provide written and video updates every two sprints with demos is excellent! If awarded, its up to the community to hold the team accountable for the their promised communications. However the team is very transparent and well organized so there is little reason to have this caution. Additionally, I think they put a \"cherry on top\" when they promised to provide an attribute in the meta data for all of the CNFTs minted by the product to allow for tracking of assets. This will allow for tracible proof of the effectiveness of the project, and to hold it to the goals as set out for the year. 50 projects in the first 3 months post version one, seems a little high, as that would require onboarding a project every two days. However, I do not have direct experience in working with the CNFT ecosystem as a gaming company or minting service, such as Revelar and the Duo team, so this may be a realistic target. None the less, if they achieve their goal, it will bring great value to the Cardano gaming ecosystem. ", "q2r": 5, "assessor": "z_assessor_1003", "no_vca": 18, "ne": 14, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1903, "q0": "This project proposes to create a web app to assist in generating procedural NFTs. The proposer explains that this would be useful for teams to jumpstart the development of their gaming projects before hiring developers. While this could be true, this tool has a broader appeal to non game related projects as well, especially since most game teams will require having someone who can code. While I see it as a very useful project in general, in terms of this challenge I am unsure if it will have a significant impact on the number of gaming projects on Cardano", "q0r": 3, "q1": "The project team consists of some very experienced and technically skilled members, and the requested funds will be used to hire a frontend developer. The breakdown and scope of the work and requested budget seems reasonable enough. It's might be also worth noting that this proposal was approved in Fund 7 but missed out on funding. ", "q1r": 5, "q2": "The proposer sets out a process of how they will provide reports on their progress as well as a set of key metrics; The metrics indicate success for this project as the number of assets and unique projects that are created via the app, but it would be more relevant to the challenge if they measured the number of assets that were actually used in a successfully shipped game.", "q2r": 4, "assessor": "z_assessor_142", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3234, "q0": "The proposal is well aligned to the challenge. It reveals that creating generative NFTs is complex and hard for artists who want to create NFTs for games without an expensive developer. Therefore, bring gaming-specific tooling for artists and developer is reasonable to make a great impact in the NFT artists and developers’ world. Revelar seeks that cardano game developers leverage on their effort and findings to save time and resources developing NFT for games. The proposals is intending to bring about local and global impact especially in Cardano artists and developers world. The proposal is highly scalable. ", "q0r": 5, "q1": "The information provided in the proposal reveals that Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds, their team experience is growing horizontally and vertically. The Team’s credibility, contribution and strength is sufficient for the kind of work. The proposal defines clearly the methods, approaches and activities to be done and they seem reasonable. The budget is defined and well explained. The risks taken into consideration. The outcome/impact expected from a successful implementation of this project is surpasses the expected risk and cost of funding this proposal", "q1r": 5, "q2": "A dedicated Revelar domain https://catalyst.revelar.co will be provided to track real-time progress of the proposed activities. The KIPs, roadmap and milestone are well defined and measurable. The delivery dates are clearly defined.", "q2r": 5, "assessor": "z_assessor_1629", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3595, "q0": "From my first glance at the project, I could realize its necessity to the entire Cardano-based gaming scene. Since it offers a web app that contains features to potentially lessen the lengthy and complicated process of creating NFTs, all developers have to do is dragging and dropping the elements to form the final files for minting. And yes, this aims towards those who are looking to cut down some of their budget spendings and embark on an easy and convenient NFTs minting process, which I believe aligns closely to the main objective of this challenge by drawing in more NFTs developers in the process. The team has also managed to put forward 3 main issues that the project could face in the foreseeable future, followed by what I consider to be 3 highly viable resolutions for them, and the team further reassures me by including extra help in the proposal as well. The only flaw to me, perhaps, is the missing of core metrics to measure the initial success of this project, for example, an estimated number of a user base or an approximation of NFTs minted on this platform.", "q0r": 4, "q1": "This is another one of the few projects that I’ve seen utilizing sprints instead of quarters or months, and based on what they hope to deliver at the end of each sprint, I have high hopes that this project will very likely be met with success. I’m excited to see that the requested budget is for covering the expenses of hiring Frontend Developers only and the Cloud infrastructure will be handled by the team themselves, and the total number seems quite reasonable as well. The team members listed all include their background, expertise and achievements, along with respective LinkedIn profiles to further verify their capabilities. ", "q1r": 5, "q2": "In regard to this criteria, I believe through the utilization of a dedicated domain that enables public access and Catalyst Coordinator reports that contain all necessary elements to track the progress, the team has managed to gain a firm extent of clarity. And to visualize future success, the team uses core metrics, close to the ones in the challenge setting, to measure, and the figures representing those metrics are quite credible as well.", "q2r": 5, "assessor": "z_assessor_1664", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3768, "q0": "The result of this project is helping game artists and developers learn the Cardano blockchain a simple way to generate, mint, and sell their assets, increasing the variety of games earlier and at a lower cost, contributing to make Cardano becomes the go to blockchain to develop gaming applications. So I think it will align well with challenge.\nBesides, the description of the project's features is also quite detailed and easy to understand. The main risks about death by success, subjective budgeting, software delays are also carefully analyzed and reasonable solutions are proposed.\nHowever, I think the proposal will be more complete if the author can add key metrics to measure so that readers can more easily assess the project's impact.", "q0r": 4, "q1": "From the information provided in this section, I believe the project will meet the outline.\nRoadmaps are planned in detail every two weeks for 3 months, a total of 6 milestones. The tasks in each milestone are also presented easy understanding.\nReasonable budget and sufficient information on total hours completed, workload.\nIn addition, team members have a lot of experience and are described in detail including work experience, attached resume as well as outstanding achievements.\nThe above makes it easier for the reader to assess the feasibility of the project", "q1r": 5, "q2": "The project's auditability information is well described and informative.\nThe criteria to determine the success of the project are described specifically and there are quantitative KPIs corresponding to the 3-month, 6-month, and 12-month timeline.\nIn addition, the proposal also allows the community to track the progress of the project every two weeks on the dedicated project website or track the project progress in real time until they do final reports and closeouts for each proposal.", "q2r": 5, "assessor": "z_assessor_1674", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5351, "q0": "The recent technological developments of Cardano’s infrastructure have led to a sudden spike in CNFTs and P2E games. With continuous advancements, it can be expected that more and more gamers and consequently game developers will be attracted to Cardano. The proposal outlines the initial difficulty of a game development team to raise funds and make themselves familiar with the Cardano protocol. With their No-code NFT minting software, the team wants to enable game developers an easy access into the CNFT ecosystem and allow them to raise funds early on that will make further game developments possible. \n\nImportantly, the proposal highlights several challenges and potential solutions. The solutions indicated in the proposal indicate the team’s determination, their creativity (e.g. launchpad application) and their strategic planning. \n\nOverall, the proposal clearly addresses the challenge, and if successful, will lower entry costs into the Cardano game ecosystem, will increase the game variety and will help developers build their communities much faster.\n", "q0r": 5, "q1": "Altogether, the team has experience in different fields including mathematics, software development, engineering, entrepreneurship, and marketing. Two out of the three members have also participated in the Plutus Pioneer programme, indicating a solid understanding of Cardano’s protocol infrastructure and technical programming knowledge. \n\nThe team is requesting funds for one Frontend Developer for 3 months. The requested budget of 36k USD for one developer is high but reasonable, as good developers generally come at a price. However, it is not clear to me whether this developer will be hired or is already part of the team and if so what experiences he/she has. Furthermore, speaking from experience, the three months time frame might be tight for one developer. Sickness or other uncertainties might arise, that could affect the developer’s performance and time available. \nNevertheless, given the team’s background and their combined experiences, I am confident that the team can find solutions along the way and implement the proposal successfully.", "q1r": 4, "q2": "Since the code won’t be open source to begin with, the team has set up a dedicated website where they provide real-time progress and final developmental reports. Based on reports of previous proposals, the structure and way of reporting is clear and transparent to me. This will enable anyone to keep track of updates and audit the progress of the project. \n\nTo measure the success of this proposal, the team has specified following indicators: number of projects and assets minted after 3, 6 and 12 months, respectively. These KPIs will be included as metadata element in the JSON file, therefore visible to anyone. This is a fair and transparent way to audit the success of this proposal. Altogether, the team provides precise milestones and clear success metrics in a transparent way, making it possible for anyone to audit the progress and success.\n", "q2r": 5, "assessor": "z_assessor_1939", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5975, "q0": "The proposing team promises to develop a web-based application to allow anyone to create NFTs to game applications. It was not clear to me if these NFTs are going to be only generative - as mentioned in the problem statement - or any kinds of NFTs, as it seems based on the other parts of the proposal. Since it mentions the creation of attributes, which are probably going to be stored as metadata, this fits well the Gamers On-Chained challenge, since it’s a tool that can be used by other games as well. This application could definitely help small projects on creating their first NFTs, at least. The functionalities presented here are good enough for a first version of this applications. The risks mapped  makes sense, and the proposed solutions might work out well if these risks become problems in the future. Overall, this is a very good idea that fit’s the challenge very well, since it helps to increase the total number of games being built on Cardano and number of CNFTs for gaming, at least.", "q0r": 5, "q1": "The presented roadmap is clear and the milestones are well identified. There seems to be a bit of over budgeting in the planning, since sprint 6 should be very quick after sprints 4 and 5, but as mentioned in the risk section, chances are this will take longer than expected, and in this case these costs should be covered. The monthly salary for the front end developer is quite high ($12k/month), but depending on where the team is based, it might be a senior dev standard salary. The lead team seems to be experienced enough to be able to execute the proposal and deliver it without much trouble. For me, this proposal is feasible.", "q1r": 4, "q2": "The ways to evaluate the auditability of this proposal are clear. Since it’s not an open source project, it’s not possible to have access to the code itself, but progress will be checked in Catalyst Coordinator meetings and in the monthly reports as well, besides the demos provided every time a milestone is reached. The key metrics to track success are very appropriate and might be enough to evaluate its adoption and success. The goals for 3, 6 and 12 months are too optimistic, in my opinion, and I don’t think they will be achieved in the timeline presented, especially because no marketing plan was presented. But even if numbers are lower, I would consider this project as success. At last, based on their website for proposal tracking and and the updates presented there, I believe auditing this proposal won’t be difficult.", "q2r": 5, "assessor": "z_assessor_31", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6106, "q0": "I have reviewed this proposal in the past and it missed out on funding in fund 7.\nThe proposal clearly states its objective of creating a web platform for artist to upload Layers for minting without using code.\nThis proposal checks out on all this challenge requirements .\nI would like to know if the uploaded layers are stored or discarded by the platform after minting the NFT.\nI am giving 5 star.\n", "q0r": 5, "q1": "The team are composed of developers with verifiable link of expertise.The cost breakdown is very detailed showing down to cost per hour.\nThe proposer shows understanding of the challenge from the challenges/risks provided and potential solutions.\nThere is a clear timeline of 12 weeks and a good breakdown of the execution.\nkudos to the team.\n5 star.\nOverall, the proposal shows the team are capable delivering this proposal to completion.", "q1r": 5, "q2": "The provided KPI's are good with very clear timelines.\nThough the reporting of this project will be through Catalyst Coordinator reports but it fulfils the IOG funding criteria so overall the proposal can be audited. A weblink to track other projects were also provided to support audibility (https://catalyst.revelar.co).\nI hope you get funded this time, good luck\n5 star.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8968, "q0": "The idea is very interesting, it it about building a website app in which artists can find easily to use the Revelar to create games without writing codes. As the authors explain, Revelar is the first NFT Game Engine on Cardano which is building by the team. The authors also explain what will be included in the website, that make us have a vision of the product in general. (I found they have 5 funded proposals in Fund7 within 3 challenges from the link they provides and this is the proposal which was proposed but missed out. If we read all of them, we can understand deeper about the work of this project). In my opinion, it is within the challenge because if it is successful, the project will help to increase: “number of users of gaming based applications built on Cardano, mumber of gaming based applications building/built on Cardano, number of CNFTs made specifically for gaming, number of fungible tokens made specifically for gaming, and number of gaming based content creators that have come to Cardano”. All of them are the Key metrics of the challenge, therefore, I strong agree the poject is impactful.", "q0r": 5, "q1": "The authors provide information in full details for us to believe it is fully feasible. About the team who makes up the project, we have their names, their professional majors, number of experienced years, their skills and experience related to the project conducting, we also see their social links to get more information about them. Especially they have several funded proposals in Fund7 related to this project, I think that is the strongest evidence to prove the project is in expert hands. Moreover, they also have partnership with a contracted dev shop in case they have engineering overflow needs (with reference about partnership included). The financial amount is fair and reasonable, as I see it is quite simple with the front-end developer cost only (Cloud infrastructure cost is covered by themselves). Roadmap and milestones are describes in a succinct and clear way, help us understand what activities need to do in the timeline of 12 weeks with 6 full sprints. Additionally, the team foresees 3 main risks and gives solutions to mitigate them, helps us underrstand more about the project and raise the trust from readers that the proposal will be implemented successfully.", "q1r": 5, "q2": "This part of proposal is provided in a good level of information, help us easy to understand what success looks like with 3 key mertrics over a period of 3 months, 6 months and 12 months. KPIs has been shown with the exact number as expected, make the community easy to see the goals which need to be tracked. The team also explains that the monitoring will be Catalyst Coordinator reports with a recorded video and a written version of the updates on dedicated site (the link is included) after each sprint, moreover, the community can audit success of the project after the team include automatically a metadata element in the JSON (JavaScript Object Notation) exported before minting. All of them make the proposal is fully auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Create an easy web app for any artist to upload their art layers, choose rarity algorithms & export all final assets ready to mint as NFTs.", "experience": "The Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds. We have a growing team of experienced software architects & engineers from around the world, Plutus Pioneers, & startup experience to manage a bootstrapped project."}