{"id": 405445, "author": "quest.zwerg", "title": "AdaQuest ENHANCED ARENA Visual Mode", "url": "https://cardano.ideascale.com/a/dtd/405445-48088", "category": 26440, "amount": 20000, "description": "We would like to boost AdaQuest ARENA & QUEST visual mode. \nThis enhanced graphical presentation will require new gfx model work", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1011, "q0": "Mobile Games are easy to install and easy to use. By combining NFTs and Mobile Games, you will get an entry point for new Cardano members. The Impact of this proposal will scale with in game mechanics and the style of this game. ", "q0r": 4, "q1": "The first stages of AdaQuest were already been funded. On their website and YouTube channel, you can see clear progress of developing a mobile game. The costs for the Visual enhancement team seem reasonable. The teams speak of a needed budget of around $500.000 for all displayed functions. With this proposal funded, only  24% of the goal is achieved. ", "q1r": 4, "q2": "The team uses a lot of different channels (e.g. twitter, YouTube, discord, etc.) to inform all followers about their in game progress.  The proposal itself is about making a better visual experience (new animation, characters, effects, backgrounds, etc.) for this game. So the short roadmap is more than enough for this proposal. ", "q2r": 5, "assessor": "z_assessor_1252", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5255, "q0": "The first sentence on the Catalyst website describes the mission: \"Project Catalyst is a series of experiments which seeks to generate the highest levels of community innovation.\" I have only good things to say about this project, based on the proposal, but I do not feel it aligns with the mission to innovate and impact Cardano in ways that is not being done. All modern gaming products (especially blockchain games) push AAA graphics, fair pricing, F2P, no pay to win mechanics, and a lot of the gaming lingo used in this proposal. I SO appreciate the philosophy of focusing on the quality of the game and not having to be accountable to any big investors or publishers. However, the games that I have watched over the years that share a similar approach (such as Star Citizen) never amounted to anything. These are my two main concerns. There needs to be some element of separating from the big crowd of game developers in this space. I want to know exactly how a project is innovating the space and making a substantial impact on those that play the game (and highlight that uniqueness as a central feature in the marketing). Then, I want to see some kind of motivating factor that can add greater accountability and oversight. Other than that, this proposal is exactly the kind of thing I hope to see out of game developers. I think the creators are cool, relatable, experienced people that are passionate about what they do. That's a big selling point for me, and I want to see this project succeed. ", "q0r": 3, "q1": "This proposal is actually not a very big risk. Sort of. My concerns in the impacts section still stand but the reality of this proposal is that it's an improvement project to develop upon an already working product and the money appears to be relatively well spent. After reading the budget, the requested $20k somehow seemed like not that much. The amounts to pay the digital artists are actually very reasonable for skilled work. It's relatively close to average salaries in the region. The experience of the team is nothing to be concerned about as they have plenty of credibility to prove that they can get this job done. I appreciate the LinkedIn profiles. The only reason I rank 4/5 is because of the concerns in the impacts section. I don't think there is enough unique innovation here to feel like I am impressed with the roadmap. ", "q1r": 4, "q2": "I'm a stickler on KPIs. I believe the auditibility section should have nothing to do with the completion of a product, in most cases. A completed product, no matter how good, that doesn't get any users is not making an impact. However, in the context of this proposal, I can't think of any quantifiable KPIs to demonstrate the progress of art-based upgrades. The best I've got is the team paying attention to how the upgraded visuals are impacting the number of participants. I want to see metrics on improved usage traffic as a result of these graphics upgrades. ", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Impact: I do not understand the Accessor. On one side he/she points out how nice our proposal align to the Project Catalyst. On the other hand he/she give 3 stars rating. Further we desribe every aspect the Accessor sees as a concern. We are open in our communication. But we also release only important infos, instead of just dropping some marketing stuff because of reasons. So in the end we can´t understand where the 3 star rating come from"}, {"id": 6410, "q0": "This proposal is very well aligned to the challenge. As it stands to create an enveloping game built on Cardano. Even though, how it is presented so far does not fit my tastes in regards to gaming, I commend them and appreciate their idea, I’m sure there is a target audience out there that finds it very attractive. ", "q0r": 5, "q1": "As the team behind this game project, broke down their project into different proposals, I would suggest making it clearer and to show that they are all interconnected. Would help visualize all the depth that is behind this project and understand better its required multistage funding. \nIn terms of feasibility for this game visuals module, I can see their plan is detailed and reasonable for the work required. ", "q1r": 4, "q2": "Their mission is very clear, and as it stands the proposal as more than enough material/information to audit their work. They were clear in what they asked for and showed capabilities. Again I would like to see a connection between all the proposals that are behind the ADAquest game, so one could have an easier time grasping the situation and all the funding and work required behind this great project. ", "q2r": 5, "assessor": "z_assessor_416", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8367, "q0": "I love the idea that team behind ADA quest separated their requests in few proposals. In this case it is more based on the visual side of the arena combat. As usual with this team everything is well explained and it addresses the challenge.", "q0r": 5, "q1": "The team behind ADA quest has been dedicated to this project and progress is visible constantly. The team is experienced and motivated to make this game as best as possible. There is no doubt that this proposal will be implemented successfully.", "q1r": 5, "q2": "Information is more then sufficient and well explained. They were participating in the previous Fund, and progress is visible from then. One can only expect the same trend in this case. There are no complaints about this proposal. ", "q2r": 5, "assessor": "z_assessor_672", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8973, "q0": "The idea is great, about to enhance graphical presentation of the ARENA, which is the first game mode of the team as the product of the funded proposal in Fund5. We need to see what ARENA is by clicking into the link https://ada-quest.com/ to understand how great it is (playing free without any paywall, being easy and user-friendly, involving the community into the development). Besides, I found this: after successful implementation of the project ARENA since Fund5, this round of Fund, the AdaQuest authors propose 8 proposals (6 proposals for ARENA mode and 2 proposals for Phase 2 of AdaQuest). I think we should read all of them to understand the AdaQuest project as a whole. They are:\nhttps://cardano.ideascale.com/c/idea/405445 (enhancing the graphics of the game: re-design, create and enhance characters - this is the current proposal we are assessing)\nhttps://cardano.ideascale.com/c/idea/403708 (polishing, balancing & testing the game)\nhttps://cardano.ideascale.com/c/idea/405317 (marketing strategy)\nhttps://cardano.ideascale.com/c/idea/404315 (delivering adventures within the game  for PVE players)\nhttps://cardano.ideascale.com/c/idea/404938 (hiring the sound designer for AdaQuest and creating a free sound library for Cardano game projects)\nhttps://cardano.ideascale.com/c/idea/404893 (creating a module for socializing and housing in the world of the game)\nhttps://cardano.ideascale.com/c/idea/404544 (creating the concept for Phase 2)\nhttps://cardano.ideascale.com/c/idea/405375 (developing a prototype for Phase 2).\nThis proposal not only fits the challenge “Gamers On - Chained” but also add value to the Cardano ecosystem because if it is successful, the project will help to increase: number of users of gaming based applications built on Cardano, number of CNFTs made specifically for gaming, number of fungible tokens made specifically for gaming, which are in the success metrics of the challenge. Additionally, the challenge “Gamers On - Chained” was initiated by the team, so that they are well-known about which proposals will address the challenge, therefore the impact of this proposal should not be a problem.", "q0r": 5, "q1": "The authors provide information in full details for us to assess the proposal’s feasibility, consist of team’s information, detailed plan, marketing strategy, KPIs, target groups, budget breakdown and challenges/risks related to the project’s success. About the team who makes up the project and their partners (freelancers who are they working with), the information is provide very detailed, we have their names, their professional majors, number of experienced years, their roles in the project, their skills and experience related to the project conducting, we also see their social links to get more information about them. Especially they delivered the first mode ARENA successfully and truly great, I think that is the strongest evidence to prove the project is in expert hands. The clearly understandable plan allows us to see what need to be done in a chronological order in term of 2 months. The target groups as well as the interesting marketing strategy are also explained reasonable. Regarding to the financial amount, we can see it is broken down reasonably well into identifiable items: illustrators, animator and art director. Additionally, the team foresees challenges/risks that they may face when conducting the project, and they also gives solutions/ mitigation, helps us underrstand more about the project and raise the trust from readers that the proposal will be implemented successfully.", "q1r": 5, "q2": "This part of proposal is provided in a good level of information, consist of roadmap, milestone, time horizon and KPIs, help us easy to understand what will be measured or monitered. The “success looks like” section is explaned very well for us to understand what result would be expected, give us to have the vision of the project. The team also explains that the progress of the project will be upload on well-known tools like like JIRA, Github and Confluence, so it would be easy for tracking public.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will re-design, create and enhance our characters to make them ready for this visual upgrade", "experience": "Art Direction: Christian is our Illustrator and UX Designer with more than 15 years of professional work in digital art, gamification, interface- and app design in the industry.\n(LinkedIn: https://www.linkedin.com/in/christian-hayungs-9ba22457)\n\nInfo https://ada-quest.com/about"}