{"id": 367266, "author": "", "title": "PACE: Proposal progress updates", "url": "https://cardano.ideascale.com/a/dtd/367266-48088", "category": 26119, "amount": 11500, "description": "資金提供を受けたプロポーザルは、コミュニティに情報を提供し、プロポーザルの進捗を監査するために、進捗状況を公開する必要があります。", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great proposal to create an open source system for collecting update logs from funded proposals and providing an API for bulk access to these. The biggest limit the to success of this proposal is whether proposer use it. Are the proposers working with the catalyst team to mandate submission to this as part of being funded?", "q0r": 4, "q1": "The team has the experience to deliver the technical side of the plan, having already been involved in similar projects. They have set out a detailed plan and timeline and are likely to be able to deliver. As stated above, this biggest risk to this project is whether proposers actually use it. If Catalyst is funding this project, then should they also be working to mandate submission to it as part of being funded?", "q1r": 4, "q2": "The technical deliverable of this project will be easy to audit give the plan and milestones. The proposer shave nominated some metrics to measure success, however it would be great to have some goals here as well. What % of proposals funded are using this to submit progress reports, and how many apps built off the data collected would be considered a success? ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "-The problem statement states that funded proposals need public facing progress updates.. This wording should be phrased in a better diction to be easily understandable.\r\n-The solution clearly states that the proposal will provide a platform for updates on the state and the progress of proposals. Thus, this challenge is addressed. Furthermore, it states that the community would benefit from having access to a history of update logs, so the community will be able to follow the progress of completion for the funded proposals.\r\n-It is difficult to understand this proposal by linking Ideascale presentation of the proposals from previous fund. All documentation should be created explicitly for this proposal and edited in a coherent format.\r\nThis proposal needs to be worked on, the referred concerns should be addressed.\r\nI rate the impact of this proposal with a score of 3.\r\n", "q0r": 3, "q1": "-The feasibility is moderate-high. Teams combined experience in software development and cloud infrastructure is counted to more than 25 years. It is clearly stated that the data needed for the project will be acquired from IOG. \r\n-The roadmap is described in adequate manner. The connection to the previous funded proposals, supports the level of success. \r\n-\"..In total the proposal will likely take anywhere from 5 weeks to complete.\" This sentence is difficult to understand. I can only assume that the proposer meant to say that the first stage will take up to 5 weeks, with 2 weeks for the functionality implementation and another 3 weeks for IOG data integration. \r\n-The budget is clearly defined and declared acceptable with 11% this challenge's funding.\r\nI agree that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "-For auditability of this proposal the developing team is referring to open source code on their Github repository and on their own community web site https://projectcatalyst.org. \r\nAt this moment this website presents the following statement:\r\n\"Currently the community do not have easy access to the data needed from Ideascale. We are trying to collaborate with IOG and the community on the terminology, definitions and data access in a document we've shared.\" \r\nTo be able to make further inquiry the proposer added this link https://cardanocommunity.notion.site/PACE-c1b5ed092f0c43bdb7045a75b8592b0e\r\nWith this last link it is possible to communicate and audit the progress of this proposal.\r\nIn summary I agree with the auditability of this proposal.\r\n", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Very simple and funcional idea, adressing the challenge of the campaign and scalable. It is also well written with a clear problem statement, a solution, a defined plan (though here the plan could be splitted into months) and a roadmap.\r\nTo make it more visual, I would add a progress bar (from 0 to 100% complete), with the deliverables/milestones distribuited in their given percentage, and possibly a Kambam layout, so people can see the size of the backlog, what is being  done and what was already delivered, instead of just a list of deliverables. Also, I would also a place to attach \"proofs\"/evidences of the achievements as documents, presentations, spreadsheets, etc\r\nIf possible, it would be nice also to have alll these logs concentrade in a sigle and searchable place, in addition to only the proposal (a dashboard would be great). Also, maybe an extra step to communicate and train people (maybe a tutorial would be enough) on using this will be helpful.\r\nOne thing that would be important here is to jointly create this with the community, with MVP and sprints to collect feedback from users and improve the product.", "q0r": 5, "q1": "Two people with diverse experience (dev and management) already in the team seems to be enough to implement it. The plan is clearly defined.\r\n\r\nCosts breakdown are fair and plan is sensible", "q1r": 5, "q2": "the milestones and metrics are clear but the metrics could have some numeric targets spread in time.\r\n One possible risk to consider here is that funded proposers dont create the habit to update it. Maybe it could be mandatory or it will be necessary to create this culture.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Although the problem presented during the proposal is clear, the problem statement could be better presented. The problem is related to information fragmentation and transparency in the reports and updates of funded proposals.\r\n\r\nOne of the essentials of auditability is to disseminate information about funded proposals to the community. Several funded proposals teams have been publishing their progress reports independently through social media, which causes information fragmentation and makes auditability difficult. Having a hub where teams can submit updates and keep a log of this data/infos is important to improve auditability and allow for the creation of analytics that can provide a comprehensive view of past fund cohorts.\r\n\r\nThe goals and metrics mentioned indicate a positive impact on the items established in the challenge brief.", "q0r": 5, "q1": "The team described relevant experiences(including sources) for the development of the proposal, such as aptitude in web development (front end/back end) and has been actively participating in Catalyst for several months, having contributed with several projects related to community integration (voters, proposers and CAs). such as Catalist Swarm and https://projectcatalyst.org/ \r\n\r\nThere is description of a reasonable and well-structured plan, with a cohesive timeline. A budget breakdown was included according to the allocation of time in different activities and the hourly rate. The established values are reasonable and compatible with the values corresponding to web development rates and other activities. Considering the fact that the team split complementary proposals into 3 different proposals, it's not clear why the budget allocated for Hosting and Software is the same for all proposals ($500USD).\r\n", "q1r": 5, "q2": "Although the problem and solution presented are reasonable and in line with the challenge, the problem statement is unclear as the problem has not been explicitly defined.\r\nRelevant metrics were included. KPIs not included. I would recommend including KPIs for greater objectivity and to improve auditability. The roadmap has relevant goals, improving auditability. ", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "既存の更新情報をインポートし、提案者が使用する進捗状況の更新フォームを提供し、更新情報を提案データに添付する。", "experience": "ウェブ/モバイル開発の経験5年、戦略的コンサルティングの経験1年、ファンド5でCatalystに焦点を当てた提案に資金提供を受けた経験あり"}