{"id": 367602, "author": "", "title": "Smart Contract Audit Token SCAT DAO", "url": "https://cardano.ideascale.com/a/dtd/367602-48088", "category": 26119, "amount": 15000, "description": "プロジェクトを監視し、資金が適切に使用され、提案が完了していることを確認するための明確に定義されたプロセスがないまま、プロジェクトは資金を受け取ります。", "f6_no_assessments": 2, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal looks to help meet the auditability requirements that are presented in this fund challenge.  It looks to build and create a DAO that will develop reporting and metrics of fund winning proposals in the future.  This plan is scalable with the planned infrastructure that the DAO will enable and has sights to available to perform auditing on all projects.", "q0r": 5, "q1": "This plan's team has relevant financial and technical experience as well as being a previous fund proposal winner. Many of the foundational pieces of this proposal are dependent on the completion of the fund 5 proposal items.  There is no clear mention on this proposal about the timeline for those items to be completed and/or if they will impact the progress of this proposal.  Given there are no issues with the fund 5 items, though the items for this proposal seem feasible to accomplish along with the basic roadmap given.", "q1r": 4, "q2": "There is mentioned of what success measures look like, but more definitive metrics would be more helpful in auditing or measuring the progress of this proposal.  Bounds and/or milestone that are clear would help make the auditability of this proposal that much better.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses directly the challenge by implementing Smart contract audits.\r\nAs part of the solution, the proposal is building on a decentralized autonomous organization. This DAO will function as initiative for onboarding a work force of auditors to perform independent audit procedures. The key element to this solution, the DAO, will be issuing its own token that will be utilized in various ways to generate revenue, to fund its operations.\r\nAll the statements are clearly articulated and defined to strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "All information provided, including full deployed project web site, are easily accessible from the proposals page. \r\nThe manpower is not explicitly defined as the project will hire, onboard and train workforce within 3 months. All of the funds are reserved for paying auditors for 6 months of operation.\r\nAfter the initial 3 months of hiring and training, the DAO treasury should be self-sustaining and review Catalyst projects in perpetuity. This is one low risk I recognize, the risk of low or unsuccessful financing by DAO Token deployment, as it partly depends on external causes & effects, i.e. creating liquidity by users of SCAT DAO Token. This is clearly stated on the SCATDAO.com web site. Other costs are paid by successful funding from fund 5. \r\nThe proposer CPA has 10 years experience in public & private audit.\r\nI strongly agree that this proposal will be implemented successfully. ", "q1r": 4, "q2": "Measuring success; the proposer strongly emphasizes on the responsibility to work into mandate with all active Catalyst projects to be audited by SCAT DAO project. As stated, the proposer values all active projects equally, anything less than 100% is seen as a failure.\r\nEvery audit will be a measure of the ROI. The key metrics for this challenge are recognized and defined as the metrics of this proposal. \r\nI strongly agree and rate auditability with the highest score of 5.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "触媒プロジェクトをコミュニティ主導の分散型組織の監査範囲に組み込み、SCATDAO.comを通じて結果を共有する。", "experience": "公認会計士で10年以上の監査経験（公的機関および民間企業\n\nこのカテゴリーと直接の相乗効果がある監査プロジェクトを開発しているファンド5受賞者"}