{"id": 414076, "author": "fimi.vn", "title": "Blockchain Course for Vietnam Devs", "url": "https://cardano.ideascale.com/a/dtd/414076-48088", "category": 26597, "amount": 22400, "description": "The majority of developers in Vietnam are not familiar with blockchain or are not right understand of blockchain and its importance roles to the real world.", "f6_no_assessments": 24, "f6_rating": 4.430555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 2745, "q0": "“To solve the problem that the challenge requires, the proposed team has come up with a solution to drive the increase of participants in our ecosystem, while equipping them with in-depth knowledge of Blockchain. Cardano,\n  By organizing face-to-face and online lessons, at halls and venues in major cities in Hanoi, the lecture content will provide students with basic to advanced technical knowledge, especially the Cardano Blockchain platform, analyze, evaluate and compare the advantages and advantages of the Cardano Blockchain platform, clearly showing students the potential opportunities that come from the technology background, screening, and prioritization. breakthrough technologies and applications in the near future.\n  * this idea offers a method that I think will have a huge impact on the ecosystem because it is called a talent training center for the Cardano ecosystem, in addition, these classes are still being proposed by the team proposed to be implemented before this proposal was written, which gives our community of voters a sense of security because the proposal has been proactive in implementing it and it is almost working and very successful, with a large number of The increased number of developers through this proposal speaks to the success of the proposal team.\n  However, I have a question with the proposal group: will the students be able to study for free or have to pay tuition fees. This has not been mentioned in the presentation.\n  Foreseeable risks are that the epidemic situation may return and the blockade is inevitable, so the proposed team has provided a solution to completely eliminate it by organizing online learning. line. \"", "q0r": 5, "q1": "roadmaps and budgets are provided in detail in accordance with common ground, specific team member information, specific job assignments, appropriate experience to implement the proposal, in general I appreciate This proposal is feasible because, I myself have heard that these classes have been held before, and found that Mr. Dung is a person who has made a lot of contributions to the community in Vietnam, and have a great influence on the community. because it is based on previous educational activities and activities, so I think success is very easy for this group of proposals, and it is also necessary that these forms of education expand to other countries, in Africa for example.", "q1r": 5, "q2": "\"very detailed in the section providing indicators to measure progress, and assess the quality of the lesson and test the knowledge acquired by students, but if there are commitments to support the monitoring community, and it would be great to see how class activities and memberships increase,\n    Developers in the national vietnam region will be aware and thrive of the industry, providing more members from the classroom to join positions of our ecosystem. \"", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"id": 13761, "q0": "I believe the proposal will address the problems raised. The proposal outlines a plan for long-term expansion and growth. But in my opinion, the proposal hasn't fully considered all of the potential risks related to Vietnam's Blockchain training industry. While there are numerous, varied, and comprehensive Blockchain training courses available in Vietnam, the risk of competition is particularly high. You can find more than 4 million results by simply typing the keyword \"Blockchain course\" into a Vietnamese search engine. Although the free course organization is a benefit of the proposal, in my opinion the Proponent needs to enhance the budget for digital marketing activities to make the course more appealing.", "q0r": 4, "q1": "With the information provided by the proposal, I believe there is a high probability that the proposal will be successfully implemented. Mr. Do Manh Hung, the course's primary lecturer, was one of the first to approach and thoroughly research the Cardano ecosystem. Mr. Do Manh Hung has a strong belief in Cardano and has made major contributions throughout time to the growth of the Cardano Vietnamese community. He goes by the name Mr. Do Manh Hung ADA in the Vietnam Crypto Community. Additionally, through the website https://fimi.vn/blockchain/, Mr. Do Manh Hung has been organizing courses on Blockchain and cryptocurrency. For the reasons listed above, I believe that this proposal is almost certainly feasible.", "q1r": 5, "q2": "The information provided is sufficient to evaluate the proposal's progress and success. The success of this proposal is assessed using metrics such as Number of new trainees registered for the course, Number of students participating in the course are developers and Number of students from the course participating in the Cardano ecosystem. All of these quantitative measures, however, fall short of accurately assessing the course's quality. Therefore, the Proponent should think about include some measure to evaluate the course's quality, such as student responses and evaluations, knowledge students can learn for the course, and knowledge students can put to use. It will be possible to evaluate the proposal's success fully and comprehensively using both qualitative and quantitative measurement markers.", "q2r": 4, "assessor": "z_assessor_3783", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13743, "q0": "We may know the Marlowe language that interacts with Real-world Data but to do so is difficult. The idea of offering a free course with a Marlowe theme fits into Cardano's challenge settings. To become experts in the field of financial contracting or business, we will learn for free about Marlowe. The proposal is made with 4 courses in different locations that will attract more finance students to attend. The proposal will increase cardano's ecosystem, where students studying finance are the resource building projects for Cardano. Marlowe is blockcahin-agnostic the writing of smart contracts that will really be needed. Students, finance-related entrepreneurs will be the ones affected by the proposal, marlowe learning will be necessary for them. The implementation solution is appropriate, the course taken on the weekend will not affect the learner's work. The content of the course is mainly about Marlowe's Core Principles and how to write smart contracts, which will be in line with the challenge presented. The course can motivate students to study Marlowe and towards achieving the goal of working in the Cardano ecosystem. The implementation proposal will be affected by the Covid-19 epidemic, the author has an online learning solution that is appropriate. I have an opinion on the risks of implementing the proposal, Marlowe is a programming language of the scale of the financial industry will have a picky learner, the author needs to have good communication, encouraging the students to attract learning. Implementing the proposal will likely lack funding due to the increase in the price of services. The author needs to anticipate this and have additional funding sources.\nRating: 4\n", "q0r": 4, "q1": "The implementation plan of the proposal is detailed, the way of implementation is appropriate when organizing the course in 2 major cities of Vietnam. The schedule of carrying out the work is clear for the 4 courses given. However, the implementation plan needs to estimate the number of students attending, which helps to organize the appropriate location. In addition, attracting and selecting students who are suitable for the learning process is essential. Implementing the project are key members of the Fimi community who have demonstrated their ability and capacity to implement the proposal through previously implemented challenges. Members have obtained assignments during the implementation process, however the preparation of the venues, the attraction to the community to participate in the course, and the preparation of facilities are work that has not been specifically assigned. We would like to see the details in the implementation of the work assigned to the Fimi support team. The proposed budget of $26,900 is in line with the funding made at F9 and reasonable with the plan, there are already spending on the preparation of locations, the cost of implementing digital marketing. The amount broken down by the work of implementing the proposal is appropriate for the successful implementation of the proposal.\nRating: 4\n", "q1r": 4, "q2": "The implementation roadmap of the proposal is given with 4 courses with timelines of implementation that can perform audits. For each course when the institution already has indicators/KPIs proving the proposed is being implemented. The author commits to report specific figures on the number of participants. Students who finish the course will have hands-on exercises that evaluate learning outcomes that identify future developers. The proposal is full of measurement indicators indicating that the proposal is being implemented in accordance with the plan. Progress reports can be given after the end of a course. Completing 4 courses is the goal of determining the success of the proposal.\nRating: 5\n", "q2r": 5, "assessor": "z_assessor_3777", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12709, "q0": "The idea of creating a blockchain course for developers in Vietnam is no longer new. However, these intensive courses are mostly for a fee and at a fee that is not necessarily cheap for some individuals who want to participate in this field in Vietnam. Therefore, the proposal to create free courses on Blockchain to make it easier for developers to access blockchain and help the Cardano ecosystem grow in Vietnam is essential. This is a great idea.", "q0r": 5, "q1": "This proposing group has been conducting blockchain & Catalyst training courses since 2017 with paid classes. So they have the experience to make this proposal. Course schedules and important timelines are presented clearly and in detail. I think it would be better to propose to mention more information about the minimum number of students participating in each course held. ", "q1r": 4, "q2": "Proponents give clear and defined timelines. But the measures the proposal gives are mostly self-statistical of the group. In my opinion you should add some other metrics so that the community can monitor and evaluate the progress of your project. In addition, where are the progress reports of the proposal updated so that the community can track the progress of the project?", "q2r": 4, "assessor": "z_assessor_3469", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12461, "q0": "I completely agree with the proponent and believe that this project will have a positive impact on the Cardano developer community in Vietnam, contributing to the expansion of the Cardano Developer Ecosystem. According to the latest research by HackerRank, Vietnam ranks 23rd in the world in terms of programmer capacity. However, most of today's programmers in Vietnam still write familiar and popular coding languages ​​for many years like Java, PHP, and Python. In recent years, blockchain technology has exploded, a large number of programmers want to switch to learning blockchain but face a lot of difficulties in getting started such as resources, specialized courses, clubs, and communities but very few. Vietnamese or very hard to find. That makes it difficult for many programmers to absorb or misunderstand the true nature and actual value of blockchain, even though many people think that blockchain is a scam. Therefore, the establishment of the Blockchain Course for Vietnamese Devs in Vietnam is a great idea, not only to help Vietnamese developers have a correct and comprehensive view of blockchain but also to help the community to build the blockchain. Cardano programmers are growing more and more young and talented developers. The special thing is that the course will be held for free if this proposal is funded, so it will be more attractive and have a great impact on the community.", "q0r": 5, "q1": "This project can be done successfully with ease. The project team has organized many training projects to teach and popularize blockchain within 5 years for more than 1000 students with courses such as Blockchain & Crypto K02 or Blockchain & Crypto K04 successfully posted on the website and their youtube channel. So it is easy to organize follow-up courses especially if this proposal is funded the course will be free for all students. That will be very attractive to all people of the course helping spread the blockchain to as many people as possible. There are 5 members listed in the teams with clear information, but only providing the telegram link, the proponent should add some other information such as GitHub or Twitter link, it will improve the convincing and clearness. Some member information links are not accessible. The budget breakdown is clearly listed but is still a bit generic for example if the course is off-line, the proponent should plan the class about how many people the amount of equipment needed, and how much it will cost.", "q1r": 5, "q2": "The project's roadmap has been specifically planned with 4 courses within 6 months with specific content and blockchain and Cardano in the two largest cities in Vietnam à Hanoi and Ho Chi Minh city. The proposer should provide full details of each course such as how many sessions each course will have, who will teach the class, and the more convincing it will be. Voters and the community can easily check the suitability of the project through the team's reports and specific metrics such as the number of students enrolled in the course, the number of la developer students, and the number of students joining Cardano Ecosystem after the course. In addition, the project has a youtube channel and its website, we can check indicators such as views, and comments to see if the impact of the project on the community is large or not. The proposer can use google registration forms for students to register so that they can report statistics to voters and the community in the most transparent way.\nIn conclusion, the proposal can be easily auditable.", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12385, "q0": "This proposal aimed to contribute in combating the lack of awareness and familiarity from developers in Vietnam of the blockchain ecosystem, including Cardano. The proposed solution is to conduct short training courses for developers to share knowledge of the blockchain and Cardano ecosystem. These courses have been done in Hanoi and Ho Chi Minch regularly but at a fee from the participants. The purpose of this proposal is to ask for a funding so that these courses can be given out for free. The proposer has provided a syllabus that will be discussed in the courses, which includes intro to blockchain technology, ways to evaluate blockchain, opportunities in blockchain, as well as topics on Cardano (intro, advantages. and working for Cardano). From the syllabus given, it seems that the purpose of this project is more to attract more developers into the Cardano ecosystem instead of giving a technical course on Cardano. Which isn’t a bad thing since at the end of the day, introducing more developers to the blockchain technology, especially Cardano, will grow Cardano’s outreach and may be the gateway for discovering new talents that can work on the Cardano ecosystem. However, from the syllabus, it seems to me that Cardano wouldn’t be the main focus of the courses since the amount of Cardano topics is less than the general blockchain technology. I’d have liked if the courses included more topics discussing Cardano (i.e. the Plutus Pioneer Program, Project Catalyst, etc.) ", "q0r": 4, "q1": "The team consists of a main lecturer and an assistant who have experience with Cardano, such as the Plutus Pioneer program as well as experience as a trainer. In the proposal, there was an attached documentation of courses that have been done in the past regarding blockchain and crypto. This shows that the team member has the relevant skills that are needed to implement this project. \n\nThe proposer provided a roadmap of this project. There will be 4 courses that will be done in Hanoi and Ho Chi Minh (2 courses in each city). The 1st course will be in Sep or Oct 2022, the 2nd course in Nov or Dec 2022, the 3rd course in Jan or Feb 2023, and the 4th course in Feb or Mar 2023. Considering the courses will be done in 2 weekend days, the schedule for each event seems feasible to be completed since it’s apart by around 1 month for logistics and planning. However, I’d have liked if the proposer provided more details regarding the logistic and planning stages, such as reserving the room, preparing equipment, etc. but overall, the timeline provided is adequate and seems feasible to be completed.    \n\nThe budget of 22400 USD has been requested for this project and has been broken down into several items. This includes the lecturers fee (2000 USD per course), flight and accommodation (500 USD per course), documents (100 USD per course), room reservation fee (1200 USD per course), digital marketing (500 USD per course), and 2000 USD each for advisor and backup budget. The budget has been broken down into identifiable items however I’d prefer if there were more details for some of the items. For example, the budget for digital marketing could have been expanded more regarding what type of digital marketing (i.e. short videos, digital poster, social media page, etc.) will be done so the cost can be judged more clearly.    \n\nThe main risk to be considered is the covid pandemic which would hinder the events since it will be an offline course and the proposer has identified this and proposed that the course will be held online at first on the set date in this proposal and will be held again later for the same students offline once it is possible again. This shows that the proposer knows the risk of running an offline event and has come up with the solution to hold the event while still ensuring that students can still participate fully in the course at a later date.  \n\nOverall, I’m in agreement over the feasibility aspect of this project since the team members involved in this project have the skills needed, the budget has been broken down in details, as well as having a well laid out and realistic roadmap for the completion of this project.", "q1r": 4, "q2": "The KPIs chosen as a way to measure the success of this project include metrics such as the “number of new registered participants”, “number of developers joining the course”, as well as “number of students participating in Cardano ecosytem (as PA, proposer, or voter)”. The metrics chosen by the proposer were well defined and relevant to measure the success of this project regarding the outreach the project has. However, I think the proposal is missing an important metric for measuring the quality of the course. I’d like if the proposal included a feedback metric from participants, such as through a questionnaire so the participants can give score in terms of how well the course are laid out, how helpful is the information given in the course, etc. Overall, I think the KPIs are adequate enough to measure the project performance. ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11346, "q0": "The problem that FIMI raised is that it is perfectly reasonable to build a Blockchain course for the community to help bring the right knowledge and right mindset to the crypto investor community in Vietnam, helping them to have enough understanding. Know and avoid scam blockchain projects.\n\nCurrently, Blockchain courses are still held regularly every 2 months and students who want to join the course have to pay a fee of ~ 400 USD.\n\nSo the proponent wants to make this course a social asset in the same way that the company IOG did with all their intellectual property, and making this a free course available to the entire community. community will attract more qualified people to the community and Cadano ecosystem in a more fair and honest manner.\nhelps students who do not have financial conditions but they have a passion for the field of sustainable Blockchain development to receive knowledge in the right way.\n\nI appreciate the way the proponent lays out the knowledge taught in the course in a specific and clear way, helping the audience understand what they will learn in the course, helping to stimulate their learning curiosity  pellets.\n\nThe proponent also raised risks and solved risks by the course being held both face-to-face and online to help reduce risks if the Covid-19 pandemic occurs, while students still have easy access to knowledge. and students who are far away or abroad can still learn through the Zoom platform.", "q0r": 5, "q1": "The proposed implementation roadmap proposed by the proponent is specifically 4 courses within 6 months held in person at specific locations and clear timelines.\nAfter completing the courses, the proponent reports fully to Catalyst as a closed proposal.\n\nHowever, the issue I want to know here is whether this fund, if approved, will the proponent organize more online learning sessions or not.\nAbout the teaching staff who have degrees and experience in teaching and training in finance as well as Blockchain technology.\n\nThey also attach related information, links and profiles for the community to verify.\n\nThe budget has been broken down into specific sections for items to develop the project .\n\nThis is the first series of courses the proponent has run with a Catalyst-funded budget.\nbut this course has been done successfully before and they have given verifiable information of the participants, so I see the probability of success of this proposal is very high.\n\nThe proposal is perfectly suited to the challenge as it can scale up and attract more talents who have the right understanding of Blockchain and the Cadano ecosystem.", "q1r": 5, "q2": "The project's metrics are through the academy's new registration on the Blockchain course registration form on wedside, so they can sum up the number of new students joining by specific numbers and the number of students old re-enrolled.\n\nAfter completing the course, they have a test to assess the student's understanding after the course to summarize the knowledge needed by each student, helping to adjust the teaching method to help students easily  access and deeper understanding.\n\nso they also assess the number of students taking the course who are developers\nThe number of students of the course participating in the Cardano ecosystem.\n\nThe success of this project is that there are thousands of developers in Vietnam who are properly aware of blockchain\nThousands of developers find new job opportunities in the Cardano ecosystem.\n\nWhat I would like to add is that the proposal needs to state more specific numbers of the number of registered students to achieve so that the community can better see the success of the proposal.\n\nThis proposal helps to expand and grow the community for the Cadano ecosystem, so it fits the challenge.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 10551, "q0": "“Blockchain Course for Vietnam Devs” is a good idea and meets the challenge of “Developer Ecosystem”. The proposal has pointed out a problem that is attracting a lot of attention today, that is: “The majority of developers in Vietnam are not familiar with blockchain or are not right understand of blockchain and its important roles to the real world.” I know that Blockchain technology is still a relatively new technology, has not been applied in many parts of the world, it has only been popularized in some regions and developed countries such as the United States and several other European countries. So this proposal for Vietnam I think is necessary and reasonable. For sustainable and long-term development in any field, it is also necessary to have a good knowledge and understanding of that field may be in the right direction. Therefore, organizing short-term training courses for developers in Vietnam to help them gain more understanding and knowledge of Blockchain technology is a very meaningful thing and has a great impact, not only for the developer itself but also for Vietnam in general. The proponent presented the community building process starting from providing background knowledge and thinking so that people have the right view, and avoid being scammed, this is quite practical and accurate because it will create confidence and motivation for new people. Moreover, the courses are always held regularly, and the frequency of impacting the students is once every 2 months, enough for the students to absorb the knowledge and have time to practice applying the knowledge they have learned. The proponent also pointed out the fact that since 5 years ago there were 1000 participants in the course, and until now this number continues to increase. Currently, some students are still taking online courses, thereby seeing the impact of the problem is relatively large. The solution proposed by the proponent identified most of the problems of the challenge. The proponent provided information on the time, location, and content of the courses. Thereby demonstrating the positive impact of the proposal on developers and the Cardano ecosystem. In order to successfully implement the project, the proponent had foreseen a potential risk, that is, the outbreak of the Covid 19 pandemic will prevent the course from being held on schedule. However, in the face of difficulties, the proponent has also prepared a solution to reduce that risk, by organizing online courses to ensure those who are not in Hanoi and Ho Chi Minh due to the epidemic or because they are busy, they can't take the offline course, they can still join the online course. I think if this project is successful in the Hanoi and Ho Chi Minh locations, there will be more courses in other localities, ensuring those who are passionate about Blockchain but not in Hanoi and Ho Chi Minh are still participating. In addition, these courses are not only for developers but will later be expanded to many other professions and fields. Because I see that the Cardano ecosystem and Blockchain technology are very potent and are increasingly being applied in life.\n", "q0r": 5, "q1": "This proposal has a very clear plan and implementation roadmap, including 4 courses. Each course is scheduled with an estimated time of implementation and the venue is Hanoi and Ho Chi Minh. I found that the roadmap was relatively simple and the process was iterative throughout the courses. Regarding the budget, the proponent presented a detailed and reasonable way of allocating and using that budget. However, in my opinion, the implementation of any of these projects cannot avoid unexpected risks. So, if possible, I think the team should balance the expenses, and deduct a small part to make a risk reserve fund. The participating group includes Mr. Do Manh Hung who will be in charge of the main lecture and the lecture assistant will be Mr. Do Viet Cuong, in addition to the FIMI support team. Identity information is presented specifically, and easy to verify. I have known Mr. Hung and Mr. Cuong through lectures and training courses. They are all very enthusiastic and experienced people in this field. Thanks to the teachers and the FIMI community, more and more new people have gradually approached the Cardano ecosystem.\n", "q1r": 4, "q2": "In order to measure the progress of the project, the proposed team presented KPIs, including: Number of newly registered students, Number of students participating in the course as developers, Number of students, students from the course participate in the Cardano ecosystem. After giving KPIs, the proponent also explains the meaning and effects of those KPIs. However, in my opinion, if the team provides more specific targets and expected results for the community to evaluate the success rate, it will be great. The success of the project is also clearly defined and easy to understand. This is a new proposal but has a positive impact on the community if approved. \n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10203, "q0": "The project aims to create completely free Blockchain courses, provide new knowledge and awareness for learners, and attract talents in the learner community, and bring learners to the world. in the field of Blockchain, and at the same time help Cardano be fully interested and popularized.\n The project has given the website address as well as some videos related to their project (https://fimi.vn/blockchain ,.. ), the problem raised by the project has also been solved by the team. necessary to overcome, in addition, the project should also take care of whether what they teach is of sufficient quality and conveys well to learners when, as they said, the course is still being organized and learners have to pay 400 USD for a course, the time of a lesson is not mentioned. This is a good project, and if you want it to be successful, the team should pay attention to the smallest things, the best thing for the people. study, while improving the quality of knowledge, constantly updating to be able to have quality lessons.", "q0r": 4, "q1": "The project's work plan has given specific timelines, however, how a session is carried out is still unclear, the costs for the items they set out are quite appropriate except some amounts are not very clear (2,000 USD : Advisor\n$2,000 : Pre-booked), the project members are experienced and well-informed (Do Manh Hung,..), besides they have a three-member support team, information about they are also raised via explicit links.", "q1r": 4, "q2": "The project's KPIs are quite good, besides that, what the lesson brings is the most important, so there should be a necessary measure for this such as surveying students to see what they achieved or have. What are the benefits and dislikes of the course to be able to see the quality of the course as well as to help the teacher review and improve from there to bring the best for the learners.", "q2r": 4, "assessor": "z_assessor_3166", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10001, "q0": "Blockchain needs to be expanded, blockchain knowledge for developers is important to show the role for the present. The idea of offering the course for Devs Vietnam is in line with Cardano's challenging settings. The project will have a big impact on Devs Vietnam, instead of spending nearly $ 400 to learn about Cardano / Blockchain, we will learn for free which is great. The project is carried out with 4 courses in different locations that will attract more Devs to participate, free learning will attract new entrants to learn about Cardano / Blockchain. The project will increase Cardano's ecosystem, bringing the right perceptions of blockchain to Devs and participants. The project is scalable in the future, many people who are not aware of blockchain will learn for free. There will be many projects that devs and participants build that contribute to the development of the community. The project has had success before, although it has to pay a tuition fee of $ 400, but more than 1000 students have participated. If the free course is taken we will see the number of students participating is very large. The implementation solution is appropriate, the course taken on the weekend will not affect the learner's work. The content of the course has a great impact on students, nearly all the basic knowledge of Blockchain is outlined in the course. The course can motivate blockchain and Cardano research students to be the opportunity to work in the Cardano ecosystem. The implementation project will be affected by the Covid-19 epidemic, the author has an online learning solution that is appropriate. I have an opinion on the risks the project may face, the psychological impact of course participants, they may be worried about fraudulent Blockchain projects, not yet having faith in Blockchain. To minimize these questions, the author needs to make assertions about the benefits that Cardano and Blockchain bring, creating the trust of participants. Implementing the project will likely lack funding due to gasoline fuel and Diezel price increases leading to increased services. The author needs to anticipate this and have additional funding sources.\nRating: 4\n", "q0r": 4, "q1": "The implementation plan of the project is detailed, the way of implementation is appropriate when organizing the course in 2 major cities of Vietnam. The schedule of carrying out the work is clear for the 4 courses given. However, the implementation plan needs to estimate the number of students attending, which helps to organize the appropriate location. In addition, each course needs to have more detailed contents in its implementation: Blockchain learning content, Haskell content, consensus mechanisms, Block structures, ledgers, potential projects introduced, etc. Implementing the project are key members of the Fimi community who have demonstrated the ability and capacity to implement the project through previously implemented challenges. Members have obtained assignments during the implementation process, however, the preparation of the venues, the attraction to the community to participate in the course, and the preparation of facilities and resources are work that have not been specifically assigned. We would like to see the details in the implementation of the work assigned to the Fimi support team. The proposed budget of $22,400 under 10% of the funding for the F9 challenge is in line with the plan, there have been reasonable expenditures on the preparation of locations, the cost of implementing digital marketing. The amount is broken down for the project implementation work, we easily notice the money is being spent in accordance with the purpose and suitable for the successful implementation of the project.\nRating: 4\n", "q1r": 4, "q2": "The implementation roadmap of the project is given with 4 courses with specific implementation timelines. For each course held there are indicators/KPIs that prove the project is underway. The number of participants can be determined through the registration form, which will have their detailed information. Project audits are accurately determined by the results of each course. More than expected the course will provide to the Cardano ecosystem members who do PA, who vote and write proposals. The project is full of measurement indicators that show that the project is being carried out in accordance with the plan. The project is successfully defined by the number of people who are properly aware of blockchain and participate in contributing new PA's and proposals to the Cardano community. The success of the project is consistent with the objectives set out.\nRating: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9881, "q0": "The proposal could be crucial for developing the blockchain and Cardano ecosystem. Blockchain systems are already a very new and developing technology for many people. For this reason, people do not know how and where to start, and people who are just learning can get lost very quickly. If the courses are effective enough and progressing correctly, it can be a very effective start, especially for people living in Vietnam. The fact that they will do the courses free of charge with the support they will receive, will attract the attention of many people. The course contents they specify are important and suitable for people just starting out.  \nBy learning about the Cardano Ecosystem, people attending these courses will be able to help develop the Developer Ecosystem within project catalyst.\nOn the other hand there are some noticeable problems. They didn't mention about marketing they're going to do to attract more people to their courses. They stated that there were problems in the lessons due to Covid and their solution is making courses online. At this stage, they should be able to do online lessons very comfortably instead of physical lessons. The biggest reason why the communities are effective today is that people from different places can work online. They should view online classes as normal rather than compulsory", "q0r": 4, "q1": "The number of people in their team seems to be sufficient to prepare a lesson environment and train people. Unfortunately, I could not find any information about the people mentioned. Their profile links don't work, and their youtube channel is the only place where we can find information about them. Also they did not give enough details for budget planning. For example they stated a line  \" documents: $400\" what are these documents, how they use these ? They specified the amount for digital marketing, but they did not mention how they would do it anywhere in the project.I don't think they planned these parts very well.\n\n", "q1r": 2, "q2": "The information they share about how to audit the project is very insufficient. They mentioned only a few important points and gave almost no details other than that. They stated that \" Through people who sign up for the form Blockchain Course, we easily measure the number of new register come to us each course. Then, we measure the impact of the course for new trainnes. \" which is not enough, they should give information about how they prepare reports about that and how they can measure it succesfully.\n\nIn conclusion, The only positive comment I can make about this part is success which they stated is sufficient considering the point desired to be achieved in the project. Their aim is to train thousands of people with these free courses they will provide.\n", "q2r": 2, "assessor": "z_assessor_3125", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9581, "q0": "\"Many developers in Vietnam do not fully understand or do not have the correct perception of the importance of Blockchain. I'm Vietnamese, so I know this. There are many fraudulent projects pretending to be Blockchain, and many fraudulent blockchain projects, so many people have a negative opinion about Blockchain.\n  The project is in line with the goals of catalyst in fund 9. The project helps to develop the community and build a community that is willing and able to contribute to the development of Cardano\nThe proposal is aimed at Vietnamese programmers who need to improve their knowledge of Blockchain to apply in life.\nRecommend a good challenge-response. I give 5 points.\"", "q0r": 5, "q1": "\"Organize short-term training courses for programmers in Vietnam. This training solves the problem. Improve knowledge for programmers.\nThe team consists of 2 people. Mr. Do Manh Hung has experience in Finance, Community Management, Plutus Pioneer, Influencing and Inspiring Coaches, and Lecturer at Fimi's Course. And Mr. Do Viet Cuong has experience in Community Management, HighSchool Teacher, Video producer, and Translator team leader. And especially the team, including Fimi Community: Established for more than 5 years with 120 videos, more than 15 thousand subscribers, 554,000 views, and more than 138,000 watch hours. Fimi's 3 Core-teams are handpicked with expertise in Cardano.\nEnthusiastic team, vibrant community, with a lot of content posted daily. The work is clearly divided and appropriate for the members. The members are clearly divided into tasks by each person's experience. Everyone can check the information quickly through the attached link. Plan to organize a total of 4 courses. an average of two months a class is held.\nThe main risk affecting the implementation of the proposal is the risk of an outbreak. The solution offered to solve the risk is to organize an online course. This solution solves the risk well.\"", "q1r": 5, "q2": "\"The proposal asks for a total of $22,400. The items are complete and detailed. The budget sheet helps me visualize the spending items of the proposal clearly. All expenditures have a good reason and sufficient explanation.\nThe measurement indicators are clearly stated, clearly explaining the meaning of the indicators. The proposal specifies how the indicators should be measured. The indicators stated are:\nThe number of students enrolled in the course.\nThe number of students taking the course.\nThe number of students participating in the Cardano ecosystem.\nMeasure those metrics by tracking through application forms, a list of participants, students who become PAs, proponents, and voters. The way of measurement is capable of accurate and easy measurement.\n Mr. Do Manh Hung has organized many Cardano courses before. I once took a class. The courses have quality content, easy-to-understand communication, and professional organization. I believe that with this experience and knowledge, the project will achieve success.\n Proposing to conduct 4 teaching sessions in Vietnam. Full figures are provided with accompanying time.\nFor the above positive reasons, I give 5 points.\"", "q2r": 5, "assessor": "z_assessor_3067", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9121, "q0": "I believe that your idea presents the community with a highly fascinating challenge and its potential solution. Thank you for your contribution. Congratulations on your progress thus far. Furthermore, it adds significant value to the Cardano ecosystem. According to the team, the majority of developers in Vietnam are unfamiliar with blockchain or do not fully comprehend blockchain's importance in the actual world. To solve this issue, they decided to conduct short training classes for developers in Vietnam in order to provide them with the necessary information about blockchain technology and its practical applications. This is highly fascinating to me since, in this case, the community has already been created with a strong structure, and the goal of this plan is to explain the complete blockchain universe and attract more new potential members from Vietnam. I liked the overall concept, the project proposal, and the overall stated tasks and milestones, which seemed like a reasonable notion to me, not only for the desired investment value but also for the entire project proposal. Furthermore, the project's concept and design appear to be well-thought-out. This proposal's purpose and metrics are in line with the requirements of the competition.", "q0r": 5, "q1": "In my opinion, the authors are well equipped to complete this project effectively. Despite the fact that they haven't picked the ideal candidate for some tasks, they supply us with a quick description of who they are, from which we may do a more in-depth analysis of their career pathways. I urge that they do this step as soon as possible. They've also worked on comparable projects in the past; one of the team members already has a website up and running with a range of material. They create a road plan for us to follow as we progress toward our ultimate objective. The writers properly stated what would be done, the important stages of the project, and the little acts that would result in such phases, as well as how long each phase would last (in months) and the goal that would be accomplished throughout it. This, in my opinion, is a good example of how to convey the practical component of a proposal, because I usually observe authors being more concerned with disclosing the stages that comprise the total project, rather than describing and discussing what would happen in each. We know how much money would be allotted to each phase of the project, which is crucial, but it would be really helpful to discover the same data of the previously rated item here.", "q1r": 5, "q2": "I appreciate that the team is planning websites and a card gallery, but I wish they had a discord channel or some means to keep their voters and community members informed about the project's development and progress. The KPIs and indicators are exceptionally detailed. One thing I appreciated about the team is that they have a great definition of success that I believe is acceptable for a developer. The strategy is logical and sequential, with milestones for both technical and non-technical execution. A well-thought-out summary of the targeted problem of confirming a person's employment experience is provided, as is a well-thought-out presentation of the solution. Overall, I feel the project will be simpler to follow if the team offers a system for gathering continuing feedback from the community while also keeping them updated on progress.", "q2r": 5, "assessor": "z_assessor_3022", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8819, "q0": "There are many developers around the world who have great development skills in some programming language still don't have any idea about cardano ecosystem and programming languages related to development of blockchain, Hence to counter that the proposer wants to set a small courses to the developers so that they can understand the different roles and opportunities available in the cardano so that developers can make carrier out of it, this will boost the developers to move towards blockchain ecosystem effectively without any doubts in mind, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan presented doesn't involve any risk in it , where it wants to bring most of the developers from Vietnam under a roof and help them in understanding the opportunities available over cardano ecosystem, so this task to achieve a team to run a campaign and  attract most of the developers is needed which will be done by support team and to conducting teaching a good professor is needed which will be done by Do Manh Hung who is Plutus Pioneer and an Influence and inspire trainer, hence with team already set and with the idea of inspiring developers to involve in cardano development projects, with given experience and plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The audit has clear goal to produce most of the developers of Vietnam towards cardano development projects, audit presented has introduced all the team members who will be involved in the  project and their roles in the project, audit contains what are the contents that will be introduced in the course so that developers can get clear picture on how cardano works and understand its ecosystem.\nAudit contains detailed budget breaking scheme to complete the project and it has even provided well structured timeline to improve the efficiency of the project , Hence with minimal risk involved and great idea to shift the developers towards cardano community, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 8652, "q0": "To be able to encourage new developers to actively participate in the blockchain, it is also important to educate them about Cardano awareness. The main purpose of this project is to organize blockchain and Cardano application courses for developers in Vietnam to promote Cardano and motivate them to participate in Catalyst. The theme of the courses that will be held is relevant and ideal for Cardano promotion such as an introduction to practical applications, career opportunities, future roles of blockchain and especially Cardano. In order to further strengthen the feasibility and user potential of the Cardano project, I encourage the proponent to provide additional research data showing that Vietnam has a lot of development advantages in Blockchain such as the ranking of the crypto-acceptance index in Vietnam, ranking of crypto-holders in Vietnam, increasingly favorable policies for Blockchain in Vietnam, etc. In general, the proposed solution is completely consistent with the main indicators of the Challenge, the risks are also clarified and appropriate solutions are given.", "q0r": 5, "q1": "The event plan clearly presents the important contents such as the time and the venue, the ancillary work after completing the course. However, the proponent still does not provide us with a mean course size that estimates how many students will participate in each course. The budget is also properly allocated based on the resources required for the organization of the course. In terms of personnel, the members who carry out the project, including the preparation, operation of the course, and teaching, all have working experience and professional knowledge that is deeply related to the main content of the course. The feasibility of the project is also reinforced through the successful organization of previous courses on similar topics.", "q1r": 4, "q2": "The construction roadmap for evaluating the effectiveness of the project is not yet clear, although there are descriptions of how the project evaluation will really impact developers in Vietnam, but it just stops at giving concepts and vague estimates “thousands of…” without committing to the numbers that the project will bring to Cardano and the milestones to verify the commitment. In addition, the project needs to mention more about how the community interested in the project can access information about it and how the proponent reports the project results to the community.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8445, "q0": "The purpose of this project is to provide developers in Vietnam with the education and skills they need to become proficient in blockchain technology by way of the organization of training courses. Over the course of the previous five years, the team behind this proposal has taught more than one thousand trainees about blockchain for a tuition fee of four hundred dollars per student. If the community decides to vote in favor of this proposal, thousands of trainees in Vietnam will be able to learn it without having to pay anything. Because of this purpose, the impact that this idea has on the community ought to be unquestionably favorable. The Cardano community will see an increase in the number of skilled and trustworthy developers. The proposer has also explained how it will be beneficial to the Cardano ecosystem by encouraging a greater number of potential developers from the Vietnamese community to take part in Catalyst. Consequently, I can say without a doubt that this proposition falls inside the parameters of the competition.", "q0r": 5, "q1": "The road map indicates that the team will create four courses within a span of six months, with two of those courses located in Hanoi and the other two located in Ho Chi Minh City.\nThe members of the team behind the proposal have already shown that they possess the appropriate level of knowledge and experience in the relevant domains to successfully carry out the project in accordance with the proposal's defined objectives. The budget is appropriate and adequately specified when weighed against the full scope of the project that is currently being worked on.\nEven though I believe the team has been successfully sustaining a community and has a strategy to reach out to new students, I would still be very interested in learning more about the marketing approach that will be used to attract newcomers in order to reach the greatest potential.", "q1r": 4, "q2": "The key performance indicators associated with the work results are presented in an easily understandable way in the proposal. The team has listed multiple technique to keep track of the data from the student to better assess the quality of the courses. I suggest team to note down the data into a document and share it publicly to the community so we can conveniently keep track the progress of the project.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8241, "q0": "\"The proposal is prepared as the expansion of one successful training course for community people who wants to know more about Blockchain technology. The main meaning of this proposal is the dissermination of information and increase the number of users in Cardano Ecosysstem. The proposer already mentioned concretely what contents would be provided to users. In addition, they already share about the successful case-stories of this training when more than a thousands of people had opportunities to join it. \nKey metrics about number of participants who will join in the course, in which number of developers is important. In additional, they considered about the number of students as potential young generations participated in the Cardano ecosystem. By the way, it would be clear and persuasive if the proposer can prepare information about expected number of beneficiaries, tentative timing of achieving the number to ensure that all stakeholders are convinced about the feasibility of project. \nRisk is considered briefly by the proposer and solutions are come up with. The flexibility of the solutions will help beneficiaries be more confident to join it. \nOne spotlight of this proposal is their clear imagination about how the project enhance the knowledge of developers, as well as increase more members to Catalysst and Cardano Ecosystem to Vietnamese community. \n\"", "q0r": 5, "q1": "\"Plan of course was shared in the proposal, with detailed contents and tentative timing. It seemed to be a series of training in the Metropolitan of Vietnam, where most of potential trainees could be accessed easily. It would be better if the proposer can mentioned briefly about how they are going to organize the course. \nThe good point about budget allocation is the way proposer think about the each category, what they are going to spend in each item. Checking about the categories and roadmap of implementation, it is aligned which means that proposer put effort in realizing this short courses much. \nTeam member seemed to have experiences in doing this kind of training before, especially a trainer. However, currently, the link to profile of others members are not accesible. Besides, the profile of main Person in charge is not feasible to see. Therefore, the Proposer can consider once again how they want to let readers or stakeholders understand about their key people, who play significant roles in the project’s success. \n\"", "q1r": 3, "q2": "\"As mentioned hereablove, the project has clear ideas about who they tend to approach and get involve after the project. However, they mainly wrote about how those people get involved, but, the important one will be how many of them will join expectedly after the course lack. So, the proposer can add quantitative indicator to make the proposal be clearer. \nThe success of the project is very general now, where the readers and stakeholders will find it difficult to assess in evaluation stage, or even post evaluation. With this ambiguous success, it might become the hinders for the proposal to get fund support. The proposer can prepare in in more concrete explanation. \nThis proposal is the new one in this round, with fundng from Catalyst. The team is working on other proposal in this round as well. \n\"", "q2r": 3, "assessor": "z_assessor_2969", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5991, "q0": "This proposal is very good and certainly fits the goals of the \"Developer Ecosystem\" challenge. The idea here is to organize short courses on blockchain for programmers in Vietnam. The course content will include background knowledge, knowledge of consensus mechanism, ledger structure, blockchain application, etc. The aim is to help the developer community have the right knowledge about the blockchain technology as well as grasp future career opportunities. Thereby increasing the number of developers not only in Vietnam but also for the entire Cardano ecosystem", "q0r": 5, "q1": "The feasibility of the proposal I evaluate is very high. The proposed group shows that they have the capacity, expertise and experience in organizing previous courses. The detailed presentation of issues and items to be implemented in the proposed implementation roadmap is extremely clear and methodical. We have 4 courses that will be held from the 3rd quarter of 2022 to the 1st quarter of 2023. The cost to implement this proposal has also been listed in detail. Fixed costs including documents, airfare, meeting room rental, marketing were mentioned, costs are also reasonable in Vietnam.", "q1r": 5, "q2": "The proponent gave us a lot of information to audit the project. The first is with the information of the proposed group, which has attached links to the individual profile page of each member (telegram). The community can easily discuss to get more information about the course. The second is about the milestones to measure the success, the success of the project will be the large number of new students enrolling in the course, attracting thousands of developers in Vietnam and thousands of agencies. New job associations are created. All these data are aggregated after each course and made into a report to send to the community. And finally, through the presentation in the proposal, the community can expect one thing that the future development for blockchain technology in Vietnam as well as the whole world is very open. We always have people in the background who are quietly dedicated to the development of this new technology, increasing its acceptance in many countries.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 5940, "q0": "This is the second proposal of the team in the challenge setting of the Dev Ecosystem. It is somewhat aligned because it provides the very basic foundation for the community of crypto investment in Vietnam. The PA also suggests that this could have also belonged to the Grow East Asia, Grow Cardano challenge setting, this would make more sense. The problem is a bit objective and the team should have thought about a more quantitative survey to back it up. However, the solution is very simple and very holistic with a very well-covered content of the course works. And if the proposal got funds, people can join the course Free of Charge. The team also mentioned the beneficiaries including the whole Vietnamese community, a part of that is the developers. It is positive as the agenda is more or less 80% pro for Cardano and also introducing the project Catalyst, as at the end of this proposal is funded by Catalyst. \nThe risk of the class is mostly in the face-to-face traditional manner versus the Covid 19's unexpected conditions, and the team already prepared the Zoom classroom. The team also stated that it is just a mitigating action as the online class will be less human interaction and conversations. There should be a counter plan for this in terms of online interaction tactics like Miro for example to tackle this less interaction and one-way teaching approach.", "q0r": 4, "q1": "The proposal team has proved a capable history of training with more than 1000+ trainees across Vietnam since the first cryptocurrency wave in Vietnam in 2017. The testimonials of most of the participants were very reliable and positive for the newcomers. There is also a backup lecture in case the main lecture cannot travel or clash with the other proposal schedule which makes the class more feasible. There should have been considered a backup plan for the support crew.\nThe budget was allocated for the person in charge of delivering each part of the proposal. Because the budget allocation of Catalyst in ADA will be on the 24th of each month, the team should consider breaking the milestones as well as the budget in the monthly report. \nThis would make it easier for tracking purposes, budget allocation, and also the feasibility of completing the proposal and reducing the risk of ADA price fluctuation. It is noticed that the team already put in Reserve 10% of ADA fluctuation. The good thing is that relevant materials could be found on the relevant link provided https://fimi.vn/blockchain, and the agenda is very detailedly mapped out for the 2 days course works, what would have been improved is the follow-up exercise after the audience finish the coursework. \nFor milestones wise, it is a suggestion to be more detailed in a month workload to prepare for the course Pre/During/Post course and aligned with each team member's roles to make the plan more properly.", "q1r": 5, "q2": "Although The KPI/OKR indicators are laid out in terms of numbers of students who would join the course and then become developers or participate in the Catalyst for different roles. As for the challenge setting of Developer Ecosystems, the key successful KPI should have been the number of Developers after the course, and moreover the follow-up course for them (if needed) based on the feedback of the developers. It would be really nice if the team can share more on the plan of digital marketing for the Blockchain Course for the Dev community. \nIt is mostly agreed with the proposer for the success picture in the number of developers in Vietnam who will be aware of blockchains and join the Cardano ecosystem. There should be a more direct quantitative approach for the KPI to make this success picture come true with each of the action plans (each course/ xxx number of participants/ in which yyy number of devs and / post course zzz number of developers to join the Cardano ecosystem) It is encouraged that the team should share a more frequent update on a monthly basis instead of only making the final summary after finishing the proposal so that we can see the corrective actions and intervention plans if the initial course is not working as plan. Overall, the PA still gives a score of Five- for auditability as an encouragement for the proposer's effort with the condition to carefully look at the PA suggestion. ", "q2r": 5, "assessor": "z_assessor_2759", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5715, "q0": "While I think the team is correct about the need of such workshops and training courses for developers into the Cardano world, the proposed project does not focus primarily on the developers. This project, if implemented successfully, will definitely benefit the Cardano investors. However, only a limited amount of such investors are developers. I think the proposal will better address this challenge if it focuses primarily on training the developers to adapt Cardano solutions.", "q0r": 3, "q1": "I believe the team and the presenters have enough experience from past participation in Cardano-related events to carry this project successfully. Training courses are always simple and easy to execute, yet the problem is to attract the learners into knowing, buying, and participating these courses. If funded by the Catalyst, this possible barrier then won't be an issue, and there is no doubt that this project will be fruitful.", "q1r": 5, "q2": "Almost everything presented in this proposal is informative and well-thought-out. I am satisfied that I have all the information I need to predict the future success of this project. However, since this project has run the past, it would help me if the proposer included data regarding past experience of running such project. These past information can be the learners' output, number of attendants, or projects that developers attended this project have built.", "q2r": 4, "assessor": "z_assessor_2741", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3712, "q0": "There are a lot of people who enter the blockchain space just to buy tokens and wait for them to go up in price. However, most of these people lose money because of their ignorance with the blockchain field. Seriously learning about blockchain will help the community have a more accurate view of this field as well as help the community to correctly invest in projects with long-term potential. Developers also need an in-depth understanding of blockchain to help them better cover the field so that they can choose good platforms to develop products on. Recommend Blockchain Course for Vietnam Devs is a great idea that can help developers have the opportunity to learn in-depth about the blockchain field that can help them access a great platform like Cardano so that they There may be product development opportunities on Cardano and startup opportunities on Catalyst. This proposal fits the challenge perfectly.", "q0r": 5, "q1": "Do Manh Hung, Do Viet Cuong and other team members are all experienced in the blockchain field and are especially knowledgeable about the Cardano network. With more than 20 years of experience in sharing knowledge and spreading fire, I believe that Do Manh Hung will help developers gain a deeper understanding of blockchain and the Cardano network. Information about team members can also be easily found by the community and connected when needed. I appreciate this very much. Risks that may affect the success of the proposal such as epidemics are also given a reasonable treatment plan by the team. I believe the community will also appreciate you very much.", "q1r": 5, "q2": "The 4-course roadmap given by the group is very complete and detailed in terms of time and place. This can make it easier for developers to get early access to courses. In addition, the use of the $22,400 budget is also very detailed and transparent. However, you need to give KPIs more clearly so that the community can easily measure them numerically. For example, after a successful proposal, how many developers will have in-depth knowledge of blockchain and Cardano? How many people are involved with Catalyst? I believe that if it is more specific in terms of numbers, the community will appreciate it a lot more.", "q2r": 4, "assessor": "z_assessor_2476", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 3522, "q0": "The proposers are developing and will expand on a property based testing framework that will make dApps more secure. For the non-tech people property based testing is a must in any development and helps you make sure you've covered not only the basis, but all possible scenarios as well. To simplify it even more, imagine testing the same property of a business over and over again with different parameters each time. This makes the chance of finding something wrong with your dapp earlier.\nIMO as a developer the proposal will have an impact over the community, because even though you can use other property based testing frameworks like QuickCheck as is mentioned, their usage is a bit hard, as I've tried them out myself. I'm in no means an expert in haskell development, but I do have an idea of how things work. The proposers do have a better solution for cardano developers specifically.\nThe targeted market seems legit to me, since they target exatly developers that are somewhat familiar with haskell already, so using a testing framework woudln't be as big a leap and even if you don't do haskel, the simplicity of the testing framework would help greatly. Using a framework such as this will give the dapp developers and their users the confidence necessary to launch and maintain a successfull project.\nI agree that the risks taken are low, considering they do have some of the work done already. Overall an impactfull proposal that is worth finishing.\n", "q0r": 5, "q1": "I've seen all the credentials I need. I've read quite a few of the blog posts of Ari Fordsham and have learned quite a bit from them, so this is someone that doens't need introduction for me. A great developer with a more-than-enough skillset to get the project to it's fruition. James Faure is the orther haskell engineer that has quite a large skills list including his own programming language compiler, which is as close to a rocket scientist as can be put in a non-technical terms. For me the project including these two devs has all the credability it needs to be successfull, and to any voters I can say not to worry about the possibility of the project not getting imlpemented.\nThere's a birds eye overview of the timeframe and milestones of the project, which seems reasonable to me, but there's also a good budget breakdown and plan for execution segragated into workable hours and the authors have put a buffer in their planning which I wish more proposers did.\nI do believe in MLabs and the fact they can take up the leader position when it comes to building frameworks and tooling for the whole cardano dev environment. I personally have used their tooling and can say with certainty that is up to par with what I expected. I'm happy to see them comming back and building even more for the community.\nI love the fact, the project will be open source, because this is greatly udnervalued in my oppinion. More minds are always greater in the general case, and softwarte isn't an exception and has a proven trackrecord. Overall a feasible solution for sure. I don't see anything missing from the proposal.\n", "q1r": 5, "q2": "There are good KPIs mainly the submision forms that will determine what's the adoption and interest in their courses and their work and in the blockchain development as a whole. The definition of success seems a bit vague to me though, because thousands of developers in vietnam being properly aware about the blockchain sounds great, but it's hard to measure, because there are no specific numbers to measure up against. My suggestion would be to have a specific number next time and strive towards achieving it, which would help to have better estimations and correct expectations for the future and a goal to strive towards.\nThe roadmap and milestones are doable in the timeframe specified, so no worries there. There's a clear and understandable solution and problems. I'd suggest to read though a couple of already funded proposals, because that really helps seeing what the voters are looking for in a proposal and help be more compelling when telling the story of vietnam blockchain devs. Overall an auditable project with a few small caveats as mentioned.", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 13993, "q0": "The idea to organize short-term blockchain study courses and the main objective for this proposal focuses mostly on Vietnamese programmers. As a VietNam citizen, I am gravitating toward this proposal with completely yes and no doubt about this. The course will offer such precious opportunities that Vietnamese programmers are able to learn and open their minds with new strange things they may observe through theory but not in reality. All the related knowledge like foundation absolutely, consensus mechanism used in blockchain, as well as the application of blockchain in reality, blockchain ledger structure, etc. are included in the course as well in order to ensure all participants can access knowledge from basic to most complicated, from beginner to an expert. Expert here means gain confidence when all the taught knowledge is to build an accuracy and full sight of blockchain. This course will also assist participants to be closer or explore more new job opportunities. In general, Cardano inhabitant reinforce the strength and development increasingly day by day while the number of Vietnamese programmers is also motivated to grow as well.", "q0r": 5, "q1": "Based on the proposal, these study courses are carefully planned and invested ideas, brainstorming all the necessary information before progressing. The proposer has described in detail the duration and content in each course and how many total courses will be organized. According to the description inside the proposal, there will be a quarterly course and involve the time from the third quarter of this current year till the beginning quarter. It would be a nice distance for participants to take time to remember and upgrade their knowledge of new “blockchain” from the course and also avoid being stuck with a huge number of complicated definitions due to studying in a short and continuous time. Additionally, the costs for renting expenses (meeting room, teaching tool, etc.) are included clearly in the budgeted plan and I evaluate those costs are reasonable (compared to the practical price in VietNam).", "q1r": 5, "q2": "The information of the course is published as well so that participants or people in Cardano’s community can discuss together about the possibility or reliability of the course whether they still feel suspicious. The proposer has attached the auditing information of the proposal together with the profile of candidates in the proposer group. They perform all of the needed information as well as the curriculum vitae of each member via Telegram to prove how truthful they are. On the other hand, we can make evaluation whether the courses are on the right “route” or not by making a comparison with the provided timeline that has been spotlighted which level can be considered as success. With all the presentation of this proposal, it would be predictable how crowded participants will join this event. The proposer will also make a list with collected number data and responses after each study course and provide a published report to Cardano’s community. ", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 14639, "q0": "Proposal is again with a challenge setting of the Cardano ecosystem in this round. It provides the right knowledge about blockchain and applies in real life to the developer community in Vietnam.\nOn the one hand, the proposal wants to provide the right knowledge, applications in the near year and more job opportunities in Cardano Blockchain to the crypto investors community in Vietnam to prevent scram blockchain projects. In the previous 5 years, they have had 1000 trainees join in by online course. Now, course counties open every 2 month with a tuition fee of 10.000.000 VND( ~ 400 USD), But they want to donate to free courses for all Vietnamese internships and then, there is a growing number of tailed developers devoted to The Cardano Platform. Secondly, the project brings a wide range of benefits for developers as well as the cardano ecosystem. In terms of developers, they have basic knowledge of Casanova blockchain and career opportunities and for cardano, it makes the cardano more popular and has many potential developers in Vietnam contributing. \nOn the other hand, the proposal realized that the outbreak of the pandemic of the Covid-19 will make the course unsuccessful. However, they gave a solution to solve this problem that they will teach online instead of offline through the Zoom platform. It is a good idea to set their goal without being affected by the Covid-19 pandemic. Especially, 1 positive is that the proposal has been auto-translated into English from another language because as you know, it is the era of global gathering and then, language plays a key role in finding investors, find foreign businesses to set their goal. ", "q0r": 5, "q1": "With my knowledge, the ideas stated in the proposal,the project totally reached their targets. The project listed detailed, transparent and clear contents to complete the 4 courses in Ha Noi and Ho Chi Minh City. Additionally, after finishing 4 courses, the project will report to Catalyst by a closed proposal. However, the proposal does not provide the number of trainees in each course, learning methods( face-to-face or online methods), lesson time,… As for finance, the proposal listed the budget for activities( such as hire lectures, document, digital marketing,..) was clearly presented in accordance with the previously set plan. On the other hand, the project has a professional staff with more experience and specialized knowledge in this field. They allocate to good work and are suitable for each position in the team. At the same time, proposal provided clearly actual time to achieve the goal and in the year 2023 will take to\ncomplete the project. Besides, this proposal will come back in the next round to expand markets, find potential customers to join in Blockchain courses and bring a wide range of talent Vietnamese developers to the cardano ecosystem. ", "q1r": 4, "q2": "The proposal described Measurement Tools to easily follow the development of the project. For example, they follow the number of new trainees by people who sign up for the form Blockchain Course or the impact of the course. Besides, The FIMI support team follows how many trainers take part in the Cardano through a voter, a PA or a proposer. However, the proposal does not provide a timeline on how to reach their goal and how long. At the same time, the Team also does not roadmap or key metrics to measure success of this project. In conclusion, I hold a belief that if proposals can fix and give solutions to solve the above problem, the success rate of the project will increase. This leads to there is a growing of a number of Vietnamese developers who have blockchain knowledge and more job opportunities in the Cardano ecosystem. ", "q2r": 3, "assessor": "z_assessor_4077", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Organize short training courses for developers in Vietnam to help them have the right knowledge about blockchain technology and its application in life.", "experience": "We are made up of teachers who are teachers and masters with many years of teaching experience. Together we dig deep and analyze blockchain projects."}