{"id": 414111, "author": "fimi.vn", "title": "Plutus Video Sub for Vietnam Devs", "url": "https://cardano.ideascale.com/a/dtd/414111-48088", "category": 26597, "amount": 13900, "description": "The scarcity of documentation on the Plutus programming language in Vietnamese makes it difficult for talented developers in Vietnam to access Cardano's resources.", "f6_no_assessments": 21, "f6_rating": 4.714285714285715, "videos": [], "media": [], "f6_assessments": [{"id": 13691, "q0": "Reading this proposal makes me feel there are some people really serious with what they are doing. The problem statement just catches my attention when it states a very realistic situation happening not just in Vietnam but also in many other developing countries. He mentions that the talented Vietnamese developers are prevented from reaching the Cardano sources due to the lack of Vietnamese Plutus programming language documents. I think the problem quite fits with the challenge for these reasons: supplying right documents to train developers is crucial as it is a way for them to approach new knowledge. Moreover, thanks to the suitable document they can access the Cardano ecosystem and contribute to our community. In my opinion, if we want to attract Vietnamese developers to build new dApps on blockchain Cardano and create values to make the Cardano ecosystem more diversified, we first need to make these Plutus programming languages accessible. In fact, one of the obstacles in training developers in non-native English speakers is the lack of solid understanding due to the language barrier. Therefore there should be pioneers in this field gathering together and help connect the developers with the right knowledge. Not just so, with the fundamentals of Vietnamese translation, there will be a wave of translations of this document into other languages at the request of the community of neighboring countries so I think this initiative is very promising. Having realized that, the proposers give out a solution which is to have their talented team translate IOHK’s pioneering Plutus course videos into documents for Vietnamese developers and I strongly believe that this is a practical solution to access a mass number of developers in this situation.  In order to train Vietnamese developers to be more qualified and effective, the proposers state that they will recruit people with specialized knowledge and test them with a specific test to assess their ability. Their professional test showed me that they do prepare for what they are doing and they will still stick with this project whether being funded or not. On the other hand, the points  like how the proposal affects the challenge and the risk could occur are described in very rich detail making me believe that they have deeply researched their work and will make it deliverable. I totally agree with the main rirsks they state which are the learning ability varies among individuals and the slippage of ADA. It is true that we are not the same in terms of consuming knowledge, some could learn faster, some could learn slowlier so their solution of creating a group to discuss and solve the questions about the lessons is practical; They also ask for a reserve fund to deal with the ADA fluctuation and this is a typical way to solve while we are all in financial decrease. For these reasons, I believe that this proposal deserves the maximum score in impact, its premise is extremely useful for Cardano and it can achieve the specific objectives of this challenge\n", "q0r": 5, "q1": "In terms of the viability, I consider the provided information to be quite comprehensive and illustrates what would occur throughout the project development process in great detail. We are aware that there are 4 quotas, the first of which begins in 2022 and continues until quota 3 in 2023. The milestones are appropriate when the first two quotas emphasize hiring and training in addition to translating and publishing, which, in my opinion, may help to maintain the caliber of the final products. When it comes to the activities that were described, this section is great because we already know that each quota will be allotted to them. I really appreciate how those tasks had explicit KPIs to hit, as it demonstrates the team's crystal-clear direction. For instance: ten translators, one technician, the total minute of translating is 1980 minutes. Moreover, the criterias to rate the translation are clearly described, based on that I believe we could control the quality well. Now let’s talk about the budget breakdown, the total amount is $13,900, accounting for 1.39% of the total budget.I assume it is a very fair price considering the size and complexity of this idea, and it warrants the financing because I believe it will really benefit Cardano. When the justifications for the money are broken down into tasks, they are quite gratifying. There are 5 tasks and each task contains the money to pay for each x with the specific minutes. Not just so, as I have mentioned before, there is a $1000 fund to backup incase of ADA slippage showing the careful preparation of the proponents.Overall, it completely satisfies our need to understand how the money would be spent. We now look into the team members, there are 2 professionals Do Manh hung and Do Manh Cuong beside the translation team called FIMI. Given that we are aware of the trio's professional credentials, complete confidence is conveyed in them.They have knowledge in the financial field, technology and programming. They are also the direct trainers about blockchain courses and the Cardano community managers. Their translation team showed me a strong experience in not only translation but also blockchain, especially Cardano one, they’re learning the Plutus Pioneer course organized by IOG.. With the tasks clearly assigned to each member, I think it is easier to control the resources and the products made. As I research, I figure out that this FIMI project used to be funded in Fund 7, they have other proposals and other more projects under construction for a long time ago. For example they have a Youtube channel with more than 15k subscribers, own their website and groups on Telegram with thousands of members. I just wonder if they can share a bit more about how they could manage their workload if there are other proposals and projects like that. In summary, there are many initiatives about translation but I found this one of the best among those because they convinced me by quantitative data and realistic evidence they have been making so I would rate a maximum point for this part.\n", "q1r": 5, "q2": "The project's supporters list four ways to track progress, including the creation of the KPIs mentioned in the preceding section: \"The number of videos released on the YT channel, the number of developers who interact with the Plutus program through videos, the number of reactions to each video on Youtube, and the total views of the published films.\" Their Youtube account makes all the data and information available to the public. In other words, all the methods for measuring, analyzing, and reformulating the project are described, making it crystal evident to the Cardano Community what should be prioritized as each project phase advances. Looking at the final results, the team explains in more detail what would need to be done in order to achieve similar results, such as the Plutus programming language being available for the Vietnamese dev community. They are returning to join the Plutus programming language learning exchange group.Yes, I think it's conceivable, I'm just suggesting a specific rate of increase in the number of people joining and discussing the group over a certain period so that we can have a wider view through the project.Since this is a continuation of their Fund 7 funded project with 3666 minutes of quality Cardano related videos, I believe this can again be measurable and with a high likelihood of success. I think the auditability of this topic is very accurate and provides us with all the information we need to safely go ahead with it.\n", "q2r": 5, "assessor": "z_assessor_3750", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2866, "q0": "I believe this proposal highlights the problem the community is facing in the following excerpt: \"It is challenging for competent developers in Vietnam to access Cardano's new initiatives and activities due to the lack of documentation on the Plutus programming language in Vietnamese.\" Therefore, this proposal was created to provide reliable resources on the Plutus programming language in Vietnamese for the community in Vietnam. I think this is a good and rewarding idea because Cardano's translation of documents from English can break down the language barrier, giving more people the opportunity to work on this platform and work on it. Beginners will not find it too difficult. Specific evidence for the above opinion is the link to a video about the Plutus language that has been translated into Vietnamese and the response of the community based on the interaction and ease of understanding of the content (https://youtu.be/gxqXTYGDwuU). In addition, although there were problems such as the ability to receive information from each person, this problem was also neatly resolved by setting up a chat group so that everyone in the community could answer each other's questions in the fastest way with diverse information sources. In other words, this is a great idea because it can meet the two main goals of the challenge: to make the Cardano ecosystem diverse and to attract the community to access this decentralized technology platform. Because more people know the Plutus and Cardano languages, the buying of ADA will increase, smart contracts will grow, and there will be more potential future Dapp projects with smart investors. As a result, I think this plan merits the highest effect rating possible. From the standpoint of a commentator, I'm a little curious about how the suggested topic would prevent being copied by others and misrepresenting it for harmful objectives, like defrauding the community.\n", "q0r": 5, "q1": "The proposed route is described quite reasonably. I can completely determine what activities will happen when and specifically for how long. In addition, the proponent also wrote down the goals to be achieved in each timeline, such as: needing 20 videos to be translated into Vietnamese by the fourth quarter of 2022, with a total time of more than 400 minutes. With the Youtube link (https://www.youtube.com/channel/UCoyi5FmVh6aFY2pWM0EI8Vg), I can easily check the completion of the proposal's goals in minutes with some simple math. Financially speaking, $13,900 is not a little sum, but it seems appropriate given how intricate the idea is. The project owner is to give a fairly clear expenditure statement divided into several sections to explain the need for a large capital. For example, $2000 for the IOHK Plutus Pioneer Program brochure, $7920 for the translation, with a total duration of 1980 minutes,... However, I think a few small explanations are still needed for each item to make it easier to understand and rationalize the amount stated. Even though there are still a few spots where the details are lacking, I believe that this group's financial resources will be properly protected. Speaking of personnel, I believe that a team of about 20 translators with a deep understanding of the Cardano chain and 2 leads with expertise related to the proposal will accomplish the main goal of the project well. I am aware of everyone engaged, including their names, skills, and previous experience. Furthermore, the unique part is that the two founders are from very diverse professions, thus the presentation, translation, and correctness of the content are all very well ensured. I also received a link to verify the identity of the project owner (Mr. Do Manh Hung: https://t.me/Hung_DoManh). In addition, an increase in the number of interpreters is possible if the community is expanded and the need to access Cardano, the Plutus language, is increasing for personal development. Besides, there is a question that is based on which criteria and tests can determine the knowledge level of translator candidates. My only suggestion regarding this project is that a few more professional interpreters should be provided so that everyone can check their translation experience and achievements. This will increase the accuracy of the translation. project reliability and feasibility. From the above, although there are some points for improvement, they are not significant. I believe that the feasibility of this project reaches a perfect score.\n", "q1r": 5, "q2": "Referring to the successful progress of the proposal, I get a few specific metrics, such as: the number of videos posted, views, and comments. These metrics are easily visible on the project's Youtube channel, but I don't have an idea of specific numbers, so I can't consider how successful the project's progress is. So I suggest giving a specific number so that everyone won't have to wonder when assessing progress (for example, a successful project in terms of spreading Cardano to the community is when the videos reach 1000 views). The success of the project is related to the problem of the challenge, which is well described by the fact that the community of Plutus language programmers will expand with the growth of Dapp projects and the popularity of the Cardano platform among the community of Vietnamese. However, my advice is to have a specific file to illustrate the increased number of programmers and projects related to the Plutus language after the project so that we can easily assess the actual success of the project. Moreover, how will this result file be published to the community? Is it posted on Google Drive or the community Telegram channels? In addition, for a previously funded proposal (funded in Fund 7), I believe project transparency is reflected in the metrics that have not been neatly aggregated from the test product before. Therefore, this proposal deserves to be clarified for the Cardano community in Vietnam so that everyone can actively participate and upgrade their knowledge. Although there are some shortcomings to make transparency more obvious, I believe the proposal is still worthy of appreciation in this respect.\n", "q2r": 4, "assessor": "z_assessor_2354", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12463, "q0": "The proposal fully meets the challenge to develop the developer ecosystem. Along with the amazing development of blockchain technology and crypto in recent years, the need to learn programming languages ​​​​of major blockchain ecosystems like Cardano is also increasing. The Vietnamese developer community is also tending to gradually switch to blockchain technology because of many potential benefits in the future. According to the most recent survey, the number of programmers in Vietnam is about 430k, which is not a small number compared to the number of programmers worldwide (~ 26.9 million in 2021 according to Evans Data Corporation report). But currently, there is a barrier named language that makes it difficult to access new programming languages ​​like Plutus. Sometimes it also leads to misunderstandings, and incomplete understanding of knowledge causing a lot of time wasted in learning. Therefore, creating subtitles for programming tutorial videos is a very good idea and solves the outstanding problem for Vietnamese developers to contribute to the building and development of the Cardano developer ecosystem.", "q0r": 5, "q1": "The proposal is totally feasible. In terms of solutions, the proposal to solve the real problem that Vietnamese developers are facing is the language problem. In Vietnam, there is a fact that the developers are good at their expertise but their language is not really good, and vice versa. So writing subtitles for video tutorials to learn Plutus programming is a very good idea. Regarding the team, the members of the project team have many years of experience with blockchains such as Mr. Hung and translation experience. They have a team specializing in translation called the FIMI Translator team. Therefore, the implementation of the project is very easy and feasible. The budget breakdown is clearly planned and detailed. One small point, the proposer should divide the budget by anecdotes as the roadmap has given, it will have an overview and be easier to calculate.\nI really hope the project will be successful", "q1r": 5, "q2": "This project can be easily auditable. According to the roadmap that the proposer has provided in full and in detail. The project will be implemented in four phases of three months each until the end of the third quarter of 2023. We can rely on quarterly metrics such as the number of translators, the number of translated videos, and the duration of the videos to evaluate project progress and KPIs. In addition, the project team will post videos on the youtube platform, so we can also rely on the number of views, comments, and subscribers to assess the impact of the project on the community. Overall, this project is outlined for audibility.", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12388, "q0": "The issue this proposal brought up is the lack of resource and documentation on Plutus available in Vietnamese that can be used by developers that are only fluent in Vietnamese. The proposed solution is to allow more resources available in Vietnamese by translating IOHK’s Plutus Pioneer Program video into documents available in Vietnamese. The translation will be done by recruiting people with good translation skills and knowledgeable in the field using test (links provided in the proposal). The translation works will be judged by its accuracy, efficiency in delivery, level of interest regarding the translation works, and outreach. This proposal is aligned with the challenge settings main objective of “more developers would be drawn into Cardano” by giving avenue for developers in Vietnam to access resources regarding Plutus to make products (i.e. dApps) in Cardano and in turns attracts new developers to widen the outreach as well further the innovation and adoption of the Cardano ecosystem. ", "q0r": 5, "q1": "The team consists of a QA for the translation works that will be done who also has participated in the Plutus Pioneer Program and lecturers of the translation team, a video producer and project manager, as well as the FIMI translator team that has taken or are taking the Plutus Pioneer course by IOG. The team has worked on translating videos about Cardano in the past Fund7 and their work has been linked in the proposal (hyperlink attached to the FIMI translator team). This shows that the team member has the relevant skills that are needed to implement this project. \n\nThe proposer provided a well laid out roadmap for the implementation of this project. The project will be implemented in the span of 12 months divided into 4 quarters starting in Q4 2022 with every quarters having the milestone of publishing 20 videos (~20 minutes each video) with Vietnamese subtitle. It also goes over the 10 translators and video publisher recruitment process. With every quarter having the target of 400 minutes worth of video translated and 10 people doing the translation, the roadmap seems feasible since the timeline and key milestones have been laid out well. \n\nThe budget of 13900 USD has been requested for this project and has been broken down into several items, such as the fee for translation (rate: 4$/minute) and video editing (rate: 1$/minute) with the total video runtime of 1980 minutes which lined up with the proposed plan in the roadmap. 1000 USD each have been requested for consulting fee and backup funds in case of budget overspend. However, I’d have liked more details regarding the budget for brochure which comes out to 2000 USD. Information such as the amount of brochure and cost of each brochure would have been helpful in cross checking this particular budget allocation. I think the budget has been broken down quite well. \n\nOverall, I’m in agreement over the feasibility aspect of this project since the team members involved in this project have the skills needed, the budget has been broken down in details, as well as having a well laid out and realistic roadmap for the completion of this project.", "q1r": 5, "q2": "The KPIs chosen as a way to measure the success of this project include metrics such as “number of translated video published”, “number of developers accessing the Plutus program through video”, as well as the engagement on Youtube videos (views, comments, etc.). The metrics chosen by the proposer were well defined and relevant to measure the success of this project regarding the working efficiency of the translation teams (via the no. of published work), the outreach it has (via views metric), as well as the quality of the translations (via the viewers response in comments). The Youtube channel can be viewed publicly so metrics such as views can be tracked easily. However, since the recent change of the platform where the dislike is only available to the creator, I’d have preferred if the proposer provided a way to provide metrics such as like to dislike ratio in a report since viewer response in Vietnamese (which is the primary audience) will be hard to track for community members that aren’t able to speak Vietnamese. Overall, I think the KPIs have been chosen well and are relevant so I agree with the auditability aspect of this project.  ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11347, "q0": "Proposal fit the challenge\nThe suggested solution is:\nRecruit people with specialized knowledge and good translation skills in the community with the test https://fimi.vn/kiem-tra-blockchain/ for the best quality translations.\nTranslations will be evaluated according to the following criteria:\nAccuracy\nTimeliness\nExciting\nSpread\nall criteria are clearly indicated by the proponent.\nThe uniqueness of the solution and the value it brings to the cadano ecosystem is:\nGet access to correctly translated videos.\nGet a chance to become a developer of the Plutus programming language.\nOpportunity to exchange and discuss to develop yourself\nGo to the Cardano Ecosystem and This Challenge\n\nAttract Vietnamese developers to build new dApps on the Cardano blockchain.\nDevelopers will contribute their products to the Cardano ecosystem to make it more diverse and sustainable.\nThe proposal also introduces two main risks that are:\nThe self-learning ability of each programmer is not equal.\nSlippage of ADA.\nThe solution to overcome the risk proposed by the proponent is:\nForm a group to exchange, discuss and learn together and Request a contingency budget.\nI would like to add some comments that the proponent needs to be more specific about how the group will learn and what knowledge should each individual learn in addition to the group study to make the learning time more enjoyable. should be as fast and as effective as possible.\nRegarding the reserve budget, besides the catalyst fund, can we call for capital from somewhere else, if the ADA price falls sharply, the proponent will continue to implement the project without and with any capital source.\nI see this project as suitable it benefits the cadano community", "q0r": 5, "q1": "the proposal outlines a specific detailed plan to successfully implement the objectives on a quarterly basis.\nIn addition to this proposal, the proponent is also working on a proposal funded by Fund 7: Translator Community Rewards and is underway.\nwithin this fund the proponent is also requesting 6 new proposals such as:\nBlockchain Course for Vietnamese Devs.\nMarlowe Course for Vietnamese Directors.\nCardano Talk is for Vietnamese people.\nCatalystTalk: Developing DRep Vietnam.\nCatalystTalk: Developing Vietnamese Devs.\nPlutus Video Sub for Vietnamese Devs.\nEach proposal has a clear assignment to each participant, committed to ensuring that proposals are completed on time.\nIn the event that someone doesn't get the job done for a long time, the proponent will recruit available members of the community to ensure the proposals are completed on time.\nI appreciate how to use resources from the community, it creates an advantage of taking advantage of talented people willing to devote to project development, and also spreads to the community a deep understanding of cadano. On the other hand, I also want the proponent to provide specific criteria in the recruitment of human resources so that the community can have a better overview of the experience and understanding of the proponent.\n The proposal has broken down the budget into pieces that are easy to achieve the goal.\nwith a project development team that has extensive experience and deep understanding of the Cardano blockchain and has extensive experience in translating blockchain documents.\nTheir finished videos are being enjoyed by the Cardano Vietnam community.\nMany of them have or are still taking the Plutus Pioneer course organized by IOG.\nand translations, videos are moderated by the proposed topic before being published to the community.\nThe proponent has publicly provided links, documents, and telegrams about the project owner with verified images.\nI believe this proposal is perfectly viable.", "q1r": 5, "q2": "The information and project implementation progress are presented in a transparent manner with links to previously proposed projects for easy reference and comparison.\nThe specific metrics proposed by the proponent are as follows:\nNumber of videos published on Youtube channel. This metric means the amount of work completed.\nNumber of developers accessing the Plutus program via video.\nNumber of responses for each video on Youtube\nTotal views of the videos\nThe auditability of the proposal is clear, the success of the proposal is that the Vietnamese developer community has access to the Plutus programming language.\nDevelopers' interest and participation in the Plutus programming language exchange group increased over time.\npropose to have sustainable development goals and expand community access and understanding of Cadano\nThe outcomes they aspire to are Quality Assurance, Inclusive and Equal Education, and Enhancement of Lifelong Learning Opportunities for All,Building Sustainable Infrastructure, Promoting Open Industrialization, and sustainability, and encourage innovation.\nI agree with the idea that the proposal brings.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 10555, "q0": "In my opinion, “Plutus Video Sub for Vietnam Devs” is a good idea and meets the challenge of “Developer Ecosystem”. The proponent raised an important and quite interested issue, which is: “The scarcity of documentation on the Plutus programming language in Vietnamese makes it difficult for talented developers in Vietnam to access Cardano's resources”. I agree with this opinion, because Vietnam is a country with an abundant human resource market, focusing on developing many industries, in which information technology and programming languages ​​are fields has great potential. However, at present, there are still many cases where Vietnamese developers are having difficulty finding documents to study. Searching for documents in Vietnamese sometimes can't be found by developers or if they are, they won't have as many data sources and diverse content as documents in English are a common language. This will affect the research process and the work efficiency of developers. Therefore, translating IOHK's pioneering Plutus course videos into documents for Vietnamese developers to easily access and learn, I find very reasonable and necessary. The proponent has given the criteria for recruitment which are people with specialized knowledge and good translation skills. The quality of the translation is also given by the proponent with criteria related to accuracy, timeliness, interestingness, and spread. Moreover, IOHK company is a familiar company for many people, this is a leading Cryptocurrency research and development company, and they focus on building technology solutions to promote the development of the financial sector. Therefore, I think that translating IOHK's course videos for documentation will help Vietnamese developers have a reliable and quality data source. If this proposal is successfully implemented, it will not only have a positive impact on developers such as helping them get access to accurately translated videos, and have the opportunity to socialize and develop themselves, but also influence Good for the Cardano ecosystem because it can attract Vietnamese developers to contribute their ideas, thereby making the Cardano ecosystem more and more diverse. The solution proposed by the proponent identified most of the problems of the challenge. By presenting the actual situation to emphasize the impact of the problem. To successfully implement the project, the proponent also anticipated the risks. There are two main risks given that are the self-learning ability of each different developer and ADA slippage. Each risk has associated remedies. I think that this detailed and thorough preparation will help the proponent proactively deal with difficulties and limit risks.\n", "q0r": 5, "q1": "The proposal has a detailed action plan and a specific timeline. The implementation process is divided into 4 quarters, starting from the fourth quarter of 2022 to the end of the third quarter of 2023. Each of those milestones has been set with very clear goals and tasks as well as the results to be achieved. The process of all 4 quarters is mostly iterative, so it is easy to track and check. However, in my personal opinion, if possible, the proposed team should have a smaller timeline, such as monthly. The work of a quarter will be broken down by month, it will be convenient to control time and quality, ensure that the implementation time is always in the plan, and avoid letting a small segment deploy too long will affect the progress and results of that quarter. For example, the fourth quarter of 2022, still includes 4 tasks as mentioned in the proposal, but the recruitment and training of translators or technicians are only fully mastered in the first month, the remaining 2 months will focus on translating and publishing videos with Vietnamese subtitles. Regarding the budget, the team also provided a detailed and reasonable allocation plan and the intended use of each part of the budget. However, based on this plan, I see that the translation portion is 1980 minutes x 4$ = 7920$. Is this part of the proposal including the human cost of translators and other resources to serve the translation of documents. In my personal opinion, this part, if possible, should be divided into 2 different expenses, it will be clearer. Moreover, the cost to pay for the translators, the group will plan to divide equally or will be based on any criteria. I think that this part of the human cost should be evaluated based on the work completed and the quality of each good or excellent translation, thereby encouraging the spirit and enthusiasm of the translators. Similarly, video editing and publishing need to be separate for each technician, or the cost of each published video. The plus point of this budget plan is that the team has set up a slippage of the ADA reserve fund, I think this is reasonable and necessary because the market always fluctuates daily and hourly, so this risk cannot be avoided. This preparation will help the team always quickly and flexibly deal with unexpected situations. The participating team includes Mr. Do Manh Hung, Mr. Do Viet Cuong, and the FIMI Translator Team. Their identity information is easy to verify via youtube channels and other social media. I believe that with the experience of the teacher and the team, the probability of success of this project will be enhanced. The group has had proposals in previous funds and also has funded proposals. The team also confirmed that if this proposal is funded, they will continue to do it in the next funds because Cardano is a potential ecosystem, always creating many opportunities for everyone and having influence widely.\n", "q1r": 4, "q2": "In order to measure the progress and success of the project, the proponent has provided criteria and indicators to evaluate, that as the number of videos published on the Youtube channel, the number of developers accessing the Plutus program through video, the number of responses of each video on Youtube, the total number of video views. The success of the project is also clearly defined, by the fact that developers have access to the Plutus programming language, and their interest in and participation in the Plutus programming language exchange groups. This proposal is a continuation of the one that was funded in Fund 7, they translated 3666 minutes of the videos and have a link for everyone to access and check. Thereby, I see that the auditability of this project is relatively high. Along with the experience and resources that have been prepared from previous funds, this will be an advantage for the team to implement this proposal.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10096, "q0": "The proposal to solve the current problem is that the language difference is a huge barrier for potential Vietnamese developers to come to Cardano, there are no documents on the Plutus programming language in Vietnamese. This proposal effectively addresses Cardano's goal of preparing a group of people who are willing and able to contribute to the ecosystem, and also solves the challenge in this Fund 9 Developer Ecosystem. I think the proposal will have a very positive impact on the Cardano and Catalyst ecosystems as it will bring in a number of potential and knowledgeable people to be able to create Dapps. The KPIs are also compatible with this challenge at Fund9, the goal is to recruit qualified translators and publish 80 videos with Vietnamese subtitles in the next 4 quarters. However, I have a small suggestion, the proponent should add 1 KPI to the measurement, which is how many accounts/visits these videos are expected to have, this is a very important indicator to measure the success of the project because we can create professional videos and translations, but if it reaches a small number of viewers, the project will not have a big impact. I also think that the proposal can solve the next challenges in the future when it is possible to expand the number of users and developers for Cardano.", "q0r": 5, "q1": "The project is implemented by 2 main members, Mr. Do Manh Hung and Mr. Do Viet Cuong, together with a team of FIMI translators. These two members both have extensive experience in education, community management, video, translation and inspiration, which are valuable and necessary experiences to be able to run the project successfully. However, with this amount of information, I think it is still not reliable enough. The proponent should give more detailed information about these two members through reliable traditional information channels so that the community can contact and follow.\nThe proposed budget is 13,900 USD, divided into 5 main categories which are very clear, specific and reasonable and capable of achieving the set target.\nThe proponent also presented very clearly the project implementation plans, divided into 4 quarters starting from the 4th quarter of 2022, each quarter will release 20 videos with Vietnamese subtitles with the length of 400-500 minutes, we can track the progress of this implementation through the actual videos released. The team of FIMI interpreters and video publishers are carefully selected, experienced and available through funds. I have also been following the FIMI community for a while and found them to be very professional, punctual, methodical and enthusiastic. This is an important factor in helping them run this proposal successfully", "q1r": 4, "q2": "The proposal provided a very specific Roadmap which is capable of achieving the target. The KPIs are also clear and the definition of project success is also very realistic and measurable, but as I mentioned in the impact section, we should consider adding 1 KPI: the number of accounts/visits for these videos to reflect the project's goal: to give developers the opportunity to approach and learn with Plutus in their own language.\nAlthough the proposal does not specify how the community can monitor the progress of the project, I believe that the reputable FIMI community in general and the videos posted on their platform are the basis for us to see if the project is in operation or not.", "q2r": 5, "assessor": "z_assessor_3153", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 10003, "q0": "Learning Plutus in Vietnam is difficult, the documents about Plutus in Vietnamese are not common, the problem in the challenge proposed is to be suitable for the challenge setting. The proposed solution is to compile videos of IOHK's pioneering Plutus training program. The proposal is really great when made, We will learn about Plutus through the videos translated in Vietnamese, will no longer worry about the limitations of English. In addition to learning, there will be connections between exchange developers learning knowledge on video, combining the implementation of dApp construction, writing smartcontracts. The proposal makes a major contribution to providing quality developers, building good projects for the Cardano ecosystem. The developers' awareness is a difficult factor in plutus learning, the proposal already has a solution that makes up the learning team is suitable for implementation. Proposing a contingency budget due to ADA slippage affecting project funding is an appropriate solution to ensure the source of funds for the implementation of the project. I have an opinion on the implementation of translation of videos that will be the risk that could have a major impact on the success of the proposal. Performing translation requires a selection of languages suitable for Vietnamese, blockchain specialized words need to be noted in the description so that developers can study more deeply, having an impact on better learning.\nRating: 5\n", "q0r": 5, "q1": "The implementation plan details, the work of recruiting members to participate in translation is through Fimi's Test, the number and time of the video has been planned by the author according to specific timelines. The proposal has a YouTube channel with a large number of viewers and followers, an impressive YouTube channel that improves the success rate of the project. Members implementing the proposal have complete information proving the capacity to successfully implement the project. Fimi's team of translators translated and published videos of Cardano at F7 so there was no difficulty in implementing the current project. There are quite a few proposals being proposed by the author, which can affect the implementation of the plan. The author has made commitments on the progress of the project, having a clear assignment of each member will not affect the implementation of the plans. The recommended amount of $13900 with a rate of less than 10% of the funding for the F9 challenge is appropriate. Looking at the budget table given, we see that the payment to the translator is calculated very accurately, the amount spent on the brochure promoting IOHK Plutus's pioneering program is clear, there is already a source of preventive funding for the risks. The budget analysis of the proposal is suitable for implementation.\nRating: 5\n", "q1r": 5, "q2": "The roadmap for the implementation of the project with a timeline of 3 months will publish 20 complete videos is an impressive number that shows that the proposal is performing as promised. It's easy to see the number of 80 videos provided to the community during the 1-year implementation of the proposal. The index/KPI proposes to identify the work being done through information such as: the number of videos posted on Youtube, Views, the developer's interactions with the content of the video. The implementation of the audit of the proposal is quite clear, however we would like to know the results of the video's WATCH MINUTES, as this will properly assess the learning of the developers, which shows the quality of the videos posted. The implementation of the implementation roadmap report and the index/KPI for each video, each stage of implementation is necessary and has been committed by the author. The success of the proposal is the community's acceptance of the posted video, there will be positive feedback from the Cardano community about it.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 9584, "q0": "\"The problem is the lack of Plutus documents in Vietnamese. Plutus is still relatively new, and few developers are proficient in using it. This restricts developers using Plutus from implementing projects.\nThe product creates videos that have been translated into Vietnamese subtitles. Limited to one country is Vietnam.\nProposal to solve the challenge posed. Helps attract developers to join the ecosystem. Motivate the participants to study and ponder the Plutus literature.\nThe problem proposed by the proposal meets the challenge, and the solution solves the problem, so I give it 5 points.\"", "q0r": 5, "q1": "\"The solution to the problem was Translate IOHK's Plutus course videos into documents. Based on these documents, developers can easily access and use Plutus.\n The project mentioned two risks. (1) The risk comes from the developers' inability to learn evenly. (2) Risk of ADA slippage. The solution they came up with was to form a learning group for the first risk. This solution solves the risk well. The solution Requests a reserve budget for the risk of slippage. In my opinion, the second problem the group raised is not a risk. When they receive funding, they can immediately convert to fiat for operations, avoiding price slippage. Unreasonable reserve budget requirements.\nThe implementation plan is given for one year with four timelines. Each timeline corresponds to a quarter. Starting in Q4 2022 and ending in Q3 2023. Each timeline has specific tasks and volumes. Specific workload such as the number of minutes the video is translated, the number of videos published, and the number of members trained.\nThe team consists of 2 people. Mr. Do Manh Hung has experience in Finance, Community Management, Plutus Pioneer, Influencing and Inspiring Coaches, and Lead Instructor of Fimi's Course. And Mr. Do Viet Cuong has experience in Community Management. as a HighSchool teacher, Video producer, and Translator team leader. And especially the team, including Fimi Community: Established for more than five years with 120 videos, more than 15 thousand subscribers, 554,000 views, and more than 138,000 watch hours.\nI joined the Fimi community, and I noticed that: Enthusiastic team, a vibrant community, and lots of content posted daily. \nAccording to the decentralization, I see that the jobs are divided clearly and appropriately for the members.\nA good plan and strong team can execute the proposal well. So I give 5 points.\"", "q1r": 5, "q2": "\"The budget breakdown is based on the translation fee/minute of the video. And other fees such as marketing, consulting, and ADA slippage provision. Budgets are clear, purposeful, and properly distributed. However, as I mentioned, this provisioning for slippage is not necessary.\nSuccess metrics are clearly stated. Measurable metrics are:\nThe number of published videos on youtube.\nThe number of responses per video.\nThe total number of views.\nHowever, there is no way to measure the number of developers accessing the program via video.\nThe KPIs are specified in the plan, and the metrics are easy to check through the project's youtube channel.\nThe proposal has been funded and implemented in the translation project from fund 7. In addition, fund 9 also has six new proposals. They mentioned that in the presentation and had a reasonable arrangement of personnel, time, and cost for each proposal. I appreciate this honesty and neatness.\nThe project overview gives good indicators and is easy to measure and check. I give 5 points.\"", "q2r": 5, "assessor": "z_assessor_3067", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9565, "q0": "“Plutus is a new programming language, so few people know about it in Vietnam. Moreover, the language in the videos about the Plutus course is English, so it is even more difficult for Vietnamese programmers to access. Your suggestions on translating IOHK's Plutus courses are much needed.”\n“The popular Solidity programming language has allowed the Ethereum platform to flourish. Similarly, the Cardano ecosystem will flourish as more programmers know the Plutus programming language. Vietnamese programmers are in dire need of Plutus course videos translated into Vietnamese by you to participate in the value chain brought by the Cardano platform. They will be the pioneers in developing the Cardano ecosystem.\n“Self-study is an important factor to receive new knowledge. Identifying the risk of uneven self-learning among programmers is essential. Your risk management solution is to create a group to exchange and learn in a group is possible. In addition, I also agree with the risk of slippage of ADA and the need for a backup budget.”\n", "q0r": 5, "q1": "“The plan can be implemented in 4 quarters, in each quarter each part is elaborated in detail. This is a serious plan. The team has successfully written 1 for export and is now doing very well on it. I am confident the team will continue to be successful with the new proposal.”\n\"The budget table is reasonable. The costs are allocated to each job.\"\n\"The people working on the project have provided full details. Those are people with full skills and experience in the fields of community management, blockchain technology, and lecturers.\"\n", "q1r": 5, "q2": "“Measurements that are deemed appropriate can serve as a basis for monitoring project progress.”\n“You give the level of success of the project in general without specific quantitative indicators. You need to give about how many Vietnamese programmers have access to the Plutus programming language. Through this index, the community can assess what the success of the project looks like.”\n", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9132, "q0": "\"The proposer has identified the problem that potential Vietnamese developers face because of the lack of documentation on the Plutus programming language in Vietnamese. Therefore, the team will translate IOHK's pioneering Plutus course videos into documents for Vietnamese programmers to easily access and learn. This helps build a team dedicated to the Plutus programming language and they will be able to leverage Cardano's resources.\n\tTo get quality translations, the team launched a website to recruit people with the knowledge and skills to translate translations that meet criteria like accuracy, timeliness, interesting, and spread.\n\tThe team's solution will help developers view the translated videos in an understandable way and learn the right way to become a developer in the Plutus programming language.\n\tAt the same time, those developers will also be the ones to create more new and better Dapps to help the Cardano blockchain grow stronger. This proposal is quite suitable for the challenges presented.\n\tEach developer's ability to self-learn is different, so it's a good thing that the team offers a way to set up a group to exchange, discuss, and motivate.\n\"", "q0r": 5, "q1": "\"The proposal has a clear plan with milestones and in it is the work to be done along with detailed numbers to be achieved. The team already has a funded proposal in Fund 7 and this round they have up to 6 new proposals. However, each of their proposals has a clear assignment for each participant so they are very sure of the completion of each proposal.\n\tIn addition, they have a force in case someone can't finish for a long time, they will replace someone else and finish on time.\n\tAs for the cost, they clearly set out rates that match the amount of time it takes to get the job done and other fees.\n\tKey people in the project like Mr.Do Manh Hung with Haskell and Plutus experience will be the ones to check the most accurate translations and Mr. Do Viet Cuong is responsible for selecting the original videos with the right knowledge to give to the translation group. They also have a translation team named FIMI consisting of 20 people with a deep understanding of the Cardano blockchain that will participate in the translation process. Their translations have been very well received by the Cardano Vietnam community.\n\tActually, I also have a little suggestion that if possible, the team should include a link to the information of the project leaders so that the community can better understand the group's experience.\n\"", "q1r": 4, "q2": "\"The team will measure the completion of the project through the number of videos that are successfully translated and uploaded to youtube. Through the number of Vietnamese people watching the video, interacting with the video, and the number of people participating in the Plutus program course, they will know how successful the project is.\n        The team gives more about SDG rate as they implement the project based on Goal 4: ensuring quality, fairness and always improving learning for everyone. There is also Goal 9 which is to build a solid knowledge base, promote industrialization and continuous innovation.\n\"", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8773, "q0": "1. Propose translations of IOHK's pioneering Plutus course videos into documents for Vietnamese programmers to easily access and learn. It forms a group of developers using Plutus , a kind of programming language. The problem presented to the Challenge and solves many of the Challenge's questions. Proposal may scale to everyone in the future. Proposal to increase people's understanding in the future about Cardano. The project recruits people with specialized knowledge and good translation skills in the community with the test https://fimi.vn/kiem-tra-blockchain/ for the best quality translations. The translations will be evaluated according to the following criteria:Accuracy : Based on fidelity to the original Timeliness : Based on the delay in translation compared to the original messageInteresting : Based on the content of viewer feedback. The solution will help to get access to correctly translated videos.A chance to become a developer of the programming language Plutus.A chance to exchange, discuss to develop yourself and attract developers Vietnam builds new dApps on the Cardano Blockchain. Developers will contribute their products to the Cardano ecosystem to make this ecosystem more diverse and sustainable.. Create trainings Plutus as a presentation. Rigorous reasoning and matching Challenge. Risks: The self-learning ability of each programmer is not uniform and Ada's price slippage. Form a group to solve together and have a backup plan... \". I rate 5 point", "q0r": 5, "q1": "2.\" Proposal is implemented in 4 quarters from 2022-2023. The timeline is reasonable and easy to understand. The goals are specific and detailed about Plutus for the Devs. The number of videos published on Youtube channel This metric means the amount of work we have completed.Number of developers accessing the Plutus program via video.Number of responses to each YouTube videoTotal views of the videos. fundraising accounts for 1.39% of the Challenge Budget plan to spend as follows:IOHK Plutus Pioneer Program Brochure: $2000\nTranslation: 1980 minutes x 4$ = 7920$\nVideo editing and publishing: 1980 minutes x 1 $ = 1980 $\nConsulting fee: 1000$\nADA slippage provision: $1000\nTotal claim: $13,900. 1000$ for ADA slippage. 2 key members and team of translators Fimi. Tasks are allotted very specific. The experience of the members is very specific and suitable for Challenge.Identity verification at Linkedkin and Youtube.", "q1r": 5, "q2": "3. \"The number of videos published on the Youtube channel. This metric means the amount of work that we have completed.\nNumber of developers accessing the Plutus program via video.\nNumber of responses for each video on Youtube\nTotal views of the videos. You can watch the amount of videos on Youtube... The Vietnamese developer community has access to the Plutus programming language.\nThe interest and participation of developers in the Plutus programming language exchange group increased over time.. Success is related to the Challenge.. A test run on Youtube is available.. Recommended is version after being successfully received in Fund7.. Proposal regarding the present . Proposals will receive 50% voting ratings..\"", "q2r": 5, "assessor": "z_assessor_3001", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 8447, "q0": "The Plutus programming language doesn't have a lot of Vietnamese documentation, so this proposal suggested turning Plutus course videos into documents that Vietnamese developers could easily access and use to learn. Since the course is in Vietnamese, this course will make it easier and more appealing for Vietnamese developers to join and learn more about Cardano and how to build apps on Cardano. So, this proposal could be seen as an answer to the challenge's question of how to get developers interested in Cardano. It makes sense that the team chose to translate videos from IOHK's groundbreaking Plutus training program based on a number of factors (Accuracy, Timeliness, Interesting, Spread). There is clear talk about risks and how to deal with them. All of these things show that this solution will have some effect on how quickly the Cardano grows.", "q0r": 5, "q1": "They have established a clear schedule, complete with milestones, in order to carry out the project. In terms of the team members, they submitted information that demonstrated their capacity to successfully manage the project. This information included details about the key members' experience in the field of translation as well as their knowledge of Blockchain.\nI believe that the proposal should include additional information on the method of attracting people to come and learn from these Plutus videos in order to make the project more feasible. This may be accomplished by providing more information about the marketing strategy. In addition, if the budget is broken down into monthly tasks, it will be much simpler for me to determine how much each phase of the project will cost.", "q1r": 4, "q2": "The KIPs that were presented were consistent with what had been discussed earlier on the plan. They are measurable and straightforward in order to monitor the development of this project. It is my opinion that it would be beneficial for the team if they could establish goals that they are expected to attain as a consequence ( specific number of views, number of new developers,...) Because of this, it will be much simpler to determine whether or not the entire project was successful.\nIn the end, I have confidence that the team will be able to accomplish their goal of effectively completing this project. In the event that this turns out to be the case, there will be an increase in the number of Vietnamese developers who participate in the Plutus programming language community.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8069, "q0": "This proposal fits very well with the challenge in Vietnam (where there are very few programmers or software developers who are fluent in English).\nIt will make it easier for developers to access Plutus, which in turn will attract more people to develop their products using Plutus.\nAnd so it will be a place to provide new human resources for products developed using Plutus and especially products on the Cardano network.", "q0r": 5, "q1": "I like this idea of ​​the author presenting this proposal because the presentation is relatively clear and it solves a practical problem of the developer community in Vietnam. In fact, they have translated articles to help the community access Plutus before this proposal was made, but due to objective reasons such as insufficient qualified human resources, financial shortage, etc. Therefore, the number of translations or knowledge provided is not much. However, the main risks of the team are unconvincing because of the important risks such as the translation team not having enough programming skills to translate the correct terminology,... A funding cycle of 12 months is feasible, the projects the identified funding milestone is relatively convincing, indicating thoughtful planning. And the group has other proposals that are related to this proposal, so the feasibility is high. And the team clearly has the relevant skills and connections to be able to realize good translations for the community. Regarding the budget, I still see some ambiguities in the allocation as to why \"Editing and publishing video\" is as high as \"Translation\" and why the pay per minute varies so much. Also, on the issue of future funding rounds - I would like to see a clearer direction, but right now it still makes me unclear. Although there are still problems as above, in general, the proposal is clearly feasible.", "q1r": 4, "q2": "The proposed audit metrics are auditable, easily measurable, and transparent. The number of videos released is countable and it is known the quality of the translation as well as the duration of each video. And I like the inclusion of metrics on \"The number of developers accessing the Plutus program through video\" or \"The number of responses to each video on Youtube\" or \"Total views of the videos\", which will show the relevance of the video to the community as well as the quality of the response from the community. While there are still budget allocation deficiencies, the proposal meets the audit.", "q2r": 4, "assessor": "z_assessor_2945", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5994, "q0": "Basically, the idea of ​​the proposal is to translate all IOHK's Plutus course videos into Vietnamese to help developers in Vietnam have more resources for the Plutus language. Plutus is platform of smart contract of the Cardano blockchain, it allows you to write Daaps to interact with the network. Through this proposal, developers in Vietnam can understand and write a smart contract on the Cardano blockchain. This will be the first brick to build Dapps running on the Cardano blockchain. Through the videos translated by the proposal team, it will attract a large number of developers from the Vietnamese community to submit ideas to Catalyst, increasing the variety and quality of each proposal, and thus the proposal perfectly fits the challenge \"Developer Ecosystem\" posed.", "q0r": 5, "q1": "The feasibility of the project is at a high level. Aspects to be considered include:\n- Issues of risks and challenges that the project faces when implementing are carefully considered by the proposer and have prepared plans.\n- The implementation period will be one year, starting from the fourth quarter of 2022. Because the length of IOHK's Plutus course videos is quite long, it will take a long time to translate and edit. Therefore the above time is suitable for implementation. The number and duration of videos are also mentioned in the implementation roadmap.\n- The cost to translate and edit the video is about 5$/minute => quite reasonable with the amount of gray matter spent.\n- Implementation team: lead by Mr.Do Manh Hung, who has many years of experience in programming, managing the Fimi community with over 2700 members, lecturers of Fimi training courses. Besides, there are about 20 translators who have deep understanding of blockchain, so I am quite confident in the implementation ability of this proposal.\nAt the same time, this is also a proposal to follow the success of the proposal that was funded at fund7, the content is to translate videos related to Cardano. Therefore, there is nothing that makes me wonder about the ability to do this in Fund9.", "q1r": 5, "q2": "I think the audit side of the project is high. We have the number of videos about the course posted on the group's Youtube channel, the number of views and feedback on each video. However we need more specific numbers to make KPIs to consider the success of the project, such as 500 views for each video, 10 feedbacks on the quality of video translations, etc.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 0, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 5943, "q0": "The problem was very well defined of Plutus hardcore and distant access for the local Devs. This problem was aligned with the challenge settings of automating helpful resources for the Devs Ecosystems. The solution was at first simply a translation provided, and the team put more encouraging effort into building the local community of Plutus Engineers. The end game is focusing on the tangible of Dapps on Cardano Ecosystems after joining the course. This is the third second of the same team in the challenge setting of the Dev Ecosystems, which may also need to consider resources/team allocation if both of the proposals will be funded.\nThe risks were well-identified of organizing cost with the slippage of ADA price and buffering budget proposal for mitigation actions. Moreover, it is highly appreciated that this is not only a mere translation one-way with silo individual interaction from the community. And, the team already thought of a community for Q&A and interactions for the Devs after using the potential service. However, the channels of the community should be more Devs-friendly such as Discord or Github channels.", "q0r": 5, "q1": "The team is with 22 members, of which two are the leads and the 20 other members are the executing admin team. The team showed a track record of more than 3000 minutes of videos on their Youtube channels since the funding of Fund 7. What makes the PA concerned is the capability of content translation as these videos are very technical and related to many computer programming terms. Therefore, there is a suggestion that the translation team should join and complete the learning before making the translation to gain their own learning experience.\nThis is a one-year-long project with really heavy materials of 1980 minutes of translation. This required commitment of both the core translation team and the learners/viewers. The milestones were broken down into 4 quarters with 500 minutes/quarter. What could be improved is the more detailed breaking down based on a weekly basis. And, better-informed agenda of the whole 12 months videos publish a plan should be very much appreciated from a learner's point of view. It is also much appreciated if the team can highlight priorities of which video is important/must learn in order to continue the program until the end.\nThe budget simply follows the number of minutes of the videos. What might be considered is the cost for the community of learning Devs to maintain and follow through until the end. Moreover, an allocation of 12 months is appreciated so that the team can reward the community of translators fairly based on their committed working plan.", "q1r": 5, "q2": "The OKR/KPI indicators are very straightforward on a number of Videos/Minutes from the source video of IOG. However, the PA really doesn't know how to track these factors. Especially, there are two mentioned OKRs: the number of developers accessing the Plutus program through video/ The number of responses to each video on Youtube. How do we see the number of Devs, and distinguish them from BOT or just a normal user? Thus, it is recommended to have a dashboard/channels as mentioned above in Discord for example to monitor who are Devs or not and how to see their interactions: Views/Comments/Code: Homework projects, etc. This should take the project to another level. This project also started coming back for the next Fund, however, the Plutus videos will be already fully funded and the team needs to focus on implementation and delivery of the status of two projects: Fund 7 and Fund 9 (if this project will get the funds.) What is really encouraging is the project team's transparency about the number of proposals and workloads. The team also plans more team resources to ensure the delivery of all the proposals if getting funded all.", "q2r": 4, "assessor": "z_assessor_2759", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3715, "q0": "Vietnam is a country with a large population of more than 100 million people. Every year more than 50,000 IT students graduate from universities and colleges. This is a very large number. A team of qualified and enthusiastic programmers began to participate in large numbers in the blockchain field. However, there are very few of them involved in development on the Cardano ecosystem. One of the big barriers for them is that there is no Plutus programming language learning materials in Vietnamese for programmers. Proposing Plutus Video Sub for Vietnam Devs is a good idea to help students and IT students as well as developers in the field of blockchain technology have easier access to the language. programming Plutus will help them easily develop their products and ideas on the Cardano ecosystem.", "q0r": 5, "q1": "With extensive experience in translating Cardano documents, is one of the most knowledgeable people about the Cardano ecosystem in Vietnam. I believe, Do Manh Hung along with more than 20 other team members can completely complete this proposal. Some risks such as ADA's devaluation or different students' ability to absorb that can affect the success of the proposal were also carefully studied by the team and offered very feasible solutions. I believe the community also appreciates this very much.", "q1r": 5, "q2": "The 4-quarter roadmap you gave to implement the work of the proposal is very complete and detailed. The KPIs are also very detailed and easy for the community to measure in terms of numbers. I believe the community also appreciates this very much. The use of the $13,900 budget is also detailed and transparent. I believe that with such meticulousness in the preparation process, you will complete this proposal well.", "q2r": 5, "assessor": "z_assessor_2476", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3525, "q0": "This specific proposal wants to generate vietnamese translations for many educational videos from the source (IOHK). That's a great step towards onboarding people to the environment, and is sure to bring an impact, because more people meaning more devs cardano devs at that. As all people I am a fan of youtube and I could call it an online university. The only problems I've encountered once i find a topic is the language barrier, and this proposal offers a solution to that. I still think that learning english is the better option long term, but to get you started, this is a viable option as well.\nThe authors clearly articulate how the proposal is in alignment with the challenge setting and how it will bring value. I really like how active the vietnamese community is for the previous and this funds. I'm not sure about the product scaling, and that's one of the few things that might be planned out better in the future proposals.\nI don't see anything missing in this proposal, concerning the impact. Maybe a bit more marketing might do the proposal good, because the effort can reach more people and developers. \n", "q0r": 5, "q1": "There's already a proof of concept with a translated video, and that gives me assurance as a future voter and assessor that this is a real thing that will get done. As a developer I don't assume I know the first thing about translating anything, but as a polyglot I can say that 22 minutes a day seem more than reasonable amount of translations per day (500 a month). Alongside that there's a valid plan of expanding the team with requits doing some kind of a test that will be evaluated.\nThe budget breakdown is reasonable and well put together based on my experience assessing 130+ proposals so far for the last 4 funds. I was able to verify the proposals credentials and they do seem to have the skills necessary as is also proven by the translation video linked in the proposal. They have a reasonable and understandable plan, containing translation work for a year ahead and simultaneously expanding their team. One thing regarding the feasibility of the project is the fact the authors are a part of quite a lot other proposals, and depending on how many get funded, time might prove to be a scarse resource.\nThe proposers have given an expansion plan and a criterio basing the future translators which seems good enough to me, although the whole process might take a while to finish. \nOverall a good and feasible proposal, with the potential time based caveats I already mentioned. Even so this proposal seems an important step in the right direction. I wish the proposers good luck in the voting phase.", "q1r": 4, "q2": "Youtube has an option of choosing subtitles, but I didn't see the authors mentioning this in their proposal so my suggestion for them would be to look it up and publish theit translation there. This will make the adoption and distribution of information a lot easier and stince they already are in contact with IOHK, I don't think uploading the translations would be much of a problem.\nThe roadmap of the proposal is decent and the project is auditable, because wherever the links of the translated videos are, the result month after month will be apparent. The timeframe seems reasonable, but I do hope this timeline includes a priority list of videos, because there translating content is a complicated task, since the content keeps on growing so a priority of information that needs translation is a good idea.\nThere's a clear and understandable problem statement and a straightforward solution so I got nothing to add there. Overall a good and auditable proposal. \n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 16, "ne": 3, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 2875, "q0": "The mentioned solution from “Plutus Video Sub for Vietnam Dev” is considered acceptable as one of the major problems in the Ecosystem is information equality among developers. By the fact that only a minority of devs who had their mind experienced the cohort from IOHK makes the distance seem larger, especially for non-English speakers like the Vietnamese. While it’s true that there hasn't been a specific amount of documentation in Vietnamese about Plutus programming language we ought to mention also the fact that this needs to be specified correctly. Knowing the fact that not every developer is in shortage of time and access to information sources but comparing to documentation is readable and less time-consuming rather than a singly translated piece of information, will the proposal be capable of doing that? One bright point for this proposal would be its community spirit as they stated the formation of developers after their documentations are delivered to the needs. Therefore, it’s appreciated that learners can have a forum to share their ideas and knowledge with each other and make it more applicable. Speaking of Impact, it’s very clear that the proposal carefully weighted their section for both developers and the whole Ecosystem, they passed the prerequisites for the challenge by attracting developers to build on Cardano. Furthermore, making comments on their risk management section, while the backup budget is understandable there should be an explanation for the part that stated “The self-learning ability of each developer is not equal”. From the beginning the problem statement wrote “..makes it difficult for talented developers in Vietnam …”, this is somewhat a contrast to their targets. Do they want the products to be delivered for developers who are able to self study or for those who aren’t? This makes a lot of sense about the way they make criteria for whom and which purpose. By this -0.25 star points. * 4.75 total -> 5 (round up)\n", "q0r": 5, "q1": "In general by utilizing the power of translation the project seems to be executable with good investment in human resources and project management. As the proposal could be inferred, there are qualified people on is leading this project, FIMI (the translation group) is a very large and well-known community in VietNam where their youtube channels is known to be a reliable source of information for most people who are interested in Cardano, Blockchain and Finance. Mr. Do Manh Hung and Do Viet Cuong, from their profiles in fimi.vn are also provable in their academic and professional backgrounds that would benefit their community. From the said points, it’s very important to emphasize that if one’s proposal aimed to universalize knowledge, their community is very crucial since their products need to be consumed, and Fimi had their problems tackled earlier by already reaching the 2.740 members in their Telegram group. Moving into budget, the requested budget is 13.900 with clearance in minutes of translation, edit and video publishment. While their $1000 reserved in budget seems to be measurable the consulting fee needs to be specified to which people. For instance, this refers back to their group profiles that should be included. Besides, what particular type of consults would it be ? Is it documentation, video or other consults? From this point it’s alright to reduce 0.25 start points. Looking at the project road map which has been divided into 4 Quarters of the year 2022-2023, the only difference is that Q1&4 still targeting member recruitment while the remaining quarters are oriented to be productivity. The overall translated video is 20 x 4 = 80. As their timeline and ke milestones are pretty clear, the unclear part appears to be “recruit more members of the video editing team”. From their definition of what is “more”, it should be measurable to PA for example, the estimated percentage of their human resource for that particular field that needs to be increased in a specific amount of time. By this criticism, it means that the project could be really problematic if the human resource increases on a fixed budget so the proposer has to be clear on this point, by that -0.25 star points. From Fund 9 documentation for PA there also exists the measurement of technology involvement for each proposal. Within the PA perspective, this proposal targets on number and translation quality but they should also focus on the transparency of their project. For example, what technology is used to accelerate the translation process and what is used to be reviewed afterward, and they should recall the fact that with human beings the middleman in the process could make the whole translating mechanism being erroneous. If this is a proposal to address an ecosystem size challenge instead of a community one, they must have their mechanism shown in the proposal so people can understand and audit to better their system, by that -0,25 star points. \n*4.25 stars -> 4 (round up)\n", "q1r": 4, "q2": "The provided KPI addresses their quantity in their video goal and views, comments. But the second point on “The number of developers accessing the Plutus program through video” needs to be re-define. From the platform this means a particular Youtube video is sent to that developer address or it’s delivered in the Dev’s group ? Public or private? For these small and not clear metrics, -0.25 star points. It’s suggested that the group should quantilize the number for each KPI metrics that would make it easier for people to comprehend about the project. The success for the project is quite clear on the accessibility of the developer community but again, they ought to quantify the  “Developers’ interest” phrase which feasibly could be done by survey, interview, … The additional SDG goal is very well written with specific viewpoints ! * 4,75  stars -> 5 (round up)", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8824, "q0": "Since plutus is one of the core programming language required to develop dApps or other cardano projects , developers who know plutus is needed very much for the development of cardano in the future, hence this project of translating videos of plutus is definitely great idea where learners can get employment easily which directly impact on growth of personal and economical growth of the country.\nThe idea of translating in native language will be boost in learning all the Vietnamese people still more effective manner Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer is just using translators but how is the team going to translate the key technical terms ,and how the learners will implement the learned task from Vietnamese to English , Because English is the final language where code development for core projects is done, this mentioned point the proposer's team should have considered.\nExcluding above point as there is already  IOHK's pioneering Plutus course videos are  effectively learning and translating for the team is achievable as there is nearly 20 members just to translate , the team even contains product manager and QA to check the collective progress. hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As the task mentioned is simple which mainly focuses on translating with videos of  IOHK's pioneering Plutus course videos already present so it doesn't need elaborated proposed solution.The audit has introduced its team effectively where every member of the team has knowledge over block chain.\nThe audit has displayed the team's experience where they have translated project from fund 7 , the team even has 6 more upcoming projects which mainly focuses on translating some or other data to Vietnamese.\nThe audit has decent budget breaking and timeline of the project, with previous experience provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 14642, "q0": "For me, I am quite interested in solutions and this proposal algain with the challenge of the developer ecosystem. It allows potential Vietnamese program access to documentation scarcity of plutus language through IOHK’s pioneering course videos. \nFirstly, to ensure the translation quality, the proposal solutions hire a professional staff with a deep understanding of specialized and good translation skills. Likewise, the test https://fimi.vn/kiem-tra-blockchain/ will be judged on the following 4 criterias: accuracy, timeliness, interest and spread. However, I would like to add that the team should check the grammar, misspellings or coherence of the passage to ensure the content of translation based on a check app or platform. Besides the caption form, they can translate Voiceover clips in order for the developers to have the right choice. \nSecondly, The proposal affects 2 main objects, namely the developers and the cardano ecosystem. It not only allows the developers to access translated videos, but also helps them become Plutus program language developers and have a great chance to exchange and discuss to develop themselves. As for the Cardano ecosystem, which will become diverse and more developed with the efforts of the products of the new developers. \nIn terms of the risks, the team is aware of the challenges that have to face in the future and give solutions to solve it. They divide small groups of trainees to exchange, discuss and study together to ensure the equal of the self-learning trainees ability. However, I think that they should have other solutions before dividing small groups. To be more specific, they can assess the programmer's ability at the beginning of the course for an overview, then, Level division. Besides, they also can open private forms about the feelings of each programmer after a lesson or course to the programmer can share difficulties or challenges during the study period. Following this, the team will give solutions to solve and improve the course quality. Meanwhile, the proposal asks for a backup budget to prevent the slippage of ADA. And, I think that they should regularly read news, especially finance to update the economy situation and Stock to avoid open trade into volatile markets. Overall, these solutions that I mentioned, I think I can support the team a part of somewhat to make this proposal become better. ", "q0r": 3, "q1": "Personally speaking, the ideas in the proposal can reach their aim for success. The first point is that The plan showed detailed information namely timeline and key milestones about the project. To Illustrate, the team points out the activities of each quarter in 2022- 2023 such as hiring and translator trainees, video publishing technicians, translation video and videos with Vietnamese subtitles. While the team also implemented a proposal that was funded from Fund 7, 6 proposals in this round and continue to apply for investment in the next rounds. Therefore, I believe that they had experience, definitely target, serious with these proposals and they were aware of the potential of the development of the Cardano ecosystem. \nIn terms of Human Resources, Each member has a clear mission and ensures completion on schedule despite carrying out many projects at the same time. Meanwhile, Do Manh Hung, Do Viet Cuong and the FIMI translator team are the main responsibility for this project. They have enough ability to lead the team and deep understanding of their specialized( community management, Plutus and Haskell Pioneer, teacher, influencer, translator and blockchain document). And also give solutions if someone in the team does not get a job done in the long-term, the member in FiMI team will support and always enough staff to fishnish the proposal. \nNext, the proposal mentioned the spending activities in a clearly, transparent way and suitable for the total budget $13900 that the team described before in the project. They listed the budget for translation and edit and video products, but did not mention Salary for employees because in the planning part they will require 10 translators, 1 video publishing technician in quarter 4 in 2022 and more members of the video editing team in quarter 1 in 2023. Hence, I think they should provide information to raise the feasibility for the proposal.", "q1r": 4, "q2": "The proposal shows the protocol, measures and indicators in order to follow the talks, monitor and manage activities which are pending, ongoing and done in GitHub. And, it is based on 5 factors, namely: stable code, simple code, testable code, team velocity and knowledge share to apply the following. At the same time, in the last fund, they had more experience to complete the proposal and SDK JavaScript is an example, which leads to the simple and direct way to build a SDK for language based on logic and the same modules.\n \nThe proposal also designed a track tool to check the emissions finish on time, tick off each task done per module and as for delayed emissions, they will give solutions to solve it through meetings. The success shows the Python SDK established and already available in Hippocrates infrastructure for the developers.\n \nPersonally speaking, The Hippocrades are aligned with the SDG purposes and allows all people to access healthcare data in a security and safety way. In conclusion, I hold a belief that this proposal can reach their achievements and success by building a health app for people to ensure healthy life and raise well-being for each individual.", "q2r": 5, "assessor": "z_assessor_4077", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Translate IOHK's pioneering Plutus course videos into documents for Vietnamese developers to easily access and learn. Forming a team of developers using the Plutus. programming language", "experience": "Community Manager, Translator, Plutus Pioneer members, Blockchain & Crypto Teacher, Influencer Coach, Video Producer"}