{"id": 414462, "author": "oliverross", "title": "Community Consensus Certifications", "url": "https://cardano.ideascale.com/a/dtd/414462-48088", "category": 26597, "amount": 9500, "description": "Currently it's hard to understand a developer's Cardano skills without being a skilled developer yourself. We need a certification framework to lower barriers for businesses to hire teams.", "f6_no_assessments": 5, "f6_rating": 3.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5261, "q0": "The Community Consensus certification proposal is to build part of Antimo application to cover certification. The platform will allow educational, testing and exam providers to list their course, have the community to vote on the course and also enable the professionals to link these certs to their profile. The proposal end goal is to help developers to see which course are regarded highest in the community and help them to achieve their learning journey and also help business to ensure the hired developers to know they have adequate skill to do the work. The proposal is based on the assumption that the course or certs voted by the community will be the best tool to validate if the developers are qualified to complete the project. However, it is not the case as some developers are self learners. Each developer has different background and skillset. The course voted by the community is not always the best one that would fulfill their learning journey. The hiring manager would need to know what they are looking for in developers instead of base the success of project on the certification that is voted or regarded highest. The proposer lists the risk of this project as the availability of education, certification and testing providers and that he would convince them to offer Cardano focused service. This indicates that the courses voted by the community would be coming from general service providers outside Cardano. It is unproven  whether those courses will be relevant to certify Cardano developers.", "q0r": 3, "q1": "The project will span over 9 months with the first 3 months focusing on building the certification voting framework and outreach program. The milestone in 6 months and 9 months become less clear as the proposer just say 10 cert like elements for voting. What are Cert like elements? and the proposer has not provided any more action plan in 6 months and 9 months. The total fund requested $9500 will be spent on community outreach and build specific components that the proposer didn't mention what those specific components are nor the development part in budget breakdown section. The proposer should also include his online profile although he mentions several project he is involved. ", "q1r": 3, "q2": "The success of this project is to be a one stop destination for developers to understand required skillset and for people to look for talents for their projects. The proposal completion can be viewed on their antimo platform. However, the team should consider reaching out to the community and not relying on their own platform to update the community on project progress. There is a clarity in description of problem, solution and how proposal objective to align with them. The metrics are provided in the feasibility section as the number of certificate or courses going up for public voting. There are more important metrics which the proposal should consider like developer engagement, community response to their voting also. This will make the project easier for auditing and make it the impactful one.", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14983, "q0": "This is a straightforward project for adding additional certification and community vetting to  to https://antimo.io - a very promising platform for connecting Cardano developers to projects in the ecosystem. \n\nAs such this is a very good fit for the Developer Ecosystem challenge, directly answering several of the guiding questions of the challenge, namely “What do developers want, and how do they get it from the Cardano dev ecosystem?” - by being able to more easily connect with projects; and “What are enterprise dev managers looking for in order to be able to build out enterprise projects - either internal or commercial?” - to be able to more easily find developers for their projects and be able to recruit with a higher level of confidence.\n\nThe risk of availability of education, certification, and testing providers is identified by the proposer but this should not be an unsurmountable obstacle and is sufficiently addressed.", "q0r": 5, "q1": "The plan is clear and easy to follow and clearly describes milestones for 3, 6, 9 months.\nThe budget of $9500 is adequately broken down and reflects the straightforward nature of the project. What I particularly liked is the fact that the proposer adequately budgeted for marketing and community outreach, two very important but often overlooked aspects of a project.\nFrom the links to the previous works provided by the proposal we can clearly see he is a very capable web developer, who should have no problem in delivering on the scope of the presented plan. Mention of additional hires is made for community manager and additional roles if required.", "q1r": 5, "q2": "I highly agree with the definition of success put forward by the proposer, and his vision where skilled Cardano developers easily find projects projects to match their skill-set.\n\nBut, unfortunately the auditability section overall is by far the weakest element of the proposal. No KPIs or other metrics are specifically mentioned, and neither is an already established communications channel for the community to monitor.\nMy score of 3, however reflects the fact that the proposal is clear and easy to follow overall. A clear roadmap and milestones with a clear time horizon are presented in the Feasibility section.\n\nMy advice for future proposals would be to include them more specifically, as unfortunately,  PAs often only see what’s presented in the corresponding section.\n", "q2r": 3, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 14987, "q0": "This is a proposal asking for funds to expand an existing site (https://antimo.io) to also include a section where users can list their certifications, as well as rate the importance of certifications of other users, so that in the end, a person who wants to hire a developer in the Cardano ecosystem, can check out their profile on this site and what their skills are.\nThe main site is already built and the proposer’s plan seems pretty well put together. As a risk, the proposer mentioned the fact that currently the availability of formal education focused around Cardano is quite limited (there aren’t that many courses and certifications specific to our ecosystem), so the impact of this functionality is hard to determine. The way to mitigate this unfortunately does not sound very convincing to me: “We would court all existing providers we can find but also look to convince more providers to offer Cardano focused services.”. I would have liked to hear a few practical ideas on how you could convince some formal institutions to offer these kinds of certifications for Cardano related technologies.\nNevertheless, it’s definitely a plus that the proposer is aware of this risk. I think that this proposal addresses the Developer Ecosystem challenge effectively, as this functionality would make it easier for businesses to hire people, which would lead to more non Cardano developers seeing the opportunity in becoming one and finding a job here. Score: 4.", "q0r": 4, "q1": "The proposer provided a timeline, but it’s quite sparse unfortunately. By the end of the 3 months, the plan is to have the voting framework for the certifications built and to communicate this to the community, which I think is doable, especially since the proposer has programming skills himself (please provide a LinkedIn profile or something similar in the future so that people can take a look at your professional history). By month 6, the intention is to have 10 certifications available for voting. I don’t know how feasible this is unfortunately, I don’t have enough knowledge on the subject. The budget is, if anything, very low in my opinion: only 9500 USD, where 1600 will be used for development and 7900 for community management and advertising. Even if the proposer is the only developer working on this, I think the requested sum is too low, based on 8 years of experience in IT delivery. The solution he wants to build needs to be architected, designed, implemented, tested thoroughly etc. But he has provided a list of several sites he claims to have built and if that is true, then I think he has the necessary skills to do this himself (he did mention he would seek help if he gets stuck on anything). For the community outreach part, an extra person will be hired, which makes sense.\nTo sum up, the plan is workable but I’m concerned that the budget is too low to actually be able to reach an audience via advertising with it. Score: 3.\n", "q1r": 3, "q2": "The auditability section is unfortunately very sparse. There are no KPI’s listed to help us measure the project’s progress. Next time, I recommend you add at least simple ones, such as estimations of “X commits per month” which could be checked in a repository you provide the link to and “X number of followers” on the following Twitter / Discord / Telegram channels, or something similar.\nSuccess is defined as having this tool which people know that they can use to determine what type of professionals they need for their projects and how they can get in touch with them. It’s a good objective, but I think it’s a bit vague. We would have needed some sort of estimations as well here, to really be able to measure the success of the proposal. For example: have at least one client after 6 months who found people they needed via your site.\nTo sum up, there is a lack of information here and the community will have to rely solely on the monthly reports to IOG which are public, but are not really a substitute to clear progress and success metrics. Score: 3.\n", "q2r": 3, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15009, "q0": "IMPACT: \nThis proposal aims to facilitate a way to show certifications, courses and/or exams for Cardano's oriented devs, with a scoring system voted by the community (consensus) that will help a manger to understand if the developer has the skills needed to develop the specific project.\nThis system is a new functionality that will be added to an existing site, antimo.io. The problem to be solved and the solution presented does address the Challenge objectives as it will generate a better experience for developers, enabling them to show their skills better, and also attracting new developers showing them which skills are the most voted within the Cardano's community. So I strongly agree this proposal aligns with the Challenge objectives.", "q0r": 5, "q1": "FEASIBILITY\nThere is only one existing member of the team, Oliver, as the community manager will be hired, and if extra help is needed it will be hired as well. Oliver seems to be very quite capable to build the needed functionality, as he did proven with the other sites developed by him and by his contributions to the community.\nThe timeline and milestones though is vague and generic, as it specifies only major milestones, for a 3 months project, I do recommend to add more details and partial deliverables to each month of the project, so the scope of work can be better understood and assessed.\nThe budget is presented in detail, by role, with rates that are ok with the skills needed and considering that Oliver will be doing most of the work.\nIt is not clear though the effort being considered per month by the community manager as there are 130 hs being planned, but with no detail on how they will be applied within the 3 months, which can be insufficient, to reach the indicated goals.\nBecause of the described issues, I cannot agree nor disagree that this proposal will deliver the results it is promising.", "q1r": 3, "q2": "AUDITABILITY\nBesides what it was expressed on the general timeline: \"6 Months - \n10 cert like elements for voting and 9 Months - 20 cert like elements for voting\" there are no other KPIs, stating that they will be provided openly in the platform. But without any other KPI neither a detailed deliverables, it will be hard for the community for properly audit this project. A detailed set of KPIs should be provided. \nBecause of that I disagree that this proposal will be easily tracked by the community.", "q2r": 2, "assessor": "z_assessor_2398", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15018, "q0": "The problem presented makes sense. The creation of a framework for certification of professionals/developers is extremely relevant to this challenge.\n\nI've dealt with some community members and proposers who were looking for developers to create applications on Cardano and had a hard time even where to look for developers. The first cohorts of the Plutus Pioneer program were formed just over a year ago, a relatively short time for an organized network of professionals and frameworks to exist. There are groups and channels in different social media where it is possible to find devs, but there is a lack of coordination to make the process more organized.\n\nIn the metrics/KPIs section there are no targets that can allow to measure the impact of this proposal. The only mention was:\n\n\"The completion of goals as above will all be publicly visible on the platform.\"\n\nBut above there is almost no information about what we can expect as a tangible outcome of this proposal. In the feasibility section there is a simple roadmap with some milestones, but not very relevant for impact assessment. \n\nWhen I say KPIs that can indicate impact, I mean examples such as:\n\n-How many developers are expected to be registered on the platform? Over how long? (months)?\n\n-How many proposers/entrepreneurs/teams does the proposal intend to serve through the platform?\n\n-How many community members are expected to decide the frameworks for the certificates? This is important because the Cardano community is large and creating a framework where few participate ends up not solving the problem defined by this proposal.\n\nAlthough the concept brought by this proposal is extremely relevant and promising, there are no tangible deliverables that can indicate the impact of the proposal on the challenge.\n\nIncluding KPIs is necessary so that we can more tangibly understand the real impact of the proposal.\n\nThere is interest in making the project financially sustainable in the future, but there are no details on how this will be done, the proposer has indicated that it should request funding from Catalyst again.\n\nAs stated in the Proposal Assessor Guide, a proposal needs to be evaluated by what is defined/written and not by the idea, the PA cannot fill in gaps that were not explained in the proposal.\n\nDue to these points, my score is 2, as I disagree that there is information that indicates a relevant impact on this challenge in a practical way.", "q0r": 2, "q1": "The proposer briefly described experiences relevant to the context of this proposal, but I could not find more details that would allow attesting his  qualifications in the included links. I would recommend including a link to Github, Linkedin and/or any other links that can more clearly demonstrate his qualifications, mainly because this proposal is exactly to make the verification of expertise more accessible, so I think the proposer should have made the proposal itself as an example, what did not happen.\n\nIt would be important for the proposer to mention his experience with development on Cardano, there is no mention of him having participated in some of the pioneer programs, such as Plutus or Atala.\n\nThe proposer mentions that he will hire a community manager from the Cardano ecosystem who has experience in building professional connections to assist with the outreach, which is positive.\n\nThere is also mention of hiring more people if necessary.\n\nAs we do not know whether more people will be needed, the budget assessment becomes more uncertain.\n\nThere is a budget breakdown, but due to little information about the plan it is not possible to say if the values ​​are adequate.\n\n$30 USD per hour for community management and outreach is reasonable compensation, but there is no way to assess whether 130 hours makes sense as there are no details on what the outreach campaign will look like.\n\n40 hours of development was mentioned at $40 USD per hour. There is no way to evaluate without knowing the plan in more detail.\n\n\"Combined social media and real world advertising budget: $4,000 (specific value will be based on the costs at the time of ad space procurement)\"\n\nThere is no way to evaluate the above item either, as there is no information on where this will be advertised and for how long.\n\nThe plan is very simple, a draft and need more detail. Establishing a framework for certification is something that needs to take into account the expertise of the community, how to coordinate the developers and the community to create this solution? There is no mention of how this will be done. Who will vote for the decision of what will be valid for certification? What are the criteria for participating in the vote? The community needs guidance from people with technical expertise in order to vote rationally.\n\nThere is a timeline of 9 months, which in theory would be enough to develop a certification framework, but as the plan is extremely brief and lacking in detail, there is no way to guarantee its feasibility.\n\nThe proposer considered only the risk of not having funding, but there is the risk/challenge of this implementation not having enough popularity and engagement for the community to adopt the framework/certification.", "q1r": 2, "q2": "There is a roadmap with milestomes. the 3 initial milestones/steps referring to the first 3 months can help to verify the development of the voting stage and certification discussions, but without a plan to complement them they are not so clear items. The 6 and 9 month milestones are vague and inadequate for auditing.\n\nWithout a plan, it is difficult to understand how to audit the roadmap and the milestones presented.\n\nThere are no metrics/KPIs.\n\nThere is clarity in the problem presented, but the solution needs more clarity and detail. With the plan that has been presented, there is no way to indicate that the definition of success included is realistic.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A community consensus list of courses, certificates, or exams with weightings as to how important they should be to a hiring manager.", "experience": "I have 8 years experience in corporate IT, managing teams and projects. This involved a lot of cert / skill management, compliance etc.\nIn the Cardano space I have run a number of successful projects and collaborate with a wide variety of projects and teams."}