{"id": 414898, "author": "quangtran", "title": "Haskell Book Vietnamese Translation", "url": "https://cardano.ideascale.com/a/dtd/414898-48088", "category": 26597, "amount": 8080, "description": "Cardano's Smart Contract is built on Haskell. But there is no book or document about Haskell for developers in Vietnamese. It is a big barrier for developers in Vietnam to build Dapps on Cardano", "f6_no_assessments": 15, "f6_rating": 4.866666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 4852, "q0": "I think this proposal is a very practical idea that fits very well with the objectives of the challenge. As we know, Haskell is the foundation of the Cardano Smart Contract. However, there isn't many books or resources in Vietnamese regarding Haskell for developers which is a big barrier for developers in Vietnam in building Dapps on Cardano blockchain. Therefore, the proposer has the idea of translating Haskell books into Vietnamese and share it with current Developer communities in Vietnam. I think, this is a good idea which could bring valuable knowledge to the people in need, especially Vietnamese developers. With previous funded in Fund 8, the team have already finished the translation of the book \" Real World Haskell\" (2008, O'Reilly Media) into Vietnamese and shared it with developer communities in Vietnam; but this book about practical applications of Haskell which is quite difficult for who who are new to Haskell. Therefore, with the desire to bring more basic Haskell books for developers, the proposer plan to translate the second book, namely \"Learn You a Haskell for Great Good! A Beginner's Guide\" which is recommended from IOHK in the Plutus Pioneer Program. This is one of the first necessary steps to further helping developers in Vietnam to easily access to building projects on Cardano blockchain. As far as I'm concerned, current developers is familiar with imperative programming language, so they might find it hard to quickly change to Haskell, therefore, the proposer suggests making detailed video tutorials of Haskell on Youtube for developers which I am very appreciated. In short, this is a project with good will in supporting Vietnamese developers in conquering the Haskell world and Cardano blockchain. I fully support their idea and would like to give them full mark for this part. ", "q0r": 5, "q1": "\"I think the proposal script is quite simple and very detailed to understand. For the roadmap, the plan is devided into 3 month, we know the activity that will be implemented each month. It would be more interesting to know how many translators are involved in translating this book and how many hours per day, or how many estimated pages the proposer could translate per day? Besides that, I don't think more detail would be needed in the case of this proposal. \nRegarding the requested budget of $8,080, I think the amount is fair value with the proposal. The total amount is based on $20 per page and 404 pages in total, leaving nothing to comment about this part. \nAbout the team, there is a lot of confidence in each of the professionals involved. We know their names, position, years of experience in related field with Github, Telegram, Youtube for community reference. Moreover, those team members are also very active within the Cardano community and this proposal is the ongoing of the previous funded proposal, so I believe it is possible for them to carry out this proposal well. Therefore, I will give maximum score for this part. \n\"", "q1r": 5, "q2": "It is very easy for the proposer to monitor the implementation of the work based on their targeted goals in the roadmap for the 3 months. Besides, the completion of translation of the book will be uploaded in Google Drive in pdf for public community sharing; therefore, it is not difficult to check the number of downloads. In addition, to know the number of developers joining in the Plutus Pioneer course, the proposer could easily measure by the number of registration forms. Also, by asking \"Has someone referred you to become a proposer\", we could know the number of proposals submitted on Catalyst. Moreover, I am appreciated that the proposer provide a very detailed and clear goals after this Phrase on: completion of the book, reach 500 downloads, 10 developers join Plutus Pioneer Program, 5 proposals from Vietnam submitted to Catalyst.  In general, this proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_2622", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 5600, "q0": "Normally I would say that translating a programming book into many languages does not sound like a great fit for the Project Catalyst Developer Ecosystem challenge setting. Doctors used to learn Latin to communicate in scientific circles, and I assumed that most people nowadays would learn some basic English to share scientific content online (or at least \"Globish\", the grammar-free little sibling of English). I have actually witnessed Dutch and Arabic computer scientists talk in English to other Dutch and Arabic computer scientists about programming concepts and they claimed that this was much easier! However, the claims that the proposers make about the Vietnamese talent pool of programmers willing but unable to learn Haskell, with poor English skills and eager to join the Cardano ecosystem, sounds like an amazing use of $8080 funding. And I have to say that reading \"Sử dụng Monad mới: Hiển thị tác phẩm của bạn!\" in the previously translated Haskell book makes me very happy! Giving the underserved, highly talented developers of a 100 million people country famous for tech talent LYAH in the local language (not \"from IOHK\" but recommended for the Plutus Pioneers pre-reading by the IO) may indeed do the Plutus developer ecosystem a great service. If we can increase the existing stock of decent Haskell programmers by only an extra 5% per year with the this translation proposal, it may rank among the best return-on-investment decisions the community has ever made!", "q0r": 5, "q1": "The strong Haskell and translation backgrounds of the 5-people proposer team, paired with the track record of delivering on-time previously funded proposals make me very confident that this proposal can be implemented swiftly and well. The budget is reasonable and it is comforting that the Riley book translated previously is available as an e-book of modest download size and high readability.\nSuccess of this proposal will be measured not only in the number of downloads and the actual delivery on time, but there are additional \"bonus\" milestones that we as a community get promised \"for free\": 10 new Vietnamese coders will join Plutus Pioneers next cohort, and 5 new/additional technical proposers from Vietnam will join Project Catalyst, This in itself is already worth the price tag, and completely alleviates my concern whether two Vietnamese Haskell books may not be overkill (\"Learn Yourself\" is a great book for beginners and amazingly illustrated by the way).", "q1r": 5, "q2": "The Auditability specific section of this proposal is short but sweet, with credible performance metrics supported by the ease and channels of delivery. It may have been even better to distribute this ebook to certain schools, university programs or software companies and ask them for feedback, or do other such research that may help improve future work and create an even more targeted distribution, or a later \"Second Edition\" taking feedback from students into account.", "q2r": 4, "assessor": "z_assessor_2720", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5641, "q0": "Your work truly impressed me, I've gone through your proposal in the previous fund (fund 8), and I found your team is doing great. The book which you translated for the people who are at the advanced level to practice applications of Haskell is excellent, I believe it's so helpful for the one who needs it. We all know that the Haskell programming language is new to many developers who are beginners in programming and those who are using other languages to switch to Haskell easily. Additionally, I also research the youtube video that you make a course on it for beginners easily starting Haskell is great. So that I completely agree that your work in translating the book into the Vietnamese language in a pdf file will make an impact on learners and developers.", "q0r": 5, "q1": "With Haskell programming languages, it is challenging to find staff with the level of expertise required for this job in the labor market. However, team members are showing they are veterans in this field, such as Mr. Curtis D'Alves has been working as Haskell Developer for 5 years and Mr. Edward Kmett has been a Haskell Teacher for 11 years. It's so awesome. That's why I believe the project is doable and the team can deliver the work best. Besides, I also see your result from the previous fund, it shows that the team not only has a deep understanding of technical knowledge but also has the advanced skill to make videos and build content... The plan for 3 months is quite granular, easy to understand and catch up as you have apparent activities each month. It would be more significant for our community to know if you provide a backup plan if you cannot hit the number of downloaders in that month.", "q1r": 4, "q2": "Finally, in the Auditability section, I think the information provided is enough, so we can quickly evaluate the project's success. I think it would be clearer if you offered the method you use to track the number of downloads? About the rest, I think it's pretty good, I appreciate your team always making the efforts to strive Cardano ecosystem expanding", "q2r": 5, "assessor": "z_assessor_2732", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5968, "q0": "This project is obviously significant to Vietnamese developers. It would be easier for Vietnamese developers to learn Haskell from materials written in their native language. Vietnamese young developers are very eager in blockchain technologies. The project will provide a solid foundation in Haskell programming for developers so that they can involve in future Cardano projects.", "q0r": 5, "q1": "With the successful implementation of funded project in Fund8, I strongly confident that the team will make another successful work in Fund9. As stated in the proposal, the team members are veterans in Haskell programming and has experience in translating English technical docs to Vietnamese. In Fund8, they have completed the translation of Real World Haskell (2008, O'Reilly Media)  book into Vietnamese. I don’t see any hinderance that prevent the team from translating another book to Vietnamese. \nWith the time line of 3 month to translate a 404 pages book is feasible based on the fact that the team completed 60% of translating 650 page\tbook in one month.", "q1r": 5, "q2": "It is very easy to verify the output of the project as it is publicly accessible in Github.\nIn term of proposed assessment criteria, “number of downloads in 3 months” is closely related to project output but the number of developers joining Plutus pioneer program and number of proposals from developers in Vietnam submitted to Catalyst are unrelated.\nEstimated cost (20 USD per page) is reasonable. ", "q2r": 4, "assessor": "z_assessor_2764", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6004, "q0": "The impact of this proposal on the developer community in Vietnam is huge! Haskell is considered a difficult language for new developers because it uses modular object-oriented programming, which is completely different from other popular languages such as Solidity, Java, and C++. At the same time, there are very few documents about Haskell in Vietnamese for Vietnamese developers to study. Hence the idea of the proposal to translate the entire book \" Learn You a Haskell for Great Good!\" into Vietnamese and publish them on developer communities in Vietnam. This will make a lot of sense, the barrier to entry to the Haskell language is minimized. Get more developers outside of the community to participate in Catalyst as well as the Cardano ecosystem.", "q0r": 5, "q1": "I completely agree with the feasibility of the proposal. The proposal is a successful continuation of the idea in fund8 with the translation of a book on Haskell (650 pages), so the proposer has experience in translating documents into Vietnamese. The implementation roadmap is simple and detailed, helping us understand what work will need to be done. We have the first month to translate the entire 404 pages of the book, and the next 2 months will be the period to share the book with the developer community. Very reasonable! The cost of translation for each page of the book is 20$, I think it is reasonable because this is a specialized document and it requires a certain amount of knowledge about the Haskell language to be able to accurately express meaning in Vietnamese.", "q1r": 5, "q2": "The information the proposer provides is very transparent and specific. With the information of each member on Telegram, we know who Mr.Quang Daniel is, Ms. Who is Hannah? And there is a milestone to measure the success of the project, success will be the number of downloads of the Vietnamese version of the book (500 downloads in the first 3 months), there will be 5 proposals sent to Catalyst. It is quite simple for the community to check through google drive about the progress of the book translation.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 0, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 8453, "q0": "The purpose of this proposal is to provide a resource that has been translated into Vietnamese in order to make learning Haskell more accessible to Vietnamese developers. Developers are one of the most essential forces helping to build decentralized apps on Cardano, which makes them one of the most vital forces for today's Blockchain platforms in general. To provide easier access for developers in Vietnam to the process of constructing projects on Cardano, one of the first steps that has to be taken is the creation of translated documentation for a programming language that is not particularly common in Vietnamese. Haskell is a tough language with insufficient Vietnamese documentation. Therefore, the approach proposes very explicitly that they select one of the most well-known books available on the programming language to translate.\nIn general, I believe that this will serve as the basis for Vietnamese developers to begin participating in Cardano initiatives.", "q0r": 5, "q1": "Proposal team members are knowledgeable and skilled in the areas of programming, research, and translation necessary to carry out the project as planned. The Budget is rather careful and stays within a defined time frame. It's a suitable and well-defined budget given the scope of the job at hand. Although I believe that the project will be carried out by the team with success, one thing that I would be interested in learning more about is the current population of the communities with which the team will share the document.", "q1r": 4, "q2": "The community will be able to check and evaluate the progress that has been made as well as the performance of the project thanks to the information that has been supplied in the proposal. The group has set an objective for the number of downloads, the number of new developers, and the number of proposals that will be delivered to Catalyst.\nThe fact that the project's specified milestones may be followed through a variety of sources (such as Google drive and registration forms), is another advantage of the project.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8672, "q0": "In this Fund, there are many projects are calling for funding for the translation of Cardano learning materials/Cardano programming languages ​​into Vietnamese. But personally, I appreciate this project very much, because of the way they present the data and evidence proving the feasibility and necessity of the project such as studies showing the advantages of Blockchain and its development potential in Vietnam, the survey shows that the language barrier hinders the learning of developers in Vietnam. In addition, this project has clearly defined the source of the document, the form of publication of the document, the main resource for document translation from the very beginning. The focus of the project development plan will also revolve around the translation and release of documents without any time or expense for finding and recruiting outsourced translators/services. Overall, with the core idea of ​​translating Haskell documents into Vietnamese and a clear and solid project execution plan, this project fits the Challenge's main theme perfectly and has a very high level of success.", "q0r": 5, "q1": "The project development plan is easy to track its implementation progress, the implementation time is also reasonable without being prolonged by the additional work arising such as searching for outsourcing translators, searching for outsourcing support people. The budget allocation plan is presented in great detail including the volume of documents to be translated, the translation cost per page, but should know more information about working time in a month to be able to evaluate with such a volume of documents, whether the group's 3-month translation schedule is effective and suitable for the required remuneration or not. The translation quality of this project can be guaranteed because the main members who perform the translation work all have working experience, a deep understanding of Haskell and experience in translating English - Vietnamese. In addition, they already have a solid Cardano community (46,000 members), which will be one of the favorable conditions for distributing the proposer's documents to the right target audience of proposal - Vietnamese developers.", "q1r": 5, "q2": "With this project, auditability is an easy job. First of all, an audit roadmap has been clearly formulated and ideally designed for successful evaluation including KPIs expressed in specific numbers, timelines for measurement. But I still encourage proponents to be able to extend the audit roadmap further across more medium and long-term measurement timelines. Google Drive would be an effective tool for project management and document download tracking, but for measuring the other metrics listed it's really not a suitable tool. A few suitable tools that I can recommend to proponents are updates on popular social platforms (Facebook, Twitter, etc), GitHub, blog posts, etc.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 8839, "q0": "Haskell is one of the important languages required to develop cardano development projects , as there is lack of content available in market to learn Haskell, it  is surely affecting cardano eco system, to grow even to higher stage , Hence to develop a tool where enthusiast of Vietnam can learn the cardano in most effective manner is a great idea where it can allow the Vietnam people to allow every basic term in most effective manner where they can implement the logic effectively .Hence,this proposal effectively addresses the challenge", "q0r": 4, "q1": "The team has already translated previously from fund 8 project which is \"Real World Haskell\" which is a book for higher level of Haskell developers, now they want to make other translation which is lower level /basics of Haskell i.e \"Learn You a Haskell for Great Good! A Beginner's Guide\" which will be achievable easily with the same team provided.\nThe team has proven experience in translation of Haskell and team required for it is also r ready , hence with developers and teachers involved in the project with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clear goal on how to expand the cardano community by making most of the developers working in Haskell development programming language ,The audit has clearly introduced all the team members of the project where it includes teachers who are knowledge over cardano catalyst programs and have great skill set in translating from English to Vietnamese and developers who have worked using Haskell programming language previously.\nThe audit has even displayed the book presented by the team from their previous funding , the proposal contains well structured timeline to complete the project and a decent budget feasibility, Hence with provided data in audit .The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9104, "q0": "Developers are one of the most important forces to help develop decentralized applications on Cardano. Vietnam is one of the countries with a large number of developers, however, English is one of the huge barriers for programmers in Vietnam. As a result, developers in Vietnam have very limited access to Blockchain and smart contract documentation because these documents are in English. Cardano's smart contract is also built on one of the rarest programming languages in Vietnam, Haskell, there is very little documentation on Haskell in Vietnamese. At Fund 8, they translated Real World Haskell (2008, O'Reilly Media) into Vietnamese and shared it with the developer community in Vietnam. But the Haskell Real World book is a book about Haskell's practical applications. Therefore, its knowledge is quite difficult for those who are new to Haskell. Developers need more basic Haskell books to join Haskell. Therefore, at this Fund, they will ask for funding to translate the book Learn You a Haskell for Great Good! (recommended book from IOHK in Plutus Pioneer Program) into Vietnamese and share it with developer communities in Vietnam. Therefore, this proposal will contribute to increasing the number of developers actively building on Cardano, in line with the goal of the challenge. The proposal also lays out the risk and its remedy.\n", "q0r": 5, "q1": "The project is expected to be implemented in 3 months: the first month: translating the entire book Learn You a Haskell for Great Good! Vietnamese language; 2nd month: share this book with 10 developer communities in Vietnam; 3rd month: share this book to 20 developer communities in Vietnam. The project has a clear and specific roadmap. They also have two Fund 8 funded proposals, the Haskell Beginners Course and the Real World Haskell book translation. They completed the translation of this book in the first month so they are fully capable of making this project a success.\n\nThe proposal requires a budget of $8,080 for the 404 pages of the book. I find the cost to be reasonable.\n\nThe project implementation staff consists of 5 people, they are Haskell developers, Haskell teachers who have many years of Haskell programming experience, someone is an English teacher and translator in Vietnam... so they can implement the project successfully.\n", "q1r": 5, "q2": "The proposal sets a target for the first month of translation completion, the second month 200 downloads, the third month 500 downloads + 10 developers participating in the Pioneer Developer Program + 5 recommendations from developers developed in Vietnam sent to Catalyst. After the translation is done, they make a pdf file and upload it to google drive for developers to download. Community can track downloads on google drive. The number of developers participating in the Plutus Pioneer course can be measured by registration forms. The number of proposals submitted on Catalyst is also verifiable.", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 9311, "q0": "I really agree with your suggestions. Your proposal solves a major barrier for developers in Vietnam when building Dapps on Cardano. Currently, the technology field is also a very hot industry in Vietnam today, but specialized English is still limited for programmers as well as for the generation of students interested in Blockchain. Therefore, translating the book Real World Haskell (2008, O'Reilly Media) is essential for everyone to access and refer to when learning about Cardano. I hope the project is implemented so that Vietnamese people have the opportunity to get closer to blockchain and people can better understand the superiority of programming with Haskell over Cardano.", "q0r": 5, "q1": "After reading the team's proposal, I found it quite practical and detailed. The group has come up with a specific plan with goals for each month. You also have video illustrations, links and information of the members of the full book translation project, who are all trustworthy and experienced in the field of translation. I think this proposal is good and highly likely to be implemented if funded.", "q1r": 5, "q2": "I find that with the measurement of the progress and development of the project that the team gives, there are specific numbers and goals. Those are numbers that can be done in reality, not numbers that are too imaginary. The success of the project in my opinion is the number of positive feedbacks and reviews from readers. Besides, you can do an accelerated route, besides creating a pdf, you can make more specific video tutorials, or have short promotional videos about translating this book to speed up the process.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11049, "q0": "Cardano's smart contracts are built on Haskell. But there are no books or documents about Haskell for programmers in Vietnamese. It is a big barrier for developers in Vietnam when building Dapps on Cardano. Your suggestions include translating the book \"Learn You a Haskell for Great Good! A Beginner's Guide\" (recommended book from IOHK) into Vietnamese and sharing it with existing Developer communities. now in Vietnam. I think this is a very necessary proposal to make it easier for developers in Vietnam to build Dapps on Cardano. The proposal outlined possible risks, but I see you have explained how to reduce that risk relatively effectively", "q0r": 5, "q1": "Haskell is an uncommon programming language in Vietnam and there is very little documentation on Haskell in Vietnamese. In my opinion, this proposal is very necessary, it helps to grow the number of active developers in Vietnam building on the Cardano platform. The proposal provided a detailed plan with specific timelines and tasks, detailed analysis of the budget for the project, and the appropriate funding source in my opinion. You have provided full information of the people who will work on the project, I see that these are all experienced people. On the other hand, at fund 8, you have completed the translation of the book Real World Haskell (2008, O'Reilly Media) into Vietnamese. I think you will succeed with this proposal", "q1r": 5, "q2": "You have provided indicators to measure the progress of the project, in my opinion you should provide indicators according to the time progress of the plan, it will be easier to grasp the progress of the project. The product of the project is described very clearly. The chance of success of the project is certain, I congratulate you", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 13693, "q0": "The idea of this proposal is really interesting and impressive when it comes to impact. It is about translating a book teaching about Haskell for Vietnamese developers whose name is  “Learn You A Haskell For Great Good! A Beginner’s Guide”. The justification for such a project is vital as this kind of document is lacking for the non-native English developers like Vietnam, and in fact, it is just available in English language only. I think the problem statement of the proponent is very realistic, he states “ No book or document about Haskell for developers in Vietnamese”, which makes me think that it somehow prevents the talented developers from approaching our Cardano blockchain as it is built based on Haskell. Consequently, just like his opinion, I think it’s a huge barrier for Vietnamese developers to build dApps on our blockchain, slowens the development speed of the whole ecosystem. There is also the fact that Haskell is not such an accessible language for people who know how to program in other languages, this makes it even more important that this book is translated. Bringing Haskell knowledge to Vietnamese developers helps them approach more opportunities within the Cardano ecosystem; encouraging them will lead to increased developer adoption, productivity, and creativity for Cardano. In addition to the above to  assess the level of this proposal, I think it can also be a muse to have it translated to other languages and other related Haskell articles so I believe the full impact is not small at all. The other positive point is that the proponent outlines the Vietnamese developer’s difficulties with both quantitative and qualitative data, which I found very convincing and provides us a full understanding about the background for this proposal. He is also able to state the risk might occur during the process. In addition, it is also very thoughtful how the proponent intends to make tutorials to help even more readers in possible difficulties that they may face only in asynchronous moments. For this, I think he has done serious research about his project and has a deep understanding about it.  I just have an observation about quality management for the translated book. In order to deliver it in an understandable and simple way, having moderators who are expert about Haskell, Vietnamese language could be useful. Besides, although having tutorial videos, the self-learning ability is not the same among people. Therefore I suggest a group chat to discuss and explain some difficult content together. So, I really love this idea and I think it will benefit the Cardano ecosystem in many ways. For the logical and convincing arguments he has made, I would give this part a maximum point.\n", "q0r": 5, "q1": "Regarding the detailed plan, this part is great, we know exactly what will be done each month of the project. The general information about the project is provided, like it lasts for 3 months and is divided into 3 phases, giving me an overview about the whole project. The point is the proponent details how many developer communities and download goals to reach. The KPIs are described not only with quantitative data but also qualitative explanations which I find easy to understand and track. The process of it is also published transparently to Google Drive, according to the proponents.  Now talking to the budget, the requested amount of $8 080 accounted for 0.8% of the total challenge. The price of $20/page/404 pages which is quite expensive compared to other proposals with similar activities, I think. However, I can understand that the Haskell translation requires excellent translators who have a deep profession in Haskell and Vietnamese language to handle the unique difficulties in translation specialized documents like this. I just have an observation like this: the proposer said the team could create tutorial videos so how this category could be calculated. I expect a specific short explanation about this so that I could have particular advice on this budget part. We shall continue with the project’s members. They have experience in the Haskell programming language as teachers and developers. They were also translators and Cardano admin for years. Specifically, I think more information is provided about some members (Mrs Hannah for example) than others (Mr Curtis D'Alves for example). Ideally, the same level of detail would be available on both. However, analyzing the trust that is passed on to the team, I think they seem to be well qualified people, we have all the necessary functions so that this team is complete and well qualified for the respective tasks of the project. Moreover, this is a continuous part of the funded Haskell projects in Fund 8, I think the proposer commitment with this project is quite high and we can consider investing in the long term. I want to add a point that it would be more perfect to clarify the role of each member. We know that from editing to publishing there are many small tasks to do, for example: translating, editing, modifying; we even have video producing so who will create and edit videos mentioned above? If these points were clearer, I assumed this part would be perfect. In general, this part is almost good, just need some aspects to be transparent.\n", "q1r": 4, "q2": "Regarding the auditability aspect, they have a few ways to monitor things like the quantity of downloads, developers taking part in the Pioneer Developer Program, and ideas from Vietnamese developers that Catalyst receives. Since we can view the PDF file that was posted to Google Drive, I believe that evaluating the project's results will be fairly straightforward. I'm not sure how this translated book encourages individuals to enroll in the Plutus course, though, in terms of \"The number of developers participating in the Plutus Pioneer course.\" Therefore, I think it would be simpler to imagine if there were a brief explanation of this. Finally, I'll discuss the project's success scenario. It is obvious and pertinent how this could indicate success. To put it another way, these contain both qualitative and quantitative data, provided that these nominees are properly presented in the monthly meetings with the challenge teams. That's all, I believe this section is pretty useful and well-presented with just one minor area that might be improved.", "q2r": 5, "assessor": "z_assessor_3750", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14002, "q0": "This proposal would provide Vietnamese developers and programmers a useful tool for studying Haskell - a programming language as this is one of the countries with a very large number of developers. However, English is considered as an intangible barrier to studying in-depth programming language which is Haskell. In other words, this team is tending to translate the content inside the book named “Learn You a Haskell for Great Good!” in order to bring opportunities to Vietnamese developers to access this language in their coding work and study it in-depth as well. Since, in this day and age, there is a growing demand for Vietnamese people to learn the programming language Haskell. It could be challenging for developers to research/access it for their coding tasks. On the market, there are many books that talk about coding by Haskell but unfortunately, there is a rare number of them that are translated into Vietnamese since Haskell is completely different and difficult for developers as well as programmers. Perspectively, this is a meaningful proposal for Vietnamese programmers in particular and for the growth of the Cardano inhabitant in general. It would attract more users and web developers as well as programmers to join the Catalyst and contribute their products by using Haskell. Thereby diversifying our Cardano community.", "q0r": 5, "q1": "In feasibility, this group has provided a detailed 3-month plan with their goal setting for each month. They also provided their achievements in fund 8 in order to prove their ability and the successful proportion of this proposal. The supporters will be given a base for making comparison to the ability/possibility of the proposal. Honestly, I do expect this would be another success after the success of their previous participating proposal in the fund. On the other hand, their teammates are all experts in studying Haskell and have 5 - year experience and above. One of them is an English teacher and Translator in Vietnam who has 7-year experience. There is also the attached link to their profiles for verifying or identifying who they are. Last but not least, I think Haskell is not an understandable programming language, so the proposer offered $20 for each translating page that is reasonable and acceptable. There would be a lot of specialized terms that cannot be found easily in an ordinary dictionary. Hence, it would take a lot of time in figuring out the suitable Vietnamese vocabulary in order to make sure that it is a condensed content but understandable.", "q1r": 5, "q2": "In auditability, the proposer has given his definition toward “success” in this proposal by the targeted number attached in the answer for example reaching 500 downloads in the first 3 months, or there would be new 10 developers joining Plutus Pioneer Program, etc. This is visible for people or for experts to keep track of this proposal and evaluate whether it reaches those numbers or not and is it successful or failed. This approach is absolutely a simple one for the Cardano community to verify the successful possibility and the progress of translating tasks. Briefly, I am appreciating this proposal a lot on all aspects mentioned here and above.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 14782, "q0": "The book Learn You a Haskell for Great Good! A Beginner's Guide is a great book that I read when I wanted to learn about Haskell. Why am I learning about Haskell? Because Cardano's Smart Contract is built using Plutus. And Plutus is a programming language that is 90% similar to Haskell. Plutus is a new programming language so learning material about it is rare. Therefore, Haskell is a perfect choice for developers to get acquainted with Plutus.\nBooks like these are a must-have so that those who don't know anything about Haskell can start learning Haskell and become a Cardano developer in the future.\nThis book is also recommended by IOHK when you want to join the Plutus Pioneer Program. You'd be crazy if you didn't learn Haskell before joining the Plutus Pioneer Program.\nTherefore, translating this book into Vietnamese will be of great help to Vietnamese developers who can participate in building projects on Cardano.", "q0r": 5, "q1": "Proposal's team has a proposal on translating Haskell books into Vietnamese, which is a pretty good experience to demonstrate the team's ability to implement this proposal.\nProposal's team has finished translating the book Real World Haskell (2008, O'Reilly Media) within the first month of making the proposal at fund 8 which is a great demonstration to demonstrate the team's ability to implement this proposal.\nThe team has 3 people with Haskell experience from 5-11 years, 1 translator with 7 years of experience, 1 community admin. All team members have experience related to the work in the proposal.", "q1r": 5, "q2": "The book will be uploaded to the drive as a very clear way to audit the results of this proposal. Besides, the proposal's team also sets out very specific goals that can be achieved by the proposal\n- Reached 500 downloads in the first 3 months\n- 10 developers join the Plutus Pioneer Program\n- 5 proposals from developers in Vietnam submitted to Catalyst\nAll of these goals of the proposal are verifiable through the download check on google drive, the number of developers joining the Plutus Pionner Program can be checked through the registration forms. Proposal from developers in Vietnam can also be checked by \"Has someone referred you to become a proposer?\" by Catalyst.\nTherefore, this proposal is completely auditable", "q2r": 5, "assessor": "z_assessor_4100", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14797, "q0": "- Cardano Smart Contracts and dapps are all written in Plutus (we can build projects on Cardano with solidity or other programming languages ​​thanks to EVM. But these programming languages ​​don't work as good as Plutus.)\n- Plutus is built on top of Haskell, so programming in Plutus is not much different from Haskell (they are almost 95% similar). In addition, there is not much documentation about Plutus because Plutus is still in the development stage. Therefore, Haskell documents are the most optimal documents today for developers to start building projects and Smart Contracts on Cardano.\n- IOHK's Plutus Pioneer Program is a Plutus program for developers who want to build projects on Cardano in the future. This program is not for coding beginners. Some prior knowledge of Haskell or functional programming is recommended, as Plutus is heavily based on Haskell and includes advanced features like Template Haskell, type-level programming, and effect systems. IOHK recommend that you read the book \"Learn You a Haskell for Great Good! A Beginner's Guide\" before taking the course. Therefore, the book \"Learn You a Haskell for Great Good! A Beginner's Guide\" is very important for developers who want to learn Haskell\n- Documents about Haskell in Vietnam are currently very lacking (when I search with the keyword \"Haskell programming books\" in Vietnamese, I only see google recommend books on Python and C++ programming, not Haskell books. ). Vietnam scored 486/800 points, ranking 66/112 countries and territories on the adult English proficiency index. So it is a huge barrier for developers in Vietnam who want to become Haskell developers.\n- Therefore, this Proposal wants to translate the book \"Learn You a Haskell for Great Good! A Beginner's Guide\" into Vietnamese to help developers in Vietnam with Vietnamese documents to learn Haskell. I think this is a proposal that can develop a large number of developers in Vietnam who want to participate in building projects on Cardano.\n- This book will help developers in Vietnam not face language barriers when learning Haskell anymore. Currently, Haskell is an uncommon programming language in Vietnam possibly because of the lack of such documents.\n- If this book can be translated into more languages ​​then that would be a great thing for developer development on Cardano in the future.", "q0r": 5, "q1": "- In the detailed plan of the team, the team has come up with a plan to translate the proposal in the first month and a marketing plan in the second and third months.\n- In fund 8 the team, there is also a proposal to translate Haskell book into Vietnamese (Real World Haskell book) and the team finished translating that book (650 pages) in the first month (book download link is attached in detailed plan section). So I believe the team was able to execute the proposal as planned without any problems as the book \"Learn You a Haskell for Great Good! A Beginner's Guide\" is only 404 pages.\n- The team also has 2 Haskell proposals funded at fund 8 and they are also about 60% completed (checkable in the team's youtube and github links). This helps further demonstrate the probability of success of this proposal.\n- In fund 9, the team also submitted 3 proposals. The total execution time of the other 2 proposals is also listed in the detailed plan of the proposal. With a total implementation time of 2 proposals which is about 68 hours/month, the team has enough time to implement all 5 proposals at once if all 3 proposals in this fund 9 of the team are funded. I don't see the team overload in this detailed plan.\n- The team is also the admin of 2 facebook groups with more than 50,000 members and 1 telegram group with more than 1,000 members. So the marketing plan of the team is completely feasible.\n- The budget breakdown of the proposal calculated based on the number of pages of the book is also very reasonable. It is a common way to calculate the cost of translation services in the market.\n- Proposal's team has 3 members, Haskell developer and Haskell teacher with 5 - 11 years of experience and an English teacher, translator in Vietnam with 7 years of experience. These experiences are all proven by each member's github and youtube channel. So I believe that with this experience of the team, this proposal is completely feasible.\n- The book that the team wants to translate does not have copyright issues, so copyright is not a barrier for the proposal.", "q1r": 5, "q2": "- The metrics of the proposal are easy to measure and check the implementation process.\n- We can check the implementation of the proposal right in the team's first monthly report (because the book was translated in the first month)\n- The number of document downloads is completely measurable.\n- The team also set very specific goals in the 2nd and 3rd months in the detailed plan (achieved 200 downloads in the 2nd month, 500 downloads in the 3rd month).\n- \"10 developers join the Plutus Pioneer Program and 5 proposals from developers in Vietnam submitted to Catalyst\" are goals that demonstrate the direct impact of the proposal. This objective also highlights the proposal's ability to solve the challenge.\n\n- Proposal's team can conduct a few survey forms to check the interest of developers after reading this document, which is also a way to measure the success of the proposal.", "q2r": 5, "assessor": "z_assessor_4101", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will translate the book \"Learn You a Haskell for Great Good! A Beginner's Guide\"(recommended book from IOHK) into Vietnamese and share it with current Developer communities in Vietnam.", "experience": "\n2 Haskell Developers with 5 years of Haskell programming experience\n1 Haskell Teacher with 11 years of Haskell programming experience\n7 years experience as an translator in Vietnam\nAn admin of Cardano Community (40,000 followers)\n2 funded proposals about Haskell in fund 8\n"}