{"id": 415781, "author": "calexander", "title": "ADA Web3 Wallet Integration Package", "url": "https://cardano.ideascale.com/a/dtd/415781-48088", "category": 26597, "amount": 7500, "description": "At the moment, there is no convenient package that developers on Cardano can use to integrate their dApp with the various browser-based ADA wallets.", "f6_no_assessments": 7, "f6_rating": 3.952380952380953, "videos": [], "media": [], "f6_assessments": [{"id": 708, "q0": "The proposers identify the need for a package that allows integration between Cardano web wallets and the web3 applications.  Such a package would enable developers to connect their apps to users’ web wallets and also demonstrate to new developers coming from outside of Cardano a quick way to start. This, in principal, is a good thing to have; however, the proposers does not take into account that packages that do this already exist in the Cardano ecosystem and that there is a CIP30 standard to which web wallets are developed, and that dictates the methods that they need to expose. These packages also use the cardano serialization-lib. I doubt that the proposal in its current form addresses the challenge and would deliver something of value to the community.", "q0r": 3, "q1": "The Proposal lists the individuals who will work on the project, links to LinkedIn profiles, and includes a short bio. Their skill-set is primarily in web development and EVM type of infrastructure where they mention experience with Ethers, Solidity, Truffle, Hardhat and others.  The proposers also mention that they are new to Cardano and I’d like to welcome them wholeheartedly. The budget is $7,000 and is broken down into three elements where the bulk of the budget goes against coding and development and very small amounts against UI modals and documentation.  The proposed timeline is to have the back-end and front-end developed in Q3 this year and publish a package before the end of September on GitHub. I suggest the proposers check the following links before proceeding with any developments as there are packages that have already been built for this purpose:\nhttps://developers.cardano.org/docs/get-started/cardano-serialization-lib/create-react-app \nhttps://github.com/dynamicstrategies/cardano-wallet-connector\nhttps://github.com/HarmonicPool/cardano-wallet-interface \nI also suggest the proposers check the CIP30 standard to which all Cardano web wallets are built. The standard implies that a connector for one wallet will automatically work for other wallets; therefore, there is no need to list all the wallets upfront.\nhttps://cips.cardano.org/cips/cip30/\n \nThe proposers highlight that the main risk is that new wallets will be created and they will need to integrate them into their packaged; however the CIP30 standard implies that this will be done automatically.  The package will be implemented in JavaScript.  Overall, I think the proposers are missing some background knowledge about how apps connect to web-wallets in the Cardano ecosystem and that a number of projects have overcome this challenge in the past. Therefore in its current form, I doubt that the proposer would be able to deliver a valuable product\n", "q1r": 3, "q2": "The proposers aim to deliver a package by the end of Q3 this year and has 4 milestones: to develop the back and the front end, design the UI, write documentation, and publish the package to Github. The Milestones are very generic and don't go into the specifics of how. The KPIs will be measured as quantity and quality of contribution to the code, however, no objective measures are proposed. Additionally, progress will be measured by the quality of the documentation, however, no objective measures are proposed.  Success is measured as the delivery of the package integrated with popular Cardano wallets. The deliverable is objective; however, the implementation plan is lacking in detail, and intermediary KPIs are subjective. ", "q2r": 3, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1874, "q0": "On the surface, the proposer's case that wallet-integration is needed seems sensible.  However, with the CIP-30 wallet protocol implemented by browser plugins, the proposal doesn't stand up to the challenge brief's \"What are the the tools that we need to prioritize first?\" that's because \"Filling in gaps\" in our ecosystem is a relevant guiding factor from the challenge brief, and this proposed work is redundant.  \n\nRegarding the proposer's claim of \"would drastically improve the developer experience on Cardano, and would likely attract many more to participate in it\" - this is the draw of the CIP-30 interface specification, and wallets themselves are doing a decent job of implementing that specification.  \n\nGuidance for the proposer would be to do more research about existing solutions and practical problems found in the Cardano developer community, then seek funding for work that is needed.  Alternatively, if CIP-30 was well-known to the proposer, they should describe how/why they see a gap unfilled.\n\nI offer welcome to Clint and team to get deeper into our ecosystem.  Proposal writing is a serious commitment and hard work.  I am sorry that my assessment cannot give more credit in the way of ratings for the amount of time and attention that you must have devoted to it.  My hope is that my constructive feedback can be considered as a repayment for your effort.", "q0r": 1, "q1": "The presented plan doesn't provide supporting details that would show HOW they would plan to address the perceived problem - the specific work planned. \n\nTo improve it, you could describe a specific API with functions you're proposing to implement, addressing some specific use-cases that are unmet needs as a result of current implementations of CIP-30.  Mentioning CIP-30 would also be a prerequisite to proposing work of this type, showing that you're aware of what is already present in the developer ecosystem.\n\nHaving reviewed the comments here in IdeaScale, it seems there have already been some people with the idea to abstract and simplify what is offered in CIP-30 to fill some simple subset of the standard wallet interface, so I suspect that the feedback here (redundancy) is not news - and I'm sorry for any sense of maybe \"piling on\" with the criticism.  \n\nBecause there is significant lack of clarity in what would be done, the attempts to describe risks are not very meaningful.   \"there are always ... challenges\" and \"we feel ... capable\" is neither risk analysis nor mitigation.  Talking about dealing effectively with differences between wallet implementations would demonstrate a greater understanding of the practicalities for this problem space.   Guidance for the proposer would be to first have a more substantial plan - risk identification and mitigation would then be easier and more meaningful.\n\nOther considerations such as the proposer's references and suitability of budget to the scope are not evaluated here because of the more fundamental problems described above.    I will note, however, that it is unclear how a team of this size is needed or would get sufficient financial support from the suggested budget.  \n\nSome more constructive feedback: the proposal could be improved in the way of feasibility by showing a clear milestone plan (achieving specific points of progress, not just describing some activities happening during some timeframes).  Also, budgetary breakdowns connected to milestones and contributions/roles can make a good difference in the way of assessing the feasibility of a robust plan.  Check out some of the funded proposers that show individuals filling roles such as project-management and documentation, with budget breakdowns showing how much is to be spent on those activities.\n\nBudget breakdowns can also be a way of constructing a proposed top-line budget that, based on good planning, will improve feasibility rating (even if the number is larger).", "q1r": 2, "q2": "It is difficult to assess on this point, in that the deficiencies in the rest of the proposal are so significant that questions of auditing progress and success are largely mooted.  HOWEVER, I'm putting aside those considerations to focus on the offered ways of measuring progress in general.\n\nThe proposed auditing phases such as \"one wallet\" and \"documentation\" would be good as actual milestones, and progress against milestones would be usefully added as a way of measuring progress. Showing this in Auditability section earns some points. \n\nThe number of commits in an open-source repo is a good measure you suggested.  Also,   counting the number of users of the library.  For the general area of solution you're addressing in this proposal, you could suggest that you'll be optimizing time required for app developers to integrate with wallets.\n\nNote that \"Progress can be judged by the quality...[of commits and docs]\", while true, isn't a good way to MEASURE progress.  Judging quality is hard, while measuring results should be easier.  \n\nEverything about auditability will become easier with a clearer, more needed plan.  Best wishes for your next contributions to Cardano!", "q2r": 4, "assessor": "z_assessor_2282", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 3114, "q0": "With more and more wallets added to the Cardano ecosystem. Its taxing for developers to integrate each one of them into their system. With this proposal, the solution is clear. A Javascript package to integrate to majority of Cardano's wallet. Most of the dApps would be using Javascript, thus this would definitely bring adoption in, as this proposal fixes one of the entry barrier for new developers wanting to join the Cardano space. With that in mind, I strong agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team member listed in this proposal is solid with a good track record. Budget breakdown is listed out clearly across a clear timeline which is schedule to complete on Q4 2022. The major risk has been stated in the proposal with solution in mind, which is a plus. However, what concerns me is the fact the budget of 7500 might be a little challenging for this project. As we all know that the vast amount of wallet coming to the Cardano space is going to be massive. Would the team have sufficient budget to cover the cost of new emerging wallet into the Javascript package? To be fair the proposal did mention of a future Funding of Catalysts. But that would cost time and delay. That is the only concern I have regarding this proposal. Other than that, it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "One key word I found in this proposal is the transparency the team shows. The project would be fully open source for anyone to track and monitor. Developers may submit feedbacks as well which is a huge plus. Key indicators are mentioned as well to track the progress and the success of the project. All in all, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2403", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7878, "q0": "Going forward, our wallets will serve as a proxy for our identities, therefore having access to them in any endeavor is crucial. Numerous proposals have been made in an effort to address the problem of how to integrate DApps with our wallets. Although the proposer in this case is moving in the same direction, he is worried about web-based wallets like Nami and Eternl. It is past time that Cardano receives this feature as it is already present on other networks like Ethereum. If one can persuade a library to complete this duty with little effort, the aftermath of this suggestion would be enormous. This would allow customers to use it as an identity to access the feature of the integrating projects instead of recurring KYCs, and it would also help projects that integrate wallets save time and effort. Additionally, the author promises to maintain a careful check on a number of alternative wallets that are becoming more popular as well as the shifting settings of the integrated wallets. The availability of this open-source library will undoubtedly benefit both the community and other blockchain developers by enhancing their overall development experience.", "q0r": 5, "q1": "The squad backs the amazing notion that has been put out with a carefully thought-out game plan. The reader can easily comprehend what the team is hoping to accomplish by the end of this year thanks to the schedule and the related milestones, which are both highly succinct and one-liners. The team has already put in a significant amount of background work in order to find the integrating wallets, which demonstrates their enthusiasm for their job and the fact that they aren't actually waiting for funds before beginning. The Tangent team that was assembled for this project appears to be doing well and closes practically all of the gaps. Through the thorough introduction, the author gives us, it is easy to assess the experience each of them brings to this endeavor, and it is noteworthy. Even if the amount asked is fairly little in comparison to the challenge's total budget, the breakdown between salary and team operations is ambiguous and lacking in specifics. Perhaps a bit more specificity would have been helpful to them. Therefore, considering this is the first proposal of the team and some missing detailing, I would rate the feasibility as a 4 out of 5.", "q1r": 4, "q2": "The project's success is understood by the proposer, who has outlined potential performance indicators that the community might use to monitor its development. The measurements for the challenge align with the KPIs. Because of this, the author offers us techniques like tracking Git commits (since the project is open-source), documentation improvements, and the number of wallets integrated into the library as potential ways to evaluate the quality and quantity of the project progress. The author is aware of the difficulty in tracking a project that is heavily development-oriented. The author does an excellent job of illustrating what the success of this proposal would look like; for example, when outside developers start using this package and contributing to GitHub by recommending changes to the repository, that is the ultimate success signal. The team will also provide frequent updates to anyone who wishes to keep track of the development. Because they are a new team, they have done an excellent job of finding the quantifiable metrics in a project that is a little difficult to track because it lacks an Ui/Ux to show apparent changes or updates.", "q2r": 5, "assessor": "z_assessor_2930", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9614, "q0": "This project addresses the challenge perfectly. This project aims to build a Javascript package that makes it easy for dApps to connect to multiple popular browser-based wallets today (including Eternl, Nami & Flint). This makes it easy for dApps developers to build web3 apps without having to learn and integrate each wallet one by one. When this package is properly built, it saves a lot of web3 developers time and effort, helping them focus on building their apps without spending too much time solving common wallet integration problems. I fully believe that this package will increase the productivity of developers and help them have a more positive experience when building web3 projects on Cardano, so I give this project 5 stars for its impact.", "q0r": 5, "q1": "The project is implemented by the Tangent team, a team that has experience in building financial projects on Cardano. The proposal also highlights team members' skills and experience. With what is stated in the proposal, I think they have the ability to successfully carry out this project.\n\nThe budget of the project has been divided into small items but is not very specific. The project can be more detailed to make the budget expenditure clear. For example, by spending $6000 on Wallet Package Coding Development, the project can detail how many developers are required to work, how many hours each developer works, and what is the developer's hourly pay rate. This will make the project more complete. In my opinion, the budget of $7500 is reasonable to implement this project.\n\nRegarding the timetable, completing the project within 6 months for me is reasonable. However, according to my understanding, in addition to this project, the team also has 2 other projects in Fund 9. So the proposer needs to describe more carefully how to manage the project so that they can ensure progress in case all 3 projects are funded\n\nRegarding the risks that may be encountered, the project has raised two risks: difficulties in software development and changes in the updates of wallets, leading to the package needing to be updated after completion. The project has provided solutions to solve each challenge and in my opinion, they have prepared very well for this project.\n\nIn summary, from what is described in the proposal, I have full confidence that the team can make the project a success. However they need to be more detailed about the budget and how they manage their projects, I would be happy to give the project 5 stars if they add that content.", "q1r": 4, "q2": "The project detailed how they measure the progress of the project. This includes the quality and quantity of contributions towards the code, the number of wallets that have been integrated and the completion of the documentation. The above information is pubic on GitHub for the community to monitor and verify for themselves. For me, the information given is enough to audit the progress and success of the project.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12397, "q0": "The idea of this proposal is to make package (Javascript) consisting of various browser based Cardano wallets (e.g. Eternl, Nami, Flint) and make it available for developers to use when they need to integrate Cardano wallets with their applications as an open-source project. I think the problem this project is trying to tackle is very relevant to developers working with Cardano since there really is no “one-stop shop” to find resources where they can easily integrate multiple wallets with their products since web3 development in general is still relatively new. I personally think that the project’s goal can add value to the Cardano developer ecosystem and is very well aligned with the challenge setting objective of making a “supportive environment for developers” by giving more resources to developers working on Cardano projects and in turns would draw more developers into Cardano as well. ", "q0r": 5, "q1": "The team consists of members with experience working as developers involving fullstack development, and as Plutus pioneers working on Cardano projects. Evidence of their past experiences have been linked extensively in the proposal (i.e. LinkedIn and links to their projects) which shows that the team has the relevant skills to execute this project. \n\nThe budget of 7500 USD was requested and has been broken down into identifiable items consisting of the wallet coding development, UI, and documentation. However, I’d like more details regarding the budget allocations. For example, information such as the number of people involved, the total workhours, and the hourly rate requested for each items mentioned above would have been appreciated so that the budget request can be evaluated more clearly.\n\nThe 6 months roadmap has been well laid out into two quarters of 2022 with their respective milestones, which is development and publishing to GIthub by Q3 as well as audit and revision by Q4. With a clear roadmap, the project seems feasible to be completed in a timely manner. \n\nOverall, the team members involved have the relevant skills and experience to execute the project and the roadmap has been laid out well however the budget allocation lacks some details.", "q1r": 4, "q2": "The project will be made open-source on Github so the progress will be easily tracked during its implementation. The metrics chosen by the proposer to measure the project performance are “number of wallets integrated within the package”, “number of contribution on Github (i.e. forks or amendments), as well as the “quality of the documentation”. The KPIs chosen are relevant measurement of the projects success and outreach. However, unlike the “number of wallets integrated within the package” and “number of contribution on Github” metrics that are quantitative and easily measurable, there were no explanations on how the “quality of the documentation” will be evaluated (i.e. will it be sent to external party or will be evaluated internally?)> More information regarding this point would be appreciated. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14966, "q0": "Initially, the problem stated by the proposer is very practical. Since there is no convenient package to integrate dApps with the various ADA wallets, this becomes an obstacle that might discourage the developers within Cardano community from coming up with new ideas or building their own projects. As regards this problem, the author intends to build a package that will allow the integration of many popular wallets into web3 applications easily, which I find would save a lot of time and money for software builders. Especially, to some extent, I believe that this would benefit the Catalyst community and incentivize more proposals being written, since developers can conveniently improve their projects. Nevertheless, in order to make the impact generated by this idea more convincing, I suggest that this section include more collective datas about how costly the process of integrating crypto wallets into web3 applications is, or a survey within the community expressing their attitudes towards the convenience of this package. Furthermore, any relevant proof or evidence showing that this package is practically necessary as well as some goals that the team is aiming for in the future should be added into the proposal in order to help the Catalyst have a better understanding about the whole project. Additionally, the team should also describe what method they are going to use to popularize this package, especially for the Cardano community. Besides, the team successfully brings about a solution that aligns well with the challenge settings. The risks that they might face are also well-prepared with particular mitigations. To conclude, the information offered in this section is quite sufficient, expressing a very innovative idea, yet, it is still humble. Personally, I would highly recommend the team reconsider my suggestions above in the progress of improving the project.", "q0r": 3, "q1": "In this section, a plan is provided, showing the current status of the package and the next milestones that they are going to perform. Generally, the package is going to be officially done by the end of 2022 if the proposal is funded. In my opinion, the steps included in this plan are specific and convincing. Besides, a budget breakdown is also given in this part, with the total fund required of $7,500. Coming along with this figure is the introduction of the Tangent team, which includes 7 members with particular responsibilities, work experience and professions. Each member also offers an affiliate link for further background checks and an address to contact, which I find very professional and verified. In my opinion, after doing a quick research, the requested budget is reasonable and the team is very suitable for such a project.", "q1r": 5, "q2": "The idea of an open-source code is very innovative since it allows anyone to observe and contribute to the project. It is also an advantage that helps the community as well as the Catalyst keep track of the progress. However, if this proposal is funded, I still recommend the team make regular reports towards the Catalyst. Moreover, some specific KPIs should also be clarified in this part, such as the total number of wallets expected to be integrated, the expected quantity and quality of contributions by the community, the expected total use cases of the community,... By setting these figures particularly, the team might be able to have a clearer view about the ambitions and keep up with those more closely. Besides, the success measures are very reasonable, yet, I suggest that they should settle some sustainable development goals in order to ensure the long-term growth of the project.", "q2r": 3, "assessor": "z_assessor_4118", "no_vca": 16, "ne": 3, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Our solution to this problem is to create a package (including documentation) that developers can use to easily integrate browser-based wallets (Eternl, Nami, Flint, etc.) into their application.", "experience": "Tangent is the radical art & finance project built on the Cardano network. Our team is composed of experienced web2 and web3 developers, alongside talented Plutus pioneers building on Cardano."}