{"id": 416191, "author": "jaitnez", "title": "Learn-to-Earn Open Source Tooling", "url": "https://cardano.ideascale.com/a/dtd/416191-48088", "category": 26597, "amount": 19440, "description": "Currently there are no Plutus Smart Contract references or blueprints for eLearning platforms seeking to implement Learn2Earn mechanics using Blockchain.", "f6_no_assessments": 8, "f6_rating": 4.291666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3200, "q0": "In terms of impact this proposal matches all requisites and I must say that it is brilliant! One it’s completed, the project will open roads to other entrepreneurs working with educational projects. It makes smart contracts and tokenization of education content more accessible to those who want to explore this technology. Moreover, it’s clearly articulated and has the potential to be scaled up. Considering all these elements, a score of 5 is appropriate. ", "q0r": 5, "q1": "The proposers have presented a challenge in the risk section, which is the fact that the ecosystem is still young. However, their solution to mitigate is a bit subjective and arguably ineffective: to stay confident and trust on their solution. To improve this aspect, proposers could point out other possible risks and provide concrete information about how they are planning to mitigate them.  \nOn the other hand, the proposal has a qualified team with detailed information, and this team is already working in a previously funded proposal that has great synergy with the current one – in fact, this proposal is a continuation of the previous.\nThe budget breakdown is not complicated to understand and reflects the needs of the proposal. Timeline, resources, and overall plan are well described and no issues were found in this assessment. Therefore, apart from the issue of the risks that the proposal might encounter, it seems to be feasible and a score of 4 is appropriate. ", "q1r": 4, "q2": "There are coherent metrics to measure the progress of this proposal and they are compatible with normal software development processes. The milestones are relatively “mergeable” with previous proposal and the deliverables are quite simple to track. The design of the proposal is simple but clear, so it’s easy for the community to monitor either its success or their products. In this case, a score of 5 is fair. ", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8290, "q0": "Bringing education to the cardano community is essential as many new users of cardano are excited to learn deeper or even help their family and friends understand the beauty of cardano. \nLast fund the group offered a learn to earn program that allows to match people that want to learn a topic with someone who is a veteran. And the more your use the platform the more tokens you earn either teaching or learning. \nThis can be applied to various topics around cardano and its technology or even to outside applications. \nThe scaling of this project relies on setting up an open source Smart Contract. \nThe value of this proposal will allow any other platform that is looking to benefit from teaching topics to use the open source contract and apply it to their platform. \nI know that many different regional proposal are aiming to provide local training and introduction and this may be an essential tool to save them time in development and focus on the topics and generating buzz and marketing to onboard more people. ", "q0r": 5, "q1": "As this team is familiar with the catalyst funding mechanism from previously funded proposal. I am confident that the reporting requirements are well prepared. \nThe team is highly academic and has a long teaching experience from universities and other teaching platforms. They have informed the team that 3-4 months of funded project will be needed to start generating progress reports and completed deliverable. I do find that a little odd as there can always be some form of progress reports on a monthly or biweekly frequency. \nThe cost of the project is very conservative they have simply requested the developper fees to cover their hourly rate. In addition the team is already assigned and working on the learn to earn platform. \n", "q1r": 4, "q2": "I am pleased with the open source GitHub reporting they have offered in addition the programming time spent can be tracked by the progress reports they issue. \nFollowing the completion of the project the running smart contract. I also am pleased to see that the previously funded project is up and running and an indication that the community for this learn to earn application will only grown from here. \nI hope that this open source smart contract can be used for this platform and many others ", "q2r": 4, "assessor": "z_assessor_2972", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8681, "q0": "The main purpose of this project is to raise funds to provide plug-and-play Smart Contracts and open source tools for learning platforms looking to implement the Learn-to-Earn mechanism on Cardano. The Learn-to-Earn mechanism will be the driving force to encourage developers to learn, dig through the documentation and code to create applications, thereby contributing back to the diversity of Dapps on Cardano. And the solution of this proposal will further support and accelerate the implementation of the Learn2Earn mechanism of learning platforms on Cardano. I agree that this solution is completely in line with the goals and key metrics of this Challenge. The proposal also clarifies the positive impact it will have on developers and Cardano if their implementation is successful and committed to their performance.", "q0r": 5, "q1": "This proposal is to further develop and add Smart Contract backend features to the d-EdTech platform that was presented and funded in previous Funds. This shows that this is an efficient and reliable team. The information describing the members participating in this proposal shows that they are capable and experienced enough to be able to carry out the project well. The engineer hour estimates found in the budget allocation plan, hourly prorated budgets are a great starting point for audits. The project development plan is also presented concisely, easy to understand, and full of the necessary information, each development stage clearly outlines the main tasks and objectives to be accomplished.", "q1r": 5, "q2": "The proponent has committed to providing those interested in the project with different avenues so they can track its progress. Although the audit roadmap initially shaped the ideal concepts of metrics and milestones for measuring proposal performance, it lacked an important element,specific quantitative estimates that correspond to the concepts of KPIs are given. Giving KPI definitions without specific numbers is not enough basis to evaluate the positive impacts that the project will bring to Cardano.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14758, "q0": "The need to implement the Learn2Earn mechanism using Blockchain requires references or blueprints on Plutus Smart Contracts for eLearning platforms. However, currently, the community is lacking those things, so the Learn2Earn mechanism has not really been applied. Realizing that need, the team proposed the idea of ​​creating a project that provides plug-and-play Smart Contracts and tools for incentivized E-Learning initiatives in the Cardano ecosystem. I personally appreciate this idea and hope the project will be successful.\nProject features were mentioned in the proposal. How it works is also explained by the team. However, the main components and key activities of the project have not been detailed yet. The solution part needs to be written more clearly, in more detail, and easier to understand. In addition, the team should clearly define the audience that the project is targeting as well as show what value the project brings to those objects, and how the project affects these objects. This detail will help the community consider the impact of the project on the Cardano ecosystem community.\nThe goals set by the project are not outside the key metrics / KPIs that Challenge sets. The outcomes of the project aim to provide more options for developers to build within the Cardano ecosystem, reduce barriers and solve problems for newcomers to the community, and simplify users' experiences.\nThe team has not realized the difficulties when implementing the project. They believe in their vision and ability to execute projects. They are confident that their vision and plan will bring the project to success.", "q0r": 4, "q1": "To demonstrate the team's competence, they provided information (evidence, witnesses, or links...) about the skills and experience needed to carry out the activities mentioned in the proposal. The team made a project implementation plan lasting for 3 months. The tasks that need to be done are outlined by the team in the roadmap. However, the roadmap needs to clearly define the milestones. Each milestone should have a set of work items that need to be completed. Furthermore, the plan needs to have a realistic timeline to properly complete the given tasks. The proposal should mention the criteria to perform the work items. The proposal must show a reasonable plan not only in terms of what they will complete but also how it needs to be. The details of technical aspects such as architecture, language, and technology required to implement the plan should also be mentioned in the proposal. In addition, Proposer clearly identifies the positions and the number of people needed to carry out the proposed project. This blueprint will help the project be appreciated for its ability to achieve its goals as well as its potential for development.\nSimilar to the budget plan, the community needs a more specific spending plan to be able to consider whether the amount given by the team is reasonable or not. The budget plan must specify expenditures for activities and assets needed to implement the project and include salaries paid to personnel. The budget plan also needs to be presented in an easy-to-grasp bullet point.\nThe project brings together many members of the founder team. These members all have extensive experience in the field and have done many projects before. They have enough knowledge and skills to ensure the successful implementation of the project. With the leadership of the founding team, the project has great potential for development and brings great benefits to the community.", "q1r": 3, "q2": "The successful image of the project has been clearly shown by the team through the set goals. The team will report the project's progress to the community every two weeks using the Notion tool. The community will rely on this report to monitor the project. In addition, the team also introduced additional criteria to evaluate the success of the project at the early stage including the Number of external contributions to the design and development of contracts, Number of projects inherit. benefit from the tool, the Number of Issues Solved and later stages will improve those criteria. However, the community will need specific numbers for these criteria. The team should establish the quantitative indicators the project is aiming for and include that information in the proposal.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 15001, "q0": "The proposers aim to create a set of open source contracts to be used as a template for Learn2Earn - incentivized e-learning on the Cardano blockchain. The idea sounds like it would be great for this challenge, however, after reviewing the information presented in the proposal and the linked github repository, it is difficult to say exactly what this means. It would be useful to have an example usecase scenario that demonstrates how this system might be used to more effectively show the impact it would have on making a developer's job easier. The github repository is mostly placeholder in spots where useful information would be found, files like \"ayllu-docs/fundamentals/how-it-works.md\" are very high level and don't explain much beyond how there will be tokens and an economy. Adding further to the confusion is the inclusion of IoT (Internet of Things) libraries with no explanation what this has to do with incentivized learning. What does IoT have to do with eLearning? Will there be some physical devices used to communicate with the blockchain? The work in github seems like it might be part of a proposal that was previously funded but the commit logs are not very descriptive so it is difficult to say exactly what was being worked on.", "q0r": 3, "q1": "The team detailed in the proposal and in github (ayllu-docs/about-ayllu/meet-the-team.md) seem very capable and experienced - there area wide variety of skills here from Comp Sci Graduates to Stake Pool Operators to experienced Systems Engineers to Teachers and Plutus Pioneers with Blockchain development experience. The team has linked in profiles provided. With these skillsets, it should not be a problem to implement a technical system such as a smart contract and scripts that utilize existing Cardano tools as described in the proposal. It is concerning though that the hourly wages for such skilled talent is so low ($5/hr?) - this isn't explained in the proposal but there is an explanation in the comment section that the team is partially working pro-bono", "q1r": 5, "q2": "The proposer states that they have been using \"ClickUp\" to track progress but will switch to notion to provide updates to the community which is great for transparency. There are several milestones and progress indicators listed, but they seem a bit generic and hard to quantify as well as not really measuring the success of the project (for example, number of external contributions or number of bugs resolved). The git repository they are using is public so it is straightforward to see the progress of work through github commits, but as mentioned earlier, the commit logs are not very detailed and it is difficult to know what milestones they are trying to make progress towards.", "q2r": 3, "assessor": "z_assessor_2242", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15053, "q0": "An interesting idea. \nThere are several proposals to create a Learn to Earn platform. However, these proposals have difficulty implementing the Learn to Earn mechanism with blockchain technology because there is no reference or blueprint for the Plutus smart contract. The proponent wants to solve this problem by providing Plug and play intelligent agreements and tools for Learn2Earn projects in the Cardano ecosystem. This makes it easier and more convenient for developers to create Learn2Earn blockchain application development platforms. This proposal is impactful and in line with Challenge.\nHowever, a minus point here is that the proponent has not mentioned the main risks encountered when implementing the project. Proponents should think more carefully about risks and risk reduction options. Because predicting risks will help the project when deployed, it can actively cope and solve it in the best way.", "q0r": 4, "q1": "Regarding the implementation plan, the proposer will implement the project in 3 months. The work items listed are detailed. Includes work from collecting smart contract reference documents, smart contract development in Haskell/Plutus programming languages, library integration, and testing.\nThe proponent should review the cost categories. The budget is given, with the main cost being the labor cost for two brilliant contract engineers (one full-time, one part-time). The specific calculation formula and labor unit cost is 27 USD/hour. Labor unit cost is not too high for programmers. However, is it reasonable to budget only for labor costs? Because I think when the product is finished, there is a need for marketing costs to let the community know about the tools or needing costs for the manager so that the project could be managed well.\nAbout the development team, two members have extensive programming experience and have participated in the pioneering program of Plutus. There are also contributions from 6 other software engineers. Therefore, there is no concern about the technical side of the idea. Information and experiences are stated in the Linkedin link.", "q1r": 4, "q2": "This proposal has a clear development path. Quantitative KPIs, however, do not have specific numbers. For example, the number of projects benefiting from the tool is a general indicator of progress but not a particular number of targets. The proponent should give an exact target number to get motivated to develop the project and manage the progress better.\nCatalyst and the community can track project progress through monthly progress reports, the ClickUp platform, Notion, and the development team's soon-to-be-completed website.", "q2r": 4, "assessor": "z_assessor_2578", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15184, "q0": "The proposal fits well in the Developer Ecosystem challenge, as it answers several of the guiding questions of the campaign brief, but I have some reservations regarding the real world impact of the project by reading just the text of the proposal. \n\nThe value brought to the Cardano ecosystem by smart contract templates and tooling specifically built for potential Learn-to-Earn platforms is there, but there is a slight problem with the current presentation, namely the fact that no actual d-EdTech projects, or potential projects that would use the tooling, are presented or described.\n\nIt might be a case of “build it and the’ll come, but it also might turn out to be a case of funding the development of unused code. The text of the proposal doesn’t make a strong enough argument. Because of this I’m inclined to be neutral, but I strongly encourage the team to work on their presentation, because the potential is definitely there and I would have really liked to be able to give the proposal a perfect grade.\n\nI also appreciate the fact that the team is aware of the risk of the novelty of the ecosystem and that they address it in the proposal.", "q0r": 4, "q1": "The team that would implement the project is very well presented and seems to have all the competencies required to successfully cary out the work of building the smart contract templates and tooling. From the information presented and the provided links they seem to be a highly skilled group of Plutus Pioneers, Haskell developers, data scientists and academics. The implementation effort will be lead by Antonio Hernández-Garduño and Roberto Cerrud, both highly experience professionals, with proven credentials. This is undoubtedly a big plus towards the feasibility of the project.\n\nAn implementation plan for 3 months is presented and given the straight forward nature of this development project it is descriptive but concise and logical to follow.\n\nThe budget also mirrors the straight forward nature of the project as it only allocates for 1 full time and one part time developer. I find the pay for a smart contract developer to be low, but given the location of the team it might be feasible.", "q1r": 5, "q2": "The team plans to use Notion to report on their progress to the Cardano community on a bi-weekly schedule. Notion is a platform that describes itself as the “internet's only all-in-one workspace for essential work tools”. This clearly presented plan for communication, coupled with the very clearly described KPIs and milestones means that the project will be very easy to follow and audit by the Cardano community.\n\nThe proposal describes three main pillars for measuring the success of the project. From them we can once again see the potential importance of creating smart contract templates that will make the deployment on Cardano of Learn-to-Earn platforms that much easier. ", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15295, "q0": "A key feature that makes Cardano stand out from the rest of the L1s in this Industry is the focus on Education as a fundamental axis, as well as its focus on being a financial solution, which is especially important for developing countries. By developing an Open Source d-EdTech platform for developing regions, Ayllu Academy combines these two characteristics. They have been working on this project for more than a year, and in fund 7 they were selected for funding allocation. This time, they return to Catalyst proposing to build a plug-and-play toolkit that will also be open source, necessary to continue building their ambitious project. Since this challenge intends to improve the development experience for building Cardano solutions, I believe what they propose to build is perfectly aligned, since this toolkit could be used to build different educational platforms globally. \n", "q0r": 5, "q1": "The budget requested for this proposal is dedicated exclusively to the funds needed to pay for the professional hours of 2 smart contract developers, of which one will be full-time and one part-time. I find the cost per developer hour particularly low, compared to the rest of the proposals I have seen during this fund. However, it will also depend on the salary range of the country where the developer is intended to be hired. The estimated timeline to complete the project is 3 months, which seems appropriate considering the planned workload. Finally, the people that make up the team are a good combination of skills and experience relevant to this project. Among these, we can highlight 4 Plutus Pioneers, ML Engineers, Data Scientist, among others, the links provided allow you to inspect the various repositories that currently have under development. \n", "q1r": 5, "q2": "The description of success presented contemplates that after the planned time for the closure of this project, all deliverables will be complete, that other projects will use this toolkit and increase the use of smart contracts through our Open Source Python-Cardano Library. All these expectations seem positive to me. However, I would have liked to see estimates in numbers that allow the community to estimate the return on the intention of this project. Of course, in this environment we all know that there are many variables that influence, but at the very least I would expect to see estimates of the impact or adoption of this solution. On the other hand, an excellent job is done describing all the means of communication and frequency by which the progress of this project can be known. In addition, it lists a set of healthy, simple and easy to measure metrics. \n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will deliver plug and play Smart Contracts and tooling for Incentivized eLearning initiatives within the Cardano ecosystem.", "experience": "Plutus Pioneers, Haskell Developers, Educators, Researchers, 20+ years of experience in software engineering, 15+ years DevOps expertise, Blockchain development, Plutus/Haskell/Solidity literacy, MLE expertise, and business acumen."}