{"id": 416132, "author": "matthalloran8", "title": "Open Smart Contract Library", "url": "https://cardano.ideascale.com/a/dtd/416132-48088", "category": 26597, "amount": 14650, "description": "Many developers like learning from examples, but they are hard to find for Plutus smart contracts.", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3531, "q0": "The proposal would build a place where developers would be able to how to create smart contracts by example. Developers will aslwo be able to build on top of contracts and create their own for others to learn from. This is a proposal that would impact the community moderayely because there are places where people can learn by example like this one: https://solidity-by-example.org/. It's going to be nice if there is such an updated repository for cardano as well. \nI mentioned a moderate impact be cause I didn't find any mention of supporting version of the created contract working on different versions of the platform they run on, or at least their updades to the newest version where a different kind of features could be available, which I think is an important part of the described solution if it's going to be practical. As a developer, I can say that versioning is important since you can't learn by example if the example isn't running for you on the specific version you're using. That's a big problem that every developer faces and an educational platform should keep this problem in mind.\nThe proposal could be able to overcome this challenge, but some more thought needs to be put in for the greater impact. Currently it's certainly not a bad proposal, but the possible usability is questionalbe. I believe the proposal is mathcing the challenge settings of the developer ecosystem challenge and would definately help grow developers grow and learn. This process can be optimized even further though. \nOverall, IMHO this is a good proposal with moderate impact.\n", "q0r": 4, "q1": "I like the timeline and roadmap of the project as it shows an iterative approach to the final solution which I can get behind. There are more than enough links left to find out more about the creator of vrooli who will be bringing this project to life and he has the necessary skills to finish this project. I do have some concerns about the time of one person as a resource and that considering there are more than one proposals, his time might be split. The budget is reasonable considering the 20 hour work week and the the whole price is definately reasonable. \nIntegrating DIDs and a place where smart cotracts can be potentially ran inside a ui instead of API calls would be great and an amazing benefit towards people learning. There's a realistic timetable for completing the work that looks good to me as a developer and can estimate the work is doable for 20 hours a week in the specified order and time.\nI think there are more risks to this project than just not having enough time to build it, because the bigger challenges to all projects usually concern adoption and I saw no mention of that in the project. This proposal is in sync with what's already been done, or in this case not done, because a repository of smart contracts and a future possible place to execute and test them out will be of great help.\nOverall this is a more or less feasible proposal for the reasons mentioned above.\n", "q1r": 4, "q2": "Considering this is an open-soruce project I predict no problems in auditability since anyone with internet available will have access and would be able to check the progress.\nA clear problem statement - developers learn better with examples, which I totally agree with. And a solution is provided - having a searchable repository for smart contracts.\nOverall this is an auditable proposal that has relevant metrics and good targets to chase - KPIs that would enable this project to monitor and optimize it's performance.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6585, "q0": "This proposal aims to elaborate and publish a free open-source smart contract library, which would allow developers to write smart contracts from scratch or to use other ones as templates. This could have a major impact on the developer ecosystem since it will increase development efficiency and productivity, which is directly related to Cardano and its dApps healthy growth. Moreover, the proposer pretends to develop a platform, similar to GitHub, where specifically Plutus and Solidity developers can establish contact and help each other during the early stages. If you take into account the difficulty to find information for these languages, this could be great for every single developer in the Cardano ecosystem. (Rating given: 5)\n", "q0r": 5, "q1": "The proposer is a full stack developer with a 10-year career and a 1st cohort Plutus Pioneer, which is more than enough to be in charge of this project. He presents a detailed milestones roadmap in which every activity has a time limit but at the same time, it provides the proposer with a great level of flexibility so that any problem could be solved without interrupting the course of the project. Therefore, the road map is quite reachable and balanced. Regarding the budget and having in mind that the project is being carried out by a single person, it provides the community with enough information and a rate of 45 USD/hour could be considered reasonable. If an objection should be made, for me there is not enough information about risk management and how will the proposer deal with them. (Rating given: 4)\n", "q1r": 4, "q2": "\n\tThanks to a well-specified road map and a great activities division, it is easy to track the progress of the project; it will only be needed to check if the road map is being completed according to schedule. Moreover, it is correct the KPIs proposed for the time when the platform is already running. This is because knowing the number of active users, for example, allows the proposer to track the evolution of the development community. From my point of view, this project´s final goal is aligned with the challenge settings and so the success of this proposal will mean success for the Cardano community.\n", "q2r": 5, "assessor": "z_assessor_2822", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6803, "q0": "Open Libraries with documentations, frameworks and various tools for Cardano Smart Contracts sounds like such a great idea in these challenging situation especially for developers on Cardano. Many developers are plagued with different kinds of problems most especially in their early journey into coding and most times, practical examples and pre-packed codes help in such kind of situation. In the case of Cardano native Smart Contract Language (Plutus, Marlowe), there's not enough documentation from resource hubs like stackoverflow and the few we can find there, are not well documented. This is a problem that need urgent attention by the Cardano community as well as the developers.\n\nThe proposer intends to provide a solution in form of an open library for Smart Contracts. A no code prototyping and automation platform for and on Cardano. The solution will therefore make available Smart Contracts, APIs, data, interfaces among others. These will be a feature-packed open source smart contract library with advanced search functionality that will help developers to streamline the discovery of smart contracts and allow for further contributions and improvements. However, these will have a huge positive impact on Cardanos developer community and i think it fits well into these challenge category.", "q0r": 5, "q1": "The proposer is a full stack software developer with 10years of experience and also 1st cohort plutus pioneer, website has already been built with robust and dynamic feature to accommodate proposers solution. These alone in my opinion indicate a positive step towards implementing the project effectively. Furthermore, the proposer provides me with relevant timeline and KPIs that clearly shows a realistic timetable and conductible implementation plan for the project. Some of those KPIs are Design plan for UX, API and server (completed), API and server upgraded, search engine for smart contracts with all metrics and ability for smart contracts to be forked/upgraded, Editor with syntax highlighting (Working), stable launch,..... among others. All these metrics are especially relevant to the underlying project and most are verifiably implemented already. The budget provided is well articulated/explained and the amount requested is fair and reasonable. My only concern is the team, since according to the proposer, the project will be developed by one person whose contact details (link was provided) and considering the huge work that seem to be involved in the project, I'm  a bit concerned if he alone can implement same effectively (Although he is a fullstack developer).", "q1r": 4, "q2": "Having provided a well defined realistic timeline, KPIs will be tracked automatically and freely accessible in real time. Furthermore, the goals for the project are clearly outlined and a successful implementation of these proposal will save thousands of developers time (Newbies and experts) and will allow for an increased rate of Smart Contract development on cardano.", "q2r": 5, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 12399, "q0": "This proposal is in alignment with the challenge brief of providing a supportive environment for developers. By giving more accessibility to resources via a free open-source library service, developers can more easily find and use smart contracts for their projects resulting in a higher level of convenience and time save in development process. In my view, the project is similar to Github, but specifically for smart contracts, which as pointed by the proposal, can be really valuable to the developer ecosystem. One aspect that has not been addressed sufficiently (in my opinion) is convincing users to use the service, since the library will be pretty much empty at the start and it will depend on users writing their own smart contracts to fill up the library resulting in little incentive of using the service at the start. Regardless, I still think that the idea can provide value to the Cardano developer ecosystem, or even well outside of Cardano. ", "q0r": 4, "q1": "The team member claims to have the relevant experience and skills needed to implement this project, being a full-stack developer and a Plutus Pioneer, which suggests they have the relevant skills and knowledge to implement this project. However, the links provided don’t mention/explain what projects they’ve worked on exactly. I think more explicit evidence would have been really helpful to back up the proposer’s claim.  \n\nThe roadmap is laid out well detailing biweekly timelines and its respective milestone in the span of 16 weeks. The budget has been broken down into identifiable items detailing the needed resources (e.g. server), total workhours, as well as requested hourly rate which is in the reasonable range for a full stack developer after doing a non-exhaustive search on arc.dev. With the well laid out roadmap and budget allocation, the plan seems realistic to be completed however, the lack of explicit evidence mentioning their past work should be a consideration for the voter.", "q1r": 4, "q2": "The KPIs chosen by the proposers are well defined providing a quantitative approach to evaluate the project’s performance, these includes “number of monthly active users”,  “number of smart contracts created”, etc. These metrics can be used to evaluate the project’s performance in terms of the outreach, growth, and the quality of service the solution provided. Additionally, the metrics will be freely accessible (presumably via the website) at any moment making it transparent and easily trackable. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12804, "q0": "In this proposal, Matt Halloran wants to build an Open Smart Contract Library. This library will be used by developers for making  smart contracts. The library will be free, open-source, and simple to use. I think this isn't a bad idea, since smart contracts are hard to find. This way people would be able to share, make and get feedbacks which is a good thing. There would be an API tool which would have a free tier and paid tier which would be used to server costs, so it's understandable. This tool will be used as a way to access contracts from your application, which is very nice. And the library will have an option to download it as a csv file, which makes it better. Having something to make smart contracts and being able to learn from examples would be a great thing, developers could really benefit from this library and learn something new. People would be able to contribute on their own. For these reasons, I decide to give 5 stars since I haven't seen any flows with this project.", "q0r": 5, "q1": "In therms of feasibility, I decided to give 5 stars. The plan has been done well, and it is explained what will be done for every week of the project. When it comes to budget it isn't high, and it is also done well, it has a nice breakdown for what is budget needed and for what it will be used. In the team section there is a link for the person working on this project and the person seems reliable. I think this project has potential and can succeed.", "q1r": 5, "q2": "In therms of auditability, I decided to give 5 stars since everything is done well when it comes it clarity. The sentences are well written, the success and the way it would be measured is explained well. There isn't much text, and it isn't needed for a project like this. The risks are there, but it is explained how will they be mitigated, and for these reasons a gave 5 stars.", "q2r": 5, "assessor": "z_assessor_3473", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12823, "q0": "I found this proposal to be exactly what this challenge is looking for. The author aims to build an open-source library where people can search, share and get feedback on smart contracts. I think that such a product is absolutely necessary and will be a game changer for the Cardano community mainly for two reasons: first, the difficulty of Plutus Smart Contract Platform which is based on Haskell (defined by the developers community as a language by the mathematicians for the mathematicians) and the lack of documentation and community may be really intimidating and discouraging to developers to even consider the idea. However, having a platform that will concentrate all available documentation and needed support from the community in one single location will eliminate these obstacles and I see no reason why developers wouldn’t want to join, especially experienced developers who can develop and test their own projects with the help of community. Secondly, and this was my favorite part, the author proposes a new method of implementation, the usage of routines. Basically, a routine is a sequence of instructions which can be called and used repeatedly while executing a task. This method makes the program shorter, much easier to write and understand. The simplicity of the routines combined with an environment where early-stage smart contracts can be developed and critiqued will draw a lot of new developers as well. In addition, the proposer has plans to develop many more features in the future which will make the developers experience even better. All things considered, I think that the impact of this project is completely aligns with the objectives of the challenge therefore it deserves maximum marks. ", "q0r": 5, "q1": "The author of the proposal seems to be the only team member who will work on this project. From the attached website we can find a short description of the author’s background, past experiences and a white paper that explains everything in great detail. The Github profile of the author is overwhelming. For 2022 alone there is a total number 527 contributions. After researching a little deeper I can say with complete confidence that the author is more than capable to see this project through. Moreover, this proposal seems to be part of a much larger project which is called “Vrooli” and already has an MVP up and running. As for the timeline and milestones, the proposal claims to deliver in 16 weeks, 20 hours workload per week divided in 7 parts. Each part includes the tasks that will be performed which in my opinion are realistic and achievable. In terms of the budget breakdown, the author has requested 45 USD per hour which I think is reasonable considering the deliverables. Finally, in the Vrooli website, all technical aspects  that are needed for developing this project are described in great detail. ", "q1r": 5, "q2": "This part of the proposal doesn’t provide a lot of details yet it provides clarity  however the chosen KPIs are good indicators of evaluating the success of the proposal. An additional feature that I find really important is that KPIs will freely accessible in real-time for any member of community who wishes to track the progress. Overall the auditability for this proposal is really good. ", "q2r": 5, "assessor": "z_assessor_3478", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Build an open-source library that allows anyone to search, share, and get feedback on smart contracts.", "experience": "I'm a full-stack software developer with ten years of experience, and also a 1st cohort Plutus Pioneer."}