{"id": 416790, "author": "rcmorano", "title": "Dandelion Community Service", "url": "https://cardano.ideascale.com/a/dtd/416790-48088", "category": 26597, "amount": 23400, "description": "Deploying and maintaining Cardano API services is a challenging task to tackle for newcomers and small teams that want to try, prototype and build on Cardano.", "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 3533, "q0": "The proposal will keep Cardano API Dandelion FREE services running for another 6 months and requires the funds to do so. An API is an integral part of the development workflow and any project that makes a free API is worth the funding. As a developer I do recognize how much easier the development is with the help of an API where the logic behind it is abstracted away and you only get the end result. That absolutely matches with the challenge settings, making devs lives easier and help growing and educating the community by providing an easier way to develop decentralized applications.\nThis proposal brings and if funded will continue to bring value to the developer ecosystem. There are projects already depending and related to this API. It's just a corner stone and you can't build without having something to rely on. I really do urge anyone reading this to vote for them because the budget is negligible compared to the value it brings.\nThere will be no doubt the team will handle challenges and requests comming their way, because they've already done it for 2 years now so they have all the necesary experience. It's a piece from the ecosystem that is an important part of the ecosystem.\nAs a developer I don't ahve any concers about the continuation of this proposal and funding rates. Overall an impactful solution to an already existing problem.\n", "q0r": 5, "q1": "I don't think there's much to say about feasibility team wise, because they've already done it and are doing it, so no point in checking their credentials to see if they can get the job done, because they obviously can. \nAs I mentioned earlyer the budget is worth it and it's basically salaries for 2 people for 6 more months and infrastructure costs, which are at regular prices for the hosting providers. The budget is clear and simple. The timetable is more than clear, and they will do this on a 6 month interval and as long as it's necessary I believe that we as a community should keep funding such projects to get the free services they offer.\nNot much more to say here besides this is more than feasible project - it's a probable one and I hope enough voters recognise the importance of it.\n", "q1r": 5, "q2": "I love the success definition - being able to provide a service forever. All related repositories are visible and anyone can follow the efforts. The KPIs are the standard ones for an API to measure requests per month so it's all clear and auditable.\nThere's a good problem statement - if you need free APIs we need funding and a solution - get us that funding so we can keep doing what we're doing already, so no questions there. overall this is a really important solution that would cost 2.34% of the whole challenge funding, so it's a no brainer. \n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 3817, "q0": "Having read through this proposal, the purpose of this proposal is to keep the existing Dandelion Community Service, which has been serving the community for 21 months now, running for at least 6 months to help ne  comers and small teams to try prototype APIs and build on Cardano.\nThe problem statement is very clear. The group is proposing to maintain the free community service that have served hundreds of thousands of requests every month for their community, and to carry on making contributions to the open source projects that make it possible.\nIn addressing the challenge, the proposal mentioned that Dandelion Community Service has proven to promote Cardano developer ecosystem through creating a good experience that incentivizes developers. This has led to increase in developer adoption and building on top of Cardano.\nThe proposer has emphasized that there will not be any risk involved.\nThis proposal I believe addressed the challenge effectively. My rating is 5.", "q0r": 5, "q1": "The project is a 6 months project, and the proposer stated briefly that they will keep the service running with the development of the open source projects. Their road map is to keep the uptime of the community nodes as high as possible and also to keep maintaining the open source  project up to date with new service updates. \nThe total budget requested is $23400 which is quite reasonable. The breakdown into smaller budgets is done smartly showing costs per person, per place and the months involved. \nThe team is made up of two community members called Roberto C. Morano and Tom, who are both stake pool operators and active members in the Cardano community. LinkedIn references have been provided. \nThe team indicated that probably they would return to Catalyst for more support in funding to sustain the service. They are involved in other proposals in Fund 9 and are also working on previously funded proposals which links have been provided in the proposal.\nGiven the experience of the ream and the reasonable budget, I think the proposal can be successful, so my rating is 4.", "q1r": 4, "q2": "This proposal has explained that the progress of works will be measured by the number of requests per month, and the number of new projects onboarded. \nThey have provided the Dandelion website link to track progress of work. \nThe success of this proposal is given as the provision of the service to the community of developers forever. The success story however is not detailed enough.\nThe proposal is a continuation of previously funded proposals in Fund2,Fund 5 and Fund 7. with links provided. \nThe information provided is somehow ok to audit the proposal, but not very sufficient. Therefore my rating is 3.", "q2r": 3, "assessor": "z_assessor_2483", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9889, "q0": "The Dandelion Community Service project is an expansion and enhancement of an existing project that is currently in use and referenced in the Cardano developers guide. The problem they are addressing is maintaining and deploying Cardano API servers. Their servers have been running for 21 months and the goal is to keep them running for another 6 months. They anticipate requesting additional funding in the future due to continued demand. The success, or continued success, will be measured by the number of new request and the number of new projects. Their service has already proved to be an asset to the Cardano community and will benefit a wide range of developers.\n", "q0r": 5, "q1": "Since they are basically asking for funds to continue what they have been doing there is minimal risk to the project. Their team have proven that they can develop and maintaining the services. For this round of funding they have provided clear breakdown of the funding and tasks which will allow easy monitoring of their progress. Further user acceptance could be obtained by better documentation of their services but since they are already successful the risk is minimum.", "q1r": 5, "q2": "They have provided an easily measurable matrix to validate their success by monitoring the users and number of projects. Their solution is already proven to be successful, and it should be easy to prove additional usage. ", "q2r": 5, "assessor": "z_assessor_3130", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10883, "q0": "This proposal is looking to keep up the project they have previously funded by running it for free, maintain open source tools (through contributions) and running the service allowing new developers to onboard quickly. This type of impact is exactly what this challenge is targeting and exactly what this proposal seeks to do. ", "q0r": 4, "q1": "The  roadmap seems a bit unclear. The 6 months that would be budgeted for in this proposal, starts out with: \"Keep the uptime of the community nodes as high as possible\", but I don't really know what that actually means. Which uptime level are we talking about? Which nodes are we talking about? It's a bit hard to visualize from just those words. Maybe put into some concrete milestones and deliverables, especially since they add in their solution descriptions that they wish to work with at least 4 other proposals in order to launch their full solution. The other element I find murky is \"Maintain the OpenSource projects up-to-date with service updates\". What updates? To which projects? In 6 months do you have concrete deliverables for any of these puzzle pieces (Dandelion validators, Spectre cryptoeconomical model, L4 software)? I don't really get what maintaining anything means here, maybe adding more clarity there will help clarify your roadmap.\n\nThe team seems to have the necessary experience to carry out the proposal as they have worked on it before.\n\nThe budget will be a total of $23,400 and that this amount is requested so that “2x Systems administrator/DevOps profile” can carry out their responsibilities in the maintenance of the system . But this information is low. What exactly would these administrators do in their day-to-day routine? And what will their work process look like? When does this work week start and end? How many hours per week will each devote to working here? Unfortunately, too much information was not given about how this work\n", "q1r": 3, "q2": "At first sight, the auditability of this project is OK, but with some improvements it can be even better. Lets look at the following metrics: Number of requests per month KPI proposed by the bidder will certainly serve as a good way to monitor the progression of success + partial results of this project. But maybe instead we could propose another KPI in addition, so I'll suggest that for this project it would be interesting to also monitor how all these information were shared with the Cardano community . Talking about numbers is one thing, and ensuring that all necessary feedback are given to us through accurate and transparent communication channels is another important issue for which I think we need to help keep an eye on. In my opinion it would be interesting for the team behind this proposal to organize themselves during the development phase and create monthly reports containing not just numerical data related to the realization of this idea, but also further information aimed at helping us understand how their work routine was each time, in other words: what they achieved in terms of objectives (this can be exemplified by looking at their roadmap goals), how they promoted/communicated it on social media/other means (if possible open a link where everyone can view all these reports together).", "q2r": 4, "assessor": "z_assessor_3205", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11928, "q0": "The proposal to maintain the Dandelion Community Service will immensely help the Developer Environment by keeping the open-source community-driven accessible prototyping helper alive, helping Cardano adoption and their development to be easier and faster than building from 0 for every project. The project will then be used and giving their impact and scale as Cardano projects developing by time.\n\nIt will also continue to make contributions on OpenSource projects, catalyzing OpenSource contributions environment in Cardano Network, while also making great projects usable by everyone. The project is also currently assessed for being Risk-free that would infer to how ready the project to be done.", "q0r": 5, "q1": "The proposal proposes a clear short-term target for the time being (6-months period) in a clear division of fund, mentioning the cost for each development environtments and fee for DevOps paid in a feasible number ($150/day). The PIC profile and contacts is also included for audit.\n\nThe proposal has also has a great reasoning to return to catalyst, with the feedback-loop system they seen could make the treasury sustainable. The timeline does not broken down into quite detailed, but since the project talks about long term maintenance, the timeline could be derived as a long target for first 6 months. \n\nThe proposal would also be better if it is able to point out the targets of development and updates example to emphasize the project worth and its continuity with future plan for more segmented and visible target of implementation.", "q1r": 5, "q2": "5 start for the proposed KPI by measuring request per month and boarded projects that use the Dandelion service. The project also should be auditable by looking up to the maintained API market they try to maintain for a long period for the target of accessibility and efficiency in Cardano’s projects development. As above, the proposal would also be better if it is able to point out the targets of development and updates as future plan in a discreet duration for more segmented objective to make auditing easier (as it smaller the project audit scope).", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14554, "q0": "The roadmap for conducting this project in the next 6 month is pretty brief. The team plans to “keep the uptime of the community nodes as high as possiblle” and “keep maintaing the OpenSource projects up to date with new service updates.” I suppose this plan could be elaborated on to reveal more information about the project, like what is considered a “high number of community nodes,” how many OpenSource projects are to be maintained, and what and when the new service updates will be launched? Specific KPI works better to evaluate the feasibility of the project plan. The budget breakdown is clear and understandable enough. The description of the team member is pretty brief again. The names of the two members are provided with only a LinkedIn/Twitter link with literally no description or explanation of their related skills, experience and expertise. I believe these parts could be presented with more details", "q0r": 5, "q1": " The roadmap for conducting this project in the next 6 month is pretty brief. The team plans to “keep the uptime of the community nodes as high as possiblle” and “keep maintaing the OpenSource projects up to date with new service updates.” I suppose this plan could be elaborated on to reveal more information about the project, like what is considered a “high number of community nodes,” how many OpenSource projects are to be maintained, and what and when the new service updates will be launched? Specific KPI works better to evaluate the feasibility of the project plan.  The budget breakdown is clear and understandable enough. The description of the team member is pretty brief again. The names of the two members are provided with only a LinkedIn/Twitter link with literally no description or explanation of their related skills, experience and expertise. I believe these parts could be presented with more details.", "q1r": 3, "q2": "Regarding the auditability of the project, the team mentions some KPIs of the number of requests per month and the number of new projects on boarded, but we don’t know what the specific numbers are. They believe the latter is difficult to track and I’m quite curious about the reason. The description of the project’s success is kind of vague to me. The team believes this project will be a success if they are to provide the service to their community of developers “forever and ever!” Some specific numbers to vividly illustrate and audit the project success would fit better. As aforementioned, the team plans to keep their existing project for another 6 months, so I guess this period of time should be used to measure the progress and success of the project instead of something infinite as presented.", "q2r": 3, "assessor": "z_assessor_4072", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Keep the existing Dandelion Community Service, which has been serving the community for 21 months now, running for at least another 6 months.", "experience": "DevOps advocate with over 15 years of experience. Ex-Emurgo DevOps Lead. Gimbalabs Co-Founder. Dandelion Founder, Developer and Operator."}