{"id": 416880, "author": "shirogat", "title": "More Developers on Cardano", "url": "https://cardano.ideascale.com/a/dtd/416880-48088", "category": 26597, "amount": 10000, "description": "The developer community in East Africa still needs to be built, incentivized and motivated to build on Cardano.", "f6_no_assessments": 10, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3454, "q0": "Proposal starts from a valid problem statement (a need for a higher engagement from developers in east Africa) and should be aligned with challenge as a course for developers in the region could bost their ecossystem but unfortunetaly doesnt clearly articulated what exactly will be done and how. \nIt mentions it will run a course on Plutus to be offered to the existing community of programmers there. However, it doesnt ellaborate onwhat content/syllabus would be taught here, how this course would be strucutured (in terms of teaching method, exams, classes, practical projects) nor how the previous enagagement with developers community would happen, in terms of \n communication/advertisement strategy. \nThe risk managament part is also not done here. Instead, it has the project plan, the same content available in feasbility section/plan part. As suggestions here, it would be nice to include the risks of low engagement, low level of learning, not meeting the desired schedule, possible languages/cultural barries and so on, all with a mitigation plan in place.\nThe value proposition could also be better explained, stating how this course would differ from the existing ones and why having one dedicated to East Africa would be better. I could think of some reasons but they could be clear here.", "q0r": 2, "q1": "There's a brief time-framed plan but more information on how these acitvities would be done would help. Maybe its just a matter of breaking them down a bit more.\nBudget breakdown is ok and matches project plan. For transparency purposes, I'd also add how many hours each of thesse lines would take, at least the ones related to people remuneration.\nAs for the team, there's not a lot information. Actually, the team part in the proposal repeats the content of the plan (and of the risk management). proposer only mentions that he'll working with a team of developers from the Plutus Pioneer Program in East Africa, but it doens say anything about his experience or the developers one. As recomentations for future proposals, it would be nice to see here a good description of each team meber, telling their experience, educational background and providing reference links. If more people would needed to be hired, it is also imporant to mention.\n\nTherefore, as it is really hard to assess feasbility of this proposal, I'll rate it as 2.", "q1r": 2, "q2": "The audibaility part is actually the best one in this proposal. Proposer states some clear deliverables and provides good kpis with targets. As suggestion, it would be also good to include a metric to measure feedback from the students and a final report explaining how the implementation was done and what are the lessons learned/key findings so other people can repeat this in other regions, if successfully.\nIt's also imporant that proposer shares the proposed results in a public place such as social media, github or a dedicated website, so all community can check the progress.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 4180, "q0": "The \"More developers on Cardano\" proposal addresses the Developer Ecosystem challenge by incentivizing developers and adding more developers on Cardano. Developers can generate more script and build the framework for DeFi tokenization. The proposer has detailed how his solution will address the challenge in term of impact and then describe the approach in the risk section. His approach is to run haskell/plutus course and workshop along with the roundtable discussion. This will draw developers outside the ecosystem to participate in Catalyst, incentivize developers and create a sense of community. The proposer could improve the score in the impact section by being more specific in the solution and provide the risk of deliverying this project successfully.", "q0r": 4, "q1": "The proposal provides 2 different timelines in different sections (impact and feasibility sections) but as it is now in July, I reckon that the team will need to adjust timeline to account for 3-4 months period. The budget looks sensible enough although the number of working hours and pay rate should have been provided. There is no detail of proposer name along with his linkedin profile. Hence, the lack of team member information and the unclear timeline make it very difficult to determine if the project can be carried out successfully. Also it would help proposers in crafting any proposals related to course or education to provide the general syllabus of the course (Haskell/Plutus in this case) along with the duration of each section so the voter can check if the course content provides all necessary knowledge for developers to up their skill within the timeframe. It will add to project's feasibility. If the proposer has any experience as instructors/ educators, it is also worth mentioning in this proposal.", "q1r": 3, "q2": "The proposer defines the success of this project of onboarding and training 200 East African developers onto Cardano. He has also put the KPIs of what he would like to achieve in each milestone. The community will appreciate in his effort if they could have the channel to learn this project progress. The proposal would improve if the proposer provides the information on how the community can track the progress over time ie. GitHub, monthly report, bi-weekly meetings etc. As this proposal was not funded and need improvement, I hope that the proposer will refine it even more by providing all this information and not provide duplicate information across sections. It will be helpful to reach out to the community at the beginning of proposal submission period to allow feedback so that the proposal could be on its track. Although the proposer has understood the problem that the developer in East Africa community need to be incentivized to build on Cardano, the delivery of this proposal need refinement inputs from the community. The proposer should reach out to the community to refine his proposal and ask for team feedback in order for this proposal to be properly polished, get funded, and more importantly, to deliver positive impact to Cardano. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5719, "q0": "While I agree that this proposal has addressed two important objectives set by this challenge, which are attracting developers from outside the Cardano community and prioritizing what developers need, I believe this proposal is better fitted to the \"Grow Africa, Grow Cardano\" challenge. If adjusted just a little, this proposal could present a project which aims to educate current and potential Cardano users in East Africa.", "q0r": 3, "q1": "The team has not presented any relevant experience in carrying out such project in the past. There are at least two parts where the proposal does not completely address the question being asked, and they rather copy the same answer for at least 3 questions, which is not at all carefully in my perception. However, there is light on the explanation for the need of such project, and the budget breakdown seems to be written with care.", "q1r": 2, "q2": "Because they overlap the answer to at least three completely different questions, I do not have enough information to audit this proposal's progress and future success. Nonetheless, this proposal can gain kudos in the budget breakdown and SDGs achieved.", "q2r": 2, "assessor": "z_assessor_2741", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 5818, "q0": "This proposal seems to have achieved the main goal of the challenge: attracting developers from outside the community to participate in Catalyst, motivating developers to keep building and to have staying power, creating a sense of community and conversations pertinent to their issues. However, according to the problem statement of the proposal, we can see that the proposal is about the developer community in East Africa. So in my opinion this proposal would be more in line with challenge: \"Grow Africa, Grow Cardano\". In this challenge, the proposal, if carefully planned and invested, has the potential to develop on a broader scale, not just in East Africa.", "q0r": 4, "q1": "This proposal shows us timeline and key milestones in the plan. However, there is a risk of the proposal being duplicated with the information of other items and the information given does not match the title. Therefore, it is difficult to assess the feasibility of the proposal. Likewise, detailed information about who will be working on the project is also not mentioned, making the assessment process more difficult. If the experience of the people working on the project is relevant to the proposal as well as the proposal predicting the risks involved in creating a course, organizing a workshop, etc., then the percentage the success of the proposal is very high.", "q1r": 2, "q2": "The team came up with specific numbers to achieve the project's success and tracked its progress. However, the proposal does not mention when the project have to reach the stated success. In addition, the team has also come up with the proposed SDG rating and KPIs that need to be attained. However, as mentioned above, the information provided is repeated and incomplete, so the assessment of the progress and success of the proposal will not be objective. Therefore, neutrality for auditability in this case would be reasonable.", "q2r": 3, "assessor": "z_assessor_2753", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7591, "q0": "The problem described in this proposal is closely aligned with the challenge.The team has also done well by putting the proposal in the right challenge.I think the proposal has not really provided a detailed proposed Solution on how they are going to incentivized and motivate them to build on Cardano.Even though they have provided ways of expanding more developers on the ecosystem. The proposal also captures the key important metrics under the campaign breif by mentioning some of the key values that participants will bring on board  by attracting developers from outside the community to participate in Catalyst and also increase the knowledge base for scripting and frameworks.", "q0r": 4, "q1": "The proposer has not provided relevant links to members of the team who will help in the proper execution of the project. I think it seems the proposal has not provided the details of the team members .The proposer has done well by providing a detailed budget which has been broken down into identifiable bits on how they are going to excute the project.The proposal also outlines the milestones by providing the duration  and timelines but seems not to have the details of the roles each member of the team will play to the proper execution of the project.\nThe proposal has also considered the risk that will be associated with the implementation of the project but it also has not been able to provide measures to mitigate it.", "q1r": 4, "q2": "The proposer has provided a clear outline on how to measure the progress of their project which include campaign to attract developers from existing developer community that is outside of Catalyst done , a Haskell/ Plutus course created on a training website and also 1000 developers to a round table discussion both face to face and online. They have provided the key milestones, information on how success will look like by elaborating on the number  of East African developers  that will be sensitized and trained to be onboarded onto the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2906", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 8324, "q0": "The challenge is looking for solutions that could improve developers' experience and from that could increase the adoption of the Cardano ecosystem. This proposal suggested an unclear solution and it seems inappropriate for the given challenge as it aims at increasing the number of developers in East Africa but it did not mention how this project will work, its functions, and its features. It did not mention how impactful this project is on the whole development of the Cardano ecosystem. It did not analyze how it is aligned with the KPI or Key metric of the given challenge. It is still vague to visualize what this proposal wants to do. No challenges or risks were mentioned when delivering this project. It should spend time researching possible hurdles that this project may face and prepare a plan in advance of how to overcome all of them.", "q0r": 2, "q1": "The given plan was not so detailed. It should add some description of how each task should be done and include some details of the technical aspects of the project. There is just so little information about the team working on this project. It just mentioned a team of developers from the Plutus Pioneer Program in East Africa, CAs VCAs, ED tech. It should add detailed information about team members along with their relevant experience to show how suitable and important they are to the success of the project. This is also a critical point for investors to evaluate the feasibility of the project. About the budget distribution, it listed the amount of money need for each cost, but it should add information related to how they are calculated and how long the fund would be used for.", "q1r": 2, "q2": "One good point in the section on how this project could be traced and tracked, the proposal mentioned some numbers that this project should achieve. However, it should mention those figures should be achieved at what time milestone. About the description of the success of this project, apart from giving a goal to achieve with a specific, it should add some other criteria to evaluate its success.", "q2r": 2, "assessor": "z_assessor_2975", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9127, "q0": "I believe that your idea presents the community with a highly fascinating challenge and its potential solution. Furthermore, it adds significant value to the Carnado ecosystem. This approach, however, still falls short of a few crucial indicators, as well as the synchronization and consistency of several data that have not been adequately stated. I would only ask if I could see a specific number in the Key metrics section, though I understand that this may be difficult. Nonetheless, I see a lot of potential for improvement here, particularly in terms of providing more information about how this dapp will operate. Because the existing description is so vague, a more detailed description of feature sets and processes OR functions would have been ideal. This proposal addresses a much wanted feature and, in my opinion, will benefit developers creating dapps on the Cardano ecosystem significantly.", "q0r": 5, "q1": "They give a six-stage roadmap on which we can follow what happens over time as we progress toward our ultimate objective. However, no information about the team members is provided, and no links are provided to verify the proponent's and team's abilities and expertise. I strongly advise you to add some LinkedIn profiles to the team. Furthermore, the budget is acceptable given the quantity of vital effort that the proposers will put in. The budget is also broken out in a way that shows how the money will be spent, and it appears to be fair and reasonable in terms of meeting the stated goals. I'd only like to see if I can find a specific figure in the Key metrics section, although I appreciate that this may be difficult. Overall, the plan is exact, sensible, and clearly describes how it will be carried out, thus I am confident that this proposal will be successfully finished.", "q1r": 4, "q2": "The success criteria are reasonable and important for the next level of funding; nevertheless, the offered measures are tough to assess in my opinion. To minimize misunderstanding among future proposers, I recommend, if feasible, examining the metrics prior to the launch. I agree that the success criteria and associated metrics are appropriate for measuring progress in tackling the challenge.", "q2r": 4, "assessor": "z_assessor_3022", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10380, "q0": "In Africa, access to knowledge, especially blockchain knowledge, is still limited. One of the main limitations is that no single organization can provide developers the most practical guidance and knowledge sharing about blockchain. The proposal wants to build a developer community in East Africa where developers can gather and share ideas about blockchain, especially Cardano blockchain. This developer community will attract and train developers with knowledge of Catalyst and Cardano. In addition, this developer community will be a place that organizes events that attract developers. This is a great idea for developers in Africa and has the potential to expand worldwide.", "q0r": 4, "q1": "According to the project roadmap, the proposal's team will organize a campaign to attract developers. Then they will host a Haskell/Plutus course. After that, they organize discussion and training. Finally, there is a graduation event for developers. To cover the above fees, they recommend a budget of $10,000. However, the proposal does not list the names and information of the project participants. They also do not provide any website or link related to the project. This is a big main risk for the proposal. I suggest the team should list enough information and experience to prove their ability.", "q1r": 3, "q2": "The proposal lists KPIs for the project \"a developer community\". First, they will hold a campaign to attract developers. Second, they will create a training website for Haskell/ Plutus course. Third, they expect to have 1000 developers at a round table discussion. Fourth, there will be a workshop on Plutus and Cardano and recruiting for the training run. Fifth, they also expect to have 200 developers trained and presented. However, they should create a website or a social media channel to update information about the project.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12401, "q0": "The idea of doing a campaign, a workshop, and a course on Plutus to attract more developers is definitely aligned with the challenge brief of building a bigger talent pool of developers that Catalys project can collaborate with however, the idea presented in this proposal is way too general. There were no explanations regarding the blueprint of the project, such as the content/topic that is going to be presented and/or taught in the workshop and courses. The proposer only mentioned that the workshop and courses will be about Plutus and Cardano but did not explain exactly what is going to be presented (i.e. basic Haskell functions, monads, etc.). At the moment, the idea presented in this proposal is too general and I can’t see the overall direction of the proposal, ", "q0r": 2, "q1": "The proposal didn’t provide enough information regarding the team members that will be working on the project, they claimed to be working with a team of developers from the Plutus Pioneer Program in East Africa but did not provide any details regarding who is it, what they’ve done, or any explicit link backing up their experience. \n\nThe roadmap provided was “acceptable” mentioning the timeline and respective tasks to be done though I do think it lacks explanation regarding the workshop preparation, building the website for the courses, as well as the  overall plan for running the course (i,e, the number of courses, the schedule of the course, the topics presented in each of the course, etc.). \n\nThe budget was very minimal in its details. For example, information such as the resources needed for campaign, events and workshops, etc. as well as the  number of people involved, total workhours, and requested rate for speakers, course developer and trainers were not mentioned. \n\nOverall, the minimal amount of information presented in this section of this proposal lead to my disagreement towards the feasibility of this project.", "q1r": 2, "q2": "The project’s progress will be evaluated by the completion of the milestone, which is the campaign, the Haskell/Plutus course, as well as the workshop however, there were no explanations on where or how these information will be reported (i.e. via a website, etc.). Additionally, I don’t think using the number of developers “invited” to the round table as a KPI to measure the project’s outreach is on target since the numbers of people invited and the actual participant are two really different things. ", "q2r": 2, "assessor": "z_assessor_3408", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12824, "q0": "This proposal is very short and the impact has no details provided. The team suggests to grow the developers community in East Africa from a series of workshops, face-to-face and online meetings however there is no real plan on how they are going to invite the developers into their meetings. I believe this is a good idea however it needs improvement. For example they may have suggested a very intense and aggressive social media campaign in order to reach all interested developer. The proposal addresses the challenge in terms of what it intends to achieve however a real and detailed plan for reaching the developers needs to be provided.", "q0r": 2, "q1": "This part leaves a lot to be desired. The team has provided a timeline that included what and when is going to be done however everything is very broad with no real details and apart from this, the team member and people who are going to work in this project are not known whatsoever. I believe this is a major issue. The proposal team has to provide all involved parties, give detail about their past experiences, skills and background knowledge in order to earn the trust of voters and the community members. I suggest that the team revises this part and takes it more seriously. I am sorry to say that from what has been presented in this proposal, I cannot be sure on the intentions of the team since they have given no effort to earn our confidence. For this reason I must give minimal marks since the team is the key part for making an assessment. One thing I may suggest to the team is to include all team members with brief background description and their relevant tasks so that we may be able to assess and determine how likely is the implementation of this project.", "q1r": 1, "q2": "The team has provided good KPIs that are good indicators of what success of this project look like. However they haven’t provided any solution on how the community can audit their success. As far as I can see, this project is a little mixed up. Some sections are not where they must be, and some other sections have been filled with irrelevant information. I must say that the team doesn’t seem to take the proposal seriously. They haven’t provided any details or any means for the community to hold them accountable and to be able to check if they are holding up their end of the deal in case they get founded. I suggest that the team takes into account all of these suggestions and act accordingly. ", "q2r": 2, "assessor": "z_assessor_3478", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "There is need to build a the developer ecosystem that helps them to have a sense of community and a place they can share ideas", "experience": "Working with a team of developers from the Plutus Pioneer Program in East Africa, CAs VCAs, ED tech"}