{"id": 416830, "author": "guildoperators", "title": "Koios Extensions - Utilities, Bots", "url": "https://cardano.ideascale.com/a/dtd/416830-48088", "category": 26597, "amount": 60000, "description": "Blockchain data often requires similar tasks among builders leading to duplicated work. Meanwhile, the end-users struggle to query complete raw data from the blockchain.", "f6_no_assessments": 7, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3268, "q0": "This well-structured proposal is a request to add 3 \"modules\" to the Koios ecosystem (a blockchain query system with the ability to self-host).  We'll describe the modules and their impact individually, but what unites them all is this idea of significantly improving developer productivity.  The first module builds into the REST API many of the functions that developers build out themselves, which will both invite more detailed use of the API as well as save countless hours of duplicated work across processes.  The second adds bot functionality (along with a hosted instance) for Cardano communities to adopt for queries, again, avoiding massive duplication of effort.  Finally, the third module adds a sustainability and maintenance factor to Guild oversight of the REST API, while creating tools to speed up many internal or local functions such as stake address queries (and the addition of local notifications will be a huge hit!).\n\nThese modules touch on end-users and average users, developers and projects large and small who want to reduce code dependency, and as such has subtle but far reaching impact.  The alignment with the challenge setting is solid, and because the deliverables feed directly into the ideas of creating a more productive and developer-friendly ecosystem, I believe it deserves full marks for Impact.  5 Stars.", "q0r": 5, "q1": "The budget/timeline integration is a bit tricky here.  80% of the project is delivered in the first 3 months (the bot integration and addition of Utilities to the API) and the line items for those budgets, total $25k, covers the maintenance and support for them.  After that, all of the funds are for the 9 months of the timeline remaining in the year to fund the updates/maintenace to gRest.  In practice, the first 3 months will likely be under funded (at only $15k), and the last 9 months overfunded.  I will assume the team is prepared for this Catalyst-specific imbalance, and will be able to get the work done in the first 3 months to be paid later, or adjust the timeline to finish the bot integration out to 5 or even 6 months.  I see nothing in the proposal or in the community that makes me think such a delay would be significantly impactful.\n\nAnother area here that is both tricky and interesting is the \"team\" component.  It would be tempting for a PA to leave feedback saying that no team details have been included, however, when one looks at Guild impact via the work done to date, and takes into account the aliveness present in the repos underpinning the Koios and Guild ecosystem, I think we can safely say that this \"team\" is the best of what opensource and decentralization has to offer.  Any concerns that this idea of a submission team will lack accountability is mitigated by the same team's successful funding round last August, a project delivered complete in just 6 months of its 12 month timeline.\n\nBecause this team is able to provide extensive evidence of ability to deliver and because the architecture behind the milestones and intentions of the budget are reasonable and concrete, I believe this proposal has a high likelihood of being successfully executed.  5 Stars.", "q1r": 5, "q2": "The 5 deliverables are clearly stated again for reference, which is appreciated.  The opensource repo for tracking is already available and the descriptions of the deliverables leave no room for doubt about having been successfully delivered.  That they managed this in a statement about the more abstract task of maintaining and updating gRest deserves a kudo.\n\nIn addition the Guild community has maintained a bi weekly meeting for a while now where anyone can join and ask questions or get updates on the current state of Koios, or progress attained.\n\nBecause the opensource milestones are so clearly described in the proposal, and because the team has a history of availability and transparency, I have no doubt that this project can be successfully tracked to a likely completion, and I give a full 5 stars for auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3534, "q0": "The proposers want to extend a distributed system in the form of microservices into the existing koios functionality to avoid duplication in logic between builders and to make raw blockchain data more easily queriable for users. This is a fine idea and would really bring benefit to the cardano dev community. Users will also benefit a lot, because ease of access is always a good thing to educate one self.\nI had the pleasure of assessing their work in fund 6 and I hope my positive review helped them to get funded. I like this proposal as well, because it's well thought out, if a bit to big. I can see now the adoption since fund 6 took off and they have a lot of contributors, which is greate organic evolution. As a developer myself I welcome any tools that will make my job easyer and moreover will help me learn quicker by abstracting away some of the comlication.\nThere were a lot of simmilar proposals the last round, but as I did some research this is one of the few remaining that actually survived by proving themselves. I'm a fan of empirical data, because it's hard to argue with it and the data has spoken, koios is good enough for growing the ecosystem. This is absolutely the right proposal considering the challenge settings and development improvement and ease of usage is what they're offering so I have no doubt on the impact they will have, because I can look back to the impact they already do have.\nOverall I like this proposal and believe it to be impactfull and successful. \n", "q0r": 5, "q1": "The team members and contributors probably have a combined experience of over a 100 years, so you can't argue with the swarm and the data. The tool is evolving rapidly and has lot's of contributors so I'd call it probably more than feasible. The credentials and skills listed bring the probability way up.\nAs a dev, I'd have to say the proposal is very well thought out with one minor caveat I'll mention bellow. I love the idea about the distributed system to compliment the ideals of the cardano community. It's clear the proposers have done a lot of thinking when douing this proposal and they've outlined 3 problems that need solving and have provided 3 individual yet, complimentary solutions. I still would suggest to breakdown this proposal down to increase your chances of funding, but it's just a suggestion for future proposals. Incremental small changes are way more likely to happen and leaves you time to think more and code less, therefore saving a lot of unnecessary work. Even so this proposal is great and has only one caveat I can see. \nThe budget breakdown could have been dobe better. It's hard for me as an assessor to compare the hourly rate with other proposals since the way information about the budget is provided is not detailed enough to allow me to make that calculation. I don't know if the hourly rates are reasonable, although by rough calculations they are. That's a minor thing, but it is proving to be a standard to list all work in hours and then give an hourly rate for each type of work. That makes the end calculation and verification much easyer. So please do it for your next proposal to make life easyer for us assessors :) \nAll technical detailes are mentioned, there is a very very detailed explanation in the linked site if anyone is interested. Overall a feasible proposal, I'd deffinetly vote for it. Good luck.", "q1r": 5, "q2": "Open source github - yes. This should be all the answer to all questions of the sort \"can i track the projet progress?\". Even so there are non-tech savvy people and the proposers have taken care of them by doing a telegram alert bot. That brings up the question of: why isn't everyone doing this, because it makes following the progress of the proposal a breeze and it's not that hard ot timeconsuming to do. \nThere are also open meetings and that is more than enough to keep up with the project. The roadmap is good and people can follow along. The proposed problem statement is well defined and the solutions to the brokendown problems are well defined and explained as well.\nOverall a love this proposal, it's impacfull, it's feasible, it's auditable, it's 5/4.5/5;", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8859, "q0": "Running a queries over a large data leads to lot of confusion as many developers use different variables , every variable might not be knowing to people who run queries ,so even while developing sometimes developers might use the same variables name which might end up in overlapping of data and even start to generate errors in the code.\nHence to develop an idea where proposer team wants to extend microservice branch into Koios ,so that it will reduce duplication of work and developers can use the libraries in most of efficient way, where they dont need to waste time on writing same old codes hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Setting up libraries is never an easy task as it needs to fulfill all the API's parameters and security protocols, and API's should also be easily communicated with Web so that data storage or data interaction with backend can be smooth and easy.\nThe team already have experienced community members who have independently contributed SDKs, CLIs, and integrations, with the previous work efforts seen the team has steady increase in adoption curve without putting as much effort into visibility and marketing. Hence developing utilities microservice for such team is possible with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal has displayed the proposed solution in most detailed manner possible, and have presented both problems that current generation is facing and solution  to each of its problem by using the libraries presented by developers team , the presented audit has introduced its team in very simple and most effective manner , They have mentioned the contribution of their work in Guild Operators and their contribution in development towards the framework, by providing effective answer on how the project is countering the challenges mentioned.\nThe team has provided decent budget breaking and timeline to complete the project hence with the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 15088, "q0": "IMPACT \nThe proposal aims to extend Koios API with new functionality mainly to address 3 goals, 1) Data transformation on the queries, 2) End-user accessibility of data returned and 3) Improvements/continuity for ongoing work from Koios Core members. The proposed solution aims to solve this 3 main issues, therefore will be facilitating the work of many developers using Koios, as well as promoting new developers into Cardano.\nBecause of that I strongly agree that this proposal is aligned with the Challenge Objectives.", "q0r": 5, "q1": "\nFEASIBILITY\nThe timeline is kind of messy, and way to general, for a project with this technical focus. On one side it has two timelines:\n12 months:\nKeep up with updates from Cardano blockchain to gRest API\nTend to new requirements from the community for gRest API\nWork on extending CDN to countries where instance providers have higher participation\nSupport/maintenance/community engagement for the next year\n\n3 months:\nDevelopment for the template of utilities microservice\nStart integration of features into utilities microservices\nPrepare query bot library\nExtend library into Telegram bot and integrate with Charlie\n\nThe milestones and deliverables are way to general, no indication on how much dependencies exists between this two timelines and because the team is not presented it is fairly difficult to understand the feasibility of the project as ti is presented.\nBudget is also general and allocates major chunks of money to generic activities with no effort or estimation provided.\nAs the team has delivered in the past and is showing commitment to Cardano and its developer ecosystem, I think they deserve the benefit of the doubt, so I cannot agree nor disagree that this proposal can be delivered as stated.", "q1r": 3, "q2": "AUDITABILITY\nEven though some metrics (key deliverables in fact) will be measured via github and the monthly reports, it is not clear how the project will be measuring its impact on the dev community, but as the code will be delivered openly the community will be able to audit its progress.", "q2r": 4, "assessor": "z_assessor_2398", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15114, "q0": "This is a very comprehensive and extremely well articulated proposal that could add a lot of value to the Cardano ecosystem by expanding the capabilities of the decentralised Koios API.\n\nThe primary function of the Koios API is to offer blockchain query results for other developers building on Cardano. The proposal seeks to maintain the existing features, but also to add new features \tand quality of life improvements, such as Telegram bots.\n\nThis could have a very positive impact on the Cardano developer ecosystem as it would free up time and resources and allow developers to focus on their projects.\n\nThe proposal makes a very thorough descriptions of the problems it intends to solve and of the solution it looks to offer to the community. The risk with this implementation are minimal as the development team mentions that they have multiple members that can do the work equally well, given the fact that this is a decentralised project of the SPO community.", "q0r": 5, "q1": "By looking at the GitHub page of the proposers I was able to see that they are a diverse group of over 50 contributors that describe themselves as “SPOs that contribute together to the Cardano Ecosystem”. The fact that it’s a decentralised network of competent developers, driven by a strong motivation to grow the Cardano ecosystem gives me great confidence that the project will be successfully completed if funded.\n\nThe implementation plan is more of a definition of success list, that describes success after after 3 and 12 months, but given the high quality of the project and the proposal, this detail is not enough to deduct a point for.\n\nThe budget is broken down to cover for each described solution that the team intends to build. It’s not very detailed, but it’s reasonable and clearly describes the requested amount of $60,000.\n\nWhile I would have preferred to see an hourly rate included in the budget for better estimation of the costs, this omission in and of itself does no constitute a deal breaker.", "q1r": 5, "q2": "The team plans to track the development of the project on their GitHub page as a primary source of information and a very clear list of deliverables and milestones is presented in the proposal.\nIn addition the team also indicates that it will hold 60 minute, bi-weekly meetings with the Cardano community \n\nAll this makes for a very good plan for auditability.\n\nTo top it all off, the proposal presents a very compelling definition of success, that again articulates the value the Koios API and toolset could bring to the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15258, "q0": "It is proposed to implement an extensible fork of microservices into Koios to reduce duplication of work between builders, extending query results to fetch data for off-chain/third-party sources. The Query Bot provides a ready-to-use bot library that developers, builders, and creators of standalone applications take advantage of bot/Koios integration. Koios has the ability to run a separate cluster of nodes aimed at consumers. Builders don't need to waste time writing old code. The proposal to effectively address the challenge and the detailed description is analyzed through three specific problems and solutions. The proponent not only presented but also explained in great detail. From the experience and solid planning of the proposal, the sender realizes that there is no risk to the project. This is a positive confidence of the proponent for his project with a multi-member group.", "q0r": 5, "q1": "The proponent provides a project plan with a 12-month long-term roadmap and a 3-month short-term roadmap. Milestones are established and tasks to be done are listed. However, in my opinion, the 12-month roadmap is too long to be accurately tracked. It is good to have a schedule, parallel to specific tasks. Detailed roadmap will easily track the progress and development of the project. Minimize risks and promptly provide solutions for the project to be conducted smoothly and continuously.\nThe requested budget is $60,000. This is a fair value for the level of work and time of the project. The budget is divided into 3 parts and is explained clearly and transparently.\nFrom the link provided, we checked and identified the team with strong, diverse and experienced members. This is the network that makes the project successful.\n Proposal is good, however roadmap could add more details.", "q1r": 4, "q2": "From the proposal's plan, it shows the project progress is trackable but not ideal. Transparent budgets can easily be audited. Besides, the indicators are set up satisfactorily. Project activity will be publicly tracked via GitHub and provided with an access link, making it easy for us to check for accuracy. The Cardano community represents Koios users. Open meetings will be held once/60 minutes, biweekly for anyone interested in the project and can be easily accessed via the link provided. A successful project is work done and developed. Koios is used by many developers who have taken advantage of it and who have not discovered it yet. Microservices and Koios query bot will exist and benefit more than 1,000 members ... Since we are provided with a lot of necessary and important information, in my opinion that information is complete and satisfactory, helping We can audit accurately and transparently.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15359, "q0": "The proposal is to try offering efficient utilities and bot services for the Cardano community developer ecosystems. The Koios team pinpointed the 3 problems of query data/ end-user accessibility with REST API and ongoing improvements. And the solutions are well synced with the Microservices and Koios Query bots also the Koios gRest Updates. What would be improved is the well-thought risks of the proposals, it will more impromptu ongoing risks/pain points will be emerged during the process, and therefore should be a channel of feedback from the community and the backup team lead to tackle these extra workloads. ", "q0r": 5, "q1": "The budget is simply broken into three big blocks as aligned with the defined three sub-problems/sub-solutions. The team is also submitting another proposal for incentivizing the Koios query layer and building our first Koios DApp - https://cardano.ideascale.com/c/idea/419448 in another challenge setting. What the PA highly appreciate is the transparency of the team to state the milestones of 3 project parallelly with the milestones of 3 months and 12 months respectively. What would be better is a more detailed breaking down month over month projects to ensure the milestones are met and it is also easy for the Catalyst team to budget releasing monthly cycle. The Koios team also mentioned the intention not to come back for the other proposal as the project can be self-sustained. The team can also be more visible to the community instead of only showcasing the impacts of past projects. The Guild team members remain anonymous with the background with the overall description of  (8+) years of experience in system design, DevOps, system administration, networking, and software development.", "q1r": 4, "q2": "The project can be tracked easily in the auditability session with the Github link attached. What the PA appreciate is the one-hour community bi-weekly meeting. The team was also very receptive to learning from anyone interested in the project and answering specific question/feedback. The team also mentioned about success looks like for the community with the telegram channel https://t.me/CardanoKoios (The PA self-research, having 100 members to X10 into 1000 members.) More marketing/promoting actions should be mentioned to make this happen. ", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Integrate an extendable microservice branch into Koios to reduce work duplication between builders. Implement an intuitive and easy-to-use query bot and library to improve end-user accessibility.", "experience": "\nA well-known talent pool in the Cardano ecosystem which demonstrated a deep understanding of the blockchain across guild-operators projects.\nProven history with work done on the base query layer of Koios and feedback/adoption received.\n"}