{"id": 417012, "author": "otaviolima", "title": "Keeping Up with Cardano: 100 videos", "url": "https://cardano.ideascale.com/a/dtd/417012-48088", "category": 26597, "amount": 39300, "description": "People find it difficult to understand the potential of projects by reading whitepapers and websites, with unfriendly technical terms used. The terms used are very technical and not easy to access.", "f6_no_assessments": 11, "f6_rating": 4.757575757575758, "videos": [], "media": [], "f6_assessments": [{"id": 2802, "q0": "\"The challenge for this proposal was: how to create easy access and experiences for successful developers, and the proposal responded to this challenge by creating meetings Meeting of developing project owners with the developer community to answer and showcase the features of their Dapp.\n   By broadcasting live on Youtube channel, and compiling and posting to the platforms of social networking sites in order to serve the community to have the simplest and most understandable explanations of the terms of the project owners. development, and the re-uploading on social media sites so that key members of the community who missed the live stream can watch it again later when they find time, which ensures that everyone can listen and learn technical facts explained. there's a lot of stuff in these interviews and they're categorized by category and it's all related to the features of the project's protocol, what's great about this is that the team cites a website which has already developed and aggregated 800 projects developing in our ecosystem.\n  *generally this proposal will be of great impact for our new developers to get on the right track with their ideas as well as understand more techniques to make them easier.\n  There are many possible risks that are foreseen by the proposed team and all have solutions to minimize them. for example, not being able to cooperate with the project owner to talk to the community\"", "q0r": 5, "q1": "\"Minor goals have been identified and they are all committed to within the reasonable timeframe provided by the proposal.\n   The budget sheet provides specifics that match the usual spending levels of the other proposals.\n  The team is also proposed to publish their resume, related experience as well as assign specific positions and tasks to implement this idea to each person. very cool, maximum points for the feasibility of this proposal. \"", "q1r": 5, "q2": "\"Since the activities of this proposal are all run on the Youtube channel, the roadmap for this project the community can participate in live streams to meet the founders of projects with invited topics. , to experience and evaluate the quality as well as monitor the progress of the meeting schedules regularly or not, and can also review the websites to know if the proposed time provides many videos or not.\n  The success of this proposal is due to the number of broadcasters in the community participating in the meeting and also the active interaction of the community. This will open up a real friction with new developers who do not have the right direction for the idea and do not know much about the features of the protocol. The industry's knowledge is so vast that providing this solution will positively impact future developers as they will be given the guidance and support of the project founders. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"id": 5477, "q0": "The proposer of the proposal addresses the challenge in a unique way. While a lot of proposals are trying to establish new standard reusable components or prepare guidelines for integration across different technologies. The author is trying to create a healthy and knowledgeable environment for the developers by releasing videos of success stories from previous successful ventures. Sometimes no matter how much of theoretical concepts you consume, it will never be the same as listening to someone who has had experience in the field. Hence, these videos would serve a huge purpose in instilling a sense of ownership and responsibility in the new developers and engineers who are building new products on the chain. The interactive live chat during the interview sessions will involve a sense of belonging to the viewers and would be happy to get their queries answered from the seniors in the field. This involvement of viewers could build a friendly ecosystem and in turn drive a lot of attention onto the Cardano chain and also invoke a plethora of new collaborations and integrations across the chain.", "q0r": 5, "q1": "The nicely worded manifesto that the proposer bestows upon us enhances the admirable ideology they bring to this funding round. The team is made up of a variety of people that have the necessary skills to construct this solution, whether they are developers, credible proposal authors, or interviewers who can help with content development scenarios. It is excellent that the plan is organized into phases and has definite deliverables at each checkpoint. Any reader can see the level of effort put into the plan to account for all parties and associated factors as well as specify precise targets on a regular basis. Despite the plan's considerable amount of work, the required amounts are very realistic and have not in any way been overemphasized. Since this is a one-off plan, the quantity of content is sufficient to produce a considerable amount of impact. There is really little question that the idea will be enacted given all of the green flags in front of us.", "q1r": 5, "q2": "The KPIs chosen is fair and appropriate to support an exceptional plan and team in place. The main metrics are all in line with what is expected for the challenge and are a direct reflection of the deliverables and action plan that go along with it. The essential measures have been improved in the success criterion and results. The team specifically states that they will update the community on their progress and results through reports of some sort and also the same can be tracked by the number of interviews conducted and the user/viewer views with each of them, therefore I believe the auditing process should be simple and productive. The proposal's overall performance should be summed up by the number of interviews, the number of hits on youtube, and engagements on other social media. Since the team has had previous success, we can believe that all support would be provided by the team to track their progress and keep them in check should be simple and straightforward.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 7539, "q0": "The terminology used is very technical and not easily accessible so many people find it difficult to read white paper projects and websites this is a problem that needs to be addressed in this challenge. The solution is clearly defined, the author of the proposal will use live video interviews with the founders of the projects at Cardano and explain in a friendly way about the project and its features. help solve the problem of the challenge, help new entrants understand the terminology. The risk of this problem clearly listed by the author is that the team has to talk softly and user-friendly through the interviews without having technical jargon and still make the participants understand. about the project this is a problem I think will be difficult for them. However, the author of the project has also found a way to overcome the above. It makes it easier for people new to crypto and blockchain to understand the terms precisely because it makes me trust this project more. I hope the proposal will be funded.", "q0r": 5, "q1": "The author has provided a complete blueprint with clear timelines. Timeline is divided into 6 months by the author:\nJanuary:\nCreate media and promotional work for the first season.\nOpen the voting page to choose the projects that will be featured in the first season.\nProject interview schedule\nTest drive the first projects to prepare plants with\nFebruary to June:\nRoadmap definition for selected projects\nRecord and publish (100) volumes of interviews with project founders in the Cardano ecosystem\nPopular video on social network with more than 100 thousand users\nPublish video on project page in Cardano Ecosystem\nSpecific goals are clearly listed by the author in detail in each month. The progress of the project is also easily trackable through the web links that the author has listed. Success is clearly described by the author as the results achieved are: We will use Youtube reports to ensure the truthfulness of the information, the level of interaction and the success of the project. Community engagement on social networks (Youtube, Twitter, Telegram and Reddit). Visualizing interviews, in this way we will be able to fulfill the main purpose of this project which is to bring relevant content in a user-friendly way. This success is directly related to the challenge of the campaigns.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous.\nThe author will provide the community with some kind of progress report as we go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of the project proposal.\nNumber of visits to the website: 30,000\nSubscribers: 5,000\nNumber of courses available: 30\nNumber of courses purchased: 250\nNumber of courses completed: 100\nWith the above indicators is enough audit for this proposal. The team will feature a journalist, blockchain crypto content editor, video highlighter, and presenter. The team consists of 5 main members working on this project the author seems to be very experienced and has a strong background: Otávio Lima is the Founder & CEO at Cardano Feed, Maria Carmo is the Founder of the channel Maria Carmo 369 on YouTube, Felipe Barcelos is a Full Stack and Software Engineer, Gino Matos is a Crypto Journalist and Content Editor, Lucas Fernandes is a marketing assistant. The author also highlights the things that what each member of the group did, they talked about their previous experiences. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $39,300 less than 20% of the entire challenge budget. The budget is broken down into reasonable expenditures. The actual estimated budget to develop the platform shows that this is a potential project.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7592, "q0": "This is a brilliant proposal that will help promote the ecosystem by keeping up with Cardano through 100 videos.The proposal described is closely aligned with the challenge.The team has also done a great job by putting the proposal in the right challenge.The proposal provides clear solutions to the problem by providing live video interviews with the founders of the projects at Cardano and also explaining in a freindly talks on videos bringing on board several participants in the ecosystem. \nThe proposal also looks at the key important metrics under the campaign breif by mentioning some of the key values participants will benefit in the development of the ecosystem. The proposal is able to scale to address the future challenges by making it easier to keep up with Cardano ecosystem in a much easier way and not having to read alot of white papers and websites to understand what Cardano is effectively engaged in.\nThis I think is game changing and will be able to help promote more developers in the ecosystem should this proposal be funded. ", "q0r": 5, "q1": " The proposer and team have provided the relevant links and skills of the team who will help in the proper execution of the proposal,the team features a journalist and a blockchain cryptocurrency content editor, videomarker and a reputable presenter. The team is  already having over 800 plus projects in the Cardano Ecosystem this I think is commendable and will be able to implement the project if Funded.\nThe proposer has done well by providing a detailed budget which has been broken down into identifiable bits on how they are going to excute the proposal.\nThe proposal also outline the milestones by providing the duration of six months with which the project will be funded. The proposal also provides a conductible plan for the successful  implementation which shows the role each member plays to the project.\nThe proposal has also considered the risk involved in the implementation of the proposal and have kept in measures to mitigate the challenge.\n\n", "q1r": 5, "q2": "\nThe information provided is sufficient to audit the progress and the success of the proposal.\nThe proposer and team has provided clear outline on how to measure the progress of their project should they be funded.\nThey team has provided has the key milestones, information on how success will look like should they be funded thus elaborating on the number of YouTube videos that will be organized and also conducting more interviews to exhibit the 10 top projects with Cardano.\nThe proposal has has also made reference to with partnership with other organizations which I think is quite reputable in the Cardano ecosystem and will be able to excute it successfully.\n ", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8860, "q0": "Many a team when new comers try to find a source for their project , they find it hard in understanding the blogs presented by developers this might be due not updating the blogs in structured manner, or it may be largely due to difficult terms that is used. So developing an regular interview with previous catalyst proposer is a great idea ,where these proposer's can share their experience, and might easily explain what barriers that might occur during each phase of the project and how to utilize the funding most efficient manner to make project a successful one, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The mentioned task is not a difficult one where they just need one good journalist and a good script which might help in completing more than 80% of the project, sometimes finding successfully completed project manager's are hard to find ,but here that wont be challenge since the team have contributed over 800+ projects in the Cardano Ecosystem , there will surely lot of connections among people to get people who can be interviewed , the other challenge here is the proposer's has a target of 100 thousand audience , which is most likely not easy to achieve, other than that with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer could have presented some marketing strategy that he'll be using to gain maximum audience ,since the proposer has target of 100 thousand audience , they should have presented some unique ideas in audit so that they can reach their target number of audience.\nThe presented plan has introduced all the team members and have presented their expertise field where they have Crypto journalist & content editor, Development Engineers, Marketing Assistant which would make completion of project easy, The presented plan has proper timeline and decent budget breaking idea, it has great key indicators to measure the project's success rate, where it involves subscribers, viewers hence, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 10017, "q0": "The idea of the proposal was to publish videos interviewing directly with the founders of the projects at Cardano. Implementing the idea is to solve problems conveniently for users to receive information about Cardano / Blockchain. The project is implemented more and more by developers, making the publication of interview videos is practical work provided to users and the development of Cardano, this proposal is scalable in the future. The choice of project to interview based on the public voting results of the community demonstrates decentralized of the proposal of great value impacting the video viewer. We can see that the implementation of the content selection of the given video is very rich belonging to the Cardano ecosystem. The interview includes: COMMUNITY, DATA, DEFI, EDUCATION, EXCHANGE (DEX), GAMEING, GAMING, IDENTITY/KYC, INFRASTRUCTURE, LAUNCHPAD, LENDING, MARKETPLACES, MEME COINS, METAVERSE, NFT, ORACLE, PAYMENT, POOL, STABLECOIN AND WALLETS. Viewers are explained about the projects carried out by Cardano from which will look positively and make a great contribution to the ecosystem. The solution is popular, conveying understandable content through interviews in line with the challenge set out. The author has identified the challenges and risks of implementation, solving the challenge has been given by understandable interviews that can convey information to anyone. I have an opinion that the interview registration may be delayed due to objective factors from the founders. To minimize this problem, the author needs to have an appointment in advance and have the necessary replacement to ensure the implementation of the proposal as planned.\nI rated: 5\n", "q0r": 5, "q1": "The plan for implementing the proposed proposal is appropriate, the timelines give the work to be done. In the first month of media engagement, creating votes on wed, building interview appointments is logical. Publishing 100 videos in 5 months is a possibility that can be done when well prepared. Posting videos on the group's YouTube channel that already has a large number of subscribers is a great idea for success. In addition, the video is also published on the social networking site and the project page of the Cardano ecosystem will attract many viewers. Members implementing the proposal have specific information about their ability as well as their work capacity, the assignment of work is quite clear. I believe in their ability to do the job as planned. The budget of $39,300 is given with a fairly detailed spending table, with wages paid in line with the work given. We can clearly see that the amount of money granted is being used for the purpose that the proposal gives.\nI rated: 5.\n", "q1r": 5, "q2": "The commitment to implementing progress reports in the form of monthly news on cardano feed makes it easy to audit progress. The implementation roadmap of the proposal gives timelines that can determine the process of implementation according to the commitment. Indicators/KPIs of the number of 100 videos, the number of video views and subscriptions given are suitable for auditing. In addition, we can also audit with the project page on Ecosystem Cardano and social networking sites. The success of the proposal is entirely visible through the audit of the kpis that the proposal proposes.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 10567, "q0": "“Keeping Up with Cardano: 100 videos” is a good idea and meets the challenge of “Developer Ecosystem”. The proposal has raised a problem that is attracting quite a lot of people, that is: \"People find it difficult to understand the potential of projects by reading whitepapers and websites, with unfriendly technical terms used. The terms used are very technical and not easy to access”. It can be seen that this proposal has identified that technical language is a barrier for people to learning about the Cardano community. Conducting 100 face-to-face interviews with TOP projects on Cardano Blockchain which are all projects that get many votes in each community vote, can show the quality of the proposal. Moreover, interviews will be broadcast on the Youtube channel and published on social networks, and videos will also be published on project pages on the Cardano ecosystem. I think this suggestion is very good and useful for those who do not know anything about Cardano or do not understand this ecosystem. The solution proposed by the proponent has identified most of the problems of the challenge, and reasonable arguments and evidence help to demonstrate the impact of the problem. To successfully implement the project, the proponent also foresees risks, of which the main risk is to make the team of project founders talk in a user-friendly way and avoid using too much technical jargon that is confusing. This difficulty has been effectively solved by the group through specific measures. I believe that proactively responding to difficulties will increase the success of the project.  However, interviews only meet the demand in terms of providing and exchanging information and data. I think this will not be enough to attract the interest of the community. If there are a few more podcasts or keywords noted after each interview and exchange of information, this would help the listener to grasp the main and important content but not lose too much of a lot of time.", "q0r": 4, "q1": "This proposal provided specific information according to the contents of the implementation roadmap, budget, and project team. Regarding the implementation plan, the proponent has divided it into 2 phases: 1 month and 2-6 months. However, they have not given a start date of implementation, and have not clearly stated the main tasks and tasks to be completed in each of those milestones. Instead of a general timeline of 2-6 months, the proponent should develop a plan for each month, what results should be achieved each month, and who will be responsible for controlling the progress and output quality. Regarding the budget, the proponent also presented quite clearly and in detail how to allocate as well as the purpose of using that budget. However, in this part, in my opinion, the proponent should also clearly divide the budget to be used in each period, each timeline corresponding to the implementation roadmap is 1 month and 2-6 months or can be more detailed according to the plan monthly. In this way, the team can control this stage of ineffective or ineffective use of capital. In addition, this part of the budget has been presented in the form of a list, I have a question here the specific budget for each piece of work will be divided equally or will be paid according to efficiency and productivity for each individual, for example, Editor and presenter = $1,900 x 5 months = $9,500. So the cost will be divided equally 50/50 or will be divided according to another competitive rate to encourage creativity as well as enthusiasm in work. About the project participants, the proponent provided information of 5 members, who are experienced and active in many fields such as Founder & CEO at Cardano Feed, Co-Founder of Cardanista Stakepool, Full stack and software engineer, Crypto journalist & content editor, Marketing Assistant. Their other information is also attached by the proposer with LinkedIn so that the community can easily access to check the information. With this complete and methodical provision, the proposal team has also had proposals from previous funds, it will increase the persuasion and increase the probability of the project's success.\n", "q1r": 4, "q2": "In order to measure the progress and success of the project, the proponent has given criteria to evaluate the results to be achieved such as the number of video interviews produced and published compared to what was planned in the project roadmap: 100 videos, Number of views of videos on Youtube: +150,000, Number of Channel Subscribers: 7,500+ new subscribers, etc...The success of the project is also determined by two indicators that are community participation on social networks and visualization of the interviews. However, as mentioned above, this section should also add specific data to increase clarity, and transparency and increase the auditability of the project. Although this is a new project, but I find that the proposed team has a lot of previous experience. \n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 13816, "q0": "Producing audiovisual content for Cardano it is essential for the development of the Community and its Ecosystem. If the Community wants to expand and grow significantly to expand their transactions and Developer Ecosystem, it certainly needs audiovisual content that back up their projects and challenges. Leaving technical language and expert vocabulary it is also fundamental. Crypto world is already obscure enough to the wide audience, if we want to consolidate as a Community and grow we need to address the wide audience in its own language. Interviewing experts in common language can show the creative potential and productivity of the Cardano Community. It is also to take into account that the audiovisual content will only have real impact in the wide audience if it is correctly shared in a variety of social media. This team cannot lose track of that. They cannot only focus on the production but also in the circulation of the audiovisual content outside the Cardano Community. ", "q0r": 5, "q1": "Having Maria Carmo, the Cardano content producer, is a good starting point for the successful implementation of this ambitious project. Also, having other projects approved on Catalyst they already know the dynamic of the Cardano Community foundation. The road map is consistent in time and budget. The experienced team is a guaranteed success. ", "q1r": 5, "q2": "The success of the proposal will rely on the quality of the interviews and also in the effective circulation without the Cardano Community. It is not only a question of numbers, in how many views the audiovisual content has on Youtube but of what type of visualizations it has. To address the challenge of the Developer Ecosystem, as a community we need to get to the wide audience. That might be something to improve taking account of the information provided in the proposal. ", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14492, "q0": "The proposal acknowledges that lack of technical understanding is a barrier to the average user understanding Cardano projects. The proposal provides value to the Cardano community by transforming 100 informative YouTube interviews describing Cardano projects into an interactive experience in which ordinary people can vote on which projects are promoted. Furthermore, voters have the ability to participate in the interviewing process. While the proposal's major measurements and goals align with the outlined challenge settings. The proposal is scalable to future challenges. This proposal addresses the issue effectively.", "q0r": 5, "q1": "The proposal includes a detailed plan and explanation of how it will be carried out. They have provided information on the team that will be working on the proposal as well as their experience and expertise. In furthermore, social links of team members, such as LinkedIn profile links, were included to check their credibility and capabilities. The proposer has asked $39.3K in funding but has not offered a detailed financial breakdown. However, the sought funds are sufficient to execute the proposal. They have also thought about potential risks. With the information provided, it is very likely that the project will be carried out effectively.", "q1r": 4, "q2": "Measuring work progress will involve comparing the number of video interviews produced and published to what was planned in the project roadmap, the number of views of videos on YouTube, the number of hits to the project page on the ecosystem, and engagement with streaming video on social networks. The measurement of community engagements on social media networks, as well as the visualization of interviews, would demonstrate success. All of the information provided is adequate for the proposal to be audited successfully.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 14760, "q0": "The proposers found that the projects implemented on Cardano are most difficult to access because of the barrier created by the terminology used in programming. In addition, the potential of these projects is also not discovered because of unfriendly programming terms. With that in mind, the team suggested the idea of ​​using live video interviews with the founders of projects at Cardano to specifically explain the features of their project. From there, projects in the Cardano community will attract more interest. This is a good idea that meets the requirements of the Challenge. I believe that when the project is successfully implemented, it will attract more members to the Cardano community.\nThe team proposed quite specific content about the project's features including setting the number of interviews to do, estimating the duration for each interview, and presenting specific project portfolios. Furthermore, the proposal also identifies the platform chosen to disseminate the project implementation plan. Those are social networking platforms that have a large number of users participating. The choice of where to disseminate the project is also important to attract more people to the Cardano ecosystem community. Potential objects are also identified from the outset by the proposers and describe the impact of the project on those objects.\nThe purpose of the project is completely based on the key metrics that the Challenge offers. The results that the project aims at are presented in detail. The community can see the positive impact the project will bring to the Cardano ecosystem.\nThe team also identified the challenge when implementing the project is to make the team of founders open and willing to share in a friendly way. The team has also planned a solution for that difficulty.", "q0r": 5, "q1": "The project implementation plan proposed by the team consists of only 2 phases lasting from January to June. The team also outlines the tasks to be performed for each phase. The project has a realistic timeline for completing the given tasks in a logical manner. The requirements for each work item have been mentioned in the proposal. The proposal also contains details on the technical and technological aspects required to execute the plan. Proposers have provided information (evidence, witnesses, or links...) about the skills and experience needed to carry out the activities mentioned in the proposal as well as clearly identifying positions and numbers. people needed to carry out the proposed project. This detailed project implementation plan helps the proposal to be appreciated for its potential to achieve goals and develop in the future.\nIn general, the budget proposed by the team for the project is quite reasonable. Investment items are also listed in the proposal. The proposers were transparent about the investment costs for each item. The way the team presents the budget plan is easy to grasp and understand.\nThe project brings together talented people with deep experience in the field. They bring the knowledge and skills acquired through previous projects to the development of this plan. Therefore, the project is highly appreciated for its potential for future success.", "q1r": 5, "q2": "The team makes sure to provide the community with some sort of progress report in the form of a monthly card on the Cardano Feed. The community will rely on it to track the progress of the project. In addition, in this proposal, the team also provides quantitative indicators that the project expects to achieve. The success of the project is based on the number of videos produced, the number of views and subscribers on the YouTube channel, and the number of visits to the project on Cardano. These criteria are all attached with specific numbers. The clarity shows that the team is taking the project seriously and trying their best to pursue the goal.\nThe image of the project's success is clearly depicted in the proposal. Based on that, the community can imagine the benefits that the project will bring when successful.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14832, "q0": "This section of the proposal is usually still more of a rough template than a finished project. We will have a wide range of ecosystem-related topics via Zoom meetings, such as Cardano's On-chain Governance Mechanism, what dRep means, how to build a high-value project for the Cardano ecosystem, and so on. It can be seen that by attending the meeting, participants are promised to have sufficient knowledge to begin the process of submitting proposals to the Cardano ecosystem. This will increase the number of projects and expand the market for the ecosystem in Vietnam, though there is some information missing. Meetings will be held online, as can be seen, but will the number of participants in each meeting be limited? Furthermore, will each meeting cover all of the topics raised by the proposer or just one of them? Besides, forming a team to write a proposal for developers who do not want to do is not a good solution in general. Because if a member of that team is unable to express all of the ideas that the developer wishes to convey, the project is likely to be rejected, and who will be held accountable? Instead, the author should try using the word \"assistance\" to advise Vietnamese developers on how to create the best proposal possible.", "q0r": 3, "q1": "The project will last six months, with the first month focusing on creating a schedule and selecting the best projects for interviews via a voting page. The remaining time will be used to conduct interviews, record and edit the entire process, and then export the video to the Cardano ecosystem. Overall, this is an excellent fit for the project, and I am confident that with such an impressive team, the project will complete on time. All five members of the team have impressive resumes full of experience, skills, and accomplishments that many people admire. For example, the Founder & CEO of Cardano Feed has practical and theoretical knowledge in B2B and B2C e-commerce, marketplace, digital marketing, UX/user experience, and so on, as well as an enthusiastic participation in cryptocurrency/blockchain, Defi, and cryptocurrency. Beside this, the proposer presents in great detail how the funding from the votes will be spent, and obviously, I am completely satisfied with what is written here.", "q1r": 5, "q2": "As previously stated, having a dream team will undoubtedly benefit the project greatly, and what is presented here fully meets all of the requirements. We have specific numbers on the number of videos, views, or subscriptions in the project's development progress section. And, to make it easier for investors to track the project's progress, the author will provide a monthly progress report, which I believe voters will appreciate. Furthermore, the project's desired outcomes are entirely consistent with the plan outlined above. In short, I hope that the entire team will soon receive investment capital from many voters and realize their dreams. Excellent work!", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "We will use live video interviews with the founders of the projects at Cardano, explaining in a friendly way the project and its features.", "experience": "The team will feature a journalist, blockchain cryptocurrency content editor, videomarker & presenter. Conceived by CardanoFeed team, the largest media specialized in Cardano coverage. We already have over 800+ projects in the Cardano Ecosystem https://ecosystem.cardanofeed.com"}