{"id": 417546, "author": "ruben.ruiz", "title": "Cardano Code Camp - Pay To Learn", "url": "https://cardano.ideascale.com/a/dtd/417546-48088", "category": 26597, "amount": 110000, "description": "The current Cardano developer training experience is sub-par fragmented, & incomplete. There is currently no central hub or process for aspiring Cardano developers to go.", "f6_no_assessments": 6, "f6_rating": 3.2222222222222228, "videos": [], "media": [], "f6_assessments": [{"id": 1348, "q0": "This proposal states a clear problem by raising the gaps in current learning programs for development within Cardano. His solution, which is the establishment of an Open Source Interactive Developer Training, is well aligned with the needs of the challenge because it increases the usefulness and adoption of Cardano. Its positive impact for the ecosystem is conscious and explained. However, I didn't really manage to find the KPIs. The proposer has put a lot of effort into explaining the why of this project, but the how is more difficult to understand directly. On the other hand, he explains that this project will be able to address future challenges and give a lot of interesting and important informations. ", "q0r": 4, "q1": "It would have been really important to have proof and more concrete links on the skills, identity and background of the applicant. in the part dedicated to the details of the project members, the answer remains really confused: “A collaboration of all the people who currently submitted the following Proposals?”, followed by a repetition of the budget break down. The fact that there is a lot of information provided and that the detail parts of the plan and timeline are still in the state of (tbd), really makes it difficult to understand. How? When? Who exactly? It’s a pitty, because the project seems well developed. But it lacks important information such as indices of confidence in order to ensure its sure value, knowing moreover that the budget turns out to be quite high. But in the other hand, the technical aspects are well detailed, as well as the risks with the solutions provided... But it really lacks a realistic timetable and a chronological plan of implementation. ", "q1r": 3, "q2": "I did not manage to find KPIs, the success index given specifies the goal of the project ends, but could have explained the positive consequences expected by the success of this initiative, by giving quantitative or other references in order to be able to have more diverse references to rely on. Several ways have nevertheless been considered in order to track the progress of the project, with a concern for transparency and regular update, but the formulation: “We can use GitHub”, “We can also collaborate using Slack”, implies that it is a possibility and unless it is a wording error, with a project that requires such a high budget, and objectives of collaborations between different teams and thus as ambitious, it would have been really important to have a plan, precise KPIs, detailed information on team members and safe values ​​to refer to. ", "q2r": 3, "assessor": "z_assessor_2232", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2820, "q0": "reason that this proposed group will commit to provide a suitable solution to partially meet the requirements of the challenge, when seeing fragmentation, there is no focus in education on related in-depth knowledge. regarding the Cardano blockchain and ecosystem,\n\n  In order to solve the above separation problem, the team comes up with a solution that brings together the technology related courses of the Cardano platform,\nThe way to do it is to create a camp (meaning an education center) to gather courses that tech-savvy developers are holding individually. The course rules include when students are trained, then encourage students to become developers, by providing scholarships to students who start building ideas on the Cardano ecosystem. The solutions proposed by the team have examples and reasonable explanations, with evidence for examples and statements.\n* however I find there are still some shortcomings that need to be added to the plan presentation of this proposal below,\n- firstly, the proponent needs to define the areas of activity, which will apply this support program, because basically the courses of other developers to which the team has links, basically do not support support multiple languages, and since each course is so established will be in different countries, and since it is possible that you can define a target area, re-zoning and centralizing these courses , only then can high results,\n- secondly, have the team contacted the proposed topics of the courses that you have listed in this presentation, have they agreed to cooperate with the proposal team to provide support when necessary, have not seen the statement yet? If any publisher has content related to this issue, besides the content is related to Plutus language education, why did the group leave TBD like that without a plan for that content.\n\n along with that potential risks are also not recognized by the team and have ways to mitigate, for example: no cooperation of developers who are organizing their own courses, and difficult access among the community. community and knowledge because of the language barrier, there are many possible risks but the proposed team does not have the vision to realize them.\n* My assessment of this proposal will have little impact on our ecosystem community, as there are many important plans yet to be established, represented by my comments above.", "q0r": 2, "q1": "it seems that the team wrote this proposal in a hurry so there are still a lot of gaps in the established plans to implement the idea, the team has not provided plans for the proposed development roadmap, a factor most important to evaluate a proposed idea is feasible or not, unfortunately.\n\nthe budget table seems to be a bit difficult to understand those expenses, while those courses have been funded for the necessary activities, separately for each course topic, the group has mentioned scholarships for Students are eligible, but it is necessary to calculate the estimates and show here specifically for the amounts given to the students in each course, to avoid the misunderstanding that the group is trying to fund the courses twice. Therefore, it is necessary to give comments and footnotes for each expense.\n\n it looks like the team information doesn't have the name of this proposal team but all the links to the courses, but those courses belong to another development team, not the team Therefore, the group needs to state how many people your group will have and assign positions to each person in the group to ensure that the work is done in accordance with their personal experience.", "q1r": 2, "q2": "The proposed group has stated that it will provide information for the community to monitor every two weeks on GitHub, but it is inadequate for the group to not state the work it will do, or metrics. measure the progress of the work of the team, so that the community can rely on it and with the support provided by the proposed team to audit and verify the work is completed or not, but it is also understandable when the team fails to provide them, because the team basically did not plan for the milestones from the beginning, and it is almost not clear what the work of the proposed team is because of all the content presented, in this proposal entirely from the courses of the other proposal, so to plan and set up the work will be very difficult, and moreover the successes are also unknown, what benefits the proposal will bring to the community , in general I disagree with the flawed plans and incomplete, out-of-the-box presentation of this proposal.", "q2r": 2, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 3, "ng": 4, "nfo": 5, "vca_o": 1}, {"id": 5109, "q0": "To put it simply, this proposal aims to create a learning platform for aspiring Cardano Developers. This alone has answered one of the main problems in the challenge by reducing the friction of new developers that are planning to get into Cardano Dev Ecosystem. \n \nBut, what good would it do for yet another learning platform in the community? This proposal has the answer. The author’s idea is to add more incentives for new developers by introducing “Cardano Developer Scholarship”. This monetary reward-based system gives enrolled students more incentives and motivation to finish the learning progress. \n \nThis proposal also includes detailed planning on becoming a self-sustained project by creating a way to raise funds using NFTs. This ensures the project’s future sustainability. The author also has a crystal clear vision of how the curriculum would be planned out, by the curriculum plan detailed in the proposal. With that in mind, this proposal does not aim to replace all the existing learning platforms in the community but to be an extension through collaboration. This will also help build a more collaborative, healthy developer community within the Cardano space. \n \nThe risks and ways to mitigate them also have been laid out in the proposal.", "q0r": 5, "q1": "First, the author has a firm idea of how this project is heading. They have presented a successful existing project as its benchmark. The author also recognized the risks and ways to mitigate them in this proposal. This proposal also includes a very detailed curriculum plan to be implemented, which adds some points to the feasibility of this project.\n \nBut as far as feasibility goes, unfortunately, this proposal has a few noticeable gaps that need to be filled. The author has failed to present any details on the team/people working on the project. The author only stated that this project would be a work of collaboration among other proposed projects in this fund. This proposal also requests an absurdly massive amount of funding. That is because the author calculates all the collaborators (4 different projects in total) in this proposal funding. This project itself requests $31,000 but without the justification needed.\n \nMoreover, the author has not provided a realistic timetable with milestones to track the project’s development progress. For all the reasons above, I believe this project still needs more work, especially on budgeting and roadmap planning details to become more feasible.", "q1r": 2, "q2": "“Each team will have a measurable goals timeline for their efforts.” This statement suggests that the author already intends to create measurable goals. The author details how these updates will be carried out using GitHub, Slack, and ClickUp platforms. The success goals are also clear: to create a learning platform for Cardano that gives incentives to its user.\n \nThis problem is that it lacks any quantifiable measurement for the success definition. It would be helpful if the author laid out lists of possible metrics/KPIs that support the project’s goal. One KPI example would be “Have a … number of the active user by the end of Q4 this year”.", "q2r": 3, "assessor": "z_assessor_2672", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5721, "q0": "By mimicking the bright sides of the most popular online school for developers - the FreeCodeCamp - this proposal has come up with a creative idea of providing potential Cardano to gain essential knowledge in coding with Cardano. If implemented successfully, this project could fulfill several objectives of the challenge \"Developer Ecosystem\", which are providing what Cardano developers need and making Cardano attractive to developers.", "q0r": 5, "q1": "The team working on this proposal has shown considerable knowledge regarding what needs to make this project succeed. They have done in-depth research into the FreeCodeCamp platform and planned to follow its successful path, which is extremely possible and efficient. While the budget asked for this proposal is high, it is plausible when the team explains about FreeCodeCamp's execution fund. However, I have not seen a clear picture of relevant experience of people working on this project. This fact concerns me deeply since this project needs a considerable amount of insights and experience to produce fruitful results.", "q1r": 3, "q2": "Besides the profile of people working on this project, everything mentioned in this proposal is highly in-depth and informative. I am surprised and want to applaud the excellence in many parts, including the budget breakdown, the FreeCodeCamp case analysis, and the example tracks that belong in the curriculum.", "q2r": 4, "assessor": "z_assessor_2741", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12676, "q0": "Proposal to indicate the problem to be solved the issue that the current Cardano developer training experience is fragmented and incomplete. There is currently no central hub or process for aspiring Cardano developers.\n- a proposal to show how it adds value to the Cardano ecosystem: Cardano Code Camp - Get paid to be a Cardano developer. Open Source Interactive Developer Training Center, is designed as a resource for Aspiring Developers and is freely accessible worldwide.\n- Cardano Code Camp will provide the community with a centralized combined goal of creating a great Developer Experience for aspiring Cardano Developers. Making the code open source and including self-funding by design, will allow the Cardano code camp to grow in its reach and ability to create new Cardarno developers.\n- makes it much easier to market, attract and introduce new and aspiring young talent into the ecosystem.\n- allows us to have a central point of education that is accessible worldwide.\n- the proposal is expected to continue to scale in the next rounds", "q0r": 5, "q1": "- Provide information about the relevant skills and required skills of the proponent.\n- Identify the implementers who have submitted proposals to cooperate with the proposed topic. Information on the experience of the participants in the project has not been given.\n- The proponent estimates the project implementation cost to be 110000 which is broken down into identifiable items. The actual timetable and specific plan to implement the proposal have not yet been given.\n Identify risks when implementing projects and provide solutions for those risks.\nFrom the information given I am not sure if the project has been successfully implemented or not? I think it would be better if the proponent also provided more information about the experience of the people collaborating with the project and made a detailed and specific plan for the tasks and the actual timetable for doing the work.", "q1r": 3, "q2": "- No roadmap with milestones as well as proposed implementation time has been provided.\n- When the proposal is successfully implemented there will be A free version of Cardano of Code Camp that pays aspiring developers upon completion of the Cardano Developer Tracker Full Program (in-depth training). and One self-sustaining fund for future growth and improvement.\n  - The proponent described how to measure to track his project's progress.\n- The proponent clearly describes the problem and gives a clear, understandable solution to the problem.\n- This is a new proposal.", "q2r": 4, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12827, "q0": " believe that this proposal addresses the demands of the challenge. The proposal team intends to build an open-source, community contributed training hub for aspiring developers. One of the team suggestions is to provide a quality education platform where hardworking and aspiring developers can get verified certification and also get rewarded on ADA when they complete the full track of a course. While this project is really good, I believe there is one aspect that might be useful. This platform mostly addresses to young and aspiring developers, not experienced ones. The disadvantage I see in here is that the process will take a long take until it starts to become of real use to our community. Given that Haskell programming language has a really steep learning curve, there would be at least 6 months for the program to produce its first graduates and start being productive. While this project is clearly necessary to the community, I suggest that the team refine their idea and include some extra features that intend to attract experienced developers as well. In that way there would be no time loss. Apart from this suggestion I believe that the proposal is really good. ", "q0r": 4, "q1": "I found this part of the proposal to be confusing. First of all, the part about timeline and milestone is left empty so no real detail in there. In the budget breakdown part, the proposal team has provided some links of other proposals inside Fund 9 Catalyst, the thing that got me confused in here is that they say the budget split for one part called Smart Contract Course For New Devs is $20,000, however when I click on the link, the proposal opens up and it also has requested a budget of $26900 and this is the case for all of the tasks. I must say that it doesn’t seem very reliable and it doesn’t project confidence. The same thing happens with the people that are going to work on the project. No details provided. Again links to other problems on other challenges are given and it has been said that all people in this other proposals are going to be working in here. I suggest that the team needs to provide a lot more detail in here given that the requested funding is $110000. That is a lot of money, and a lot more effort has to be put in this part. Again I must say this parts needs to really be revised and explain in great detail everything about the team, the hourly rate and everything else. This is a separate proposal, asking for its own funding and must not rely on other proposals which are also requesting for their own funding as well.", "q1r": 2, "q2": "This part of the project leaves much to be desired as well. No timeline has been provided. The chosen KPIs and metrics are very broad and even after reading the proposal multiple times I still am not able to accurately say what success looks like. For example the team claims to have a platform similar to free code camp but no realistic numbers have been provided. (i.e the number of users they intend to attract in a specific amount of time). And I see no public channel for the community to audit the progress. They suggest they are going to use Github, Slack and ClickUp for transparency across teams and increasing collaboration but there is no mention about transparency with the community. I suggest that the team revisits this part as well and provides all the necessary information.  ", "q2r": 2, "assessor": "z_assessor_3478", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Cardano Code Camp - Get Paid To Become A Cardano Developer. An Open Source Interactive Developer Training Hub, designed as THE go-to resource for aspiring Developers and accessible worldwide for free.", "experience": "Enrolled in Emurgo Academy’s Cardano Solutions Architect Program\nEnrolled in Bov Academy\nCompleted 50% of FreeCodeCamp\n18 Years of Digital Marketing Experience\nI suggest we combine our efforts to focus on a common goal of providing a great Cardano developer experience."}