{"id": 418195, "author": "parduseidolon", "title": "Learning token engineering elements", "url": "https://cardano.ideascale.com/a/dtd/418195-48088", "category": 26597, "amount": 33400, "description": "Tokens let you design economic systems with complex incentives but understanding how to engineer these systems is shrouded in mathematics.", "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 952, "q0": "The proposal seeks to create \"bite-sized, digestible video tutorials\". Normally I would be sceptical about such a proposition, but after watching the videos already produced by the proposer I have to agree that these would add a lot of value to the ecosystem. His previous work demonstrates that he is capable of producing concise and very informative videos in an appealing and quite charismatic way. I've seen a lot of educational content about Cardano floating around YouTube, but I have to say that so far none that I've come across has been so engaging. I also really appreciated the fact that throughout the proposal the proposer has been candid about his own mastery of the domain and his intention to learn along the way, taking the approach that \"the best way to learn something is to teach others\". This can bring a very fresh approach to the topics he intends to cover.\n\nThe proposal itself is very well structured and written, serving as proof of the quality of the content we can expect the project to deliver.\n\nThat is what can be said about the planned productions themselves but another area of interest, with very promising potential, is the topic of the productions: token engineering and the creation of novel incentive models. This has the potential to greatly benefit the community of Cardano builders and set the decentralised applications our blockchain offers apart. It is this part that makes the proposal a great fit for the Developer Ecosystem challenge.\n\nWithout giving away too much about myself I can say that I have extensive film/video production experience and I’m also basing my assessment of this proposal on my background as a project manager collaborating directly with Cardano developers since July 2021. I’ve also been involved in Project Catalyst, in almost all roles, since February 2021 and working with the Cardano development and NFT communities started almost a year and a half ago.", "q0r": 5, "q1": "The production plan for the video tutorials is logically structured and offers a great overview of what we can expect from the videos thematically. The lessons are to be broken down into five modules that will run over the course of 3 months, according to the presented production schedule. Unfortunately, the proposal seems to contain the description for Module 2 twice, instead of Module 3, however, I won't be lowering my score for this as it appears to be a simple copy/paste error.\n\nThe budget seems reasonable for the task, but, I will say that I would have preferred to see a breakdown based on tasks that need to be accomplished instead of by Modules. That would have painted a much clearer picture of intended cashflows and would have allowed the community to better judge what it is we are funding. Perhaps that could have been topped off with an hourly rate estimation for each task, instead of the “normalised hourly rate of USD$70” the proposal currently contains.\n\nThe background of the proposer and main implementer is adequately presented, and given his experience and training, there is a high likelihood that the project will be successfully delivered. However, the implementation plan and budget of the proposal seem to suggest that additional people will need to be hired to complete the work. But, no mention of this fact is made in the text of the proposal. For example, the description of the project mentions the fact that the videos will contain high production values including animations, yet the proposal doesn’t mention who will work on these animations and doesn't provide any examples as reference. This is not a big omission, nonetheless, I would have liked to see these details included. My recommendation would be to include such details in the future or to specifically mention that the proposer will do everything alone and is capable of delivering on all aspects required for the implementation of the proposal.", "q1r": 4, "q2": "Given that the deliverables of this proposal will be public YouTube videos and a dedicated website, they will be by their nature highly auditable. In addition to these, the proposer also intends to release the code produced for the tutorials as open source. GitHub interactions with this code are given as another KPI for the project, which makes perfect sense.\n\nThe definitions of success described for the project are well presented, and again make the case for why this proposal could be so relevant.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "An excellent review with some very valid criticisms on budget and plan. Some of the criticism highlighted were considered but dropped from the proposal to aid readability. And yes module 2 was accidentally copy/pasted twice. I was alerted to the error only after proposals where locked so posted the correct version in the comments."}, {"id": 4951, "q0": "The proposal aims to produce token engineering tutorials in the form of videos, code, and writing. Token engineering is a new, cross-disciplinary academic field that is just beginning to find its footing. I am very interested in the area and am working to learn more about the subject. Currently, the hub for this in the crypto space is the Token Engineering Community. They produce lots of content on the topic, including books, guides, and courses. The proposers is well aware of the current ecosystem and has cited all the major resources to be used in the proposal, and one resource that was entirely new to me, so kudos to him. This shows me he knows what he's talking about, has a good idea of what the problem space is, and a good solution in mind.\n\nThe output of the proposal will be comprehensive: short video tutorials with animations, code examples, and writing. So often, existing resources fail to present a full picture. Complete examples are very difficult to find, and nearly non existant in Cardano environment. This hampers projects that want to take a serious look into token engineering. This is potentially the greatest problem in all of blockchain. Bad token engineering is what leads to Luna. People take their own lives due to lost wealth. This is not a joke. Token engineering is like engineering a skyscraper. There is no rewind. No taking back. It must be engineered WELL. This is why this proposal solves an incredibly important problem. \n\nThis problem is also entirely aligned with the challenge. The knowledge gap for developers in token engineering is MASSIVE. Token engineers must know at least a little bit about: economics, psychology, game theory, ethics, optimization, and a lot more. Suffice to say most developers don't have a clue. Fundamental education on token engineering is thus incredibly important for developers. The proposal thus will fill in exploration stage gaps and bring in new developers by making Cardano's token engineering capabilities more widely known.", "q0r": 5, "q1": "As a token engineering enthusiast with a hobbyist background on economics, history, psychology, and game theory, and as someone on the same learning path as the proposer, I feel confident in sizing up the plan in this proposal. The plan is made up of 5 modules. Module 1 builds background knowledge: introducing economics concepts, token engineering, crypto economics. I suggest giving some additional information in Module 1 about all the different disciplines that apply here. Psychology, behavioral economics, and ethics especially are fields of study that apply well here. Modules 2 through 5 go into token engineering in detail introducing concepts like markets design, token design, and incentive design. This is a comprehensive course that is well put together. \n\nThe budget is fair for the type of work involved. Even learning token engineering is hard work. Making videos, code examples, and writing to teach it to others. That's very difficult work. I think it's a fair price for the services being offered. Jack has the video producing background necessary, we see this from his work on Youtube and his personal portfolio on his website. He has the capability to learn and teach highly technical concepts, we see this again in his Youtube. He has great explainers on highly technical concepts like Native Scripts (https://www.youtube.com/channel/UCUl0e1S_69nW2EBAi_xlpxA). \n\nI have no question in mind as to if he can deliver the proposal. Though I think the timeline is a bit tight with only 3 months. He's started learning the concepts already, so I'm guessing he already has started work on designing the tutorials. If so, I think he'll be able to deliver on time, if not, it will take a little longer than the three months proposed. ", "q1r": 5, "q2": "The main KPI for the proposal is Orbit's gravity metric. This is something completely new for me. So I checked it out in detail. Orbit is the \"mission control for your community\". As a community leader I was immediately interested in the technology. Gravity is the \"rate at which member involvement is changing.\". This is measured through various methods like Discord activity, Github activity etc. depending on the use of of Orbit by the community. The proposer notes documentation and code examples will be pushed to github, so gravity will be measured using those. This misses the progress on video tutorials but those will just be tracked from Youtube. So all important metrics to track project progress will be tracked. We know where to track the progress too, as both the github repository and youtube links are provided.", "q2r": 5, "assessor": "z_assessor_2643", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "An excellent assessment that captures the essence of the proposal’s subject, share’s their opinion on the importance, and correctly assesses the work involved along with progress to date. Thank you."}, {"id": 7416, "q0": "The proposal presents a plan to create modules that guide product managers and developers on token fundamentals. Give them more useful tools to complete the project, so the proposal is a perfect fit for this Challenge\nThe project interacts with users through short videos and dynamic knowledge. In each video, there will be documentation and sample code for developers to implement ideas. I appreciate this, it's a huge difference from other tutorial or translation projects. Help developers learn and practice right on their own products\nThe project clearly states the knowledge, articles, summaries, and definitions collected from Token Engineering, TokenEconomyBook (GitHub), E-elgar. These are standard sources, widely followed by the community, relevant knowledge, and highly authentic. I appreciate this\nRegarding risks, it is proposed to raise two issues and have mitigation options for them. All planned, I completely agree and rate this part 5 points\n", "q0r": 5, "q1": "The project process is 3 months long with 5 main tutorial modules, the project should present more detailed steps in the process of completing the module. For example, document synthesis, proposed script, video editing, etc.\nAs for the detailed budget, for each module, the project should be estimated according to the number of working hours, corresponding to the number of costs. Make reviews easier and more intuitive for the community. The total budget is 33,400$ representing 3.3% of the whole Challenge\nWith only 1 team member, I was really surprised by this. Please provide a social network for the community to consult and comment on when needed. While you have the knowledge and resources available to you, translating it from your own into your tutorials, helping people to understand more, is often a multi-step, time-consuming process. I think you should incorporate more members from the Cardano community you listed, like video editors, and translators. Make the steps more organized, professional, and authentic. I rate this part 4 points\n", "q1r": 4, "q2": "With key metrics such as documents, videos, and views, all are provided with specific links, helping the community to learn and track. These indicators are highly intuitive and easy to quantify. Right now I've seen 14 videos on the channel, they're well built. I would like to add one more indicator that is the number of people interacting with the tutorials, for example, the number of people who follow the channel, and exchange questions with the author. These are the people who really care deeply and follow the lecture schedule closely.\nThe success of the project helps create high-value tutorials that are accessible to developers when translated into multiple languages and promoted in the Cardano community. And more deeply, helping projects complete properly, thereby helping users have the best experience and sustainable development ecosystem. I would like to give this part 5 points\n", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "An excellent review. The reviewer makes a good point about expanding information on the extra hands I will be calling upon in this proposal. The assessor correctly notes “…translating it from your own into your tutorials, helping people to understand more, is often a multi-step, time-consuming process.” That is indeed the case. I am fortunate to be able to draw upon many people with the expertise to help me on the subject matter. I will be doing all the video production work myself, the work and budget does not warrant creating a full production team. However I will have assistance on material, design, script, and code.  That includes assistance from very active members of the Cardano Community. However I have not named these people directly in the proposal because they are only involved at arms-length providing guidance, editing, and review as needed (and in many cases at no cost to this proposal).\n\nExpanding a budget to minute detail to include working hours etc. is redundant. Neither helpful to voters, community auditing, or the team working on it. As indicated in the proposal, I am the primary person working on all of the proposal’s output with some consultation, editing, and review with people more experienced in specific topic areas. I have normalised the budget based on prior tutorial videos (linked in the proposal) to make the budget more accessible and accountable. Given the material is new and I am also learning it too, the nature of innovating makes it hard to determine the necessary steps up front. Any more detail would be pure fiction. How do you best explain a given topic with script, animations and code when it is new? You don’t know until you start working on it. Each module will have variable costs in production effort, much of it front loaded into the production of the first two modules. Therefore I don’t believe creating a detailed budget of the tutorial and video production process will help voters beyond what is already detailed and it is certainly of no benefit to the team (me). \n\nMost of the meaningful interactions for this type of learning material happens on Github and rather that using Youtube as a primary source of metrics for interaction I will be using Github. The Gravity Orbit metrics handle this."}, {"id": 6425, "q0": "Education is always important in the Cardano ecosystem. The proposal suggests that there is a lack of education of token engineering. The proposed idea is to create educational content in forms of written and video tutorials. All of these videos will be recorded on Github and will allow for any user to have access to it. This is important because it will allow more builders and creators of tokens to understand the engineering behind the technology and how they can use that to create a more secure project. As I stated before. Education is extremely important and has the potential to have a global impact on the Cardano community. Without proper education, the Cardano community may receive more backlash from other communities. The proposal could include more information on specifically how this engineering content will benefit all users or perhaps, the ability to scale the blockchain. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "The proposal includes the name of the proposer and his skills and experience. It is stated that he is a Haskell and Plutus software engineer and has experience in the music industry as well. I would love to see a LinkedIn profile included in this section. This will allow for the proposer to be held accountable for this proposed idea and will likely be a more convincing proposal. There is a detailed roadmap that breaks it down into different modules and months. Overall, the project will take around 3 months and there is information included in each of these sections. The specific details are included in each module. It suggests what the educational content will look like and how it will be created. This engineering content is planned to be created in a form of a simple and digestible video that allows for projects to understand the information simply. There is a detailed budget breakdown that shows exactly where the requested funds will be allocated. There are 5 modules that will each require funds and also software services in order to complete this. Overall, I would suggest including a LinkedIn profile or another form of proof of identity. There can also be more specific information in the budget breakdown that suggests exactly why the certain amount of funds will be needed for each module. For these reasons, I give this section 3 out of 5 stars. Once this information is included, it will allow assessors to determine the likelihood of success for this proposal.", "q1r": 3, "q2": "There is a decent amount of information. However, I am uncertain if there is enough to truly determine the likelihood of success for the proposal. It is a great idea and is proposed to bring more educational content to builders and engineers. However, there needs to be more methods that will allow the principle of accountability. The two biggest forms of this is proof of identity and specific information throughout the proposal. There could be more specific details in the budget breakdown that includes exactly why the requested amount will be necessary to create the modules. I like this project and I think it has potential to be successful. I would simply suggest more specific information so that the proposer can be held accountable by the community for the proposed idea. Because of this, I give this section 3 out of 5 stars for now. It should be an easy fix. Ultimately, I believe that the idea of token engineering will be extremely valuable to many projects and the video and written tutorials will help a large community to learn how to make the blockchain more secure and scalable long-term. ", "q2r": 3, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "A good review that may be helpful to voters. However the assessor focuses a lot on the absence of social media profiles (like LinkedIn) for the purpose of accountability. Social Media links have been provided, just not a LinkedIn profile. Instead I focus on profiles relevant to the proposal’s topic— Youtube and Github (both Social Networks I can be held to account to a higher standard than LinkedIn). These links also demonstrate my involvement in Cardano and our community over the last two years. \n\nExpanding a budget to minute detail to include working hours etc. is redundant. Neither helpful to voters, community auditing, or the team working on it. As indicated in the proposal, I am the primary person working on all of the proposal’s output with some consultation, editing, and review with people more experienced in specific topic areas. I have normalised the budget based on prior tutorial videos (linked in the proposal) to make the budget more accessible and accountable. Given the material is new and I am also learning it too, the nature of innovating makes it hard to determine the necessary steps up front. Any more detail would be pure fiction. How do you best explain a given topic with script, animations and code when it is new? You don’t know until you start working on it. Each module will have variable costs in production effort, much of it front loaded into the production of the first two modules. Therefore I don’t believe creating a detailed budget of the tutorial and video production process will help voters beyond what is already detailed and it is certainly of no benefit to the team (me). "}, {"id": 8875, "q0": "As tokenization and NFT's are growing at exponentially , most of the Engineers only have technical knowledge on building project , they lack knowledge over economical skillsets such as minting tokens, adopting tokenizaiton , Hence to counter that the propose wants to teach product managers and developers about designing the fundamentals of token engineering through video and written tutorials. so that they can start minting the tokens and be a part of NFT's and tokenization model , hence with idea of making developers improve the skillsets This proposal effectively addresses the challenge\n", "q0r": 5, "q1": "The mention task doesn't involve much of a risk , where teaching about tokenization is the main aspect here, the main challenge that the proposer might face here is gathering all the developers under single umbrella , other than that guiding classes can be done by the propsoer himself is a Developer Relations, trainer, content creator, proposer even has expertise skills in making video , the proposer even has presented how to module the tutorials from token engineering till incentive designs , hence with modules ready to work with ,given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly mentioned how proposer wants to provide idea about tokenization to the developers, so that developers can use it as incentive token or means to exchange where both can get explicit from tax.\nThe audit even contains briefing about each module which will be used as part of academics by the proposer, it even contains the experience and expertise of proposer in making videos which are effective, audit has detailed budget breaking idea based on each module , it even contains well structured plan for timeline of the project, Hence with minimal risk involved in the project The information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "The assessment is good and will be helpful for voters although the assessor frames the conclusion of the proposal’s impact incorrectly. Token engineering is not about “so that [developers] can start minting the tokens and be a part of NFT's and tokenization model.” Token engineering is about designing and implementing systems using tokens to help coordinate collaboration in a distributed network. The assessment correctly notes the proposal’s output is “to teach product managers and developers about designing the fundamentals of token engineering”— to introduce token engineering with a Cardano and Plutus twist."}, {"id": 10140, "q0": "  The solution you guys came up with is a series of short video tutorials that explain the fundamentals of token economics, incentive design, market mechanics, to show how to use these tools This will build DeFi protocols or help develop tools for DAOs. The solution side of the proposal is full of information on how to solve the problem you're aiming for. I personally feel that this idea has met the challenge posed, as well as fully met the major criteria of the challenge. .But I think the team needs to think more about the future scalability of the short videos that the team is working on in order to make changes that are most relevant to the reality of the ecosystem.\n\n   The Proposal Team is providing 2 main risks the proposal is facing. The author also provides a full range of reasonable and practical risk solutions. With the mantra that the team sets out for, ''One of the best ways to learn something is to teach it to others.\"\"' I agree with your approach and the group's motto.", "q0r": 5, "q1": "Given your experience, it is claimed that you have in-depth experience to operate the proposal, as well as this proposal being implemented by you alone. However, if asked, you should provide full social networking sites of the company. Jack O'Brien and personal archive link To help community advisors contact you and verify the claims of experience you are providing.\n\n  The proposed budget sheet clearly discloses the modules and your intended salary cost. The author also explicitly mentions the amount for each module one by one and ends with a fundraising total of $33400, to help operate the clearly included partial structures. And you also have a thorough explanation of the budget table provided.\n\n  About the roadmap of the proposal, the author is providing steps that last for 3 months. Also, provide clarity on the implementation items for the 5 modules you expect in the solution. The above helps to clearly distribute video content through each stage that you take. With a work schedule table full of content to do, and quality, I agree with the schedule you set out and complete it on time. Good luck with this proposal.", "q1r": 3, "q2": "  The KPIs you say will use Obit Gravity as the primary metric of coding and documentation examples for the migration to GitHub. Progress and success will be judged by two major criteria on GitHub for reviewing documents, and transparently viewing the number of followers and views of videos uploaded to youtube to help with the main assessment. verify the success of the idea. If this proposal is successful, it will help everyone in the Cardano community understand and use technical terms, tokens and incentives to appear in catalyst proposals in the future. You are aiming for wide sharing by multilingual to reach as many members as possible. These are enough for me to rate 5 stars for the transparency that the proposal is implementing.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "A reasonable review with three exceptions. \n\nThe impact assessment mixes statements about all three assessment criteria instead of breaking them out.\n\nThe subject matter is token engineering, not token economics. These two topics are related and I will cover token economics as one of the modules but token engineering is about designing and engineering token economic systems.\n\nSocial Media links have been provided, just not a LinkedIn profile. Instead I focus on profiles relevant to the proposal’s topic— Youtube and Github (both Social Networks I can be contacted on, likewise via Ideascale). These links also demonstrate my involvement in Cardano and our community over the last two years. \n\nAside from these there are some useful points that I think will inform and help voters."}], "solution": "Teach product managers and developers about designing the fundamentals of token engineering through video and written tutorials.", "experience": "Developer Relations, trainer, content creator. Background in motion graphics, video & music production. Haskell and Plutus Developer. Currently studying evolutionary and institutional economics. Involved in Cardano and Catalyst since Fund2. Eastern Townhall Co-Organiser. "}