{"id": 418345, "author": "oshomah", "title": "Plutus for Nigerian Universities", "url": "https://cardano.ideascale.com/a/dtd/418345-48088", "category": 26597, "amount": 22500, "description": "Nigerian computer science degrees fall short of the requirements to solve current blockchain problems. An opportunity for a solution arises.", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 713, "q0": "Yes, the proposal identifies an existing problem which is a lack of trained Haskell and Plutus developers in Cardano. This is a well-known problem in that the Haskell programming language is different from other languages taught at universities and therefore, the pool of talent at the moment is somewhat limited. The proposal aims to teach young students this skill and bring them into the Cardinal ecosystem. This will increase the number of developers in Cardano and potentially, over time, increase Cardano's overall capacity to deliver projects. The suggested training program is labor-intensive and scales linearly with the available teaching resources. The proposer is planning to come back for additional funding in future funding rounds if the community sees benefits in this type of training. Overall I think the proposal addresses the challenge setting by increasing the number of developers on Cardano and creating a sense of community between developers in Nigeria. ", "q0r": 5, "q1": "Yes, the proposer, Mubarak, provides a link to his LinkedIn profile which supports his experience in organizing events and marketing. He will be supported by the Wasa Cameroon Hub to provide Technical Training end hackathon coordination. Members of the Wada Cameroon Hub also provide links to their LinkedIn profiles.  The plan is organized in three phases. the first phase will be a conference that will teach students general principles of blockchain with a focus on Cardano and targeted to 500+  students.  The second phase will be Developer Training that starts shortly after the conference and will take place on a weekly basis + monthly in-person meetups in Nigeria. And then the third phase will be a hackathon every month for the last 3 months. The budget is broken down by key categories with the largest spend going against conference logistics and speaker fees. The total budget is $22,000. I am an organizer of similar events and my budgets tend to be around the same amount, for that reason I think this to be a reasonable budget. I also think it is a good idea to kick off a training program with a conference to attract the most amount of people and give them a sense of what the rest of the training program will be so they can make an informed decision. The key risk highlighted is that of universities going on strike. The mitigating action is to reschedule parts of the event or move to online learning, which seems a pragmatic solution. The proposer however does not provide details about the curriculum that will be taught nor the detailed objectives that the students will want to reach at the end of the program.  Overall, I think the proposal has a good chance of delivering on its intentions; however, I did not give full marks due to a lack of a detailed teaching curriculum.", "q1r": 4, "q2": "Yes, there are clearly set milestones and time horizons for the execution of  the training program. The proposer lays out the KPIs that will be tracked in each of the phases, and these include things such as the number of registrations, number of attendees, feedback received, and hackathon scores.  The success is also stated objectively which is to have more than 500 attendees at the conference, more than 40 monthly attendees in the training program, and more than 20 hackathon attendees. Overall I think this proposal can be audited effectively, and it will be a very visible proposal, so it will be evident early on if there are any issues.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3468, "q0": "Idea is good and adopt an interesting approach. It first focus on intensive education on what is Cardano and Catalyst, with a conference and follow up with the attendees in the following weeks, and then, only after it generate the engagement, it begin with the more technical training sessions on Plutus, which is the core of this proposal. This way, the students motivation to attend the trainings will potenbtially be higher and drop-out levels can be lower. It also addresses the challenge as it can help to increase challenge kpi of \"Number of developers actively building on top of Cardano\" and estimlate developer ecossytem in Nigeria. Risk management has 1 good risk identified and properly mitigated, by adopting online training sessions and flexible dates for the events, to overcome possible striked in the universities.\nAs additions to what is alwady in the proposal, it would be nice to see what universities (or even cities) in Nigeria exactly proposer is thinking of, to assess its full potential and how the adverstising strategy, to properly communicate the course and events, before the first conference is held, will happen. This is imporant to attract as much students as possible. Other thing that I missed as well is the full content of these events and in the training. What topics will be presented about Cardano and catalyst? What is the syllabus for the Plutus course? Having these informations would also help to validate proposal value and reach.", "q0r": 4, "q1": "There's a fair plan, time-framed, matching project scope and divided into 3 phases (conferences, trainings and hackatons). The plan clearly states the frequency of the events and it's nice that a hackaton is put at the end, so students can practise for real what they learnt. More information could be provided on the duration of each individual class in tranings and of the events. It would also be nice extra step, before the beggining of, to really plan properly the whole project. This includes communicate and pre-engage students, look for and rent the venues for the sessions, prepare the materials, organize staff and so on. This phase is key for a coordinated project. \nBudget breakdown is sensible and matches the timeline provided. The only extra thing that would be good to be added is the total amount of hours dedicated for the budget line of \"Management & Coordination\".\nAs for the team, there are 2 people committed, and linkedin links are provided. In addition, they will count wit the support of Wada Cameroon Hub, with more 4 people involved. It seems enough to run this project well. However, some experience in holding events or community management could be welcomed to make the whole coordination with students smooth. Maybe the people mention have it but this is not clear in the proposal.\nAll in all, it seems a feasible proposal, but minor improvements in the plan and the team experience (mentioned above) could be improved. My rate is 4.", "q1r": 4, "q2": "Proposer suggests 8 good metrics to measure success, divided into the 3 different project phases and 3 of them have target. I liked a lot that feedback is considered here already, for phase 1 and 3. This is very imporant to asses project quality and improve over time. The milestones from the plan could also be tracked, it's imporant proposers put them somwhere online so anyone can see how this is going. Last, as more of a suggestion, other kpis to include would be the number of people reached here that regiestered and proposed n catalyst aftewards and even the number of Dapps developed by them.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3542, "q0": "The proposers want to launch hubs in universities that train students to become plutus developers with the help of mentors and teachers. This is an excellent idea and a great proposal. It more than fits in the right category since what is more necessary for growing the developer ecosystem than actual developers.\nI really like the point of concentrating their effors for two weeks post converence, because the hype is still strong then and they can make maximum value in converting trainers students and regular developers looking to transfer to crypto. This is a really smart move on their part. 50 students seems like a reasonable class size with hopefully minimal losses that are already planned for.\nI didn't know it's a common occurance for universitty body members to go on strike, but this certainly constitutes as an obsticle in my book and the fact they have planned for that terrible uncertainty is amazing in itself.\nThis proposal will expand on the already existing hubs and help educate more developers. The program is 5 months long excluding the conferences and hakathons afterwards.\nOverall this is an impactfull solution. Kudos to the proposers and they ambition.\n", "q0r": 5, "q1": "I managed to verify and compare all listed skills with the ones in the links left in the proposal. These are well known part of the community and this is not their first proposal and it shows, because it's well thoughtout and structured. The timelines seem reasonable as well although that depends on the students, because 5 months might be a bit less time for some, but with the right motivation it's an absolutely achievable goal to reach for.\nThere's a good breakdown of costs which are relatively small compared to the whole budget for the challenge, so the cost / value ratio is good enough to vote for on it's own.\nThe roadmap is in 3 phases basically - aquireing people to join the program after the conference, and after the 5 month training is done there is a hackathon organized for the rest of the passing students. It's a simnple plan but a plan verified over and over in time. All phases of the proposal have time constraints that seem doable, although as a dev myself I'm not really goot at those kind of organizational estimations and I can testify only to the development side of things.\nThe resources necessary to make this project a reality are really well presented and the reason behind each one is described in detail. I love the idea about the hackathon at the end, because praktice is like the wax seal that brings everything together and helps the relevant, practical information to be commited to long term memmory.\nOverall I believe this is a solid and feasible proposal with a good value for the community. The people trained now will be the ones changing their envrironment in 5-7 years.\n", "q1r": 5, "q2": "I'm not too sure if the propoposal is as auditable as it can be, although project catalyst has a system in place to follow the progress of a proposal. I looked through the wada.org site and there is a list of countries having hubs but I didn't find a way to reach a particular hub information. Even so a nice thing I found is a page (https://www.wada.org/projects/) with all catalyst projects since fund 4. That's absolutely amazing and brings the credibility up a lot, auditability as well.\nIn the worst case you could always get in contact with the organizers or through the contact form here and ask for info (https://www.wada.org/contact-us/). Overall this is an auditable proposal with a clear description of the faced problem and a proven solution in mind.\nKudos for all the efforts!\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7112, "q0": "The proposal tries to promote the Cardano ecosystem to students in Nigeria. The proposer plans on holding one huge conference (potentially reaching more than 500 students), weekly technical training sessions, and three hackathons at the end. The outcome of this is the development of more than 20 students who are interested in blockchain and Cardano, fluent in writing in Haskell and Plutus, and have experience making MVP projects using their newly learned resources. The proposer also intends to connect the students with companies if possible, but educating them is more than enough for the students to begin contributing to the Cardano space. It’s interesting to point out the ongoing tension regarding blockchain technology in Nigeria. If implemented successfully, there is a potential that education programs like these might reduce the hostility surrounding the topic while also improving Cardano's relationship with countries in Africa. So far, I am inclined to support the proposal based on its potential contribution. I am concerned about how they would reach 500 students and the quality of them. The reason I emphasize this is that the whole outcome really depends on the early students because the entire process is a pipeline (the students participating in the hackathons are the ones who participated in the conference). Thus, I want to remind the proposer of the importance of inviting IT-savvy students first. It could be done, perhaps, by working with universities that have computer science, IT, or engineering related departments and starting from there.", "q0r": 5, "q1": "I need to point out that this project’s scale is not small and the timeline is long. It leads to the undesirable effect of having significantly more risks, unforeseen problems, and a non-exhaustive implementation plan. Thus, I can only make an assessment based on currently available components. First, the proposer team members, based on their profile and relevant experience, seem to be capable of running the entire implementation. I can say that because the WADA Cameroon hub has actually run technical training sessions and hackathons previously. Second, the requested budget is broken down into items and the amount for each is reasonable, if not slightly too little (perhaps because some of it is going to be held online). I do want to point out that the 1000 USD marketing, although reasonable, might need more explanation on the \"how\" aspect. Where is that budget going to go? Is it for online advertisements? Is it for university collaboration? Is it for posters? Third, the timeline is realistic and I appreciate that the proposer allocates a greater portion of the timeline for the technical sessions because I can attest as a software engineer that functional programming languages like Haskell and Plutus aren’t easy, and it might take longer than the current expected roadmap. In the end, I am inclined to support the current proposed plan as I couldn’t see any major hindrance that might occur. However, I would advise the proposer to better prepare if they went overbudget because right now I personally think the figures might be too low, the students could have more incentive as well for participating in the five months, and the current crypto market right now isn’t too good either.", "q1r": 5, "q2": "The currently provided information is suitable, although the accessibility aspect might need more explicit explanation. The roadmap and milestones presented to us are clear enough and we could see from the bird's eye view how the entire project is going to be for the next nine months. The proposer metrics are based on the number of conferences, training sessions, and hackathons attendance. The KPI is also objective and ambitious (500+ for the conference, 40+ for training sessions, and 20+ for hackathons). By providing those KPIs, we could easily measure if the project reached its target or not. However, a slight improvement is needed around the reporting aspect. How could we publicly track the proposer's progress? I assume this isn’t a huge problem though, because funded proposals have to regularly update their progress through Coordinator and make a final completion report at the end.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 9, "ne": 3, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8881, "q0": "As Plutus is one of the important programming languages to develop blockchain related data, but most of the people around the world are unaware of Plutus and its developers demand in the current market, Hence to counter such scenario President of ABU(Ahmadu Bello University) Developers (the proposer) wants to set up Plutus to Nigerian students so that they can contribute and develop ideas over blockchain in the future, this proposed idea will also help the students to make their carrier out of Plutus, By such tasks it can even reduce work load and demand of current Plutus developers Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The mentioned task is not difficult to achieve where , it just needs one good person or professional Plutus developer, who can teach the students of universities  about Plutus programming language, this task can be achieved by Oshomah and Mubarak Aminu who have been lead in developing software programs, the proposer even wants to conduct Hackathons where students can implement on what they have learnt , this task is assigned for members of Wada Cameroon Hub where it consists of software architects & developers, hence with work assigned already and with given experienced team and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 4, "q2": "The audit has mentioned clear goal on how to improve the number of Plutus developer so that they can make carrier out of it, Audit even contains proposed solution in very detailed manner , on how to onboard first and train them next and later conduct hackathon so that students can implement on what they have learnt .audit has even introduced all the team members who will be working on the project and it has even assigned roles for whom to teach and for whom to conduct which shows that the team is fully organized.\nThe audit has presented detailed budget breaking idea to complete the project and it even consist of detailed timeline structured for the project, Hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9115, "q0": "Proposal gives the issue that Nigerian computer science degrees fall short of the requirements to solve current blockchain problems. They come up with the idea of working closely with universities to create oriented programs that introduce students to the world of Blockchain technology. First of all, they will hold a big conference to introduce students to Blockchain and Cardano technology. They will then follow up events providing more hands on support to onboard developers into the ecosystem and followed by technical training and hackathons. Specific content after the conference will be: Week 1: General introduction and orientation program focusing on how blockchain technology works; week 2: Hand-holding into the Cardano ecosystem and Project Catalyst; week 3: when at least 50 students want to learn more, they kick off more technical training by introducing them to the Plutus ecosystem starting with a foundational language called Haskell. Therefore, this project not only educates students but also be a catalyst by creating an enabling environment through hackathons and seminars that inspire them into creating the next major dApps on Cardano.\nThe project will engage young developers in Wada's Haskell and Plutus training program and provide ongoing support through hands-on support from the local Nigerian Center. Therefore, the project fits the goal of the challenge.\nThe project introduces the risk of university strikes and tension within the government when it comes to blockchain technology. They also offer ways to reduce it.\n\n", "q0r": 5, "q1": "\nThe proposed roadmap is as follows: phase 1, the first month will hold a conference in the school to introduce students (for more than 500 people); phase 2 (5 months) will be developer training, hosting weekly virtual training courses followed by monthly face-to-face meetings with organizers in Nigeria; Phase 3 (3 months) will start a 3-month training program and host  total of 3 Hackathons, one Hackathons per month until the end of the project cycle. The project has a clear and specific roadmap, so it can be successfully implemented.\n\nThe budget required by the project is $22,500, including conference logistics $6,000, marketing $1,000, Refreshments $2,000, Speakers Motivations $6,000, Hackathon Prizes $3,000, Management & Coordination $4,500. I see some costs such as management and coordination costs 4,500 USD, Speakers Motivations (travel and logistics) 6,000 USD, the project should be more detailed so that the community can easily assess its reasonableness.\n\nProject implementation staff includes Oshomah - Project Lead in Nigeria, a Computer science major, Creative director of Afrixx NFT project; Mubarak Aminu - a Developer community lead ABU Zaria, Mathematics major and Software developer. In addition, there is Wada Cameroon Hub that supports technical training and hackathon implementation, who have many years of experience in programming, Haskell functional programming, software development. With a staff like this, I believe the project can be successfully implemented.", "q1r": 4, "q2": "The project has a specific progress, divided into 3 phases and the goals of each phase are as follows: phase 1 will hold a conference with more than 500 attendees, phase 2 will have more than 40 attendances at events every month and phase 3 will have 20+ hackathon attendance. These numbers are quantifiable so they can be easily assessed by the community.", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13055, "q0": "The project addresses the main goal of the Developer ecosystem challenge by training students to become future Plutus and Haskell developers. The project provides essential information and understanding about Blockchain technology and Cardano ecosystem\nMoreover, the project will create potential seeds for the Cardano ecosystem\nThe project provides students with a real learning environment through the Wada Nigeria Hub project - this has made access to the cardano ecosystem easier for African students - where education is still lacking\nProviding knowledge for students to better understand the blockchain, Cardano ecosystem as well as training them to become Plutus and Haskell developers in the future will help the Cardano community develop more sustainably and give students a better future. \n", "q0r": 5, "q1": "With a team that has experience in real work, the presenters are members of the Africa Cardano project so I think the conference will be very interesting and realistic.\nHowever, 500+ students participating in one conference in the first month is quite a large number, which can be broken down into outreach sessions with each university to make the seminar more successful as well as based on the number of people register for the workshop to avoid wasting space\nThe project gives a clear weekly and monthly plan\nAbout the project team, they have been disbursed for the Nigeria Hub through Planting Roots in Africa project and now they have cooperated with Wada Cameroon hub. Within being successful in elected in the previous rounds, I fully believe in the vision and strategy of the project team in fund 9", "q1r": 4, "q2": "\"All costs are clearly explained and easy to audit\nthe project gives us clear numbers for the number of members attending the conference, the number of students participating in training, as well as the number of students becoming future developers", "q2r": 5, "assessor": "z_assessor_3552", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Create hubs in universities that train students become plutus developers with the help of our friends at Wada.", "experience": "\nWada Hub community lead in Nigeria. Computer science graduate.\nPresident of ABU(Ahmadu Bello University) Developers\nPython instructor at 3logy Nig Ltd.\nWada Cameroon Hub for support with technical training and hackathon implementation and coordination\n"}