{"id": 418725, "author": "bigbenbeer", "title": "UTXO Optimizer and Scheduler", "url": "https://cardano.ideascale.com/a/dtd/418725-48088", "category": 26597, "amount": 3854, "description": "Concurrency with UTXOs is a tricky problem that is difficult to solve and adds to transaction load unnecessarily.", "f6_no_assessments": 7, "f6_rating": 4.619047619047619, "videos": [], "media": [], "f6_assessments": [{"id": 715, "q0": "Yes, the proposal addresses the challenge setting by improving the experience of developers when interacting with the cardano-cli and creating UTXO transactions.  the deliverable is a math model of how to best batch transactions together and manage the problem of concurrency it will not implement the model in any language which will be up to the developers to decide what language to use. The research will be done at an advanced level and the proposer aims to publish his conclusions in an academic journal.  As a developer I think this is a great idea as there has been a number of implementations of how to deal with concurrency. Some examples are MinSwap and SundaySwap DEXs; however the hasn't been an academic-level research paper on this. I do have a few that the developers would primarily benefit from having a working implementation in a programming language that they could get started with.  The proposal might come back additional funding if there is scope to develop project further.", "q0r": 4, "q1": "The project will be delivered by Benjamin Beer, who has a formal computer and electronic engineering education with a focus on hardware and software programming and system design. Ben provides a link to his LinkedIn profile and the list of academic achievements in the past years.  Ben is currently a postgraduate student and will be developing this project as part of his academic research. Ben is also the CTO of Revelar, which is a startup funded by Catalyst. Ben has the skills to complete this project and has experience working with Cardano. The budget is set very conservatively at just over $3,000 and would be used to cover the tuition and other campus fees. Benjamin does not pretend to make a profit on this project but rather use it in his thesis. Ben aims to deliver this within three months and the timeline is split into three sections. In the first section he will deliver a literature review and a problem statements; in the the second section he will deliver a math model with relevant simulation and preliminary results; in the 3rd section he will deliver a paper and code base with the expectation that the paper will make it into a publication. There is no discussion of the language or the architecture as this will primarily be a math model. The provided git repo repository was empty as of the 5th of July. The Proposal discusses a number of risks that could derail this deliverable. One of the risks is that the project scope is too small, or the development takes much longer than expected, that he becomes a bad student and cannot deliver. He then goes on to provide the mitigation actions for each of the risks.  I'm confident that Benjamin will be able to deliver a math model; even though I would have liked that, he also did a demo implementation in a programming language", "q1r": 5, "q2": "Yes, A road map is provided  with the delivery schedule. The KPIs are provided: the code base will be shared in a public GitHub repo, he will post the graded documents on Githun and the final paper will be published as an open-source. Benjamin will also seek feedback from the community to inform whether additional funding and work should you request from Front 10.  success looks like a production-worthy paper and a mobile that developers can use to schedule transactions to maximize UTXO efficiency.  I'm confident that the deliverable is auditable to a high standard.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1876, "q0": "This proposal addresses the general area of \"Samples, recipes and templates\" as well as \" Developer productivity: IDE's, scripts to automate stuff\".  If implemented with Javascript and CIP-30 wallet interface as a coin-selection algo, it would be a clear value-add to the community.", "q0r": 5, "q1": "Although the funding amount requested seems very low, it is also clear that the proposer is using this topic as part of their education.  A stipend for supporting this effort seems entirely appropriate (proposer should probably have asked for more in my opinion, but no deduction for this).\n\nCoin-selection and optimization is a very real practical problem for developers.  A mathematical model that addresses not just one transaction's efficiency but also the wallet's ability to spend \"at scale\" ... it makes a whole bunch of sense.  \n\nIt's just the kind of problem that a successful student of mathematics is in a good position to solve.", "q1r": 5, "q2": "Although the need for holding research results close while it is underway is unfortunate, the motivation is clear and sensible.  Exposing a public git repo provides some transparency of the progress of code, and the measures of reporting described by the proposer make good sense from here.  ", "q2r": 5, "assessor": "z_assessor_2282", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3545, "q0": "The proposal is about creating a math model and tooling that dapp developers can use to minimize the number of transactions, being more eficient. This is a great idea and would definitely financially and otherwise impact the ecosystem. This is a new problem that many people are trying to solve and one more part of a solution should always be welcome. The proposer has the necessary considerable skilset to pull this off and given the requested budget should definately be given a chance to try. \nIf successful this proposal would be greatly beneficial for all developers using this tooling to better the developed dapps, which makes it a perfect candidate for the development ecosystem challenges and mixes well with the challenge settings mainly making devs lives better.\nThis will have a great impact since the proposal would affect every dapp that uses transactions which are almost all of them. I recommend voting this in as the impact would be amazing and if not the budget is only representing 0.38% of the available funds.", "q0r": 5, "q1": "As I already mentioned Benjamin Beer (epic family name btw) has all the necessray skills to pull this off. He has listed all his considerable credentials and he's quite blockchain oriented for the past 18 months. He recognizes the potential of blockchain and wants to help out cardano potentially maximize the eUTXO model allowing for faster transactions through the use of paralelism. He's shown to have intricate knowledge of the subject matter and understands possible optimizations available for mass usage.\nThe proposer recognises possible risks like taking too lont and has the necessary contingency plans to make it all work.\nThere's a good and very specific timeframe for executing the roadmap and has a plan of an interative approach of delivering the end result, which has provedn itself to be the supperior way of working. In a true cardano ideology there will be papers and reviews and finally code.\nThe budget is really really well described and is more than reasonable considering the work to be done. I do like Benjamin has an idea of possible solutions comming from already existing problems, because usually you don't want to figure out something that the evolution of effort has already figured out, just find how to translate it to your case. This is the first case where I'd say the proposer has given more information than necessary rather than less.\nAll and all there's a sensible plan for implementaitons and technical aspects and technologies used are mentioned even though not crucial for implementation of this proposal. There are challenge mitigation tactics and relevant timeframe for implementation. It's a feasible proposal.", "q1r": 5, "q2": "Considering Benjamin is a post-grad student, I don't think there's anything to worry about regarding auditability. There are going to be piles of documents and explanations and papers. There's also an empty github repository which I really appreciate and have suggested to other porposers in the past to create such empty repositories because it leaves a target to follow for anyone interested in the proposal and having a bookmark makes following the project more probable.\nIt's a clear and well defined problem statement and a great start of an idea for a solution which as a developer myself think it's headed in the right direction, by trying to find a similar problems to this one that were already solved and accomodate for this environment and properties.\nThe success of the project is a \"publication-worthy\" paper by the words of the proposer and academiics to become more actively involved in cardano research and ecosystem - a noble marketing goal.", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4952, "q0": "The proposal aims to build a mathematical model that optimized UTXO use while building transactions, and a Javascript/Python script that uses this model. The proposer explains the problem very well and in good detail. UTXOs are at the heart of Cardano. They grant many scalability benefits, in theory. In practice, building transactions is done using the Cardano-CLI, and is quite difficult to do. As the proposer suggests, we need an optimized algorithm to select which UTXOs to use in any give transaction. This will truly allow Cardano's scalability to shine. It will also allow developers to use a trusted open source algorithm to use when building transactions, lowering the barriers in developing for some of the more complicated use cases like DEXes, marketplaces, etc. The proposal is very much inline with the challenge, as it will make developers' lives easier building transactions in complex use cases. This is very useful since building transactions is generally thought to be the most time consuming and difficult part of developing on Cardano. The proposal will also be part of the proposers' Post-grad Degree in Industrial Engineering and will result in a public IP research paper. We love those papers at Cardano, so matches well with the vision too. ", "q0r": 5, "q1": "The budget is set at a measly 3854.09 USD, only covering education expenses. The proposer notes he doesn't want funding for anything other than the expenses. The plan is simple with three milestones: 1 - delivery of literature review, thesis, and problem statement, 2 - delivery of math model, simulation, preliminary results, 3 - completed academic paper and code base. From step 1 to 3 it spans about 70 days. This seems to me a tight schedule to deliver, but since this is part of an academic research, I'm guessing the work is already underway. \n\nThe proposer is a Computer and Electronic Engineering major. He has extensive background in data processing, optimizing, and application of blockchains in supply chains. He's the CTO of Revelar, a Cardano based gaming company. They have 10 proposals on Fund 7, 10 on Fund 8, and 2 on Fund 9 (This proposal is not a Revelar proposal). 4 of these F7 proposals, and 2 of the F8 proposals have been funded. I assume the proposer is working on all of these, as the entire team is made up of 3 people by the information on their website. There is no information provided as to how he'll manage workload with other proposals. These seem to be small proposals, so I don't think there'll be a big issue, yet this info should have been provided nonetheless. \n\nOverall, there is schedule and workload questions that are unanswered, but from what I've seen in the proposer's work, I believe he can deliver, maybe on a slightly delayed schedule. ", "q1r": 4, "q2": "The proposal has an open source github repository from which progress will be publicly seen by anyone interested. If allowed, the proposer will also post graded documents as these will show academic progress on the work. The proposer will also conduct check-in meetings and reports, although there is no information provided as to which communication channel these will be conducted through. The proposal is clear in what it will do, by when, and the output to be produced. It is a research project, with the aim of creating a research paper to be published in a respectable journal. This is a good definition of success but I think it's incomplete. The main point of this research is optimizing and scheduling UTXOs. There should be a metric to measure how successful that is. This will certainly be a part of the research paper, but I think it should have been mentioned here as well. It should definitely be reported as part of the check-in meetings and reports mentioned. ", "q2r": 4, "assessor": "z_assessor_2643", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5756, "q0": "As a developer in the Cardano ecosystem, I know how difficult it can be to come from a different background into a UTXO model. Anything that optimizes for this is not only helpful, but necessary if we want to onboard developers to Cardano. We all know that Cardano will only grow through the developer ecosystem. This script will be very helpful. I know I would personally use it. ", "q0r": 5, "q1": "The proposer seems highly knowledgeable about the ecosystem and confident in their ability to deliver. It is clear by the amount of detail in this proposal that the plan is well thought through. Everything is outlined clearly and concisely. I believe every sign points to a successful implementation of a highly useful tool. ", "q1r": 5, "q2": "As mentioned above, this proposal goes into great detail. Included in this detail is a very clear auditability section. We will be able to audit the progress of this proposal through check-ins during the production of both the academic paper and the script. I look forward to its use. ", "q2r": 5, "assessor": "z_assessor_2747", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 8889, "q0": "Unspent Transaction Output nodes is  used mostly by every developer for their wallet , but the rapid increase in the size of the UTXO set has caused the main part of the UTXO set to be stored in the low-speed disk, and thus  with more number of transactions  it slows down the verification speed of new blocks in lightweight full nodes. Hence to overcome such scenario the proposer wants to build a mathematical model so that it can minimize the number of transactions and maximize the potential power of transactions. later setting up this as open source so that any developer can use it in the future, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The mentioned task is not a simple one to achieve , where developing a model so that it can maximize the potential power of transactions, lot of research are going on currently to improvize the efficiency of UTXO still many are not coming up with valid solution to it, In the proposal the proposer alone wants to work on it which is another backlash on whether proposer alone can complete the work, Excluding that proposer has successfully built more than 5 mathematical models using spring with a proven results which is big boost for the project completion scheme, with proven results and difficult task to achieve plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has presented the clear picture of proven experience of proposer in developing mathematical model, the proposer should have introduced any other members who'll be working on this project because with combined work , work efficiency definitely increases. the audit should have even presented timeline of the project in still more detailed manner.\nExcluding above points audit contains proposed solutions in very detailed manner and it also has decent budget breaking idea to make project still more efficient , with a great goal to optimize UTXO so that future wallet developers can use this patch ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10297, "q0": "Problem solved fits a mathematical model and script that developers can use to structure transactions\nTo deal with minimizing the number of transactions and maximizing the potential strength of transactions.\nCreate a lot of potential for the information technology industry\nSolve the challenge presented using Cardano's UTXO model\nIt offers many benefits providing more security and once you wrap your brain around it, the development of smart contracts will be greatly enhanced\nIdentify risks and challenges that exist in reality\nUTXO can be difficult to work with larger transactions, more so if non-Ada content is involved. can be leveraged to improve the scalability of the network.", "q0r": 4, "q1": "Progress on clear milestones and highly achievable meetings\nThe required budget is detailed, reasonable, clear and transparent, with the right amounts to spend\nCompetency Master of Science in Industrial Engineering, at Wichita State University, in Wichita, Kansas, USA. The results of the research have potentially relevant experience that I hope will help inspire other scholars to participate more actively in Cardano research even while they are researching and this proposal if funded. will provide a prototype for how this can be done\n", "q1r": 4, "q2": "The project's success metric has a clear and realistically innovative use of Project Catalyst to improve Cardano, everyone's blockchain, and in the process, inspire others. conduct research done to lock behind corporate paywalls\nMatch the challenge and an entire crowd-sourced funding platform like Catalyst can prove to be incredibly powerful ways to do that.\nThis is a completely new project. I see this project has many benefits for the community. Good luck to the project.", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "I propose creating a math model and script that developers could use to structure their transactions to minimize the number of transactions and maximize the potential power of transactions.", "experience": "Benjamin Beer - Bachelor of Engineering in Computer and Electronic Engineering, 18 months of graduate level research in industrial blockchain technology and formal coursework in decision support mathematics and operations research. CTO of Revelar, a Catalyst funded company."}