{"id": 419112, "author": "jackie", "title": "Virtual Hackathon for Dev Education", "url": "https://cardano.ideascale.com/a/dtd/419112-48088", "category": 26597, "amount": 135000, "description": "There is a shortage of developers developing on Cardano globally, specifically the Asian region, and there is still a lot of room for builders to build products in the Cardano ecosystem.", "f6_no_assessments": 10, "f6_rating": 4.3, "videos": [], "media": [], "f6_assessments": [{"id": 3285, "q0": "I have to say up front how refreshing it is to see the approach to a hackathon the team is taking here.  Typically hackathons are 2 day events, and even though they have a sense of community, the urgency of the event puts a damper on the collaboration that makes Web3 so powerful.  In this proposal the team lines out an approach for a 4-week hackathon that creates plenty of room for collaboration on resources and learning.  And this principle shows up in the teams other proposal where they flip the basic hackathon model upside down to distribute small, bounty-style rewards across all participants.\n\nThe links to Cardano are clear, as the whole 4 weeks will be dedicated to building on Cardano. The materials they build will be able to scale in that they can continue to hold these hackathons with less lead time (currently a full 3 months, but a lot of that is establishing the resources and content of the event) and also make the format avaialable to others if they desire.\n\nWith a planned outreach of 1500 attendees, this would be a massive hackathon to deliver, but it would also have a tremendous impact.  Their expectation that could be featuring 50 projects by the end of the first round would be an amazing accomplishment for everyone involved.\n\nBecause a hackathon would directly lead to enhanced developer skills, and because of their collaborative approach to the process that provides opportunity for developer skills beyond just coding to grow, I fell this project merits full marks for Impact.  5 Stars.", "q0r": 5, "q1": "The proposal really shines through this section.  The team is exemplary, and brings a decade of experience running these types of events, including many current major ones on other chains like Polkadot.  They also bring a community of 260K+ member developers, which is absolutely stunning.\n\nThe description of the event and its preparatory stages is well described and provides an easy to parse roadmap through the approximately 6-7 month timeline.  When correlated to the budget and roles outlined in the team requirements section, each line item of the budget is accounted for in detail and well explained.  The majority of the funding goes to setting up and executing the event, and rewarding the participants, which is a reasonable approach given the experience accounted for here.\n\nBecause the team has thoroughly describe their experience, resources and approach, as well as the scope and use of the resources they are requesting, I am marking this project a full 5 stars for feasibility.", "q1r": 5, "q2": "The kpis presented (1500 participants and 50 projects presented) are ambitious, but also seem well within reach.  The approach they are taking appears to be for participants to get familiar with the ecosystem and resources, and then to pick interesting projects and figure out how they work.  If that is the formula they follow than it stands to reason that all of these developers will have a pretty good cross-sectional view of the Cardano ecosystem, and through hacking it a greater appreciation for what they can do on the platform, which is in alignment with the challenge.  If the projects presented end up being forks of existing projects, this will make a great metric for measuring the projects ROI (while distributing a fair amount of support throughout the opensource projects they will be emulating).\n\nBecause the team has established clear, measurable goals, and because the roadmap presents deliverables and milestones over the course of the whole timeline, it is expected that they will be able to keep this project up to date and progress monitored through Catalyst.  I give a full 5 stars for auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the lengthy and generous feedback! We appreciate you for taking the time for writing this. "}, {"id": 3896, "q0": "The issue is that there is a global shortage of developers working on Cardano, particularly in the Asian region, despite the fact that there is room for developers to develop projects in the Cardano ecosystem. To inspire developers, the proposer proposes holding a virtual hackathon. Hackathons bring together new and experienced developers from all over the world to build on Cardano and introduce a flow of high yield projects into the ecosystem. By implementing this proposal we will able to onboard new members to the cardano ecosystem. Thus this proposal effectively addresses the challenge", "q0r": 5, "q1": "As per the proposal the proposer and their team has experience of 11 years of organizing hackathons physically and virtually. Based on the details given it can be said that the proposer and their team have relevant skills and experience to successfully implement this proposal. The proposer has provided a clear plan of implementation. The proposer has demanded a budget of $135,000 but the breakdown given is very vague. therefore it's had to say if the budget demanded is reasonable or no. The proposer has considered possible risk overall it is very likely this proposal will be implemented successfully ", "q1r": 4, "q2": "The proposer has provided a clear plan with it being divided into 3 phases Pre-Hackathon, Hackathon Commencement and Post-Hackathon. They have also provided timeline and details of the hackathon which will very useful. They have also provided few points that will be helpful to measure the progress of the proposal. The proposal also consist of details to measure the success of the proposal. All this information is sufficient for the auditability of the proposal.  ", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Thank you for your concern about the budget, but we assure you that the money is put to good use as it takes resources to run a successful hackathon.\n\nTo our knowledge, it’s important to invest resources in order to have a smooth hackathon run - it is surprisingly resource heavy to run a good hackathon. With F9’s support, we will definitely make an impact with an excellent run of the hackathon.\n\nThank you PA for your kind comments and concern! "}, {"id": 5343, "q0": "The virtual hackathon for dev education proposal is organizing a virtual hackathon to inspire builders. The event will bring new and existing developers together to work together on a problem. The proposer team will engage 260k+ strong community of developers to participate in this hackathon. The objective of hackathon is to see high quality project builts on cardano. The hackathon will run several months to allow time for developers to build solutions that solve real world issues. This can make impactful projects that lead to Cardano adoption. The proposal effectively addresses the challenge well although it will be great if proposer team could show the website of their work so far.  This will give more confidence to convince that they have access to more than 260k+ developer mail list. If they would obtain those contacts from angelhack, it's better that they disclose.  It is still unclear how much involvement from angelhack (their link is provided) being a part of this hackathon. Does this hackathon event co-organize with angelhack and whether they also contribute to the prize pool for developers. ", "q0r": 4, "q1": "The time they plan for each milestone look reasonable. They allow 6 weeks for conceptualization and building of program, 4-6 weeks for marketing and community outreach, 4 weeks for hackathon event itself. Prize will be distributed by AngelHack post hackathon (not sure how much AngelHack contribute to the prize pool) with the possibility post hackathon for recommendation of projects to receive grants. However, the main question of this proposal is on the proposal total budget of $135,000. The prize pool itself is only $40,000 and the rest is going to community management, planning, structuring and executing hackathon, content creation and the analysis of hackathon outcomes. I would like to remind the proposer team that the main hackathon event is for developers not for organizers. To allocate the majority of budget towards the organizers raise questions on the budget transparency. Also the proposer team doesn't mention how many number of hour his team member will be spending on this project. The pay rate has not been included. The team member name has not been mentioned along with their profile not included. It is difficult to determine if this proposal is likely to be implemented successfully.", "q1r": 3, "q2": "The success for this project is that the hackathon will make participants appreciating the ecosystem and inspired to launch startup and participate in Cardano-funded incubators and accelerators. They aim 1500 registration by the start of hackathon, 50 high quality projects submitted in the first round (project showcase in a public repository on GitHub, and presentation high quality project on a demo day). The layout plan is all good with the audit being possible at the selected projects showcase. However, the audit for the organizing team itself is not provided. The team could have supplied their original website, their social media profile  (twitter & discord) and most importantly the team member names to make this project possible to be audited by the community. Upon providing this important information, the community can learn who is behind this project and also recognize the effort of their team organizing the event. It would give chance to the community to track progress and to see whether the project could be completed successfully.", "q2r": 3, "assessor": "z_assessor_2695", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "AngelHack is the company organizing this hackathon, and we tap into our continuously growing pool of developers - we are now 290k+ as of writing this feedback, an increase of 30k developers since the last time we submitted this proposal. Indeed we tap into the email list to engage developers from different demographics and regions. \n\nWe thank the PA for the reminder, but we’d also like to share that while the dollar value seems to be only 40k to the developers, there is a multiplier effect for a successful run of a hackathon that introduces high quality project into an ecosystem, i.e. we have to take the long-term view whenever utilizing ecosystem grants. \n\nThank you for your concern regarding the lack of details regarding the team. \n\nTo be honest, we are just a group of ordinary but motivated individuals doing extraordinary things. It’s through the power of teamwork that we are able to achieve these things. The leadership changed recently, and as such he’s not as well known (thank you for clicking in). \n\nHere are a few members (AngelHack is a partner under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Justin Ng: https://www.linkedin.com/in/justinngbr/\n\nThank you so much for your concerns, and we look forward to impressing you with our good work!"}, {"id": 5969, "q0": "Idea to ogranize the hackathon to attract more developers to Cardano system is great. Similar hackathon are orgnized by many big companies such Microsoft, Amazon to attract more users to use their service. Hackathon not only encourage developers to learn and develop their apps in Cardano, it also enrich the Cardano ecosystem by its output. We can also hope to see more inovative ideas proposed in a hackathon", "q0r": 5, "q1": "Based on the team experience presented in the proposal (11 years of organizing hackalon), they should be able to organize a successful hackathon. However, the evidence provided by proposers are not sufficient and verificable. Proposer profile only shows 4 years of experience in organizing events. There are no detailed and verifiable information on the profile of other members (Program Manager, Marketing Manager, etc) and only role definition is stated. The hackalon is divided in 3 phases: pre-hackathon, hackathon commencement  and post hackathon with only general information, not many details.  ", "q1r": 3, "q2": "The team should add more details to improve proposal's auditability. The team asked for $130,000 to organize the hackathon but there is no cost break down in details which make it hard to audit. For example, the proposer asked for $40K for prize but there is no prize structure provided. Their target is attracting 1500 participants with top50 will be qualified for final judgement but there are no concrete criteria proposed to judge the candidates output. The demo day is nice to have so that everyone can evaluate the quality of the apps.", "q2r": 3, "assessor": "z_assessor_2764", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Thank you for your concern regarding the lack of details regarding the team. \n\nTo be honest, we are just a group of ordinary but motivated individuals doing extraordinary things. It’s through the power of teamwork that we are able to achieve these things. The leadership changed recently, and as such he’s not as well known (thank you for clicking in). \n\nHere are a few members (AngelHack is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Justin Ng: https://www.linkedin.com/in/justinngbr/\n\nWe understand your concern regarding the breakdown of the prize money and concrete criteria. With regards to the prize money, we typically split it in multiples of $5k, i.e. first prize gets $15k, second prize gets $10k, third place $5k, and we have a few other prizes such as best business model ($5k) and people’s choice award by voting ($5k). The reason why we award in these numbers because in our experience, $5k is both sufficiently motivating for participants and it’s a good amount for follow up activities should the teams pursue their ideas further. \n\nThank you so much for your concerns, and we look forward to impressing you with our good work!"}, {"id": 8699, "q0": "The idea of ​​this proposal is to organize a Cardano Hackathon to inspire developers to work and focus their efforts on contributing to Cardano, an online form of organization that will open up many opportunities for developers come from all over to participate. With 11 years of experience organizing hackathons and having a strong connection with developers around the world, I believe that their project will receive the active participation of the target audience and achieve the success that brings Cardano as promised. Overall, this proposal is sure to effectively implement the key metrics set by this Challenge.", "q0r": 5, "q1": "The project development plan is divided into 3 sub-phases before, during, and after the competition, each of which the proponent lists the main tasks to be done and the timeline to complete it. However, the proponent also needs to clearly define the time for the project launch. In the presentation on how to spend the budget, the amount allocated for the contest prize category has been clarified with necessary information such as awarding criteria, how to distribute to winners and reward disbursement time. In addition, the amount of money allocated for the items of work to be performed is also described in detail about the number of personnel for each task and the working time. Overall, this project's budget sheet is ideal for future audits. Despite the descriptions of many years of experience in organizing Hackathons and the strong support resources of the team working on this project, information on the main members leading this project by working positions is listed should also be clarified including their identity, relevant work experience and qualifications.", "q1r": 4, "q2": "The success goals of this project are clearly established, based on the project's inputs and outputs, and they are ideal for measuring success. Those interested in the project can also track its progress and performance reports through the GitHub repository link provided by the proponent. Overall, the auditability and success of this project are clear.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "To be honest, we are just a group of ordinary but motivated individuals doing extraordinary things. It’s through the power of teamwork that we are able to achieve these things. The leadership changed recently, and as such he’s not as well known (thank you for clicking in). \n\nHere are a few members (AngelHack is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Justin Ng: https://www.linkedin.com/in/justinngbr/\n\nHope this answers your concern regarding the team - we hope to impress you further with our action and make the Cardano virtual hackathon an immensely successful one! "}, {"id": 8895, "q0": "As there is very less number of developers contributing to cardano society from asian markets , hence setting up a hackthon where most of developers across the globe and Asia can participate and try to convert their idea into successful project is definitely a great idea.\nAs there are lot of developers just in India , China ,Japan most of them hesitate to learn haskell or other programming language, hence by developing such hackthon many people will get interested in learning these programming languages and can make cardano society more stronger with more members, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented plan doesn't involve any risk at all where setting up a hackthon is not a difficult task ,since setting up of hackthon has been done by students from college level itself and the proposer's team has run more than 10,000 hackathon projects till date which is definitely a huge number.\nThe proposer's team have set up a prize pool of 40,000 thousand dollars which is definitely a huge money, which will tend to across most of the people around the globe, and it will make even experienced developers also participate in such hackthon's hence with minimum risk involved and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly explained on how their how hackthon can make cardano society much bigger and stronger in the future, the proposal has even displayed how their team is recognized around the world for building hackthons. The presented plan even contains on how during phase 1 , the team wants to market their plan of hackathon to reach the maximum people ,so that most of them can participate in it.\nThe presented plan contains well structured timeline of the project in a phase wise deal, the presented plan has even well structured timeline to complete the project , with decent key indicators involved, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "We thank you for the kind words, and appreciate you for taking the time to assess our proposal! "}, {"id": 9622, "q0": "This proposal addresses the goals set forth in the challenge. Holding a virtual hackathon with valuable rewards will make developers more motivated to learn, access, and participate in the Cardano ecosystem. Thereby increasing developer adoption as well as creativity. This proposal clearly states the value it brings to the Cardano community as it brings new developers to Cardano and the promising projects generated from the hackathon that could become startups in the future.\n\nWith the goal of increasing the number of developers on Cardano, and promoting the Cardano ecosystem to help more developers know about Cardano, this project completely aligns with the outlined challenge setting.", "q0r": 5, "q1": "The team comes from AngelHack, an organization with 11 years of experience in organizing offline and virtual hackathons, including blockchain-related ones. I believe they can hold a Hackathon for Cardano. With their years of experience, it is not surprising that the proposer already knows the number and type of members this project needs, which includes program manager, marketing manager, designer, partnership manager, and community manager.\n\nThe budget required by the project has not been broken down into identifiable items. The budget is now only divided among the main tasks. I encourage the proposer to make it more clear how they allocate the money, for example how many prizes are there for the hackathon prize pool and how much each prize corresponds to. Oher categories are necessary to specify too, for example, the amount of time each person spends on the project per week, what is the pay rate of each person. In addition, the author can also add 3rd party reference links about the pay rate of each position so that the voter can refer more.\n\nThe project's timetable in my opinion is realistic with 3 specific phases. The first phase lasted 12 weeks for program preparation and marketing for the hackathon. The second phase lasts 4 weeks to hold the hackathon. And the last one-week period is used to award the winning projects.\n\nThe proposal has pointed out 2 risks and they have solutions to minimize the risks, but there is one more risk that I think the proposer also needs to consider is that there is no mentor to determine the direction of the Hackathon. Because in the team currently there is no one Cardano expert to offer challenges, technical support, and grading for projects so the success of the hackathon relies heavily on having cooperation with experts and advisors from Cardano", "q1r": 3, "q2": "The project has given 2 KPIs to evaluate its success that is the number of people participating in the hackathon and the number of projects submitted. The projects will be showcased in a public repository on Github so the community can easily monitor and evaluate the quality of the hackathon. However, in terms of the number of people participating in the hackathon, the proposal does not provide a way for the community to measure that number. I recommend that the proposer can add public channels such as Youtube videos or Discord channels for delivering regular updates to the community for auditing that metric.\n\nThe proposal had a specific roadmap with milestones to be achieved such as 2 community events, an opening ceremony, a hackathon, and award distribution.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "We had to balance between brevity of the proposal, and going too deeply into giving specific numbers. The reason for that is because even though we have been running hackathons for so many years, there are always unforeseen roadblocks or overheads. As such, we have been cautious not to put overly specific numbers and focus on the big picture as each hackathon differs in terms of difficulty from a participant’s standpoint. On top of that, should there be a requirement from a protocol’s standpoint, the hackathon would sometimes be an opportunity for participants to dive deeper into the ecosystem before building. Appreciate your positive comment about the scheduling, and we’re confident we can pull this hackathon off competently! \n\nWith regards to post-hackathon events, we definitely would want to involve the Cardano community and showcase the projects on either a bulletin or during one of the town halls, or even a standalone demo day that we’ll invite the community to watch. We will work closely to understand what Cardano wishes to achieve post event and plan out post-hackathon outlook for participants accordingly.\n\nThank you for your feedback, and we look forward to wowing you with our hackathon! "}, {"id": 10787, "q0": "The final score at the end of a learning process is always a competition; it allows people to assess their thoughts and confirm their level. Based on the philosophy of attracting developers to learn about the ecosystem through hands-on development, this virtual Hackathon is the next step for a large number of prospective future projects. The proposal briefly presents the contest's purpose and highlights the close relationship between it and the challenge. Two anticipated risks will not appear to be a significant issue for your team when you already have a solid strategy.\n", "q0r": 5, "q1": "When thoroughly detailing the activities items and the execution periods for the three respective stages, the proposal shows a detailed plan that fits the requirements. The total budget also includes five expenses, as well as labor allocation and specific work descriptions. Your team has thoroughly prepared for each stage of operation, which will be a plus in the eyes of investors. However, you have a few flaws that keep me from granting you a 5 in this Feasibility section. First, AngelHack is definitely the proprietor of this virtual Hackathon in terms of organization, promotion, and prize distribution, but I don't see any line presenting about AngelHack. You just cite \"WE”’s experiences and a few sentences about AngelHack's CEO (I even don't know this person's name if I hadn't clicked on the Linkedin link supplied). Second, you must provide DETAILS about the team members, such as their names, roles, and experiences, so investors can see that your team comprises talented individuals. A few paragraphs outlining the tasks of each job are insufficient, and it is inappropriate to introduce members. Third, consider adding workload management after answering \"yes\" to the question about whether you or any team member are working on any other projects in this Fund9.\n", "q1r": 4, "q2": "The project orientation of your team and the key metrics you gave are sufficient for the community to visualize the project's success. I like how you quantify every success metric and make the data available on Github so everyone can track your project's growth. I applaud you for adding another good idea to the Cardano community and wish you all the success soon.", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your concern regarding the lack of details regarding the team. \n\nTo be honest, we are just a group of ordinary but motivated individuals doing extraordinary things. It’s through the power of teamwork that we are able to achieve these things. The leadership changed recently, and as such he’s not as well known (thank you for clicking in). \n\nHere are a few members (AngelHack is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Justin Ng: https://www.linkedin.com/in/justinngbr/\n\nWe look forward to doing amazing things with the Cardano community! "}, {"id": 10897, "q0": "This proposal will nurture the developer community on Cardano, as part of that nurturing making more aware of and able to engage with tools that are relevant to Cardano ecosystem. This would be through a virtual hackathon. These hackathons have proven an effective means of engaging developers across a range of disciplines and technologies since you can all meet virtually and in real time, making the connect easy and the likelihood of building at least something high.\n\nThe virtual hackathon concept effectively spreads the word about Cardano without any significant costs to participants or organizers. They have the competence to give structure, guidance and support throughout this event (mentors). And judging from their website, they have hosted plenty of hackathons before so I assume they know what needs to be done to ensure a professional yet casual and fun environment for the participants.", "q0r": 5, "q1": "A full and submitted rigorous plan would have led to an up-rating. The proposers outline their plans as three phases: pre-hackathon, during hackathon and post-hackathon, but do not tie back their qualified resources to these phases. A simply running timeline that links stages of a project are required in order for voters to gauge the feasibility of a proposal, reaching far beyond nebulous statements. \n\nGiven the extensive experience of the team in organizing these sort of events,  it is likely that they will be successful in carrying out this proposal. It would have been nice to see some specifics here regarding who will be working on each segment of the project.\n\nThe total budget of the project is 135,000$. This amount can be considered fair for what is intended to be done given that $40,000 will be distributed in prizes. In addition to that, we also have a detailed description of what would be done with this money.\n\n", "q1r": 3, "q2": "Possible KPIs are stated, but not hard metrics such as number of registrations prior to or after the event or number of funded teams. For example: In order to provide an outstanding first hackathon event experience it is required that X more pre-event registrations occur during this funding period. Otherwise...\n\nThe goals themselves are not complete: in addition to number of participants, specifications such as quality (how will it be measured?) In addition, it would be important that we also had data related to how these people became familiar with Cardano's technologies and what they intend to work after attending this event. \n\nI think its great that Cardano needs more high quality projects coming out of hackathons, incubators and accelerators, and I expect that there will be far more benefits for participants than just a demo day. It would be wonderful if measures could include tracking launching of projects post hackathon or even interactions among new founders post event. Regardless of what track participants take, we can always measure how well events introduce novices (and beyond) to Cardano.", "q2r": 3, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "While pre-event registrations are good numbers to have, we are more concerned about attracting quality developers who can stick it through till the end of the hackathon, i.e. the number of projects that come out are more crucial for us to achieve. \n\nWith regards to post-hackathon events, we definitely would want to involve the Cardano community and showcase the projects on either a bulletin or during one of the town halls, or even a standalone demo day that we’ll invite the community to watch. \n\nAppreciate that you are aligned with our vision, and we hope to do our best to meet your expectations! "}, {"id": 14559, "q0": "The team has 10+ years of organizing hackathons - physically and virtually – globally, and they have so far 260,000+ developers in 164 cities around the globe in their ecosystem. If the hackathon is promoted in this strong community to address real-world pain points, I think they can reach a really large audience taking interest in the field. This helps bring together high-skilled developers to build high-quality products in the Cardano system in a highly-motivated learning environment. So, the project description is sensible and I do believe the proposal will bring value to the Cardano ecosystem. In addition, the team forecast two risks to cope with, and they have worked out suitable solutions to solve them. One area of improvement here could be to include some key metrics to clearly explain the impact of the proposal.", "q0r": 5, "q1": "The team offers a clear roadmap to organize this virtual hackathon successfully. The project timeline is appropriate and I believe it covers necessary tasks to be done to complete its goals. The requested budget is broken down into 5 clearly-explained components. Regarding the team members, only the Head of Angelhack is provided with a link for information verification. Other positions (program manager, marketing manager, designer, partnership manager and community manager) could be given more details. I wonder if these positions have been confirmed yet because there are no names provided here. This part looks like a list of positions and requirements for each. I guess that will make it difficult to confirm the team’s competence to conduct the proposal.", "q1r": 4, "q2": "The poposer presents very specific expected results to measure the progress and development. This helps the community audit the project conveniently. Unfortunately, the specific KPIs are not continued in the description of the project success. Criteria like the hackathon participants inr hackathon will “appreciate the Cardano ecosystem better”, be “inspired to launch startups based on products built on Cardano” or “feel inspired and confident enough to participate in a Cardano-funded incubators and/or accelerators” are hard to measure. I suppose their appreciation, inspiration and confidence may be shown in something specific, for instance, the number of products they build in the Cardano ecosystem, the startups they create, and the rate of hackathon participants taking part in Cardano-funded incubators and/or accelerators to better ensure the auditability of the project.", "q2r": 4, "assessor": "z_assessor_4072", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for your concern regarding the lack of details regarding the team. \n\nTo be honest, we are just a group of ordinary but motivated individuals doing extraordinary things. It’s through the power of teamwork that we are able to achieve these things. The leadership changed recently, and as such he’s not as well known (thank you for clicking in). \n\nHere are a few members (AngelHack is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Justin Ng: https://www.linkedin.com/in/justinngbr/\n\nWe agree with you that the outcomes could have been better articulated, but ultimately the important metric is the number of projects that come out of the hackathon - thank you for this point.\n\nWe appreciate you for taking the time to look through our proposal! "}], "solution": "A virtual hackathon to inspire builders. Hackathons bring new and existing developers across the world together, building on Cardano and introducing a flow of high-yield projects into the ecosystem.", "experience": "We have 11 years of organizing hackathons - physically and virtually - globally. Currently, we have 260,000+ developers in 164 cities around the globe in our ecosystem. We have been trusted by companies of varying industries to run more than 10,000 hackathon projects till date."}