{"id": 419400, "author": "rootsid", "title": "RootsId Verifiable Credential", "url": "https://cardano.ideascale.com/a/dtd/419400-48088", "category": 26597, "amount": 18000, "description": "Verifiable Credentials are a key component for interoperability across Self Sovereign Identity systems, within Cardano and abroad. However, ATALA Prism does not define any specific VC format.", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 719, "q0": "Yes, the proposers identified a problem of a lack of an established data model for Verifiable Credential on Cardano and proposed to do research and design a consistent data model that other developers could adopt in the ecosystem. The prospers articulate that an agreed model will improve interoperability between applications on Cardano and create a better development experience by making acceptable standards available. The proposers identified the data model as defined by W3C, which will be their starting point. The proposal scales well as the conclusions from the research will be implemented in the RootWallet which was delivered by the same team thanks to funding from previous rounds. A wallet with a standardized format for certificates running on a mobile device would be very useful for my proposal, and if the team delivers, I will be one of the users.", "q0r": 5, "q1": "The proposer provides evidence of who will deliver the proposal: Rodolfo Miranda has more than 25 years of experience that can be verified on LinkedIn, where he shares connections with other Cardano community members. The proposer identifies the people working on the deliverable, provides an excel sheet with allocated time to this proposal, and demonstrates how time clashes will be avoided with other projects they are pithing for in Fund9. This is a compelling type of disclosure that gives comfort that the proposer has thought about how to avoid delays. The budget is $18k and covers Research, Community engagement, documentation, implementation, and Testing. The hourly rate is $100, which is on the high end compared to an average of around $70/h from the other two dozen of proposals I assessed so far. The size of the budget aside is reasonable, where $12k will pay for implementation in the RootsWallet. The implementation time of 3 months is reasonable, and care is taken to avoid clashing with other proposals through time planning in excel. The plan is thought through carefully with a list of potential implementations and which of those support ZeroKnowledge poofs. The proposer received collaboration invitations in the comments and has entertained the ideas discussed in the comments. The technical detail are discussed and the proposer is also the creator of the RootWallet to which the implementation will be made. The main risk highlighted is the need to make design decisions upfront, which later on might be deemed suboptimal; the proposer aims to mitigate this through deep research, contact with the Cardano community, contact experts, and avoid unnecessary constraints and keep options open. The mitigating actions seem reasonable in the context of designing a new standard that might be used by many. The proposer has laid out a thoughtful plan and ideas on what direction the research could take. I think the proposer should be able to implement what he set out in the proposal.", "q1r": 5, "q2": "Yes, the roadmap is detailed and broken down into weeks. What will be achieve in each sectionis described and elaborated on how the proposer would proceed. The rearch part will deliver documentation on literature, documentation on decision and video recordings of meeting held. The development part will deliver open source code of RootsWallet on public Github repo and documentation. The intermediate progress will be reported as % of the task complete which serve as KPIs. Definition of success is well articulated their selection of the data model and imeplentatio is accepted and used by the community. The channel for communicatio will be Github, recorded video and the proposer leaves enough contact detail throughout (e.g. linkedin) though which anyone can get in touch. I an confident that there is an objective deliverable that can be audited to a high standard.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3548, "q0": "The proposal will research and select a set of verifiable credentials and will document a way for them to be interopable worldwide. This is a great idea and is headed towards expansion. The moment you start talking about world wide adoption and usability, you know you're headed in the right direction, because this rightfuly should be a solution for everyone to be able to enjoy. \nI really like this idea and it will unlock many possibilities li credentials valid everywhere and accessible from everywhere. This is definetly the right challenge and most of the challenge settings are covered and in alignment with this proposal. I have no doubt about the impact, but the implementation will be difficult. As a developer I can say that making a worldwide product is no joke. It will be a combination of verifiable credentials keeping to a certain starndard/s that are signed using cryptography.\nI find it very telling that I heard about the idea of selective disclosure being discussed not 6 months ago in an afer town hall breakout room and now I see a proposal implementing this idea into practice along with things I haven't even heard off like the way to show that your back account holds money in an amount greater than X without actually revealing the the query issuer the actual ballance.\nThe proposers have thought about the risks comming their way and I do agree that the largest challegne they would have is thinking of how would they get maximum adoption, because in an open source project, that's always one of the most important things to cover. Overall this is a great proposal with an amazing worldwide impact and that's not something you can say every day.", "q0r": 5, "q1": "The project has specified quite a definite timeline in weeks that's quite short for the undertaking, but that's not to say it can't be done in that time. As a developer I'd say they'd better have a 10% buffer wich they might already planned for. I always do appreciate when there's a special time for research, and it's very underestimated how much time it could save a project. I do like the feedback loop as well, because that is the basis of agile development (getting often feedback from the users).The fact that it's open source makes sence and since it's a worldwide project, it's fitting that it could get worldwide support and contributors.\nThe budget breakdown is standard, but the hourly rate is a bit steep. It's a 100 $/hr when the normal range I've seen is betwen 50-80 $/hr. This ballances out with the fact the whole budget is 18k which is not that much compared the the 1 milion per this challenge, making this still worth it considering it's such a great project.\nIt's clear the developer working on this project is more than capable of doing the work necessary, and when I think about how many people will be using this functionality and how sensitive the information would be it makes sense in overpaying as opposed to underpaying so I'm on board with the budget, considering.\nThe team has many projects already done and in development, so that brings greater credibility and certainty to the expected result. I do like the opennes about all proposals and the organization of time between the team members on each project so it's managed well.\nThe technical details are defined well enough and this project is certainly feasible. I would recommend voting for it, because it doesn't matter if you're in africa or latin america, because you'll be able to use their wallet and an SSI.", "q1r": 5, "q2": "I love the fact there's a github repository where I and anyone interested would be able to check on the progress. The documentation and video recordings are a big bonus on top of that and I really think more proposers should think about doing videos explaining their proposals and ideas. It's not much effort but it has a big impact on getting out there and being showing results in the form of demos.\nThe problem statement is well defined and the solution brings all the puzzle pieces to the table and the only thing to do is match them by doing integrations as this project plans on doing. I do like the definition of success and agree that the more people are on board the better. \nOverall an auditable solution no doubt with plenty of resources to learn from and follow the progress.", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4925, "q0": "Enhancing the self-sovereign identity aspect of Cardano is a key element for the developer ecosystem, as positioning Cardano as a key player in this sphere will attract major developer interest and further the community´s enlargement, both on the developer and member onboarding due to the new improvements and developments. In this regard, as the proposer indicates, Verifiable Credentials are a key component for interoperability across Self Sovereign Identity systems, and being able to define the most adequate VC formats for ATALA Prism will help grow the developer ecosystem.", "q0r": 5, "q1": "Rodrigo´s education, prior experience and multiple roles in the Catalyst community (funded proposer, CA and vCA, part of the Challenge Teams for Fund 7 challenge \"Grow Latinamerica, Grow Cardano\" and Fund 8 challenge “Self-Sovereign Identity”, part of the first cohort of the Atala Prism Pioneer Program, and co-creator of the LATAM Cardano Community and weekly LATAM TownHall) are an inspiration mainly to the Latin American Catalyst and Cardano members who have had the luck and benefit of associating with him. His specialization in SSI and the work he has done for Cardano in this field will only continue to grow and provide other projects will more inputs that can aid in developing our suite of products. Aside from a well-thought timeline and budget that draws on RootsID´s previous work, the fact that the final implementations can be tested directly on RootsID´s own RootsWallet shows that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal is divided into research and development, and as such can be tracked by different indicators. Research will be tracked by its deliverables in the form of documentation on literature, on decision and video recordings of meetings held, while development will deliver an Open Source code of RootsWallet on public Github repo and corresponding documentation as proof of completion. Coupled with the adoption of Agile methodology based on the tools provided by github, and that besides progress reports, the advancement will be tracked by public github issues, project views (like Kanban board) and commits, with intermediate progress reported as Sprint Burndown, the proposed KPIs are deemed more thah adequate for progress and success auditing. We also concurr with the proposer´s broader vision of success, insofar as the selection that they make is potentially acknowledged by all members of the SSI community in Cardano, and as a consequence is adopted by all current and future projects, building an interoperable ecosystem where many projects and developers are attracted to join and build on Cardano their Identity solutions or features.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9813, "q0": "The proposing team identified a problem with the current situation around the implementation of VC in Atala Prism. It seems Atala Prism doesn’t define a clear format of how credentials should be issued and leaves that decision to the developers. The team will research different flavors of verifiable credentials to try to find a common standard in cooperation with other teams building on Atala Prism. Having already looked into Prism, I have a rough understanding of the problem and can attest, that this seems very useful and would help further adoption.\nIn general, one should be very critical if one party tries to set standards for a whole ecosystem. But the proposers address this concern in multiple ways: first by collaboration with different players in the ecosystem, but also by getting outside opinion. Additionally, they attempt to “avoid unnecessary constraints” and will work towards a solution which is a “good fit for more projects”.\n", "q0r": 5, "q1": "The proposing team has obvious experience in the field, with multiple projects already delivered. The concrete research and implementation will come from a single person of that team, which seems to have a clear understand of the topic.\nThe timeline is defined with 3 months, which seems reasonable. The budget is based on a rate of 100 USD/h and which would result in 180h of work of the specified member. This is not much, but seems realistic regarding the workload. The overall plan describes all the necessary steps and leaves no questions open.\n", "q1r": 5, "q2": "The deliverables include documentation on the research process, documentation of the decision and recordings of the meetings. It also includes the source code for the integration of the defined standards into the wallet. All information should be viewable on GitHub (including issues, commits, and a Kanban board). This being an open-source project and the team already seems to have a long history of successful delivered project, I have high confidence in the success of the project and that it will reach it defined goal.", "q2r": 5, "assessor": "z_assessor_3105", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10900, "q0": "The project will research, define and implement standardized ways to use Verifiable Credentials within the ATALA Prism ecosystem. This will promote interoperability and attract new developers and projects to Cardano. By adding support for Verifiable Credentials to Atala Prism, this poropose will enable a standardized way to express and exchange digital credentials that are cryptographically secure, tamper-evident, privacy-respecting, and machine-verifiable. This will create an ecosystem with interoperable credentials.\n\nThis fits perfectly with the campaign guidelines.", "q0r": 5, "q1": "The team has extensive experience working on Cardano open source projects. Their work can be verified on github. Rodolfo Miranda, an active member of the cardano community who has been part of previous funds, will be working on this project. It is also possible to check his experience in a link on linkedin.\n\nThe project development plan will have a duration of 3 months. This plan is well detailed with well defined milestones.\n\nThe total budget of the project is $18,000. The budget is broken down into hours of work for each development process with an hourly rate of $100. I miss some mention of what happens if the development process takes longer.", "q1r": 5, "q2": "This proposal provides sufficient information to assess the progress in attaining its stated goals. Since the project is based on a research part and an implementation part, the metrics are divided according to these.\n\nOn the research side, it is proposed to submit documentation on literature, documentation on decision, video recordings of meeting held.\n\nOn the development side, The team commits to a github repository that will act as a means of tracking development and documentation activities, which are themselves being tracked by Github issues and project views.", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "RootsID will research and select one or several flavors of Verifiable Credentials, and will document and implement how they should be used in the ecosystem for worldwide interoperability.", "experience": "RootsID is a group of expert developers that are contributing with many Open Source building blocks to the Self-Sovereign Identity ecosystem in Cardano, such as RootsWallet, WAL-CLI, and sidetree-cardano. Check our full work on Github, and more details on the Teams section below."}