{"id": 419863, "author": "fimi.vn", "title": "CatalystTalk: Grow Vietnamese Devs", "url": "https://cardano.ideascale.com/a/dtd/419863-48088", "category": 26597, "amount": 15000, "description": "Vietnam has a team of potential developers and lots of ideas. However, many ideas remain unrealized due to a lack of funds to implement and a lack of accessibility and understanding of Catalyst.", "f6_no_assessments": 13, "f6_rating": 4.487179487179486, "videos": [], "media": [], "f6_assessments": [{"id": 2867, "q0": "According to the facts provided in the proposal, it is still actually the truth that many Vietnamese developers encounter several challenges and are prevented from putting forward beneficial ideas for the community due to a lack of investment funds and comprehension of the advantages of Catalyst. As a result, I firmly feel that this project has the ability to offer the most practical and effective solution to this issue by setting up Catalyst information workshops to educate the Vietnamese community about this new idea. Additionally, this also raises awareness of the enormous future possibilities that Cardano and Catalyst offer to Vietnam developers. In all honesty, this is a highly fruitful notion because keeping up with reputable news and sharing it with other developers would enable them to prevent interruptions from various pieces of information and take in a variety of points of view from other exciting perspectives. Therefore, by choosing to keep developing their work based on the Cardano platform, they are going to do the right things. A detailed example that outlines the exchange is a link to a video posted on the Youtube channel by the project owner (https://youtu.be/rBsQqdLwjes). Along with discussing the main issue, this proposal also addresses a secondary issue that has recently come up in the community: Vietnamese developers may have the idea, but they lack the writing abilities necessary to craft a detailed and logical proposal. However, the article identifies how to tackle this problem by assembling a group of people who are willing to create ideas for developers. Thus, I can conclude from the foregoing that this idea has a great potential for future expansion to reach the community's expanding demands and that it also addresses some of the problems raised by the challenge in the recommendation area. First of all, the concept of presenting difficult information regarding the Cardano technological platform as a mind map will undoubtedly aid in the understanding of many individuals, and as a result of the mass effect, it is almost certain that this information will grow in popularity. Second, the more people get interested, the more projects based on the Cardano ecosystem are developed, which makes the ecosystem more diverse than before and contributes to the development of many original but extremely practical ideas from Vietnamese developers. This will in some way increase the rate of ADA trading, from which a large number of smart contracts with cutting-edge features can be produced to meet the needs of the worldwide working community. Because of the factors mentioned, I believe this proposal is deserving of the highest possible rating for its favorable effects on the Cardano ecosystem in general and the Vietnamese development community in particular. Whether or if the sessions are free is another query I posed to the project's founding team.", "q0r": 5, "q1": "It is also essential to note that in the time section of this proposal, the owner has given a detailed roadmap referring to the content that takes place in each specific timeline. In addition, each timeline will be set with different goals, such as: organizing 6 catalyst talks with the participation of project owners, successful developers, and Core teams in 2 separate locations (Ha Noi capital city and Ho Chi Minh City) in the first 3 months right after receiving funding. Additionally, the major objectives are indicated by specific statistics that can facilitate check-in, such as the number of live meetings or via Zoom, and the number of proposals filed in the ensuing periods connected to this project. However, it appears to be fairly difficult to monitor the proposal's development because I have not come across any information or a link to it anywhere in the proposal. In order to update the project's progress measurements, I advise the founders to create a separate file and post it to the project's open chat channels on Discord, Zalo, Telegram, LinkedIn, Facebook, and possibly YouTube. I confidently came to the conclusion that the proposal presented a reasonably sound financial plan when it included incentives for enthusiastic contributors, and those on a team dedicated to responding to all of the community's questions when I got to the section on the total amount of funds to be financed and how they would be used. However, my concern is with the $4800 presenter incentive spending (200 dollars per week), what are the standards for choosing a presenter? What precise employment must this person have in order to make this wage? I think the proposed topic will utilize the budget as effectively as feasible through the genuine expenditure items on the capital need list, even though there are still some parts that need as much in-depth explanation as the proposal owner is able to offer. Based on the information provided for the project, I am able to identify two key participants right away. They have a wide range of professional expertise relevant to technology majors and years of experience in research and development on the Cardano platform. Hence, they will do a wonderful job of providing instruction and important life lessons to the Vietnamese developer community. Besides that, through the given Zalo link, I can verify the identity of these two members: Mr Do Manh Hung (https://t.me/Hung_DoManh) and his partner, Mr Do Viet Cuong (https://t.me/dovietcuong). My suggestion to the project owner is to provide more identities of the successful developers and some members of the Core teams who will participate in the sharing session as mentioned above for added authenticity and credibility for the project. From the above conclusions, although there are still some parts of the plan that need to be improved, I still appreciate the feasibility of the proposal to solve the problems presented by the challenge.", "q1r": 4, "q2": "The project owner, on the other hand, has provided specific indicators for easy checking in relation to how to assess the development and success of the proposal, such as the total number of meetings (in person and via Zoom), the number of new developers who signed up to participate in the talk, the number of funded ideas related to this project, etc. However, I realize there is not any related information in the proposal yet about where and how these metrics will be checked. Therefore, I suggest that the proponent should have a file dedicated to statistics of these figures during the project period and post them on public forums of the community, such as Telegram, Twitter, etc. so that everyone can evaluate the progress of the project in the most convenient way. I note, though, that the proposal does not currently contain any relevant details on where and how these metrics will be examined. So, in order for everyone to assess the development of the project in the most practical way, I recommend that the proponent should keep a file specifically devoted to statistics of this data during the project and broadcast them on open community forums (for example, Telegram, Twitter, and Discord). The project's success is demonstrated by the fact that the quality of the Vietnamese developer community is continuously improving. Additionally, there will be a rise in the number of initiatives aimed at raising people's quality of life, which will contribute to the development of the Cardano ecosystem's prosperity and popularity in Asia and Vietnam as well as its future sustainability. Based on the positive things that the proposal brings not only to Vietnamese developers, I believe that the success of the proposal is entirely related to the problems that the challenge has presented. Moreover, with a new proposal with an impressive test product (https://www.youtube.com/watch?v=rBsQqdLwjes), I fully support that this idea will be funded and widely available to potential developers in Vietnam. Therefore, putting aside the minor flaws, I give this concept a rating of 4 stars for its clarity.\n", "q2r": 4, "assessor": "z_assessor_2354", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4395, "q0": "The proposal to solve the goal in the Challenge is the Developer Ecosystem. The team that raised the issue here was to hold Catalyst talks for developers in Vietnam that included the proponents and Coreteams. I see this proposal directly adding value to the Cardano ecosystem, specifically the developer ecosystem. Over time, the proposal can scale up if the team wants to grow to reach the continent and solve future challenges. I hope more and more people know about Catalyst, then there will be more new ideas (after being guided by Fimi about knowledge and answering questions). These ideas can then become proposals in Funds and if implemented into practice will have a direct contribution to increasing the Cardano ecosystem. We can see the deep potential through proposals like this of Fimi, I see this as a premise for continuing to build community, strengthening the position of the Cardano blockchain ecosystem in Vietnam. Therefore, I am very much looking forward to this proposal, the participants of the talk will improve their knowledge about Cardano's on-chain governance, the role of ADA holders, and the ways to evaluate projects & proposals. , consulted to develop proposals for Catalyst, etc... If this proposal is funded, it will be a very good condition for the Vietnamese community to know more about Catalyst funds, news, Catalyst documentation, funding rounds, etc… I agree with the impact of this proposal because of the great benefits it brings to the Catalyst community in particular and the Vietnam Cardano community in general. I rate it 5 stars.", "q0r": 5, "q1": "No one in the Cardano blockchain community in Vietnam does not know about Fimi, at Fund 7 - Fimi has experience in participating and getting funding. Therefore, the construction of a knowledge and Q&A program on the topic of Catalyst is a great thing for Vietnamese people who are interested in Catalyst. Fimi is also one of the largest Cardano investor groups in Vietnam, with a member being a Group administrator of the largest Cardano community in Vietnam since 2018, software developer and developer, PA-vPA. of Catalyst, has been doing deep research and Cardano and the Cardano ecosystem. All these things have created a great reputation for Fimi in the Vietnamese community. The presentation of videos on, the Youtube channel Fimi about Catalyst has increased the prestige and trust of the community for the team and the feasibility of the proposal. Thereby, Fimi has gained almost absolute trust from the community (except for people who are completely new to Fimi). Fimi members all have extensive experience in their respective areas of expertise (Cardano blockchain research, Catalyst research, news gathering and aggregator, team leader and member of the translation team funded by Catalyst at Fund 7, media, etc…). My only suggestion is that the two key members of the proposal (Mr. Hung, and Mr. Cuong) should add a social network link to clarify the identity disclosure part. This significantly increases transparency and feasibility (taking full trust from the community). I fully believe in the feasibility of the proposal when applied in practice. The budget was divided by the requirements of the training process within 6 months, Fimi has been and continues to make Youtube videos - which is the daily work of the team. However, I have a question about the implementation budget: If Catalyst has not funded the team in Fund 9 to make the Catalyst video tutorial, will the team continue to work on the proposal? Is there any other source of funding to make this proposal as Fimi did in the pilot video? I hope to see the team continue to do the work because it is what it has always been and because the Vietnamese community is looking forward to it. The two main members of the team (Mr. Hung, and Mr. Cuong) have a hard work spirit throughout the day because they have a passion for Cardano. I wish I could be like that myself. The proposal has fully shown the plan, and implementation method (things to be done in the first 3 months, next 6 months, etc...) Human resources to implement the proposal seem adequate because of a team of strong and professional collaborators. I would like to ask if Fimi has enough manpower to implement this proposal as some members of the team are working on another proposal in Fund 9? Catalyst videos are rich in knowledge and not easy to understand, so what should Fimi do to make them attractive to people? I think the team can strengthen advertising communication even more so that the wider Cardano Vietnam community is more and more aware of Fimi's Catalyst video. To increase the fun of the videos, the team surveyed the Cardano Vietnam community fee and asked experts for advice on the best way to do it. Just now are my positive suggestions. I like the way the team outlines the risks they might face in the process - with a solution to prevent them. In short, this proposal is feasible and deserves my 5-star vote.", "q1r": 5, "q2": "I found that important milestones and roadmaps in the process of implementing the proposal were fully presented by the team. It would be much better if these important milestones and roadmaps were tied to specific months of the year. It is then very convenient for the community to monitor and evaluate the auditability & transparency of the proposal. It's a pity that I didn't get to see the KPIs. In return, the team presented what the definition of success looks like Quality in community development and member suggestions after participating in knowledge sessions and Q&A on related issues. regarding Catalyst. This proposal of Fimi is highly realistic, and completely doable (just financially qualified - ie funded by Catalyst). The problem was clearly described throughout, and easy to understand. This makes the proposal effective when applied in practice. This is a highly methodological proposal, the ideas are well organized and clear. After all, the proposal has demonstrated transparency and auditability, I strongly support the team that implemented this proposal. I hope Catalyst will approve funding in Fund 9 for Fimi to implement soon, meeting the expectations of the Cardano Vietnamese community. I completely agree with the suggestion. I vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5947, "q0": "The proposal is somewhat aligned with the challenge setting of Developer Ecosystems as it is mostly framed about the lack of funds and accessibility to the Catalyst. On the other hand, it is seen as a subjective opinion about the strengths of the Dev community in Vietnam with not much database supported instead of the proposer self-experience. The solution is another CatalystTalk (which the team also stated that they submitted 5 other proposals to this fund.) and it overlapped with another CatalystTalk proposal. There is a slight worry from the PA point of view about the confusion/overlapping in terms of audiences/stakeholders in these talks although it will be very positive to grow the community. There is a suggestion to identify two pools of audiences to make it more Dev focus on the challenge setting of Developer Ecosystems and the other Talk more public for the larger community. The final solution will draw to bring the Developers to engage in Catalyst and then can self-propose (in other words become the proposers/ dRep) for the upcoming funds. The team also thinking about a Hackathon maybe a better suggestion to make it more diverse in a hardcore technical Dev community.\nThe risks are what make this proposal very positive. The team already thinks about Devs joining the Talk but after that come back as the Dev roles (silently code in the back seats) therefore the team already self-position themself to help the Devs to write a proposal as the proposer position in the upcoming funds with the brilliant ideas from Devs. For the ADA slippage price risk, it is a careful thought with a deep understanding of the Catalyst mechanism and budget release.", "q0r": 4, "q1": "The team is lean with only 2 main trainers for this proposal thus making it a bit less feasible for the 12-month length project. The PA already joined the telegram channels and it is only now 56 members with the interactions of the Dev community are somewhat silent. Thus this makes the proposal would be a bit silo even if the end goal is to reach for 30 core Devs in the first 3 months and then 150 Devs in the next 6 months. It is suggested that the team should consider onboarding more marketing-based background members and activating activities to maintain the heat and conversation for the 12-month project.\nOn the other hand, what makes the proposal more positive is the milestones and the ambitions of the outputs. This is very fundamental for the next 12 months and the team will continue the effort with a far-sighted impact from Fund 9 to Fund 12, with the aim to have a total of 55 proposals submitted and the quality community of Vietnamese Devs up to 200 quality Devs and meeting frequently online. What should have been done better is more Offline meetings for the last 9 months of the proposal to meet and support the Devs in need in a more direct and conversational approach.\nThe budget is only 1.5%  of the total challenge setting Fund, which is absolutely well-thought for the 12-month timeline project delivery. There is a suggestion for making the budget more monthly phasing to help the team monitor budget/rewards delivery for the participants in a more specific manner. This should also easier for the Catalyst community to check and release the Fund on a monthly basis as the current budget release mechanism.", "q1r": 5, "q2": "What makes the proposal stands out is the SDG Sustainable Development Goals: Goal 4 and Goal 9 as the newly added Catalyst direction. The OKRs/KPI and Measurable KPIs are attached with numbers of Talks/participated Devs/PAs/ and a number of ideas. However, they should be improved further with quantifiable measurement. Especially, what success looks like should be more quantitative milestones as per linkage with the milestones plan in the FEASIBILITY part. It should be a more direct link OKRs focused on the Devs community: some example suggestions for the proposer to consider the Number of Devs registered/Numbers of NEW Devs joining each talk/Number of Devs proposing ideas/ Number of Devs using the service of proposal writing. It should also be stated where to track the progress of the proposal as per transparency for the community. Overall, this is a very helpful build for the Developer community so it is deserved the score after considering the builds form the PA.", "q2r": 5, "assessor": "z_assessor_2759", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6035, "q0": "The content of the proposal is quite simple but brings a lot of meaning to the development of the developer community. It is proposed to build talks about Catalyst, the participants are developers in Vietnam. The content of the talks is detailed in the proposal. The purpose is to help developers know how to present their ideas for submission to Catalyst, and to increase the likelihood of successful fundraising, impacting Catalyst as well as Cardano. It attracts more people outside the community to participate in Catalyst and also propagates Catalyst to a wider audience outside of developers such as voters.", "q0r": 5, "q1": "I appreciate how each piece of information in the proposal is presented to provide a basis for a feasibility assessment.\nFirst we have an implementation roadmap, I think the project is appropriate to implement within 6 months instead of some time shorter than this milestone. Because organizing a face-to-face meeting between developers with Coreteam requires a lot of logistics and setup behind the scenes. From choosing the location, negotiating the price with the lessor to the preparation of invitations, decoration of the meeting place. In addition, the geographical distance between the two areas of Hanoi and Saigon is quite far, making the implementation need to take a long time.\nSecond, the professional level of the proposer is high. Mr.Do Manh Hung is the host of Fimi's blockchain courses, as well as a programmer and pioneer Plutus Pioneer. Therefore he has enough experience to create exchanges with Vietnamese developers.\nThird, budget breakdown: very clear for each work item. But I don't know what $2500 for training for new coreteam includes and what is the cost to convert into units of measurement? Please suggest clarifying this aspect.", "q1r": 5, "q2": "I completely agree with the project's auditability. The proposal provides us with enough information to verify including: The main website of the Fimi proposal team, the commitments on KPIs that measure the success of the project through the quantity presented in the proposal . Success is attracting new developers, increasing the number of proposals submitted to Catalyst. However, I would like to add a small criterion to evaluate the quality of the content of the sharing session, through the number of questions asked during the sharing session.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8469, "q0": "I think it's a great idea for this project to organize talks about Catalyst for developers in Vietnam in order to provide them with the fundamental skills in creating proposals and turning them into realistic projects. This is a project that has my full support.\nDevelopers in Vietnam have a lot of talent and a lot of ideas for how to create new blockchain initiatives, but they lack competence in writing proposals. Therefore, if they are given the opportunity to participate in a catalyst speak and have a face-to-face interaction with skilled developers, it will undoubtedly provide them with a good headstart when it comes to writing and submitting applications for future financing.\nA side note that I would like to suggest is to list out more specific topics that will be discussed in the talk (since there will be around 20-30 talks in one-year project), so that we can better understand how the team will train the learners and the quality of the contents. ", "q0r": 5, "q1": "In order to successfully complete the one-year project, they have laid out a detailed plan that includes a number of important milestones. In terms of the members of the team, they have experience in educating and programming, both of which are relevant to the requirements of the project. The breakdown of the budget is also presented in clear detail and is appropriate.\nI believe that the plan should to contain extra information on the way of building a team of thirty developers, as well as how to attract new comers to join and learn from the seminars. I believe that the reliability of the plan will increase once additional information is provided.", "q1r": 4, "q2": "The metrics that were provided were in line with what had been talked about earlier on in the plan. In order to track the progression of this project and ensure its success, they are measurable and easy to understand. In my opinion, it would be to the benefit of the team if they could set goals for themselves that they are expected to achieve as a direct result of activities, like 50 attendance for online talks, 10 attendance for offline meeting,... \nI would also propose that the team saves as public documents any data that related to the activities of recruitment and meeting, since this would be helpful for the community to keep track of as well.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8702, "q0": "The core idea of ​​this proposal involves education to raise awareness about Cardano among developers. The proponent wishes to organize Catalyst talks for developers in Vietnam to open up a path for them to find career and investment opportunities on Cardano, thereby motivating them to contribute back to this blockchain. In my opinion, this idea is completely in line with the main indicators set by this Challenge, and the success will depend on the ability of the proponents to operate the project. Fortunately, I found a thorough preparation for their organization here including listing the main topics of the talks, designing a detailed and clear organizational roadmap, setting out commitment on the number of developers participating in the talkshow and the number of projects contributing to Cardano afterward. However, the proponent needs to explain more clearly how the ADA slippage will affect your project.", "q0r": 4, "q1": "The budget required is very vague, so there needs an estimate of the working time of the people implementing and supporting the project to be able to see if your work efforts are really appropriate to the level of the project costs are given. In addition, what is the basis on which the proponent can calculate and offer $2000 for ADA slippage hedging? And if it's time to implement the project, ADA price does not slide to the mark as the proponent predicted, how will this part of the cost be handled. The project development plan is easy for tracking project development progress, milestones - tasks - outputs are clearly established. The work experience of the project implementers shows that they have done previous teaching and promotion work about Cardano and Catalyst, so there is no doubt about the feasibility of this project.", "q1r": 3, "q2": "The audit roadmap has been designed ideally and in accordance with the working capacity of the proposed team, meeting the necessary elements for monitoring including performance evaluation indicators, targets set for each indicator, and the evaluation timelines. However, the proponent needs to be more descriptive about how you will report the results of your measurements to the community, as well as through which tools/addresses the community can track work progress.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9575, "q0": "\"Vietnamese people can grasp technology very well. However, most of them just apply technology, they have not developed technology. Technology development is mainly carried out by organizations. Individuals do not have this opportunity because there is no formal financial background to support them. Catalyst will untie this bottleneck, opening up huge opportunities for developers in Vietnam. However, developers can't just naturally know about Catalyst. You have suggested that it is very practical to organize Catalyst talks for Vietnamese developers. Help them know the great value of Catalyst, from which ideas are gradually realized on the Cardano platform to help the ecosystem grow.\"\n\"According to the described solution, your proposal is not only a talk but also a place to train Vietnamese programmers to become Cardano developers through the Catalyst program. This will be like a magnet attracting Vietnamese developers to Cardano and contributing their products to the ecosystem. Thereby, I evaluate the proposal to well solve the requirements of the challenge.\"\n\"You put the project at risk that the developers have the idea but don't write the proposal. It is an existential risk as developers are still unfamiliar with Blockchain technology. To manage risk you form a team to assist in writing proposals based on Developer Ideas. However, I hope these are only a few of the limited cases since the goal of your proposal is to train developers to write proposals.\"\n", "q0r": 5, "q1": "\"The detailed plan of the proposal describes the work to be done and the timelines for implementation. However, the timeline you are leaving is a bit longer, up to 3 months, making it difficult to monitor the project of the community. You should reduce the timeline to month by month and plan in detail along the way.\"\n\"The budget has been allocated to each job in the proposal. The training cost for the new core group has not been explained in detail, so I have no basis for monitoring. Please clarify this cost to make it easier for the community to follow. The remaining costs have other jobs that have been specifically explained by the labor cost in the area.\"\n\"The members of the project are people with extensive experience in the fields of finance, blockchain, and community management. Do Manh Hung is an influential person for the blockchain community in general and the Cardano community in particular. I believe he will be an inspiration for Vietnamese developers to participate in the development of a stronger and stronger Cardano ecosystem.\"\n", "q1r": 4, "q2": "“The metrics you propose are reasonable, they are important bases for the community to track your project progress. \"\n“Quantify the metrics you mentioned in the solution section. However, you should summarize them here so that the community can easily monitor and evaluate the success of the proposal.”\n", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9592, "q0": "\"The proposed problem is that Vietnam has many potential developers. However, many ideas have not been implemented due to lack of funds, inaccessibility, and lack of knowledge about catalysts.\nThe problem is consistent with the goal of catalyst in fund 9. The project helps to develop the community, building a community willing and able to contribute to the development of Cardano. The size of the region of a country is Vietnam.\nThe proposal is aimed at developers in Vietnam. People who have an idea but lack capital and lack a way to realize the concept.\nOffer to help create weekly Catalyst talks via the Zoom online meeting platform. Online meetings are a good way because Participants can join everyone anywhere as long as there is the internet, many people can participate at the same time, and the cost of organizing is cheap.\nI appreciate the suggestion and its problem-solving. So I give 5 points.\"", "q0r": 5, "q1": "\"The proposed solution is to organize catalyst-sharing sessions for developers in Vietnam. This solution helps to increase knowledge about catalysts as well as attract developers to catalyst. The timeline is Clear, Reasonable with Specific goals. The plan offers three durations: The first three months after being funded, The next six months, and the last three months. Each timeline has been tasked with detailed counts.\nThe team consists of 2 people. Mr. Do Manh Hung has experience in Finance, Community Management, Plutus Pioneer, Influencing and Inspiring Coaches, and Lead Instructor of Fimi's Course. And Mr. Do Viet Cuong with experience in Community Management, HighSchool Teacher, Video producer, Translator team leader. The team has a lot of relevant experience in implementing the proposal, but the Team has not assigned tasks to the members.\nThe project mentioned two risks. (1) The risk comes from the developers who do not proceed to write the proposal. (2) Risk of ADA slippage. The solution they came up with was to set up a support team to write proposals and Request a Contingency Budget for Slippage. Follow me. The second problem the group raised was no risk. When they receive funding, they can immediately convert to fiat for operations, avoiding price slippage. Unreasonable reserve budget requirements.\nBecause the team's tasks have not been clearly divided, the risk assessment is not appropriate. So I give 3 points.\"", "q1r": 3, "q2": "\"Claim cost $15000. Items amortize expenses for six months of operation. The calculated volume items clearly explain why the money was spent. Indicators of success are clearly stated, but there is no way to measure them. The proposal also doesn't provide KPIs.\nThe proposal clearly defines success but conducts testing. This proposal is just an idea that has not been implemented to assess the possibility of success. But in my opinion, with other projects they have done, the probability of success will be very high.\nThe proponent has previously received funds but is not related to this proposal.\nThe proposal results are verifiable through the community platforms where the project will post the talk shows. Checking the page through youtube can measure\n the number of talk shows held, the number of views, and the number of reviews, Vv.\nThe proposal has shortcomings in terms of KPIs and measures of success. However, that shortcoming is not too serious, so I give it 4 points.\"", "q2r": 4, "assessor": "z_assessor_3067", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10031, "q0": "The proposal offered the idea of conducting zoom talks on the topic of Catalyst, implementing the proposal was the participation of developers, Coreteams community Cardano and those with ideas about formulating proposals for Cardano. The idea is to be in line with the challenge, which has a great impact on the development of Devs in Vietnam. The solution given is appropriate, the developer's ideas are presented, from which there will be comments, instructions on techniques, methods of implementation. The talk created an atmosphere of exchange to learn knowledge about Blockchain, which has a great impact on the Cardano/Blockchain ecosystem. The solution to the challenge is to create a solid foundation for the Cardano ecosystem, increasing developers participating in Catalyst, projects will be more proposed to create products that best serve Cardano. We can clearly see the expansion of the proposal in the future with more and more developers involved. The difficulty when the developer does not write a proposal is the risk the author poses but there is no way to minimize this. I have an opinion on encouraging developers to recognize cardano's potential, the benefits of contributing to the Cardano ecosystem. The author needs guidance, helping them in developing the ideas that make them successful. I have contributed to the risks that could affect the success of the proposal: that attracting developers to participate may not be as satisfactory. Solution: The implementation of the talks should carefully prepare the content, topics and inform the developers so that they are ready to participate in the talks, collecting the knowledge that they are interested in.\nRating: 4\n", "q0r": 4, "q1": "We can see that the implementation plan of the proposal is very detailed, the timeline for specific tasks is given, the goal of implementation is in line with the set challenge. The number of participating developers was expected, the number of talks matched the time fund. Apprehensive that the developer's idea might be copied, the author has no plans to publish videos of the talk. I have an opinion on whether the video should be put on YouTube, the same idea but the different ways of doing it will make the best development. This is also an incentive for developers to write quality proposals that contribute to the Cardano ecosystem. The proposal provides the resources needed to successfully implement the plan, demonstrating the ability to implement the proposal when they are key members of Fimi. Members implementing the proposal have a clear assignment of work to implement the set plan. The budget table clearly spends reasonably, the amount made for a face-to-face meeting needs to be more detailed. How much is the rent on the location? What are the facilities? The proposal recommended a $2000 funding as a precaution against the risk of ADA slippage as appropriate.\nRating: 4\n", "q1r": 4, "q2": "The implementation roadmap has been given with the timelines of the results being in line with the audit work. The implementation stage of the proposal can be measured by the talks made, the number of participants, and the suggestions that can be submitted. Reasonable proposed indicators/KPIs can identify talks that are being conducted as planned. The author should have more monthly reports on the progress of the proposal. The success of the proposal is the number of developers involved in the Cardano ecosystem and contributing quality ideas and projects to the ecosystem, the proposal gives the right indicators for the audit, and we have identified the proposal that is being successfully implemented.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 10105, "q0": "This is a great proposal that I came across. The proposal aims to solve a very important problem: Vietnam has a very large team of developers and has a lot of knowledge and experience with many feasible and practical ideas, but they have limited understanding and approach of Catalyst, together with language barrier. Another difficulty is that even though they have an idea, they need to find others to incorporate or lack funds for initial research. \nThe proposal can completely solve the challenge of Developer Ecosystem in Fund 9 by introducing, training and supporting developers who can participate in Cardano and contribute more ideas, projects, applications used to make the Cardano Ecosystem grow more and more. The proposal also satisfies the objective in Fund9 which is to Prepare a group of people who are willing and able to contribute to the ecosystem, by satisfying both the goal and the challenge in this Fund 9, I believe that the project will bring added value to both Catalyst and the Caradano Ecosystem.\nIn addition, the KPIs are also completely consistent with the ones given by Challenge, by aiming to establish a developer team of 30 members and are expected to increase 5 more ideas at Fund 10 in first 3 months and formed a 150-member developer team with 20 proposals to be submitted at Fund 11 and 12 along with lots of videos and live and online talks.\nWith such impressive KPIs, I believe that the project can completely solve future challenges by preparing a group of people with knowledge and great potential to contribute to this ecosystem.", "q0r": 5, "q1": "The proposal is executed by two key members, Mr. Do Manh Hung and Do Viet Cuong, who have extensive experience in teaching, community management, video production, translation and especially inspiration, one of the very important criteria to decide the success of the project because this is an education related project, it needs enthusiastic, experienced and inspirational lecturers. However, I have not seen any related links or documents proving the experience of these 2 members (except Telegram), so the reliability will not be high, the proponent should provide more information about these two members as well as the projects they have done so that we are sure that they are qualified to implement and bring the project to success.\nAbout the proposed budget is 15,000 USD divided into 6 main categories. I see that the proposed budget is not too high, but the proponent has also listed in detail the expenses to be spent. However, I still recommend the proponent to set the budget according to a table in which the unit of price and frequency/time spent will bring transparency and reasonableness to this proposal.\nOverall, this proposal has a very high probability that it can achieve its goal if it is online meetings, in fact, I think the proponent can consider a lot more because it is also related to meetings. Directly it will take a lot of costs for the hall, organization costs...I don't know if the proponent has considered enough.\nThe proponent also presented very clearly, specifically, the implementation plan in the next 12 months is divided into 3 phases respectively the first 3 months, the next 6 months and the last 3 months with a reasonable and followable timeframe", "q1r": 4, "q2": "The proposal has provided a specific roadmap with 3 main stages and has specific numerical goals for each stage. The KPIs are clear and directly complement the definition of project success. I think these KPIs are completely achievable in stages. Training sessions and information will be published on the website so I believe we can track progress in a transparent way.", "q2r": 5, "assessor": "z_assessor_3153", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 11359, "q0": "The high-impact, solution-oriented proposal is to organize Catalyst talks for developers in Vietnam, with Core teams and proponents participating.\nExperience to make proposals:\nThe admin group of the largest Cardano Community in Vietnam since 2018. 11 years as a member. Veteran Proposal Reviewer. Software development. Deeply researched on the Cardano Blockchain and its generation system.\nThe proponent has provided websites, links, and youtube for readers to easily follow and check. \nThe proposed solution is\nHost a weekly Catalyst talk\nFormat: held online via Zoom\nCatalystTboards program topics include:\n\nCardano's On-chain Governance Mechanism\nThe Role of ADA Holders in the Cardano Ecosystem\nBenefits for Voter (ADA Holders and dReps)\nWhat does dRep means\nHow to be a dRep\nWhat is the value of a high impact proposal for the Cardano ecosystem and worldwild.\nHow if we vote for high quality proposals.\nWays to evaluate projects, proposals.\nHow to give Excellent advice.\nHow to build a high value project for the Cardano ecosystem.\nHow to get fund from Cardano treasury to run a business.\nTypical projects.\n\nI find this proposal appropriate and meets the requirements of the challenge, helping to attract Vietnamese developers to Catalyst.\nDevelopers will contribute their products to a diverse and sustainable development ecosystem.\nthe risks and risk reduction solutions proposed are completely reasonable.\nThe proposal has a very high probability of success.\n", "q0r": 5, "q1": "Proposing specific project implementation progress for each milestone\nFirst three months after funding:\n\nForm a team of developers (30 developers)\nHosted 6 Catalyst Talks featuring Developers, Coreateam, and Proposal Reviewers (PAs)\nOrganized 02 face-to-face meetings between developers and Coreteam, PA in Hanoi and Saigon\nThere are 05 Proposals submitted to the 10 . fund\n\nnext 12 months\n\nHost 12 talks (online form) (150 developers)\nOrganized 04 face-to-face meetings between the investor and Coreteam, PA in Hanoi and Saigon.\n+ Coreteam and PA members review and advise developers' ideas\n+ Select good ideas to write Proposals to submit to https://cardano.ideascale.com/\nThere are 20 Proposals for Funding 11 and 12\nThe past three months\n\nHost a face-to-face meeting between developers and Coreteam, PA\nOrganized 06 online seminars\n30 developer ideas submitted on https://cardano.ideascale.com/\nThen report to Catalyst to mark Proposal closed.\nthe budget of the proposal is reasonably subdivided to achieve the project objectives.\nThe project team has a lot of experience to carry out the project and has attached files for easy tracking:\nDo Manh Hung\n\nMaster of Finance\nCommunity Management\nHaskell, Plutus Pioneer\nInfluencing and Inspiring Coaches\nFimi's course instructor.\nDo Viet Cuong\n\nCommunity Management\nTeacher of high school\nVideo producer\nTranslation team leader\nI think this project will be implemented successfully because I know and learn about the previous proposals of the group that are being implemented very well.\n", "q1r": 5, "q2": "It is a very clear measure of the success of the proposal that the proponent makes.\nNumber of talks (face-to-face and online)\nThe number of developers participating grows\nThe number of participants in the defense of the growing area\nThe idea of quantity proposed by the developers increases through the fund.\nBut I want the proponent to give more specific indicators so that readers can easily understand and understand the success of the proposal.\n\nThis proposal is consistent with the Challenge and sustainable development of the technology platform of the Cardano ecosystem in particular and the sustainable development goals of the United Nations in general. Specifically: this proposal works toward Goal 4: Ensure quality, inclusive and equitable education, and promote lifelong learning opportunities for all, and Goal 9: Build sustainable infrastructure sustainably, promote open and sustainable industrialization, and encourage innovation.\nI appreciate the implementation of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13510, "q0": "This proposal is about holding talks for Vietnamese developers with the participation of the Core teams and proposers on Catalyst. It comes from the fact that Vietnam has teams of potential developers and a lot of ideas. However, many ideas have yet to materialize due to a lack of funding to implement as well as a lack of accessibility and understanding of Catalyst. Therefore, the orientation, and training, and especially providing a professional learning environment guided by experienced and professional people will help developers in Vietnam have the right direction to approach the Catalyst from the very beginning.\n\nThis proposal is consistent with the Challenge and sustainable development of the technology platform of the Cardano ecosystem in particular and the United Nations' sustainable development goals in general. Specifically: this proposal works toward Goal 4: Ensure quality, inclusive and equitable education and enhance lifelong learning opportunities for all, and Goal 9: Build sustainable infrastructure firmly, promote open and sustainable industrialization, and encourage innovation. Although Blockchain is still limited in practical application, in Vietnam the acquisition of knowledge about Blockchain is well received. In 2021, Vietnam was the country with the highest cryptocurrency acceptance index in the world. That proves Vietnamese people are very sensitive to new technology and it is also a contributing factor to the research and development of Blockchain applications, specifical applications on the Cardano ecosystem.\n\nIt is proposed that the scale can be expanded in the future because the talk shows take place in the form of a combination of online and offline. With the online form, the proposal can be organized with a large scale and number of participants, allowing more developers to access Catalyst. At the same time, the organization of face-to-face meetings will help increase interaction between developers and the Core team, PA, etc., helping to generate ideas, and proposals for Catalyst and execute (if funded) more effectively.\n\nOver the past 3 months, the team has held a face-to-face meeting between the developers and the Core team, PA... organized 6 online talk sessions. The team had 30 developer ideas submitted on https://cardano.ideascale.com/.\n\nThe proposal correctly solves the challenges posed, if successful, the proposal will add a lot of value to the Cardano ecosystem by building a quality team of developers, PAs, and VPAs.\n\nBesides the positives, the proposal presents risks when developers have ideas but don't write proposals or slippage of ADA price reduces the incentive to contribute to the ecosystem. However, the team can fix it by forming a team to write ideas for developers, while also requesting a backup budget for ADA slippage.", "q0r": 4, "q1": "The proposal is implemented over the three and six-month timelines. As follows:\nThe first three months after being funded:\nForm a team of developers (30 developers)\nHost 06 Catalyst talks featuring developers, Coreateam, and Proposal Assessors (PAs)\nOrganized 02 face-to-face meetings between developers and Core team, PA in Hanoi and Saigon\nThere are 05 Idea Proposals submitted at fund 10\n\nThe next six months:\nOrganize 12 talks (online form) (150 developers)\nOrganized 04 face-to-face meetings between developers and the Core team, PA in Hanoi and Saigon.\n+ Core team and PA members review and advise developers' ideas\n+ Select good ideas to write a Proposal to submit on https://cardano.ideascale.com/\nThere are 20 Proposals to submit Fund 11 and 12\n\nThe proposal also divides detailed budgets specifically for the following activities (total 15.000$):\n$2.500 Training for the new core team\n$1.200 Editing video (50$ per weekly video in 6 months)\n$3.000 Support community members (500$ x 1 supporter each month)\n$4.800 Reward for presenters (200$ per week)\n$1.500 Consultant fee\n$2.000 Reserve to watch out for flip page ADA price\n\nThe proposal is made by members who have experience in training Blockchain and Crypto knowledge, and are active in building and developing the Cardano community in Vietnam. Therefore, funding the team to fund the implementation of the ideas in the proposal will help accelerate and multiply the accessibility of Catalyst in particular and the Cardano ecosystem in general for potential developers.", "q1r": 5, "q2": "The effectiveness of the proposal is assessed through the following indicators:\nNumber of talks (live and online)\nThe number of participating developers increases\nThe number of PAs participating increased\nThe number of ideas proposed by developers increases through funds\n\nThese are quantitative numbers and can be easily checked on the website, telegram channel, or the number of additional proposals per fund published by the team. If the proposal is successful, it will help build a community of Vietnamese developers in the quality Cardano ecosystem, and thereby develop a sustainable Cardano ecosystem. With the positive results obtained through 3 months of implementation before applying for funding at Fund 9, I have every reason to believe that the proposal will achieve the set goals.", "q2r": 5, "assessor": "z_assessor_3662", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14644, "q0": "It could be seen that the proposal mentioned is aligned with the challenge settings of this round. It allows Vietnamese developers to easily access and know of Catalyst and Cardano. On the one hand, The proposal realized the strength and weak points of the developer community in Vietnam when they wanted to join in the Cardano ecosystem. Firstly, there are many Vietnamese potential developers with great ideas, but they are limited by lack of specialized knowledge. Then, they give a solution to solve the problem by organizing talk shows about Catalyst and Cardano through Zoom online platform with the support of Coreteam. Especially, they will provide meaningful information about Cardano's On-chain Governance Mechanism, dRep means, how to build a high value project for the Cardano ecosystem,..As well, also tag link, address of stored Github and Youtube(Relevant link 1: https://fimi.vn/ada, Relevant link 2: https://t.me/FimiDev, Relevant link 3: https://t.me/Fimi_PA). It brings benefits for developers that are trained in idea writing, idea submission and making ideas come true and at the same time, Vietnam developers will be interested in Catalyst and will contribute their products to the diverse and sustainable development ecosystem. On the other hand, Team members also identify risks that developers have ideas but do not do and Slippage of ADA cost. Besides, they provide a solution for the organization team to write ideas for developers and ask for a backup budget to solve this problem, and it could be seen that it is a good idea. However, I think that team members should follow economic news regularly to keep an eye on the forex market. Understanding financial events and analyzing the situation makes it possible to predict future price trends. Trades should be made during the most active, liquid market hours and Avoid trading at the close of the market. This prevents the Slippage of ADA price and ensures reach their goal. ", "q0r": 4, "q1": "First of all, the proposal has high feasibility and would have received funds from Catalyst. To be more specific, the plan designed a detailed way about milestones, activity per week and project development process. In terms of budget, The information provided in the project is clearly in each month, detailed and suitable for the budget that mentioned before. Meanwhile, the proposal allocates emissions, position and suitable work for each staff of the core team and other technical teams. At the same time, they are a great Team because of their professional background and more experience, as a result, it indicates a reliable and productive team. In addition, the team reached some achievements before like Hippocedeas app, healthcare API document, related funded project by catalyst,..“The plan has no technical complexity, as the project is more focused on managing information and data on a single application site.", "q1r": 5, "q2": "It is clear that the proposal had experience in measured projects before and then, they only built a SDK for language based on SDK JavaScript including Stable code, Simple code, Testable code, Team velocity and Knowledge share in GitHub. To tick off each task done per module.  to easily access, check, monitor and follow the development of the progress. The team gives solutions to  problems such as they will discuss to give a good way to solve postpone ideas or avoid mistakes. The roadmap is well-prepared to make the audibility part become easier. In addition, after JavaSDK done and available in Hippocrades infrastructure are indicators for evaluating success, besides the KPIs. I hold a belief that if the proposal is Fund success, it not only will bring merits to developers and customers, but also contribute to the development of the healthcare infrastructure of the Cardano.", "q2r": 5, "assessor": "z_assessor_4077", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Organize talks about Catalyst for developers in Vietnam, with the participation of Coreteams and proposers.", "experience": "Group Administrator of the largest Cardano Community in Vietnam since 2018. 11 years as a programmer. Veteran Proposal assessors. Software developer. Deep studied in Blockchain Cardano and its ecosystem."}