{"id": 420980, "author": "adapools.org", "title": "cexplorer.io - cardano explorer", "url": "https://cardano.ideascale.com/a/dtd/420980-48088", "category": 26597, "amount": 3000, "description": "Diversity and enough different and independent tools for developers is the basis for a successful chain. Web-explorers are one of basics.", "f6_no_assessments": 8, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"id": 1305, "q0": "The proposal is asking for a funding to support HW requirements of the formerly known adapools -> cexplorer. The team has already done so work, and as they say, they are working everyday to keep improving the product. The site is displaying a lot of important information such as stake pools – their pledges, distribution, then you can see assets minting in real time, number of accounts and their activity and many more. These information can be utilized by anyone when searching for some data-backed up source, or for business analytics, and all this is covered in a nice UI coat. The tool is useful for all participants of Cardano – but also blockchain in general, from stakers, to devs, stake pool operators, potential newcomers or even those who are writing blogs and articles. The impact is on the whole community. Cherry on the top – they plan to deliver mobile app aswell! ", "q0r": 5, "q1": "Since the product is already done, I am convinced that it will be delivered, and given the budget requested – 3k, it all appears reasonable and fine. A small note for proposer – please, the next time, even the product is finished – put there links to your bio + possibly linked in profiles + state precisely for what the budget is, even if it is small like this. Right now, for voters who do not know you, this might appear very shallow, with only few information posted, and therefore you are decreasing your chances to get voted. ", "q1r": 4, "q2": "Unfortunately, there is no information posted about how we track the progress – there is a mention that a checklist can be used for features that are not finished yet, but we do not know what is not finished. Also, we do not know WHEN it is planned to be done, so this makes the audit part even harder. At the same time, regarding the success, again, the completion of all necessary features is stated – but these are? And launching a public API can be verified. We have a link to gitrepo, so it is an open source, which can serve for a good progress tracking. The proposers are having twitter, discord and telegram for announcements, to public channels are accessible. (found on cexplorer).   ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 2359, "q0": "This proposal might not look like much but the benefits of the tool offered is huge.\nThis proposal intends to build a web explorer for cardano.I know other explorers exist but i don't think more are not needed.\nThe demo can be found here https://cexplorer.io/\nFinally , there is always a risk when working on something no matter how trivial the risk may be .\nI wouldn't want to start bringing up nasty examples(use your imaginations) of things that can cause the execution to stop.\nI will be giving 5 stars for impact according to the PA guidelines.", "q0r": 5, "q1": "Now sadly the proposal did not provide a roadmap or timelines which is very important in assessing the feasibility of the proposal.\nI think this is an oversight by the team,I will encourage the team to have a look at similar previously funded proposals(https://docs.google.com/spreadsheets/d/15ELXp81NfvXHgrerTbuIofZOXBsdjocN1YgBK0gPP3E/edit#gid=2111315347) as a reference guide to drafting \nfuture proposal.Team members details was provided with no verifiable links to team members bio.\nI will be giving 1 star for feasibility based on the information provided.", "q1r": 1, "q2": "\"A simple checklist with features that are not yet finished. In our case, this checklist is very easy for anyone to use.\" - this is not a reliable means to \ntrack the progress of a development heavy proposals.\nI would have expected Git Links, Twitter spaces regular updates or even using the monthly town-halls to update the community.\nI will encourage the team to heed my advice and peruse previously funded proposals to avoid this mistake in future applications.\nA good idea but a poor proposal and it hurts me as i am rooting for this proposal.\nI will be giving 1 star for audit-ability.", "q2r": 1, "assessor": "z_assessor_2301", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 2538, "q0": "The proposal features a continuation of the rebrand of the notorious adapools.org.  This platform has been part of the community as early as one can remember, they developed one of the first stake pools explorers plus an API to get data from the blockchain. The impact of such project is global as reliable chain explorers are always needed by other parties for any sort of implementation over the web or similar project. Since this project has been an integral part of Cardano's ecosystem as an OG project, its impact in apparent and can beseen in its number of users and so on. The project is already delivering regardless of the funding and it would be helpful to see it being funded as a help out from the community. The project is a one stop shop for most metrics about Cardano like: Price, epoch, Live stake, Assets, pools info, pools ranking, assets breakdown, metadata info,...", "q0r": 5, "q1": "The team's reputation and previous work and the links provided speak for them. For starters. the team has been working on adapools.org for more than 3 years now and has provided immense value to our ecosystem. Their budget is quite small and they specified that it will all be spent on hw-expences. There is no specific timeframe of the project but their development is shared publically over Github and the community can check from there. Risk are said to be null as the development already is taken place and the project is already established. The fact that this is an established project brings high assurance is their success and makes me recommend them for funding. The website adapools which is rebranded as cexplorer.io was one of the pioneers in pools visualisation and open display of blockchain data and helped many community members choose their first staking pool. The fact that the team is constantly adding features to their website is a great indicator for their hard work and expertise which is needed for this project.", "q1r": 5, "q2": "This project is an open-source project with the development being constantly shared as public commits in their github page. The history of the team with funding is also an indicator that makes be optimistic about the suitability of the project. Furthermore, the community can see changes and advancements of the project being rolled out live to the site and they can interact with them. Whether you are using the API or the site the value of the project and the ability of the community to follow through with auditing it is trivial. Also, the team is very interactive by twitter and is a constant participant in Townhalls where the community members can ask them question and enquire about their development. The team also expressed their plan to more to a more sustainable way of funding using their product which will make them rely less on Catalyst funding. The team also delivered part of the project which the community can check from the provided link. Accoriding to all the information at hand, I feel comfortable with reommanding this project for funding.", "q2r": 5, "assessor": "z_assessor_2317", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4954, "q0": "The proposal aims to \"create rich featured cardano browser with testnet support.\". That is all the information given as to the proposed solution. The team has already started work and made a lot of progress. You can see the current state of the product here: https://cexplorer.io/. The product has a dashboard where we can see stake pools and many details for each such as rewards, number of delegators, active pledge. It is very detailed. It also lists NFTs, tokens, exchanges, as well as a bunch of analytics tools. It seems to be a completed product that looks very good. \n\nA cardano browser is a great tool for everyone. On-chain information like tokens, assets, pools is already a great treasure for anyone exploring/learning about the Cardano ecosystem. Adding on top the analytics tools, we have a great product that delivers untold value to the ecosystem. Developers also benefit from this information, although the proposers have not made clear how that is. Either way, a chain browser is not directly a tool for developers, although with an API developers have a great place to get information about the chain. \n\n\n\n ", "q0r": 3, "q1": "The team has already built the website. They are the team behind adapools.org. They are capable of delivering any features they want. I'm sure they can deliver on whatever features they want to implement. I wish we could know what those features were though...\n\nThis is all the info they have for their budget: \"We will use all funds to cover hw-expences for this year.\"What even is hw-expences? Hardware expenses I'm guessing is what you want to say here. Do you seriously not have the time to even spell out what you're going to spend the money on? This is disrespectful to the Catalyst community. I suggest you at least take an hour to fill out your proposal next time. \n\nSince this is only a 3000 USD proposal, I understand not wanting to take too long to write the proposal and give much detail, but this feels like a joke. I'm guessing the team at adapools are having a bet on how little information they can put on a proposal and still get funded. ", "q1r": 2, "q2": "Since there is minimal information given in the proposal, it's difficult to understand what the team is proposing to do. They will continue development of cexplorer.io, but what features will be added, when, what outcomes are expected is entirely unclear. I would suggest some improvements but I think they know and purposely chose to not provide any information.", "q2r": 1, "assessor": "z_assessor_2643", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5111, "q0": "This proposal aims to enhance an already existing “explorer” website for Cardano Ecosystem called “cexplorer.” This website is a successor of adapools.org. This website has many functionalities that provide details for Cardano Ecosystem, such as a Stakepool list, information about distributed Applications that are running on the Cardano mainnet, and many others. Generally speaking, this tool gives benefits not only to developers but to the general community. That makes this proposal align with the challenge’s problem by providing an accessible channel that gathers much information about Cardano Ecosystem. However, a concern arises when assessing the purpose of the proposed budget of this proposal. The only justification that the proposal stated is that the proposed budget will be used to “cover hw-expences for this year.” The author does not give any more detail other than this. It creates confusion on why this proposal exists in the first place, considering that the platform is already up and running—this lack of detail strips down the clarity in the proposal itself.", "q0r": 3, "q1": "This proposal aims to “fully deliver” the Cardano Explorer platform (cexplorer) with all of the necessary features and a public API to go along with it. As this assessment is being written, the actual cexplorer platform is already up and running. The author stated that only “a simple checklist with features” is not yet implemented. However, the team is visibly confident in delivering these said features. Even though this proposal does not include any particular evidence, such as LinkedIn for its team member, the same team has successfully delivered prior Cardano products such as adapool.org. However, this proposal lacks many details. The first is that the author fails to include any time constraints on this project. This proposal does not include any milestones or any timeline/roadmap. The author only stated that “we will deliver a better and better version” without defining what is better and what could be improved on the current version. As for the budget breakdown, this proposal only states that the fund will be used to “cover hw-expenses for this year,” which is very vague and does not provide any valuable information. These could be a few gaps that could be more attention to when composing a proposal. The author should provide detailed information about the budget breakdown and how it would benefit this proposal. Moreover, the author also states that this proposal has “no risk!” This statement can mean one of two things. The first is that the author does not understand the potential risk that may arise from this project. The second is that the author is very confident in the team’s capability to deliver this project according to the criteria. It is not easy to assess these things when details are not present.", "q1r": 2, "q2": "This proposal has presented little to no information on the auditability of this project. The author has not provided any information on how to track the project's progress. This proposal only states, \"A simple checklist with features that are not yet finished.\" This statement does not give any valuable information to the reader. The proposal also fails to include any quantifiable measures of progress and success. It would be helpful to communicate the detail of the \"feature checklist\" as a milestone to measure the progress of this project. Detailing such things could significantly improve this proposal's auditability. To further improve the auditability of this proposal, the author could add more quantifiable metrics to measure the platform's user activity, such as traffic counts, bounce rates, and other analytics metrics. The proposal also has not mentioned any public reporting to the community. The project's progress and success measurement must be reported to the community via an accessible public channel.", "q2r": 1, "assessor": "z_assessor_2672", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5279, "q0": "The ADApools team will create rich featured Cardano browser ( a successor of adapools.org). The URL link provided (https://cexplorer.io) shows their current work. Cexplorer  gives the overview of network, event, various statistics. As an adapools.org and cardanoassets.com user myself, the Cexplorer is a much improved version of adapools that will help ADA holders to navigate stake pools, find detail about transaction and analyze the network. It will help developers to understand the network faster with this overview and build on top of existing tools. This promote the adoption of Cardano. The Cexplorer is almost in full use and no risk to deliver. I strongly agree that this proposal effectively addresses the Developer Ecosystem challenge. ", "q0r": 5, "q1": "Although most people in Cardano ecosystem would have come across the adapools.org tool and use them extensively in stake pool delegation, it would be great if the proposer would provide the team member name and their profile. The budget of $3000 is sensible to cover hardware expense for this year. The team is currently working on this Cardano explorer and will be deliver a better version. Please put the roadmap, milestone, and budget breakdown as part of your next proposal. It is likely that this proposal will be implement ed successfully. The cexplorer is already live and it won't need further support from catalyst funding as it should be a sustainable operation.", "q1r": 4, "q2": "It is rightly point out that the checklist of features that are not finished could be the metrics to track project progress. However, the voters want to know what those features are so please add this information and share with Catalyst.  Their goal is to launch the full featured explorer with tools for developers in the public API. The project can be audited for progress and successful delivery enough from checking the Cexplorer portal. When visiting cexplorer.io, there is an article tab that explain how it works, maybe this could be a good place for project updates and explain ongoing features with the upcoming ones like mobile app and wallets.", "q2r": 5, "assessor": "z_assessor_2684", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5605, "q0": "The team behind community greats Cardanians and Adapool, rebranded as Cexplorer.io (sounds a bit NSFW in my humble opinion but that is not the discussion here ;-)), propose the low budget implementation of their new, feature rich rebranding. A lot of this has already happened, and will happen regardless of funding. This is sometimes unfortunate, as it might not be possible to measure or evaluate the feedback of the funding requested, but in this case perfectly fine in my opinion. The 3k would be used for hardware expenses, so with Catalyst funding we can probably expect a slightly more performant version of the explorer as it might otherwise have been. Let's treat the impact and challenge fit therefore as the request for a \"tip\" from the community for the great work of the team that provides a great, popular free-to-use tool relevant to anyone remotely interested in Cardano staking. Obviously, tipping does nothing to improve tooling for developers, but I think given that this is for 0.3% of the challenge budget, having more motivated folks putting the finishing touches  on cexplorer is likely to pay off in the long run.", "q0r": 4, "q1": "The website at cexplorer.io already looks a great deal better than adapools did, with more features and much better UI/UX. Given the scope of this project, this totally speaks for itself and only a miser would ask for LinkedIn profiles (so web2), Twitter links (look it up) or an itemized budget breakdown. It shows that this team has been around since the incentivized testnet, and the team makes great use of Github and Twitter, so it is super easy to get more information on the proposers and their body of work. It is simply not necessary for the verdict of the feasibility of this project: it is a done deal. But honestly, even if this was just a mock up, I would be impressed already. So I rest my case - bravo.", "q1r": 5, "q2": "The team provides a checklist with features that have mostly been ticked off and is very transparent for the community. The success of the project is extremely likely, so audit will not be the most important function for the challenge team dealing with these proposers here. The website even lists their place of work and all github profiles and twitter activity can easily be traced. So although not entirely necessary (see section above), it would be an absolute breeze to get any information relevant to the audit of this proposal.  ", "q2r": 5, "assessor": "z_assessor_2720", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14335, "q0": "The team would like to get the already existing Cardano explorer cexplorer.io funded. The site has essentially already been developed and is the successor project to adapools.org. However, the site currently only maps all the data from the mainnet. The proposer would also like to add data for the testnet and make the website more usable for mobile devices.  The operation of the website and the continuous development represents obvious added value for the Cardano ecosystem.", "q0r": 5, "q1": "The timeline for the project is a bit vague, but basically, it's about funding the hardware costs for one year (3000 USD) - which seems realistic if there is a node running in the background.\nThe team has been around Cardano for a few years now. However, one unfortunately has to search for the information. More details would certainly be desirable, even though the sum in question is fairly small. \nDue to the fact that the project is almost finished and there are no significant risks, I have no major points of criticism.\n", "q1r": 5, "q2": "The ongoing operation of the platform is probably enough to monitor the project. Nevertheless, the proposal talks about a checklist. It is somewhat incomprehensible what is meant by this and where it can be found. It appears to be missing from the GitHub repository. However, the team also runs a very active Twitter account with almost 8,000 followers. Due to this fact, and that news about the website is also posted there, I'm inclined to ignore the missing information here and give the proposal full marks for audibility as well.", "q2r": 5, "assessor": "z_assessor_3988", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We are creating a new version of the browser for the cardano ecosystem - (successor of adapools.org). You can see the results of our current work here: https://cexplorer.io/", "experience": "\nOG. We are creating tools since ITN\nCardano believers since 2017\nas example of our work, look on adapools.org / cardanoassets.com\n"}