{"id": 421356, "author": "otaviolima", "title": "Exhibit Blockchain BIT in RIO 22 BR", "url": "https://cardano.ideascale.com/a/dtd/421356-48088", "category": 26597, "amount": 18955, "description": "Only a few Brazilian companies know Cardano as a main Blockchain. Difficulty in adopting Cardano (ADA) in the real business world and show use cases about the cardano ecosystem.", "f6_no_assessments": 6, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 10108, "q0": "Cardano is not in vogue and is not widely recognized by companies in Brazil, and it's not used much in business.\n This proposal is suitable for the challenge setting since it provides a knowledge base and documentation for more people and businesses to know about Cardano.\nThe project’s sphere of influence is within Latin American countries, especially Brazil.\nService users of the proposal are companies of all sectors and scales participating in BIT in RIO 22.\nThe author did not state the SDG of the project, however, I think that this project matches goals 8 and 9 of Catalyst. Since the project attracts more people to use Cardanoin business, it will facilitate and promote worldwide business, provide infrastructure for continental business,  and support the human’s processes in Catalyst. \nThe same event can be organized in any other country, making more people know and use the Cardano blockchain.\nWhen this project occurs, the proposed team can reach 1000-1400 people to spread their knowledge about Cardano to them, however, the proposal team also has a plan to take action to save attendees' contacts and have acted of taking care of customers as well as establishing the Cardano community to turn attendees into Cardano users.\nThis project promotes using the Cardano blockchain in business, making Cardano known to more people, and making Cardano more useful in the real world.", "q0r": 4, "q1": "This project is mainly focused on the plan to showcase Cardano at the 1-day BIT in RIO 22 event. This is the biggest Crypto event in Latin America. The authors set up a booth with a size of 4x5m in a good, conspicuous location to attract visitors, using an influencer strategy to invite domestic and international celebrities in the field of Crypto to attract more people. more people, along with good infrastructure at the convention center of the Windsor hotel. It is also indispensable that lectures and demonstrations for the Crypto market are also proposed to disseminate the knowledge of Cardano and the Crypto market to the attendees. In addition, the proposed team will contact partner websites such as CriptoFácil, Coijntelegraph, BitNotícias, and several other media channels and other sponsors to reach more attendees. The author team also plans to take care of event attendance after the event by sending emails and invites to Telegram groups and other Cardano social networks channels.\nThe proposer divided the timeline into 4 stages, each stage 1 week. The timeline is quite reasonable from preparation for the event, getting partners, and carrying out the exhibition to service after the event.\nThe group has a clear description of the proposed participants, the experience and necessary skills to implement this proposal, along with the members' personal Linkedin links, so getting information about the group's members is very simple. The members all have experience and knowledge about blockchain, Cardano, and many other industries, so they can completely explain and recommend using Cardano to businesses. At the same time, the team also has members specializing in marketing to promote the event. In addition, this project is similar to the project \"Exhibit Largest BlockChainEXPO(JP)\" which has been successfully implemented in funds 6,7,8, the authors can refer to:\nhttps://cardano.ideascale.com/c/idea/367080\nhttps://cardano.ideascale.com/c/idea/381820\nhttps://cardano.ideascale.com/c/idea/400205\nI think, with the experience, skills, and references from the forerunners, this project can completely be implemented successfully.\nAlthough the proposal clearly states the members, experience, and tasks to be done to achieve the project's goals, the proposal does not specify the specific work of each person in the event.\nThe authors themselves found that in this event, they have many strong competitors who have experience in organizing events like this. Also, I realize, the biggest risk here is how to achieve the KPI that has been set out? Specifically, the event can attract more than 2000 people to attend, how can the author group attract 1000-1400 people (50-70%) to their booth? Above all, a large project like BIT in Rio like this will have a lot of exhibition booths, visitors cannot go to all the booths, how can the project team attract visitors to attract those visitors? I suggest that the project team can use google Maps or similar software, to indicate the exact address of their booth with the contact of the organizers in all the marketing campaigns to attract and guide them on how to go to the booth. In addition, the risk that the exhibition may not be possible due to natural disasters or pandemics should be considered.\nCurrently, the project has no other source of revenue other than Cardano's budget. However, the project team may consider collecting support fees, consulting fees, and training fees when businesses apply the Cardano blockchain to their business. Combined with applying for sponsorship from other companies/partners with the condition that their logos will be displayed in advertising programs and at exhibitions.\n", "q1r": 5, "q2": "The team requested a budget of 18955 dollars, which I think is reasonable. The group has outlined the uses of this budget, however, the proposal does not specify how much budget each task requires. The proposed group should provide more specific and detailed information on the allocation of budget resources instead of just showing areas for spending but not details.\nThe overall project implementation roadmap is clearly presented in detail on a weekly basis. Each milestone is associated with transparent, easy-to-follow, and auditable execution of the work.\nThe author also clearly shows how to measure the success of the project, which is specified by numbers such as the number of lectures 1000, the number of Twitter followers 2000 people, the number of people downloading the wallet 100, etc. When the community wants to see the project results, they can easily access and decide whether the project has been successful or not.\nThis project is a new project, however, there have been many similar proposals to this project that have been successfully implemented in previous funds by other teams, in other locations. This project has improved compared to other previous projects because it is presented clearly and is easier to measure and check. So I boldly guess that this project has a very high probability of success.", "q2r": 4, "assessor": "z_assessor_3155", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 727, "q0": "The proposers want to bring more developers into the Cardano ecosystem by taking part and having a booth at the blockchain event in Rio de Janeiro called Bit-in-Rio. Judging by how much “Consensus” boosted the morale of the Cardanor community where the developers got to see how their work was being appreciated. This is an excellent event to create a sense of community and conversation between developers and to showcase what Cardano is capable of. This is a one-off event.  I think it's a fantastic event to raise Cardano’s image as one of the best blockchains and have the time to explain why.", "q0r": 5, "q1": "Yes, Otavio Lima is the coordinator of this proposal and is a visible figure in the Cardano ecosystem. Otavio runs the Cardinal feed website which provides news on what's happening in the Cardano ecosystem. The other three members also have strong backgrounds; there is a Cardano Ambassador on the team; a journalist and content writer, and a marketing assistant. The team has experience attending these events in Latin America, having attended the Bitsampa event in San Paulo earlier this year.  The preparation for the event is planned to take 2 weeks, then 1 week for the event and another week to close it out and communicate with the people that attended. The team provides the detail of what space they can count on and the material they need to produce for a successful event. The level of detail is convincing,  going down to the gift that will distribute and the t-shirts that they will print. The budget breakdown is the only area that I find lacking. The total budget is set at $18,000, and there is no meaningful split into the different categories, making it impossible to judge whether individual items of the budget are priced correctly. Note that this will be a physical event to promote interaction between developer and users, and not a hackathon, no new software will be built. The proposers do not highlight any risks.  Overall, I think the proposers have the right team to organize and run this type of event; however, there is some detail missing on the budget breakdown and potential risks. If I am in Brazil at the time, I will definitely attend the event.", "q1r": 4, "q2": "Yes, this will be a physical event that people can attend; therefore it is straightforward to audit.  The plan is clearly set out with 2 weeks of preparation and a capable to team deliver it who has experience in running events like these in the past. The team will communicate their progress on social media and on the Cardanofeed platform and will track KPIs relate to the number of participants at the event, new followers on Twitter, and other social media indicators. Success will be an increase in the attendees to Charles’ talks and an increase in the Brazilian community on telegram groups and inquiries about Cardano hiring and other opportunities on Cardano by outsiders.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2541, "q0": "The project is a great event and presents a serious opportunity for Cardano to open up more to Brazil and perhaps even other neighboring latin countries. While this event would be a great mean for a local impact and further adoption in Brazil, it seems that the team put the proposal in the wrong challenge since the event is not intended for developers and does not solve any developer specific issue. I am glad to see such event being proposed and think that it is a great addition to the countless number of events being held by community members, I also hope that the team submits it to a proper challenge next time if not funded. It will also be great if the team can specify further details about whether they have plan to make it a yearly event and whether they would like to branch out of Brazil and make it in other neighbouring countries. It would be great to see such events that make our ecosystem transcend any brothers or language barriers and achieve true decentralization in the physical and the cultural sense. ", "q0r": 2, "q1": "From the information provided, the team is pretty able. The team includes the CEO of Cardanofeed and a Cardano ambassador plus a Crypto journalist which is a great combo to have for such an event to make it as educational as possible. The team also provide a detailed roadmap including what needs to be done to manage expectation while considering all logistical hurdles that come with such an event. Furthermore, the event's budget is broken down in detail providing info about where spending is directed, and the budget seems to be fair but I would have preferred to see each of these expenses individually to have a better idea about the costs. The main risk proposed by the team would be the team's integrity which they ensure is in check. They also mention some partnerships they have that would help with the event like the one with Cointelegraph. I wish them good luck and look forward to seeing this event happen!", "q1r": 5, "q2": "The team provides details about every single thing that will be needed for the event, they also provide the community with some success metrics to judge the success of the event. These success metrics include things like: number of business partipants, conference participants, awards participants, social media following and so on. These data data will be publically available for the community to see and assess the project's success. The roadmap and the planning side of this event seems to be well taken care of. From legal matters to logistical issues and speakers everything is mentioned by the team which gives me high confidence in the event going through. There is no clear delivery date which is understandable due to the nature of this project and the date's dependency on the funding. On the other hand, a weekly breakdown on what will be done is provided which is pretty useful to see the team's process in going about making the project and perhaps can be of use to other new event organizers in the future.", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3552, "q0": "The proposal will exhibit cardano at BIT (some kind of converance) in RIO 22 held 26th of november this year. This is a great idea to involve more developers in the fold. I love conferences because it's full of motivational and motivated people that are happy to have new contacts and learn something new while there. The attendance rate of 1k-1.4k is reasonable when people are already interested in crypto.\nThis will definitely be adding value to the cardano ecosystem, although I can't help but wonder if this is the best challenge for the ecosystem because I don't see a direct way of creating a positive experience for the developers, because it's a confernece and I imagine this challenge is more concerned about SDKs platforms and other tools from developers for developers and I really don't see an answer for the impact question of \"how will your proposal address the challenge\".\nEven so I like the proposers have a detailed plan for their target group and the what pannels are crypto related. It shows they've done some research which is always good.\nI don't see any challenges specified as well and for an organization event I can't imagine there aren't risks involved.\nOverall I like this proposal, but I'm uncertain if it's in the right category and several of the questions have no answer so I', uncertain of the impact.\n", "q0r": 3, "q1": "The proposers seem to have a really decent plan segregated by weeks, spanning from, the start to the end of the event. It makes following the progress of the organization somewhat easier. It's really nice they already have 7 additional collaborators working, because this shows passion for this project.\nI like the detailed explanation of what exactly is provided by being a sponsor for BIT in RIO 22 and it I also love the categorization of everything, but what I don't like is the lack of budget breakdown. The legal costs as well as every other item can cost between 0 and 18995 which is the requested funds. That seems really like a hit and miss because the budget is specific enough and logically that means these calculations are already made, so why not add them to the proposal to be fully transparent. This brings the feasibility of the project down a bit for me as an assessor because I can't actually assess if the prices for each individual task is reasonable.\nI managed to verify and compare the listed team members and their skills and credentials and can confirm they have all the qualifications to do the stated work to be done.\nOverall again because the lack of details I am unable to assess if this proposal is feasible or now, because there's missing breakdown and information.\n", "q1r": 3, "q2": "This proposal has solid metris and KPIs to measure and aim for success. As a developer I am no expert, but the metrics seem logical and the goals seam reasonable but not too easy to reach.\nThere's a clear problem even though I don't think the solution of visiting a conferance is in full alignment with the challenge or it's settings.\nConcerning the auditability, there was no mention of where can the community members will be able to check on the progress and no mention of receipts or tickets being posted somewhere for public audit.\nOverall a good proposal, but it needs some polishing. It's somewhat auditable but It could be a lot more transparent. Even so I like the definition of success and the target for grrowth of the telegram community.\n", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 7568, "q0": "The difficulty of adopting Cardano (ADA) in the real business world and showing the use cases of the cardano ecosystem is an issue that needs to be addressed in this challenge, it is directly related to the problem. need to be resolved now. This proposal, if implemented, I think it can be scaled up more, helping more participants and more people know about Cardano. Well defined solution they will be exhibiting Cardano at BIT during the RIO 22 event - They bring to the \"Wonder City\" the famous Carioca version of the biggest Crypto event in Latin America, Rio de Janeiro - the 26th. November 2022 (1 day). This solution can solve the problems of the challenge. After the big event ended with a flourish they had a partnership made with CoinTelegraph, one of the most reputable news sites in the crypto world. With what the author has achieved, I believe the project will be successful.", "q0r": 5, "q1": "The implementation roadmap of this project is 4 months, and the author lists in detail what needs to be done clearly and specifically. The author also aims to achieve them within a certain amount of time. The progress of the project is also easily trackable through the social networking sites listed by the author. The success is clearly described by the author as the results achieved are: increase the Brazilian community in the Telegram group, increase the number of people attending Charles' talk by making announcements, Receive recruitment inquiries Cardano, SPO transaction and ADA purchase, Event successfully executed, achieving target values defined in KPI. This success is linked first to the challenge of the campaigns.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous.\nAuthors will provide the community with some kind of progress report as they go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of their proposal.\nThe author will also provide a board to be disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs.\nCardano numbers explained live to entrepreneurs: 800 people for the live event\nLecture for conference participants: 1,000\nTwitter followers: 2,000\nPrize participants: 10\nDownload Wallet: 100\nEmail and cell phone capture: 800\nGifts for participants: 10\nNumber of tweets with hashtags: 5,000\nWith the above indicators show that this is a good project with adequate performance evaluation and measurement indicators. The team will have a journalist, blockchain and crypto content editor, video marker, and presenter. The team consists of 4 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Marcus Vinicius is Cardano Ambassador, Gino Matos is a crypto journalist & content editor, Lucas Fernandes is a marketing assistant. The author also outlines what each member of the team has done, they talk about their previous experiences. They also link attached network links so we can easily follow their projects easily. The budget for this proposal is $18,955 less than 20% of the entire challenge budget. The BIT in RIO 22 creates a funding plan for your commercial and marketing goals The funding plan for these goals makes 5 expenses: BIT sponsor in RIO 22, grants, agencies, promotional marketing, gifts and prizes. The author also details the to-dos for those spending items, and it aligns with the current challenge. The budget is explained deeply and logically in this expenditure.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13844, "q0": "Launching a massive venue for Cardano and Blockchain universe in Brazil can be a massive newcomer onboarding opportunity. Having a physical event where people can meet face-to-face real Cardano developers and entrepreneurs will help people engage with Cardano and Blockchain technology. This kind of proposal is useful in fighting against general reluctance usually Blockchain and cryptocurrencies generate in the wide audience. People often think that cryptocurrencies are too alienated from the real world and a venue like this might dissipate fears and negative prejudices. Having Cardano experts presenting basic information and Catalyst funding opportunities in Brazil will certainly help enhance the Cardano Catalyst Developer Ecosystem. This proposal effectively addresses the challenge. Although it might be useful not to fall into grandiloquence. Organizing venues and events it’s not as easy as it sounds and having the biggest Crypto event in LatinAmerica might be too ambitious. Launching just a venue for Cardano and Blockchain would be already enough and a safe first step for future and hopefully massive Cardano events. ", "q0r": 5, "q1": "Team experience in the blockchain and Cardano universe is wide and abundant but it might be scarce in the venue and event organization. In order this proposal will be implemented successfully a venue and event expert might be needed. Venues and events should never be taken lightly. It is not as simple as it sounds. Nevertheless, key milestones are detailed and sufficient in regards to the venue organization but it lacks a pre marketing and social media outreach strategy that will ensure this venue of high attendance and massive participation. Marketing alliances must be developed as they already had with CriptoFácil and CoinTelegraph. A strong and ambitious marketing strategy should be designed as a 0 Phase in the key milestone plan. Budget breakdown is detailed but there is lacking consistency as prices aren’t specified. A total number budget might not be enough to have a consistent budget breakdown.  Further detailed budgets might be needed in order to successfully implement this proposal. Success and feasibility is endangered if there are no milestones in the venue organization.", "q1r": 3, "q2": "Team members are well acquainted with Cardano Catalyst Community and already know communication channels are to share monthly reports. Sharing their progress on the Cardano Feed seems enough but information provided might not be sufficient to audit this proposal progress. They are not specifying any KPIs or metrics for the evolution of the venue organizing and this might be the weak point of this proposal presentation. Numbers and metrics presented are only related to the last Phase of the proposal. As there is no progress auditability strategy, success will also be hard to measure.  ", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We will exhibit Cardano at BIT in RIO 22 event - We bring to the famous \"Marvelous City\" the Carioca version of the biggest Crypto event in Latin America, Rio de Janeiro - November, 26th 2022 (1 day).", "experience": "The team will feature a journalist, blockchain and cryptocurrency content editor, videomarker and presenter. Conceived and produced by the CardanoFeed team, the largest media specialized in Cardano coverage. We already have over 800+ projects registered in the Cardano Ecosystem."}