{"id": 421443, "author": "viperstakepool", "title": "Stake Pool Keys in libcardano", "url": "https://cardano.ideascale.com/a/dtd/421443-48088", "category": 26597, "amount": 12800, "description": "The Cardano ecosystem has a new C++ library that exposes Cardano to one of the largest developer communities; however, the library does not yet provide stake pool cryptographic functionalities.", "f6_no_assessments": 8, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 728, "q0": "Yes, the proposers suggest to add Stake Pool Key Management functionalities to a C++ Library that they have built previously.  They suggest it will bring additional developers into the Cardano ecosystem and give existing C++ developers example code from which to start their own projects. As a developer, I think diversity in implementations is always good. So it brings new developers and enhances the experience of existing developers. The project scales well as it will be released as open-source on GitHub, and the proposers will come back for additional funding if the community finds it valuable.", "q0r": 5, "q1": "Yes, the project will be delivered by 2 individuals: Dylan and Willie. Their short CVs are provided, but no social media links.  It would have been nice to see some social media links so their track record could be verified. When searching for Dylan it shows his Linkedin page that corroborates his experience. The deliverable is split into four parts and each one relates to the generation of different types of keys for the stake pool. As a stake pool operator myself, I recognize the types of keys and can confirm that they are required. The budget is outlined clearly and broken into sections.  Each section has an hourly expenditure at cost of $40 per hour.  Given the proposers’ experience and that they have built tools on Cardano before, this is a very competitive hourly rate and much below the average of the 30+ proposals I have reviewed so far. The total budget is $12,000. The proposed timeline is to finish in Q1 next year, which is reasonable considering it would take them 160 hours to complete. The risk highlighted is that the team might need to do some learning about the detail of how Cardano nodes encryption works if they encounter difficulties with the implementation. I think this is a small risk and a meaningful mitigation strategy as everyone at some point finds that they need to learn something new when delivering a project.  Overall, the timeline, the architecture, the language, and the technical details of the implementation are adequately described. I think the team has a very good chance to deliver this project on time and on budget", "q1r": 5, "q2": "Yes, The progress on the project will be measured by the number of commits per month on the public GitHub repo and a successful delivery will be a series of tests published as open-source on GitHub and available for others to use at the end of the project. Given that the tool is being built for the community I would have liked to see some measures of community adoption.  The proposers are active in the community, and I have no doubt that the community would be able to audit them based on the information provided in this proposal and by reaching out on Github and other social media channels.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 911, "q0": "This team is building open source libraries containing essential functionalities for developers in the Cardano ecosystem. This is one of the most simple and effective ways of growing as a developer community. Every improvement to the publicly available solutions will further help attract new builders and speed up existing projects. ", "q0r": 5, "q1": "The plan provided has a clear goal and the overall scope has been kept to a essential minimum keeping the risk low. This provides a clear road to completion and avoids complexity. The project also does not have any major external dependancies. The team is competent and has a proven track record in the community.", "q1r": 5, "q2": "The open source nature of this project and the commitment to consistant git commits will allow the community to track the project. Measuring the impact of such libraries can be difficult and often requires more effort than creating them in the first place, which is a general problem in Catalyst. \n\nEngagement with the community could also be a way to track both progress and success. Perhaps for future proposals it could be considered to add some effort to share the work publicly (workshop/presentation/twitter space). This would help with adoption and the process of sharing in itself is an implicit form of auditing, as more eyes will be on the delivery.", "q2r": 4, "assessor": "z_assessor_2152", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1438, "q0": "The proposal would be within the challenge goal,  and I think that this proposal probably will increase utility & adoption of Cardano blockchain challenge and builted for a great developers community. At the same time the statement of how problem is to be solved is poorly explained and in my opinion it doesn’t clear how c++ developers will be attracted to go to Cardano blockchain and it doesn’t clear how this proposal can create financial incentive for developers.\nI think it's important to improve details about the proposal services solution for the challenge (eg. Typical services use case for developer, example benefit for service creator and community, …)", "q0r": 3, "q1": "There are only one link in the proposal that refers to 3 team members, but it is not possibile to identify the teams the work on the proposal and the proposal assessment is difficult. Both team members have previously had a project funded through Catalyst with successful completion\nThe scope of the solution is explained (e.g. how the funds will be spent, what features will be implemented, and so on…). There is a too simple cost worksheet, that doesn’t contain all costs (eg. Infrastructure, cloud license, etc.)\nI suggest proposer that the plan for implementation could have been a bit more specific.", "q1r": 3, "q2": "The given metrics measure what the proposer wants to do. As mentioned above, the description of the solution is poorly explained (e.g. a goal of 5 substantial git commits per month, but basic information and only developers hours, on how the funds will be spent, how the solution improve their customer experience, and so on…), so the progress of this proposal is not simple to assess.\nBoth team members have previously had a project funded through Catalyst with successful completion.", "q2r": 3, "assessor": "z_assessor_2245", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3553, "q0": "The proposers plan on adding stake pool functionality to the libcardano c++ library. This proposal is definitely in the right category and matches the challenge settings completely. Before googling it I didn't know that the C++ community has 6.3 active participants, so knowing that, let's let the kind authors of the proposal enable them to bring their numbers and considerable skills to the cardano ecosystem as part of them have already done.\nI think the proposers have missed anwering the possible risks, because I don't see any mention of that in this particular section, but I'd say the biggest risk IMHO would be to not get voted in because people don't understand what integral part of the cardano ecosystem would this library be for c++ devs. If augmented the library would expand the capabilities of devs to provide stakepool capabilities in c++ while spinging along with billy idols' - speed.\nAs a developer I appreciate the specifics on how the library would be extended, so thank you for that, it's usefull to me in order to asses the impact, which will be certain. Overall an excellen and most of all succinct proposal that will have an impact for sure.\n", "q0r": 5, "q1": "I'm sure technical ability isn't an issue here, because I took a look at the github repository and with my humble c++ skills I managed to see that they are way way above my level as they should be. They've provided their names and I was able to verify their credentials listed in the proposal, but would kindly ask for links in the next proposal because it greatly speeds up the verification process on my part. Having said that, they do have more than enough experience to deliver the specified features.\nI'd say their hourly estimation is, as mentioned, conservative, so I do appreciate the value/cost ratio and would advise the voters to appreciate it as well. This is one of the \"cheap\" proposals, If I could express it in such a way, which makes it a no brainer. I really do like grand ideas and plans for the future, but I really think such small incremental changes much more likely to happen and that alongside the developers' skills brings the whole proposal likelyness to happen a lot more plausible and probable.\nThe roadmap is simple yet specific, which is a benefit of the concrete proposal with little moving parts. The budget breakdown is solid and as a developer I think the timframe is perfectly reasonable to get things done in a steady pace.\nAll technical aspects of the implementation are noted, which is already better done than many other proposals. And the greatest benefit for me as an assessor is the fact the proposal is succinct. This is something you come to appreciate when you read for about 40 minutes things that could be summarized in 2 minutes. So thank you!\nThis is definately not only feasible but probable solution. I reviewed it last round or fund 6 I'm not sure, and here they are again making incremental changes as is the propery way.\n", "q1r": 5, "q2": "I don't know the first thing about measuring the success of a production except for the view count and profits when thinking about movies, but the proposers have listed quite an extensive list of metrics they will follow to gage the adoption and interest so all goot metrics and KPIs wise.\nThe roadmap with milestones give a good map in the mind of any supporter of the project so they know what to expect and when exactly and thus are enabled to follow along with the project updates and timeline and eventual success.\nProposers have a good problem statement, a simple yet effective solution to build a documentary which is quite nice and the first proposal of this sort I've seen so kudos for that. By the looks of it they do know what they're doing and will involve the local community as they already have done through the hackathons.\nNothing left to do besides stating the obvious - this is an auditable proposal and I recommend voting for it since...for the third time value/cost ratio = amazing!", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4216, "q0": "The \"Stake Pool Keys in libcardano\" proposal addresses the Developer Ecosystem Challenge by adding the open-source C++ library to provide stake pool cryptographic functionalities. The proposal also fits the strategic of Cardano to have more open-source projects within the ecosystem. The added library will round up more developers from the C++ community and provide them with samples/templates and extend knowledge base. Rightly, the proposer will have to go through project documentation and example code in the IOHK repositories and the risk that the team would have to re-learn to extend this functionality. With this proposal, it will open the gate for C++ developers to have a go at Cardano and hence, satisfies the goal of this challenge.", "q0r": 5, "q1": "A very clear roadmap from the proposer. Also I appreciate the fact that he is extremely conservative with the estimate pay range of $40/hour. He values the Catalyst funding and requests a very reasonable budget of $12800. The team is comprised of 2 highly capable individuals with strong background and they are funded proposers who complete the Catalyst projects successfully. Note to the team, please provide linkedin or bio profile next time. I rank their proposal 5 as I am very confident that they will hit their targets with their conservative budget, strong team and clear roadmap. It was not the first time I come across their stake pool names \"Viper stakepool\" and I believe that their team can make this project a success.", "q1r": 5, "q2": "The proposal is very organized with the well chosen metrics/KPIs which are good indicators of evaluating success. Their measures for success are git commits (5 per month) and unit tests (at least once per month) on stake pool VRF Keys (signature and verification), the stake pool KES keys and the stake pool cold keys serialized to CBOR. The community can track project progress and updates on gitlab (libcardano) making this project auditability very high. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4606, "q0": "This proposal is about extending the libcardano, open-source Cardano C++ library, by adding support for stake pool keys. This would be another great step towards bringing more people from the C++ developer community to the Cardano developer ecosystem, as these people would have solid ground to build upon and also a high quality project like libcardano to study and get to know the ropes of the Cardano develop ecosystem. Judging from my experience as a programmer/developer, attracting C++ community members could have a seriously positive impact, as their community consists at large of skillful and experience developers. The proposal definitely defines a problem within this challenge's settings and does that in a succinct and clear way.", "q0r": 5, "q1": "The proposers are planning to extend the open-source C++ library they themselves have developed. Taking this into account and also their high quality experience of 10+ years in the field (programming/software development) I believe there are really high chances that this proposal will be implemented successfully. The proposal clearly describes the technical aspects,  challenges and risks to the project, while offering a detailed and in my opinion realistic roadmap to meet these challenges. According to the timetable two experienced developers will spend time equivalent to one month each on the project, which should be enough to complete this extension of the library. The budged is also outlined clearly and makes sense.", "q1r": 5, "q2": "The open-source nature of this projects is one thing that makes it easily auditable. At the same time, the proposers are aiming to push at least a certain number of code updates (5 substantial github/gitlab commits) per month. As they acknowledge that this might not be the best way to judge progress they will also be working on software tests that should pass, marking that the project is evolving. The proposers have also clearly stated the desirable outcomes and criteria of success for the project. Also, their implementation of the initial version of cardanolib (previous Catalyst proposal) appears to be highly auditable.", "q2r": 5, "assessor": "z_assessor_2574", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12974, "q0": "The proposal aim is add the stake pool cryptographic functionalities to the existing cardnao ecosystem which has the C++ library due to which many developers are onto the ecosystem. The proposers aim is to add some of the staking capabilities to the \nlibcardano . The proposer have described in detail that how they will be adding the libraries . This proposal enhances cardano eco system, The proposer also mentioned the key metrices of the proposal which align with outlined challenge settings . The proposal will also be developed such a way that it can addresses the future challenges .", "q0r": 4, "q1": "The plan for implementing the idea has been presented in full by the proposer, including a schedule and important checkpoints. The timescale offered by the proposal appears to be quite reasonable, and the proposal's budget breakdown is described in great detail. The proposer has also supplied information about the team who will be implementing the proposal as well as the expertise required to do so. The proposal has taken into account both the risks and obstacles to the project's successful implementation. After reading the idea, I  agree that it is likely to be implemented successfully.", "q1r": 4, "q2": "A target of five significant git commits per month will be used to measure the proposal's development. The challenge has already been described by the proposer in a way that is both clear and understandable, and the plan for its successful implementation is also described. The proposal's success is determined by the Metrices/Kpi mentioned in the description .", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 14471, "q0": "The proposal has identified the shortcoming of the Cardano open-source library for C++ developers - the lack of cryptographic functionalities. Due to this, this proposal sets out to solve that problem by proposing to add 4 stake pool keys, as specified in the proposal. Although the intention of the proposal to update cryptographic functionalities to the Cardano C++ library is clear, the proposer should give some explanation why the proposer chooses to add these 4 stake pool keys. The proposer could mention their strengths and compatibility to the Cardano library, or their commonality (something most C++ developers are familiar with and can utilize at ease). It is true that the proposal is well-aligned with the challenge and the impacts of this proposal are also clearly presented. More handy functionalities in the Cardano open-source library are encouraging for C++ developers and can attract more of them to onboard. In turn, the Cardan ecosystem will benefit from the contribution that these developers could bring. These functionalities could be an educational tool that widen the knowledge of the Cardano developer community. Regarding the main risk, the proposer mentions the “learning opportunity” from “some tasks”, which could have been more specific for better comprehension. It can be assumed that documentation and example code in the IOHK repositories have helped them to mitigate the problems arising from those tasks.", "q0r": 3, "q1": "A specific timeline is provided and divided into 2 stages in Q4/2022 and Q1/2023. Clear activities are included in these 2 stages. The budget breakdown is according to the hourly rate of 40usd/hour which is a conservative estimation. The budget breakdown allows us to see that 2 developers will be in charge of implementing these stake pool keys and the working horse will be 160 hours in total, which is good for transparency. The team consists of these two developers whose expertise is Computer Engineering and Computer Science, which is suitable for this proposal. They also have participated in the Catalyst funding project and successfully delivered the products. The proposal will need more funding in a later round if it achieves certain success. The proposer should add a brief explanation for what will the funding in the next rounds be used for (sub-projects, technicality, resources, update more functionality,...).", "q1r": 4, "q2": "The proposer acknowledges the measurability of 5 git commits a month is not the most optimal method so they provide additional unit tests. However, it is still unclear how these unit tests will represent a good indicator for progress tracking. The proposer should elaborate more on this as the technical aspects are not very clearly presented and explained. Moreover, the proposer could have beta testing for C++ developers to try the efficiency of these functionality and collect their feedback. The key metrics are quite clear and reasonable. SDG goal given is saving carbon footprints thanks to the energy-efficient C++ programming.", "q2r": 3, "assessor": "z_assessor_4055", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We propose to add the following capabilities to libcardano (the open-source Cardano C++ library):\n\nStake pool VRF keys (including signature and verification)\nStake pool KES keys\nStake pool cold keys\n", "experience": "The Viper Staking Team has operated a stake pool on the Cardano blockchain since the incentivized testnet (2019). The team has recently developed the open-source C++ library, libcardano which already provides functionality for working with Cardano wallets."}