{"id": 421465, "author": "joey.chessher", "title": "Community Managed Proposal System", "url": "https://cardano.ideascale.com/a/dtd/421465-48088", "category": 26597, "amount": 19500, "description": "Developers have expressed the need to move from Idealscale to a Community Managed System.\nLack of API’s and fast access to all current Catalyst data inhibits innovation within our builder community.", "f6_no_assessments": 9, "f6_rating": 3.3703703703703702, "videos": [], "media": [], "f6_assessments": [{"id": 964, "q0": "I will start by saying that an open-source community-managed replacement for IdeaScale has been a hot topic of discussion in the Catalyst community for a long time now. It already was when I joined in February 2021, so kudos to the proposer for taking on the challenge.\n\nBut unfortunately, this proposal does not offer a realistic solution. In fact, I found the main presentation of this project to be nothing more than a retelling of the Cardano roadmap in the author's own words. With a few errors I might add, as the author states that “when both a voting and treasury system are in place, Cardano will be truly decentralized” when in fact Cardano already has a treasury system (that’s what’s funding Catalyst actually) and a voting system - even though for now it’s not on the main chain.\n\nWe may not like everything about Ideascale at this point, but the simple truth is that the community doesn’t yet have the resources to build an Ideascale replacement from scratch currently. It will likely come in time, but probably bit by bit, not in one fell swoop like this proposer seems to indicate.\n\nI would also like to add the fact that the proposer doesn’t explain why this proposal for building Project Catalyst infrastructure is a good fit for the Developer Ecosystem challenge.\n\nMy review of this Developer Ecosystem proposal is based on my experience as a project manager working directly with Cardano developers since July 2021. I have participated in almost all roles in Project Catalyst since February 2021, including as a previously funded proposer, and I’ve been involved with the Cardano development community and NFT community for about a year and a half.", "q0r": 2, "q1": "It is very hard to envision that the proposers, a two-person team will be able to design a framework for an actual workable replacement for Ideascale, especially not with the budget they have requested. I think it’s unrealistically low and probably represents less than the monthly cost IOG is paying to Ideascale currently. The community will eventually have to get there and build a replacement proposal system, but I don’t think this would set us of in the right direction.\n\nBy looking at the implementation plan we can see that a large part of the project is allocated to research, however, I consider this approach unlikely to yield the expected results. Catalyst is a global community of many thousand - if only a small percentage of the community participates in this research the results could be far superior to what only two individuals, no matter how skilled, can produce on their own. But probably most importantly this is a solution/product that interested parties in the community must participate in from the very beginning for it to stand a chance at being successful. \n\nThe intention of the project is admirable and much needed as I’ve stated in the opening of this assessment, however, I think the likelihood that anything of real value for the community will come out of this particular proposal is quite small. Not because it lacks ambition, because at this point I see it as unrealistically over-ambitious. But not impossible, that’s why I “disagree” not “strongly disagree”.\n\nAs a final note to my Feasibility assessment, I would like to add that the proposing team has selected “Yes” as the answer to the new question related to other Fund 9 proposals. As such, one item that is missing from the proposal currently, is the description of the exact commitment required by all the projects they have submitted in Fund 9. As requested by the question description this should have come with a plan on how they plan to manage the workload. These are elements that are now requested when submitting proposals. However, since the questions have just been introduced in Fund 9 I will not be deducting any points from my rating because of this. The proposers may have not fully understood what is being requested of them, but, I do recommend the team include an actual description in future submissions.\n\nThe data about every other proposal submitted by the main proposer in Fund 9 as well as previous funds is available on Lido Nation, a Catalyst data aggregator website.\n\nhttps://www.lidonation.com/en/project-catalyst/users/991 ", "q1r": 2, "q2": "I find the answers that the proposing team has given to the auditability questions to be mostly inadequate. The reporting strategy for this proposal fails to acknowledge that Catalyst is a community of tens of thousands and that there are millions of ADA holders in the world, all with an implicit interest in Catalyst, even if they haven’t engaged in the process yet. Despite this, the reporting plan presented for this proposal revolves around the few dozen people who engage regularly with the Project Catalyst After Town Halls, and Swarm events. While these are admirable grass-roots initiatives of the Catalyst community if this proposal would be funded it would have the duty to make progress reports accessible and available in full to the whole Catalyst and Cardano communities, not just to a very small subset of it.\n\nI found the best part of this proposal to be its definition of success. I am in agreement that the Catalyst community will eventually need to get to the place described, however, overall I don’t think this proposal would set us up on the right track to get there.\n\nDespite this, I really appreciate the initiative and don’t want to discourage the proposer to continue thinking about this problem. The answer is out there.", "q2r": 3, "assessor": "z_assessor_2169", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 4955, "q0": "The proposal aims to design a community managed proposal system that will eventually replace Ideascale use in Catalyst. This is a worthy problem to solve. Ideascale has many issues and is seen as problematic by a sizeable portion of the community. Although, the proposers imply the main issue is \"no waiting on APIs or access\" which to me feels an incorrect diagnosis of the problem. I would have thought the issue with ideascale is the slowness, and outright terrible sorting algorithms that make no sense (eg. sort by trending and get the most recent ideas. How do you code something SO BAD IDEASCALE. Fix your SQL queries dammit). Ahem anyway.  \n\nAssuming the problem with Ideascale is no APIs as the proposal suggests I did a quick google search for Ideascale APIs. There's a ton of endpoints available to be used: https://a.ideascale.com/api-docs/index.html. The access to these APIs may be limited, or the API may be missing features the proposers feel are needed. We don't know that, but if that's the case this should have been explained by the proposers.\n\nMoving on to fit with the challenge, this proposal is not aligned at all with the challenge. The aim of the challenge is to make developer experience on Cardano better. This proposal creates an entirely new system to manage Catalyst proposals in (doesn't have anything to do with the challenge). It will also have an API (this part relates to the challenge). It's good to have an API for proposals but that's not the main point of creating a proposal system. If you create a proposal management system to have an API you're doing something very, very wrong. First create a good proposal management system. Then build on it with an API 3rd parties can use to interact with it. Or have a brilliant new model for a proposal management system that runs entirely out of an API, but please make sure to mention that is the case. \n\nAfter reading through the proposal several times, I realized they aren't planning to build this platform, but just to design it and present their design to the community to build it in the future. This should be made much, much more clearer. ", "q0r": 1, "q1": "The project will be done by a team of two. From what I understand (this is not stated explicitly), Sean does the programming/design and Joey does everything else. Through Joey's linkedin we see that he is knowledgeable in IT project management but he has no skills in software development. The proposal I assume is written by Joey who says in risks: \"I have engaged a Programmer if something were to happen with his engagement I would need to replace his skills.\". Assuming that programmer is Sean we can deduce his connection to this project is tenuous at best. This is a project to replace Ideascale. Ideascale is a mammoth of a web application. It can't be replaced with an application built by a single developer. Good thing this is just a preliminary design but still, it is a massive job that needs a diverse team of experts to pull off properly. It needs a good understanding of the problem, which I don't think the team has, since they have not shown what problems exist in Ideascale in the proposal.\n\nWhat happens after the design is done is also not clear. The plan I assume is to build it into a complete platform with the community, so if we had some detail on how that could be achieved, that would have been a reason to have a higher rating. But there's nothing on that part other than \"seeking input and feedback via After Town Halls, Swarms and Community Zoom meetings.\" They'll share the results with Catalyst community and then what? Will they create this community of builders and build the platform? Will they market their work so others pick up where they left off? I'm not sure. When asked if they'll return to Catalyst they say \"Yes, when complete this will be a Framework that the community builders and adapt and grow to their own needs.\". That doesn't really answer any of the questions it needs to answer. \n\n\n\n\n", "q1r": 2, "q2": "There is almost no detail to how this proposal would be audited. Relating to project progress, this is all the info we're given: \"We will update the community at the Project Catalyst After Town Halls, Swarm events and Community Zoom meetings.\" They'll share information through meetings. That's good but it's certainly not enough. They'll also do a monthly report of project status. Through which communication channel? Including which details? We have no idea. \n\nAlso, where is the git repository where we can check the progress of development? As a developer myself, I'm highly critical when an open source software project fails to mention git in regards to project progress. Since this is a community system, it should have a public git repository where we can check the state of the software/design at anytime. \n\nFinally, the success of the proposal is defined very poorly. It says: \"An Front End development software product that meets the Communities needs will be evaluated and selected.\" That has nothing to do with success of the proposal. Again with this: \"An Database Product that meets the Communities Needs will be evaluated and selected.\" Only bit here that is relevant is this: \"A Framework - A Functional Front End Design and Data Model will be completed.\" So success is a front end design and a data model. That is so poorly defined that any website running an SQL server fits that success definition. \n\nThis is a terrible proposal. I suggest to the proposers to give more detail on EVERY piece of it. It is very lacking.\n\n", "q2r": 1, "assessor": "z_assessor_2643", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 729, "q0": "The proposer describes how moving to Voltaire will require a decentralized Community Proposal system. It is not clear how this adds new developers to the Cardano ecosystem it is also unclear how it creates an awesome developer experience. Proposer says the developers had expressed the need to move away from IdeaScale but does not provide evidence for that. The proposer also states that there's a lack of API in Ideascale however doesn't mention existing tools currently operate on top of Ideascale, such as cardanocataly.st. The proposer does not elaborate how the project would scale or future its sustainability. I struggle to see how the proposal aligns with the challenge setting.", "q0r": 2, "q1": "There are two proposers, Joey, the project manager for who a LinkedIn profile is provided and Sean, the developer, who’s CV is attached to the proposal, but no social media links are provided. Both would work on analyzing software that can be used and database options however it doesn't seem that they would deliver the code for the project. The project plan is divided into eight weeks where for the first 2 weeks they will review the open source and non open source applications and databases and then in the third and fourth week present the conclusions to the community of Developers for feedback. After that they propose to design a framework for using those applications in the new Catalyst Proposal Process. The budget is set at $19,000 end is logically split by the project plan. The bulk of the budget will go towards front-end and database design.  The plan does not discuss the technical aspects like the architecture, language and technologies.  The timetable seems very aggressive to find and design the front-end and back-end for something where thousands of people will use and that will cater to the Voltaire era. The proposers, however, recognize that estimating sufficient funding and time is the main risk. Considering how long it has taken to design and implement each portion of Cardano I find it difficult to believe that this project could be designed and delivered by 2 people in the space of 8 weeks. I have no confidence that this project can be delivered in time and within the budget proposed", "q1r": 2, "q2": "Auditability\nThe project timeline is provide and deliverables at each step are described. The proposal has committed to providing a monthly report with the project's status, to update the community at Catalyst Townhalls and Swarm events. Success is defined as selecting a front and that the community accepts, a database product that the community needs, and a framework for the final product. No KPI metrics are provided. I would suggest the proposers focus on more detail next time and provide meaningful metrics that can be tracked throughout.\n", "q2r": 3, "assessor": "z_assessor_2123", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1754, "q0": "The Problem Statement provides helpful context as to the desire of developers to meet the reality of a lack of APIs and quick access to Catalyst data. The desire of devs (and community members at large) is the actual connection to this Challenge. A decentralized option for Catalyst would be a monumental boost in morale and bring with it new possibilities, likely resulting in the formation of tens or even hundreds of new projects taking advantage of the available data. This positive impact on the ecosystem will drive up the number of developers, a sure value-add to the future.\n\nThe KPIs of the proposal align with those of the proposal. The first guiding question asks, \"what are the tools we need to build first?\" This foundational element of voting on ideas funded from the Catalyst treasury is surely among those primary tools. By raising the number of devs, repos on Github, and helping to add to a sense of community and conversations, Voters can see this is an excellent fit for the Challenge.\n\nThe mitigation for the first risk is weak. Perhaps your mitigation could sound more concrete by having a few conversations with potential devs who might offer to do what they can to help in a pinch. One variation might be: \"If the dev hired had to be replaced, conversations have already begun with others interested in the work...\" As potential mitigation for the second risk comes from your Auditability section: \"we will make sure to hold several After Town Halls, as well as be highly active on all socials to listen and make our best attempt at building with the community.\"", "q0r": 5, "q1": "The timetable is realistic; it is a simple plan. The details are action-verb full and offer voters every indication that the path forward is clear. Though results will be profound, that doesn't mean the time invested and the human power needs to be tremendous.\n\nThe budget lacks hourly rates, as has been asked of proposers beginning in Fund 9. If rewriting, please offer these details. Beyond being transparent about pay, you also help the community know where your head is on an hourly wage. For instance, solid project management is paid between $40-$80 per hour. Even at the low end, that is only 25 hours of Project management over 2 whole months or 3.13 hours per week. Based on this calculation alone, one might say the budget is not reasonable. Still, only 2 people are working on the project; no doubt the community manager will also be wearing another hat or two (totally reasonable on a project such as this). In that case, it makes a lot of sense to have a budget sub $20K. If rewriting, please include these wage details. Voters often reward transparency and don't seem to like guesswork.\n\nThe skill sets explained in the budget are a good fit for those introduced in the personnel section. The team is small but capable. It seems they will be an excellent fit for the work and are well connected in the ecosystem, so they will know just how to reach out to the most people about their thoughts on the project that has the potential to be central to many of our experiences on Cardano.", "q1r": 5, "q2": "The roadmap and milestones offered in Feasibility suffice. The 8-weeks of work are well defined and actionable. The team appears to have a good handle on these aspects.\n\nMonthly reporting is mentioned for a 2-month timeframe on a highly popular aspect of Cardano's collective future. Perhaps updates at the end of weeks 1, 2, 4, and 8 would be reasonable and track along with the project? Also, \"meets the community needs\" is mentioned twice. I'll just say many people will want to know your definition of that. If rewriting, consider putting effort into defining this right away (even if your answer is: \"we aren't sure, we need to talk to the community...\").\n\nThe KPIs quantify success: the products of a front end, a database, and a framework for implementation. Again, simple but profound.\n\nOne measurement of progress for the team is regular interface with the community. Details to come, to be sure! ATHs, Swarm events are the main spaces. ", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2542, "q0": "The problem this project attempts to solve has been the subject of a long discussion in the community. Virtually most parties agree that Catalyst should move on from IdeaScale due to the fact that the speed our ecosystem is moving doesn't match ideascale's speed of development which is understandable. This proposal is a good start towards that goal and the fact that the teams proposes an open source and community driven platform makes more sense and matches the decentralization goals of the Cardano ecosystem. The ability to scale here would depend mainly on the design that would be made by the team and their ability to amgage interested parties from the community in a fruitful discussion to find a good compromise on what can be done to maximize satisfaction. Furthermore, the impact of such system is huge since as the team puts it, this will allow the community to take Voltaire without having to wait for it to be handed to us.", "q0r": 5, "q1": "According to the links provided and the information given here. I think the project can be successful if the team succeeds in adding more qualified people to the team for multiple tasks like Front end and UI\\UX. While this task is not provided, the team possesses a veteran project manager that can pull it off. The plan presented in still ambiguous which the team owns up to and clearly state that they are still in the planning and choice of architecture phase. The budget isalso broken down into different components showing what will be assigned to what. Furthermore, the team mentioones briefly some risks and discuss them in a couple of line. I would recommend the team to give that part more time and to make it very detailed especially in such a complex project. It is not trivial how will the team get insights from the community discussions if they don't lead the discussions with the risks and problems any proposed solution would face. Due to the sensitivity of the infrastructure. no problems can be allowed as this would compromise treasury money and hurt Cardano's notoriarity.", "q1r": 3, "q2": "The project wants to follow the current model of Catalyst of accountability. Updates about the development would be given to the community in every catalyst meeting plus a monthly update resembling IOHK's reporting. Furthermore, the team would like to engage community member's in After Town Hall discussions. These methods are promising and have the proof of time since these made our community what it is and helped so many things happen in our ecosystem. With the open-source framework of the project and the welcoming attitude to any community member to contribute. I think the suitability of the project won't be an issue. I suggest a Wikipedia-like model where any community member can contribute and community-selected individuals can assess contributions and so on. The proposal lacks a significant roadmap but it is still understandable due to what the team attempts to accomplish since they plan to determine architecture choices after leading the necessary discussions amongst the community members. I appreciate the goals the team mentions where they attempt to make a solution that the community likes but I still would like to emphasize the importance of security and the fact that not everyone will agree on anything so compromises will need to be made and I look forward to seeing this project in further statges.", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3967, "q0": "The need for a platform for submissions of proposals is highly felt across all community members. Having ascertained the fact that, for now, Ideascale works quite well, it remains a centralized and in any case temporary third-party system.\nThe proposed solution actually seems to consist of an initial search for alternative solutions to Ideascale, rather than a solution itself. I therefore believe that it represents only a first part of a future solution and certainly not the point of arrival, for this reason I believe that the solution to the proposed problem cannot be fully considered.", "q0r": 3, "q1": "The timeline is highly reductive for a project of this caliber. The proposer talks about weeks, specifically 8 weeks or so to arrive at the point of a working framework, which it is simply too little to be credible, as projects of this caliber need longer timelines and certainly more team members.\nThe budget is evenly and well distributed on the whole.\nThe team members are two professionals, the first in Project Management, the second in Programming and Database Design. However, it is not clear, apart from a single certificate issued by the PMI, what the real experience of the first member is, as no further credentials are provided. As for the second member, he is a young programmer, perhaps even too young, as he has an experience of a few years behind him in a single company.\nOverall, I believe that the effort demonstrated for the feasibility of the solution is only partially adequate.", "q1r": 3, "q2": "The proponent declares that he will bring monthly reports, or two reports, if the estimated duration of the project is accepted, which is 8 weeks (maximum). I believe that a weekly report makes more sense at this point, as two reports would not be enough to perform an efficient audit on such a complex project.\nHowever, an overall and quite exhaustive picture of how the project will be is provided.", "q2r": 3, "assessor": "z_assessor_2502", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5501, "q0": "It is true that the developers have expressed the need to move from Idealscale to a Community Managed System, considering the delays in access to data and APIs. This has inhibited the growth to an extent. The author hence proposes a way to move from this centralized nature to a more decentralized nature and Cardano’s future will be in the hands of the community. Also, the author intends to take continuous feedback from the community regarding the design and implementation of this Proposal system, hence the community can tailor make this system according to the needs of the majority. However, the author understands the risk involved in the development and also in community engagement and acceptance, and is yet to decide on effective mitigation policies for the same. However, if the majority and the experienced community join hands in helping the author design this system, it could have a colossal impact on the entire funding system. But another concern to me a  reader would be, \"Is the community that is still young as ours, ready to maintain such a huge system, without any governance? Are we ready to step up?\".", "q0r": 4, "q1": "Considering the action plan and other feasibility metrics of the proposal, there seems to be some promising work done from that perspective. The author mentions that this proposal is to develop a system based on the framework selected through research and feedback sessions. The team would return for more funding if required. The roadmap laid in front of us is pretty concrete and the timeline of 2 months looks promising and feasible. But, to develop such a huge system, would 2 developers suffice?. Not sure about that, but the profile of both the developers sure looks fantastic and attractive and quite capable of achieving something like this. The budget does not dent the challenge's funding in any way, and the breakdown of even such a small amount is pretty credible and justified. Considering the team requires such small funding to pull off something of this stature, it is clearly a win-win situation for the community, and keeping in mind the little concerns mentioned above, I score a 4 out of 5 for the feasibility metrics.", "q1r": 4, "q2": "For a project of such kind, the community interaction would be continuous, and hence getting regular updates shouldn't be a problem for the auditors. The author also mentions about providing monthly reports on project status and giving updates on Town Halls, Swarm events, and Community Zoom meetings. These measures should be plentiful for the community to keep a close eye on the project developments. The success metrics are also transparent and in alignment with what the proposal is trying to achieve in this challenge. The functional front-end and database tailormade to the community's requirements and a framework governing these would be the eventual end goal of the project. The acceptance of this system is something that should be easy to measure once the system is ready to use. Given the completeness of the metrics, auditing should be a fairly simple and fast process for the community. Hence I score full marks for this section, and on successful implementation, if the community accepts the system, then the future funding rounds would be something to look forward to.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 10793, "q0": "The proposal describes the method chosen to address the Developer ecosystem's challenge: a community-managed database and proposal system that can assist Cardano in eliminating the wait for APIs and data access on Ideascale. With the purpose of decentralizing the Cardano network, this project provides benefits and evidence to ensure that developers may be even more creative and innovative in a community-run environment. This solution DOES ADDRESS the challenge because it demonstrates the ability to expand the ecosystem and strengthen the community's thinking. However, I don't appreciate that you identify the major risks but do not attempt to address them. Funding, time, human resources, and acceptance are all challenges that will directly and substantially influence your project. Therefore if you do not plan for strategies to mitigate their impact, investors will be unable to invest in your project with confidence. Please think about it and provide further information.\n", "q0r": 4, "q1": "This project's execution plan is broken into 8 weeks, with distinct actions explained in detail. The budget's expense items are clearly listed and correspond to each indicated activity. However, the Feasibility section still contains several flaws that must be addressed. First, instead of just \"see attached resume,\" please briefly describe your experience and the rest of your team. Second, please include workload management in this Feasibility section if you or another team member is participating in other projects in this fund 9.\n", "q1r": 4, "q2": "Like the previous two sections, your final section contains the necessary information but is not enough. You inform people that monthly reports would be provided to the community on the After-Town Catalyst Project, Swarm events, and Zoom Community meetings, but you do not present them with your KPIs for this project. So, on what will people rely on tracking the progress of the Community Managed Proposal System? Please examine and add to your proposal to make it complete.\n", "q2r": 4, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14564, "q0": "The proposal intends to build a Catalyst Community Proposal System having a Community owned Database to offer developers the freedom to access more data which will encourage innovation and development. The proposing team presents their idea and the reason why it’s a reasonable and necessary thing to do in a clear and transparent way. This presentation is very well written and it’s closely aligned with the challenge. But in my opinion, it will be stronger and more convincing if the proposal has some KPIs to measure the impact of this project. Two possible risks are anticipated (Estimating Sufficient Funding and Time, and Community Engagement and Acceptance), however, some sensible and detailed solutions to mitigating the risks are missing. My rating is 4.", "q0r": 4, "q1": " As planned, the project will be conducted during 8 weeks. The milestones stated in the roadmap come with clear tasks to be completed after each phase which may last one or several weeks. This presentation is well-written and organized, but it would be even better if the proposal includes some expected results to be achieved at the end of each phase. Speaking of the budget, the team splits it into 5 components. More effect could have been made here to explain comprehensively how the team has come up with these amounts of requested funds. As for the team members, I notice that they have related skills and experience, which can be verified by their LinkedIn or resume. My rating is 4.", "q1r": 4, "q2": "The proposal presents an appropriate way to track the project progress and development with monthly reporting of project status. I just wonder what details they are going to include in the report to see if it’s a feasible thing to do. The team is to update the community at the Project Catalyst After Town Halls, Swarm events and Community Zoom meetings, which I find a very good point as it ensures the transparency of the project.  If this project is to be carried out successfully, I believe the team should give a clear and quantitative description of their success, with specific KPIs so that the community can easily audit their project. My rating is 4.", "q2r": 4, "assessor": "z_assessor_4072", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Research n Compare Non Open Source to Open-Source options for a Community Database and systems.\nCreate a Framework that would allow developers access to data so they can build and innovate quickly.", "experience": "PMP (Project Management Professional) see attached \nProject Management and Team Building. Recruited and managed diverse groups of application developers, network engineers and Security Specialist to create, manage and migrate Databases and Applications to Cloud Base Services"}