{"id": 421770, "author": "agocorona", "title": "Fix Web3 rabbit holes", "url": "https://cardano.ideascale.com/a/dtd/421770-48088", "category": 26597, "amount": 61440, "description": "Web3 can manage transactions decentralized without human intervention, but the computer infrastructure depends on human intervention for maintenance. This induces centralization", "f6_no_assessments": 8, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 966, "q0": "The project aims to create a Haskell development framework for a more approachable dApp, smart contract and development process. According to the submitter, this would also address and potentially diminish the creation of centralised infrastructure on Cardano, such as we have seen on other blockchains. A development that could also be very beneficial to the ecosystem of our blockchain.\n\nI would advise any Cardano dev reading this assessment to check out the full text of this proposal as it brings some very interesting ideas to the table.\n\nIf adopted by a large enough number of developers from the community the project has a chance to make a huge difference in the Cardano developer environment. However that is a big “if”, and the flip side of this is that we end up with code that will just sit mostly unused and unreferenced in a Github repo. What I would have liked to see from this proposal, is the submitter present a plan to popularise the solution he plans to develop. It’s one of the few things missing from an otherwise very well-written and thought-out proposal. Still, given the potentially high contribution of this project to the Cardano developer space I have not subtracted any point from my rating for this.\n\nThe idea fits very well with the scope of the Developer Ecosystem challenge and its objectives. The proposed framework would, if adopted, provide structure and enable much faster deployment of code.\n\nIt’s worth mentioning that the project has tentative plans for a phase 2, which would allow users to buy or sell computer resources. This is planned to happen through the issuance of a native token, specific to this marketplace. This again could be a positive development for the ecosystem of our blockchain as such a marketplace could potentially attract users without a direct interest in Cardano, but who would nonetheless use and transact on our blockchain if the token of this marketplace would be a Cardano native token. The \"Phase 2\" of the project is not presented in detail in this proposal, as it’s not in the scope, but it’s presented enough to be able to see that it could also constitute a very promising development. But, of course, phase 1, the scope of this proposal needs to happen first.\n\nNote on the background of the assessor: I’ve been managing a mobile app development studio for 5+ years and have been involved with the Cardano dev community since March 2021. I’ve also been project-managing Cardano devs directly for the last year. I have been and remain a Cardano holder, interested in the development of our blockchain in the best possible direction. That is the background from which I'm writing this assessment. ", "q0r": 5, "q1": "The implementation plan is logically structured and offers a very good overview of the work that would need to be done, it covers 16 months of work.\n\nThe developer is a previously funded Project Catalyst proposer and after checking out his GitHub repo I’ve noticed that he has directly contributed code to IOHK repos in the past as well as worked for more than a year on the Haskell repos that were the subject of his Fund 3 funded proposal. From the way this proposal is presented, it’s very clear that a lot of thought has already gone into this project and given the presented credentials I have very little doubt that it will be successfully delivered if funded.\n\nGiven that there is only one person planned to work on this project the budget calculations are straightforward and every step from the implementation plan is assigned a number of months it would take to complete and the total is multiplied by 4h/day @ $32/h.\nGiven that the current rate for Plutus developers is around $95 - $120/h I find the hourly rate of $32/h quoted to be very reasonable, perhaps even a bit too low. But, because only 4h/day are budgeted for, it looks like this is just a part-time gig and potentially a passion project, so I’m not worried about the low pay affecting the feasibility of the project.\n\n“Yes” has been selected as the answer to the new question related to work on previously funded Catalyst proposals. The proposer only has one previously funded proposal, from Fund 3 and has indicated that work on it will be completed by September, meaning that it won’t interfere with this proposal.", "q1r": 5, "q2": "The auditability section is the least developed section of this proposal. That doesn't necessarily mean that it's bad it's just that it's not on par with the rest of the presentation. Being an open-source project, GitHub is presented as the primary source of keeping track of development. However, I really would have liked to see a more proactive role in spreading the word about the framework the project intends to develop and the reports on the progress of the proposal could also play a role in that. \n\nThe need to promote the output of this project and to get developers using this potentially very promising framework is also made evident by the definition of success given in the proposal which only describes one or two major projects adopting the framework - I think this could be a lot higher.", "q2r": 4, "assessor": "z_assessor_2169", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 736, "q0": "Yes, the proposer identifies an interesting problem that needs solving that is running Haskell and Plutus applications on-demand, that could start and stop and store the states in between. This aims to create a solution where Cardano could run anywhere, not just on servers. The proposed framework could appeal to experienced Haskell developers and developers looking for the forefront of blockchain Technology who could take blockchain industry to the next level. In layman's terms this sounds like a “Herouku” type instance of the Cardano node that could be deployed anywhere. The proposer is clearly trying to appeal to developers. The solution would be scalable as it would be published as open-source for others to use and the proposer will come back for additional funding if this is found to be useful for the community.", "q0r": 5, "q1": "Yes, The Proposal provides evidence of relevant skills, his name is Alberto, and he includes links to his Twitter profile and Github repo. One of his GitHub repos has more than 600 stars and has been in development for over eight years. He is also a contributor to the plutus-apps repo which is used by many developers,  myself included. The delivery is broken down into two phases and phase one is the subject of this proposal. Phase one is further divided into 6 stages, and detail is provided about what will be delivered in each one. The timeframe for delivery is 16 months and Alberto will do all the work. Alberto is planning to work on the project 4 hours a day over 16 months and charge $32 per hour. This is a competitive rate for a Haskell developer.  Alberto also provides links to the work that has already been done on this project which is encouraging to see. Alberto mentions a number of risks to delivery however they are all very detailed about how the framework would work, and none of them seem road-blocking to the overall delivery.  A lot of thought has gone into designing this proposal and part of the work has already been done. I think there's a very good chance that Alberto will be able to deliver what he sets out.", "q1r": 5, "q2": "Yes, a clear set of metrics have been provided. The project will be open-sourced so that anyone can track progress. Updates will be published on Alberto's Github and Twitter profiles and the first prototype will be published during the project's first half and feedback from the developer community. Also, interest will be measured by the number of forks and stars on the GitHub repo. Success will be measured by having one or two major projects take advantage of the platform. I think given Alberto's experience, the laid out metrics, and communication channels, the community will not have any problem auditing this project.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 2107, "q0": "This proposal presents a very practical problem that is that Web3 can manage decentralized transactions without human intervention, but the computer infrastructure depends on human intervention. for maintenance. This creates focus. The solution to this problem is a Haskell framework for writing DApps and blockchain infrastructure: Can be started, stopped, and moved at runtime. Runs in the web server and browser, regardless of the address. A great idea that identified a very topical problem and offered a potential solution. If this solution is successfully implemented, it will help to overcome the risk of centralization at the dominant IT service providers, because the intelligence for migration, failover, scalability, backups, etc., are built into the app. In addition, the framework uses Haskell, because the language has the necessary tools for this development: continuity, pure state, and others. This is the language of the Cardano infrastructure. That will support and enhance the Cardano technical approach.", "q0r": 5, "q1": "The plan of this project consists of 2 phases, within the scope of this proposal is phase 1. And as the proponent stated in order to reduce costs, the implementation of this proposal has only one author. However, there are some areas where this feasibility has not been satisfactorily explained, such as the roadmap presented in 8 months (phase 1) but the requested budget is used in 16 months. The entire request budget is used to pay the proposer as he will perform the tasks given in the roadmap section. The cost is determined as follows: ($32/hour * 4 hours/day * 30 days/month * 16 months = $61,440). If costs are needed for 16 months he needs to list what are the activities of phase 2. Besides, his explanation of himself is also very little, we are provided with a few links to his Twitter and Github page. It would be more convincing if this proposal provided more details about his professional background, examples of work inside and outside of our ecosystem that he has developed. Although he provided a few links to check, I think he needs to be more clear. Because this proposal was only made by him, the clearer it is, the more likely we are to assess his competence in this project. I think it will be more convincing if he can find more teammates to speed up the project. Because 16 months is a long time for a project like this.", "q1r": 2, "q2": "Some indicators are given to assess the progress of the proposal such as:\n-A first prototype in the first half of the project will be released for feedback from the developer community\n-The number of GitHub project likes, number of releases, number of branches\nIt will be easy for the community to track the progress of the proposal as it is open source and any information will be updated on the author's GitHub profile and Twitter profile.\nThe success of the project is presented in a very simple way: The goal is to see 1 or 2 large projects take advantage of the platform.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4414, "q0": "The proposal addresses the goal set out in the Challenge, namely fixing Web3 rabbit holes that are directly related to the developer ecosystem. You have identified the problem to be solved here there is still a centralization of Web3-related computing infrastructure. This proposal has a direct impact on the Cardano ecosystem, specifically, it adds value to the Cardano ecosystem. Your intention is very clear, evident in the proposal, which is to centralize processing infrastructure (centralized servers and information technology providers, etc...). It is built on top of the Cardano blockchain infrastructure (Haskell programming language). I understand Web3 is now considered decentralized, but the things that makeup Web3 are not. I think that if this proposal is successfully applied in practice, it can bring Web3 to a completely decentralized state. This means a lot in the community as our future goal is to create a decentralized world and society. The main idea in this proposal is very practical and necessary to be brought to life. I strongly agree with your suggestion. I vote 5 stars.", "q0r": 5, "q1": "I know you are a person with a lot of experience involved in Haskell programming since 2005, worked at Fund 3 Catalyst, and contributed to the Plutus application framework. It can be said that you have a very good understanding of the Cardano blockchain technology and the Haskell/Plutus language. I feel quite reassured that the person proposing has as much experience and expertise as you. The community can rely on this point to evaluate the feasibility and believe in the team. I have seen your profile on Github, and Twitter, what I wish is that you can make your identity more public through other links on social networks (Linkedin, Facebook, etc...), to the community can make it more convenient to look up. That is the opinion that I want to contribute to increasing the feasibility of the proposal as well as to gain the community's trust in the proposal and the person who implements the proposal.\nThe cost to implement this proposal is listed by you monthly, and the duration of the proposal implementation lasts about 16 months. The budget breakdown is pretty straightforward, and it seems logical to the goal. I assume, if Catalyst hasn't funded Fund 9 yet, will you continue to implement the proposal or not (even implementing the proposal very slowly)? Do you receive other funding sources from other organizations to support the work?\nThe proposed plan and implementation are presented in a certain order. This means that you have a solid understanding of the steps that need to be taken to create a decentralized proposal for Web3. Do you have implementation plan updates during the proposal implementation? I understand that this is a common practice among software developers. However, while I still have advice for you, try to update the progress of the work to the community as soon as possible (including phase 2 of this project).\nIn terms of resources needed to execute, the team currently has only one member, you. That means you will do almost all the work that lasts 16 months. I don't deny your ability to do it. But can you be more specific about the backup plan when you have personal problems and cannot continue to implement the proposal, who will this proposal be made by? Or will it be delayed then? This is another important factor to demonstrate the feasibility of the proposal and the trust of the community, ensuring that the proposal is implemented on schedule. Recently, I have analyzed the human resources required for implementation. Why don't you need more support from colleagues or volunteers from the community? I think that will make the substance proposal roll out faster.\nOn the technical side, I have full confidence in you because you have a lot of experience and good technical skills to implement this proposal. It wouldn't be an exaggeration to assume that your technical skills are on par with that of an expert - because you have worked in this field for a long time and successfully contributed to previous projects. With techniques related to Haskell/Plutus programming, web programming, and how to build Dapps, etc. I believe that when you fully apply the technology and language used, the topic will make the topic better. successfully produced and quickly applied in practice, bringing benefits to the community and making society better according to Charles Hoskinson's view.\nIn terms of challenges and risks associated with implementation. I completely agree with the risks that you mentioned in the proposal, they are actually technical risks and you completely have the professional skills to overcome those risks. . I offer my opinion on financial risks: You should take into account the budget risk that a downturn in the cryptocurrency market causes Ada to slip, so my advice to For this risk, you should carefully consider the implementation budget to ensure that if the proposal is funded, there will be enough funding for implementation.\nRecently, my questions and comments have been positive about the feasibility of the proposal. Looking forward to your reference. I vote 4 stars.", "q1r": 4, "q2": "The progress of the work has been outlined preliminary, including milestones, but unfortunately, I do not see milestones and roadmaps associated with specific months of the year. This makes it difficult for the community to assess the progress of the work in detail, which affects the transparency and auditability of the proposal. Therefore, my advice is to be more specific about the milestone roadmap of the proposal by attaching milestones to be accomplished with specific months of the year (January, February, etc... - here is just an example). In addition, I also do not see the appearance of performance indicators (KPIs) and key metrics. We all know that these two metrics play a very important role in the audit, especially as it proves the transparency and auditability of the proposal. Can you explain why you don't include these two indicators in the proposal to better clarify transparency and auditability? My advice is to quickly include KPIs and key metrics in your proposal. This is very necessary. As for what success looks like, describing your definition of success may seem sketchy when only stating the goal is to see 1 or 2 large projects leveraging the platform. I hope your definition of success is more detailed and specific because this proposal is a proposal that has many technical elements but has a great impact on the social community. if it's done well. My advice is that you should think more to have a specific and appropriate definition of success based on the evaluation factor. Perhaps the plus point that I see you have done is that you describe the problem clearly and understandably and include the solution (I see that you put a lot of effort into identifying the problem and coming up with a solution to solve the problem).\nAfter all, I think you should find a way to both enhance the actual performance of the proposal (which is good and even better), while also demonstrating the auditability and transparency of the proposal. My current position is that I disagree with the transparency of the proposal. We hope that you will carefully consider my comments and consider them a positive contribution to improving the proposal. I wish you success.", "q2r": 2, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4483, "q0": "This proposal looks very interesting but I consider it speculative. The discussion whether we need a Haskell framework that allows web-based dApps to start, stop & migrate at runtime is definitely worth having. Attracting more Haskell programmers and allowing Haskell experts to work with a full stack suite of products on Cardano are definitely positives worth having. On the other hand, as there is a bottleneck of available Haskell talent for Plutus smart contract development, migrating best practice solutions away from the grasp of js/node savvy devs and concentrating the ability to develop on Cardano in the hands of a few Haskell experts. The discussion about the rabbit hole is in my opinion more relevant for Ethereum, where companies like the mentioned Infura are possible chokepoints of the infrastructure, whereas Cardano has from the very beginning favored open source tooling from front to back. Even if some code base might be maintained by Meta or Google currently, there is no obvious rabbit hole at the moment that I would consider worth this large chunk of over 6% of the challenge category's budget for. As a proof of concept with a much lower budget, I would have loved to see the existing the exciting \"transient Haskell\" project on Github (not by the proposer) expanded and shared across more contributors. This is a great direction for speculative development, as mentioned, but in my humble opinion not solving any immediate pain points that developers face for the current stage of the ecosystem.", "q0r": 3, "q1": "The proposer has not provided a detailed background, and apart from experience with Haskell since 2005 and a proposal in Fund-3 it is difficult to judge from the information provided whether the skills to realize this ambitious project are already there. The Github profile is only moderately active, and the teaser content currently does not compile. The hourly rate seems quite low for an experienced Haskell programmer, and the timeline is detailed but could have been populated with a higher granularity of milestones to help the assessors and voters of this proposal to gauge the feasibility of the implementation success. As I mentioned in the previous section, it would have been preferable to propose a proof of concept in my opinion, which should show some working code and good use of the WebAssembly and JavaScript compilers with more details about the intended workflow. Project success is likely as the proposer is willing to commit almost 2000 hours to the project and demonstrates a good grasp of web development and blockchain concepts, this paired with strong Haskell skills should be very useful to produce interesting findings and some kind of working prototype at the very least. This would be especially true if some collaborators can be found that have existing dApp use cases that may benefit from the robustness of the proposed solution.", "q1r": 4, "q2": "It is great that the proposer is sharing progress about their work since Fund-3 on Twitter and Github and making all code open source. This spirit of transparency should be embraced by more proposers and is very positive for the likely auditability and clarity of the implementation and feedback of its progress. However, more ambitious goals especially for earlier milestones could have been chosen. The proposer hopes that 1 or 2 major projects will use the platform once finished, it might make sense to already set this deliverable for the prototype after the first half of the roadmap and then have some additional deliverables like forks, downloads or other measures of collaborating and actually deploying the developed product. ", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8937, "q0": "As we have seen there are lack of Haskell developers already in the current market, and there are even tasks that will create a extra work for developers such migration, failover, scalability, backup on the server has to be regularly checked, which will definitely be a barrier to concentrate on project works, Hence to counter such head aches the proposer wants to develop a framework that can automatically start, stop & migrate at runtime. Run in servers and Web browsers, location-independent addressed, so this task helps to prevent continuous checks on the server, Hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task is not easy to achieve because the web framework that will be provided has to support all the web browser which are currently present in the market , where it has to interact with all the nodes effectively to run the framework and it should work for unique identifiers which are location and IP independent, However the proposer's has already built the framework testing and optimization of API's is needed which definitely will be achievable without much barriers affecting it, the team has also provided proven experience where the project fund 3 will be completed by September, Hence with given experience and plan presented it is highly likely this proposal will be implemented successfully .", "q1r": 4, "q2": "The audit has clear goal to reduce the humanly work working on a server maintenance, audit has clearly mentioned on how the framework has already been created where some optimization on API's is left out, audit has displayed the proven experience of the team by completing the project by september which was funded during f3 project. the proposer wants to develop the team depending on the requirement of the project to maximize the use of budget.\nAudit even contains detailed budget breaking idea for different phases, well structured timeline to make the project more punctual, hence with key indicator to continuously update on the progress of the project, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10794, "q0": "This proposal focuses on establishing a Haskell framework for writing DApps as well as writing blockchain infrastructure to continue and address difficulties raised by Fund 3's project \"Write DApps as Continuous Workflows.\" A range of applications is supplied, along with a full explanation of the technology and a particular remark for programmers. You show everyone that this framework can fully support and expand Cardano's engineering methodology, as well as bring developers out of \"rabbit holes.\" Your approach ADDRESS the challenge, given the great experiences this project may provide developers while working in the blockchain environment. I appreciate your serious attitude and thorough preparation in anticipating the major risks that will be faced in the future of this project. Although the outcomes of your project in Fund 3 solved many obstacles for framework development, you still highlighted further performance concerns created by IPFS and IPNS to find solutions to reduce fit. Furthermore, undeveloped schedulers and a lack of specification for appropriately scheduling requests are predictable dangers that can be readily solved. There's no reason why I shouldn't give you 5 points after reading such a good Impact section.", "q0r": 5, "q1": "After spending a long time working on the project at Fund 3 and being ready to approach the completion phase this September, it appears that you have run into some operational cost issues because the suggested investment does not adhere to the real expenditure level. And you've gathered enough experience at this fund to warrant a budget for your 16 months of part-time work. Your plan outlines the major activities involved in project implementation and the time required to complete them. I admire your determination to work alone on such a specialist project. However, while the community may already be familiar with you due to the project funded in fund 3, I would like you to write a few sentences to identify yourself and talk about your experience in making this proposal a reality, as well as to let the new members know who you are.\n", "q1r": 5, "q2": "Usually, I wouldn't award a high score in the Auditability part if the content was too brief, but I still want to give you 5 points because you provide all of the relevant information, from how you report project progress to the community to the KPIs and project success targets. The quick explanation of why you did not devise a set measure persuaded me.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12978, "q0": "The proposal is about making the computer infrastructure decentralized by A Haskell framework . Web3 can handle transactions independently without human involvement, But the computer infrastructure needs the human involvement which makes the system centralized . But with the help of the framework we  could start, halt, and migrate DApps and blockchain infrastructure at runtime. run in servers and web browsers, addressed regardless of location .The proposal identifies the problem that must be addressed. There is no question that the proposal improves the Cardano ecosystem. After looking over the proposal The proposal's main metrics and objectives line up with the outlined challenge conditions.\n", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the proposal. The proposal will have 2 Phases .\nThe proposer have mentioned one phase in very detailed way which includes \nOptimizing thread state serialization ,improving API interface , Using the Web interface of IPFS research  , Development/testing of the IPNS-based \n and P2P load balancing etc. The timescale provided by the proposal appears to be quite realistic, and the proposal's budget breakdown is described in great detail. The proposer has also provided information about the team who will be implementing the proposal as well as the expertise required to do so. The proposal has taken into account both the risks and obstacles to the project's successful implementation. After reviewing the idea, I fully agree that it is likely to be implemented successfully.", "q1r": 5, "q2": "The progress of the proposal can be see on the Github profile of the proposer and the twitter profile ,During the initial phase of the project, a first prototype will be made available for developer community feedback.The challenge has been described by the proposer in a way that is both clear and understandable, and the strategy for its successful implementation is also described. The proposal's success is determined by the Metrices/Kpi listed there.\n", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A Haskell framework for writing DApps and blockchain infrastructure which: Could start, stop & migrate at runtime. Run in servers and Web browsers, location-independent addressed", "experience": "Programming in Haskell since 2005\nhttps://github.com/agocorona\nWork in Fund3 : \"Write DApps as continuous workflows\"\nContributor to the Plutus Application Framework"}