{"id": 421844, "author": "seedstars", "title": "Accelerator: FT Challenge Startups", "url": "https://cardano.ideascale.com/a/dtd/421844-48088", "category": 26597, "amount": 100000, "description": "200 companies applied to the FT x Cardano Challenge (F7) and a small % of the applications were supported\n\n53 in the bootcamps\n24 of the 53 participants to the 3-month accelerators beginning in August\n", "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 739, "q0": "Yes, the proposal identifies the challenge of attracting developers to the Cardano ecosystem. By providing professional, entrepreneurial support, they aim to attract new developers and create a sense of community support for the existing developers. They believe that by providing this support to developers, they will be more inclined to join Cardano and build on the Cardano Blockchain. For the project to scale, it will need additional resources, as it is a very high labor-intensive proposition to provide personal support. The proposers mention that this is a stand-alone deliverable, but should it be well-received, they will come back for additional funding to run more sessions.  Having a collaboration between Cardano,  Seedstars and Financial Times creates a good image for the Cardano ecosystem and has the potential to attract new talent.", "q0r": 4, "q1": "The proposals provide a list of individuals who will be working on a project that have also attached a video from the previous iteration on this project that was funded in Fund 7 where a number of people appear from IOHK, Seedstars and Financial Times.  However, there are no links provided to social media to verify the individuals on the project. A budget of $100,000 is requested and broken down into individual components, the largest component of the budget $47,000 is allocated to the Investor Readiness program that will have five boot camps, three investment session,s two networking events, and five hot topic sessions. It would have been nice to see the schedule of each of these sessions, and I suggest the proposers provide this in the future.  It is not possible to validate whether the budget is adequate or not as no hourly rate is provided or how they justify the cost for each of the sessions. The program will run over four months where the first month is phase 0 and includes preparation, sourcing and selection of candidates and phase 1 is a three-month virtual program that unites entrepreneurs and focuses on the right content, activities, tools, and methods to help aspiring teams to build and scale their ideas. The proposal provides a good example of what the participants in the program will do during the three months.  They include such things as getting to the minimum viable product (MVP), creating business metrics for growth, setting up KPIs, getting ready for fundraising, defining evaluations, and managing talent. The proposal highlights several risks such as lack of interest from entrepreneurs,  participants hesitating to learn online and specific training needs of startups.  The proposal then explains how they would mitigate these risks by focusing on community outreach and leveraging the contact network from Seedstars.  Overall, I think the proposers should not have any problem implementing this project, given the backing from Cardano, Seedstars and Financial Times; however, I have reservations about how the budget set.", "q1r": 4, "q2": "The proposal provides a roadmap and what they want to achieve. The proposer has provided detailed KPIs that would be measured every month and submitted to the community. 15 KPI metrics, are well beyond the average of other proposals that I have reviewed. The success metrics are defined to have 12 startups graduating from the program. I think the community will be able to audit this proposal. ", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thanks for the feedback! Really useful and noted on the comments regarding the budget."}, {"id": 1570, "q0": "This is a very detailed and ambitious mentoring program where funds are used by experts in education and mentoring. With both the fact that a program like this has been done before and the proposers have experience and that there are already a lot of potential applicants, this proposal is likely to have a notably high impact in comparison to the money invested. I think it fits perfectly into the challenge and adresses it well.", "q0r": 5, "q1": "The proposers directly show their competencies, by the previously run program and the really well-made project and implementation plan. They introduce their project team, explain the budget reasonably and the amount requested seems appropriate for such a program. Maybe the budget could be supplemented by an hourly estimation of the single tasks however. A detailed risk/mitigation strategy discussion is presented and the general technicalities are explained. A time-bound roadmap is presented.", "q1r": 4, "q2": "The problem description is clear and the solution is defined in an extensive, descriptive and clear manner. Some auditability for the old projects is provided so it is credible that this will be done continuously. The metrics are very detailed and can be related to and the detailed roadmap enables step by step tracking of the project. Good job!", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1, "reply": "Really happy to see the feedback, thanks so much! Noted on the comments regarding detailing hourly budgeting information."}, {"id": 3295, "q0": "(vPAs, please note that this duplicate proposal has been referred to IOG for filtering, however at this point both proposals remain.  This assessment is being submitted to both and may be self-similar if one of the proposals is not removed.  Thanks for your consideration.) The first thing we need to get into is alignment with the challenge setting.  There is an assumption that \"development\" means \"coding\", but a better description would be that it means \"specialized knowledge for creating things\".  Obviously in Cardano most things are built from code, so coding and development become synonymous, but we should also be considering the parts of this challenge that target \"support\" for those who would build in this ecosystem, and in particular, this statement from the Challenge Brief: \"There would be a bigger talent pool of developers that Catalyst projects can collaborate with and turn project concepts/Proof of concept into successful protocols...\"  This is where seedstars comes into alignment with this challenge, by building up start up ventures with training and tools to be better applicants to Catalyst, better targets for seed funding, and better able in general to articulate and achieve their potential.\n\nThe seedstars platform itself leverages an interesting algorithm that they use to help ventures create an \"Investment Readiness Score\" (and by proxy, they have training for investors to help them structure an investment based on using the score as well).  The score creates a data driven approach for proposers to structure a venture and its KPIs in a way that increases the likelihood of success.  On this note, there was one area of the proposal where I would have appreciated more clarity, (and since the team indicates they will be approaching Catalyst again in the future I hope they pursue this) I would love to see a list of the current graduates of the Blockchain challenge, and just generally any data supporting the impact the Fund7 proposals had, which are identical to these ones.  I was able to dig into their website and find 5 finalists (though the proposal indicates there were 12 across 2 accelerators), one of which I recognized as a successful Catalyst endeavor (Snapbrilia) but the rest were ??  For a project that leans into data driven decision making, it is an unfortunate oversight here that such key performance indicators were not succinctly organized and presented so that voters could better inform their own decision.  What has been the impact on Catalyst or Cardano from this venture?\n\nWhile the lack of metrics to show how impactful this project has been cause me to lower the rating by one star, I do believe, just as I did in Fund7, that they have described a proposal that could provide excellent tooling and resources to those building on Catalyst and Cardano, and so I give it 4 stars for Impact.", "q0r": 4, "q1": "There is literally zero doubt that this team can deliver this product.  They have spent 9 years developing and delivering their principles and methods, and they had 100s of applicants to their previous events for the Blockchain challenge.  The description for this iteration doesn't seem to have varied at all except that the team has added a few new faces.\n\nWhat they describe here is an extremely detailed series of onboarding workshops, indepth mentoring and training, and an elegant measurement algo that helps connect all these elements together into an integrated vision for each venture to pursue full realization of its potential, and to shine the best light on them as attractive investments.\n\nThe budget and timeline were clear, but may benefit from added granularity.  That they successfully concluded the previous round with similar budget numbers (the only real difference I spotted was the addition of a $15k administrative budget that seems targeted at an advisory role in Catalyst) is a good indicator that these numbers are accurate, and they certainly seem fair to me.  They clearly state that this is a 4 month funding cycle, 1 month for setup and 3 for running the challenge and finalizing the results, and every milestone they note is also a deliverable.\n\nBecause they have provided proof of the work done to date, and show a deep engagement and understanding of the ins and outs of the project and its goals, I believe this is a project with high likelihood of success, and give it a full 5 stars for Feasibility.", "q1r": 5, "q2": "Given that one of the key principles of this project is to help innovators pin down projects to measurable goals and outcomes, you would expect them to put together a good list of KPIs and they haven't disappointed.  The list of milestones doubles well as a series of deliverables over the course of the four months, far more than is needed to populate the monthly progress reports.\n\nThe team has made themselves available in ATHs and some swarm meetings, and due to the nature of their project, they have a dedicated part of the team for communicating with the community.  As well they seem to be in close collaboration with Catalyst advisors as well, so there is an expectation that transparency and availability won't be an issue.\n\nOne place where I think their metrics could be improved, and my statement under Impact touches on this, is that they include success metrics here regarding the 12 proposers attending and completing the workshops...which are great progress metrics, but success for this project is something else.  If I may make a recommendation, it would be nice to see a set of sub-metrics for these graduates that indicate how many proposals they have submitted to Catalyst, what kinds of rankings these proposals earned from assessors, what their voting results and approval ratings they receive are, and finally the $amount of funding they receive from Catalyst (it is important those last two are treated separately, due to approval and funding being two separate metrics in Catalyst).  An accelerator should be measured by whether applicants gain an advantage over their peers in an ecosystem, and in Catalyst, that means innovation funding.  Alternatively, if graduates receive investment from another source, a metric should be included to indicate any investment captured for ventures building on Cardano.\n\nBecause the progress reporting metrics are strong and the team makes themselves accountable to the community, I believe this project has a strong auditability component that will keep it on track.  However I am reducing auditability by one star due to a lack of metrics which accurately measure the impact, indeed the success, of the project.  4 Stars.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1, "reply": "Thanks for the feedback - we also note your concerns about this being a duplicate proposal. The two proposals utilise the same methodology but the pipeline of beneficiaries is different. This one will specifically source participants from an existing pipeline of candidates we were unable to serve in the previous Fund. The other one will source entirely new participants, which entails a different scope of sourcing activities."}, {"id": 5914, "q0": "This is a potential proposition, it is the successor to 2 accelerators funded at fund7. 24 out of 53 startups were selected to participate in 2 accelerators (fund 7) (starting in August 2022). This proposal as a supplementary program, it will support a number of other applicants, increasing the number of selected startups, so that the number does not stop at 24.\nBesides, it provides professional startup support to startups (through Seedstars programs). Developers know how to grow, but may not be experts at building and growing businesses. Providing this support to developers will get them more involved and building on the Cardano Blockchain more. Because of the above reasons, I am confident that this project will effectively solve the challenge.", "q0r": 5, "q1": "Team information has been provided. Your team consists of 5 members, they include: entrepreneur, investment analyst, brand & communication director, IT specialist,... . Based on the information provided, they have sufficient knowledge, experience and skills to carry out this project. However, it would be even better if you provide links to their profiles (linkedin, telegram,...). This will help the information about the team become more transparent. More specifically, Seedstars has many years of experience in supporting emerging market entrepreneurs (9 years, 75 countries, more than 37,000 entrepreneurs,...). This will be a clear demonstration of the capabilities of this team. With the information about the team provided, I fully believe they have the ability to implement this project easily.\nA detailed roadmap has been provided, which is divided into 2 phases and lasts for 4 months. I am very impressed with the activities/services of the project. They are very detailed and complete, it makes it easy for people to visualize what activities and work you will do. The budget allocation has been provided, you have calculated quite specifically. However, you can also clarify it further by breaking down the budget. I have a few suggestions that may help you: determine the number of people involved in each task, the number of hours worked,... . That will make the budget clearer, more transparent, and help people have more confidence in the project.\nAlso, I commend you for identifying the risks, challenges and ways to mitigate them. They are quite detailed and complete. That will be the foundation, a solid basis for the project to develop in the long run. In addition, it also shows me your meticulousness and enthusiasm in this project.", "q1r": 4, "q2": "Criteria to evaluate the progress and success of the project have been provided, which includes specific numbers. Progress reports will be shared with the Cardano community through monthly submissions and through regular community meetings. You did a great job in this part.\nThe information provided is completely enough for people to evaluate the success of the project. This is a big project, it brings enormous value to the community. If implemented successfully, it will attract a lot of entrepreneurs, businesses and especially developers to Cardano. From there, they will build more on Cardano, fueling the ever-growing Cardano ecosystem. I am very confident in the success of this project, I will definitely vote for you, thanks for the great proposal!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Really happy to see this positive feedback. Thanks! The suggestion to include further details around the budget is also noted."}, {"id": 8334, "q0": "This project is totally suitable for the given challenge as it provides support to developers whose projects were rejected in the FT challenge. This is a great idea to motivate developers to continue building their projects and ultimately attract them to join the Cardano ecosystem where they will get advice and support to improve their projects. The proposal did give a quite clear explanation of how beneficial this project was to developers. Therefore, it could be said that this project not only has a certain impact on developers but also on the development of the Cardano ecosystem. The proposal gave a detailed explanation of why they came up with this idea, the process of this project including two phases, and how the project will be run. Besides, it also provided all activities of the project and its component in great detail. All in all, this proposal did a great job of describing the proposed project and how impactful it is to the target audience and the Cardano ecosystem. One more thing to mention is that it listed clearly 4 risks that it may face during the execution process. Each risk, it has a plan to overcome, so it is quite positive about the possibility of this project.", "q0r": 5, "q1": "About the plan, as mentioned earlier, it included two phases. It listed the KPIs to achieve in each phase. However, it should go into more detail about how everything will be operated in each phase, what to be done, and how to be done for each task. About the budget, it clearly mentioned what should be paid for each part of the project. Having said that, it should explain more about how it allocates the cost, how the cost is calculated, and give the time for the fund to be used for each cost. About the team working on this project, it included people who used to work on projects on round 7 of funding. They accumulated much experience in running similar projects. Especially, the project manager, Zeb Hastings, has experience in building up programs for startup development. This person will be a key person to lead the project in the right direction.", "q1r": 4, "q2": "About the way to measure the progress of this project, it mentioned clearly it would be measured by KPIs monthly that is in accordance with the ones mentioned in the plan. This is a great point to show the consistency of everything in the proposal. About the success of this project, it listed some criteria to evaluate. It was quite clear to see but it would be better if it separate the criteria into small sections to evaluate its partial success in accordance with KPIs set for each period of time.", "q2r": 4, "assessor": "z_assessor_2975", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thanks for the review and noted on the comments regarding KPI structure and budget allocation information."}, {"id": 13849, "q0": "This Fund 7 funded proposal continuation aims to improve their work and get the chance to accompany and mentor the startups that didn’t make it into the Accelerator. Seedstars intend to provide further support to those applicants that weren’t accepted in the previous challenge. This proposal is especially targeted to enhance and strengthen Cardano Catalyst Developer Ecosystem and it effectively addresses the challenge. Providing entrepreneurs the right tools to develop profitable and successful businesses might be the cornerstone for building a strong and resilient entrepreneurial community within the Cardano Catalyst Community. It might be also interesting for the Developer Ecosystem the business skills and tools provided since it is often seen that developers aren’t at all acquainted with basic business knowledge and this might be the core hurdle in their entrepreneurial onboarding. Mentoring these newcomers with data-driven methodologies and competitive network dynamics will ensure their engagement and commitment with the Cardano Catalyst Developer Ecosystem. ", "q0r": 5, "q1": "Being this proposal a continuation of an already funded proposal in Fund 7, The FTxCardano Blockchain Challenge, and being Seedstars their proposer it is highly likely this proposal will be implemented successfully. Seedstars has already achieved funding for three proposals and has successfully delivered their Accelerator programs. They also have wide experience in gathering feedback survey data and this is guaranteed that their work will continue improving and enhancing their mentoring and educational programs. Key milestones are divided into detailed KPIs and specific metrics that will be easy to implement. Budget breakdown is consistent and down to earth. They are also launching an outreach marketing strategy that will be the cornerstone of this proposal's success. Feasibility is highly safe and secure in this proposal presentation and it is highly likely this proposal will be successfully implemented. ", "q1r": 5, "q2": "Knowing this high calibre team will be sharing their progress and KPIs in monthly submissions and through regular community meetings is enough information to sufficiently audit the progress of the proposal. They will also share Success Metrics where they will measure the number of entrepreneurs graduated from the program and number of entrepreneurs joining the sessions and workshops. They expect 12 startups graduating from the program. Auditability will be easy and efficient above all because of the already developed communicational channels Seedstars have put up within the Cardano Catalyst Community. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thanks for the great feedback!"}], "solution": "This will be a successor to the 2 accelerators funded from F7 to include more startups building on Cardano. Through this, we can support more startups from the FTxCardano Challenge.", "experience": "For 9 years, Seedstars has supported emerging market entrepreneurs across 75 countries, supporting 37k+ entrepreneurs, delivering trainings for 2k+, and investing in 75 high-growth companies. We have an established relationship with Cardano, winning 3 projects in Fund 7."}