{"id": 422361, "author": "mavster04", "title": "Python SDK to Build Health App", "url": "https://cardano.ideascale.com/a/dtd/422361-48088", "category": 26597, "amount": 7500, "description": "Building a health app in a blockchain has lots of challenges. Aside from compliance, security, & data privacy, one has to learn blockchain-specific programming language. This makes onboarding harder.", "f6_no_assessments": 11, "f6_rating": 4.545454545454546, "videos": [], "media": [], "f6_assessments": [{"id": 748, "q0": "The proposal aims to build a Rusk SDK to interact with their Hippocrades APIs. This opens up their health information system to developers who prefer to work with Python. This is a useful addition it could bring new Python developers to Cardano and give an existing developer who prefers to code in Python, or has integration needs with other Python a platform to get started quickly. The SDK is geared towards Hippocrades and therefore not reusable immediately for the rest of Cardano ecosystem, therefore the reach is limited to some extent. It would have been good to see the proposer extend the scope to cover other parts of Cardano for which it could be used. However, the relatively low budget of $7k makes the reduced scope justified. The proposal scales to the extent that more developers will come to work on the Hippocrades apps. Note: The proposer has a similar proposal to build a Java SDK which I have also assessed. This proposal is in its entirety the same to the Java SDK proposal with only minor differences in the name of the SDK. For this reason, the text of this assessment is very similar as well to my assessment of the Java SDK", "q0r": 4, "q1": "The proposer has provided the list of individuals that are needed to deliver the proposal but has not identified who those individuals will be. The proposed however has a track record of delivering other parts of the Hippocrades app and states that access to a pool of developers who he can pull to work on this proposal. It would have been nice to see who those individuals are to be able to assess their technical capabilities. The budget of $7k is outlined and split between the tasks of a project lead, a backend developer, a python developer, and a documentation lead. The budget monthly rates for each of the tasks are competitive (e.g., $3k for a senior backend developer). The project is planned to be delivered within 1 month and this is quite realistic given that the team already have a Javascript SDK. The language differences between Python and Javascript are still quite large, so there is some work involved in finding libraries that might not exist in Python and which can identify some bugs in the existing javascript implementation and lead to some delays beyond the 1 month that has been allocated in this proposal. I think the proposal will be able to deliver, but it would have been nice to see a little more detail on the planning and recognition of the delivery risks. The proposer highlights that there is minimal risk to delivery. I suggest the proposer elaborates a little more on how the porting of the Javascript to Python will be done. I think the proposer will be able to deliver, but there are risks of a delay. Note: The proposer has a similar proposal to build a Java SDK which I have also assessed. This proposal is in its entirety the same to the Java SDK proposal with only minor differences in the name of the SDK. For this reason, the text of this assessment is very similar as well to my assessment of the Java SDK", "q1r": 4, "q2": "The proposer sets the time at 1 month to deliver the project after which the Python SDK would have been delivered and open-sourced on Github. The project is quite short in terms of time, so it is unlikely that there will be intermediate steps to monitor progress. The proposer commits to pushing the development of the SDK for the community to monitor. The success is stated as the delivery of the SDK which is in with what the proposal set outs to deliver. The deliverable is objective and there should be no difficulty to audit the proposal. Note: The proposer has a similar proposal to build a Python SDK which I have also assessed. Note: The proposer has a similar proposal to build a Java SDK which I have also assessed. This proposal is in its entirety the same to the Java SDK proposal with only minor differences in the name of the SDK. For this reason, the text of this assessment is very similar as well to my assessment of the Java SDK", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 969, "q0": "The Hippocrades Team has built an impressive suite of infrastructure products to enable app developers working with and for the health care industry to easily deploy applications that leverage the Cardano blockchain. This is a key piece of infrastructure that could prove very important for the adoption of Cardano. This particular proposal is requesting funding to build an SDK to allow Python developers to quickly deploy an app on top of their existing infrastructure without the need to learn a different programming language.\n\nThe best part about it is that we don’t have to hope that the team will have the skills to deliver on an SDK as they have already built one for JavaScript that’s available today and linked in the proposal. The funding they are asking for in this proposal will go towards building the SDK for a new programming language, Python (this proposal).\n\nThe team has 4 proposals in Fund 9 with the goal of building SDKs for developers working with languages to be able to deploy on their infrastructure with ease: Python (this proposal), Java, Rust, and Golang.\n\nI understand and agree with the decision of the team to submit a different proposal for each programming language they intend to create an SDK for. This enables the community to choose and allocate funds to those it considers necessary, and also select one or a combination of multiple languages that are relevant and would be good investments for the treasury. This is not something that would have been possible in case of a single proposal that would have bundled all languages together.\n\nThe team has been very transparent about the fact that they have multiple proposals in Fund 9 all with the same objective, just for different programming languages, as they mention this fact in every one of the proposals. This should also help with discoverability by the voters, but my recommendation would be that if there will be a next time, they should consider including links from each proposal to all the others to help with navigation in case a voter or a community member wants to support multiple.\n\nThis set of proposals is clearly a very good fit for the Developer Ecosystem challenge because they directly answer the key guiding questions of the challenge: “what are the tools that we need to prioritize first” - those that will make the development process on Cardano the most seamless and effortless, and “how do we attract developers from outside of our current community to participate in Catalyst?” - by allowing them to build on Cardano in the language they are most comfortable with. By splitting up their plans for SDKs into multiple proposals and giving the community a chance to vote on exactly which ones they believe are the most relevant they also allow developers to directly answer the questions “what do developers want, and how do they get it from the Cardano dev ecosystem?”  Also, the Hippocrades project as a whole very much addresses the last guiding question of the challenge “what are enterprise dev managers looking for in order to be able to build out enterprise projects - either internal or commercial?”, at least as it applies to dev managers connected to the medical industry.\n\nMy assessment of this set of proposals in the Developer Ecosystem challenge is based on my experience as a project manager working directly with Cardano developers since July 2021. I have participated in almost all roles in Project Catalyst since February 2021, including as a previously funded proposer, and I’ve been involved with the Cardano development community and NFT community for about a year and a half.", "q0r": 5, "q1": "The team presents not only an impressive list of qualifications in the proposal but also a complete list of their already operational medical services infrastructure platform and a demo app. We don’t have to envision what developers could build with the new SDKs in the languages they are comfortable with, we actually get to see it. After inspecting it I can say it looks impressive, it seems to cover all the needs of a health professional while also maintaining a modern clean look.\n\nThe implementation plan is logical and makes sense within the context of the overall project. It’s for 5 weeks of development time and seems to cover all the necessary steps to successfully implement the SDK for Python (this proposal). Each one of the 4 proposals in the set is estimated to take 5 weeks, meaning that in the case that all 4 proposals are funded, the total estimated completion time would be 20 weeks, given that the same team will be responsible for the execution of each SDK.\n\nAs this is a straightforward development project at an existing company, the budget breakdown only concerns itself with worker compensation for the month it is estimated that the development of the Python SDK would take. The amounts seem very reasonable, low for Western standards but that shouldn’t be a problem since the team has indicated that they are in Africa (they haven’t directly specified this in the proposal, but since they are part of the Ariob Incubator / Iceaddis program I assume this is the case.)\n\nThe team members involved in the development of this particular part of the Hippocrades project are described in detail within the proposal, and the technical speciality of each is presented. They seem to collectively possess the skillset required to successfully deliver. However, because the proposal didn't link to any professional profiles (LinkedIn) or examples of previous work, I wasn't able to verify the claims around credentials and experience. But, even though they haven’t provided links for each individual separately, they did provide a very ample description of their project overall (Hippocrades) and numerous links to multiple resources about the project and showcasing the project.\n\nAll these factors make me very confident in the Hippocrades’ team's ability to deliver on the scope of this project if funded.", "q1r": 5, "q2": "The proposal is very clear in what it wants to achieve and what are its intended deliverables. This alone should help a lot with the auditing process. A clear roadmap for the project is presented and from that, the delivery date can be easily extrapolated and verified. The team states it plans to use GitHub to record and monitor its activities and deliverables, which should further simplify the verification process as that is an almost universal tool used by most programmers in our developer community. \n\nGiven all this, I see this proposal (and this set of proposals) as being very easy to audit by any member of our community with the right technical skill set and knowledge of Python (this proposal), Java, Rust or Golang.\n\nNote on the proposal set and the assessments:\n\nI have verified the content of all 4 proposals using software that allows for snapshots of text and comparisons between snapshots (Scrivener). I did this to make sure the text of all proposals is the same before writing this assessment. They are indeed identical, only the name of the intended programming language differs between proposals. As such, I have assessed all 4 proposals as a set. Just as the text of the proposals, I have also changed the specific programming language in each one of my assessments and I’ve written “(this proposal),” where this needed to be highlighted.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 12, "ne": 4, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3566, "q0": "The proposal wants to develop a Pything SDK in order to make building healthcare decentralized applications on the blockchain easier. For the non-technical viewers asking themselves what's so special about healthcare apps let me answer - absolutely nothing, but if they must be developed to use the blockchain effectivly you need an sdk on your known language (in this case python) to make development easyer and in such a way, the developer wouldn't have to know anything about the blockchain, because all interactions with it will be behind an abstraction/interface provided by the sdk. I love the fact the authors have considered the requirements applied to healthcare like data privacy, compliance and many others I'm sure. This SDK will help developers that want to build a healthcare api using python for example and will greatly reduce the time by using the aforementioned sdk. This will bring a positive developer experience what the challenge settings are all about.\nThe plan to develop this sdk originally built in javascript is a superb one, because it will bring each individual community using that language that much closer to using cardano as a safe immutable ledger solution. The metrics and aim of the proposal are clear and distinct and a lot of thought is put into them. I'm sure this project will be able to scale and is already scaling by making all different kinds of sdks to engage macimum number of developers at once, which is smart.\nAll an all an impactfull and usefull proposal.", "q0r": 5, "q1": "This is one of the few solutions that have such a readable, accessible and long roadmap. I really like it's representation. If you go on https://hippocrades.org/ and tap the roadmap button, you can have a look as well. It has checkboxes that presumably will get ticked once a task from the roadmap is completed which is such a simple yet, underestimated way of showing your progress and future plans. The only thing that's missing is an \"in progress\" box that can tell everyone what your team is working on right now and I'd recommend to the proposers to consider this idea, as it's a 10 minute job at most.\nThe bad news is I wasn't able to vefify the skills listed for every team member anywhere on the net (i googled), and could find anything because no links are provided to do the verification. And with only first names, I wasn't able to search for the individual mentioned people as well. This bring the feasibility down a bit, but what can you do. Maybe next fund you'll add some links to help along for a perfect score, because everythingg else does seem in order.\nThe proposers have a decent timeline considering they already have implemented the sdk in javascript already and all the logic is narrowed down and tested (hopefuly) already. The only problem I can see is updating the SDKs in paralel, because if there's a problem inside the logic of one, all will have to be fixed to be efficient and stable. That's the problem with writing many sdks, but that can't be helped.\nThe technologies and skills are clearly elaborated on so nothing to add or ask there. The budget is more than reasonable and for such a small cost, the value will be great. Overall this is a very feasible proposal with the small exception I already mentioned.\n", "q1r": 4, "q2": "Considering the site and the roadmap I doubt anyone will have a problem tracking the progress of the project, especially if they follow my addvice and add an in-progress indicator in the roadmap. Many many meetings were mentioned to keep track of the project progress so that's something. The project catalyst also has a protocol to follow when the funding is seeded.\nHealthcare app and SDG goals go hand in hand so that's great they have those. It could help with their funding. It's a great and auditable proposal with a clear problem to solve and several solutions spanned in several proposals so great job, hope you make in after the voting phase. Good luck!\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4959, "q0": "The proposal aims to create a Python SDK (Software Development Kit) for Hippocrades, healthcare infrastructure on blockchain that's being developed since 2016. From their website: \"Hippocrades provides a comprehensive decentralized healthcare infrastructure and protocol that unlock interoperability and security challenges among different health systems. This allows users - patients, health providers, and health facilities to manage and audit their medical records while making them shareable in a decentralized, private, and permissionless health exchange.\" \n\nThe team has several whitepapers, extensive documentation, both for the product, and for developers. At a glance, Hippocrades looks to be one of the best projects I've seen on Catalyst. It solves a great host of problems related to interoperability of healthcare systems. It is an original use case for blockchains. Suffice to say I love the project. Now onto the proposal.\n\nThe proposal is one of 4 very similar proposals in this fund. Each of the 4 proposals is to create an SDK for a different language: Python, Rust, Java, and Golang. The proposers have already created the first SDK on Javascript and now are working on these 4 languages. \n\nDeveloping an SDK that can be used by developers is entirely aligned with the challenge. That is, if the SDK has anything to do with a Cardano. There is no obvious connection between Hippocrades and Cardano. The proposers state: \"Since the team has been building the Healthcare Infrastructure in Cardano, other developers will be encouraged to build their health apps in Cardano as well.\" I wholeheartedly agree that if this project is being built on Cardano, other developers will build their health apps on Cardano as well, using Hippocrades. I'm just not sure Hippocrades is being built on Cardano. There is no mention of Cardano on their website, or on their whitepapers. \n\nI asked about this connection in their developer Discord server got this response: \"The Hippocrades Protocol (Hippr) talks about zero knowledge proofs being saved in blockchain. The health exchange is triggered by those proofs. The blockchain being used is Cardano.\". Since this is an amazing project being built on Cardano, there is some alignment between the project and challenge, yet not total alignment. The team makes almost no effort to market Cardano. It took me additional effort to even confirm how Cardano is being used. I don't believe this project will onboard many developers to Cardano. But this isn't something that can be fixed easily, and I believe this is a high quality project, so I rate this proposal with some leniency.", "q0r": 4, "q1": "The team is very strong, with two solid developers and a Harvard grad founder with extensive experience in the healthcare sector. These guys know the problem they're solving. It shows in the extensive documentation, 2 whitepapers, and their website. They smell of professionalism. With 1 month of work and a budget of 7500 USD, I think this is a fair amount for the work to be done. \n\nThat work is not too well defined however. The plan is very general. It has no specifics as to the work, the featureset to be implemented in the SDK is not specified. I'll give the benefit of the doubt to the team here, I think they know exactly what they want to build, as they have already created a Javascript SDK, and they have a lot of work done already on Hippocrades. For the future though, I suggest giving some of this information on the proposal as well.\n\nAlso, there is no Python developer on the team. None of the three listed in the team has Python as a listed skill. Who will develop the SDK is not clear. I assume they will hire someone to do it. But this again is information that should be made available by the team that hasn't been. \n\nSince I believe this is a high quality project, I rate this proposal with some leniency.", "q1r": 4, "q2": "What features the SDK will have is completely lacking. The proposers say: \"Since the team has already built a Javascript SDK, the approach and framework will be based on this and just converting it in a different language.\" We can interpret this as the featureset of the SDK being the same as the featureset of the Javascript SDK, but that is not entirely clear. The javascript SDK also doesn't have documentation, so we don't know what features it has. As such, what features the SDK will have is entirely unclear. \n\nFrom where the progress of the project can be tracked is also not specified. There is no public communication channel on the proposal. No Discord, telegram etc. There is also no github, even though github is mentioned in the proposal. This information is also not available on their website aside from a Discord server for developers. This server however has a total of 2 members. Maybe they just got started, but it wasn't particularly easy to find. \n\nSince I believe this is a high quality project, I rate this proposal with some leniency.\n\n ", "q2r": 4, "assessor": "z_assessor_2643", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"id": 5922, "q0": "This is a useful project. It's basically the same as the suggestions you submitted (Java SDK, Golang SDK). What they all have in common is that they both provide a good experience for developers, in other words, it will \"burn the stage\". They will no longer waste time learning a new language. Instead, a Python SDK will be available to use. That motivates them to build apps, especially healthcare apps (thanks to the Hippocrades platform). Developers will be more involved, building more applications, helping the Cardano ecosystem to grow.", "q0r": 5, "q1": "Team information has been provided. They have full knowledge, experience and skills to carry out the project. Each person has their own strengths and forte, they gather to form a unity and solidarity. More specifically, they are people with many years of experience in the medical field, programming, blockchain,... . In addition, they have proven themselves by achieving success in building the Hippocratic foundation. You have a strong team, I completely believe in their ability. However, it would be great if you provided additional links to their linkedin profile. This will make team information much more transparent.\nThis proposal is quite similar to the proposals you submitted (java SDK, Golang SDK) so they have quite similar roadmap, success criteria, budget allocation. But that's not a problem, it's okay, as long as you convert it to different language. I have evaluated your suggestions (Golang SDK and java SDK), in this one the same problems were encountered. The budget should make it more clear by specifying the number of participants, the number of hours worked, the cost per hour. Add communications and marketing to the roadmap. Add a few specific metrics to gauge the progress and success of the project. For example: after deployment, there will be 10 projects applying the Python SDK per month,...", "q1r": 4, "q2": "The information provided is relatively complete to evaluate the success of the project. Thanks to the successful implementation and construction of the Hippocrades decentralized health platform and the JS SDK, there is a high probability that this project will also be implemented successfully. Because they have basically the same approach and framework, just need to switch it to another language. I am a programmer myself, I really have a headache because I have to learn a new programming language, it will take a lot of time and effort for me. But with the positive impact this project has, I can absolutely save a lot of time and effort.\nThat's why, I fully support it, I hope in the future I can use it to build a few apps, especially healthcare apps. More broadly, it will attract a large number of developers to participate in the ecosystem, contributing to building an ever-growing Cardano derivative. Thank you for an interesting project!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5959, "q0": "This proposal is part of a bigger project, Hippocrades medical protocol, which was part of the Ariob incubator and is asking for funding in several categories to expand on their existing roll-out and roadmap. This proposal and assessment are limited to the Python SDK for developers who want to build on top of Hippocrades, facilitating medical DApps and integrated hospital management with a focus on but not limited to poorer/developing countries. Therefore, the impact prior to the full fruition of the Hippocrades protocol is relatively low - compared to creating an immediately deployable tool or integration that can stand on its own for example - but has the potential to make a big and very impactful project even more impactful. In that sense, the proposal does meet the challenge brief as Python is a very popular and accessible programming language and especially widespread in science and academic circles or among medical and biology researchers, who are the likely future users of Hippocrades and therefore likely future Cardano converts. Given the information presented and the existing body of work (protocol documentation, whitepapers and Javascript SDK), I agree that this proposal has the potential to substantially improve the experience and efficiency of (some specific) developers and is also overall quite impactful for the Cardano ecosystem if both protocol and SDK are implemented successfully.", "q0r": 4, "q1": "The team have already launched the Javascript SDK on npm (npm i @hippocrades/sdk-js) recently and while not yet \"battle-tested\" or downloaded very often, this showcases their ability to successfully carry out a project like this. The 10 people team have provided the profiles of 3 core members that will be working on this proposal, with skills and backgrounds listed. It would have been good to see some external links like LinkedIn, Github and/or Twitter profiles as well. What is also coming short is a detailed description of the Python specific skills required and present, and which people (existing or ad hoc) will be paid which part of the budget allocation for development. The proposal could have been made much stronger with this information highlighted. Describing the project as very minimal risk is probably correct given the limited scope, but I would still have preferred a more measured discussion of risks especially in the light of the protocol as a whole. Overall, the information provided makes me agree that it is likely that he team has the skills, experience and external validation to carry out this task successfully.", "q1r": 5, "q2": "The Auditability of the proposal is limited to ticking off each task done per module, and the successful completion of the Python SDK is the only easily verifiable deliverable, without any possible check-ins or testing during the implementation period. Given that it will take only five weeks to implement the proposal, and the fund will probably be disbursed in two batches with half withheld until successful close-out anyway, this is acceptable in my opinion and should not be considered a negative for this otherwise good proposal. \nI like it that simple, stable, testable and well-documentable code are all part of the promised deliverable, not just a working SDK. It would have been even better to further elaborate on these standards or provide quantifiable metrics.", "q2r": 4, "assessor": "z_assessor_2761", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7139, "q0": "The proposal tries to add Python support for the Hippocrades healthcare infrastructure. The aim is to attract Python developers and facilitate their ability to build their own health apps without having to learn new programming languages. It aligns with the challenge settings and, if implemented, would ultimately add value to the Cardano ecosystem because, in theory, more health apps are going to be developed. However, I am a bit concerned about whether the Python SDK support is premature or not. Looking at their roadmap on hippocrades.org, we can see that many SDKs are on the way before the reward system. I think it's more cost-efficient to delay the SDK support if they have to be re-updated again. It really depends on whether or not there will be any breaking changes after they implement the reward system. I hope the proposer could clarify more on this matter. Other than that, I strongly agree with the proposal contribution and am personally excited to see more healthcare usecases in Cardano. This proposal acts as a stepping stone as it makes development easier.", "q0r": 5, "q1": "I am inclined to agree that the proposed plan would ensure smooth implementation. The proposers are the ones who developed the Hippocrades infrastructure, and they are the ones who understand the most how their modules and architecture work. They also have successfully supported JavaScript, so they have a knowledge base to assume the amount of work they have to put in for this proposal. The budget is broken down into items based on the amount of resources needed and the amount is reasonable. I applaud the proposer's initiative to emphasize QA and documentation too, since it supplements the aim of supporting new developers. However, since the proposer has proposed four different SDK support in this fund, I would like to see an explicit explanation of how they would manage all the projects simultaneously if they were all funded. Another improvement that would help the proposer is to add a buffer to their timeline to mitigate the risk of delivery delays, especially considering there might be different nuances within Javascript and Python. Perhaps the proposer has already added this buffer time within their plan or, based on previous Javascript SDK, they are confident that it won’t take too much time.", "q1r": 4, "q2": "The proposer has provided enough information for us to audit. The success of the proposal is straightforward; the release of the Python SDK for Hippocrades. We could track the project’s progress (tasks and deliverables) through the SDK Github repository that they will provide. Their five-week roadmap is also structured around milestones, which makes it easier to monitor whether or not the proposal is on-track or not. In the end, I am confident we can measure this proposal through the ways provided by the proposer above.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8713, "q0": "There are no concerns about the feasibility and relevance of this proposal to Challenge. It fits perfectly with Challenge's key metric that helps reduce the learning curve and entry barrier to Cardano for new developers. The main purpose of this project is to build an SDK that makes it easier for Python developers to create health apps on top of the infrastructure with the proponent's available protocols. This proposal clearly explains technical terms related to the main product and its positive effects on Cardano and health app developers. This project is an extension of providing an additional choice of application development languages ​​for developers and they also plan to provide more programming languages ​​in the future. This is great to be able to attract more developers using different programming languages ​​to join and contribute to the blockchain.", "q0r": 5, "q1": "The proposed team has successfully built infrastructure for developing healthcare apps designed for Javascript developers before and has successfully raised Catalyst funding so there's no doubt about the feasibility of this proposal. The personnel and materials provided for the development of this project are closely linked with the work of programming language development and application system design. The descriptions of the project leaders' areas of expertise and work experience are highly referenceable and verifiable through the links provided by the proponent. The product development plan sheet outlines the tasks and stages to complete them. For the budget, the proposal team did a great job in providing the required work locations for the project and the corresponding remuneration, adding estimates of hours worked for each position here would increase the auditability of the project.", "q1r": 5, "q2": "GitHub is the main tool provided for monitoring the development progress of the project. Although there were commitments made by the proponent about completing the tasks and completing the main product by the stated target deadline. But the project is falling short of commitments in terms of the number of Python health app developers using their SDK as a starting point and the rate at which their apps are contributed to Cardano. But I firmly believe that this project is necessary and productive for Python developers.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10916, "q0": "The proposal team is building real-world infrastructure for Healthcare in Cardano. In this instance they want to develop a public SDK to facilitate the development of a health application in Python. The SDK will take into account security, industry standards, compliance, data privacy among other things.\n\nThis can help new developers to speed up the process of developing medical applications on cardano\n", "q0r": 5, "q1": "The team is capable of implementing the proposal. The identified team members all come with strong qualifications and background needed to implement the proposal. The list of links also provide references that substantiate their claim in proposing an impactful solution for this problem. The team members sufficiently have the required knowledge and experience about healthcare especially through Hippocrates. This qualifies the team's capability and expertise in implementing this proposal. However, I am missing specific information and links to the different members of the team.\n\nThe action plan is hardly detailed, I would like to see more detailed technical-related milestones in the proposal.\n\nThe total budget is $7,500. This budget is divided into the monthly salaries of each team member, these salaries are reasonable. I would like to see some mention of what happens if development times get longer.\n\n", "q1r": 4, "q2": "I am missing some additional metrics to track the progress of the project. There is no mention of any auditing methods/processes when it comes to tracking the progress/dev of this proposal. There is heavy emphasis on the completion of individual tasks ie 'Tasks and features are listed accordingly that contain the tasks/activities required and their corresponding due dates to accomplish each' hence auditors won't be able to see if work is being done according to schedule. The proposers could add in detail here about what would constitute a success for this stage of development so that audit processes can easily follow it throughout its life.", "q2r": 3, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12318, "q0": "the proposer wants to build python SDK for a health app, which will make attract many python developers because as a python developer sometimes I’m too lazy to learn another language than python. this project was very helpful for people like me who didn’t want to bother with learning another language. and the proposal clearly articulates how it will add value to the Cardano ecosystem, to encourage python developers to build their health apps in Cardano as well.", "q0r": 5, "q1": "proposer didn’t provide links like LinkedIn or else to members team but clearly, explain each member’s team experience and skills for the implementation. the budget is outlined clearly and breakdown into identifiable items but didn’t add detail on each role’s salaries per hour, only the total per month. the project has a very experienced team which can be seen in projects that have been done with them, well I believe the project will be successfully implemented.", "q1r": 4, "q2": "clearly roadmap with milestones and a time horizon for achievement. a very clear description of the targeted problem that can be measured against the proposed outcomes and has a solution that addresses the problem with a simple definition of success. has an accessible public channel for delivering regular updates on auditing progress. ", "q2r": 5, "assessor": "z_assessor_3399", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14812, "q0": "Hippocrades team aims to deliver a robust system to make healthcare data safely and securely accessible to all. The team knows that learning blockchain-specific programming language has some challenges, and they create a extensive health infrastructure with APIs so that developers can build their own health app easier. This infrastructure saves a lot of time and effort for developers as they can just build apps on top of the infrastructure. Hence attract many more developers regardless of their programming language. \n\nIn this proposal, the team offers to attract Python developers to build their healthcare apps in Cardano. The team has been selected in previous batches and their products have been released, making this a proven case. In short, they just need to rewrite an already successful infras in another language", "q0r": 5, "q1": "I really enjoyed reading this proposal. It is clear, concise and well organized.\n\nAgain, the team has already build the Javascript SDK so logic and framework can stay pretty much unchanged. They have reasonable and achievable sprints with enough time for testing, documenting and releasing. The budget breakdown also looks good to me. I am really impressed with how they present details of team members. The core team with strong background and experience over the years, plus actual references to their works so that they have talents, and that they care about health care. Actions speak loud, however, I would add a link to each member's page such as LinkedIn or Github to make it easier for me to find them if I want to know more about them.", "q1r": 5, "q2": "The team is passionate about what they do and are very clear on the value of their project. The discipline that worked previously is once again applied here. Stable, simple, testable code, team velocity and knowledge share make a complete protocol. I also liked how they track progress through Github and conduct daily standups as well as weekly meetings to spot issues/discuss in a timely manner. This helps them stay on top of things and make sure everything runs smoothly throughout development cycles", "q2r": 5, "assessor": "z_assessor_4103", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Hippocrades has built a health infrastructure with APIs for devs to easily create a health app. Currently, it has a Javascript SDK already. We want to create an SDK to cater Python developers.", "experience": "We are from the Hippocrades Teamthat has built a decentralized healthcare infrastructure for Cardano. We have been selected in the 1st batch of the Ariob Incubator / Iceaddis program in Africa which is supported by Cardano for high-potential startups. A Dev Portal is already set"}