{"id": 422388, "author": "lpmaho", "title": "MLabs - Cardano Throughput Solution", "url": "https://cardano.ideascale.com/a/dtd/422388-48088", "category": 26597, "amount": 81200, "description": "Cardano is a 3rd generation blockchain supporting expressive and secure smart contracts (DApps). Yet, as often noted, Cardano's eUTXO design poses challenges not least of which is txn throughput.", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 118, "q0": "The team is proposing to design, implement and develop a protocol that will resolve some issues that Cardano’s Eutxo model has in terms of constrained throughput which limits the kinds of DApps that developers can release and develop. The solution proposed by the team is to avoid existing centralized shortcuts that rely on trusted setups and instead to increase decentralization through a novel protocol inspired by Cardano’s own Ouroborus. This novel protocol will take a leaf out of Ouroborus’ book and be split up into sequential slots, which will be accompanied with a random election of leaders for each slot – thanks to the use of verifiably random functions. The leader advertises that they are the leader (i.e. they advertise the result of their coin toss), and lock the state machine for one slot. In this one slot, only the leader can interact with the protocol. Key to mention here is that the proposers also confirm that “the system isn't foolproof since a leader can still put in trades before and after a trade by a user on a Uniswap-style DEX for example”. The proposers are keen to find a way to prevent this – however the proposed solution to this will pursued as a future project – which points to a plan for future development on top of these achievements. I commend them for thinking about the possible exploits such as miner-extractable value scenarios - hopefully if this proposal is funded, other teams can build on this solution in parallel. I commend the proposers for stating that they “are committed to open-source tooling for the Cardano ecosystem”.  This submission does give a very clear picture of how the team intends to provide added value to Cardano and the goals of the proposal are well in line with the challenge settings. ", "q0r": 5, "q1": "The team behind this proposal is a competent and known development company in the Eutxo blockchain space. Mlabs developers have previously partnered and worked with with some of the leading Dexes that are operational on Cardano – which also indicates there high-level familiarity with the issues that they are attempting to resolve through this proposal. The team has provided detailed information about the specific team members – software engineers and developers - who will be engaged on the proposal. The Github repos of the developers are available – one of them is also the is the creator of the Plutarch typed eDSL in Haskell for writing efficient Plutus Core validators. The total budget of $81,200 is the result of an estimated 1015 engineer hours that will be invested in the project. The team has given a breakdown of the budget with a great hourly tally by individual tasks. The key milestones have been given for the implementation period of three months. As regards the technical aspects – this team has the required competencies to tackle the design of the system and the necessary familiarity with Plutus and Haskell. ", "q1r": 5, "q2": "Based on all the submitted information, I do agree that the likelihood of successful delivery is very high. The GitHub repos are publicly available and the team committed to measure some well thought out metrics to allow for auditing the success of the proposal, including an important measure - the number of Cardano projects relying on this approach. The team has provided a clear roadmap with milestones and have set themselves a realistic time frame to achieve what they set out to do. What could have been done to improve the auditability of this proposal – from the point of view of the not-as-technical Cardano and Catalyst communities – is to commit to a certain cadence of technical updates and/or blog posts detailing what has been achieved. For example, via a fortnightly or a monthly update on how much progress has been achieved. This would be separate from the standard, terse Catalyst reporting – which is only linked to fund disbursement. Without these updates – which could even be done via posts on the MLabs social channels – it is less easy for an outsider (still inside the Cardano bubble) to keep abreast of the progress. ", "q2r": 4, "assessor": "z_assessor_2047", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 752, "q0": "The proposal identifies the need to improve the developers' experience when creating smart contract that need to operate on the same UTXO. This is called concurrency and has been on the minds of the plutus developers from the outset. Even before smart contracts launched on Cardano the teams from Minswap and Sundaeswap identified that this would lead to difficulty implementing a DEX type app on Cardano. As the proposer points out the solution adopted by the existing DEXs has been to use a trusted third party which “scoops” the transactions by essentially breaking down the transaction into two steps. The proposal from MLabs seeks to eliminate the need for a trusted third party and have the contract run fully on-chain. The source code will be open-sourced. The advantage of this type of proposal is that they not only solve a problem that developers are facing, but also creates an example for the new developed to learn from. As a developer myself, I very much welcome the opportunity to have the problem described in detail and then be shown how the solution looks. This will be a big value add to the developers working with Cardano.", "q0r": 5, "q1": "The proposer provide the details of two developers who will work be working on the proposal, the Github profiles are provided and I had no problem validating their experience by reviewing the type of code written on those Githubs. The budget is outlined in the number of hours that it will take to get through each of the 7 tasks into which the delivery is broken down. The implied hourly rate is $80/h which is competitive for an experience Plutus developer. The proposal timeline is split into 3 months where the first month is spent on planning, the second month on development, and the third month on testing and verification. There is a logical split between the knowledge base of each individual, Las is an expert in Compilers and Formal Methods, whilst Chase focuses on Performance and Type systems. The plan is formulated in buckets of deliverables by month, the proposers suggest that part of the smart contract has already been written to validate the initial idea, this is encouraging as would suggest the proposers have planned at length. The proposal clearly outlines the language, Plutus, and the architecture to be used. The proposers have created the Plutarch repo which I am personally a user of and find very useful as it reduces the memory and CPU requirements of smart contracts, and the proposers intend to reuse parts of the knowledge gained in designing that for this smart contract. The proposer also explains logically the problem of concurrency, this gives comfort that they are familiar in-depth with the issue. The main risk highlighted is dealing with Miner Extracted Value (MEV) where the pool operators might try to front-run the users of the contracts, this is a prevalent problem in all blockchains because of its transparency - if there is a solution to it then this team has probably one of the best credentials to deal with this.", "q1r": 5, "q2": "A roadmap with monthly milestones is present and a logical split of tasks between individuals. The KPIs are provided that focus on the deliverable at hand as well as community adoption, these are objective and track things such as the number of features implemented in the smart contract and the number of projects using the smart contract. The success of a project is s delivered smart contract that is used by the community. I see no problems with how the project could be audited, the team so far has set an example on transparency and the statements suggest they will do the same with this propo", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1873, "q0": "Currently, the limited throughput on Cardano poses many obstacles for developers and thus limits the types of DApps they are capable of offering. Potential users are targeted at dApps such as DEX building on Cardano, developers working on high throughput applications, and Cardano users across the entire ecosystem. The output of this proposal will be open source, and developers building on Cardano will be able to incorporate it into a range of smart contract applications they build.", "q0r": 5, "q1": "The proposed solution to this problem is to leverage VRF, off-chain communication, and on-chain infrastructure to dramatically increase throughput. The core team of the project includes 2 people:\nLas Safin is a software engineer and formal method expert who has experience with dependent typed languages ​​such as Idris and Agda.Las Safin undertakes research on Compilers and formal methods. of the proposal.\nChase Maity is a polyglot software developer with expertise in Haskell. He has experience in type systems, programming language design, and performance-optimizing compilers. Chase undertakes Type System research and Performance Optimization of the project. Thus, looking at the experience and education of the core team of the proposal, we see that the team is fully capable of ensuring a successful project launch. The proposal outlines progress and milestones by month with specific tasks to be completed. The MLabs company has talented developers and the Core Team working on this project is completely familiar with Cardano. Furthermore, the basic parts of the deliverables have already been implemented, so the proposal is potentially low-risk. There is only a small risk that the pathways to excessive MEV, which are difficult to reduce, may limit the practical impact of this approach. However, the group has not yet clarified how to overcome this risk", "q1r": 4, "q2": "The total required budget of the proposal is $81200, which is an adequate budget to launch a project that increases throughput on Cardano. In addition, the budget is explained in detail, specifically for each item of the project, calculated for each number of hours, showing that the proposed group is very close to reality. Furthermore , the proposal outlines specific indicators to monitor its project progress . Thus, the project is very transparent about finance.", "q2r": 4, "assessor": "z_assessor_2280", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2862, "q0": "perceived many limitations for our developers in the operation of Utxo's input validation mechanism, so the proposed team came up with a solution, to remove that barrier, to promote push our developers to focus on developing their apps instead of messing around with those barriers. and so this idea is perfect for the challenge,\n  \nThe limitation of Utxo's input protocol that the team is committed to overcoming is: when many transactions at the same time request input state, it leads to congestion and only one transaction is accepted and the rest. will cease to exist,\n so the proposed team has come up with a solution (VRF) i.e. verifiable random, by choosing a similar input to authenticate the input transaction, with the same mechanism for the copper layer. Cardano's consent.\nalong with that the proposed team has stated the limitations and explained the solutions they provide, how will address those limitations, with specific examples to support those claims.\n* however as far as I know the upcoming upgrade of Cardano will support the input protocol is: CIP31 this is a protocol that allows to use input information without spending, because it is not implemented yet. is running on the mainnet, so not much is known about it, but as far as I know it will allow small nodes to temporarily record and pass information to other nodes to ensure information authentication, and then while waiting for the previous transaction to be recorded on the chain, the information will be pushed to the large node that is responsible for recording, so there may be a delay in the processing of the oil transaction. will be fixed in this upgrade. if so will this affect the proposal. team please contact the main development team for this upgrade.\n  Above are my suggestions for the team to recommend for reference.\nmost of the potential risks are minimized and optimized by the proposed team, that is the statement of the proposal.", "q0r": 4, "q1": "The implementation plan has been meticulously detailed, clearly defining the important milestones by month. It seems that this is a continuation of a funded project, so the proposal team confidently declares that the development phase will be completed in 3 months.\n\nI agree with the expenditures proposed by the group to be announced, but I have a suggestion that although it does not affect anything, but for transparency and fairness, the group should add this idea to the discussion rounds. for later production, knowing that the work of the proposed team is very technical related, so it is natural to ask for more reserve funds, because there may be errors that need to be fixed during the test period, but There should be accompanying footnotes for those portions of the budget that are not used, so that it will be comfortable for the proposing team and the public to evaluate.\n  \ninformation about the core team developing this proposal is very experienced, and the community is very well known to them, because they are large organizations with experience developing on the Cardano blockchain, so the team is completely enough experience to implement this idea.", "q1r": 4, "q2": "proposed commitment to complete the work on time announced, in addition there are many metrics provided by the team for the community to track and verify completed workloads. Also minor issues are not important, that is next time in the next rounds the team should have a caption for the commitment to support the stated work metrics for the community for example on the website of the group. this proposal or the periodic report of the Catalyst fund, thus ensuring that 100% transparency.\n \nalong with that the team has clearly defined this goal of success, which will benefit developers and increase transaction volume for the Cardano blockchain.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"id": 5197, "q0": "The proposal tries to solve Cardano concurrency leverages VRFs, off-chain communication, and on-chain infrastructure to significantly increase throughput. Some portions of the milestones are already implemented, and with the vast experience the MLabs has, the chance of the project failing to deliver is very low. The proposal itself is very well written and provides every key information that voters need to know. The proposal outlined occurrences that may limit the impact of the approach.", "q0r": 5, "q1": "The provided timelines are written in the first months, second months, and third months. Where the milestones are tied to those timetables. There is a detailed budget breakdown, where each milestone is provided with its cost. The cost per hour is around 80K$, the same rate as other MLabs proposals. Quite expensive compared to other projects, however, considering the MLab's experience and their proven track record, it's still reasonable. The proposal provides concise background and past projects of the MLabs team. They also give detailed information on the experience, past projects, and relevant skills of each core team member. On top of that, they attached a Github account thus making the community easily verify their credibility.", "q1r": 5, "q2": "There are various metrics used to track the project progress, from the number of projects that used it, the number of features implemented, etc. All of which are quantifiable. The defined success is very clear and measurable, by adding throughput and scalability mechanisms for developers on Cardano that want to build dApps that can support high volumes of transactions.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 11917, "q0": "The Throughput Solution proposal by MLabs has the noble goal of reducing the trade-off dilemma between centralization and resolving concurrency issues with the eUTxO model. While this sounds somewhat technical and arcane, it is at the core of many DeFi and dApp problems developers face. How do we handle multiple users to interact, for example in a market place, without either overwhelming the blockchain's capacity or relying on either arbitrary or centralized ordering of requests? Improving this trade-off is not only highly relevant for improving developer's capabilities and \"satisfaction\", as is the direction of the challenge setting, but also high impact for Cardano if implemented successfully. To be clear: this proposal does not \"solve\" the problem of the eUTxO's throughput capacity in a fully decentralized manner, but it improves the trade-off. This is fantastic news and even if the result is only gradual, it can be built upon. A very effective way of addressing the strategic direction of this fund, this challenge, as Cardano as a whole.", "q0r": 5, "q1": "The proposal provides detailed profiles of the two main developers that will be working on this project. With Chase and Las, both highly experienced programmer specializing in Haskell, the community funding would go towards $80/hour high quality Plutus development, which seems extremely fair in my opinion and after looking at many other proposals where there is arguably less \"bang for the buck\" on offer. It speaks for this proposal that the budget is further broken down into items with hours and most relevant tasks / objectives outlined. Seven milestones are broken down over three months of implementation period, and the steps and approach described appear to be highly likely to achieve success for the scope of the proposal. High-quality improvements of existing blockchain technology are not something you can force, or which comes easy if you just throw the hours at it, but the very active Github presence and neat project plan provided give me very high confidence that this a project both worthwhile and likely of success.", "q1r": 5, "q2": "The company behind this proposal is well-known and closely engaged with the community, so we can be assured that communication about this project if financed will not be a dead end. There are six KPIs of this proposal, four are quantitative and a bit generic in my opinion, and two are qualitative and very good if they can be carried out appropriately, for example by working closely with the Challenge Team or contributors from the community on Github. Ultimately, this proposal should result in a blog post by IOHK or some other official channel, to make developers aware of the improvement and to built upon it.", "q2r": 5, "assessor": "z_assessor_3314", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Our solution to Cardano concurrency leverages VRFs, off-chain communication, and on-chain infrastructure to heavily increase throughput. It ensures competing state transitions are not posted on-chain.", "experience": "Plutarch developers and other advanced Haskell/Plutus engineers.\nMoreover, our engineers are committed to open-source tooling for the Cardano ecosystem. See our work on the Cardano Transaction Library (Fund8 successful proposal) and the Plutonomicon GitHub repo."}