{"id": 422358, "author": "santi", "title": "Dolos: Cardano “Data Node”", "url": "https://cardano.ideascale.com/a/dtd/422358-48088", "category": 26597, "amount": 75680, "description": "Nodes used exclusively as data source for client tools have different requirements than block producers / relays nodes. Many performance / cost optimizations are not currently possible.", "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"id": 117, "q0": "The team behind this proposal is putting forward a very interesting idea, which to develop a stripped-down version of the Cardano node that will serve as a data source for different tools but unencumbered by some of the superfluous capabilities of a full Cardano node. To spice things up further, this will not be a stripped out version of the existing Haskell Cardano node, but a new Rust-based Cardano node that will effectively host and continuously update a copy of the live Cardano ledger while also being able to respond to queries from trusted clients. And that’s it. Effectively the team endeavours to deliver a limited and focused version of the Cardano node. Why? Well, this will enable developers to utilize less resources to run a cost-effective node for limited purposes as a data source … independent of the regular and existing producer / relay nodes. I can see how a project of this ambition could help the Developer community, including enterprise projects that rely on querying the blockchain – for internal or commercial purposes. What is the true benefit, you – the voter might be asking yourself – well, it is that this will allow teams that use Cardano to be more resource-efficient. As they will have a cheaper way to access ledger data as they will be exposed to lower infrastructure costs – benefiting the smaller and medium-sized teams the most.", "q0r": 5, "q1": "This proposal was submitted by an experienced and small developer team named TxPipe, who claim they have already created projects such as Oura and Pallas. The focus of this team is developing open source tools and infrastructure for Cardano developers. TXPipe has in its focus primarily backend development, data pipelines and cloud architecture. I explored the team’s achievements and they are – in my view - a valid testament to their skills and interests. The team has already developed a nice range of tools such as Scrolls [a backend tool for building and maintaining read-optimized collections of Cardano's on-chain entities], Oura [a backend tool that allows the creation of off-chain applications that 'react' to on-chain events], as well as Boros and Pallas [used as a base layer to facilitate the development of higher-level use-cases]. This is a team that knows what needs to be known for a project of this scope. The team’s commitment is to develop tools that “remain open and free forever”. Win-win for the team and for Cardano. The team has included links to their website and to their GitHub repository. The proposal is requesting $75680 to create an open-source project using Rust as its main development language to deliver a novel type of Cardano node that is currently not available in the system. The team has given us a detailed timeline that consists of three key milestones – glad to report that this open source project will be delivered with technical documentation and a full documentation site. The team has given us a budget breakdown – presented in an admirable fashion. The hourly rates per role and person engaged, as well as the number of hours they will be engaged. The names of the team members and their relevant experiences have been provided. One thing I would add, if this proposal is resubmitted in the next Fund (and does not get enough votes now) – is the links to LinkedIn profiles or professional biographies of the people involved – as a confirmation of their relevant experience. Transparency and feasibility = high marks! ", "q1r": 5, "q2": "This is an amazingly well presented and digested proposal. It has a clear value proposition, a clear problem it wishes to tackle, a clear deliverable that it wants to contribute as an open-source contribution to Cardano and a competent team that wishes to deliver it. It will provide a detailed roadmap as part of the open-source repository and each milestone will be presented as a partial but working \"release\" within the repository. Milestones will be tracked via Github – while the Catalyst community will be able to use the team’s Discord server for communication with them. I commend the team for thinking proactively about the entire community – not just the Developer community – as they said they intend to post weekly update summaries via the TxPipe twitter account – which will allow the general Catalyst community to easily follow progress in development. In my view the team has offered a very good solution to the problem that they identified – how to offer performance / cost optimizations to the Cardano blockchain through the creation of nodes that can be used exclusively as a data source for client tools. If done correctly, this could be another game changer for the Cardano blockchain – as more node implementations and more variation in the available tools – will create a more resilient and diverse system. The team has provided accessible public channels for delivering regular updates to the technical and to the non-technical community for auditing progress.", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 22, "ne": 13, "ng": 9, "nfo": 0, "vca_o": 2}, {"id": 3565, "q0": "The proposers want to create an efficient cardano \"data node\" meaning it's a node that's going to specialize in answering data queries integrating into the ecosystem. As a developer and an economist I'm a big fan of specialized labor. That means that each job that you specialize in can be done better and in combination with other specialized jobs is giving more work than the individual sums combined. I do believe a specialized cardano data node or some other form of optimized data keeping tool will be necessary in the future, because as time progresses the data in the ledger becomes more and more and it's harder to query overtime unless some optimizations are done.\nThis project absolutely matches with the challenge settings and the category it's in. It's going to prove invaluable to all parties that are going to take a advantage of this specialized data node. The team does have a good explanation on how they're going to bring value to the ecosystem which I totally agree with. One thing I'd suggest to the proposers is to keep the proposals smaller if they have a suspicion of not delivering the whole package as described in the proposal, but since this would be sort of an MVP that could evolve into an enterprise solution I'd say that's not so big of an issue, but it's something to keep in mind nonethe less.\nThe metrics seem reasonable, although I didn't see anything about measuring adoption. As a developer I'm really happy with the level of technical detail and I don't see anything missing from the proposal. I think the impact would be noticable and this proposal is worth funding.\n", "q0r": 5, "q1": "There aren't links for all the team members, but I was able to verify their skillset based on their names and a bit of googleing, and can say that they all got the skills listed in the proposals, but for future proposals I would really appreciate if there are links to all team members in a proposal, because that makes my life easier. The team skillset and combined experience brings the feasibility of this whole project up.\nI like the very detailed plan of action includingg a roadmap, detailed milestones and individual tasks separated in decent timeframes and workable chunks. The budget breakdown is also reasonable and for the hourly rate and the work that needs to be done. One thing I would advise against is reverse engineering. I realize there might not be a documentation, but consider the fact cardano is essentially an open source project and you can just ask instead of trying to reverse engineer protocols. I'm speaking from the position of an embedded developer that has done reverse engineering and knows exactly how hard it can get. If you can avoid it, try that first, because you'll always have the option.\nI also like the regular releases based on the milestones listed in the proposal. That makes following the progress of the proposal so much easier and show the cristal clear plan that the authors have about the development. The ease of usage is another point I wanted to bring up, because as a developer I can concur I'd much rather use something that's fastt and easy to use than setting up for a week to do something elementary like querying some data.\nThe fact the team has a discord channel really makes me feel it's possible to have a good feedback and development loop, which is the definition of agile development beeing the standard.\nOverall all technical aspects of the proposal are described and that makes the proposal as feasible as it gets. \n", "q1r": 5, "q2": "Auditability will not be a problem considering there's an open source public github repository linked in the proposal and a discord channel where problems can be discussed. Combine that with the promised regular reports and anyone interested in this solution will be able to keep up with it constantly. As I already mentioned there are detailed milestones and a timetable to make any other proposer feel envy, so I don't see any issues there.\nThe problem is well defined, which is more than I can say for a lot of other proposals and the solution is really detailed and technical, which I can appreciate as a dev and an assessor.\nI like this proposal and you have my vote. I'll be following your progress in github.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4496, "q0": "The scope of this proposal is slightly more humble than I initially expected when reading the title, as the \"third node type\" proposed in addition to block producing and relay nodes on Cardano is rather limited and mainly a performance improvement for backend and devops teams. The project has, however, the potential to enable further use cases of a \"data node\" further down the line and might become very impactful for development on Cardano in the long run. Short-term within the 4 month timeline of this proposal, the project has the potential to significantly improve the ad hoc scaling and efficiency of backend tasks and queries. By promising to do so, this proposal is extremely well aligned with the Challenge Setting, as it would increase efficiency and give a powerful new tool to many smaller to medium sized development teams on Cardano. In this sense, this is a project \"by developers for developers\", Open Source and targeted, so more efficient, more creative, and more advanced dev work will result if the proposal is implemented successfully. By its measured presentation and very specific direction, the proposers stay true to the \"Cardano Way\" but at the same time have the potential to make a significant improvement within less than half a year that the dev ecosystem could then build on.", "q0r": 5, "q1": "The existing portfolio by the team, including the highly-regarded Oura backend tool (169 stars on Github) make it highly likely that the Dolos project could be carried out successfully at least as a proof-of-concept with the existing team and planned hiring of one additional Rust developer. The team is transparent about its members and collaborators and seems to have the experience and skills required to make this proposal into a success. The proposal is extremely well written. It repeatedly states the scope and limitations of the proposal and also mentions risks and how they would be mitigated. The budget is presented clearly and broken down into items and over time, providing hourly rates. Costs other than payroll are not including, so I assume that they are absorbed by the respective functions - it would have been nicer to get a rough ballpark about any such items separately. Sufficient budgeting has been done for project management and potential blockers, without being excessive. The documentation, company website and Github presence of txpipe are impressive and give me confidence that the funds requested would be deployed responsibly.", "q1r": 5, "q2": "A lot of the audit of this proposal will rely on tracking the progress of development via Github and Twitter updates. The Auditability information provided in the section is relatively brief, referring to previous sections. Although readability could have been improved by repeating or summarizing all information relating to audit and progress tracking, sentences like this show the thought process that went into the proposal and the well-calibrated risk mitigation measures: \"Our development process will include performance benchmarks execution at each development milestone.\" provided under \"Impact\". The scope of the proposal is made very clear, highlighting what will NOT be provided and what the risks and limitations of the planned implementation and proof of concept are. In my opinion, this is an excellent way to write a proposal and -given the supporting links to existing projects on Cardano provided- give me high confidence that the community will be able to follow the progress and direction of this project closely.  The three milestones of this project contain a timeline over four months of development work, so all the information necessary is there, although readability could have been improved by stating the timeline or providing a project phase diagram or something like that. ", "q2r": 5, "assessor": "z_assessor_2554", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10310, "q0": "Problem in this project We will develop a new node which is to be used exclusively as a data source for client tools which have different requirements from block/relay producer nodes which solves this challenging problem. given formula\n fine-tuned to address a very narrow range: keeping an up-to-date copy of the ledger and answering queries from trusted clients, while requiring a fraction of the resources\nidentify the risk in the challenge of the fact that an up-to-date copy of the ledger exists,\nAnswer queries from trusted clients.\nthis project has the potential to help us solve state queries locally or act as a data source for downstream tools that require ledger data.\nSo that we can further develop Cardano nodes can take on one of two roles:\nblock producer: in charge of block casting\nrelay node: in charge of the forwarding block in charge from/to peers.", "q0r": 4, "q1": "Clear and logical progress on milestones Milestone 1: PoC\n1 month of development\n1 full-time Rust developer\n1 part-time SRE\nMilestone 2: Features\nMilestone 3: Hardening / Documenting\n provides a very limited and centralized version of the Cardano node that can be used by DevOps as a cost-effective, efficient option for deploying data nodes in parallel with producer/forward nodes .\nNew wire protocols such as HTTP/JSON and gRPC will also expand the scope\naccessing ledger data without incurring high infrastructure costs will drive growth for both single developers and small to medium sized teams\nThe budget requires reasonable and transparent details with clear details of exactly what needs to be spent\nTeam competencies with potential relevant experience\nPerformance gains and resource allocation optimization are theoretical, these are extrapolated from our experience implementing Cardano data processing pipelines using components written in Rust\nIOG for advice and documentation where available.", "q1r": 4, "q2": "Project success metrics and metrics have the potential to optimize infrastructure costs and improve data-intensive workload performance\nIncluding experienced members Federico S. Weill will be the project manager\nSantiago Carmuega will lead the software development effort\nAlejandro Drabenche will be the SRE responsible for project validation, implementation and testing at each milestone.\nFlorencia Luna will be in charge of writing techniques\nThe project is clearly practical and creative We are planning to hire a new software developer with Rust experience to contribute to the foundation\nDoes it fit the challenge and the whole proposal , what is a brand new project If the project achieves a good level of acceptance I hope this project gets funded good luck", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 15030, "q0": "The proposal fits well into the Challenge brief as the team behind it aims to develop an opensource tool that could be able to scale the queried data on the blockchain by creating a specialized Cardano node which won't require high costs to be implemented, and could be more attractive for the developers in need for this kind of tool.\nIf this project will succeed it will bring potential value to the Cardano ecosystem, as many developers could optimize their productivity and also boost their creativity. Regarding the KPIs they are well presented and are aligned with the Challenge settings. As a recommendation, that the proposer could take into consideration, to build a way to measure the adoption by the new developers, other than developers that are already following this team repositories.\nTo sum it up, I consider this section to have a rating of 5 stars, as the message, regarding the problem that is to be solved and the provided solution of this proposal, is well written and is clear for any outsider and the proposal aligns well with the requirements of the Campaign.", "q0r": 5, "q1": "The requested budget of $75,680 is broken down into identifiable items and looks reasonable for what is projected to obtain. What I would like to see for this area, is an item for what is to be spend for Marketing activities, thus the project to get the necessary traction for a better visibility.\nThe proposer is aware of the needed human resources (one to be hired) and what are their roles in this team. What I miss from this are is the relevant info that is to support the team members skills and experience. We know that the assembled team behind this proposal are very familiar with the Cardano ecosystem as there are 2 successful products (Oura and Pallas) but, at least for Florencia Luna is difficult to assess what are her skills relevant for the successful of this proposal. It is recommended to provide as much as possible of any relevant info (with links) about the area of expertize of each team members, thus the community to be able to have a fair and good opinion.\nThe proposer has identified 2 potential risk and what is to be done to mitigate them, and I hope IOG will give the needed answers to the team.\nThe proposer has presented the programming languages (Rust) and the technologies (HTTP/JSON and gRPC protocols as an example) that are relevant for the implementation of this proposal.", "q1r": 4, "q2": "There are 3 communication channels that will help to track the progress of this project (Github, Discord and Twitter) and seems to be enough for the community, technical or non-technical as well.\nThe problem and the solution to the problem, as I mentioned in the Impact section, are well presented and leave no doubts for what is to be obtained and what is the added value to the Cardano ecosystem.\nThe proposal has a timetable of 4 months and the deliverables are presented for each milestone (3 milestones to achieve). The presented metrics are well aligned with the Campaign settings (communication, repos on Github etc.)\nI rate this section with 5 stars.", "q2r": 5, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15237, "q0": "The Data Node project intends to create a third type of Cardano node, different from the block producer and relay nodes currently in use. It would only be used to serve data downstream for other project that require on-chain data. This would be very beneficial especially for small and medium teams, allowing them to reduce costs and speed up their work.\n\nAccordingly, this project is a perfect fit for the Developer Ecosystem challenge as it seeks to directly ease the workload of a large part of the development community. It also represents a core infrastructure tool, that should take precedence over more niche tools, and thus answers one of the guiding questions of the brief directly.\n\nAn added benefit is that the TxPipe team, the developers behind this project, plan to open source the resulting Rust node, further increasing the potential usefulness of this project to the Cardano developer community.", "q0r": 5, "q1": "The implementation plan is structured in a way that makes a lot of sense, given the development nature of the Dolos proposal. It covers 4 full months, and it is broken down into 3 milestones, each covering a certain aspect of development, while the last milestone also includes documentation.\n\nThe $75,680 requested budget of the proposal is broken down by task, and according to the needs of each task, a total number of hours is estimated.  Project manager, Rust developer, technical writer, and site reliability engineer are accounted for. The rates per hour requested are very reasonable, in line or below market rates. \n\nShort bios are presented in the proposal for three of the four team members, and the team plans to hire an additional Rust developer.\nGiven their previous experience (Github profile for the developer provided), the team is clearly skilled and experienced enough to deliver on the project scope\nThe teams website (https://txpipe.io), features the projects and products the team has already built for the ecosystem, further demonstrating their commitment to Cardano and their development skills.", "q1r": 5, "q2": "Similar to the projects the TxPipe team is already building and has release, the Data Node project will most likely end up being used by a large number of developers in the Cardano community. This will ensure that the Catalyst proposal, if it ends up being funded, will be tracked, monitored and audited “live” by the development community meaning that the GitHub and Twitter accounts that the team plans to use to keep the community informed about progress are more than enough. There is an easy to follow plan to report progress on the release of each milestone.\n\n In addition, the team plans to offer support via their Discord server, keeping open another line of communication with the community.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15357, "q0": "The project is very newly defined with the problem staying much humble as what the team said we are just a small team but tackle the very niche problem. Likewise, the solution is very interesting to watch with the 3rd node proposal. The team also has experience with their Oura and Pallas project, there is a slight concern from the PA as the team core programming language is RUST instead of PLUSTUS. Yet they are experienced and contributed to the Cardano community which makes them very reliable. Thus, the PA gave an encouraging point for a very innovative proposal. \nThe Feasibility is very clear and clean with the co", "q0r": 5, "q1": "The Feasibility is very clear and clean with the core of 4 team members and clear task alignment amongst the 4 of them. Budgets are by the hour based on the tasks completed with the project manager/ Rust developer/ Engineer and Technical Writer. Milestones are PoC, Features, and Documentation with clearly defined resources for each milestone. One recommendation from the PA is the deadline attached to each milestone so that the community can know when the project will be completed. This is very much needed as the team also shared their wish to come back for the v2 version to gather more funds for upcoming proposals.", "q1r": 5, "q2": "The Auditability is simply followed in their released versions with the milestones in the feasibility proposal. Moreover, there is more that can be tracked via Github/Discord and a Twitter weekly summary. It would be advised that the team can share the hyperlinks of these accounts so that the community can easily find and then follow them. The success picture is quite generic, it is advised to be more quantifiable xx of Projects within the Cardano ecosystem using the new Data Node. There should be a follow-up survey from users to gather feedback for the core team for example \"how much saving in infrastructure costs, how is the improvement of users' data-intensive workloads/ what can be advice for the team in the v2 version.", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We'll develop a new node, fine-tuned to solve a very narrow scope: keeping an updated copy of the ledger and replying to queries from trusted clients, while requiring a small fraction of the resources", "experience": "We're TxPipe, a small team of seasoned developers passionate about Open Source and Cardano. It is the team behind existing projects such as Oura & Pallas. We specialize in backend development, data pipelines and cloud architecture. Rust is our language of choice."}