{"id": 422336, "author": "joey.chessher", "title": "Technical Resource Pool", "url": "https://cardano.ideascale.com/a/dtd/422336-48088", "category": 26597, "amount": 11500, "description": "There is no Technical Resource Pool where Non-Programmers can access the Programming Talent needed for their proposals to be completed successfully.", "f6_no_assessments": 10, "f6_rating": 3.6333333333333337, "videos": [], "media": [], "f6_assessments": [{"id": 1401, "q0": "Yes, this proposal effectively addresses the challenge by creating a platform where blockchain experts and non-experts can connect and collaborate together. \n\nThe proposer does a good job at outlining the existing problem: there is no site to connect developers with non-developers in the ecosystem. By building a site for these groups to go and find one another is a great idea. Reading through the proposals submitted in F9, there are many which seek to hire specific roles to help them complete their projects. If successful, a proposal like this could be the place that those groups go to find what they are looking for. \n\nAs mentioned by the proposer, this website is envisioned for more than just blockchain devs finding projects but instead includes a variety of other technical skills (graphic design, website creation) that may be required by teams who don't have them in-house. This approach certainly aligns with the challenge by creating a common forum where different specialists can interact. \n\nOverall, this project seems like it could have a major impact for the community if realized. ", "q0r": 5, "q1": "Yes, given the experience and plan presented, it is very likely that this proposal will be implemented successfully. \n\nFirst and foremost, Joey Chessher is an excellent community member and has been active representing the Toolmakers and Maintainers Community in the Catalyst Circle. Joey continues to approach every challenge with a positive attitude and keen interest in helping everyone succeed. While I really wish more details had of been provided for the rest of the team, knowing Joey is on the team gives confidence in its feasibility. \n\nNext, the plan is decent but I think there could have been a bit more detail as to the platform's development, marketing, and testing. As written the proposal spans eight weeks, yet it is unclear whether this is an appropriate timeframe given that the entire platform will be built from scratch. To improve this gap I would encourage the proposer to consider explaining any outreach done to date, including any potential interest from technical experts in the community. By adding these components it would help readers better understand whether the project is actually feasible. For example, who would be building the platform and do you have comparable costs/activities that you could point to? As of right now it's a bit of \"trust us\". ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal.\n\nOverall, the proposer plans to track the project's progress through the regular catalyst reporting, and at the Catalyst After Town Halls, Swarm, and Community events. However, I would have liked to see a bit more auditing of the development side itself. How will you be auditing the build? How often will it undergo testing? And who/what group do you envision supporting the auditing of the platform? Would the code be made available on github for community review? \n\nThe reason I am taking off a mark here is that there are no real tangible success measures that could be used to determine if/if not the project was successful. As they stand, the measures are abstract and do not really lend themselves to being measured. For example, how do you measure \"active participation\"? What amount of use on the platform would represent sufficient engagement by people using the site? \n\nI would encourage the proposers to consider adding in more measurable KPIs and thresholds for the measures. If you want to track traffic to the site, then the KPI could be # of visitors, and the Measurement could be 1000 visitors within the first six months. Framing it in this clear and measurable way reduces the need for the community to interpret at what stage you would deem it a success. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1962, "q0": "The proposed service to create a technical resource pool is relevant given the challenge settings available in fund 9. The coupling to the “Developer Ecosystem” campaign brief is not the strongest, but sufficient, in terms of impact. This is primarily because it will help increase the developer productivity and resource management from the Cardano Ecosystems perspective. \n\nThere are some questions that could be addressed in the proposal to make it more credible and give voters confidence. \n\nThere is no definite mention of Cardano specific talent in the proposal, why would this service be favorable over already existing solutions that provide general technical resources? It is a somewhat competitive market and it is unclear how this service will stand out against competition in order to gain the traction needed for widespread use. A recommendation would be to provide a clear plan stating how you will market the service and why your service is necessary for the ecosystem. The proposal in its current state does not provide any type of significant niche or argumentation that would give voters much confidence that this proposal is impactful. Examples could be: Do you target the Cardano Developer system primarily or a general crowd of technical resources? In order for the proposal to be more impactful, a stronger coupling to the Cardano ecosystem would be preferable.\n\nGiven the questions raised in terms of impact, a neutral score will be given and it is recommended to address at least some of these in the future in order to raise the impact score. For now, the score will be 3 points. ", "q0r": 3, "q1": "The proposer and the developer in question that will develop this service are deemed to have the experience required in order to develop at least a POC of the Technical Resource Pool. The detailed plan is split into 8 weeks where it is implied that the project should be finished after week 8. However, the project will be presented to the community during week 7 & 8 where feedback will be gathered. What will happen with this feedback and functions that you aspire to develop? There is no room or time (or budget?) set aside for this. It would be preferable if you could state more clearly what the plan is with the service after week 8. It is mentioned that you will seek further funding to develop the service, is it presumed that it is a fully functional product by then? Or is it a POC that will be refined over multiple funds?\nThese questions are raised because it is hard to understand if this project will be a fully functional service or more of a POC, and it is not very clear given the somewhat sparse plan and budget. A developer can only do a finite amount of work over an 8 week span. Answering these questions would increase the feasibility of the proposal and increase the voters confidence in the project. \n\nAll in all, the detailed plan is sufficient if the given scope is limited. This should be defined more clearly as stated. The budget seems fair but it should be further broken down with hourly rates and time estimates in order to justify your claims. Example:\nDBA Database Design – 100 hours * 45 $ = 4500 USD\n\nIt is hard to judge if the project is feasible or not since the scope is not very clear. Given the above argumentation, a neutral score of 3 points will be given in terms of feasibility.", "q1r": 3, "q2": "In terms of auditing the project, the community will be updated at “Project Catalyst After Town Halls, Swarm events and Community Zoom meetings”. It is great to provide the information in so many places but it leaves a big question mark. How do I really audit the project? Do I have to attend all these forums in order to get the whole picture? Will you present the same information at all these meetings? It is unclear how the community and voters can follow this project in an easy manner. It would be favorable to provide one main channel that either lists all relevant updates in chronological order. This should ideally be in text format in a public channel such as a Discord server, gitbook, or website/blog. \n\nFurthermore, there is no clear definition of success that is measurable. Currently success is defined in soft terms with no way of evaluating the success with the question: Did the project succeed according to their goals x, y, z [Yes/No].\nAn example could be to add definition of success such as: \n- 100 Proposers and Technical Resources used the service by the end of the year.\n- 25 Proposers found Technical Resources by the end of the year.\n Etc. This also raises the question about how you would gather this information so that you can measure your success against these goals? That is also just as important to provide information about in order to raise credibility.\n\nAs it stands now, it is hard to claim that the proposal is easy to audit. The intention is right but it would need further concretization according to the points raised above. For now, the score will be 3 points in terms of auditability.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 747, "q0": "The proposal aims to connect project owners with developing resources via a custom build website. The proposers identify the need for developers to advertise their capabilities. The proposer also takes note that not all of the technical requirements are for blockchain developers, but rather that a successful project also needs front-end and back-end developers. A platform like this would be beneficial to attract developers with these skill sets to Cardano. The proposer does not mention how the platform could scale, but an automated job board could service a large number of individuals. The proposer would come back for additional funding if the platform becomes popular. From personal experience, there is no lack of technical resources with generic front-end and back-end skills and there are freelancing websites such as fiverr.com that provide networking opportunities. The lacking resource is experienced blockchain developers with Haskell experience. Therefore in general an additional advertising board does not do any harm, but I do not see a strong case made for how it complements or goes beyond what is already in the market as a whole, or Cardano in particular", "q0r": 3, "q1": "The proposer identifies the individual who will be working on the proposal and provide the CV’s for both of them. Joey is an accomplished project manager with decades of experience and Sean is a developer with about 2 years of experience. While reviewing the CV I would suggest that Sean places the most recent experience first. Given the project is quite technical in nature I would have expected a plan of how this would be delivered in quite some detail, including the languages to be used the front-end frameworks and the backend infrastructure, and possible prototypes that the team has worked on - this information is not provided in the proposal which leaves me skeptical on the ability to deliver the project within the projected 8 weeks. The project schedule is split into buckets for 2 weeks and the budget is allocated approximately in the same way. The budget is set at $11k which I would consider fairly competitive for a fully functioning website that connect projects with developers. $8k of the budget is to pay for the front-end and back-end development and $500 for project management, this is reasonable for 8 weeks of work for two people, but I feel like the project management budget is set a little too low. From personal experience of developing full stack websites it is important to set-out upfront what stack will be used (React, Angular, Vue, NextJs), what CSS engine will be used and what back-end services will be needed. If this is yet to be decided then it would seem the proposal needs a few extra months to complete. The key risk identified is the developer not being available to do the work, in which case the project manage will look for replacements. The individual have the skills to deliver a project of this type, but there needs to be more planning in how this will be done. I therefore neither agree, nor disagree that that the project is feasible.", "q1r": 3, "q2": "A roadman is presented with what features will be completed by which date within the 8 week schedule. Thee budget is also set accordingly. The proposer will provide a monthly status report and will update the community in the Catalyst townhalls and Swarm events. There is however no mention of KPIs nor metrics that the community could track the deliverable. However the project will last only for 8 weeks there is potentially only 1 checkpoint in between. Success would be the application being used by Proposers to find Technical resources to complete their projects. Here it would be good to have an intermediate measure such as 2 successful connections between proposers and technical resources. I agree that the project can be audited as there is an objective deliverable and the proposer provide the communication channel for updates.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 1317, "q0": "The proposal aims to develop a website which will serve for connecting the people who are having an idea to be developed, but they are lacking technical manpower to perform it. The problem is identified that currently, there is not existing website for such needs, and (I assume) that is why some projects may fail. The website will serve for both ends 1. To offer technical services 2. To post a project and demand technical services. This is a good idea, that can eventually increase the success rate of many projects, and due to the lack of technical resources, we can at least have a common place to share it – work marketplace. The risks that proposer identified are all good, but the main risk – is definitely community adaptation, and it would be suitable to provide a solution to that – by simply involving marketing to the budget, or if the marketing would be free on public channels, than at least have it in the roadmap. The last note for the proposer – in the past, there were already many attempts to create such a website, I do not keep track whether they exist or not, but I suggest to check it, in order to avoid building something that already exist.", "q0r": 5, "q1": "The roadmap is planned for 8 weeks, and the action items/tasks to be performed are outlined on the weekly milestones. I find the detail suitable and just to outline, the longest activity for three weeks is focused on Project development, coding testing and debugging. The budget requested is 11 500 USD in total, and is divided into five items. This detail is appearing reasonable, but what I am missing is the expected hour donation for performing the tasks, in order to increase the clarity of the proposal. Regarding the team, it is currently consisting of 2 people, whereas the linked in profile is posted for the creator of the proposal, and the development will be performed by the second member of the team, but there is no bio nor linked in posted. At the same time, there are actually no links, demos, previews of previous work, thus, it is not possible to verify proposers capability to deliver the final outcome. ", "q1r": 3, "q2": "The problem (non-existing marketplace to find technical manpower) and the solution (the create such a place) is clear, and logical. The progress will be tracked by monthly report at Town Halls, Swarm events and Zoom meetings – to be honest, if the work is estimated for 2 months, then I think it should be at least 2x per month. The success is defined as “active participation by both Proposers and Technical Resources.” which I think is not interpreted correctly. The success metrics should be – number of users, number of posts, number of formed partnerships. Also, once developed, I suggest to launch a telegram or discord or even twitter. Telegram for faster communication between users + to serve for announcements to community for better tracking. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4958, "q0": "The proposal addresses a critical need within the Catalyst ecosystem: matching technical expertise with funded proposers. The team will build a website with two sides. 1 for proposers and funded projects and 2 for individuals with technical skills. Proposers will be able to post an overview of their proposals, their technical requirements and contact information. Technical individuals will put up their skill sets and available hours. That is all the detail we are given for the website.\n\nThe proposal addresses the exploration stage of the developer journey into Cardano. Developers who are interested in work will be able to find work related to Catalyst through the website built in this proposal. This will increase the number of developers building on Cardano. \n\nThere are many problems though. The proposers have not offered any information on how they plan to get people to use the website. There is no information on marketing or any consideration for hosting the website. I don't think they have thought about anything other than building the website, and I don't think they have thought about that a lot either, since there isn't much detail available. ", "q0r": 3, "q1": "The project will be done by a team of two. Sean does the programming and Joey does everything else. Through Joey's linkedin we see that he is knowledgeable in IT project management but he has no skills in software development. That's OK, since the project is very simple technically and Sean is there to provide the software skills. The problem is that we don't know for certain Sean has those skills. No linkedin or additional info is provided to verify this and a google search of his name doesn't lead us anywhere. Either way, the technical need here is minimal, so I think they can get it done.\n\nThe real issue is the lack of consideration for marketing the tool. If nobody uses it, it won't be of any use. They do mention they will share the tool in Catalyst communities but that's where their marketing efforts end. I would have like to see a detailed explanation on how they'll find technical individuals to put their info on the website but it is completely missing. I don't think they thought about this at all. That makes me question how likely it is this group can deliver not only a website, but a useful tool that helps developers from inside and outside of Catalyst find jobs in Catalyst projects.", "q1r": 2, "q2": "There is almost no detail to how this proposal would be audited. Relating to project progress, this is all the info we're given: \"We will update the community at the Project Catalyst After Town Halls, Swarm events and Community Zoom meetings.\" They'll share information through meetings. That's good but it's certainly not enough. They'll also do a monthly report of project status. Through which communication channel? Including which details? We have no idea. \n\nAlso, where is the git repository where we can check the progress of development? As a developer myself, I'm highly critical when an open source software project fails to mention git in regards to project progress. Especially since this is a \"free service to the community\". It should have a public git repository where we can check what the software is at. \n\nFinally, the success of the proposal is defined very poorly. It says: \"Success would be active participation by both Proposers and Technical Resources.\" What does that mean? If 20 funded proposers and technical resources (technical individuals) use the system is that success? We don't know. \n\nI would suggest to the proposers to give more detail on EVERY piece of this proposal. It is very lacking.\n\n", "q2r": 1, "assessor": "z_assessor_2643", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5114, "q0": "This project aims to create a technical talent pool so that the general public can access technical talent for projects. It also helps general programmers/technical talents to be exposed and receive more opportunities in the Cardano Ecosystem. The author also provides ways to make this project sustainable by providing a donation option so that this project could remain accessible. This proposal is closely in line with the challenge’s problem as it provides benefits by creating incentivized and non-intrusive ways for general developers into the Cardano Ecosystem so that hopefully, those talents could eventually join the community.", "q0r": 5, "q1": "The implementation plan is quite comprehensive. First of all, the team manager has a very relevant experience for the role. The finished product of this proposal would be carried out as a website, and the roadmap successfully reflects that. The milestones laid out for every week are pretty feasible and very detailed. The author has also considered three main risks that come with this project: insufficient funding, insufficient time, and community engagement. The author plans to mitigate the first two risks by replacing the programmer’s role to fit the time and budget. One thing that would be helpful to add is to allocate a buffer time frame so that it would not be late. Overall, this proposal is very feasible to be delivered successfully. ", "q1r": 5, "q2": "The reporting would be held monthly at the After Town Halls and several other events. This plan makes it very accessible to the community. The proposal also has detailed milestones that could measure the development progress. The author could add quantifiable measures of these metrics, such as how many % to finish the milestone. The author also has a clear vision of the critical indicator of success. However, it would be helpful if the author included some measurables that reflect these indicators. If the author could add these measures, it would significantly improve the already good auditability of this proposal.", "q2r": 4, "assessor": "z_assessor_2672", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9884, "q0": "Problem is stating  the difficulty of finding people with technical knowledge for proposal projects. As a solution, they want to build  a website where funded proposals and people with technical knowledge can communicate/collaboration. In addition, this website that they will establish will not only be in the Catalyst ecosystem, but will also include people with technical knowledge outside the ecosystem to the projects.\nAlthough it is important as an idea, they did not share enough details about how to do it.\nThey just said that they will create a website for the problem and the problem.\nI cannot comment further as they do not provide details. I'm giving 3 stars instead of 2 stars because it's not too technical and I like the idea.", "q0r": 3, "q1": "The project will be done by two people. When we look at the overall , it can be easily done by team of 2 people since it is not a project that requires a lot of technical competence. The shortcoming here is that they did not put a link with which we could access information. We can't find any other information about them other than the text they add to the Feasibility section.The budget they stated seems appropriate for a project of this scale, but I have not seen detailed planning onbudget ; How will they arrange the payments hourly? For example How they will manage the money they want for project management should have been explained in more detail.", "q1r": 2, "q2": "They did not provide enough information on how they audit the project. They mentioned that they will report monthly, but how will they do it or which tools will they use for reporting? There are no milestones at all for development and auditing process. They did not mention any channel for community to track the project. They did not give almost any details for the audit part and they stated \" succed would be active participation by both proposers and technical resources \" It made no sense", "q2r": 1, "assessor": "z_assessor_3125", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11491, "q0": "The proposal does not directly address the challenge, its focus is on creating a pool of mostly technical non-blockchain developers that proposers or funded ideas can contact for basic yet complex tech jobs; website building, bug fixing etc. Although the proposal has a different solution based approach for proposers, it indirectly benefits non-blockchain developers looking to score gigs or partake in some project under the cardano umbrella without knowledge in Plutus, Haskell or some other language used by blockchain developers on cardano. The proposal states the creation of this talent pool will attract outsiders to the ecosystem, building up cardano’s adoption rates and creating a supportive central marketplace for both technical blockchain and non-blockchain developers to attract jobs for proposers who need it. Equally, the imprints of the project will be its migration of developers from outside marketplaces into cardano, for opportunity, and subsequently assimilating into the ecosystem, learning its languages and partaking in innovations that change the infrastructure of cardano. I strongly agree that the proposal has a high impact and has addressed the challenge effectively. \n", "q0r": 5, "q1": "The team seems qualified in building the website marketplace, servicing developers and proposers on the Cardano platform, as well as managing the affairs of the project. The provided information shows how qualified the two-person team is in handling the project. The proposal includes a stated period for achieving certain milestones under the project. The roadmap in building this marketplace is very achievable, and its intent of being a free service/resource for the cardano community creates an ease in finding cardano developers in the community as well as fine tune the experiences of all new developers to join from other markets. The main concern I do have with the proposal is the list of risks identified in terms of operating, yet, not much attempt was put into solutions that can mitigate these risks should they arise. It is very unclear what the team will do in an externally challenging situation. Also, the presented budget is very reasonable looking at how it's spent, but considering the need to attract more technical non-blockchain from outside markets, it would have been commendable if the team had mentioned its promotional strategies as well as regulations and onboarding processes, to assure its users of great experiences on the marketplace. This project is great nonetheless and has a high success rate, in building and assembling the necessary users onto the platform. I score it a 5 for feasibility. ", "q1r": 5, "q2": "The team is concerned with the auditability of its project. It has included mediums with which the community can interact with the project during implementation. Also, the team indicates the likelihood of monthly reports to the catalyst community and its presence at events; project catalyst after townhalls, swarm events, and community zoom meetings to update the community on its progressions and even risks met during the development and initial operation. The project as stated in the proposal is expected to run for two months, and its success has a few determining markers; KPIs to measure growth, but after all a smooth website development, testing and onboarding of prospective users onto the platform to transact business would count for success and maybe with a few risks to assess. I think this project is very simple to track and with all the information provided, it can transition from an idea to implementation. I give it a 5 out of 5. \n", "q2r": 5, "assessor": "z_assessor_3252", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11742, "q0": "The problem the team raised was that there would be no group of Technical Resources where Non-Programmers would have access to the Programming Talents needed for their proposals to be completed. So the goal is to build a website for Proponents and Funded Projects who need Technical Resources can post their requests and contact information and where Programmers can post it their availability and skill sets. When the website is built, it will be a place to provide free services to the community; it will be where Technical Resources can post their Skill Sets and working hours. With these goals in mind, I think the proposal is perfectly suited to this challenge.\nI haven't seen the team come up with a solution for this project, the suggestions the team makes as an explanation to the community, and External Technical Resources about the benefits of building a website that the team publishes created to use it. What the community wants to know is the solution to build a web that meets the recommendations of the group. So what are those solutions? When it comes to building a website, we will have many things to prepare such as ideas, images, content, and funding. It is good if we can customize and build the website ourselves, but it is not simple and will take a lot of your time. Choosing interface templates or using drag-and-drop tools can be suitable for units that need a fast and cost-effective website solution.\nThe team identified the main risk of this project as whether the budget and time would allow them to do so. And does the group of participants meet the requirements of the project? The group has outlined solutions if such risks occur. For the community, their participation and acceptance are always a risk, which will have to wait until the project is completed before we can see it. So I think the best solution is for the community to believe and accept that the website must bring the maximum utility to the community as possible.", "q0r": 3, "q1": "There is no doubt about the work to complete this project, the proposal team has made the tasks too clear and has a specific timeline according to each week. With this detailed plan, I think the team will be able to execute the project on schedule.\nThe budget has been split and transparent. The proposal has provided a detailed explanation of the budget for each specific job. Almost the team has given all the costs related to the construction of this website, which has convinced the community.\nSheikholeslam is a difficult keyword to search through the media. We need to know more about their job, industry, and experience. If this proposal gets funded I will return to Catalyst in the next round. Because once the system is available and accessed by many people, we accumulate more new features and improve it to make it more complete.", "q1r": 5, "q2": "The team hasn't come up with a weekly or monthly performance measure yet, so what does the monthly report show on top of that? For example, when choosing a research site, or domain name in the first week, we should give a few locations or domain names to choose from and reject. What we need to see is whether the proposed team can complete those indicators on the final report.\nThe success of the proposal is something that can be easily seen: the involvement of the Proponent and Technical Resources. The group showed what was the success achieved by each group of participants. And of course, their success is also the success of the project.\n", "q2r": 4, "assessor": "z_assessor_3273", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13859, "q0": "Developing a platform where developers can meet proposers might be the cornerstone of real Developer Ecosystem improvement. A website where experienced or inexperienced developers can find job opportunities and proposers that might come from different backgrounds and don’t exactly enjoy developing experience or knowledge is certainly addressing the challenge of enhancing Cardano Developer Ecosystem. It might also be engaging and a drawing opportunity for outsiders that are looking for interesting proposals. It might also help a great deal enhancing internal dynamics and communication to have a platform where entrepreneurs and experts meet and develop Cardano Catalyst networking. ", "q0r": 5, "q1": "Feasibility is endangered with sarce experience in the developing field and although the team leader claims to have wide experience in managing websites developments it’s certainly no guarantee of having the expert he needs on board. Also, timeline and key milestones seem too optimistic and as if designed by a non-expert are not consistent at all. Budget breakdown suffers from the same problem. This super interesting proposal needs further investigation and development. It might be interesting for the team leader to guarantee an experienced developer into the team that helps him design timelines and a proper budget. The idea behind it really deserves the effort. \n", "q1r": 3, "q2": "This proposal lacks a serious auditability strategy. KPIs and metrics are missing. Participation of both Proposers and Technical Resources is just the abstract concept that needs further detailed planning for the auditability to be consistent. Monthly reporting is fine but there is no mention of any concrete communicational channel with the community. The information provided is insufficient to audit the progress and the success of the proposal. But, as happened with experience and planning, the idea behind the proposal presentation deserves the effort of deepening investigation and information. ", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Build a site where Proposers and Funded Projects who need Technical Resources can post their requirements and contact information and where Programmers can post their availability and skillsets.", "experience": "PMP (Project Management Professional) see attached doc.\nProject Management and Team Building. Recruited and managed diverse groups of application developers, network engineers and Security Specialist to create, manage and migrate Databases and Applications to Cloud Base Services"}