{"id": 422405, "author": "cardano4climate", "title": "Onboard Devs with Impactful Events", "url": "https://cardano.ideascale.com/a/dtd/422405-48088", "category": 26597, "amount": 13300, "description": "Full of ideas, skill, and talent, Cardano developers don't find meaningful projects and fruitful collaborations. The developer experience is solitary. World-changing, killer apps never Hello World.", "f6_no_assessments": 9, "f6_rating": 4.37037037037037, "videos": [], "media": [], "f6_assessments": [{"id": 753, "q0": "The proposers identify the need of a welcoming environment to onboard new developer and provide them with a starter pack to get started on Cardano. The events are targeted towards this. The proposer aims to add value by running 3 workshops for new developers over 3 months. The goal aligns with the challenge setting to attract high-calibre Developers and ensure the developers have ample resources to work on platforms that suit their interests. The proposer will be able to replicate the format of the workshop after the first 3 months with additional funding. I personally receive regular updates from the proposers regarding other events they host, therefore the brand has been with Cardano for many months and have a track record of reaching out to the community", "q0r": 5, "q1": "The proposer provides a list of people who will work on the project and describes their skillsets, however only the first name of the people are provided and no links to social pages are provided, which creates an impression of anonymity. It would have been great to check the background of the individuals who will work on the project to judge the merit of each on. I would suggest that prosper includes this information in the next iterations. There are a total of 8 people who will be involved, this is plenty to run a workshop and prepare documentation, it is good to see that there is contingency should some of them not be available for the event. The budget is broken down in great detail (6 categories) with a logical explanation of how it will be spent. The budget is reasonably set, the net cost will be c. $4.4k per event which includes slideshows, videos, marketing and speakers’ salaries. The proposal does not include a detailed plan of who and when will complete what tasks, however, the event will follow a tried and tested format that the team has delivered on other topics. It would still however be good to see a detailed plan in future iterations as it gives comfort that the team has a detailed plan to complete the work. The plan does include the resources to complete the work and is broken out in the budget section of the proposal. The proposal does not explain the architecture, or the software to be used, however, the project is not a technical deliverable and nothing will be built as such, but rather information will be provided to developers. The proposal considers the risks that developers might fail to recognize the potential in Cardano, that that onboarding might be ineffective, and the community might grow faster than they are able to facilitate events. These risks are true to most proposals. To address these the proposer will use welcoming languages, reference official material, and continue to grow their offering. As a facilitator of workshops myself there is nothing in the proposal that makes me doubt their ability to deliver, only the fact that it is not possible to check the background of tutors.", "q1r": 4, "q2": "The plan lacks a formal plan, however, it is made clear that the workshops will be delivered monthly and will be produced by an established team who runs other workshops for the cardano4climate brand. The KPIs are provided which aim to measure the number of users on their social media accounts and chat servers. It would have been nice to see metrics tracking the number of participants in the events and collecting feedback post-event - this is something quite normal in the corporations where the organizers collect feedback to understand how it can be improved in the future and track return on intentions. Progress will be communicated communicate on their social media accounts and the workshops will be recorded and made available on YouTube. I have no doubt that the team can deliver the proposal, but I would have liked to see more focused metrics on participation and return on intentions.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 973, "q0": "The proposal is very well written and seems meaningful. However, it fails to provide any evidence of the impact of the activities being proposed. Given the fact that this initiative took root 10 months ago, I would have expected the results to speak for themselves. The fact that they don't is probably telling. At least no results or evidence of this initiative’s effectiveness is cited in the proposal. If there are, I would strongly advise the team to include them next time.\n\nIt isn't sufficiently presented in the proposal, and it wasn’t clear, why this project is a good fit for the Developer Ecosystem challenge.  Apart from mentioning the intention to host a new series in their program, titled  “Developer Impact”, no other connection is explicitly made.\n\nI'm providing this feedback based on the fact that I've been part of the Catalyst community since February 2021 and have engaged with Cardano development communities since March 2021. I have also worked directly with  Cardano developers since July 2021.", "q0r": 2, "q1": "The Cardano4Climate group has proven that they can organise and have organised a similar event in the past, starting in November 2021, as such I have no doubt that they have the capabilities to do it successfully funded in the future (I have looked at the question of how meaningful they would be in the first part of my assessment).\n\nHowever, the implementation plan presented in the proposal seems to focus more on what the group has already accomplished, and the actual deliverables of the proposal are presented only as bullet points. I wish they would have expanded on them a bit, for instance instead of writing just “Thematic event” I would have liked to see what are the themes that they think would make sense for developers.\n\nThe budget breakdown is very detailed and thorough covering all aspects of the event(s) production, including an amount set aside for contingency use.\n\nThe team seems to be made up of very motivated and dedicated individuals. I also really like the way they chose to present themselves.\n\nThe questions about the workload on previously funded proposals and projects, submitted as proposals in Fund 9 are answered “Yes”.  However, no additional details are provided in the main feasibility section as now requested when submitting the proposal. I won't take points off of my score for this, as the questions are new to Fund 9, but I do recommend that the team include these details on future submissions.", "q1r": 4, "q2": "I really like the fact that the proposers have included a number of channels where they will publish news and info about their deliverables. Maximum transparency is important, especially since the proposal is for a community project.\n\nThe KPIs presented are clear, logical and would be easy to track, but they are probably a bit to focused on social media growth. I would have really liked to see some metrics to track the more tangible aspect of the proposal.", "q2r": 4, "assessor": "z_assessor_2169", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 999, "q0": "The problem described is somewhat aligned with one of the objectives of the challenge which is to motivate developers. Connecting developers with meaningful projects and fruitful collaborations would serve an important purpose.\nThe team plans to run a 3-phase event based on the model they had created. The first event mainly focusing on boarding, the second on use-cases of the third on project catalyst. I would have preferred if the proposal had explained how these events specifically targets developers and not the wider community in general. \nMore information on the specific topics for developers such as on Plutus; or plans of inviting active developers to speak with the new members; or organization of a developer focused hackaton would have made this proposal much more aligned with the challenge objectives.", "q0r": 3, "q1": "The project is run by a well-experienced team with growing wide reach. They have run several iterations of similar events. Over the past 10 months they have built a strong organic community on telegram and discord. They also have a strong link with other catalyst communities. \nMore clarification on makes the events different from other catalyst on-boarding events; and more specifics on how they will reach new developers could have justified the budget breakdown especially that of ‘event management’ and ‘marketing’ allocation. \nThe events in on themselves are quite straightforward and are timed on a very realistic schedule. Although specific dates of delivery are not provided, this is not a problem as they plan to run the events according to the timeline of Fund 10.", "q1r": 4, "q2": "The project has 3 main deliverables with clear timeline, which makes auditing the proposal quite easy. The performance indicators are mostly online meet-ups which they plan to upload on YouTube and publish on Github, which can easily be tracked.", "q2r": 5, "assessor": "z_assessor_2176", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1766, "q0": "The problem statement directly speaks about how developers are often solitary––one of the significant reasons the Developer Ecosystem Challenge was created. The first six words of the very clear problem statement offer a perspective for voters to see such developers through before even getting to the problem––well done. An excellent fit. \n\nThe solution of hosting these unique gatherings will have a positive impact on the Dev ecosystem and Cardano at large. It's one thing for communities to offer social benefits. The meetings described go further and contribute to a deeper purpose for those in the dev ecosystem––connecting the work of utilizing the bleeding edge of cryptography to help save our world. This value-add is profound and offers a more purpose-level reason for new devs and old to become a part of Cardano/Catalyst/and the Cardano4Climate group. \n\nThe purpose behind the three meetings, which essentially constitutes their KPIs for the Impact section, matches very well with the Challenge in that they speak of connection, support, collaboration on developing ideas, and so on. These directly answer the problem: \"...developers don't find meaningful projects and fruitful collaborations. The developer experience is solitary.\" Well done.\n\nThe risk section can often tell voters a lot about how deeply a proposer has thought about the implications of their proposed work.\n\nInspired by your deep considerations of potential risks and thorough mitigation tactics, I'd like to share a thought with the proposers: If looking for fresh ideas for these or future gatherings, consider searching \"event\" or \"hub\" in funded proposals, currently F8 and before, on Lido Nation's tool (tinyurl.com/CatalystProposals). The results are a window into such knowledge gained. They seem a great place to discuss this particular topic in a meaningful way, even as the community grows as rapidly as you mentioned.", "q0r": 5, "q1": "The detailed plan section needs attention for the sake of voters looking for a plan. Currently, the plan consists of a list of 4 deliverables (timetable included) from the 3 events at the bottom of several paragraphs of, albeit valuable, historical context. If rewriting, please consider one idea of offering the detailed plan as the priority for voters and the historical context after. Also, consider adding the actionable tasks and order of execution. At present, these are missing elements to the team's detailed plan. This is the rationale for 4 stars.\n\nThe budget is thorough, and costs are articulated well for voters' ease. If rewriting, perhaps adding the total paid for each of the four bulleted items under  \"Event Planning Budget\" would add even more transparency for voters and perhaps for future proposers who will benefit from seeing such totals when researching past proposals. As someone who has worked in event organization and logistics, the budget is more than reasonable for the events mentioned, especially given the historical context of the team's past experiences.\n\nThe skillsets are implied in the plan. When offering the proposal team by name, voters will benefit from the attention paid to providing \"relevant experience,\" as this area of feasibility suggests. There are 8 team members and many community members the team can likely find help from if they find a need; the team is clearly well-staffed.\n", "q1r": 4, "q2": "There is no roadmap with milestones in this section, though something similar exists at the end of the detailed plan section. If rewriting, a roadmap in auditability would be helpful, especially along with the great list of KPIs offered. \n\nThe metrics offered to track the growth of their organization, which is undoubtedly an outcome of continually improving the developer ecosystem, and in that way quantify success. Another potential area to track could be the simple survey attendees might fill out at the close of the third event. Perhaps an anonymous google form survey with 2 or 3 questions.\n\nAs all weekly planning meetings are published, the team has created a built-in auditability tool for everything they do. Voters can find links to these in the proposal.", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3488, "q0": "The main idea of this proposal is to make a new series of events (3) focused on showcasing the impact of developers targeting an audicence primarily outisde Cardano community. It's a nice approach to show people how Cardano can have powerful projects and possibly attract new developers, being so, aligned with challenge (aiming at challenge kpis such as \"Number of developers actively building on top of Cardano\" and \"A sense of community and conversations\").\nOne thing that I really liked here is that proposal brings examples of other events that were already held by C4C (cardano 4 climate team), explaining well its value for the community.\nHowever, the strucutre of the proposed event itself could be better explored here. It could mention, for instance, whether event will be online or offilne (it seems to be only online but this is not clearly mentioned), how they will communicate and engage people both to attend and speak, what sorts of presentations it will have (round-table talks, regular speeches, workshops, fair/stands/breakout rooms, discussion panels, etc). It would be good also to have interative activities related to Cardano and blockchain, maybe leveraging some of the products developed in Cardano so far.\nI would also mention what were the lessons learned with previous events and how they will improve them here.\n\nIn a summary, it is a nice idea that will add value to the ecosytem but more information on the main events could be provided. My rate is 4.", "q0r": 4, "q1": "The plan of this project is based on the 3 events that will be held following the time-frame of next Catalyst fund (F10). However, it could be better detailed here the supporting activities necessary to hold this events, that needs to happen before than. There's one line for \"Event Planning Documentation\" but it seems a bit generic and it doesnt have a time period. there are other activities such as setting up infratrucutre (whether online or offline), marketing the event, inviting speaker, and so on, that could be included here.\n\nBudget breakdown is fair and matches project scope. It's nice a marketing line is already considered.\n\nTeam is composed of 8 people already committed that seem to have a good network of connection in Cardano. It could, however, have more details on their past experience and linkedin links be provided.\n\nAll in all, I  agree project is feasible specially considering c4c team has already held several similar events. However, some information here could be better ellaborated, as my comments above. My rate is therefore 4.\n", "q1r": 4, "q2": "All the events will be recorded and uploaded online just as their weekly meetings. The information will be avilavle in their github and youtube channel to anyone see it. Moreover, good kpis are provided and some of them already have target, making it easier to check success. One metric I'd add is feedback collected after each event to see the quality of it and improve overtime.\nOverall though, I strongly agree that the proposed auditable elements provided are enough. My rate is 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3569, "q0": "The proposal would host 3 monthly events in order to inspire developers and obboard new ones while building stronget dev community. The problem does identify a problem within the challenge that needs to be solved, and this problem is the lack of communication and real connection and devs who are inspired about the environment. This project will improve this environment with meetings and networking and is in line with the challenge setting, bringing positive experiences for developers. Especially relating to onboarding new developers into the community.\nRegarding the impact, there are a lot of podcasts and already existing community of about 270 people ready to lend a hand. There's a good risk assessments, IMHO as a developer. The proposal will be able to scale with future challenges. Future growth will be measured by the mentioned key metrics and the striving goals of growing the community and relationships even more is a decent one.\nI don't see any large piece missing from this proposal and overall this is a solid impactfull proposal that could do a lot of good towards the carbon footprint of cardano.\n", "q0r": 5, "q1": "I was unable to verify the listed names and skills with anything, because there are no refereance or credentials links in the proposal and because only the first name of the team member is present, I wasn't able to find any of them in google or linkedin. The only profiles I found were in the linked site https://app.dework.xyz/cardano4climate, but there isn't any usefull information about their credentials there.\nRegarding the owned skills, I can speak only to the fact they have implemented already 5 sustainability events and have a lot more planned for fund 10 and beyond. The budget breakdown seems good enough and is somewhat broken down to it's parts which have reasonable rate of $/hr which makes the cost to value ratio worth it to vote this in.\nI couldn't say if the timetable to complete the stated work is enough or not, because as a developer I don't have any such expertise, so I defer to the proposers and thier estimation on the matter. The plan for implementation seems logical and reasonable, but as I mentioned I'm a developer so take it with a grain of salt.\nThe platforms going to be used are mentioned specifically and are all good choices considering they've become a standard like - youtube videos for educational and marketing purposes, telegram and discord for discussions and twitter for growing the communiny alongside others. \nOverall despite the fact I wasn't able to verify the team members, the organization Cardano4Climate seems to get things done and you can't argue with results. Estimation is hard to do for me, due to the lack of credentials information but I'd say it's a somewhat feasible proposal, but I would have liked to look at some linkedin profiles or something that I could verify the proposal against.\n", "q1r": 4, "q2": "This is one of the most auditable proposals I've seen. They're litteraly using every platform for meetups and recording usefull content. Constant public events, a youtube channel and open github repository, discord twitter telegram, just everything.\nA clear problem, followed by a clear solution - what's not to like. Need to inspire and connect developers - create a lot of meetings, educational content and places everyone can interact and speak about their ideals and plans and ask for help and give it.\nAuditable, absolutely anyone could follow with this progress. KPIs are good, and metrics would enable the whole process to be optimized.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5285, "q0": "The cardano4climate proposal is to organize and host 3 monthly events related to impact and developer themes to onboard newcomers. The proposal answers the challenge brief quite well on how to create a positive developer experience that helps them focus on building the successful apps. Although by organizing the event related to impact, it might not match specifically on any of the listed potential directions of the challenge listed on the challenge brief, there are some benefits for developers to join the impact related events. The proposal also lists risks and ways to mitigate the risk although there is a risk that the developers might not find the events directly benefit to them and decide to pass on the events.", "q0r": 4, "q1": "The Cardano4Climate has collaborated with other Catalyst communities such as Gimbalabs, Catalyst School, WADA, Swarm, Climate Neutral Cardano SPO group, DLT360 and sustainableADA. All of which are well known players in Cardano and the group acts as a connector with Cardano foundation, IOG, Cardashift and Empowa.  There are 3 deliverables or events based on fund 10 timeline: onboarding event, thematic event and proposal showcase event and event planning documentation. The total budget is $13,300 and the team will spend $4500 on event planning. There are 8 main team members. The team should share more profiles and explain more on milestones and the time horizon for each milestone.", "q1r": 4, "q2": "The monthly events and weekly meetups are recorded and their planning meetings are recorded and uploaded on youtube channel. It is easy for public to see their work. In collaboration with Gimbalabs, they also begun an incentive and reward initiative and record it on discord and Dework. They use their telegram and discord growth rate as the KPIs. Also the number of twitter followers, participants to the event, view, like and followers on youtube. The milestones are provided as topics in general and the timeline is also stated as beginning fund 10, mid fund 10, prior voting fund 10. It is difficult for voters to know which period these are and also they don't know what to look out for in each period. The proposal could list more detail to make project easier to audit by stating clearer on the milestone and time period associated with these milestones.", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7574, "q0": "It matters if the author has pointed out that Cardano developers do not find meaningful projects and fruitful collaborations even though those projects are full of skills and talented ideas but are still unable to adapt to the current problem. This is a problem to be solved in this project and it is related to the current challenge.\nThe problem is clearly defined that's why they organize 3 monthly events related to these topics. This is a great solution I found they solved the above issues through impact and developer for new entrants and inspiring Cardano developers and building community engagement. stronger copper. The author also outlines the key risks that could undercut this challenge as:\n1. Blockchain risk is a complex topic and a complex space.\n2. Risk of technology not being developed on Cardano.\n3. Ineffective referrals and missed opportunities to connect newcomers to the right community channels.\n4. Community growth can go beyond our ability to effectively support events.\nThese are the risks that the challenge may face. But they have also outlined ways to deal with those risks. And there are also specific methods to limit the risk.", "q0r": 5, "q1": "I highly recommend this project's auditability show that it has provided a roadmap of milestones. The proposal identified clear milestones and also clearly outlined the work to be done during each of them:\n1. Cardano4Climate hosted five main Sustainability events:\nCardano & Climate Change' November 2021\nCardano & Trees' January 2022\nRegenerative agriculture and blockchain' February 2022\nPlastic & Cardano' April 2022\nOn-Chain Your Impact' June 2022\n2. Key Events Delivered (3 events based on Fund 10 timeline):\nIntroductory event (start of 10 Fund)\nThematic event (Middle 10 fund)\nProposed Exhibition Event (Before Voting for Fund 10)\nEvent Planning Document\nThese timelines make perfect sense for the project to succeed. Success is clearly described through the KPIs to measure the proposal:\n1. Our Telegram Channel & Discord Server Monthly Growth Rate is 5% Per Month\n2. Cardano4Climate events average 15% per month\n3. Number of followers on Twitter\n3. YouTube views, likes and followers\nThese parameters show that the success of the project is related to the challenges of the campaign. To solve the problem of the event team challenge C4C created an event model that follows the project's Catalytic Funding rounds. The team created 3 main events to attract users.\n1. The team focuses on ideas, networking, and collaboration by supporting impact proposals and engaging new developers and stakeholders from outside the Project Catalyst ecosystem.\n2. Gather resources, in line with individual and collective values, facilitate collaborations and thematic events that attract new members who are passionate about the topic and facilitate interaction with existing members of the community.\n3. showcase both previously funded, impact-related projects and new proposals in the current Project Catalyst funding round.\nWith the above solutions, I believe the project will be successful.", "q1r": 5, "q2": "Well-defined KPIs through monthly events and weekly meetings recorded public events listed in the Cardano & Catalyst Community Network Meetup at https://www .meetup.com/Cardano-Catalyst-Community-Network/events . The indicators can be easily measured through the social media channels that the author has listed in the proposal. The group consists of 8 main members: Melanie, Nori, Seomon, Newman, oram, Tyler, Miro, Andre they are good people and passionate about their work and are elite members who are knowledgeable about Blockchain and have over 280 (on Telegram) and 370 (on Discord) members of C4C from all over the world. This is a powerful group I think if the project is funded then success is just the destination for them. The funding requested in this proposal is $13300 less than 20% of the total challenge budget. The author's budget is broken down into reasonable expenses. With this budget I think the project will be successful.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8714, "q0": "The core idea is to organize seminars/events to introduce topics about Project Catalyst, impact, developers, and proposals, thereby raising awareness for new developers outside the community, enabling them to connect with existing members of the community to find collaborations and projects with similar ideas. Thereby fostering further engagement from new developers and a strong partnership between them and developers active on the blockchain to build and contribute to Cardano together. The purpose and target audience of this proposal shows that it is a perfect fit for the Challenge key metric. In addition to solutions that provide materials and tools to encourage new developers to learn, Cardano education for them is also a necessity. Future risks that may affect the effectiveness of the proposal have been detected and preventive and mitigation measures are put in place.", "q0r": 5, "q1": "With the experience of successfully organizing events with related topics in the past and the network of participating communities and organizations to support and collaborate, It's completely easy for the introduced members to perform well on this project this time. However, it is still necessary to provide profiles (Linkedin, CV, Github, etc) that can be referenced and attested to the capacity of the members as described. The budget clearly lists 3 items including the work and resources to prepare for the event, the working time in months, and the estimated budget for each item. In my personal opinion, working time can be further clarified based on an hourly rate so that the feasibility of the required budget can be assessed. The roadmap is also clearly designed about the time of the event and other ancillary work according to the proposed description.", "q1r": 5, "q2": "The proponent has committed to providing tools for the community and professionals to perform audits, transparency checks, and project progress tracking. The audit roadmap is also clearly outlined on the metrics that will be performed monthly. In general, the auditability of this project is easy because the necessary information is mostly outlined clearly and completely.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Organize and host 3 monthly events related to impact and developer themes to onboard newcomers, inspire Cardano developers and build stronger community engagement. We collaborate and we celebrate!", "experience": "Cardano4climate is a growing, Project Catalyst community focused on making the world work better for all people, animals, and the planet. By hosting thematic, value-aligned events, we connect use cases and developers to build real-world solutions based on the Cardano Blockchain."}