{"id": 422578, "author": "loshadro", "title": "ADA and DRC's mobile money exchange", "url": "https://cardano.ideascale.com/a/dtd/422578-48088", "category": 26597, "amount": 30000, "description": "So far no cryptocurrency offers a conversion to mobile money from the DRC\nIn the Congolese market, no cryptocurrency is used on the same footing as the mobile money of the place.", "f6_no_assessments": 6, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 759, "q0": "Yes the proposer aims to make it easier for developers to integrate payments with ADA on the DRC mobile networks by creating an API that others can leverage. Such a solution is would clearly be beneficial for the developers in DRC where mobile payments are prevalent. I have some reservation about the scalability of this service which seems to be limited the DRC unless DRC has specific conditions that make a general solution that could cover the whole of Africa or all mobile payments across the world. I would suggest the proposer expand the scope or clarify the conditions in the DRC  that would make it unique. Therefore I agree that it would benefit the community, but have reservations if it would be able scale.", "q0r": 4, "q1": "The proposers have a technical background and will be delivering the project. They have more than 4 years of experience each and are based in DRC, which aligns with the difficulty of the project and have a local presence in DRC. The team members are identified with LinkedIn profiles, Twitter accounts and GitHub pages. The project plan is set at a quite high level, and I would suggest the proposer add information on the technology they plan to use and the services they will need to deploy to maintain an API. For example, if the service integrates the Cardano ecosystem they would need to deploy a cardano-node and potentially a db-sync service to communicate between the blockchain and the payment system. The proposal's lack of implementation detail might suggest that the plan might have been designed at a high level and the rest of the detail would be decided during implementation, I would recommend a little more effort to put this writing to give confidence that there is a clear plan how this will be delivered. The proposers mention that they aim to design a mail server that will take up 13% o the budget without making further references for what they will use the mail server. The proposers aim to design a mobile application; however, it is not clear how that is relevant for deploying an API. I have developed mobile applications and it is useful to decide front if the first focus will be on Android, or Apple and wether a generic framework will be used (such as React Native), or if the plan is to code in the language of each operating system - the trade-offs need to be weighed carefully between performance and speed of development. The proposer considers that there is no risk that would lead us not to carry out our project; I would suggest the proposer review this section in future proposals. I think this is an ambitious and exciting proposal but where some of the crucial detail on implementation is lacking, therefore I do not have enough information to agree that it can be delivered as set out, yet the team is technically capable", "q1r": 3, "q2": "A roadmap from the feasibility section illustrates the key milestones the proposers aim to achieve; however, a precise timeline is missing for these milestones. There is also a lack of KPIs and Metrics. The proposal's success is stated clearly and aligns with the challenge setting of improving developers’ experience and giving access to developers to the DRC market. Given the lack of a timeline and objective KPIs, it is hard to determine how the community will track the project’s progress. I recommend the proposers provide more detail in this section, even if to them, this might seem obvious.", "q2r": 3, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 974, "q0": "This is a promising and potentially very impactful proposal that could open up the Cardano ecosystem to one of the African markets that could grow the fastest in the next decade, the DRC. The creation of an open API for conversions between ADA and mobile money could be a very significant step for the adoption of our blockchain.\n\nStrictly as a proposal presentation, the team could have done a bit of a better job to explain their technical plans, and also their vision of how the product could end up being adopted and integrated into payment applications. However, because of it’s potential I will be awarding it the highest rating.\n\nWhat I like about the team’s plan is the fact that they only want to develop the open API, but also actually go ahead and build a first use case for their service, their own mobile application.\n\nI don’t see ADA being the first payment option for many in the beginning, but with the existence of the option, chances are that it will be adopted more and more gradually.", "q0r": 5, "q1": "The team breaks down their implementation plan into phases, 8 in total, and estimates each phase in days. A total estimated time is not provided but the total amount of days is 420. It’s unclear from the proposal if some of the phases will overlap or if this represents the total time estimate for the project. However, I consider this to be a small oversight and not something that calls for a reduction of the proposal’s score.\n\nThe same 8 phase project structure is used to break down the budget. The amounts look feasible, and although they might seem very low to western eyes, especially for over a year of work they probably are reasonable in the context of the Congolese economy.\n\nThe team has provided a full list of the members who will be working on the project complete with links to their personal LinkedIn and GitHub accounts and one Twitter account also serve to confirm the claims made and the team’s credentials. They seem to be a young and motivated team that is already involved in the Cardano ecosystem, running a stake pool. What better way to support Cardano’s mission in Africa than by enabling local talent to build on the network and integrate Cardano and ADA into the community from within, making use of local knowledge.\n\nIn Fund 9 two new questions related to workload management were introduced. One about work on previously funded proposals and one about planned future work for proposals submitted in Fund 9. In the proposal, both questions are answered with yes. However, after inspecting the profile of the main proposer I’ve found that this is actually his first-ever submission to Catalyst and he also doesn’t appear as a co-proposer on other proposals ( https://www.lidonation.com/en/project-catalyst/users/2057 ). So the new questions were probably misunderstood by the submitter.", "q1r": 5, "q2": "The proposal was a bit more difficult to read as the proposers haven’t done any formatting on the text and it was missing any kind of spacing. This is not something that I’ll be lowering my assessment score for, but I recommend that they are more attentive about this in the future as it will definitely improve the chances that the proposal is actually read and approved by the voters.\n\nThe auditability section of this proposal is a bit too general and doesn’t present any plans on how the team plans to actually track and present the metrics of their implementation.\nA list of KPIs is also not given, and the only trackable metric that is mentioned is “unit tests”. I definitely would advise giving this section a bit more thought in future submissions.\n\nThe proposal however features a very comprehensive presentation of what the success of the project could bring, both for them, but more importantly for the Congolese economy. Their projections may be a bit overly optimistic at times, but their enthusiasm for the project is laudable.", "q2r": 4, "assessor": "z_assessor_2169", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3578, "q0": "The proposers want to do an API that will accept ada as payment and convert it to a congo mobile currency. I didn't know this and it's not stated in the proposal unfortunately but I found this really good document about these \"mobile money\" https://www.gsma.com/mobilefordevelopment/wp-content/uploads/2013/07/Mobile-Money-in-the-DRC_July-2013.pdf.\nI find it a bit optimistic that no possible challenges or risks are mentioned in the proposal as I can think of several like lack of funding, lack of adoption lack of knowledge about the existance of this project. The formatting is really terrible, and the authors might have put a bit more effort into doing formatting after the translations were done instead of pasting the text.\nThis proposal would have an impact over the DRC (meaning Democratic Republic of Congo if I'm not mistaken) because it will enable electronic transactions with ada apart from the mobile money, which will be great for the cardano ecosystem overall. Having said that I'm not a 100% sure this proposal is in the right challenge, because it doesn't bring more positive developer experience and it doesn't really match with most of the challenge settings and a better place might be the \"Dapps, Products and integrations ...\" challgene.\nI'm not sure about scalability, but thankfully it's a long way off, so no need to be too judgemental there. \nOverall a decent idea, but the proposal lacks some polishing and thought over the presentation.\n", "q0r": 4, "q1": "I managed to look through all listed members of the team and was left a bit wanting on the skills side, considering what they would need to develop. As a developer I'm a bit sceptical that they will manage to pull this off, but given enough time and with the right motivation they might. \nThe budget breakdown isn't reliable since I don't understand the reasoning behind building your own mail server when you can just pay for one and with a budget of 4000$ for a mail server, you can use it for a solid 10-15 years and it will be way more reliable than if you develop it on your own, not to mention the connection speeds and a plethora of other potential design problems. No time is tied to the expences of implementation or design of the mobile application and all the numbers are different and round, which tells me it's not an exact calculation of $/hr which is becomming the standard for listing budgets. I don't understand why the deployment is worth as much of the development, I find this really strange and I don't understand it. 4k for marketing and advertisements seems reasonable although compared to the rest of the items it seems a bit over the budget, but that depends on the team. Nevertheless no ad platforms or specific methods are specified.\nI think the proposal can do several optimizations regarding the development work and rerout the money left for other crucial tasks. The technical aspects of the platform are not really mentioned so I can't comment on them, but doing money conversions is no small task if you're doing everything yourself and are not planning to use a library or some framework to help them along, which is also not mentioned in the proposal. \nBecause of the listed arguments I remain sceptical on the feasibility of the proposal, but wish good luck to the proposers and to come back with a better more polished solution. If you can find someone to help you with the english translation that might help a lot because I'm really unsure If I understood everything as it was intended.\n", "q1r": 2, "q2": "The authors seem to be missing the point of the KPIs and metrics, because unit tests have nothing to do with that. Maybe there was a \"lost in translation\" because of the back and forth between google translate. The metrics are used to measure the progress of your projects progress, meaning how is development comming along adoption rates and so on, while KPIs are the things to strive for, like a target number of users to have using your API.\nI am happy that you'll write unit tests, but the KPIs and metrics are missing from the proposal. \nI really like the success definition and think it's great to be able to support e-comerse sites which is a game changer no doubt.\nOverall there are some metrics that can be followed like tasks performed, but I', not sure where will they be followed, because no github repository was mentioned and I'm not sure where the development will be happening. \nOverall I don't see the project being very auditable or having the right metrics and KPIs to enable optimizations.\n", "q2r": 2, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3698, "q0": "This project aims to make it easy for developers to integrate ADA based payments into their applications and facilitating the conversion of ADA into Congolese Francs and vice versa. The population of Congo is more than 89M and GDP per capita has been growing steadily which presents an opportunity that will continue to grow in the future. But some questions remain unanswered, how will the conversion take place? Is it a DEX or a more centralized method? Who will guarantee that there will be someone else on the other side of the trade and are there any partners they might work with? While it does not take away the issues of stability for ADA, it does alleviate concerns people might have about the utility of accepting ADA or other cryptocurrency for payments as these people can now easily exchange it for the fiat they are used to and spend normally, which should lead to more adoption of Cardano and ADA in the long run. But compared to other teams proposing similar projects in Africa, it is a relatively expensive sum they are asking for.", "q0r": 4, "q1": "The timeline is detailed enough and the team does seem to have some technical expertise but it is presumptuous, even amateurish, to state that there is no risk that can stop the team from delivering the project successfully and this is usually a red flag as they can’t see the obstacles that lay in their path. Completing the technical aspects of this project is just the beginning, getting people to use it is the real end goal, too many startups and projects have failed building things nobody wants or knows how to use. Add on legal and regulatory uncertainty, and anyone can see success is far from a sure thing.", "q1r": 2, "q2": "Auditability is poor, the metrics tracked are not tied to what success looks like, as defined by the team. They propose tracking unit tests, which is the most basic form of testing and can far from guarantee an entire system works as proposed, but define success as their system allowing the usage of cryptocurrency in Congo on a wide scale. More relevant metrics include number of users, transaction volumes, number of merchants etc. The team also did not mention making any progress reports or open sourcing their code. ", "q2r": 2, "assessor": "z_assessor_2468", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12992, "q0": "This proposal addresses the challenge where their is no cryptocurrency which offers the conversion to mobile money from DRC .Proposer will create the API where that enables developers to incorporate ADA cryptocurrency payment into their works in addition to DRC mobile money and do conversions. \nThe project will offer an easy-to-use API with an associated user manual. The proposal outlines an issue that needs to be solved.\nThe proposal clearly adds value to the cardano eco system , Upon reviewing the proposal The key metrices and goals of the proposal align with the outlined challenge settings.\n", "q0r": 4, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the proposal , Which includes Designing of the API architecture ,\nDesigning the mail server ,Implementation of all functions , Design of the associated mobile application ,Performing the tests, Final application of patches ,deployment of the platform and lastly marketing of the platform .\nThe timeline provided by the proposal looks very realistic and the Budget breakdown of the proposal is mentioned in very descriptive way and The proposer have also mentioned the details of the team who will be working on implementing this proposal and also mentioned the skills needed to implement. The proposal have also considered the challenges and the risks for successful implementation of project . Upon reviewing the proposal I strongly agree that the proposal is likely to be implemented successfully.", "q1r": 4, "q2": "The tasks completed can be used to track the proposal's progress.\nUnit tests will assess how well the tasks were completed.\nThe challenge has been presented by the proposer in a way that is both obvious and understandable, and the strategy for its effective implementation is also described. The proposal's success is determined by the Metrices/Kpi listed there.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 13042, "q0": "Those this proposal effectively addresses the challenge ... Yes I more ways than one in that...\n\n1)They talked about creating mobile API tools which other devs might use which will be on the Cardano blockchain this further increases adoption and also creates financial tool for the unbank.\n\n2)More so they discus and interesting issue which is creating a user manual which will make the product easy to use and devs can make easy use and integrate it with other products this also further drives adoption on the network.\n\n3) There is also the conversion of Ada to it's local currency and vise verse and drives further adoption on the network and reduces price volatility of ada. We may start to see Ada as a stable currency on the continent for the purchase of goods and service this drives massive tariff to the network.\n\n4) they disclose also in this proposal about their API being able to allow devs to develop tools which could be use to receive payment from abroad and Ada could be start it's real life adoption use with people using the network for virtually every aspects of daily life this is the vision Mr Charles has great work guys and good luck ", "q0r": 4, "q1": "With the information disclose in this proposal I think it's plans disclose here has a high probability of being implemented successfully by these key metrics ...\n\n1)First and foremost they have outlined a details timeline of 180days which they will start from designing to architecture to test and deployment this is precise and gives very limited room for failure because every component of this project is so very clearly outline.\n\n2) secondly the proposal those give details of it's devs team their background skills so yes they are stack with competent teams.\n\n3)More so they have a detail break down of cost analysis of this proposal which shows what is needed to make it a success in terms of cost and this shows they know what is need to make this idea a reality.", "q1r": 5, "q2": "Yes I do strongly think with some of the information provided here in this proposal auditing is very possible because ...\n\nFirst of all they have being able to give a few audit metrics like they talk about building E-Commerce tools which other devs can use now that means we get to see end users download mobile base apps or dapps and wallets all this are milestones which are key audit metrics .\n\nThey further talked of their propose API tool will allow the use of Ada as part of their local currency for the payment of goods and service by this we can further being to see more adoption and usage of crypto in the real this are key talking points for this fund9 challenge building really life tools and dapps for onboarding new users we can't clear see how many new users will be brought to the community.\n\nMore so there is also the audit metric which this proposal clear captured is relevant source of contact like their GitHub acct, and links on and many more social platforms which their phase by phase update of their project will be update for the community to see and be apprised of so yes it another good audit metrics right here to consider too.", "q2r": 5, "assessor": "z_assessor_3548", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "We will design an API allowing developers to integrate payment via ADA cryptocurrency into their achievements in addition to mobile money from the DRC and make conversions.", "experience": "Nturubika Moïse: 6 Years as Backend Developer\nKighundila wakomya chadrac: 4 Years as frontend developer\nAkilimali Cizungu Innocent: 5\nYears as Full Stack Developer\nKavira Musekwa Lydie : 4 years as Backend Developer"}