{"id": 422534, "author": "dconecrypto", "title": "DCOne Crypto for Developers", "url": "https://cardano.ideascale.com/a/dtd/422534-48088", "category": 26597, "amount": 45100, "description": "Developers need APIs, Webhooks, SDKs...etc to build their products on Cardano platform. We will provide them freely for app developers for quick access to integrate with the Cardano blockchain", "f6_no_assessments": 5, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 757, "q0": "Yes, the proposer identifies a real problem for developers who need easily accessible infrastructure and API to interact with the blockchain. The proposer correctly identifies that to set up a project on Cardano a list of services needs to be set up and maintained. These services the future proposers will always need. As a project owner myself I very much understand the tradeoff of running the services myself, or relying on a 3rd party infrastructure and would likely rely more on 3rd party if a wider set of services were available and they were reliable. The proposer, however, does not inform the user that there are solutions such as blockfrost.io and koios.rest provide some of these services already and would be beneficial to know how the proposer will improve on top of these services.", "q0r": 4, "q1": "There will be four technical to deliver the project; however, only two are identified, and only one has a social profile with meaningful connections (Cong Le). The skill set of the team is not specific to Cardano, which is not critical as they plan to deliver a layer on top of Cardano, but it would have been nice if the team elaborated on how their skill set is enough for the project. The number of suggested deliverables is very ambitious, and I am skeptical that all of it can be delivered within 3 months to a high standard; as an example, a colleague in the Cardano communit is delivering an Android SDK since Fund 7, and this is only one of the deliverables in this proposal. There is no evidence of prototypes or preliminary work done by the team that would suggest that parts of this infrastructure is already working. A monthly schedule is included and a budget break down with monthly expenses for salaries, infrastructure, and marketing. The project's risks are not discussed besides the risk of downtime of servers. The team plans to come back for additional funding to build additional features. Overall the budget is reasonable at $45k for a team of four for three months, but I have reservations that they can deliver the plan within time and budget. I would have liked the team to be more thoughtful in demonstrating that what they propose to provide can be delivered on time", "q1r": 3, "q2": "Yes, a list of deliverables by month and a list of KPIs are provided. The KPI focuses on the usage of the services by the community. A large number of deliverable and a monthly plan makes auditing objective. The team plans to communicate progress through social media and with the challenge team through formal channels. The success target is 1000 registered users after three months and 99.99% uptime. I am comfortable that the delivery can be objectively audited", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "In the Feasibility section, this PA commented “There is no evidence of prototypes or preliminary work done by the team that would suggest that parts of this infrastructure is already working.” PAs and the community can refer to the screenshots in the proposal about our work done. We are also releasing further updates to the project this July.\nAuditibily section, comments and 4-star reviews are not appropriate."}, {"id": 2645, "q0": "For initiatives like DeFi Apps, Decentralized Exchanges, NFT Marketplaces, DAO, Data platforms, and Blockchain Explorers, the project will provide APIs and SDKs.\nDevelopers may easily access all the data they require to conduct business by aiding developers in maintaining computing resources and data storage. Developers can utilize the project's comprehensive documentation and tools to create their applications.\nThe project makes it simple and quick for application developers to maintain complicated infrastructure by providing instant access to connection with the Cardano blockchain.\nThe project's clear and doable objective is to aid in the creation of apps for the Cardano ecosystem. I value the project's commitment to fostering the growth of the Cardano ecosystem.\nGiven the information provided, I rate this project with five stars.", "q0r": 5, "q1": "A DCOne website for project owners and users is part of the project's long-term objective. In the long run, it would be conceivable to take into account creating a project governance token and charging users to support and advance the project.\nThe proposed implementation duration is three months. With the intention of being finished each month, the job items have been precisely listed.\nCosts for system infrastructure, disaster resilience, security, marketing, and storage, as well as project development sessions, are all listed.\nThe plan's details and the estimated cost have been completely listed. This is valued in order for the team to successfully execute the job.\nUncertain and temporary information is available regarding the project leader. If you are sponsored, I'm interested in getting additional information from the team.\nI give this section four stars based on the information provided.", "q1r": 4, "q2": "The project has a detailed monthly development plan. Data access volume for SDK, API, Webhook, server requests, and the number of developers utilizing the DCOne Crypto library are used to gauge a project's success.\nOne of the specific objectives is to use DCOne Crypto's library to help the Registered Developer Community reach up to 1000 users after three months. More than 99.99 percent of the time is up.\nThe project's website, its github page, its Telegram, Discord, and Twitter accounts, as well as direct conversations with the project team via Telegram, Discord, and Twitter, are all options for checking the parameters indicating the project's development.\nThe exam's objectives are distinct and doable, as was already said. I believe that over time, the workload will be substantial. For the project to be successfully finished, I hope you can offer more details about the project management and find more collaborators.\nI gave the project a four-star rating.", "q2r": 4, "assessor": "z_assessor_2327", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7803, "q0": "This is a project of DCOne Crypto Finance that aims to create a library of SDKs, APIs, webhooks for developers on the Cardano ecosystem. This proposal solves the problem of Challenge because it contributes to creating a supportive environment for developers, contributing to attracting developers to Cardano through quality libraries. They came up with a very clear solution to the challenge of creating a library for the three SDKs, APIs and webhooks. The more quality libraries there are, the better supported the development of new dApps by developers, the more high-quality apps can reach the community. The project also solves a major problem that hinders developers when coming to Cardano, which is the problem of costs that can run into thousands of dollars. It can be seen that the main and most important objectives of the project are developers, this is also one of the key development directions of Cardano and Catalyst. Personally, I think that we should not only support this project to grow and expand, but also should replicate the model for many similar projects and many teams developing libraries for developers.", "q0r": 5, "q1": "This project has been implemented with the first steps including setting up a website and building a library. This can be seen in the screenshots of the project owner. The project implementation team are also developers on the Cardano platform with many years of experience. The proposal also gave a relatively detailed and complete implementation plan within 3 months of implementation, in which many parts of the project were completed by the team before coming to Catalyst. I believe that being funded from Catalyst will contribute to helping the project deploy faster and more efficiently, soon bringing the library to the community of developers on the Cardano platform. A small suggestion for the project owner is that you should add the criteria for selecting part-time Android & IOS developers to the proposal when you do not have these people on the team yet.", "q1r": 4, "q2": "The project has given a relatively clear implementation plan with reasonable goals and timelines. Information about the verification of the development of the project can be checked through the project's Github channel or the announcements on the media such as Telegram and Twitter. The project also has a set of criteria to evaluate and measure the quality of the project such as the number of registered developers, the number of requests to the server and the data access volume. I greatly appreciate the introduction of this set of criteria because it not only evaluates the quantity but can also determine the quality of the library. These are also numbers that are easy to measure and audit, with high transparency in project auditability.\n", "q2r": 5, "assessor": "z_assessor_2922", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14427, "q0": "\"The idea of the proposal is to develop a platform that helps those who are participating in the Cardano ecosystem to easily update information about the project. Because according to the proposal, if the information about the project is only on the platforms under the control of the people doing the work, it will make the information not fully visible (the detriment of the project can be hidden). ) and only from one-way. But if there is a platform for both parties to interact with each other, then the information will be contributed by both sides.\nThe project risks are clearly expressed by the proponent. Every risk has a solution. In my opinion, these risks and solutions are reasonable based on the project. But I think in the spam risk section, the proponent should think about building more automated defenses, not just handling them manually. \nTo sum up, this part is well presented and the idea is up to the challenge.\"", "q0r": 5, "q1": "\"The timeline and detailed tasks for each phase were well presented. All budget information is also provided transparently. But I have a small question about the amount of backup, if there are no costs incurred, what will this money be used for? So I think for the budget breakdown to be more transparent, the proponent should be more specific about this backup amount. \nIn my opinion, the information about the team is a bit unclear. Since the proponents only give the number of years of experience of the team and some links on Twitter, LinkedIn, and Telegram. Furthermore, when I click on Twitter and LinkedIn, I still cannot find any information related to the project. Because the personal page is locked (maybe there is something wrong when clicking on it). I think the proponent should write short descriptions of each team member (relevant background, name, etc.) so that the voters can know who will participate in this project.\"", "q1r": 3, "q2": "This part provides clear numerical metrics for project audits. All the code can be accessed on Github and new information will be announced via Telegram and Twitter. The KPIs are expressed in specific numbers and are quite reasonable to measure the success of the project. In short, the proponent did well on this part.", "q2r": 5, "assessor": "z_assessor_4045", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 14566, "q0": "The team aims to build DCOne Crypto, an ecosystem in the Cardano space to provide APIs, Webhooks, SDKs...etc. for developers. These easy-to-use services are extensible and helpful to the developers so that they can build more apps, and boost their productivity when working in the Cardano ecosystem. So, DCOne Crypto will attract more users to the Cardano blockchain. I can see that serving that purpose, the proposal is well aligned with the challenge. The team’s description of their products is clear and transparent. There is yet one thing for improvement, that is the addition of some key metrics to measure the impacts they want to achieve.  My rating is 4.", "q0r": 4, "q1": "The presentation of the team’s roadmap comes in detail. They point out clearly what they are going to do in each month, and all the features they are going to be available on both the Mainnet and the Testnet.I find their budget breakdown fair and clear enough. The description of the three core team members is pretty brief though, with their position and some profile links only. BEcause there is no information about their related skills and experience, I had a look at some links provided to find out more. Unfortunately, the profile of the technical project lead doesn’t have sufficient presentation of his expertise to see and evaluate his compatibility with the project, while the profile of the system dev is very clear and detailed. My suggestion is the team should please add their team member name, some description of their skills, competence and related work to better illustrate the project feasibility. My rating is 4.", "q1r": 4, "q2": "The KPIs to measure the project progress and development is reasonable. The team uses quantitative key metrics like the data access volume in the DCOne Crypto library for SDK, API, Webhook, the number of requests to the server and the number of developers using the DCOne Crypto library. Because they are all figures, they help auditing the project easily. I strongly agree with their good selection of assessment methods. The team’s description of their success criteria is even more excellent. They choose and define key metrics to measure their success, like having 1000 developers registering to use their library after 3 months and the uptime is more than 99.99%.I find these criteria great since they are specific enough to audit the project effectively. My rating is 5.", "q2r": 5, "assessor": "z_assessor_4072", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "We will provide APIs, SDKs for app developers for quick access to integrate with the Cardano blockchain, allowing developers and businesses to focus on building their business model", "experience": "We are a professional team of Backend, Full-stack, Devops programmers with more than 10 years of experience and more than 6 years of experience in the field of cryptocurrency and blockchain. Develop Javascript, C# SDK (NETWORK, EPOCH, BLOCK, TRANSACTIONS, ADDRESS..)"}