{"id": 422708, "author": "fuixlabs", "title": "Emursive DApp (Metaverse) Builder", "url": "https://cardano.ideascale.com/a/dtd/422708-48088", "category": 26597, "amount": 49190, "description": "Immature tooling and platforms put building a custom metaverse that uses Plutus smart contracts to manage exchanges of value out of reach of small teams", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 3340, "q0": "This proposal clearly targets the goal of this challenge. By integrating Plutus Smart Contract support to their metaverse/dapp builder platform, they want to build a new kind of Smart contract that efficiently processes and uses resources. The goal being a metaverse builder platform that uses Plutus Smart Contracts for transactions using the Cardano blockchain,  ultimately creating a greater overlap between the metaverse, the real world, and blockchain. For those knowledgable and interested in the technical details on how they intend to appoach this project, they have included illustrations and images in their proposal to help the reader understand. I believe projects such as this one can contribute significantly towards the Cardano ecoystem and bring Cardano and blockchain applications to many new areas. They mention examples of Pioneering work using Metaverse for Food supply chains in Africa, potential use cases such as sports club metaverses, brand loyalty/rewards based on gamifications, and DeFi/Insuretech", "q0r": 5, "q1": "FuixLabs is an active contributor to the Cardano community, open source library and frameworks contributor on Cardano, having built various innovative products on Cardano, and much more. Their team has a multitude of talented people with great expertise in different areas with many years of experience, there are no doubts in their ability to carry out this project successfully. Additionally, they have provided a highly detailed milestone list, where the time allocation, team member allocation, as well as exact components and deliverables are clearly specified. The budget breakdown provided is also one of the best ones I have seen in terms of structure and clarity, the table format makes it very easy to read and the fact that they have specified each role and expected hours in such detail is very appreciable. The numbers also seem very sensible. Overall they have provided more than sufficient information and proof of their qualifications and feasability to carry out this project successfully.", "q1r": 5, "q2": "The main way this project is being audited is using the builder platform itself where the number of new DApps/Metaverse in use will be the true measure of its value. They will also share usage data and make analytics data publicly available, providing the community more understanding of how the platform is used. These are certainly great tools and indicators of how the actual development and use case of the metaverse builder is progressing. However, it is also suggested to bring more info about how the specific milestones and their components leading up to the final product can be measured and audited. They have mentioned update documentation in their milestones and KPI list, but it is not perfectly clear how the progress of these components are tracked and measured and if they are open to the public. Overall, this is a very strong proposal, and the only pointers to be given would be to further establish auditing measurements and channels to make sure the specific milestones can also be tracked. ", "q2r": 4, "assessor": "z_assessor_2448", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3580, "q0": "The proposers want to build a platform to enable easier development of any kind of dapps and metaverse applications by expanding an already existing platform to use plutus smart contracts. This is a great idea and would surely bring value to the ecosystem by making it easier to build decentralized applications. The project is in alignment with the challenge settings as it's going to bring in more people building for cardano, that is sure to grow the community.\nThere are a couple of things that left something to be desired. I have a feeling that the proposers didn't read their end proposal because the problem statement starts with \"But at first glance, ....\" which is really confusing. There are no explanations of a few terms used in the description of the proposal like what does \"local logic\" mean or a \"fireable operation\" or \"location data\" (in metaverse of real?) or \"structured data\". A summary is missing, maybe because it wasn't submitted to ideascale on time, but either way it's not there.\nI do appload their market research which is exactly on point, and I can appreciate the business sence the team has and their work organization. The keymetrics for the proposal are reasonable and would serve to track the progress. I like the inclusion of non-technical people and enabling them to contribute to the ecosystem through such tooling.\nOverall I like this proposal even with the few small caveats mentioned earlyer.", "q0r": 4, "q1": "All the necessary credentials are provided and the team members do seem to have all the necessary skills to bring the project to it's fruition. The skillset listed in the proposal matches what I was able to find online combined with the provided links to the aforementioned team members. The team brings credability to the project.\nThere's a good budget breakdown, in a format that should be a standard and slowly but surely it's becomming one: hourly rate multiplied by hours multiplied by resources (people workin on it). I'm unsure if the timetable is reasonable or not, because I don't know their product, so I'll deffer to their estimation which at least looks reasonable from my perspective of a developer.\nThe plan for implementing the solution seems reasonable and good milestones to follow are provided. Unfortunately I couldn't open quite a few github links which was a bit disapointing. I would suggest you read through your proposal and try out every link in the finilizing stage to make sure the proposal reads good and all links can be oppened in an incognito browser, thus making sure you don't need access rights to open a document or a private github repository, which I think is the case here.\nThere are some considerations regarding challenges this project can face, and IMHO they are legit concerns, but there's a provided path to follow in those cases, so that's good enough for now.\nBased on what I've seen in this and other proposals I really believe there needs to be an effort of joining forces with other smaller proposals, to alleviate some of the planned work. IMHO budget to value ratio is fair. Overall a good proposal that I would call feasible with the few negative things mentioned.", "q1r": 5, "q2": "If you need your project to be auditable, the first thing you can do is bring the technical terms to a minimum. I am a developer and I had some trouble understanding what you mean. This might be caused by the fact these terms are not new to you and you don't think about them, but when anyone unfamiliar with your platform or solution is reading the proposal or any updates you might give, you risk lack of understanding. My suggestion would be to cut the explanation of the way things work in a document linked for anyone interested to read, and focus on the core of your platform, explaining it in more simple terms, without any terminology, or at least pre-defined terminology.\nOverall there's a clear problem statement and a clear solution, but I would also suggest to put yourself in the shoes of voters that don't know anything about you and re-read your future proposals to make them more accessible.", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4423, "q0": "The team has a proposal regarding Plutus Smart Contracts and Metaverse. This is quite a hot topic in the current period, it is very suitable for Challenge's set goal of \"Developers Ecosystem\". You've identified a problem: Add support for Plutus Smart Contracts to the Metaverse platform for food traceability testing in Ghana. I understand you build a DApp with the Metaverse interface, and support building Metaverse with an effort that at first glance is not suitable for building smart contracts on Metaverse. But the team did well. Wonderful. I fully support it when the team has such a proposal. I realize that this is one of the rare proposals that are high-tech and catch up with the current trend. That is very good. It makes the community have a more high-tech project approach - beneficial to their daily life, more and more choices. And most of all, it directly adds value to the Cardano ecosystem. In addition, it directly affects the people of Ghana in terms of food and agriculture. I fully support this proposal, understanding that it has a huge impact on the users and the Cardano ecosystem. Even better, in the future, the proposal can scale up and solve many challenges, not only in Ghana, but if done well, it will be on the scale of Africa and the world (this takes more time). space). I vote 5 stars.", "q0r": 5, "q1": "Reading the proposal and seeing that the proposer and team members are both experienced and experts in their area of ​​experience (the team includes Plutus Pioneer and Haskell programmer), makes me feel very secure. In particular, the members have completely revealed their identities through social networks. Not all members of the other proposal do this. Although the number of members in the group is not much (7 people), they are all capable of leading the department with a long history of achievements and experience. Indeed, Fuix Labs has had a certain reputation in the community for a long time, trusted by many people. I am one of them. The budget is divided into sections and is reasonable with the set goals, very detailed, and associated with the milestones of work. I only have one question regarding the project's budget: Will the project have any other cash flows in the future to ensure continued growth? For now, the project is still asking for funding from Catalyst. If the team answers the question correctly, the feasible definition of the proposal can be ensured for a long time in the future. So, membership and budget allocation are two things that make me feel very clearly the identity of the proposal. Based on the plan and execution, I understand the team has completed version 1.0 of the product. So has the product version 1.0 been smoothly used many times? Has the team released this version 1.0 product to the community? Either way, I believe this is a great thing, it shows the superiority of the product and the good capacity of the team. Feasibility is doable. I also hope the smart contract for this project comes out soon (on the Cardano platform). During implementation, what policy does the team have to attract developers to the Cardano platform? I suppose you have to make this clear to prove the possible even better. At the same time, is there any solution for competitors to develop the same platform? I think that if this is possible, the team must be very technical, and at least one member must be technical good (currently the team has Haskel and Plutus programmers as mentioned above) to can solve the difficulty posed by fierce competition among competitors. But for this proposal to come to life, I predict that it will take a long time and have to conduct many tests. Hopefully, my prediction is wrong, the team will be successful shortly. In terms of technology and engineering, I have seen the complexity, but completely accept the level of the members because you have built a smart contract related to Metaverse and believe that you can technically qualify to write other smart contracts based on Haskell/Plutus although very few programmers can do this nowadays. The appearance of NFT is inevitably in your proposal. I fully support, it because NFT is also a way to promote the project and the team. I understand the risks raised by the team, it includes both subjective and objective reasons (illness, health, Covid situation) and I look forward to your solution to overcome those risks. that's the maximum. In summary, I feel satisfied with what you have presented to demonstrate the feasibility of the proposal. I would like the team to be able to further consider my questions to actively contribute to the success of the proposal.", "q1r": 5, "q2": "This proposal stands out as a rather long roadmap and milestones, with details, which I have read and feel satisfied with. It is very important to demonstrate auditability through each stage. The team spent a lot of time researching the problem because it was a technical proposal and then gave clear and understandable descriptions along with the solution. I know the project is moving towards product 2.0 development. During the development of the project, how did the team plan, and what were the challenges beyond the stated risks and challenges to get the product 1.0 (done) and now 2.0? If members can prove this, it will confirm the auditability and transparency of the community, especially for PA and vPA. Those are my comments on how to demonstrate transparency and the clearest auditability. What about the job performance evaluation index (KPI) based on the average hourly income of employees and the unemployment rate, the percentage of young people who are trained and educated, etc., I find it very necessary to include in the proposal? It is the general situation with the figures not differing much in the countries of Africa. And the team is on a journey to improve those numbers - making Africa a better place. With positive thoughts, I am quite satisfied with the team's proposal. Hope the team's proposal is funded soon.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5359, "q0": "The Emursive dApp (Metaverse) Builder proposal is extending the 1.0 metaverse/dapp builder platform by adding support for Plutus smart contracts. The proposal applies concept of metaverse to dapp. Their metaverse builder is a great tool for building dapp with complex logic that need to be delivered quickly with both high quality and high reliability. Upon the completion of project, building a metaverse with low budget, short time and limited expertise, it would be possible to build a large variety of application. The example of use for this metaverse builder platform ie. brand loyalty and rewards, NFT sales and trading, supply chain management, food traceability, defi/insuretech, sports, virtual work or replacement for web2 websites. The potential for metaverse builder platform in creating dapps in different areas seems to be endless as per proposal. However, the FuixLabs team forgets to mention what would the Emursive Dapp (Metaverse) builder features would be. Fuix Labs team did not explain what their Dapp builder functionality would include. There is no flow of transaction from the user perspective. What would happen to the user when he gets into this builder platform? The proposal says that every NFT collection can have its own opensea but how to do it? There is no description of activity or user experience.  Without this information, it would be hard to determine how it could have the positive impact to developer ecosystem. The risk for this project are explained with ways to mitigate all these risks. It will help in the impact section if the team would describe specifically on the platform rather than detail the general usage of metaverse. This could be in term of technical features so to illustrate how they help developer to build dapps easier. In addition, their https://www.cardanocode.com link doesn't work and the github.com link location are not tied to any specific account.", "q0r": 3, "q1": "According to their milestones, Fuix Labs team doesn't tell how long the milestone II. would be. It is not possible to determine the total period this project would take. Although the team says number of hours for milestone 2 and they list their total budget as $49190. In the list of accomplishment, number 3, the no-code hackathon link https://cardanocode.com doesn't work. The team could have provided the link for their mobile wallet they work for Ghana government and the metaverse video could be more illustrative to explain their work in Ghana as it looks more like a game. Their work with Singapore government 3 out of 4 GitHub links (DApp, DID resolver, DID controller links they provided are not working). The same happens to 4. Self Sovereign Identity atala prism (3 out of 4 links are not working). There is a possibility that the team will request funding for their 3.0 version. However, I would like to emphasize that their proposal for their project (v.2) do not provide sufficient evidence that this proposal can be implemented successful. The links they provided are mostly not working and the FuixLab team will need to provide more evidence to make this project feasible at all. ", "q1r": 3, "q2": "The project success is their Metaverse builder  platform allow developers of complex dapp to complete their dapps and metaverse work easier. The FuixLabs team expect their solution to be particularly userful for users in Africa and South America with disadvantage in language and education levels. The FuixLabs team metrics would be the number of applications deployed using their builder platform. They will use Google SuperProxy from Google Analytics to collect usage data on their builder site and make the data public available where the community can check charts and graphs of usage. They also will track the transaction from Dapps (unique signature)using Cardano explorers. Provided that the FuixLabs team can provide these information, then it would be sufficient to audit the progress and success of the proposal. However, there are still some questions on the features of the platform (user experience) and the links that are not working supplied by the team (https://cardanocode.com and Github Links)  that the team would have to improve and revise in their next proposal. The team should also consider updating the community specifically about the project on their official website if possible. ", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10769, "q0": "The project's builder helps to trace the origin of food so that users can ensure the origin of the food they use every day, which is great for public health and has been successfully tested in Ghana. With an active focus on ensuring food provenance and integration with smart contracts I think they deserve 5 stars from me.\nWith the mission of developing projects that bring about global sustainability of the cardano ecosystem, I hope projects like this will receive many good reviews from other proposer assessment.", "q0r": 5, "q1": "Currently metaverse projects are at the pre-feasibility and research level, which is also the general development trend of the future technology world. I appreciate what they have done in Ghana and hope they will expand the project to help African countries in particular and the world in general. This is also a complete project that creates more tools for us to access future transaction management based on a smart contract platform.\nBy using algorithms to prove the local logic and optimal routing of nodes, it shows that they have worked very seriously and built project development scenarios scientifically. They developed a method to prevent errors during testing, and used experiments and products to demonstrate that the program ran according to the original algorithm. They also built an extension that allows this method to be used on Cardano DApps. The project also shows the value to be brought after completion, which is to build a metaverse that integrates deeply with cardano and executes high transactions with low budget, short transaction execution time, limited errors and build a wide variety of applications.\nHowever No upfront KPIs are recommended. I suggest that the proponent include KPIs and measurable outcomes that can be expected at the end and during the project.\nThe project development team consists of many personnel with experience related to the area of the project under development, with clear reference information compared to linkedin.\nI believe this project is very feasible and will be successful.", "q1r": 5, "q2": "This is a project metaverse on a smart contract platform. The creation of project metaverse is a growing trend of technology, the job of providing tools for the development world to trace the origin of products is very good. If is swap, the community must be a on the same time of the heliant contact. Nothing more and nothing less, if they achieve the goal, it will bring great value to the Cardano ecosystem towards the growth of Metaverse and the overall development of the blockchain community. This is a realistic project with a specific goal and if they keep holding on to that goal, they will surely succeed.", "q2r": 5, "assessor": "z_assessor_3192", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11831, "q0": "The problem of the proposal is clearly defined that Immature tooling and platforms put building a custom metaverse that uses Plutus smart contracts to manage exchanges of value out of reach of small teams\nTo solve the above problem, the team implemented the solution to Extend the 1.0 metaverse/dapp builder platform by adding support for Plutus Smart Contracts\nIt is a new kind of smart contract, a location in the metaverse, or a set of laws specific to a domain such as property rights.\nUsability tests have shown that Metaverses is aimed at thousands of users and extends the frontiers of DApps.\nMetaverse Builder a great tool for building DApps with complex logic that needs to be delivered quickly with both high quality and high reliability.\nThe proposal matches the requirements of the F9 challenge. This toolkit will help us developers focus on building successful applications. In addition, the Proposal has identified risks and specific solutions. I agree with this challenge.", "q0r": 5, "q1": "Let's look at the explanation of the Process and the plan together\nIt is proposed to identify 4 specific milestones, have specific personnel in charge, have goals, and plan completion time, and delivery time, for example:\n+ Milestone I (Deliverables) 1 week (1 UX Designer, 1 Blockchain engineer, 1 Architect, 1 Tester, 1 Technica Writer)\n+ Milestone II (Deliverables) (1 UX Designer, 2 Blockchain engineers, 1 Architect, 1 Tester, 1 Technical Writer)\n+ Milestone III 8 weeks (2 Blockchain engineers, 1 Architect, 1 Tester, 1 Technical Writer)\n+ Milestone IV 1 week (1 Blockchain engineer, 1 Architect, 1 Tester, 1 Technical Writer)\nI think the Timeline is reasonable to get the job done.\nTo facilitate project tracking, it is recommended to add a link section for our community to easily evaluate.\nIt is known that in addition to this project at Fund 9, the group has applied for an additional operating fund. See here: Token Gating on Cardano with CNFTs: https://cardano.ideascale.com/c/idea/414552\nIn addition, the Group also has two remaining to be completed before this project begins. This will not affect the execution of this project.\n\nAbout the required budget is 49,190 $\nThere is a list of usage budgets. See here: https://docs.google.com/spreadsheets/d/1i7bKCnwaPhkYw2ijkJN9GWJd1KWrkIEBovkN18c61mM/edit?usp=sharing\nWe need a more detailed explanation of the use of this budget.\n\nThe team has 8 members, including Fuixlabs, Timothy O'Brien (Principal), and the team who have many years of experience and have made very active contributions to the Catalyst community.\nAll members can be identified, with a link to their profile page.\nWith this team, I am confident that they can complete the project.", "q1r": 4, "q2": "The proposal has specific metrics such as:\n+ Measure the number of applications deployed using their builder platform\n+ Via Google super proxy with Google Analytics to collect the usage date on the website.\n\nSuccess is clearly described in detail. The platform's success helps:\n+ Developers of complex DApps or Metaverses will have a platform that allows them to get their work done without complicated installation and configuration.\n+ Teams of non-member developers with all the necessary skills, blockchain, Plutus, building 3D models that can build DApps and the advanced metaverse.\nCardano DApp builders will choose to build Super Switches if their DApp contains complex or multi-stage logical processes.\n+ Users in many parts of the world such as Africa and South America with language difficulties, education levels are easily accessible.\n\nThis is a new proposal. I will support you.", "q2r": 5, "assessor": "z_assessor_3287", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12995, "q0": "The proposal is for expanding the  metaverse/dapp builder platform by adding support for Plutus Smart Contracts .The proposer have already successfully  \n build food traceability metaverses in Ghana. The proposal to help the small teams who are unable to create a custom metaverse that employs Plutus smart contracts to control value transactions due to the lack of stable technology and platforms .\nThe team have already built the 1.0 Metaverse builder platform and implemented,\nNow 2.0 metaverse builder platform uses the Plutus Smart Contracts for transactions that require Cardano blockchain.The proposal clearly adds the value to the cardano eco system and The key metrices and the goals of the proposal align with the outlined challenge settings. The proposal is able to scale to addresses future challenges .The proposal have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the project. This budget request will support the development of our product 2.0 The Timeline provided is very realistic and the Budget breakdown is good. The Approach to the challenge is great the proposal have considered the relevant risks and challenges for the successful implementation. Upon reviewing the proposal I agree that the proposal is likely to be successfully implemented. The proposer have also described the details of the team ,\nand also mentioned the skills of the team which is needed to implement the project .\n\n", "q1r": 5, "q2": "The number of apps that have been deployed using  builder platform can be used to track the proposal, and Google superProxy with Google Analytics is used to collect usage information on our builder website and make the analytics data available to the public. The challenge has been clearly and simply defined by the proposer, and the strategy for its successful execution is also provided.\nThe proposal's performance is measured by the Metrices/Kpi mentioned in the description .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Extend our the 1.0 metaverse/dapp builder platform by adding support for Plutus Smart Contracts. Our builder has already been successfully deployed to build food traceability meteverses in Ghana.", "experience": "The team of has completed a 1.0 version of our product. Our team includes a Plutus Pioneer and a programmer experienced with Haskell. We have all the experience required to implementation the Plutus Smart Contract needed to complete this proposal. More details can be found below"}