{"id": 422861, "author": "muesliswap", "title": "Off-chain SC interaction tooling", "url": "https://cardano.ideascale.com/a/dtd/422861-48088", "category": 26597, "amount": 71250, "description": "Cardano features many opportunities for the community to participate in on-chain protocols through off-chain components. There are no templates and easily approachable tutorials to develop such tools.", "f6_no_assessments": 9, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 976, "q0": "I’m a bit split about the value proposition of this proposal to the Cardano ecosystem. On one hand, I can very clearly see the potential for impact of what this proposal aims to deliver: tutorials, sample code and educational content for the community. This undoubtedly has the potential to facilitate and create the opportunity for many more people to build tools to interact with Smart Contracts. But, on the other hand, I feel that the proposal itself fails to provide sufficient examples of potential use cases and applications that could be built on top of their deliverables, apart from further developing the use cases specific to MuesliSwap (matchmakers) and making these the focus of their education efforts. If that element would have been present it would have made the value proposition of this project very clear.\n\nHaving said that, this would still represent a potentially good investment for the treasury. Developer education and sample code are key areas we must focus on at present if we want to facilitate and make it easy and time efficient for new developers to adopt Cardano, especially given that today it’s not the easiest sell given the steep learning curve of Haskel and Plutus. In the case of this project, the value of the effort would be amplified further by the fact that it would originate from the developers one of the most used DApps in the Cardano DeFi ecosystem today.", "q0r": 4, "q1": "The implementation plan is mostly presented as part of the budget breakdown, but this is not a problem as it’s still detailed enough to get a very good overview of where the team intends to take this project and how. I found the time estimation to be very feasible for each of the described steps and I really appreciate the fact that the team had the foresight to budget and plan for an auditing phase. The entire development stage of the project is estimated to be completed in 2-3 months. That should mean that the project will be delivered by the end of 2022 if the team receives the funding and work begins shortly after. But that is just my personal assumption as the proposal doesn’t mention anything about this and I would have liked to see the team clearly specify an expected launch date.\n\nThis proposal comes from the developers of one of the most well-known DeFi dApps on our blockchain and this fact contributes a lot to prove their competence and dedication to the betterment of the Cardano space, especially since the dapp has been constantly updated since its November 2021 launch. However, this does not completely excuse the fact that the proposal does not provide any information about the exact people who will be delivering this project. Most likely not all voters or proposal assessors are familiar with the company’s previous work and as such it would have been important for the proposal to include links to professional profiles (LinkedIn), examples of previous work and other credentials that would have presented their qualifications and proven their skills. As such my advice would be to include these details with any future submissions.\n\nThe proposers, the MuesliSwap Team, have not submitted any proposals to Project Catalyst prior to this fund. They have submitted 9 proposals in Fund 9, though.\nSource: https://www.lidonation.com/en/project-catalyst/users/2032 \n\nBecause 9 projects is a big commitment, I really would have liked to see a description of how they plan to manage the workload if all projects are funded. This is now a requirement of the newly introduced workload questions in Fund 9. They answered “Yes” to the question of other Fund 9 proposals but unfortunately failed to provide additional details in the Feasibility section as requested in the question description on the submission form. They have mentioned in the proposal they are a large team, so I’m not very worried that they won’t be able to manage the workload if all proposals are funded, but it would have been helpful to voters to have a clear understanding of how they plan to manage that situation if it happens. As such my advice would be to include a detailed workload management plan with the next submissions, not only to inform voters and PAs, but it could actually help the proposers themselves be better prepared for every circumstance.  This was a new requirement on the submission form so I will not be lowering the Feasibility grade for this, because a very low number of proposals provided the requested details.", "q1r": 4, "q2": "The proposal indicates that it will use GitHub as both a means of tracking the project's progress and delivering its output to the community. This is especially important since this is an open-source development project.\n\nThroughout the proposal presentation the team is concise and clear about the deliverable of the project and the time they will get done in. This will make things a lot easier when the project's progress gets reviewed.\n\nThe project’s ultimate success will be perhaps harder to quantify exactly, as the results of education most often. The ramifications of successful education and tooling initiatives are very likely to go beyond GitHub interactions in case the project is successful. However, this definitely shouldn’t stop us from making the commitments needed to developer education, and this proposal presents a good option for implementing that in a practical way.\n\nMy review of this proposal in the Developer Ecosystem challenge is based on my experience as a project manager working directly with Cardano developers since July 2021. I have participated in almost all roles in Project Catalyst since February 2021, including as a previously funded proposer, and I’ve been involved with the Cardano development community and NFT community for about a year and a half.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3067, "q0": "Off-chain SC interactive tool, a proposal to create tools\nto help Dapp programmers have a library of tools to practice with and\nbuild better off-chain SC part. Proposal completely with the requirements set out of the challenge.\nSmart contract has just started developing on Cardano for nearly a year, but the number of Dapps is not much. As suggested,\nThe ecosystem is lacking in specific use cases, the accessible resources are only the original documents released by IOHK. This proposal will helps a lot for the Dapp ecosystem and has a great impact on the community.\nThe risks this proposal would face are as described by the proposer as nothing.\nIn my opinion, it is necessary to add one more risk such as: The number of tools is enough for the community to use and\nhow difficult or easy it is to apply to building a Dapp. The proposer should anticipate this risk or\nIf there is a solution, it should be clearly stated in the solution section. Since a good product is created, it is unlikely that it can be widely used and Plutus in the early stages is an example.", "q0r": 4, "q1": "The team that implements the proposal is a very famous team in the Cardano ecosystem: Mueliswap team.\nThere will be no doubt about the proposal team's ability to implement the proposal because they have proven their capacity with actual products. According to the proposal raised, their team force is very large and professional. Then I suggest that the proposed team should give basic information about the team leader, which I think is very easy for the proposer.\nThe plan to implement the proposal is 2-3 months. However, in the details section, I find it unreasonable in dividing timelines, it will be difficult to determine timelines even though the proponent has detailed the work done as well as the workload and number labor hours required to complete. My suggestion is that the proponent should specify 1 day = how many hours, the tasks in the same milestone are done concurrently, the minimum number of people to do the work to match the plan is 2- 3 months. If it is only as suggested content, it will be misleading.\nFund allocation should also be more specific about wages for 1 hour of labor. Because I see 2 different milestones, the salary for 1 hour of labor is different. Of course, the characteristics of the work of the two milestones are completely different, so the difference in price is understandable. However Voters will need to see more details. Especially team Mueliswap is a professional and famous team", "q1r": 4, "q2": "To track the project progress, the proposer can provide inspection sources such as Github or the auditors can check in the social network channels of the Mueliswap team, everything is quite transparent. There is only one thing that I would suggest in the detail plan of the proposal that needs to be clearer. Examples for the proposer to refer to:\nWork: Do multiple matchmaking prototypes - 90 hours (if 1 dev works 8hours/day, we will measure and test after 11 days, but 1 dev working 15hours/day will test after 6 days)\nHow successful will the project look? With the implications that the proposal brings to the Dev community or Dapp developers, this will be a proposal that helps a lot for the Cardano ecosystem. However, to further evaluate the success of the proposal, it is recommended to give about the number of users achieved, the number of Dapps or Devs that will use the proposed tool.", "q2r": 4, "assessor": "z_assessor_2394", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3583, "q0": "The proposers want to enable all users in the cardano ecosystem to use off-chain components to participate in on-chain protocols. The interesting part is they want to enable the users to do their own tooling to interact with the smart contracts. This tooling will be able to interact with the ecosystem and execute a smart contract given conditions. They do bring up a good point about open source having a solid foundation to build on top of. As a developer, I'd be happy to learn how to do my own tooling for my speciffic purposes, but it would also be nice to know I'm headed in the right direction and doing standardized development (more or less) to avoid logical errors.\nI do see this proposal as an integral part of the future of cardano, and I agree with the authors that such samples and knowlede needs to be funded by the community and it costs to have that knowledge and know-how. This proposal is aligned with the challenge settings and would grow the development environment with not only developer onboarding and ease of usage, but with available standards and tooling as well.\nI want to make certain to acknowledge and appreciate people giving away their hard earned knowledge on such new and difficult topics. This is priceless and I hope it's appreciated. I am following muesli swap since their inception and I'm sure there will be no problem scaling the solution when the time comes. As a developer and a PA for the last 4 rounds, I don't see anything missing from this proposal and really do think this needs to get voted in, because it's going to have an impence impact in the ecosystem. Overall an impactfull proposal with reasonable budget and stable team.\n", "q0r": 5, "q1": "This is a solid team with a proven track record and the know-how to build an exchange. This project is really simple compared to what they're usually doing so I have no doubt about the feasibility of this proposal. The whole team is full of proffecionals and they bring credibility to any project they take part in.\nThere's a really good budget breakdown and I can say that the hourly rate for the development time seems reasonable and in between bounds. I'm not sure about the auditing phase, but I deffer to the teams' expertise for that. The timeframe of 3 months seems reasonable for the planned out work and entirely doable. I love the detailed description of each phase and milestone with it's individual steps and time each one will take. This is the idea way to breakdown your whole plan and it's quickly becomming a standardized way of doing budget breakdowns. I hope more proposers follow this example. \nTwo things that left a very good impression:\nFirst the proposers do appreciate the active community they have and plan to make use of that fact and second they do have a plan to monetize their development and are capable of funding extra costs and have buffered them into their plans. Both of these leave a very good impression, because it shows foresight. There's a known number of developers that should have no problem implementing the work needed.\nIt's going to be an open source project so that brings the feasibility up, because there's always chance for contribution by the active community which would speed up the process even more. As a developer I'd be happy to take part of that effort. Overall most feasible. Good luck to the proposers!\n", "q1r": 5, "q2": "Not much to say here, because it's an open source project with a public github repository with documentation. Anyone interested would be able to follow along.\nThe proposers have channels to let the people know about the progress of their solution and have already done so for previous projects so they have a community of their own and growing no doubt. There will be a feedback loop, and that's the definition of agile development.\nA clearly described problem and a clear solution with a short timeframe to resolve it. \nOverall 10/10 or in this case 5 out of 5.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 3843, "q0": "In this proposal, the purpose is to provide templates and tutorials for building off-chain protocols to the community to enable non-experienced users make their contribution to the Cardano ecosystem. \nThe problem statement is clear in this proposal. The proposer has stated that Cardano's smart contracts are passive. So their solution is to create off-chain components that build, and submit and process transactions locked in smart contracts. \nThey will develop tutorials, publish sample code and instruct the community in building their own tools to interact with Smart contracts in general.\nTo address the challenge, the proposer wants to strengthen the ecosystem for developers with hands-on tooling and tutorials for starting to build fully, working DApp with off-chain tooling. This  challenge is about supporting developers to contribute much to Cardano ecosystem. So the challenge is addressed by this proposal. \nThe proposer emphasized that there is no risk associated with this proposal.\nThis proposal has addressed the challenge effectively. My rating is 5.", "q0r": 5, "q1": "According to the proposal, the duration of the project is 2-3 months. The proposer has rather outlined the plan in the budget section but all the same, the plan is detailed, showing development phase, audit phase and documentation phase with specific hours and duties added. \nThe budget total requested is $71250 and the breakdown is showing costs for the different phases of the work. \nThe team is called MuesliSwap development team and together with external persons will deliver the project. The team has 9 developers, with experiences in different fields. Their experience with Cardano makes them highly qualified for the project. They are active members of the Cardano community.\nThe proposal indicated that the team is not planning to return to Catalyst for further funding, because the MuesliSwap team will cover any other cost. \nThey are also involved in other proposals is Fund9.\nWith the information given, it is likely this proposal will be implemented successfully. My rating is 5", "q1r": 5, "q2": "The team for the proposal emphasized in the proposal that they will be very transparent throughout the progress of work by communicating updates regularly to the community through GitHub repositories.\nSuccess for this proposal is that, off-chain tools when built, are reliable and interact with the ledger through specified APIs, thereby reducing the burden on upcoming projects. New projects will have a set of accessible off-chain components that they can build upon, use for educational purposes and even have tutorials for building new components. This is a laudable project and it is a new proposal. \nI believe the information provided is sufficient to audit the progress and success of the proposal. My rating is 5", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 14, "ne": 0, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 4234, "q0": "The Off-chain SC interaction tooling proposal aims to equip the non-experience users with templates and tutorial of building off-chain code. The off-chain component plays a vital role in speed performance and decentralization level of the protocol. This tutorial will include sample codes that will help the community in building their own tools to interact with smart contracts. Hence their proposal solution fits very well with the goal of Cardano to boost the number of open source projects. Also these tools will be externally audited and provide a solid foundation to be built on and accelerate the DApps development across the entire ecosystem. They have specified there is no major risk involved in delivering the project successfully ie. their experience with off-chain tool, no lack of budget or leaving developers. ", "q0r": 5, "q1": "MuesliSwap is a team behind this proposal. They are a very well known DeFi protocol within  Cardano and have extensive experience with developing off-chain code their \"Matchmakers\" feature is widely used to scan ledgers for open orders. The team plans to deliver tech updates to the community of development process via open source repositories. When taking into account, its development duration 2-3 months 780 hours will cost $45,000 out of $71,250. The rate/hour is logical. The team even explains involved tasks in the development phase, audit phase and documentation phase. If there could be a suggested improvement for the proposal, it would be a good practice to the entire community to know some team members behind MuesliSwap by listing those who are comfortable to disclose their profiles in the proposal. Visiting the official website doesn't provide much team information. Having said that, I am well aware of major development within DeFi protocols by MuesliSwap team and very confident that the team could execute this project successfully and make a significant contribution to entire Cardano ecosystem.", "q1r": 5, "q2": "The project progress will be reported regularly by the MuesliSwap team and community can monitor its progress in GitHub repositories. The information provided in this proposal is sufficient to audit the progress and one of the KPIs they define the success of this proposal is more off-chain tools built and their increasing interaction with ledgers through specified APIs. The new projects can access and build upon these off-chain codes. The timeline of 3 months is brief enough for the community to monitor the project progress consistently if they have meet their targets in each of their 3 phases. The proposal has provided a good clarity on the much needed tools for the community.  The template and tutorial of these off-chain codes as the solution are very much aligned with the challenge goal in boosting developers productivity. Alternatively, they could list the number of repos on Githubs using this tooling as part of their KPIs or the increment in DApps development as a result of their off-chain SC interaction tooling. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5203, "q0": "The proposal tries to create templates and tutorials for building off-chain smart contract tools for the community and thereby enable non-experienced users to make their contributions. The proposal is well written and covers every important detail. The Muesliswap team itself is proven to deliver projects, hence the chance of the project doesn’t deliver is low. There isn’t any major risk that may face the project, even if happens, the team already has a mitigation plan.", "q0r": 5, "q1": "The budget breakdown is written in every detail, where each milestone has the hours needed to complete it. That information is important so the voters can know the weight of the project, and thus conclude if the requested budget is reasonable or not. The development itself takes 2 - 3 months. The proposal explains in great detail the background, experience, and past projects of the Muesliswap team. Even though the proposal does not provide any personal details of the developers, I don't find that a problem since the explanation of the Muesliswap team’s experience is sufficient.", "q1r": 5, "q2": "The auditability of the project is easy through the public Github repository activity. On top of that the team also regularly update the progress on various channel. However, I suggest adding a metric/KPIs that can evaluate the progress more objectively. The defined success is straightforward and measurable, with successfully delivering off-chain smart contract tooling and tutorials for building them to the community.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 6498, "q0": "There are few templates or tutorials that can be used to develop these tools. The team as Muesliswap plans to create smart contract interaction tooling for other developers in the ecosystem. This would greatly benefit lots of the new projects building on Cardano because they will have various forms of templates or tutorials on how to use the tools that will be built. Similar to open-source coding on github. It is important to see projects coming together in this fund section of \"Developer Ecosystem\" to help each other build on the Cardano blockchain. It is amazing to see at the influence that can have on other projects and will promote great ideas from people that potentially didn't know where to start. For these reasons. I give this section of the proposal 5 stars because I believe it can help the community and ultimately benefit the Cardano ecosystem by allowing more developers to come into the ecosystem and start building.", "q0r": 5, "q1": "The team at Muesliswap is very well known in the Cardano community. As stated in this proposal, they are one of the biggest early projects building on Cardano and they would like for other people to have easier access to such tools in form of templates or tutorials. The team has a lot of experience and based off of that alone, there is a likely chance that this proposal will be implemented successfully. They have a detailed roadmap that describes everything that the team has achieved thus far and what they plan on implementing if funded. It is a good thing that they have a large community that can help them be accountable to this plan/proposal if funded. Accountability is a great indicator of how likely a proposal will be funded. If the team feels that they are held accountable for this proposal, they will likely get it done in the time frame as described in this proposal. For these reasons, I give this section 5 out of 5 stars.", "q1r": 5, "q2": "There is a lot of information included in this proposal. It is concise and straight to the point which makes it easy to understand what the vision is and how the team plans to accomplish this goal. The detailed budget breakdown describes exactly how the potential funds will be utilized. This proposal is important because it has the community in mind. This will benefit many developers and community members if funded. Muesliswap is a part of the Cardano Defi Alliance which means that they will also be held accountable by their fellow builders and developers. I am led to believe that there is a great deal of information that directly impacts the current challenge in the ecosystem. For these reasons, I give this section 5 stars as I believe that there is sufficient information provided to ensure that this proposal will be successful if funded and that it will benefit the community in many ways. ", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 10801, "q0": "Building on the challenge's central question, this project focused on creating a positive developer experience by creating tutorials, publishing sample code, and guiding the community to build their apps to interact with Smart Contracts in general, thereby enriching the Ecosystem for developers with hands-on tools and guidance to begin building DApps that work entirely with off-chain tools. The proposal highlights Cardano's underutilized strengths as well as limitations relating to smart contract passivity. Given the future benefits this project can provide Cardano developers, it is easy to understand the intimate relationship between this proposal and the challenge.", "q0r": 5, "q1": "The proposal includes information on the three essential phases of the project, as well as a list of activities and the time required to execute them. The budget for each period is also attached. The introduction to the MuesliSwap team also impresses readers due to the team's experience and talents. However, the proposal still has some minor flaws that must be addressed. The first concerns the project's timeline; I only see the development phase mentioned, but there aren't enough three stages as in the budget part. Second, given the requirement is to \"provide detail of the people,\" you should introduce your team members rather than just a general group. Third, please detail the management workload if one or more team members are involved in other proposals in this fund 9.\n", "q1r": 4, "q2": "It appears that the closer the proposal gets to the end, the less information is offered. Apart from you confirming that transparency will be guaranteed during the project's development (communicate progress updates on a regular basis, open-source the respective repositories on GitHub), I have not seen you provide specific KPIs for this project on which the community can base its monitoring of the project's development. Furthermore, I see how successful you hope this project will be in the future, but your wording is unclear to the reader. Your response is more of an introduction to the project's goals than a visual representation of project achievement. Please review and edit again so that the proposal can be more perfect.\n", "q2r": 3, "assessor": "z_assessor_3193", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10922, "q0": "This proposal effectively addresses the challenge. It aims to publish open-source tutorials and sample code to let developers incorporate Cardano into their own applications and implement smart contracts utilizing its Cardano integration. This proposal can help attract new developers and help existing developers in off-chain computations. ", "q0r": 5, "q1": "The proposers state that the plan provides a bullet point list of expected deliverables with time-based estimates to reach those milestones. The roadmap is vague and has no hard dates attached, and no milestones are associated specifically to the asking budget item. The proposal team is a known quantity for the community through their MuesliDapp release on Cardano mainnet in November of 2021. According to GitHub, https://github.com/muesliswap.\n\nThe total budget is $71,250. This budget is detailed by hours and by characteristics. The proposers mention that in case of exceeding the budget, OpenSwap will take care of the additional costs.\n\n", "q1r": 4, "q2": "This proposal provides me with sufficient information to assess the progress of its goal. By committing to use open source repositories and develop their products under GitHub the entire Cardano community will be able to track the proposal completion process by accessing their respective repository sites. In addition to providing a clear measurable end product, I note that the project timeline is relatively short in comparison with other proposals within this fund which provides confidence in seeing through to completion and project implementation.", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Continuously developing such components ourselves, we want to provide templates and tutorials for building them to the community and thereby enable non-experienced users to make their contribution.", "experience": "We are OpenSwap Technologies - the team behind MuesliSwap, one of the biggest decentralized apps on Cardano. As developers of DeFi infrastructure, we have experience with all aspects of Cardano regarding both off- and on-chain code, in particular off-chain orderbook matchmakers."}