{"id": 423113, "author": "dag1", "title": "Rendering and Tokenomics Consultant", "url": "https://cardano.ideascale.com/a/dtd/423113-48088", "category": 26597, "amount": 20000, "description": "The ecosystem has many projects that require 3d rendering and tokenomics but without proper coordination, these integrations are difficult to achieve", "f6_no_assessments": 6, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 2379, "q0": "This proposal intends to help funded projects on Catalyst with their 3D rendering and Tokenomics.\nOne problem with this proposal is that it lacks a clear focus as it is dependent on projects that \nare funded that need 3D or Tokenomics.What happens in a situation whereby\nno proposal that 3D and Tokenomics are funded ? Does that mean that the team will likely be idle?\nWhat i would have prefred was for the team to scout for proposals needing this requirement during \nthe consultation phase on catalyst to partner and the apply for funds ar regards\n to waiting for a project to be funded (in which case thay might have already engaged helpers and wouldn't need the teams help).\nI honestly do not see how this benefit the cardano developer community and i will be giving 2 stars for impact according to PA guidelines.", "q0r": 2, "q1": "The proposal set a roadmap that is pegged at 6 Months (12 hours per week), i would have loved to see a schedule of the activities but the roadmap lack those.\nThe budget breakdown was provided to justify the requested amount but failed to provide clear details as to how some amounts were arrived at.\nFor example \"Monthly payment: 3000$\" - How did the team arrive at $3000 ? What are that activities that lead to $3000?\nAs you can see there is a lack of clarity as to how some aspect of the budget was arrived at.\nThe proposal provided verifiable links to the team members bio and git.\nConsidering the provided information, i can neither agree nor disagree that the team is capable of executing the proposal to success.\nI will be giving 3 stars for feasibility.", "q1r": 3, "q2": "The provided information \"We will be collaborating through miro, trello, github and various discord channels to help identify team member and user needs throughout the development Process.\"\nis not a metric to measure success and i am disappointed by the effort put in this section.\nI will encourage the team to use previously funded proposals as a reference while drafting their proposal in the future here https://docs.google.com/spreadsheets/d/15ELXp81NfvXHgrerTbuIofZOXBsdjocN1YgBK0gPP3E/edit#gid=2111315347\nI will be giving 2 stars for audit-ability.", "q2r": 2, "assessor": "z_assessor_2301", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 5431, "q0": "As with NFTs and 3D modelling are lead market runner in blockchain. As many projects running in blockchain that requires 3D modelling and  tokenomics , But integrations process is way to low due to lack of coordination its getting difficult to achieve. As proposer wants to provide proper support in 3D modelling and tokenomics to all existing project. As many lack support in 3D modelling many is skipping that part during and many with lack of support postponing there projects which is sad part. So, I strongly agree with proposal and This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has provided detailed roadmap and there timeline for total duration of 6 months. As work will be split into  iterations of 1 month. They have provided detailed budget breakdown consisting of monthly payment for \nfixed payment per month per iteration which is 3000$, They have given full details and \nIt looks sensible.  The team consisting of 2 members who have good experience as developer. As they have provided all details I strongly agree with proposer and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As proposer will be providing details on deliverables and with how many projects they had helped in 3d modeling. They also will provide number of engagements and throughout for 6 months. As they will be providing details about there project reports and weekly updates on status of progress. I feel with given data and reports it can be audited.\nI strongly agree with proposal and with the \n information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 6830, "q0": "There are so many early startup problems that no single project has been able to get perfect which is tokenomics. Tokenomics is a very complex aspect of the cryptocurrency ecosystem (Always difficult to exactly get a perfect model). However the proposer seeks to create a platform that will document different models of tokenomics from different projects and the community will debate about those different models and from there, devise a more upgraded tokenomics from those existing models.\nThese will serve as a goto hub for startup projects to get documentations of different models of tokenomics and these will ease some part of the development process.", "q0r": 4, "q1": "The project is designed to have several iterations for a period of six months (12hrs/week) with an expected output in form of a report for public presentation and discussion which will set foundation for the next iteration. These however dictate the team's plan of implementing the idea. Some further approach mentioned is Agile principles which will ensure improving and noting values in small increments (the 3D renedering is also a needed aspect for same solution). However, i couldn't find information about how debate feedbacks will be noted and through what platform (Most probably, team might have to constitute a DAO and provide a forum for community engagement so that inputs can be easily tracked). The budget is fair and reasonable. Two team members were mentioned with links to their profiles. In as much as i believe the team can deliver the project, i also believe they need more team members to effectively work these idea. ", "q1r": 4, "q2": "There's clarity in their implementation plan which sets well some objective deliverables which can then be used for the next iteration. These alone gave enough room and information to audit the project. There'll be more collaborations with different projects, communities throughout the development process. The projects success can be evaluated through several key points which were all provided by the proposer and i think it is well suited and relevant.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 11841, "q0": "The challange is trying to improve developer experience within the ecosystem and I agree with a bit of background in software engineering myself, that especially 3D rendering in combination with blockchain projects can be tricky to achieve. However the proposal team has failed to define a clear problem they want to solve nor how the solution to it would look like. The proposal remains very vague on what the team wants to achieve with primarily stating they want to work fixed number of hours per week for a specific timeframe to improve interoperability within the ecosystem. Based on these facts its really hard to assess what impact the proposal might have on the ecosystem and i can neither agree nor disagree if it effectively meets the challange requirements.", "q0r": 3, "q1": "The team consists of two people. Based on the provided resources they are part of the cardano community and are quite active in their respective areas. What has not been explicitly provided is proof of knowledge in the primary stated problem area of 3D redering. The team does not provide a step by step road, and frankly speaking any roadmap at all. The proposal makes it very hard to quantify if successful implementation is likely as there are not criteria provided to measure it. The budget asked for is reasonable in terms of the planned time spent, a goal oriented approach would make it much easier to assess feasibility of the proposal.", "q1r": 3, "q2": "The timeline is well defined with a hard scope of 6 months. There are no KPIs provided nor any tangible deliverables that could be used to measure project progress throughout the provided timeframe. Considering the main goal of the proposal is to provide working time and experience the stated risks to not be able to actually spend the commited time are substential. With the provided information i strongly disagree that the project progress and success can be audited sufficiently", "q2r": 1, "assessor": "z_assessor_3289", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 15058, "q0": "While consultancy services for developers is in principal a valid project for the Developer Ecosystem challenge, the combination of topics covered by this proposal, 3D rendering on one hand and tokenomics on the other are most likely not topics that can be served together or interest the same people and the proposal does not present a good case for how or why these unrelated topics will be presented together.\n\nThe authors claim that they have provided consultancy to other projects in the past, but no evidence of this is presented in the proposal, the only links are to their own projects. Actual collaborations would be very valuable to see and I would advise them to include proof of them in case a future resubmission is required.\n\nThe risks are not sufficiently identified or addressed, as the proposers seem to talk about what would happen in the case they will not get the funding. The risk question is however meant to identify potential risks in the eventuality that they will get funding and the project is implemented.", "q0r": 2, "q1": "The implementation plan is presented for 6 months of activity, but is very generic, making it hard to determine what is the actual work that is going to get done.\n\nThe budget breakdown is equally generic and unfortunately doesn’t provide enough detail to be convincing.  Especially the last line about “contribution rewards” is not clearly presented. What would that mean in the context of a consultancy service? In the same time, if it is part of the plan for good reason, why only 10%? In conclusion the budget is not sufficiently explained or detailed.\n\nThe proposers do provide links to their professional profiles and past projects, however from the links provided I wasn’t able to verify the specific skills that the proposers mention they want to provide consultancy for. And that is particularly worrying since they would not only need to be competent in the respective skills (3D modelling and tokenomics), but they would actually need to have expert level knowledge in order to be able to provide worthwhile consultancy to the community. People can choose to be mentored by however they want, however it’s a different matter when by being a Catalyst winning project, they would not only receive funding but also the endorsement of the community.\n\nI’m not necessarily implying that the proposers don’t have the skills to consult other members of the Cardano community, but if they do they I would encourage the team to adequately  present them in the proposal.", "q1r": 2, "q2": "Miro, trello, github and discord are mentioned in the auditability section as ways “to help identify team member and user needs” but no mention is made about how the actual results of the consultancy sessions or the project in general will be presented to the community.\n\nNo KPIs are present and no metrics are detailed.\n\nAdd to this the fact that the presentation of the project is very generic, and it makes for a proposal that would be almost impossible for the community to efficiently audit and determine if it has indeed delivered on its promises.\n\nThe definitions of success are unfortunately equally vague and generic as the general presentation of the project.", "q2r": 1, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15260, "q0": "This proposal describes the problem vaguely and without context. What projects need 3d rendering and tokenomics model? There is not enough context to understand what the problem is and how it relates to this challenge.\n\nThis is not exactly a proposal, but a conceptual idea that needs a lot of refinement to become a proposal.\n\nFirst I would recommend that the proposer explain the problem and how the solution can add to the developer ecosystem, as the definition \"Therefore this proposal aims to work with existing projects that are building solutions and seek to support emerging standards regarding 3d rendering and tokenomics.\" it is not objective.\n\nThere are no metrics/KPIs that project potential impact on this challenge.\n\nUnfortunately my feedback is limited due to lack of clarity on what will be developed and why it will be developed.", "q0r": 1, "q1": "As I mentioned before there is no clarity on what will be developed, so there is no way to say whether the indicated team experiences are relevant or not.\n\nThere are links to repositories, which is a good thing, I recommend keeping that.\n\nThe plan mentions interoperability, but it is unclear what need to have interoperability or how interoperability will work.\n\nThere is mention of documentation development, research and collaboration with other projects, but there is no context for how these activities will be carried out and for what purpose.\n\nThere is no way to say if the budget or the timeline are appropriate because the activities to be developed are not described in an understandable way.", "q1r": 2, "q2": "There are no metrics/KPIs. Despite the mention of deliverables such as documentation and articles, the definition of success could not be easily verified due to the lack of clarity on what will be developed. Documentation/articles for what?\n\nRegarding the roadmap, the following definition is extremely subjective \"The work will be split into iterations of 1 month. Each iteration would include some output in the form of a report or public documentation, a presentation of the deliverable, and an alignment session for the next iteration with key stakeholders.\"\n\nThese monthly outputs were not properly explained, there is no clarity on what to expect as a monthly result, so auditability is on the negative side in this regard as well.\n\nThere are no proper milestones.\n\nThere is a general lack of clarity to allow for the lowest auditability conditions.\n\nI would recommend that the team seek help from the Discord/Telegram groups to prepare a new proposal. I would also recommend watching tutorials on the Catalyst School YouTube channel.", "q2r": 1, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Work with existing projects to provide 3d rendering and tokenomics. ", "experience": "Relevant Experience;\nMarlowe Pioneer Program\nPlutus Pioneer Program\nGamechanger Wallet Development\nCardano Cli \nBlender and general 3d modeling "}