{"id": 382189, "author": "fhilip.k", "title": "Spanish/Portuguese Voter Survey-AIM", "url": "https://cardano.ideascale.com/a/dtd/382189-48088", "category": 26242, "amount": 10500, "description": "ラテンアメリカ特有の有権者に関する情報はよく理解されていない。Catalyst有権者のグローバルなエンゲージメントを確保するためには、より焦点を当てる必要がある。", "funded": 2, "upvotes": 70969382, "downvotes": 13669170, "votes_result": 57300212, "votes_cast": 335, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は非常に興味深く、課題の目的によく合致しています。このチームが、CAやvCAのためのツールなど、コミュニティの重要なツールをすでにリストアップしていることを考慮することが重要です。ここでのアイデアは、以前にf6で立ち上げられたプロジェクトの延長線上にあります。それは、投票者の中から投票を行うというものでした。ここでは、ラテンアメリカで話されているポルトガル語とスペイン語の研究を更新し、このコミュニティがCatalystをどのように理解し、相互作用しているかを理解しようと考えています。これにより、ラテンアメリカの人々に焦点を当てた集団的意思決定の流通プロセスが改善されるため、この大陸の住民に大きな利益をもたらすことができます。そしてもちろん、これはカルダノのエコシステムにも大きな利益をもたらすでしょう。特に、この研究が何度も行われ、改善されればなおさらです。このプロジェクトは、Catalystの資金調達プロセスの質を確実に向上させ、カルダノコミュニティ全体にも良い影響を与えるでしょう。", "q0r": 5, "q1": "スクリプトについて：まず、リサーチを事前に公開してくれるというのは非常に助かります。全く同じというわけではありませんが、これによって、このプロセスが何を作ろうとしているのか、非常にしっかりとした最初の概念を、おおよその形で知ることができます。このプロジェクトの活動内容は比較的シンプルで、台本と詳細を見れば完璧に理解することができます。著者によれば、2月末には彼らが調査・報告した内容が手に入るという。また、このプロジェクトでは、アンケートの対象となるような質問を盛り込んでいるのもポイントです。今回のチームは、このプロセスを成功させる能力を十分に持っています。このことは、2つの事実によって保証されています。1つは、彼らが誰であるかを詳細に説明していることで、私たちは彼らの名前、職業的背景、彼らがこれまでにCardanoコミュニティのために何をしてきたかを知ることができます（インパクトで述べたように、彼らは他のプロジェクトに加えて、CAやvCAによって広く使用されているツールや、この調査の最初のバージョンをすでに行っています）。したがって、技術的に非常に優れていることに加えて、彼らができることをすでに実践で示しているので、メンバーの能力には完全な信頼が与えられています。また、予算については、プロジェクトの適正価格だと思いますし、非常に詳細に記載されているので、それぞれのことにどれだけの費用がかかるのかを理解し、予算がどのように使われるのかをよくイメージすることができました。", "q1r": 5, "q2": "この提案は監査が容易で、著者は監査可能性に関する一連の情報を提供しています。具体的には、プロジェクト開発の進捗状況を確認できる「プロセス」のトピックや、期待される最終結果を示す「成功指標」のパートで説明されています。比較的短くシンプルな提案であり、順調にいけば2ヶ月間で全体を開発することになりますが、チームは研究開発の終了時と結果が出た後の2つのタイミングでコミュニティと連絡を取ることができると思います。期待通りの結果が得られた場合にはアンケートを実施し、それをコミュニティ全体に提示することができます。また、実際には3つ目の接点があってもいいと思います。しばらくしてから、将来的な背景を考慮して、チームは研究が触媒の変更にどのような影響を与えたか、それがカルダノのエコシステムにどのような利益をもたらしたか、などを収集することができ、それをコミュニティの他の人々にも伝えるべきです。全体として、このテーマに必要な要件をすべて満たした、非常にオーディットな提案だと思います。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 20, "ne": 14, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The proposal focuses on consider region and community(Latin-America) based voters who are voting for the community proposals for funding, and the proposal indicates to improve survey by incentivising the voters and also by translate the same into Spanih and Portuguese. This would inturn improve the engagement of the Latin American community thus improving the increased number of voters as shown from fund 6 to 7", "q0r": 5, "q1": "The team AIM is has been responsible for one good Community tool kit and have delivered it in a great way. Also it has active members from community/catalyst working together as mentioned in the proposal, and have experience previously working and delivering in the same fashion", "q1r": 5, "q2": "They have provided a detailed information in the proposal including details of their previous work and surveys and corresponding results, They have also mentioned success parameters, road maps and milestoes. The proposal also holds details on budget breakdown and relevant info.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 24, "ne": 4, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree the proposal is impactful. A survey about interaction between voters and Catalyst in Spanish and Portuguese will help us better understand about how the LATAM Cardano community sees, understands and interacts with Catalyst. These information definitely benefit Catalyst as well as Cardano ecosystem to improve over time. Additionally, the proposal is able to scale to address future challenges (executing in another regions for example) because voters play an important role in our system.", "q0r": 5, "q1": "This proposal is following the Incentivized voters survey which funded in Fund6 (link included), now the team aims to update and translate it into Spanish and Portuguese, so that feasibility should not be a big deal. \r\nSince the Fund6 proposal was successful, I compare between budget of this proposal and budget of the previous one in details and my conclusion this proposal's finance is very reasonable to achieve the set goals. The updating content is more diverse about voters behaviour, looks promissing about a more successful result in the specific region survey.\r\nTherefore, I trongly agree the proposal is feasible.\r\nI recommend the team should consider challenge and risk relevant to the successful implementation.\r\n", "q1r": 5, "q2": "The proposal provides roadmap with milestone and time horizon and time KPIs are outlined clearly, easy to see and easy to audit the progress of the implementation. \r\nI would like to know more clear about this: 'Fifty randomly-selected participants will receive $60 each. One respondent will receive $500'. So, is the $500 randomly also? Or any criterias for that?", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The value of understanding Latinamerican Voters in undeniable, but I believe the contribution of this to the challenge of growing cardano in Latam is quiet limited since is aims at the already participating community. the main challenge is awareness in the region.\r\nOf course the insight gathered in the survey would only be valuable if there is a way to translate it into actions, it would be great to include suggestion on how that information would be used in that sense.", "q0r": 3, "q1": "-The proposal is very well structured and detailed.\r\n-The team behind it has the credentials to make it happen except for the lack of spanish and portuguese opening a risk of intepretation of the results. I'd respecfully suggest including local talent in the proposal.\r\n-The budget requested seems a bit high for the task at hand. Quite a bit of the budget is \"lost in translation\" from english to local language and then back to english. ", "q1r": 3, "q2": "The proposal is clear and detailed, easily auditable since the deliverables and timeline are easy to track.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "It describes a good solution to resolve two actual problems, the first one: to improve the Catalyst Project Ballot trough numbers and data analysis; And the second: to make known the Catalyst Project to people like me that five weeks ago, I owned Ada but I didn't know anything about the Catalyst Project.", "q0r": 5, "q1": "They are active members of the community and their experience has been proved day by day through the Telegram groups and their active participation in the Town Halls. They have experience and Knowledge about what they are talking. I don't have any doubts that they are able to achieve it.", "q1r": 5, "q2": "They have described with detail what they pretend to do. They already have started on the last Fund and they are about to release the results,  they need support to finish and improve their project getting money in this Fund.", "q2r": 5, "assessor": "z_assessor_765", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "スペイン語とポルトガル語でインセンティブ付きのアンケートを作成し、情報を得て、この情報を将来のCatalystの改善に役立てる。", "experience": "AIMメンバーは、Community Tool Kitを支えるチームです。"}