{"id": 384127, "author": "sbpabon", "title": "Technical school for Latin America", "url": "https://cardano.ideascale.com/a/dtd/384127-48088", "category": 26242, "amount": 7500, "description": "ラテンアメリカの人々（開発者も）は、ブロックチェーン技術について間違った理解をしています。蛇の油のように投機的なものを売る詐欺師が多すぎる。", "funded": 0, "upvotes": 16278050, "downvotes": 25765118, "votes_result": 9487068, "votes_cast": 121, "f6_no_assessments": 6, "f6_rating": 3.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "人々がブロックチェーンについて学ぶためのeラーニング・プラットフォームを持つことは不可欠ですが、この提案では、このプラットフォームがどのように機能するのかについての情報が不足しています。\r\nゼロから開発するのか、既存のeラーニング・プラットフォームを利用するのか。使用料は発生するのか？もしそうであれば、低所得者向けの無料枠を設けるべきでしょう。\r\n次に、どのようなコンテンツ（シラバス）を提供するのか。どのようなフォーマット（テキスト、ビデオ、ポッドキャスト、ライブ講義）を使用するのか。その影響をよりよく評価するために、コンテンツが提供される言語も提案書に記載する必要があります。また、コミュニティはこのプラットフォームとどのように関わっていくのでしょうか？コンテンツの投稿やリクエストは可能でしょうか？これらの情報はすべて最初から入手可能であるべきです。\r\n\r\n最後に、プラットフォームを開発する前に、この提案には有料の学習ステップがあります。これにより、プロジェクトがコミュニティに価値を提供するまでに、かなりの時間がかかります（1学期分の遅れ）。学習プラットフォームを開発するための、より迅速な結果をもたらす提案は他にもあります。興味深いのは、提案者が自分で学習しながらプラットフォームを開発し、その過程を共有し、質問や議論を自分のコースとeラーニングプラットフォームの間で行き来させることだ。もし、彼がすでに教師であれば、このような相互関係を築くことは難しいことではありません。", "q0r": 2, "q1": "このプロジェクトには一人の人間がすでに専念していますが、彼が教えようとしていることについての知識はほとんどありません（この知識はプロジェクトの第一段階で深められるでしょう）。このため、このプロジェクトは技術的な実現可能性の面で少し危険です（提案者の品質と経験の低さを考えてみてください）。\r\n\r\n日付の入った計画/ロードマップがありますが（これは良いことです！）、実際に開発を始める前の学習段階を含むため、完成までの期間がかなり長くなっています。\r\n\r\nコストの内訳が記載されていますが、プロジェクトの主要部分についてもっと詳しく書かれているといいと思います：5k USDがプラットフォーム開発にどのように使われるのか？", "q1r": 2, "q2": "提案書にKPIとして記載されているものは、実際にはマイルストーンであり、定量的に測定できるものではありません。真のKPIとしては、コースの成績（コミュニティが自分のコースにお金を払っているのだから、高い成績でなければならないし、コミュニティに価値を還元しなければならない）、プラットフォームの利用者数、生成されたコンテンツの数などを測定することができる。これらはすべて、時間に関連した目標です。\r\n\r\nリスクとしては、このプラットフォーム用のコンテンツを本当に作るための十分な知識をコースで得られないことが挙げられます。", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Unfortunately, there is a lack of information in this proposal. \r\n1) How the platform will actually work? Is it going to be developed from scratch or are you going to use an existing one? If you're going to develop, why are you doing it since there are several others?\r\n2) Since you're creating a 'course', are you planning to monetize it or, since you're thinking in a cultural, caring and developing manner it'll be free? If this have a cost, how much is it going to be?\r\n3) Which country of LATAM you're thinking to reach first? The ones with Spanish language, Portuguese, etc.?\r\n4) the proposal is much more focused in your learning step than developing the community.\r\n", "q0r": 1, "q1": "There is no explanation of the methodology that will be adopted in the course, no syllabus, no country/language reference (since LATAM has several languages within it). There is not a detailed explanation of e-learning platform approach. It needs more detail in the timetable. \r\nThe lack of information makes it hard to know if this proposal is feasible besides the scholarship part.\r\n", "q1r": 1, "q2": "The KPIs is not a metric, nothing that can be measured objectively. A KPI would be # positive feedback using the platform, # feedback of syllabus, # people using the platform, etc. The timetable is not detailed as well.", "q2r": 1, "assessor": "z_assessor_25", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "The proposer wants to build a learning platform that will teach the blockchain technology to latin american people. This proposal has effectively identified a problem within the challenge. The problem the proposal is trying to solve is the miseducation of certain people on the blockchain technology. I would suggest to the proposer to be more precise on the subject that will be treated on the platform. The proposer should also be more clear on the type of content that will serve as learning material, whether it will be articles or videos. Apart from that, I think that this proposal can add value to the cardano ecosystem by bringing new users who can help build it. Furthermore, I think that the proposal can scale in future challenges.", "q0r": 4, "q1": "The idea in this proposal is very interesting. However, there is a lack of information that can compromise its feasibility a little bit. Providing these information can greatly improve the quality of the proposal hence its chance of being funded. The budget should be broken down into identifiable items. In addition to that, the proposer should include a plan for future funds if needed. Furthermore the  proposer should include challenges and risks relevant to a successful implementation. I have a neutral note on the feasibility of this proposal based on the amount of information provided in that regard.", "q1r": 3, "q2": "The proposal includes milestones but it is really vague. The KPIs are not very strong in my opinion but they are included. I think that the proposer should focus on providing more information on what steps are needed to build the platform. Failing to do so will result in a difficult auditability. My note is neutral in the auditability as it needs improvements.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 18, "ne": 4, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about bringing people closer to blockchain technology. This is a great and meaningful idea. The problem is clear, suitable to the given challenge and clearly explained in detail, and the proposed solution is quite well-prepared [with a specific milestones, budget breakdown, and KPIs,...], showing potential impact on the Cardano ecosystem as a whole. Therefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Proposer profile is provided and described enough for understanding, with suitable skill, experiences, and local background [very important for this kind of work] for implementation, with reference/proof (https://github.com/sebpab) for verifying. Moreover, the plan is specific and well-prepared. So, this convinces me of feasibility. However, for a better understanding of feasibility, the risk management should be defined. Therefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "This proposal provides plenty of information. The plan is clearly described. However, for a better understanding, risk management should be defined. Based on the given information, I agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This proposal sets out a clear problem which is clearly linked to the challenge criteria and deliberately linked in the sections \"How I address the Challenge question?\" and \"How my proposal impacts the challenge metrics? Thus the desire and reflection of a positive impact in the Latam ecosystem is clearly developed. And allows one to imagine the positive impacts on the Catalyst community as a whole with this goal to  make like a bridge between Cardano technology and the most important problems in the Region. which may not be clearly stated in the KPIs, which rather address technical implementation issues, but which is still understandable, as it has already been stated beforehand.", "q0r": 4, "q1": "The participant experience and skills are clearly described with links to his profile and videos. The budget is clear and looks realistic, but perhaps could have been a little more detailed regarding the construction of the platform.\r\nThe roadmap is not clearly stated even if  appears implicitly through the Milestones and the definition of success after 3, 6 and 12 months. The technical aspects and contextualization are well explained in particular in the objectives of the beginning\r\n Overall, the project seems realistic, particularly in terms of temporal realization. But the possible risks have not been addressed.", "q1r": 4, "q2": "The informations given emphasizes the benefits of this project for the Latin American ecosystem, its direct relationship with the criteria of the Challenge as well as its positive impact in local terms. Unless I am mistaken, perhaps it would lack more precision especialy with details of how the progress of the project would be transmitted and communicated to the community at large. Even if it´s seems posible to follow it on github. The KIPs and metric values ​​could also have specified the quantitative objectives in terms of educated people, to give more idea on the number of people concerned, which would have specified the impact at the local level of this project. But a time horizon is given with an Expected public launch date of the platform in August 01, 2022, which is a good point.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This is an amazing education initiative and effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer's GitHub shows they have begun some level of plutus pioneer training, as well as other repos in various languages. The plan included has KPI's, milestones, roadmap and a budget.", "q1r": 5, "q2": "The proposer has described their plan to build a technical learning platform for blockchain enthusiasts in LatAm in solid detail within the proposal. The info provided is sufficient to audit the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_966", "no_vca": 25, "ne": 1, "ng": 12, "nfo": 12, "vca_o": 1}], "solution": "人々を技術に近づけるためのブロックチェーンの売り込みを完全に捨てる。解決策は納得させることではなく、教えることです。", "experience": "過去20年間、コロンビア（私の国）で社会起業家として活躍。教師。開発者。Atala Prism Pionnerの学生。CAです。"}