{"id": 384117, "author": "benzvibenjamin", "title": "Spanish courses for universities", "url": "https://cardano.ideascale.com/a/dtd/384117-48088", "category": 26242, "amount": 4440, "description": "ラテンアメリカの学生は、カルダノやカタリストについて十分な情報を持っていない", "funded": 1, "upvotes": 48610816, "downvotes": 14870133, "votes_result": 33740683, "votes_cast": 181, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は、ビジネスマンの学生にカルダノとカタリストについて教えることを目的としたコースを作ろうとしているため、このチャレンジの目的と非常によく一致しています。このプロジェクトが成功すれば、ラテンアメリカとカルダノのエコシステムの両方に利益をもたらすことは間違いない。なぜなら、ラテンアメリカにとっては、プロジェクトファイナンスによる経済的インセンティブを促進し、我々のブロックチェーンにとっては、我々のテクノロジーを利用する新しいユーザーをもたらし、その結果、カルダノのリーチを拡大することになるからだ。ただし、ここでは数時間の作業が必要です。まず、このコースの詳細はあまりわかっていません。メインとなるのは、CardanoとCatalystであろうことはわかっています。しかし、各クラスの具体的な科目は何か？各クラスはどのくらいの期間で行われるのか？ビデオはどのようなプラットフォームで配信されるのでしょうか？コースは無料ですか、有料ですか？コースの総期間はどのくらいなのか？このプロジェクトの最も基本的な部分について、詳細はわかりません。また、3人のチームメンバーのうち2人がヨーロッパに住んでいる場合、対面式のミーティングはどのように行われるのでしょうか？どこでミーティングを行うのか？一度に会う予定の学生の平均人数はどのくらいなのか？この対面式のミーティングはどのくらいの時間続くのか？一般的に、私はこのアイデアに好感を持ちましたが、詳細が不足していたと思います。インパクトがあるのは確かだが、さらに安心感を持つためには、ここで何を言っているのかを正確に理解する必要があるだろう。", "q0r": 3, "q1": "このチームには、プロジェクトを成功させるだけの能力があるとはとても思えない。ベンジーとビクターはフランスでビジネスを学び、パコはジャーナリストだ。彼らは皆、このコミュニティに入ったばかりだと言う。では、彼らにこのコースを推進するための準備ができるのだろうか？彼らは、すでにブロックチェーンをよく理解していることを証明しているわけではありませんが、質の高いコンテンツと深いテーマの授業を作ることができるでしょう。私は、彼らが時間的にすでにコミュニティにいて、すでにカルダノで仕事をしていて、技術的な部分をマスターしている人を雇えば、このアイデアはもっとうまくいくと思います。ビジネススクールの学生がここで何ができるのか、正確には理解していません。Pacoの役割がプロジェクトの広報であることは理解していますが（広報とは何かを知りたいです）、残念ながらこのチームからは、コースの作成に取り組む自信が持てません。先に述べたように、ブロックチェーンを専門とする人たちを入れて、そうですね、タスクを分けて、誰が何をするのかを理解できるようにすれば、必要な自信が持てるのではないでしょうか。スクリプトについて、著者はプロジェクトの開発に必要ないくつかのステップを記載していますが、詳細が不足していると思います。どのようなプロセスになるのか、深くイメージすることができませんでした。例えば、最初のステップである「コースを作る」では、題材、期間、プラットフォームなど、前のトピックで述べたような詳細がすべて思い浮かびます。プロモーションとマーケティング」では、どの大学にアプローチするのか（どの国になるのかはわからないが、おそらくアルゼンチンだろう）、どのようにするのか、どのようにするのか、ソーシャルネットワークでのマーケティング戦略はどうするのか、などを詳しく説明する必要があるだろう。そして最後に、ファイナンスに関しては、ステージで見られるのと似たようなことが起こります。基本的な情報はありますが、詳細な情報はありません。それぞれのテーマについて、著者はもっとうまく説明できるはずです。", "q1r": 3, "q2": "著者は、プロジェクトをモニターするのに十分役立つ情報を提供しているが、それは結果がすべてである。それは端的に言えば、何人の学生を教えたか、コース後に何件の提案を立ち上げたか、コース後のハブの形成など、コースの範囲であろう。しかし、結果だけではなく、その過程を評価する手段があれば、それもまた面白いと思うのです。そのため、ここに掲載されている情報は、分析の一部をカバーしているだけで、少し表面的だと思いました。チームが他のコミュニティと連絡を取り合い、ここで選んだデータをレポートにまとめ、タウンホールなどで他のコミュニティに発表することができれば素晴らしいと思います。また、スペイン語圏のコミュニティがコースに参加して評価を行い、そのフィードバックをコミュニティに届けることができれば素晴らしいと思います。つまり、ここには監査可能性の原則があると思うのですが、それをさらに深めるべきです。", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "述べられた問題と解決策は、ラテンアメリカの人々のカルダノとカタリストについての認識レベルを高めることを目的としているため、このチャレンジと非常によく一致しています。世界中のいくつかの調査によると、若い人たち、特に男性は、カルダノやブロックチェーンの活動に参加する可能性が高いことから、このソリューションのアプローチはポジティブな影響を与える可能性が高いと言えます。リオデジャネイロ出身のブラジル人である私の経験では、大学生のほとんどは、全員とは言わないまでも、少なくとも暗号通貨やブロックチェーンについて耳にしたことがあると思いますが、その大半は、この技術に参加する方法を知らず、そこから得られる利益を理解していません。ビジネススクールでCatalystに関するスペイン語の授業を提供することで、そうした学生たちの関心を喚起し、カルダノ／Catalystのエコシステム、彼ら自身、そして彼らの国にとっての価値を生み出すことができるのではないでしょうか。彼らは次世代のビジネスリーダーであり、カルダノとカタリストに関するこれらの情報は、次の数十年に向けて新しいビジネスと社会のインフラを構築するための手段となります。このKPIは、コミュニティに新しいメンバーを呼び込み、次のファンドサイクルで新しい提案をすることをサポートするという点で、このチャレンジで示されたKPIと完全に一致しています。ただ、課題で示されているように、提案の質を評価するKPIを追加することを提案します。これは素晴らしいアイデアだと思います。エンジニアリングや経済学の学生など他の分野にも拡大し、ブラジルの学生のためにポルトガル語版を用意することもできるでしょう。", "q0r": 5, "q1": "彼らはすでに、ターゲットとなる人々に共感できる3人のラテンアメリカのビジネス学生のチームを持っています。必要な労働時間が詳細に記載されており、具体的な行動と期限が明記された明確なステップ・バイ・ステップの計画があり、予算も理にかなったもので、課題の総予算の1％以下で済んでいます。リスクを特定し、それを軽減するための可能な解決策を提示している。ただ、コースがどのように実施されるのか、例えば、対面式かオンライン式か、ライブか録画か、どのプラットフォームか場所か、無料か有料か、また、効果的なコースを構築するために必要なスキルについての情報が不足していました。いずれにしても、完全に実現可能であると確信しています。これらの情報を追加することで、5つ目の星をつけることができます。", "q1r": 4, "q2": "ロードマップには、マイルストーンと時間軸が示されていました。しかし、コースについては、時間数やコンテンツの内容など、もっと具体的な情報があってもいいと思います。そうすれば、コース開発の進捗状況を容易に把握することができます。さらに、ステップ2の進捗状況をより正確に把握するために、どの大学でこのコースのプロモーションを開始するのかを明記することもできます。KPIは理にかなっており、このプロジェクトにおける成功の意味を明確に定義しています。", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 21, "ne": 12, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "A proposal is a well-laid-out approach to the challenge at hand. The challenge is Latin American students not having enough knowledge about Cardano and Catalyst. The proposal wants to resolve it by creating a course about Catalyst for Latin American students. This clearly addresses the challenge", "q0r": 5, "q1": "The team appears to be well versed with the requirements and has the essential expertise to make this proposal a reality. The team has provided the voters with a clear action plan with steps needed to be taken. The proposal was also given a detailed budget breakdown and the fund requested also appears to be reasonable hence the possibility of the proposal being implemented successfully is high", "q1r": 5, "q2": "The proposal consists of well-laid-out steps and KPIs that auditors can use to track the progress of the proposal. the team has also mentioned possible challenges and risks the team might face during the implementation and has also given a complete fund allocation all this information will be enough to track and audit the progress of the proposal successfully.", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 19, "ne": 5, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal certainly fits the challenge of acquiring more users and adoption for Cardano. Bringing common knowledge about Cardano to students of universities in Latin America. Creating a catalyst for Latin American students in business schools. The given solution completely solves the problem.", "q0r": 5, "q1": "Clear, detailed plan and proposed milestones seem very easy to achieve the set goals\r\nA number of potential risks and challenges have been identified and the proponent offers solutions to address some of them. Offer to give clear step by step plan with different milestones as mentioned earlier as well as potential challenges or risks he may face\r\nThe downside of this suggestion is that you don't provide enough information, it would be better if you add background and need proof of your experience for the community to believe", "q1r": 4, "q2": "A clear roadmap with 3-month milestones is provided. A reasonable timeline and solid goals were presented.\r\nAn entire section with easily tracked KPIs along with a list of plans after the first 3 months will increase the transparency of this project and proposal. I agree that the suggested data and success criteria are accurate for measuring progress in the challenge\r\nThe stated budget is reasonable enough and it makes me completely agree that the team can tackle the challenge. Very well thought out and presented budget", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is addresses directly the challenge through elevating Cardano's awarenes in the business school students communities in Mexico and Argentina who in turn could turn into multipliers and active members of the Cardano Community. I believe this is a powerful way to expand in Latam eventhough the scale of the proposal is somewhat small limiting it's initial potential it has a huge potential to scale into a significant force.", "q0r": 5, "q1": "-The team seems to have a clear idea of how to implement the proposal and have identified risks.\r\n-No evidence has been provided of the team's knowledge and capacities to create content a course on Cardano.\r\n-The budget seems reasonable for the proposed task. It would be great to see how the initiative would scale in future funds.\r\n-The proposal has a detailed implementation plan with defined timeframe, KPIs and goals.\r\n", "q1r": 4, "q2": "- The proposal is implementation and success is easily verifiable as the course would have to be produced but also by verifying the existance of the community and it's activity.\r\n- Proposed KPIs and goals make sense and can be used to asess the success of the proposal's implementation.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Oganizing course for young people in universities is a great way to expose them to Cardano ecosystem. Since the first attention, they can be attracted to become new member of Cardano Catalyst community. The students community is also sensitive with information like that, so hopefully they will spread the information to their peers. Plus, organizing course in universities is a traditional way, simple but effective. ", "q0r": 5, "q1": "The proposal includes detail plan with actionable steps. The project is quite simple and familiar with university student so he might handle it well with preparation and support from Catatlyst (He just need some money to start!). The budget also be explained well. There is only a risk that his ability is not good enough to organize such event but I assume optimistically that it's a small risk.", "q1r": 4, "q2": "The KPIs is clear with quantity numbers for each goal. I'm looking forward to these young people to join the community and their attribute afterward.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "ビジネススクールに通うラテンアメリカの学生を対象とした、触媒に関するコースを作る", "experience": "ビジネススクール生\nラテンアメリカ（アルゼンチン、メキシコ）出身者\nスペイン語を話す人"}