{"id": 384208, "author": "matiaswepfer", "title": "Building a relevant community", "url": "https://cardano.ideascale.com/a/dtd/384208-48088", "category": 26242, "amount": 50000, "description": "ラテンアメリカの不動産民間部門でのカルダノの採用が少ないこと。", "funded": 0, "upvotes": 15215765, "downvotes": 23593271, "votes_result": 8377506, "votes_cast": 120, "f6_no_assessments": 5, "f6_rating": 1.5333333333333332, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案のチームは、ラテンアメリカの不動産分野でカルダノの導入が少ないという問題を解決することを目的としています。要するに、はい、賛成です。しかし、同じ文言が他の多くのセクターにも言えるので、非常に一般的な説明に思えます。この問題を解決するために、LLCとDAOの設立を通じて、民間部門でのカルダノの採用を促進するためのコミュニティを構築することを計画しています。ラテンアメリカの不動産業界でも、カルダノに対する欲求と情熱を持った人たちのコミュニティが形成されれば、大きな可能性が開けてくるのだが。残念ながら、導入によって期待される効果については言及されていない。彼らが言及しているのは「成功指標」であり、それはむしろ実装のマイルストーンである。フィードバックとして、チームは提案書に記載されたビジネスプランを添付ファイルとして提出することをお勧めします。そうすれば、提案内容が改善され、資金獲得の可能性も高まるでしょう。\r\n", "q0r": 2, "q1": "この提案を成功させるためには、チームは様々なスキルや経験を含んだプロフィールを集めるべきだと考えています。これには、DAOの設立と管理に関する専門知識やブロックチェーンの知識、不動産、法律、マーケティングなどが含まれます。残念ながら、提案書に記載された経験を確認するためのリンクや文書は提供されませんでした。予算の説明や内訳がなければ、その妥当性を評価することはできません。今後のCatalystサイクルでは、チームのスキルと経験についての詳細な説明を含めるよう、チームに勧めます。さらに、提案書に記載されたスキルを証明するものを提出することをお勧めします。同様に、予算についても詳細な項目別の説明を行うことが必須です。\r\n", "q1r": 2, "q2": "提案者は、今後4ヶ月の間に、ラテンアメリカの5つの国で広告を出し、すでにそこにいるアーティストを訪問していると述べている。提案者が達成しようとしているインパクトが明確でないため、このような最初のマイルストーンが妥当かどうかを評価することは困難です。この3つのマイルストーンは、成功指標というよりは、マイルストーンに近いものだと私は考えていますので、あまり監査には向いていないと思います。期待されるインパクトと実施のマイルストーンが明確になった後、今後のカタリストサイクルのチームは、「ステップ」がどのように完了したかだけでなく、実施中の提案がコミュニティにどのようなインパクトを与えているかについても、コミュニティへの報告体制を設けることもお勧めします。\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 22, "ne": 12, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "問題を解決するためには、何が必要なのか、どの程度のインパクトが必要なのかを明確にしていません。\r\n\r\nRealtokers」というコミュニティを作ると言っていますが、そのコミュニティでは何をするのか、どうやって新しいメンバーを集めるのか、そこではどのような活動が展開されるのか、そして最も重要なことは、プロジェクトのトークン化がどのように行われるのかについて言及することができます。\r\n\r\nまた、最終成果物に記載されている用語も、より詳細なものにすることができます。例えば、\"Build business relations to strengthen Cardano's adoption for your businesses. \"と書かれていますが、提案者にとって、どのような関係が \"streghned business relationship \"とみなされるのか疑問です。また、どうやってそこにたどり着くのか、きちんとした計画が書かれているべきです。\r\n\r\n提案者は、その影響を少しでも定量化してみてはどうだろうか。何人の人がこのコミュニティに参加すべきか、何件のプロジェクトがトークン化されるべきか、などですね。\r\n\r\nさらに提案としては、民間企業をプロジェクトに呼び込むためのコミュニケーションプランや、トークン化されたプロジェクトを宣伝するためのコミュニケーションプランの詳細を追加することです。これは、このようなプロジェクトでは不可欠な要素です。\r\n", "q0r": 1, "q1": "ここで述べられているチームでの経験はあまりにも漠然としているので、チーム全体とそこに参加している個人の両方について、履歴書と、場合によっては彼らの能力を確認するためのリンクや方法を含めて、もっと詳細な情報が必要です。\r\n\r\n2021年第1四半期にビジネスプランを提出したとありますが、提案書には何のプランも記載されていません。提案書の最後に記載されている目標をチームがどのように達成するのか、計画と実行の段階に分けて、時間軸に沿ったスケジュールが記載されているはずです。\r\n\r\n高レベルの予算内訳がありますが、もっと詳細な情報を提供することもできます。予算は旅行にのみ割り当てられるので、旅行がどのように実施されるのか、何日、何回の会議、誰に会うのか、お金はチケット、食事、交通費にどのように分けられるのか、これらの旅行には何人が参加するのか、などについて言及することができます。そうすれば、その数字の根拠を理解することができ、その公平性や妥当性を確認することができます。", "q1r": 1, "q2": "最終的な3つの成果物はあるが、目標値や中間的なマイルストーンを示すメトリクスはない。例えば、最終的に何社の企業を巻き込んだのか、などの指標があってもいいのではないでしょうか。\r\n\r\nまた、これらの最終成果物については、より詳細な説明や、より明確な評価方法を提示することができます。例えば、「プロジェクトをラタム全域に広める」というのは少し主観的で、様々な解釈が可能です。具体的には、「4つのソーシャル・メディアで共有されるマーケティング・キャンペーンを少なくとも2回実施する」「選ばれた上位3名のインフルエンサーに報酬を支払い、彼らのインスタグラムでプロジェクトを共有してもらう」「X人にリーチする」「少なくとも4つの異なる企業とのミーティングでプロジェクトを発表する」などが考えられます。", "q2r": 2, "assessor": "z_assessor_298", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The issue being low adoption of Cardano ecosystem in LATAM's real estate sector. According the proposal the proposer will be building a community to improve adoption of blockchain and cardano but they haven't provided how it will be impacting and helping cardano ecosystem and also they haven't presented a plan on how they will be helping to increase adoption of ADA. Hence this proposal doesn't addresses the problem successfully", "q0r": 2, "q1": "The proposer has given a rough details regarding their experience in this field and it would have been helpful if they had provided details about their past projects.\r\nThe plan provided doesn't clearly explains how proposal will be implemented and The proposer has created another separate proposal with name \"Latin American artists\"\r\nThe context of both these proposal are kind of similar.\r\nUpon visiting their realtok.io website there wasn't anything about how the token works or how it will be helpful to grow cardano ecosystem\r\nBased on all these information it is very highly unlikely this proposal will be executed successfully", "q1r": 1, "q2": "The proposer hasn't provided a detailed plan on how this proposal will be implement and They haven't given any step by step roadmap to executed the proposal. It would have been very helpful if they had provided a complete timeline and a detailed fund breakdown to audit the progress of proposal due to these lack of information it would be hard to track the development and success of the proposal.", "q2r": 1, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "Building  a cardano  business community for real estate sector is great Idea and will increase the growth of the ecosystem if implemented well. while the proposal addresses the challenge but there is limited information how the community will be build- Apart from Travelling to other country.", "q0r": 1, "q1": "The Proposer seem to have great experience in the real estate sector but there is no identifiable information to ascertain his claims. I would suggest the proposers should build a Team and provide the relevant experience for the Project for next funding .", "q1r": 1, "q2": "The budget requested is for  per country to visit - flight tickets, stays, mobility and expenses for meetings.\r\nThe budget does not include how the business community will be form and sustain ..\r\nThe proposer should seek the help of a proposer mentor and come back n the next fund with something tangible ", "q2r": 1, "assessor": "z_assessor_430", "no_vca": 20, "ne": 0, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "The goal of this proposal is to increase Cardano's acceptance in the private real estate sector in Latin America. As it is presented, I completely agree with the proposed solution. The problem description matches the challenge, but the incomplete content design makes it difficult for the audit community.", "q0r": 4, "q1": "I find the plan difficult to measure on a practical level because the project is simply too large to measure in terms of metrics that can be achieved in a short time frame. The plan is described in general terms without providing enough information for me to believe the proposal is viable. In addition, there are additional proposals for further development in 5 countries, which are those? As a consultant, I recommend presenting your plan with more specific, clear items like who to include, what experience they have, and how your roadmap will perform. , the proposed KPIs will have to be achieved.\r\nPlease provide more information and proof of your experience. The more people know about the mind behind the project, the easier it is to trust.\r\nTo increase the probability of success of this proposal. It would be better if the proponent had a list of potential future risks and challenges.", "q1r": 1, "q2": "To make this proposal took $50,000, the funding is quite general, so it is difficult to accept the proposal or not.\r\nSuggested testability is low, as it doesn't show roadmap along with development plan, detailed explanation of each step, milestones and deliverables of each part, progress and some ways to community evaluates the success of the proposal\r\nAlso, how can the community track progress? On which platforms will you share progress updates? I want the team to connect KPI milestones and KPI roadmaps with project spending, specific tasks and deliverables, and when they have to deliver.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "民間企業におけるブロックチェーンとカルダノの採用を動機付けるための関連コミュニティの構築。", "experience": "私たちは、Web 3、マーケティング、規制面での経験を持つ4つのラテンアメリカ企業のチームです。"}