{"id": 384331, "author": "heinz.gassner", "title": "Onboard Latin-American Industry!", "url": "https://cardano.ideascale.com/a/dtd/384331-48088", "category": 26242, "amount": 7500, "description": "ラテンアメリカの業界でカルダノのビジネスチャンスを拡大するには、地域の理解と現地チームの高い能力が必要です。", "funded": 2, "upvotes": 77596280, "downvotes": 2228159, "votes_result": 75368121, "votes_cast": 216, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020", "https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}, {"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "この提案は非常に興味深く、課題の目的によく合致していると思います。ラテンアメリカでのカルダノに関わる様々なプロジェクトの機会と目的を分析するというものです。チームが大陸出身者で構成されているのは、現地の問題への理解を深める上で好ましいことです。また、製造業に特化したチームであることは良いことですが、それ以外のビジネスにも自信を持って取り組めるようになれば、より良いと思います。彼らはそのための十分な技術的訓練を受けているのだろうか？要するに、著者は、私たちのブロックチェーンを含むプロジェクトのコンサルタントのようなことをして、それは確かに大陸にも利益をもたらすでしょうし、いくつかのプロジェクトはよりよく実施され、その起業家と領土の両方に利益をもたらすでしょう。しかし、著者がどのような場所で活動しようとしているのか、ラテンアメリカのどの国なのか、もう少し具体的に説明していただきたいと思います。これらの問題やその他の問題は、最もよく説明されていますが、一般的には、インパクトがあり、課題によく対処していると思われる提案です。", "q0r": 5, "q1": "チームは、主要な活動や潜在的な顧客など、プロジェクトに関する多くの情報を提供してくれます。これにより、何がどのように行われるのか、何の目的で行われるのかを間接的に理解することができます。しかし、説明がかなり専門的で、業界外の人にとってはあまり理解しやすいものではないと感じました。直線的なタイムテーブルが描かれているのは好感が持てます。つまり、このようなことが起こるのかというステップバイステップのガイドです。全体をフェーズに分けて整理しているが、それぞれのフェーズについてはあまり詳しく説明していない。チームに関しては、彼らは非常に有能で準備万端のように見えます。それぞれの名前と主な役割、そして彼らをより詳しく知ることができるリンク先のプロフィールもあります。しかし、彼らの中にカルダノとの直接的な関係を主張する人がいないのが少し気になります。彼らはどのようにして私たちのブロックチェーンに関わったのでしょうか、あなたの経験は？彼らはf6で資金提供を受けた提案をしていると言っていますが、これまでに行われたことを正確に理解するために、そのリンクがあればいいと思います。また、財務の内訳に関しては、すべてが適切に行われていると思います。要求された金額が一部に分割され、それぞれが詳細に記載されているので、7,500ドルの資金調達の必要性をよく理解することができました。私が提案できることは、スクリプトをもう少し詳しく書くことと、チームとカルダノのエコシステムとの関係を明確にすることだと思います。", "q1r": 4, "q2": "このチームは、プロジェクトの監査可能性を含む多くの正確な情報を提供することを非常に重視していると思います。1月から3月／4月から6月の間で時間を分け、それぞれに4つのKPIを与えています。このようにして、提案の成功をモニターできる客観的なデータを得ることができました。また、提案書の最初の部分で、何をどのように行うのか、顧客についてなどを非常に豊富に提示し、毎月どのような活動を行うのかを明記したスクリプトも用意されているので、結果だけではなく、プロセスも分析することができます。今回の提案の場合、チームとカルダノコミュニティの一部のメンバーとのミーティングを予定し、直接接触することで、各部分の進捗状況とその後の結果を把握することができれば、より興味深いものになると考えています。そう思うのは、このプロジェクトが単に定量的な結果を出すだけのものではないからです。定性的な分析でもあるのです。いずれにしても、チームは監査可能性の問題によく取り組んでいると感じましたし、この提案のプロセスや結果を安全にモニターすることは可能です。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 12, "ng": 4, "nfo": 2, "vca_o": 2}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal clearly identifies a problem within the challenge; the existance of different risks and opportunities in each part of the world that also exist for Latin America and the neccessity to properly analyzing them first before just jumping into them with a one-size-fits-all solution. Working together with locals in order to assess the local situations and structures seems like a really smart approach to this that will both add value to the Cardano ecosystem and bring benefits to the local population..\r\nThe key metrics and goals of the proposal align with the outlined challenge settings very well, and have a lot of potential for self-empowerment and organisation.\r\nTaking a look at the makeup of the proposal,  I am positive the proposal will help a lot towards scalability.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The given problem statement is defined and involves most aspects of the challenge. The proposal addresses the issue of developing Cardano's business opportunities in the Latin American industry in a positive way", "q0r": 4, "q1": "The proposed group consists of 3 members, whose profiles can be easily viewed based on what the article is about. This team is definitely strong and capable of making recommendations, as they are very active in the community i.e. they understand a lot about the Cardano ecosystem and especially about Catalyst projects\r\nAnd since the delivery is clearly defined in the proposal, the feasibility of the project is guaranteed. From what can be read in the proposal, the proposal has invested considerable time and effort in this project demonstrating confidence and dedication, using", "q1r": 4, "q2": "In addition, the stages of the proposal are clearly outlined, giving the community a clear understanding of how and when a certain milestone is reached. As shown, the feasibility is very high, as it shows the roadmap along with the development plan, detailed step-by-step explanations, milestones and partial deliverables, progress and some a way for the community to quantify the success of a proposal. The provided KPI data can easily be served to test and monitor the process in promises. Budget is clearly defined, concise, reasonable cost.\r\nFor these reasons, I believe the auditability of the proposal is perfect, there is no point to criticize, just praise.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 19, "ne": 4, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I believe this proposal makes a strong case on how to gro Cardano In Latam. Reaching out to local industry definely would expand the demand side of growth and incentivize developers to join the community. Having good visible examples of successful use cases is the single most powerful force for adoption. Also the proposal is well structured and addresses key execution issues.", "q0r": 5, "q1": "The execution plan is well structured and detailed, also some team members seem to have extensive experience reaching out to industrial players and asessing regulatory environments in their geographies (Europe) in addition they have a previous proposal that was succesfully funded (Fund 6, still delivery is underway) on the downside local Latinamerican insight seems to be limited as the only local team member is still young and brazilian (which would leave outside the scope most latin american countries that are spanish speaking) Another flag that I saw is that the team seems to be small and they have 15 active proposals so I see success in risk by the team having too much on the plate.\r\nThe plan, budget and KPI's seem reasonable.", "q1r": 3, "q2": "The proposal provides clear deliverables and KPI's that can be checked by the community.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is very well documented. I would like to see an example of something tangible that the voter could use to contextualize the value you are bringing. Possible example of a scenario that would benefit from your research. ", "q0r": 4, "q1": "This outline provide clear measurable goals. The monetary requests are reasonable and our balance appropriately with the students on staff. I believe having staff members engaged in the education system is a very savvy way to evaluate the direct generation which will engage heavily in many sectors of the manufacturing-industry of Latin America. ", "q1r": 5, "q2": "There is a very clear checkpoint to audit the effectiveness of this program. I would suggest a discord, or other public server that would help engage the community and provide a window to your progress. ", "q2r": 4, "assessor": "z_assessor_970", "no_vca": 23, "ne": 2, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "我々のチームの製造業のコンピタンスを活用して、機会と関連するハードルを徹底的に分析します。", "experience": "30年以上の業界リーダーとしての経験と、ラテンアメリカのチーム、そして業界エキスパートのネットワークへの直接アクセス。"}