{"id": 384595, "author": "linconvidal", "title": "CardanoRio 2022: Hybrid event", "url": "https://cardano.ideascale.com/a/dtd/384595-48088", "category": 26242, "amount": 17501, "description": "ブラジルでは、ブロックチェーンのイベント（特にCardano）が不足しており、COVID-19のパンデミックの際にはさらにその傾向が強まりました。", "funded": 2, "upvotes": 68967750, "downvotes": 2501187, "votes_result": 66466563, "votes_cast": 221, "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Very well structured proposal and with meaninful impact! Rio is the 4th largest city in Latin America and has several other attractions that could increase the potential impact of this proposal.\r\nAs covid diminishes, face to face events become important again to strenght the bond in the community and having also the event broadcasted online broadens its reach in Brazil (as I believe this event will be in portuguese).\r\n\r\nI also appreeciate that the main strucutre is already defined - Though it would be nice to have some sense on the content that is being tought here.\r\n\r\nIf this project is a success, it can be implemented in other cities of Brazil or LATAM by local community, with already the lessons learned in this proposal.\r\n\r\nThe only thing I missed here was the communucation strategy. How does the proposer intend to reach people outside community (or even within it)? This is key for a project like to succeed and have the desired attendes.\r\nAs suggestions, I'd start with social medias but communicate also in universities and courses .\r\n", "q0r": 4, "q1": "There are 2 people already committed which seems enough to organize such event. Both have a list of qualifications and experience and links to linkedin to verify the info.\r\n\r\nThe plan is solid and time-framed, contemplating the whole development/implementation phase (only missing the communication part)\r\n\r\nBudget breakdown is very clear and detailed and not very expensive.", "q1r": 5, "q2": "It is mentioned here a clear definition of success, separated in key milestones. there are also good kpis with target.\r\n\r\nThe project is easily auditable", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1, "reply": "I agree with the comment about communication strategy. I thank you very much for the feedback and I think this was really missing in our proposal, as it is an important part of the project that we should not have underestimated. Thank you very much for the positive comment, for believing in the proposal and I promise we will do our best to make CardanoRio happen. And it would be incredible if this event could be implemented in other cities in Latin America. Post Covid I think the whole world is missing the opportunity to interact with new people and see new places and this would be an incredible opportunity."}, {"q0": "Adoption is a game of first impressions and the team behind this proposal aims to increase Brazilian adoption through an impression formed by a locally hosted cardano themed carnival. A first impression can dramatically effect adoption and user loyalty to the Cardano ecosystem. Although the proposal definitely meets the challenge goals, the funding is for a single event that could produce a surge of new users, but would not provide steady continuous stream of new users to the cardano ecosystem. The proposal requests a relatively small amount and promises to deliver significantly more value for the community. ", "q0r": 4, "q1": "Nearly every aspect of the proposal is a very detailed breakdown of the plans needed to successfully host the event. The budget, timeline, events, and experience of the proposal speaks to how prepared the team is to ensure the event is a success. There is no doubt that the team behind the proposal has the relevant technical skills necessary to implement the proposal successfully and will ensure that the event brings new users into the Cardano ecosystem. ", "q1r": 5, "q2": "It is important to see that the members of the proposal clearly identify the key members of their team and provided unambiguous KPIs for measuring the success of the event. It is clear that the transparency and clarity is important for the team. Although the team behind the proposal provided a very detailed breakdown of the requirements and goals of the event, which the community can use to audit the event, it is difficult to audit the success and failures of the project due to the in-person nature of a social event. ", "q2r": 4, "assessor": "z_assessor_338", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about organizing a hybrid event for promoting and discussing Brazilian projects related to Cardano and connecting the community in Brazil. The problem is clearly described and explained in detail.\r\nSolution is clearly defined, fit to the challenge that shows the clear impact to the ecosystem in short term and long term.\r\nTherefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "EveryBlock Studio (EBS) team is clearly described and shows a suitable ability for implementation. There is a lack of information that show similar activities/demo/pilot done by this team (can not be found through this link (https://everyblockstudio.notion.site/). The structure of each day of the event is explained clearly in detail. The roadmap, KPIs, and Definition of success are described in detail and very specific.\r\nThe requested budget is clearly defined with items structure and explanations of calculation base. Risk is not provided, organizing this kind of offline event may face potential risks of lockdown/pandemic, for example. So, the team should be prepared (with mitigation).\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "There is a lot of information provided, including: (1) clear information of team and proposer; (2) clear roadmap and KPIs; (3) budget breakdown. However, there is a lack of: (1) Risks and mitigation, (2) information of event organized by this team.\r\nTherefore, based on the given information, I  agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1, "reply": "\"(1) Risks and mitigation, (2) information of event organized by this team\" we didn't actually put risks and mitigation and that was a mistake so thanks for letting us know. However we did put links to events we have organized (2 members of the team organized it separately, the team as a whole has never organized anything, this will be the first time, but based on previous experiences we think it will be fine). Because the event is hybrid we believe that if we can't do the physical event, we will have a structure ready to do a fully online event."}, {"q0": "This proposal sets out a clear problem and well linked with the demands of the challenge in the sense that its solution aims to promote the Cardano ecosystem locally and connect its users in Latin America, especially Brazilians. The fact that this event can be broadcast and accessible free of charge online is an advantage that can benefit all those concerned in the Community. This small detail is also appreciable \"all the surplus money will be donated to a local charity.\" Unless I am mistaken, there is no section which clearly and explicitly states the benefits of this proposal for Catlyst in particular, but the benefits for the Latin community and specifically for the Brezilens are clearly explained and allow us to conclude also the positive consequences on the whole ecosystem. What moreover is supported by the precise detailed indices of the KPIs which coincide well with those of the challenge.", "q0r": 5, "q1": "All the informations concerning the participants are really well detailed and supported by links and allows to give a good idea on their skills in relation to the needs of the project, but also a link is provided to access their former proposals within the community. , which is a plus. The budget is clear, it appears coherent and realistic, and well detailed, which allows a fairly precise understanding of how it will be used. The entire plan is precise with a realistic timetable, as is the organization of the event. All these explanations together with a clear introduction and references provided at the end make it possible to concretely imagine the potential of this proposal to be successfully realized. ", "q1r": 5, "q2": " \r\nThe roadmap, and the plan are clear and in line with the KPIs which are quantifiable, make sense and clearly identifiable for the community. The time values ​​given in the plan are realistic. The general transparency of this proposal as well as its nature in itself contains the necessary elements so that the community can follow its progress and even attend the event for those who wish it. The creation of a site dedicated to this event will also allow the communication of this project as well as their network already set up, like the telegram group.\r\n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "カルダノに関連するブラジルのプロジェクトを促進し、議論し、ブラジルのコミュニティをつなぐためのハイブリッドイベントです。", "experience": "私たちのチームは、中規模のイベントを開催した経験があります。イベントの実行とプロモーションのために、地元の優れたネットワークを持っています。"}