{"id": 381361, "author": "fhilip.k", "title": "ADA Holder Engagement Survey - AIM", "url": "https://cardano.ideascale.com/a/dtd/381361-48088", "category": 26248, "amount": 50000, "description": "Catalyst a besoin d'une large base mondiale d'électeurs engagés pour que l'expérience de gouvernance décentralisée réussisse.", "funded": 1, "upvotes": 38118072, "downvotes": 23054346, "votes_result": 15063726, "votes_cast": 131, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition aborde toute une série de problèmes et de domaines de développement, tant au sein de la communauté Catalyst que de l'écosystème Cardano dans son ensemble. En se connectant et en recueillant les commentaires des votants, des FS, des votants potentiels et en impliquant les influenceurs dans le processus, Catalyst recevrait une quantité incroyable d'informations précieuses. D'autant plus que Voltaire est en préparation. La proposition présente un énoncé clair du problème, et la solution consistant à obtenir des informations d'un grand nombre de votants ADA est tout à fait conforme. Considérant que cette proposition pourrait être bénéfique à tant de niveaux différents dans le développement de l'écosystème Cardano (adoption, implication des électeurs et décentralisation), je pense que c'est une très bonne utilisation des fonds distribués. Je suis tout à fait d'accord pour dire que cette proposition relève efficacement le défi.", "q0r": 5, "q1": "L'équipe principale est composée de certaines des personnes les plus connues impliquées dans Catalyst, et les preuves nécessaires de leur expertise et de leur expérience sont présentées en détail. Le simple fait que l'AIM ait fourni à la communauté Catalyst des ressources inestimables telles que les outils CA et voter est une preuve irréfutable de l'engagement et des compétences de l'équipe, ainsi que d'une forte détermination à développer l'ensemble du mécanisme de Catalyst. Le fait que plusieurs propositions aient été financées par des fonds précédents renforce également la crédibilité et les compétences de l'équipe. La proposition contient un plan très détaillé, il y a même une section \"prologue\" expliquant le contexte et le raisonnement derrière sa création, ce qui est assez rare d'après mon expérience en tant que conseiller communautaire. L'allocation budgétaire est quelque peu substantielle, demandant 25 % du budget total du défi, mais compte tenu de l'ampleur de la sensibilisation et de l'impact possible que la proposition vise à atteindre, je dirais que ce montant est presque trop faible. D'autant plus que près de la moitié des fonds demandés seront distribués aux participants de l'enquête, à la communauté. La proposition présente un calendrier assez réaliste d'environ 5 mois, ce qui peut être un peu ambitieux si l'on considère qu'une grande partie du processus implique un très grand nombre de personnes de différents domaines. Grâce à l'aide du réseau, des influenceurs et de l'expérience de l'équipe, la proposition semble tout à fait réalisable malgré son calendrier ambitieux. Je suis convaincu que cette proposition sera mise en œuvre avec succès.", "q1r": 5, "q2": "Une feuille de route avec des livrables, des étapes et des calendriers clairs est fournie dans la proposition. Les indicateurs de réussite seront facilement mesurables en raison de la nature statistique de l'enquête, tout comme le processus d'analyse. À la lecture de la proposition, l'équipe vise à partager les résultats et le processus par le biais de mairies et de canaux hebdomadaires, où résident de nombreux membres de la communauté. Si la proposition est financée, cela pourrait également amener beaucoup de nouvelles personnes à assister à ces réunions publiques après avoir participé à l'enquête. J'aime beaucoup le fait que l'équipe présentera les résultats de l'enquête publiquement dans un premier temps, puis une autre fois, après avoir traité les données collectées par le biais d'une analyse statistique (et présenté ces résultats au public). D'après mon expérience de chercheur, cette façon de traiter et d'analyser les données et de les partager avec la communauté est une très bonne façon de travailler, et d'obtenir des résultats intéressants tout en restant en contact avec la communauté. L'utilisation du réseau (FS, influenceurs, électeurs, CA, assemblées publiques, etc.) est également un excellent moyen de tenir la communauté informée (ou de présenter) des personnes à Catalyst. L'équipe montre une profonde compréhension des défis potentiels en ayant une perspective sur le développement passé, présent et futur de l'écosystème. Dans l'ensemble, je suis convaincu que cette proposition me fournit suffisamment d'informations pour évaluer les progrès accomplis dans la réalisation des objectifs fixés.", "q2r": 5, "assessor": "z_assessor_349", "no_vca": 17, "ne": 13, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "La proposition vise à étendre une proposition du fonds 6 qui examine les données relatives aux électeurs telles que la participation, la sensibilisation et leur compréhension. L'équipe indique que 300 personnes ont fourni un retour d'information lors de la première phase de ce projet. Il n'est pas confirmé s'ils ont empêché plusieurs personnes de soumettre le même feedback si cela était incité, car il y a une raison pour que les gens le fassent. Il est difficile de dire si cette proposition aura un impact certain, car même si d'autres personnes partagent l'enquête, si l'incitation n'est que de 10 000 dollars, il y aura une limite au nombre de réponses qui pourront être obtenues. Si 1000 réponses sont obtenues, le coût sera de 50 $ par réponse et de 10 $ pour l'électeur. Pour que cette utilisation des fonds du Trésor public ait un impact, il faudrait que les questions posées et leur raison d'être soient bien détaillées et que le raisonnement soit étayé de manière à ce que l'on soit sûr que l'ensemble des données obtenues soit de grande valeur. L'obtention de plus de données sur les électeurs est sans aucun doute un domaine d'intérêt qui peut avoir un impact potentiel, ces efforts en valent donc la peine. Des ressources et des justifications supplémentaires sur les questions exactes de l'enquête et les données à collecter seraient utiles pour qu'un conseiller ait davantage confiance en l'impact potentiel.", "q0r": 3, "q1": "L'équipe est listée avec la plupart des membres incluant leur profil LinkedIn. L'équipe est fréquemment engagée dans la communauté Catalyst dans différents outils et parties du processus de gouvernance. Le budget est ventilé en quelques domaines clés. Il ne fait aucun doute que cette proposition est réalisable car il s'agit de mettre à jour l'enquête, de la partager et de mesurer les résultats. Les domaines clés de la faisabilité à remettre en question sont la qualité des questions et des données collectées. D'après ce qui a été fourni, il n'est pas clair si l'enquête a été divisée en tous les domaines d'intérêt potentiels et ensuite analysée pour leur utilité dans l'enquête. L'équipe déclare qu'elle cherchera à obtenir des conseils et des recommandations d'experts ayant une expérience professionnelle dans l'élaboration d'enquêtes de haute qualité. Il serait bon d'avoir plus d'informations sur les personnes qu'ils ont en tête pour cela, car cela peut vraiment déterminer la faisabilité de la proposition et sa bonne exécution. Il serait bon de voir un budget global plus faible pour cette proposition qui, une fois achevée, permet de mettre en évidence une structure d'enquête efficace et des réponses de qualité. Une fois que cela sera facile à confirmer dans la communauté, cela pourrait être intégré plus étroitement dans le processus de vote où il y aurait moins de friction dans l'obtention des réponses. Actuellement, la faisabilité d'obtenir des réponses à plus grande échelle est inconnue pour cette proposition et pose un risque modéré car l'équipe voudra obtenir suffisamment de réponses des électeurs pour justifier le coût.", "q1r": 3, "q2": "La proposition est bien structurée et très claire, ce qui est facilité par l'exemple précédent du fonds 6 qui donne le contexte. Certains indicateurs de succès sont fournis, mais ils semblent être plus des étapes d'achèvement qu'autre chose. En termes d'auditabilité, il serait bon de voir des indicateurs clés de performance plus spécifiques sur les domaines des données qu'ils analysent et qui montrent la valeur de l'enquête. Cela permettrait de s'assurer que l'équipe comprend parfaitement et peut articuler tous les différents éléments de données pertinents de l'enquête et ce qu'elle cherche à analyser. Les proposants mentionnent que les résultats et les données seront publics, ce qui permettra à la communauté de vérifier si cette approche doit être poursuivie à l'avenir.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal brings contributions for future improvements of the Cardano ecosystem. Depending on how well the survey is prepared (its design and questions' accuracy), good information will be brought by it. ", "q0r": 5, "q1": "The proposal is complex in terms of achieving its targets, however, the team has considered possible challenges and barriers to reaching a large number of participants in the survey.\r\nThe team has also provided to have enough knowledge about the Catalyst system and has conducted a smaller survey before. ", "q1r": 5, "q2": "The proposal is transparent and easy to audit. There's a concrete final product, although the milestones and roadmap when it comes to analyzing the results and being able to communicate them to the audience are a bit audacious. Normally it takes more than one month to process all data before being ready to provide insightful information to the external community. ", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about creating incentivized surveys to obtain info from a statistically significant number of voters and distribute this data to guide improvements. This is an interesting idea. The problem is clearly described, and explained in detail. The solution is clearly defined, fit to the challenge, and clear impact on the ecosystem in short term and long term. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is described enough for understanding, with suitable skill, experiences for implementation, with reference/proof (documents/links,...) for verifying, besides, this team has proposal funded in the prior fund. The requested budget structure is clear but without explanations of the calculation base. Risk is not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There are a lack of the following information: (1) Budget structure explanations of calculation base for each item; (2) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Créer des enquêtes incitatives pour obtenir des informations d'un nombre statistiquement significatif d'électeurs et distribuer ces données pour guider les améliorations.", "experience": "L'AIM a créé et entretient l'outil de vote, l'outil CA, l'outil vCA et la page d'accueil de la communauté. Développeurs, concepteurs, dirigeants et experts en données."}