{"id": 384832, "author": "andreas.kirchner", "title": "Staking for Children", "url": "https://cardano.ideascale.com/a/dtd/384832-48088", "category": 26248, "amount": 200000, "description": "Nous voulons que les familles jouent leur argent.\nLes familles perdent en moyenne 1000€ par an avec les comptes bancaires à faible taux d'intérêt.\nComment pouvons-nous les soutenir ?", "funded": 0, "upvotes": 19102750, "downvotes": 30037257, "votes_result": 10934507, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Il serait formidable de disposer d'un jouet fiable pour les enfants afin de leur apprendre à gérer un compte bancaire et à gagner de l'argent grâce aux tâches ménagères. Cette proposition présente un jouet pour les enfants et les familles qui peut être connecté à un compte bancaire et promouvoir l'éducation financière. Cependant, étant donné que l'équipe proposante prévoit d'utiliser des stablecoins pour leur jalonnement, l'équipe devrait inclure la manière dont elle prévoit de présenter Cardano aux enfants et aux familles dans son programme éducatif afin de le rendre plus pertinent pour la communauté et les électeurs.", "q0r": 4, "q1": "L'équipe dispose d'un site Web opérationnel qui témoigne de ses travaux antérieurs et rend la faisabilité de cette proposition très élevée. Cependant, certaines parties de la proposition ne sont pas tout à fait claires. La proposition demande la totalité du fonds de ce défi, ce qui signifierait qu'aucune autre proposition de ce défi ne recevrait de financement. L'équipe affirme qu'elle a créé un monopole pour \"apprendre à gagner\", ce qui est en fait un thème assez commun dans les communautés de crypto-monnaies et que je voudrais que l'équipe qui fait la proposition le sache. L'équipe elle-même n'a qu'un seul membre avec une expérience en crypto et elle mentionne des partenaires pédagogiques ainsi que des entreprises de jouets - mais elle ne donne aucune référence pour que nous puissions vérifier cela. Donc, si cette proposition porte essentiellement sur la crypto et l'éducation, l'expérience pertinente de l'équipe ne correspond pas tout à fait à un projet de cette envergure pour le moment. Le site Web lui-même présente un produit très agréable et intéressant, qui relie les informations des comptes bancaires en monnaie fiduciaire dans un outil numérique, ce qui semble génial. L'équipe qui propose le projet devrait préciser comment il vise à fournir des options de paiement et à connecter le jalonnement et les opérations bancaires avec des crypto-monnaies par le biais de comptes bancaires européens, car cela n'est pas encore courant. La chose la plus importante qui me manque dans cette proposition est \"les risques\". L'éducation financière est importante et si l'équipe vise les familles et les enfants, l'outil le plus important serait de nous faire savoir, en tant que communauté, qu'ils incluront les risques de payer avec des crypto-monnaies ainsi que d'investir avec des crypto-monnaies et des taxes sur les crypto-monnaies. En fait, je pense que ce projet serait vraiment génial s'il utilisait un outil permettant aux enfants de faire du paper trading ou tout autre moyen non réel d'apprendre à gérer un compte en crypto-monnaies et en DeFi. Pour le moment, le site Web semble se concentrer sur l'enseignement aux enfants de la gestion de la monnaie fiduciaire et je suppose que l'équipe souhaite inclure des informations sur les crypto-monnaies et les monnaies numériques. Ce qui est formidable, mais la proposition manque quelque peu de clarté et ne tient pas compte des risques pertinents qui devraient être pris en considération. La feuille de route fournie est très confuse et inclut des tours de financement supplémentaires ainsi que le crowdfunding.", "q1r": 3, "q2": "L'auditabilité n'est pas facile car il s'agit d'un grand projet avec beaucoup d'étapes et la feuille de route et la ventilation du budget sont confuses et incluent un financement supplémentaire qui n'est pas encore assuré. L'équipe n'a pas élaboré sur les risques de ce projet, si le financement n'est pas suffisant pour construire le produit envisagé. L'équipe n'a pas inclus d'évaluation des risques encourus par les familles et évidemment par les enfants lorsqu'ils paient et investissent en crypto-monnaie. Il est difficile de définir les étapes de la proposition, car il s'agit d'éducation, de création d'un pool de partenaires, d'intégration de nouvelles familles à cette marque, de développement et de production d'un vêtement avec lequel les enfants peuvent dépenser de l'argent, etc. Il s'agit également pour l'instant d'un projet en cours de développement qui se concentre sur la monnaie fiduciaire - l'équipe devrait fournir beaucoup plus d'informations sur la manière dont elle prévoit d'inclure et de différencier la monnaie fiduciaire et les crypto-monnaies.....", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "\"The idea of teaching kids to save money with cryptocurrency and using staking to get interest for the financial future of children in the family is a great one.\r\n\r\nBut when I read this proposal I see that the proposer who is looking for a 200,000ADA fund has exceeded the budget of this challenge. With the impact that the proposal brings is not too much, but it does not seem reasonable to need such a large amount of money\"", "q0r": 2, "q1": "\"I found the proposal to show the relevant experience of team members in a very general way and not specifically how many people the team has, what is the specific experience of each person.\r\n\r\nBesides, the proposer has not shown us a specific plan for what they will use the funds for, how many families and children they aim to help and how much money the children will save. How much is through the application of the proposal.\r\n\r\nPlus, their app is currently connecting with traditional banks. Proposal also hasn't laid out how to integrate Cardano's wallet into the app and how to encourage people to use crypto instead of fiat.\"", "q1r": 1, "q2": "\"Proposal does not have a specific plan for all that the proposer writes in the proposal. We have absolutely no idea what they used that money for and how to use it to achieve what results. Therefore, it is almost impossible to audit\r\n\r\nSo, i think proposer should have a specific plan with a specific target like: amount of money children will save in this platform.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Definitely a unique proposal for the Cardano blockchain. Teaching kids and giving them early adoption of financial education is a privilege as previous generations lack of incentives like this during their childhood. Moreover, the proposal fits into dApps & intergration, I think. The solution given is a good way to also teach children about the innovative prospect of the digital age towards finance and its values.", "q0r": 5, "q1": "I do believe the future of cryptocurrency will be the young pioneers of tech and given opportunities to the youths. The roadmap of the proposal is well delivered, and the website have already given confidence for voters for this proposal to move forward. Though, risks to be addressed, and management are not prepared, but the proposer have presented its detailed business model and sales strategy for this project.", "q1r": 4, "q2": "The proposal is complete and solid enough to understand what the vision is, along with the overview of how the finny app works from the video attached. Budget allocation is well planned and key metrics and milestones for the proposal are clear. Therefore, I think it does add value to the current diverse community of Cardano.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Cardano est PoS. Avec des pièces stables et des récompenses de jalonnement, offrons une incitation à économiser de l'argent. Laissez les familles avec enfants faire leurs premiers pas dans le DeFi.", "experience": "Nous sommes une start-up spécialisée dans l'éducation financière qui compte 3 000 utilisateurs.\nNous avons des partenaires pédagogiques pour développer une solution\n1 co-fondateur a un savoir-faire en Crypto"}