{"id": 382157, "author": "adagov.org", "title": "₳GOV: Funded Proposer Experience", "url": "https://cardano.ideascale.com/a/dtd/382157-48088", "category": 26253, "amount": 15000, "description": "プロポーザルや提案者の数が飛躍的に増加しているため、手作業で行っていたのでは、プロジェクトの監査はスケーラブルに行えません。", "funded": 1, "upvotes": 33451060, "downvotes": 13584858, "votes_result": 19866202, "votes_cast": 135, "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The aim of creating a platform for auditors and projects can increase the suitability.  A detailed plan is provided where an online social space is created for communication of funded proposers, and to provide an overview of the progress. This can speed up the audit and increase its clarity. The proposal is in accordance with the challenge and can be beneficial, yet, how do we motivate or enforce funded proposers to be part of it? (is it covered by the initiative of funded proposers that they can promote themselves?) Rating given 4.", "q0r": 4, "q1": "The proposers were funded during the previous funds, and the description of their area of expertise is provided, yet, I would love to see some links to check it out. A website which seems to be working is provided. A budget of 15 000 is asked, which is divided into three parts, seems reasonable. Rating given 4.", "q1r": 4, "q2": "They plan to launch the proposal after 8 months from the funding date, and their timeline is for 6 months. Key metrics are provided, which can be used for auditability of the proposal. All of these seem to be reasonable. Yet, a more detailed progression would be nice to have. Rating is given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is a great idea. You guys gave a pretty good presentation of the project brief. when implemented it can improve the process for yourself and for the community. I think that's what's missing. You just need to clarify the difference of today's market only.", "q0r": 4, "q1": "Given the experiences your claimed group (ADAGOV.ORG) has with projects funded in the last three funds, I assume you have experience with the current fund reporting and audit status. me think this project will work well. however, i think you still need to add documents and link each team member to the project better. more risks and difficulties of this idea in the future. Hopefully next time the team will do better.", "q1r": 3, "q2": "The proponent has given specific timelines and clear timelines. However, you still haven't received the specifics of what the specific proposed team members are. I recommend you Upload full group information and more specific links so that the community can appreciate the transparency of the project higher.", "q2r": 3, "assessor": "z_assessor_644", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The AGOV funded proposer experience comes at the right time with growing number of proposals making it very difficult to do the manual audits. By creating project space, each proposer can report project progress in one platform making it easier to audit many proposals in one go.", "q0r": 5, "q1": "The proposer's proposals have been funded 3 times in the past underlies his track record to deliver this platform successfully. The budget and timeline also look reasonable that the solution will be launched in 8 months.", "q1r": 5, "q2": "The proposal could have provided more KPI detail of what these 3 items mean: performance, achievement and financials. It will be interesting at the 6 months mark when the iohk hand over and that is when the community got to step up for a transparent revision of the process.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Create a project space that provides up-to-date Catalyst project information for easy inspection. The proponent clearly understands what needs to be done for the proposal. I think this proposal effectively addresses the challenge facing the developer ecosystem.", "q0r": 4, "q1": "I don't think there is enough information to judge the progress and success of the proposal. Creating such a platform is one thing, but running it successfully and profitably is another. It's a good idea but I feel the proposal needs further development to ensure successful implementation\r\nI doubt If the proposal will pass and here are my reasons: I see that the author claims to have relevant experience and has funded F4, F5, F6 sponsored, but I have a hard time getting it. blind trust raters, and that helps if the declarant has included some sort of credentials: internal links, company, some kind of project done.", "q1r": 2, "q2": "Amount of $15,000 requested but lack of detailed explanation of budget, your problems are general\r\n    The proposal is relatively clear in terms of the concepts it wants to deliver, it lacks some key details that allow for measuring progress and success.\r\nThere are some success data listed, but the good part of them is a bit vague in my opinion", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is about building a platform in which proposers can create a project space, provide project updates and manage and report project status socially. The problem statement is clear but not explained in detail. The proposed solution is clearly defined, addresses the challenge, may contribute to auditing the Catalyst's proposals. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "This team profile is briefly described, and through the provided link [https://www.adagov.org/], I can see this team's works and achievements. The team got a funded proposal in the prior fund [F4, F5, F6]. However, for better understanding, the team profile, as well as the member's profile, should be explained more in detail with reference/proof (documents/links,...) for verifying. The budget is not provided much information [only total budget and items structure of 03 items but without explanations of calculation base]. The timelines are described enough for understanding, with some metrics, but very abstract [Performance, Achievements, Financials], can not define if they are measurable and feasible or not. Besides, risks are not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information. However, there is a lack of: (1)AGOV Team profile with reference/proof (documents/links,...) for verifying. I can see that this team's ability, skills are very suitable to implement this proposal with some completed great works; so it would be more auditable if team profile, as well as accomplishments, are provided more in detail; (2) Budget: firstly, the budget structure of the 3 items [$2500 - PM and Project Communication Materials; $2500 - Subscription to Mighty Networks - allowing us to run a social network specifically for the Catalyst Community; $10000 - Hosting and service fees (video data and storage at extra cost)] should be clarified more in detail; and after that, providing explanations of calculation base for each item; (3) Risk/challenge (and mitigation/ management) analysis.\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 14, "ne": 4, "ng": 5, "nfo": 5, "vca_o": 1}], "solution": "提案者がプロジェクトスペースを作り、プロジェクトの最新情報を提供し、プロジェクトの状況をソーシャルに管理・報告できるプラットフォームを構築する。", "experience": "F4、F5、F6に資金提供。システムエンジニア1名、ソーシャルデザイナー1名、プロジェクトマネージャー1名で構成され、members.cardanocatalyst.ioを維持・運営しています。"}