{"id": 381055, "author": "mlabs", "title": "MLabs DTF (Dao-Traded-Fund)", "url": "https://cardano.ideascale.com/a/dtd/381055-48088", "category": 26233, "amount": 70400, "description": "Les solutions blockchain DeFi actuelles sont à haut risque, et certains investisseurs préfèrent une stratégie d'investissement moins volatile.", "funded": 2, "upvotes": 153644976, "downvotes": 9582829, "votes_result": 144062147, "votes_cast": 787, "f6_no_assessments": 13, "f6_rating": 4.487179487179487, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition porte sur une demande potentiellement très importante d'investissements passifs lorsque les actifs numériques seront plus répandus. Pour mettre l'impact en perspective, je suggère d'ajouter des références quantitatives telles que la taille actuelle du marché de l'investissement passif aux États-Unis, qui est d'environ 50 000 milliards de dollars US, soit 50 % de la capitalisation boursière totale des États-Unis. Disposer d'une solution passive et plus facile pour les personnes qui n'auraient pas le temps, l'intérêt ou l'expertise pour choisir elles-mêmes des jetons ou des monnaies afin de s'exposer à des actifs numériques est certainement utile pour soutenir l'adoption de l'écosystème DeFi et Cardano.\r\nJ'aimerais noter, en ce qui concerne l'énoncé du problème, qu'un seul véhicule d'investissement passif n'est pas nécessairement moins volatil que la volatilité moyenne du marché des crypto-monnaies au sens large. Un marché moins volatil est le résultat d'un ensemble d'investissements passifs à grande échelle et de capitaux institutionnels/à long terme (par exemple, les investissements passifs représentent 50 % de l'ensemble du marché des actions américaines). En outre, il n'existe pas encore d'indice défini pour le marché des crypto-monnaies (similaire au S&P 500 ou au Nasdaq du marché des actions). Je m'attends donc à voir plus de détails sur la manière dont les stratégies d'allocation d'actifs et d'équilibrage, ainsi que le profil risque/rendement cible, seront conçus pour les iDTFs. Mon métier est la gestion d'actifs et l'investissement en actions, et je serais plus qu'heureux de contribuer à l'équipe si le projet devait être mis en œuvre.", "q0r": 4, "q1": "MLabs a clairement une expérience significative dans l'écosystème, étant derrière certains des plus grands projets sur Cardano. Il serait encore plus utile pour la communauté d'évaluer la proposition si MLabs pouvait préciser et mettre en évidence l'expérience pertinente de la personne en charge de ce projet. Le budget et le calendrier proposés sont correctement répartis en blocs de travail détaillés.  Sur le plan de la faisabilité technique, la proposition explique certaines technologies et fonctionnalités de base pour la mise en œuvre. Sur le plan financier/opérationnel, je suggérerais au proposant d'inclure également plus de clarté, par exemple, quel algorithme sera utilisé pour la sélection de l'univers d'actifs et la pondération des actifs ; s'il sera optimisé pour une erreur de suivi minimale ou un ratio risque-rendement inférieur ; qui décidera des stratégies d'investissement et comment sélectionner cette personne. En outre, il serait également utile pour la communauté d'évaluer le projet de disposer d'un plan de haut niveau pour la période suivant la phase MVP.", "q1r": 4, "q2": "Le projet est vérifiable sur la base des fonctionnalités de base de l'iDFT. Mais j'aimerais voir quelques mesures pour définir le succès du MVP lors de son lancement, par exemple, l'objectif d'actifs sous gestion, ou la volatilité par rapport au marché plus large. Comme je l'ai mentionné dans la section Impact, je pense qu'une stratégie passive n'est pas nécessairement moins volatile que le marché au sens large, donc l'énoncé du problème doit être révisé. Une option à considérer est une stratégie passive pour permettre une large exposition aux cryptocurrences tout en économisant du temps et des efforts de diligence raisonnable pour les investisseurs.", "q2r": 4, "assessor": "z_assessor_684", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "La proposition suggère la mise en œuvre d'un fonds négocié par la DAO qui permet aux gens d'acheter un panier de différents jetons de projets axés sur des domaines spécifiques. Les ETFs sont un véhicule d'investissement populaire dans le paysage financier actuel qui permet aux gens d'investir dans des segments de marché plus larges et d'éviter de faire des choix individuels. L'introduction de ce type de produit dans Cardano, avec un écosystème DeFi en pleine croissance, pourrait avoir un impact important en permettant à une nouvelle gamme d'investisseurs de participer de manière simple en utilisant un fonds négocié par la DAO qu'ils peuvent préférer. L'auteur de la proposition détaille quelques raisons clés pour lesquelles cette approche peut présenter des avantages qui prouvent qu'il s'agit d'une solution valide pour résoudre un problème. Plus précisément, il cite la diversification, la réduction des coûts et les rendements à long terme. Le seul commentaire à donner ici est qu'un autre avantage clé que cette solution offre aux consommateurs finaux est le gain de temps. Au lieu de devoir trouver tous les DEX, comme dans l'exemple donné, puis de les acheter individuellement, l'investisseur peut simplement utiliser le fonds négocié DAO dans un délai beaucoup plus court. Pour certains investisseurs, cela serait vital s'ils veulent entrer et sortir plus facilement du marché ou de marchés spécifiques comme Cardano DeFi ou Cardano DEXs. Dans l'ensemble, il est clair qu'il existe une forte demande potentielle pour cette solution et qu'elle pourrait donc avoir un impact important sur l'écosystème.", "q0r": 5, "q1": "L'équipe à l'origine de cette proposition est MLabs, qui a travaillé avec IOG pour aider à exécuter certaines parties du protocole Cardano. En outre, ils travaillent également avec de nombreuses équipes de DeFi dans l'écosystème et les aident à exécuter leurs propres solutions. L'équipe de la proposition fournit un lien vers son dépôt Github, où vous pouvez voir une longue liste de contributions aux projets Haskell et à l'écosystème Cardano en particulier. Les principales parties de la proposition sont ventilées dans un budget avec le nombre d'heures requises pour chacune d'entre elles, ce qui donne le budget total final où le coût horaire est de 80 $. L'équipe dispose d'un grand nombre de preuves de son expertise et, avec un budget et une portée raisonnables, ce projet semble pouvoir être exécuté à un niveau élevé.", "q1r": 5, "q2": "L'équipe chargée de la proposition a défini un ensemble de caractéristiques ainsi que le budget nécessaire à leur réalisation. Un ensemble de points de critères de réussite sont ajoutés qui ressemblent à des points d'achèvement de jalons. Les indicateurs clés de performance du produit final ne sont pas ajoutés. L'équipe chargée de la proposition a fourni son dépôt Github, qui contient une grande quantité de code source ouvert. L'équipe n'a pas précisé si cette proposition serait open source et disponible pour la communauté. Il aurait été bon d'avoir des indicateurs clés de performance plus spécifiques concernant le type de fonds qu'ils pensent être produits et un plan open source pour donner une note complète à cette proposition.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Bonjour les votants ada ! Ce défi est \"Boosting Cardano's DeFi\" et cette proposition est alignée avec le défi pour la raison suivante. Defi est intrinsèquement toujours associé à un risque élevé, ce qui peut être dissuasif pour les utilisateurs embarqués. Cette proposition vise à atténuer certains des risques de Defi en créant des ETF où vous serez en mesure de vous exposer à plusieurs actifs au lieu de mettre tous vos \"œufs\" dans le même panier. Cela peut être utile car beaucoup de gens veulent profiter des avantages de cette nouvelle technologie tout en limitant le plus possible les risques. Les nouvelles technologies s'accompagnent également de nombreux projets susceptibles de ne pas fonctionner à long terme. En vous exposant à plusieurs projets dans Defi, vous pouvez vraiment profiter de la hausse sans vous surendetter dans un seul projet. J'ai vu la popularité de ce concept de \"crypto Etfs\" parmi d'autres chaînes, donc nous savons que si cela est bien fait, cela pourrait déclencher beaucoup d'adoption et aider à stimuler le Defi sur Cardano !", "q0r": 5, "q1": "MLABS est l'organisation derrière cette proposition, nous devrions donc commencer par là pour évaluer s'ils ont la capacité d'exécuter ! Il est encore tôt quand il s'agit de Defi sur Cardano, mais après avoir lu leurs références dans le plan présenté, je dois dire qu'il est très probable qu'ils seront en mesure de livrer. En effet, MLABS est expérimenté dans le développement de Defi et est une équipe bien connue au sein de la communauté cardano et catalyseur. Ils sont partenaires d'iog plutos et emploient plus de 65 développeurs pour aider à construire de futurs dapps Defi comme sundae swap (un dex) et liquid finance (une plateforme de prêt Defi) et bien d'autres. Cela nous montre qu'ils sont bien respectés et compétents. Nous pouvons également voir leur capacité à exécuter les premières étapes de cette proposition lorsque nous jetons un coup d'œil à leur plan de mise en œuvre. Par exemple, ils nous donnent des estimations claires et transparentes de la manière dont ils utiliseront les fonds, de la durée de la mise en œuvre et du nombre de ressources humaines dont ils auront besoin pour démarrer.", "q1r": 5, "q2": "En évaluant si cette proposition peut être auditée, ce qui m'a frappé, c'est qu'ils nous ont donné des estimations claires du temps que prendra la mise en œuvre de cette proposition. En tant qu'électeurs, nous disposons ainsi d'une date limite pour suivre l'évolution de la proposition. Je voudrais également encourager les électeurs à regarder la section des mesures clés lorsqu'il s'agit de vérifier l'avancement de la proposition. Ils ont reconnu que Defi on Cardano est encore jeune et qu'il est donc difficile de calculer des mesures comme le nombre d'utilisateurs actifs par jour ou la valeur totale bloquée, ce que j'apprécie puisque Defi on Cardano est encore à ses débuts et que nous n'avons pas de données pour évaluer ces mesures clés. Cependant, ils donnent une promesse compétitive de fournir ces mesures clés à mesure que l'espace évolue et que les données sont plus transparentes. Par exemple, en ce qui concerne la TVL, ils disent : \" Nous aurons la capacité de nous étendre pour gérer n'importe quelle charge \", ce qui signifie que la charge de TVL peut être gérée, quelle que soit sa quantité. Cela signifie que nous pouvons vérifier l'exactitude de cette déclaration en voyant si la dapp finie traite en toute sécurité les entrées de capitaux ou si elle ne le fait pas. pensées de clôture pour les votants ada - S'il y a une chose qui est importante pour Defi à ce stade dans l'opinion de beaucoup de gens, c'est la sécurité, donc je respecte le fait qu'ils ont planté un drapeau dans le sol quand il s'agit d'être en mesure de gérer n'importe quel montant de fonds qui viennent sur le produit fini de cette proposition. Comme le dit Michael Saylor, l'argent le plus fort attirera toujours la richesse. Donc, pour moi, cela signifie qu'un moyen sûr d'investir dans des crypto Etfs est le plus important pour bosting defi on cardano en ce moment. Mlabs a écrit une belle proposition pour lancer leur mvp (le dapp de cette proposition) et a promis dans la référence que j'ai indiqué sur la manipulation tvl pour le rendre sûr quelle que soit la charge du capital.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Proposal addresses the problem of users seeking alternatives to volatile markets. This project will ad value to the Cardano ecosystem by attracting new users to Defi on Cardano and connecting to other Defi projects. The key metrics are perfectly aligned with the Challenge as they are identical. This project is able to scale as it will be open source and has a governance system.", "q0r": 5, "q1": "Relevant skills and team is provided via github page. They have been actively working and contributing to many Defi projects in the Cardano ecosystem. The budget seems reasonable and is broken down into identifiable items that shows how many hours are allocated to each item and a total of 880 hours to complete the whole project seems doable. They explain in great detail what they want to build and what the core functions are, but they don't go into the technical details on how they will build this. Providing the reader with the technical details will show them your building process and boost confidence in your abilities. There are considered risks throughout the proposal, it would have been nice to view them all in one place, but at least they are there. They will address the risk of resources lost due to bugs, by submitting their work to the certification process at IOG.", "q1r": 4, "q2": "They provided a roadmap with milestones of different parts of project that gets completed. The milestones can be used as KPIs, but it would help to have user based KPIs and transaction KPIs. The more KPIs you provide the easier for the community to track the performance of your project. They address the problem of volatility in Defi markets being unattractive to some users. They solve this by offering stable alternatives to new and experienced users.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 25, "ne": 6, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "An outstanding idea for pooling investors into a decentralized trading fund focused on Cardano Native Assets.  This is likely to be a popular Dapp if successful since it provides an easier way to gain exposure to a complex marketplace. The plan includes development of automated processes for the vault, distribution of fees/discounts, and governance.", "q0r": 5, "q1": "MLabs is one of the stronger development teams in the Cardano ecosystem with experience with Haskell, Plutus, and Rust developers.  The project plan is broken down into 9 features and funding for changes. A minimum viable product is described for the core functions and deposit options. They have outlined a plan for MVP in 8 months and launch in 12 months.  They acknowledge that the scale of the launch is dependent on the pace of assets available to invest in over the next year. ", "q1r": 5, "q2": "MLABs provides an answer for each of the 12 requested metrics, though most of the answers are either TBD or vague.  Nevertheless, the core goal to facilitate the utilization of dapps on Cardano seems trackable. More importantly, the clarity of the project plan will provide a base upon which progress can be measured.", "q2r": 4, "assessor": "z_assessor_145", "no_vca": 24, "ne": 3, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge.  As someone who has already traded with ETFs, i also know how the fundamentals of them work and am able to assess whether this project makes sense. This proposal offers a good solution to some points of this challenge, like accessability to DeFi. A tokenized asset has the potential to offer DeFi accessibility even to people that don't have a lot of money. This will clearly add value to the Cardano ecosystem if it is done in a comprehensive manner and will support native tokens and DEXs.\r\nThe proposal has formulated metrics that align with the metrics of the challenge.\r\n In the way the project is planned, it should be perfectly able to scale with the growing cardano ecosystem. Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q0r": 5, "q1": "The proposers are very transparent about their background and seem competent and up to the task. They provide proof that they know coding and the different layers of Cardano. It is highly likely they are up to the challenge. The proposer has a realistic idea about the number of people and work hours that are required for such a task. The buget is well-defined, fine-grained and rationable. The different parts of the budget are realistic and clearly show where the money goes. While the hourly rate is a bit high it is comprehensible that a company has a bit higher costs to carry than single people that don't have any of the business costs. The proposers have set out a plan for the case that the project will take longer time and have higher costs. The timetable is realistic for a project of this scope. The plan of implementation is shown and seems realistic. Technical aspects are only explained superficially and could be more detailed to get a more in-depth view of what is going to be done. Challenges and risks to the project that might occur are not really discussed.  Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q1r": 5, "q2": " A detailed roadmap with milestones and a time horizon is presented. The targeted problem and the solution are explaind clearly and comprehensible. Hence, overall this proposal is audible.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This project will help to improve the development environment of DeFi, it will help to mitigate some of the risks associated with cryptocurrency investing as the proposer said in their solution brief. \r\nMoreover, the proposer also lists some important points that this project will impact to the Defi, therefore, impact the Cardano ecosystem. \r\nThe proposer also outlined very detail the project's success will be and described very detail the key metric they choose for this project, and all of them shows that met with the challenge settings. ", "q0r": 5, "q1": "The proposer explained clearly about their solution with samples and feature explanation, that can help anyone to assess their tasks in the \"What success look like\" part, that very details in months.\r\nMoreover, they have a page of budget breakdown that is very clear by work-hour, as if you have experience in dev, it's all reasonable and realistic. \r\nTherefore, I rate 5 for the feasibility. No more comment on it, they're made all perfect and I believe that they will do it right. ", "q1r": 5, "q2": "This proposal is driven by a very experienced team, they're IOG partners with over 65 Haskell developers working on some of the ecosystem's biggest projects - including SundaeSwap, Liqwid... \r\nMore than that, they made this proposal so perfect and clear that will help our community simple to audit the project on single tasks.\r\nThe proposer didn't have a part to show their relevant risks and how they face them, but in the detail of the proposal, I can see some challenges that they also have the plan for that. So I think this proposal is 100% auditable. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 15, "ne": 5, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Mlabs' proposal seeking to create pools of assets that help to mitigate some of the risks associated with cryptocurrency investing. Proposal mentioned importance of such funds like Ardana, CardsStarter, Player Mint etc. - for diversification, lower costs and Strong long term returns. Thus the challenge is effectively addressed.", "q0r": 4, "q1": "MLabs is IOG partner, has over 65 Haskell developers that developed Sundae Swap, Liqwid, etc. The proposal can be successfully implemented. The detailed plan mentioned multi-asset vault structure, tracker, re-balancing functionality, multi-asset dep functionality, The detailed plan will make implementation successful", "q1r": 4, "q2": "The road map structured into 1st , 3rd, 5th, 8th months and the expected launch date of 4th quarter 2022 will make auditing effective. The budget has a detailed breakdown to make auditing easier and effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The ability to create this kind of infrastructure for ETF-like investments is important and would represent an impactful addition to Cardano DeFi. One can argue about the usefulness of curated baskets and rebalancing that the average investor is unlikely to understand. However, it seems to be a worthwhile return on investment and good value for ADA holders.", "q0r": 4, "q1": "MLabs's track record and association with IOG make it highly likely that the project will be a success. This is a very impressive team and one of the largest pools of Plutus talent.", "q1r": 5, "q2": "The amount of detail presented both in the proposal and whitepaper is impressive. The technical detail and cost breakdown are not matched by sufficient performance metrics and it would be difficult to assess before completion if the project is succeeding or failing.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is feasible when creating valuable asset groups and minimizing the risk of high price fluctuations, suitable for investors who do not want large fluctuations. The project is open to everyone and suitable for the challenge. The proponent should add some similar and more prominent utilities than an ETF (for example, if I own a DTF, can I vote for separate projects in the fund? ", "q0r": 4, "q1": "Proposers that mention MLabs as an IOG partner should still add the identities, expertise of the participating members and should include detailed documentation on how/demo/specs/features/ will be apply. The proponent has provided a monthly and quarterly timeline that will perform some functions with an hourly cost, the estimated cost of 160h*80$ should provide more information or predict risk issues.", "q1r": 3, "q2": "The proponent provides a roadmap for the implementation of the functions, but has not yet seen the additional KPIs needed to measure. It is necessary to add the risks, difficulties and challenges of the project, especially the unknown resource portion, how many people and teams are involved.", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal as implemented will not deploy an open financial solution within six months, as indicated in the proposal. Additionally, may increase exposure to security risks given that defi projects associated with indexed assets are maintained separately and outside of the scope of this financial solution. Finally, the proposal as funded wouldn't negate the introduction of venture capital, and may actually make it an easier point of entry into Cardano defi solutions. \r\n\r\nWith that said, basket funds offers users more familiar vehicles that may offer a healthier balance for certain risk and investor profiles. ", "q0r": 4, "q1": "It's clear that the organization is already active in the Cardano space, and very aware and hands on with defi projects that have the potential to form a part of the basket(s). The fact that 60+ developers are already on the books means DD&I can ramp up very quickly. The main variable may be allowing the team time to assess the early evolution of defi projects that have the potential to be indexed over the course of 2022. ", "q1r": 5, "q2": "Good, high-level breakdown of quarterly project timelines and deliverables. ", "q2r": 5, "assessor": "z_assessor_716", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal alligns with the challege goals. Specifically it attempts to solve the problem of decentralized ETFs. This proposal also make it clear that the product will be very attractive for new comers to the ecosystem that want to minimize risks. Furthermore, the proposal includes many metrics like the type of tokens to be made into DTFs and so on. ", "q0r": 4, "q1": "The proposer presented a link to their GitHub account which seems to be very active and includes many Cardano-related projects. The projects are also segmented into steps and categories and into hours needed for each category. They also provide a realistic timetable that leads to an MVP and then to further added features.", "q1r": 5, "q2": "The project presents a clear roadmap with different incremented goals. A lot of milestones are also given divided into categories and monthly goals. Finally, the team seems to understand the problem at hand and has a clear idea about how to solve it.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The creation of a DAO ETF would significantly boost the early Cardano DeFi space with the ability for members to efficiently diversify their risk.", "q0r": 5, "q1": "The MLabs team are Plutus partners and have worked with IOG + multiple Cardano DeFi protocol's during their v1 development. The present a coherent timeline, budget and implementation plan in this proposal. The combination of their team, past project work and plan to implement this solution are all pointing to high chances of a successful proposal implementation. ", "q1r": 5, "q2": "This is one of the most complete/structured proposals in this challenge by one of the strongest Plutus development shops currently building in the Cardano DeFi ecosystem. ", "q2r": 5, "assessor": "z_assessor_769", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "MLabs DTF - Les ETF créent des pools d'actifs qui permettent d'atténuer certains des risques associés à l'investissement en crypto-monnaies.", "experience": "MLabs est un partenaire d'IOG. Nous avons plus de 65 développeurs Haskell qui travaillent sur certains des plus grands projets de l'écosystème - SundaeSwap, Liqwid, etc."}