{"id": 381939, "author": "tomwedler", "title": "Carbon as DeFi Asset | BlockCarbon", "url": "https://cardano.ideascale.com/a/dtd/381939-48088", "category": 26233, "amount": 30000, "description": "Les initiatives de compensation des émissions de carbone prolifèrent, mais elles ne reposent sur aucune norme cohérente, ce qui sème la confusion dans l'esprit des consommateurs et freine leur transformation en un actif investissable.", "funded": 2, "upvotes": 149786701, "downvotes": 13951975, "votes_result": 135834726, "votes_cast": 829, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=22904"], "media": [], "f6_assessments": [{"q0": "Bonjour les votants Ada ! Quand on me demande si ce défi est le bon défi pour cette proposition, je dois donner à cette proposition un 5 sur 5 ! Le défi est de stimuler Defi on Cardono et cette proposition va stimuler Defi on Cardona pour les raisons suivantes. La première raison est que les crédits carbone allant sur la chaîne et la tokenisation du marché du carbone sont de plus en plus demandés. Cela est dû à un manque de transparence sur les marchés traditionnels du carbone et à de nombreux investisseurs qui spéculent sur le fait que les crédits carbone émis par les entreprises d'énergie renouvelable et achetés par des entreprises qui omettent le carbone deviendront de plus en plus rares et précieux au fil du temps. En particulier avec les mandats gouvernementaux et la popularisation de l'augmentation du prix des crédits carbone pour rendre le carbone plus cher à acheter pour les entreprises qui omettent le carbone. Des flots de capitaux afflueront vers les premières propositions qui parviendront à mettre en chaîne les crédits carbone et le marché du carbone. C'est ce que nous constatons lorsque Mark Cubin déclare dans cet article https://www.yahoo.com/now/mark-cuban-buys-50-000-165355744.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAHUAOD2t7vn1ELZPZrhEdD2N2xuKp5LEybeqNLo7tmaZxGqdH6RmxCBRDoNVwnOm9w9uIC89fYk9B4nZ7gnmpVOVzkPDxsZ5wm7Qm96J1iq4P9SeSliB1xIoNlu2q-wcL3VJYDTT_cuXvEMYj-FZnkD3U9FMqfE7kh2xISeW7j7N qu'il va investir 50 000 euros tous les 10 jours dans une dapp polygonale qui prend les \"Verra vcu's 2008 vintage and above\" (crédits carbone certifiés) et vous permet de les acheter via le protocole toucan. Nous avons vu comment Cardano est dépeint comme une blockchain très verte, donc plus vite nous commencerons à mettre en œuvre des marchés de carbone onchain, plus vite nous verrons une augmentation de la défiance envers Cardano.", "q0r": 5, "q1": "A la question de savoir si le plan peut être exécuté, nous devons regarder si le plan est réalisable. A la question de savoir si le plan peut être exécuté, il faut examiner 1. qui est à l'origine du plan et 2. quel est le plan. Nous devons également nous demander 3. quels sont les risques qui échappent au contrôle de l'équipe. Je suis heureux de voir une richesse d'expériences diverses derrière l'équipe et j'encourage les électeurs d'Ada à regarder l'expérience de l'équipe, je vais donc copier et coller la biographie de chaque membre de l'équipe au bas de la partie de faisabilité de cette revue. Je vais donc copier et coller la biographie de chaque membre de l'équipe au bas de la partie faisabilité de cet examen. Pour moi, l'expérience de l'équipe parle d'elle-même dans cette proposition, avec des antécédents dans les domaines des plutos, de l'environnement, de la finance, de la gestion des risques, du marketing et de la cryptographie. Il n'y a pas beaucoup de trous dans l'équipe que je peux voir pour ce que cette proposition a indiqué qu'elle aura besoin afin d'exécuter avec les 30k qu'ils demandent. En plus de la compétence démontrée des membres de l'équipe, le plan lui-même commence petit mais offre des délais et des mesures ambitieux. Je crois que ces mesures sont ambitieuses parce que le défi Cardano n'a pas encore beaucoup de données, car le défi sur Cardano n'a pas encore été vu à l'échelle, sans parler du défi incluant les marchés du carbone. Je pense que le plan est bien défini et qu'ils ont donné de nombreux éléments réalisables qui démontrent comment cette proposition sera mise en œuvre et mise à l'échelle dans le temps. Je pense donc que la proposition répond aux normes de faisabilité si nous comptons sur le vent arrière de defi sur Cardano et les marchés de crédit carbone onchain qui gagnent en popularité ainsi que l'expérience des équipes. Ma seule autre préoccupation concernait les risques liés au marché cryptographique plus large et à la réglementation, mais je tiens à féliciter l'équipe d'avoir identifié ces risques dans sa proposition, car il n'est pas inutile de savoir que l'équipe a pris en compte ces risques hors de son contrôle et qu'elle a indiqué des moyens d'atténuer ces risques grâce à ses connexions et à ses futurs partenariats sur le marché du carbone et dans les espaces cryptographiques. Voici les bios de l'équipe comme promis.....\r\n\r\nThomas Wedler\r\nTrader et entrepreneur expérimenté dans le domaine des dérivés énergétiques. Ancien trader senior de Shell, Vattenfall et Masefield. Tom construit et déploie des programmes pour la tenue de marché automatisée et les dérivés énergétiques depuis 2014. 15 ans d'expérience dans les produits dérivés au sein d'organisations multinationales, travaillant en étroite collaboration avec les organismes de l'industrie et intervenant lors de conférences et d'ateliers sur le marché de l'énergie. Impliqué dans le trading de crypto depuis 2014 et dans les DeFi/oracles depuis 2018.\r\nhttps://www.linkedin.com/in/thomas-wedler-18960/\r\nJune Akra\r\nExpert des marchés financiers et universitaire avec une vaste expérience dans la gestion des risques, les produits dérivés et les matières premières. Expérience pour diverses fonctions de risque dans un fonds de 2 milliards de dollars AUM. Titulaire d'un master en investissement avec distinction et récompensé par le prix Draper. Ancien élève de l'école de finance quantitative certifiée (CQF) de Londres. Éditeur vidéo expérimenté, créateur de contenu avec plus de 50 000 adeptes sur les médias sociaux, collecteur et créateur de NFT et praticien certifié de l'IA en Python.\r\nhttps://www.linkedin.com/in/june-a-a3a0b4174\r\nStefan Herde\r\nPDG expérimenté du marché de l'énergie, consultant, expert en énergies renouvelables et en efficacité énergétique et ancien président d'une société américaine d'un milliard de dollars. Total de plus de 30 ans d'expérience dans le secteur de l'énergie.\r\nhttps://www.linkedin.com/in/stefan-herde-33058539/\r\nLloyd Duhon\r\nLloyd est le propriétaire/exploitant de la ferme urbaine Living Greens et un vétéran de l'informatique depuis 25 ans, avec une expérience de niveau CTO. Pionnier de Cardano Plutus, 2e cohorte. Expérimenté dans la direction d'équipes de développement et travaillant étroitement avec la Florida Gulf Coast University. Tom, June et Stefan ont rencontré Lloyd lors des étapes d'idéation et de raffinement de ProjectCatalyst et prévoient de collaborer avec son projet d'agriculture urbaine en partageant les ressources de développement.\r\nhttps://www.linkedin.com/in/lloyd-duhon/", "q1r": 5, "q2": "Lorsque l'on demande si la proposition peut être auditée et si l'équipe peut être tenue responsable, regardons si elle nous a donné des mesures clés et des délais de mise en œuvre. À cet égard, il semble que chaque étape du plan ait été assortie d'un calendrier et de mesures clés qui évoluent au fil des mois. Par exemple, le nombre de projets réels intégrés à cette proposition est indiqué ci-dessous : \" Nombre de projets réels (multiples de tonnes de carbone) intégrés : un après 2 mois, trois après 3 mois, six après 4 mois, 15 après 6 mois \", ce qui nous donne en temps réel un moyen de tenir l'équipe responsable de ces mesures. J'ajouterai des commentaires pour l'équipe comme suit. Par exemple, en ce qui concerne la présence sur les médias sociaux, vous indiquez : \"Suiveurs du projet BlockCarbon sur les médias sociaux : 1000 après 2 mois, 2000 après 3 mois, 5000 après 6 mois\" et d'un point de vue audit, c'est très bien, mais je pense que le nombre de followers sur les médias sociaux n'est pas une des meilleures mesures à viser, car ces chiffres peuvent être manipulés par des robots ou achetés. J'espère que ce retour d'information sera utile à l'équipe, car j'aimerais vraiment que cette proposition aboutisse, comme je l'ai dit. Je peux voir l'impact que peut avoir une proposition de marché du carbone pour Defi sur Cardano ! Je souhaite la meilleure des chances aux votants de l'ada et je vous remercie d'avoir pris en compte cette proposition et ce commentaire !", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "Proposal identifies the problem of onboarding existing financial operations into Defi on Cardano. The project will ad value to the  Cardano ecosystem by driving new users from existing financial markets to Cardano. Key metrics are inline with the challenge setting's as it focuses on growth and collaboration. The proposal is able to scale quite well as it will be open source.", "q0r": 5, "q1": "Relevant skills and team has been provided. I can't find any proof of Lloyd's Plutus skills. I couldn't find his profile on github. This might steer away some voters. It is important to prove the team's skills in order to gain trust from the community. The budget is reasonable and broken down into identifiable items. Some of the work they will do voluntarily. The time to complete the project seems reasonable, they will need additional funding after the 6 month period to build a marketplace. They explain in great detail how they will approach, educate and integrate with the existing Carbon financial markets. One part I would like to see more detail on is the educational content that they will create. Will it include token creation education etc. More detail on the content of that package would help the voter understand what the packaged product looks like. The  technical aspects of the  content created has not been explained as mentioned. They went into great detail describing potential risks and how they will mitigate them.", "q1r": 3, "q2": "They provided a clear roadmap with milestones and lots of KPIs that are measurable. Tracking the performance and progress of this project will be easy as there are a lot of user based KPIs. They address the problem of current Carbon offset initiatives that create more confusion than actual value to the user and to the  earth. They solve this by brining these initiatives to Defi in an open source way so the community can get creative and build new alternative ways to create more value for these initiatives.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1, "reply": "Dear Assessor, you wrote in your assessment of our proposal Carbon as a DeFi | BlockCarbon that you \"can't find any proof of Lloyd's Plutus skills\". This resulted in a relatively low score of 3 stars. We found this a bit harsh and wanted to reach out to you. As we cannot possibly document all skills and work experience of every team member, we hoped that assessors would either take our word for it, or research themselves. For your reference, Plutus pioneers 2nd Cohort will have their class photo in January, as it was delayed on the IOHK side. Lloyd did write an article to help others in the program here:  https://www.publish0x.com/plutus-pioneer-trail/trailblazing-plutus-on-cardano-xvyweyp\nLooking forward to your feedback. Thank you from the BlockCarbon Team\n"}, {"q0": "The proposal is very ambitious and could, if successful, have a huge positive impact on Cardano. Creation of a good on-chain carbon marketplace with defi capabilities would bring the world's attention to Cardano and establish it as a leader in sustainability and green blockchains. The proposal clearly falls within the DeFi spectrum, but falls just short of HOW exactly DeFi would be used to generate yield for carbon hodlers/generators. The proposal clearly builds up to it, though, and DeFi seems like a natural fit with the project, even if the exact mechanism is yet to be determined.", "q0r": 4, "q1": "The project is very ambitious, and it seems unlikely that the team as is could reach the goals mentioned. However, they have a clear and targeted vision, and mention using volunteers as a resource for their project. The plan is laid out clearly both for the duration of the project but also for the future steps. The team has good credentials on the carbon-credits side, but lacks on the technical blockchain side. This concern is addressed in the risks and challenges, however, and isn't cause for concern for now.", "q1r": 4, "q2": "Basically everything in the project is auditable and measurable, so success can be monitored easily. The milestones for this proposal are laid out clearly and can be verified, and the success metrics are measurable and verifiable.  The proposal identifies main risks and challenges, indicating that they know what they would need to work on next to keep their project afloat.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your feedback. We agree with your remarks on Impact and Feasibility. DeFi on Cardano is quite new and instead of promising high yielding features or building a huge team before the first initial successful pilots, we had to paint the roadmap in relatively broad strokes. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon Team"}, {"q0": "Your solution; Open Source library to enable pricing and exchange of Carbon as tokens and derivatives utilizing Plutus. Is exactly what this Challenge is all about. I Strongly Agree", "q0r": 5, "q1": "Your teams experience in Energy Derivatives, Financial Markets, Renewable Energy and Plutus Pioneer program makes for an excellent and Very Strong experience level. \r\nYour Budget breakdown and timeline is good and your willingness to donate time at zero cost all indicate the path to a successful project.  I Strongly Agree", "q1r": 5, "q2": "Your project's Roadmap, KPI's and Performance Metrics are sufficient to audit your progress and success.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 26, "ne": 1, "ng": 13, "nfo": 12, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon"}, {"q0": "The beauty of this proposal is the new knowlege gained just by reading it. It addresses the challenge from a unique perspective. Emmisions can be lowered with the use of blockchain and this proposal lays out a solid foundation for it to happen. ", "q0r": 5, "q1": "The team behind this proposal is very solid. They aren't anonymous and they have the credentials to see the project through. It's difficult to fault them and that is a good thing. Incentivising green practices is always a win and this win will require a lot of work. ", "q1r": 4, "q2": "Yes. With a detailed list of Performance indicators, it's easy to follow this project's trajectory. The details provided show that a lot of thought and consultation has gone into the planning of this proposal.", "q2r": 4, "assessor": "z_assessor_700", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "The proposal does an outstanding job of identifying inefficiencies and problems under the current carbon market constructs, and explaining why defi solutions will help. ", "q0r": 5, "q1": "The team's experience seems relevant. Although it's not clear what specific regulatory market jurisdictions they have expertise in; nor is it clear how far networking skills may lead to market participants committing. ", "q1r": 4, "q2": "The deliverables are clear, and associated project timelines are clear. ", "q2r": 4, "assessor": "z_assessor_716", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \n\nYou mentioned that it wasn't clear from the proposal what specific regulatory market jurisdictions we have expertise in. We have worked under Kyoto Protocol Clean Development Mechanism, which was a United Nations framework that linked global projects with Emissions Trading Schemes (we worked with parties in Malaysia, Thailand, Pakistan, Canada and the European Union). Today, most Voluntary Offset Schemes including those certified by Verified Carbon Standard (ex-Verra) are global and often criticised for their flaws and \"greenwashing\". Instead of national legislation, there is a strong case for auditability outside national or corporate interests to be made, something that has begun promisingly by some universities. We can make this a success with support from people like you.\nThank you from the BlockCarbon Team"}], "solution": "BlockCarbon - Fondation et bibliothèque Open Source pour permettre l'évaluation et l'échange de carbone en tant que jetons et dérivés en utilisant Plutus.", "experience": "Des experts du marché de l'énergie et du DeFi font équipe avec Plutus Pioneer et Energy CEO. Expérimentés dans les contrats carbone et les produits dérivés Kyoto/Paris."}