{"id": 382089, "author": "t", "title": "Cardano Risk Assessment Tool", "url": "https://cardano.ideascale.com/a/dtd/382089-48088", "category": 26233, "amount": 68000, "description": "Les marchés DeFi nécessitent une méthode pour juger de la fiabilité d'un portefeuille qui demande des fonds.", "funded": 1, "upvotes": 103705959, "downvotes": 9497496, "votes_result": 94208463, "votes_cast": 523, "f6_no_assessments": 8, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Le problème décrit a du sens puisque l'auteur de l'idée a publié un article de Decrypt's selon lequel les utilisateurs de defi (principalement sur Ethereum) ont perdu 10,5 milliards de dollars à cause de vols et de fraudes en 2021. Je suis d'accord et je soutiens cette idée parce que moi-même, en tant qu'enthousiaste du defi, j'ai parfois besoin de faire beaucoup de travail pour évaluer une plateforme de defi avant de mettre mes actifs.\r\nLa solution et l'exemple de snapshoot de votre outil d'évaluation des risques visent à évaluer les portefeuilles et non la plateforme, car je vois \"addr1hy59x...\" comme adresse de portefeuille. Cet outil peut-il également évaluer la plate-forme de défi ? Si cet outil est capable de s'adapter à l'évaluation de la plateforme defi, l'impact futur de cette proposition sera énorme dans la communauté Cardano DeFi. Votre espoir que cet outil soit utilisé pour ajouter une couche mesurable de confiance à toutes les parties entrant dans une transaction Cardano DeFi sera réalisé avec succès.", "q0r": 4, "q1": "Puisque le budget de cette proposition veut obtenir 13% du financement total de 500 000 $ du défi Boosting DeFi, je dois d'abord m'assurer du coût de votre développeur. Les conclusions sont : Je l'approuve. Parce que c'est raisonnable pour un salaire moyen dans votre région (double vérification sur payscale.com). Les compétences et les expériences de l'équipe sont splendides ! Il y a des preuves solides dans leur profil linkedin. Le proposant a également fourni un calendrier réaliste ! Pour moi qui ne travaille pas dans ce secteur, ils ont très bien décrit la feuille de route. Proposer conscient des risques et des défis pour ce projet, mais ils sont venus avec des moyens alternatifs pour le vérifier.", "q1r": 5, "q2": "Très bien expliqué. Grâce à toutes les informations données, nous pouvons avoir une solide compréhension de ce qu'ils font, quel est le but de cet outil, etc. Je pense que l'auditabily est parfait, pas besoin de critiquer. Mais il y a une chose que je ne trouve pas dans cette proposition. Comment s'assurer que la communauté de Cardano utilise cet outil d'évaluation des risques ? Comment commercialiser cet outil ? Un partenariat, peut-être ? Si l'équipe peut approcher de nouvelles dApps DeFI pour utiliser l'outil, ce serait génial. (n'oubliez pas de mettre à jour vos KPI si vous envisagez cela).", "q2r": 4, "assessor": "z_assessor_639", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The performance of the tool will be dependent on training data and possibly community input. There is also a need to validate the theory that based on past transactions a wallet with tendency to commit fraud can be detected since there are no restrictions in creating a fresh wallet to cover and reset tracks. ", "q0r": 4, "q1": "The proposal is from a solid technical team and is likely to be implemented. The concept may need more tuning and may have some false positives and false negatives. Still, there is a need to experiment to arrive at the possible best-case scenario. ", "q1r": 4, "q2": "The budget is primarily for the developers including the ML scientists and the output of the proposal has a well-defined end state. The proposal has a fairly reasonable time plan with defined outputs therefore it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This challenge is aligne to the challenge. Detecting the fraudulent wallets will assure people to trust the Cardano ecosystem by reducing  the risks while using it.", "q0r": 5, "q1": "This proposer is submitted by a team of people who have been involved in the catalyst for a long time, and who have expertise in the field of Data Science and Machine Learning professionals working in credit and fraud risk, for numerous credit bureaux and credit providers. Their work experience all of them understand the importance of having a system which secure, which is guarantee of trust from the community.\r\nThe issue addressed by this proposal it's a real concern for everyone using the Blockchain & DeFi, and unfortuntelly the risk keeps increasing.The implementation plan of this proposal is detailed with the timeframe and a budget well defined.", "q1r": 5, "q2": "The activities to be carried out under this project have been described and the dates set. \r\nChallenges that the proposal may face have been pointed out by proposers and taken into consideration. KPI and metrics listed.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This project will develop a Risk Assessment Oracle, a service that I think Cardano ecosystem will need to use to prevent the fraud risk of a given wallet if it belongs to a fraudster. In my point of view, it's absolutely needed for our ecosystem especially in the next phase of development when governance voting will be the future. \r\nAs the detail of the context and solution that they will solve in the proposal, with key metrics that they put, I think the team really consider how their project can help to improve the Cardano ecosystem and align to the challenge settings. ", "q0r": 5, "q1": "The team showed us an outline of their detailed plan in days, hence their budget breakdown is reasonable with that plan. \r\nThey also have a detailed explanation about how their system work, standing as a normal user I think people can understand how it can help to solve the problem. \r\nMoreover, there are some risks and challenges that directly come from the problem and technical that they're awarded and showed how they will face to them clearly. ", "q1r": 5, "q2": "They have a good roadmap with a realistic timeline for executing, they have clear key metrics that definitely align and can help to develop the Cardano ecosystem, not just enriching end-user but helping a lot of development partners to grow in Cardano ecosystem. \r\nAnd again, as I said before, their detailed explanation is sure enough for normal users can understand and trust their solution. \r\nTherefore, their provided proposal is completely enough materials for auditability. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 15, "ne": 5, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "DeFi needs risk assessment tools, so the proposal is exactly to the point with \"boosting cardano's DeFi\" challenge. In my opinion, the long term success of DeFi is dependant in finding other risk management methods than collateralized loans. DeFi default scoring and risk assessment tools are potential keys to unlocking that future. Which, of course, having uncollateralized loans is full of even more and new risk. But this is how innovation goes. Very strong project!", "q0r": 5, "q1": "Strong track record of experience, so it is very likely that it will be implemented successfully. Project plan/roadmap/scope is very well thought-through and convincing. The project itself has identified risks, which is a good sign. I would personally add \"cardano-db-sync changing the schema during the project\" as a relevant risk to the developer side, but I assume that they have counted that in to the budget and it in itself will not affect the likelihood of project success.", "q1r": 5, "q2": "Project scope is presented in very good detail, which allows to monitor the progress. Metrics/KPIs, which are presented, are relevant and convincing, and provide sufficient information to audit both the progress and the success.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "There's no DeFi without trust and this project adequately addresses this problem. With Atala Prism in the mix, we have good use of the DIDs which is necessary for people to identitify the wallets they choose to have a transaction with. ", "q0r": 4, "q1": "The experience on the team is commendable. Being proposers in the previous funds, it's a case of resilience and persistence at this point. Learning as you go. Asides that, the credentials of the proposers are relevant to the project. Having also participated in both Plutus and Atala pioneer programs is a bonus. ", "q1r": 5, "q2": "YES! The Key Performance Index is placed in a way that highlights each achievement with actionable steps in the roadmap. It's a very important project that is taken as such. ", "q2r": 5, "assessor": "z_assessor_700", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal effectively underlines security risks referenced in the challenge brief. However, the solution doesn't seek to address/alleviate the risks associated with smart contract exploits (where user assets are aggregated), but instead focuses on custodial wallet exploits. ", "q0r": 3, "q1": "The team's experience can allow for successful implementation. However, the plan presented has many unknowns that should be clarified. To better assess a real value add, the plan could have elaborated on how \"fraud\" will be defined and with what parameters (beyond the \"phishing bot\" eg),. \"Fraud\" parameters should be clearly and sufficiently scoped and defined for the community to determine logical outgrowth and the potential for unintended consequences. \r\n\r\nAdditionally, it's not clear how the scoring method would apply to deposit accounts held in smart contracts. \r\n\r\nThirdly, raising awareness on the risk profile of a certain address doesn't necessarily solve the problem. Fraudsters can create new wallets using the same \"fraud' once profiled. \r\n\r\nFinally, assessor believes that metadata and transaction behavior are too abstract and not the most relevant inputs for individual, custodial wallets given that many instances of fraud are unintentionally \"permitted\" and therefore technically valid. It may seem arbitrary, but with the right parameters consumers could be entrusted with scoring. The solution should capture prevalent \"types\" of fraud and raise community awareness. ", "q1r": 2, "q2": "The proposal gives the duration or amount of time specific tasks will take, but it's not clear whether they can be pursued concurrently, where there are interdependencies, and how long the overall project will take to complete. ", "q2r": 3, "assessor": "z_assessor_716", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "An innovative idea that would create a paradigm shift in Defi space if well implemented, the proposer outlines exactly the role of such a solution in Cardano's space and its positive effect on the community and mainly other projects.", "q0r": 4, "q1": "The team provided links to Linkedin pages of the main members and a link showing that they have been part of the PLUTUS first cohort. They also present a clear roadmap with specific goals and outlines to what needs to be done. Furthermore, they added a Faq section that talks about questions the voter might ask themselves. On the other, the technical specifics of the protocol were not shared or explained in detail.", "q1r": 3, "q2": "The team prepared a very detailed list of the needs of this project and its budget allocations. They also prepared a roadmap with different milestones that are clear and will allow the community to assess their development.", "q2r": 4, "assessor": "z_assessor_768", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Développer un Oracle d'évaluation des risques. Un service web public pour prédire le risque de fraude d'un portefeuille donné, c'est-à-dire s'il appartient à un fraudeur.", "experience": "Pionniers de Plutus, pionniers d'Atala PRISM. Création et développement d'extensions à croesus-blockchain.com pour les propositions réussies du Fonds 5 et du Fonds 6."}