{"id": 383214, "author": "tobrien", "title": "Climate Finance For Small Farmers", "url": "https://cardano.ideascale.com/a/dtd/383214-48088", "category": 26233, "amount": 12000, "description": "La modernisation de l'agriculture oblige les petits agriculteurs à prendre des risques pour leur subsistance, sans filet de sécurité.", "funded": 1, "upvotes": 38124024, "downvotes": 31684484, "votes_result": 6439540, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition répond efficacement au défi, qui est de développer l'espace DeFi Cardano en fournissant une solution pour une chaîne d'approvisionnement très importante et efficace. J'ai travaillé pendant plusieurs années sur la chaîne d'approvisionnement agricole, des agriculteurs aux multinationales, et j'ai pu apprécier l'importance d'une telle proposition et l'impact qu'elle pourrait avoir sur les personnes, la nature et, en apportant des solutions, également sur Cardano. La proposition identifie un problème qui a le potentiel d'avoir un impact sur le défi mais qui nécessite encore des recherches et un livre blanc. La proposition a le potentiel d'ajouter une grande valeur à l'écosystème Cardano, mais en plus de mentionner la taille du marché, il aurait été bon d'ajouter quelques informations supplémentaires sur les règles et les processus financiers et comment ils sont liés au mécanisme DeFi.\r\nPlusieurs mesures et objectifs clés de la proposition s'alignent sur les paramètres des défis décrits. Bien que les défis suggèrent certains indicateurs clés de performance spécifiques qui ne sont pas mentionnés. Bien qu'il soit encore tôt, il aurait été bon d'ajouter quelques estimations telles que le nombre d'agriculteurs que l'application inclura à chaque étape. Il aurait été très utile d'en savoir plus sur le projet pilote proposé (agriculteurs, chaînes d'approvisionnement, prix, cultures, principaux défis).", "q0r": 4, "q1": "L'équipe est très expérimentée et la proposition fournit suffisamment d'informations pour le confirmer. L'équipe est également active dans l'écosystème Cardano et catalyseur depuis plusieurs années. Il serait bon de fournir plus d'informations sur le projet local et la direction de l'équipe au Ghana. Le budget est clairement décrit et ventilé en éléments identifiables et est raisonnable pour atteindre les objectifs fixés. Étant moi-même entrepreneur, je peux estimer que le coût est très modéré pour les objectifs et que des fonds supplémentaires seront nécessaires. C'est très bien que le proposant ait pour objectif de lever des fonds auprès d'investisseurs, mais ce sera à la fin de l'année et il faudra probablement plus de ressources dans le processus (c'est-à-dire le développement, les liquidités). Il aurait été bon d'en parler dans la proposition et de fournir plus d'informations. La proposition offre un calendrier réaliste pour achever le travail.\r\nLes chaînes d'approvisionnement agricoles sont complexes et il y a de nombreux défis qu'il sera important de mentionner et de connaître. Comme les objectifs des négociants, la logistique ou les besoins du cycle de trésorerie. Encore une fois, il aurait été utile d'avoir plus d'informations sur le projet pilote pour en évaluer la faisabilité.  ", "q1r": 4, "q2": "La proposition comporte une feuille de route, des étapes, un budget, une estimation du temps et des éléments livrables clairs. Le problème à traiter et la solution sont très complexes et, bien que les informations soient présentées de manière ordonnée, des détails supplémentaires sont nécessaires et seront fournis avec le livre blanc dans quelques mois. Les risques et défis potentiels ne sont pas particulièrement abordés, comme mentionné dans la section sur la faisabilité. Il serait utile de développer les paramètres/indicateurs clés de performance (ICP) pour mesurer le succès, comme le nombre attendu d'agriculteurs et leurs améliorations économiques. Cependant, les progrès peuvent être vérifiés sur la base de jalons à atteindre dans les 3-6-12 mois, et je crois que ces jalons fourniront de grandes informations pour la communauté liée à un défi majeur et évolutif alors que le budget est très raisonnable - j'ai donc donné le plein tarif ici.", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Bonjour aux électeurs d'Ada ! Je suis très enthousiaste à l'égard de cette proposition et de mon rôle dans son examen, car j'ai pu voir comment l'impact de cette proposition et son lien avec le défi peuvent être perdus dans la traduction. La façon dont cette proposition est alignée avec le défi est la suivante ! 1. Cette proposition contribuera à la seule chose qui manque à beaucoup de defi dapps, à savoir une connexion au monde réel et aux actifs/industries du monde réel ! 2. Cardano defi est encore jeune, nous aurons donc besoin de soutenir de nombreuses expériences quand il s'agit de lisser les bords de Defi sur Cardano. Cette proposition sera partagée avec le catalyseur avec toutes les leçons et les données pertinentes pour améliorer defi daps à venir. Surtout en ce qui concerne le mariage entre defi et l'agriculture ! 3. Le problème que cette proposition vise à résoudre dans la création d'un livre blanc, un prototype de travail, et une preuve de concept pour son produit fini a déjà indiqué 2 joueurs potentiels pour utiliser leur Dapp et ces joueurs seront embarqués sur Cardano boostant defi nativly. Le premier \"acteur\" sera les agriculteurs qui ont des marges serrées et qui peuvent bénéficier de cette proposition en cultivant des produits biologiques et potentiellement en étant connectés à des acheteurs pour atténuer les risques de leurs marges serrées et le second sera les investisseurs qui peuvent profiter de l'afflux de leurs capitaux dans l'industrie agricole/defi. Nous devons prendre du recul dans cette partie de l'examen et nous demander ce qui va réellement stimuler le Defi sur Cardano ? Une chose à retenir est que si nous regardons où va l'agriculture, nous pouvons voir que l'espace des données sur le climat et le defi sera la destination. En effet, l'agriculture est une industrie cyclique qui présente des inefficacités au niveau des données, ce qui entraîne de nombreux manques à gagner. Il y a aussi beaucoup d'agriculteurs mal connectés qui ont des cultures qui peuvent être de haute qualité, mais le fait que ces cultures ne sont pas achetées conduit à beaucoup de gaspillage. La chaîne de blocs peut résoudre ces deux défaillances de notre système traditionnel. La blockchain y parvient en fournissant d'abord une place de marché pour que les agriculteurs puissent vendre et acheter des données et ensuite une place de marché qui peut connecter les agriculteurs aux acheteurs dans leurs frontières locales et nationales et même dans le monde entier. Je pense que l'impact de cette proposition sera plus bénéfique en tant que preuve de concept pour faire avancer la résolution de ces problèmes auxquels le monde agricole est confronté.", "q0r": 5, "q1": "Je ne pense pas que nous ayons des inquiétudes sur la mise en œuvre de ce plan, car le financement est de 12 000 et ce n'est pas une somme énorme dans notre budget global, mais le \"ROI\" ou retour sur l'intention, comme expliqué dans la section précédente, est bien supérieure à celle de 12 000. La raison pour laquelle je suis confiant dans la mise en œuvre des propositions est 1. parce que l'équipe est très expérimentée et 2. le plan en lui-même n'est pas trop ambitieux car il vise à créer un livre blanc et a défini exactement le financement, le temps que cela prendra. Il s'agit également d'un prototype et d'une preuve de concept de manière très réaliste, avec un bref résumé de chaque étape qui démontre où cette preuve de concept va fleurir en premier (ghana). Je crois que lorsqu'il s'agit de propositions, le \"jockey sur le cheval\" est la partie la plus importante et c'est pourquoi j'invite les détenteurs d'Ada à consulter les références des équipes ci-dessous.\r\n Jonathan KOH (Directeur)\r\n\r\nJonathan a plus de 30 ans d'expérience dans la fourniture de solutions dans le domaine du commerce. Il a participé à plus de 40 programmes de commerce numérique, de douane et de facilitation du commerce dans le monde. Il est expert en plates-formes commerciales communément appelées \"guichet unique\", qui est l'un des principaux instruments de facilitation du commerce préconisés dans l'Accord sur la facilitation du commerce de l'Organisation mondiale du commerce (OMC), en vigueur et ratifié par plus de 170 pays. Jonathan a été directeur de projet pour de nombreux projets de mise en œuvre de la facilitation des douanes et du commerce, notamment au Kenya, au Qatar et à Oman. Il a été fortement impliqué dans le conseil, en tant que consultant principal pour le gouvernement de Hong Kong SAR pour leur système de commerce électronique de nouvelle génération. Il a été le consultant principal du gouvernement grec et a contribué à l'élaboration de leur stratégie nationale de facilitation du commerce et de leur feuille de route. Il a également dirigé des études d'assistance technique/de faisabilité dans de nombreux pays. Il a servi de ressource experte pour la Communauté économique de l'ANASE et a contribué à l'élaboration des indicateurs de facilitation du commerce sans rupture de l'ANASE.\r\n\r\nJonathan a également fait office d'expert pour diverses organisations internationales en matière de facilitation des échanges et de politiques. Il a été chercheur invité par le Fonds monétaire international et membre du comité consultatif international du réseau d'experts des Nations unies pour le commerce sans papier en Asie et dans le Pacifique (UNNeXT).\r\n\r\nTimothy O'Brien (Principal)\r\n\r\nTim a 20 ans d'expérience dans la création d'applications critiques en travaillant pour Raytheon, Citi Group, Deutsche Bank, Bank of Tokyo, Danske Bank, Philips Health, Cerner Health, Norwegian Air Continental Airlines et plus récemment Google. Tim travaille avec la technologie Cardano depuis 2019 et est membre du programme Atala PRISM Pioneers. Récemment, l'objectif principal de Tim est de rendre la puissance de la blockchain accessible à tous. Tim a 6 ans de développement de blockchain et dirige une entreprise de développement de blockchain avec plus de 15 employeurs. Tim est membre de la Singularity University.\r\n\r\n \r\n\r\nCraig Young (Conseiller)\r\n\r\nCraig est internationalement connu comme expert en matière de paiements internationaux. En tant qu'ancien directeur technique de SWIFT et actuel directeur technique de l'association Diem, Craig a travaillé sans relâche pour faire des paiements transfrontaliers une réalité. Craig a acquis des connaissances techniques approfondies, ce qui m'a donné une perspective unique au fur et à mesure que j'accédais à des postes de direction. J'ai occupé des postes de vice-président et de directeur général dans des institutions mondiales de télécommunications et de services financiers, dont SWIFT et Verizon, en dirigeant des opérations de technologie, de développement de produits, d'ingénierie et de cybersécurité.\r\n\r\nGerhard Eschelbeck (Conseiller)\r\n\r\nLargement considéré comme l'un des plus grands experts en matière de sécurité des réseaux et des systèmes, Gerhard a été invité à présenter ses recherches en matière de sécurité de l'information devant le Congrès américain. Il intervient également fréquemment lors des principales conférences du secteur.\r\n\r\nIl a été nommé l'un des 25 CTO les plus influents par InfoWorld en 2003 et 2004, et a reçu cet honneur une troisième fois en 2006. Gerhard contribue fréquemment au consensus des experts du SANS Top 20, qui identifie les vulnérabilités de sécurité les plus critiques. Gerhard est également un auteur très apprécié et est peut-être plus connu pour avoir publié les \"Laws of Vulnerabilities\". Il est l'un des inventeurs du Common Vulnerability Scoring System (CVSS) et détient de nombreux brevets dans le domaine de la sécurité des réseaux gérés.", "q1r": 5, "q2": "Cette proposition est définitivement \"audit friendly\" car ils ont établi des délais pour chaque partie du financement comme suit. Un livre blanc en 2 mois et un prototype fonctionnel en 3 mois, la preuve de concept étant un rendement de 6 à 12 mois à perpétuité. Cela nous permet de tenir l'équipe responsable de chaque processus de la proposition.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposal matches the challenge in that it would create a dApp to support investing in smaller farms with the goal to help the farmers change to a more climate friendly farming.", "q0r": 5, "q1": "I will say here, that the majority of the text of this proposal is about the proposing team and their experience and background. This is certainly great but the idea in itself is very complex and would have benefitted from more content and actionable steps of the project itself and the prior work the team has done. It seems that the team focusses on Africa with this project as this is where they are already working on similar projects. It would have been interesting if the team will be expanding this tool, if the tool will be used exclusively in Africa or if it would be a good tool to adopt to other countries. It would have been great to provide the rationale with a comparison of (government) subsidaries in other countries and the impact that these funds had on emissions when smaller farmers changed to more sustainable farming - it would have been easier to understand the impact, that this proposal might create.", "q1r": 4, "q2": "While it is a great idea, due to the lack of actionable steps, this proposal is difficult to audit and transparency is not as high as in other projects. One of the three references provided in the proposal does not work, the budget is broken down too broadly as is the roadmap. ", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 1, "ng": 18, "nfo": 3, "vca_o": 1, "reply": "Why is writing a whitepaper about a project hard to audit?\nThe product of this proposal are whitepapers. "}, {"q0": "The proposal as-is lacks detail to make a good opinion of what its impact would be. The general idea seems good, but the proposal remains vague on the details enough that it's hard to picture what the mission is, how will revenue be generated, why would investors invest in the project, etc... In addition, the project reminds me of Kiva, a cardano-powered lending platform that is already well established and has been mentioned by Charles Hoskinsons himself on multiple occasions. There is no mention of how this platform is different or better than other lending platforms, and how it would attract users and investors.", "q0r": 2, "q1": "The team is small, but with the right people, it could be possible to achieve this in the proposed timeframe. However, the proposal is light on the details as far as planning go, with only some very high-level targets exposed. ", "q1r": 3, "q2": "The proposal doesn't lay out success metrics, and the milestones are very high-level. Risks and challenges aren't adressed, and the roadmap is vague.", "q2r": 2, "assessor": "z_assessor_318", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n\n "}, {"q0": "The problem is not so much tied to this challenge, but the solution and the success metrics in this proposal fit the challenge setting. \r\nHowever, there has no content in this proposal shows that it will bring any value to the Cardano ecosystem and so on the detailed plan. \r\n", "q0r": 3, "q1": "This proposal only overviews about benefits and features for users only.   \r\nIt lacks all the basic info for assessing the feasibility. Include: \r\n- Detailed implementation plan for knowing what will do. For developing this system, it should add more info about: coding, function, technology support below... \r\n- Detailed roadmap: this proposal doesn't have it. All info that relates to the timeline is their success metrics with a short brief without explanation. \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. ", "q1r": 2, "q2": "The proposal doesn't have a roadmap with detail and realistic timeline. So we can audit this project. \r\nThe key metrics are clear but there is no detail for clearing about them\r\nThe proposal has detailed explanation of the problem and how the solution can address it. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n"}], "solution": "rédiger un livre blanc avec un prototype fonctionnel qui présente une manière rentable de répartir le risque lié à la modernisation des méthodes des petites exploitations agricoles.", "experience": "https://www.cardanonocode.com/leadership.html"}