{"id": 383400, "author": "christophe.hoche", "title": "Real Estate Fractional Ownership", "url": "https://cardano.ideascale.com/a/dtd/383400-48088", "category": 26233, "amount": 25000, "description": "L'immobilier est la plus grande classe d'actifs au monde. Mais l'importance des quantum et la faible liquidité expliquent pourquoi l'accès à l'\"échelle immobilière\" est difficile.", "funded": 0, "upvotes": 22547735, "downvotes": 22369682, "votes_result": 178053, "votes_cast": 312, "f6_no_assessments": 5, "f6_rating": 2.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "Bonjour aux électeurs d'Ada ! Après avoir lu la proposition et consulté le site https://www.the-entr.com/, je pense que l'idée de fractionner des biens immobiliers générateurs de revenus et d'avoir la possibilité d'utiliser la propriété fractionnée en restant sur place est une idée qui va sans aucun doute booster Cardano ! La propriété fractionnée, telle qu'elle est mentionnée dans la proposition, permettra à chacun de participer plus facilement à cet incroyable véhicule de création de richesse. Cette proposition peut avoir des lacunes dans certains domaines, à mon avis, au fur et à mesure que nous progressons dans mon examen, mais son impact pourrait vraiment être une option extraordinaire à offrir sur la blockchain Cardano ! Je veux être sûr de donner du crédit à l'idée, en particulier en voyant comment ils ont abordé l'éléphant dans la pièce quand il s'agit de fractionnement de biens immobiliers qui est la vérification de l'identité. Travailler avec Cardano pour utiliser le prisme Atala est essentiel pour rendre l'immobilier accessible au plus grand nombre.      ", "q0r": 5, "q1": "En ce qui concerne l'équipe de proposition et l'expérience des membres de l'équipe, j'ai confiance qu'ils ont ce qu'il faut pour faire ce qu'ils disent qu'ils vont faire comme mentionné dans leur plan ici - \"La prochaine étape est de créer de la liquidité et pour cela nous voulons construire un marché secondaire. Mais ce qui a enlevé une partie de cette confiance, c'est qu'ils ont indiqué pourquoi il est important de construire un marché secondaire et d'avoir des liquidités, mais ils n'ont pas semblé entrer dans les aspects techniques de l'utilisation des fonds pour y parvenir et je ne savais pas si les fonds seraient utilisés uniquement pour les liquidités ou s'ils utiliseraient une partie des fonds pour construire la place de marché. Je pense qu'il est important d'avoir plus de transparence sur le temps qu'il faudra pour voir un produit fini et où les fonds seront alloués. De même, un contexte sur l'équipe de développement des propositions et leur rôle dans ce domaine aurait été apprécié pour se faire une idée de la façon dont cette proposition se manifeste.", "q1r": 3, "q2": "Pour ce qui est de l'audit de la proposition, nous ne disposons pas d'échéances claires ni de jalons pour l'audit de la proposition. Peut-être ai-je manqué quelque chose, mais pour moi le plan ressemblait plus à un discours qu'à un plan. Si j'ai raté quelque chose, j'espère que cet examen sera signalé car je suis très optimiste quant à l'impact de cette proposition, mais je suis pris entre le marteau et l'enclume car mon travail consiste à être impartial dans ces examens et fidèle aux électeurs. J'aurais souhaité que le proposant ajoute plus de substance à la vérifiabilité de cette proposition car malheureusement, la seule chose que nous pouvons vérifier est si la place de marché peut être construite et nous n'avons pas de calendrier clair quant à la date à laquelle cela se produira.", "q2r": 2, "assessor": "z_assessor_766", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal focuses on fractional ownership of the fully managed real estate to lower the entry amount, remove non-monetary friction and facilitate liquidity. Since the detailed plan was not well-prepared [no goal, no roadmap, no KPIs/metrics, no risk, and mitigation]. As a result, potential impact can not be seen. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1. ", "q0r": 1, "q1": "There is not much information provided, as mentioned, there is not much proof of feasibility to evaluate. As the proposer said that \"This is a complex project with multiple components\", and fractional ownership in the real estate required more detail [in the plan] than this. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "As mentioned, since this proposal is incomplete [no profile description and links for verification, doesn't have any roadmap or KPIs, the budget structure is not defined, and the risk is not defined], transparency is at a low level, especially for a complex topic of there is not much proof of feasibility to evaluate. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Real estate fractional ownership and crowdfunding real estate future is definitely a future trend and cryptocurrencies may play a big role in there. Decentralized finance may also play a big role, but unfortunately the proposal does not clearly explain how the plan addresses this specific challenge.", "q0r": 3, "q1": "The team has proven track record in the \"fractional ownership\" business, but unfortunately technical competence is not sufficiently presented in the proposal.\r\nThe plan is very generic and not detailed enough to assess the likelihood of the proposal to be implemented successfully. It is not explained sufficiently how the budget will be spent.", "q1r": 2, "q2": "Information to audit the progress and the success of the project are not presented in the proposal.", "q2r": 1, "assessor": "z_assessor_685", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposer has a background in real estate agent management from Paris. The proposal is to have a brilliant idea to apply Atala PRISM for DID and based on the Cardano blockchain. The real estate buyers will share a portion of an actual real state, and there is a platform going to manage to collect the rent and manage the rental's maintenance. The reality is that real estate in the top 10 cities worldwide is highly unaffordable for most average income earners in those cities. If the project formed a more explicit correlation between ADA holders and real estate businesses and streamlined the earning and assurance module, then the project model would ultimately be a high-value use case project.", "q0r": 4, "q1": "I believe the proposer a bit rush in writing the proposal to submit. Therefore, the deliverable elements are not provided clearly and are close to being omitted. I provide two quick links below that might help you rewrite and do more research and comprise data for next month if you wish to carry on with your journey.\r\n(Short version) https://t.me/ProjectCatalystChat/60411 or (extended version) https://cardanocataly.st/en/proposers/ \r\n", "q1r": 1, "q2": "With a $25,000 project requested, there is no information on how the project could be carried out and who is going to be involved. It is genuinely impossible for the community to view the challenge team to monitor and report your project progress. Should you refer to the two links provided in the feasibility box if you ever wish to rewrite and resubmit in the future fund rounds.", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies an avenue to boost cardano's defi through fractionalizing real estate. The goals align with the challenge however the goals  are not clearly defined and so it is difficult to determine exact aligment.", "q0r": 4, "q1": "The team appears to have good experience in real estate however there is no reference to experience with plutus, smart contracts or fractionalised tokenisation and so that coupled with no comprehensive breakdown of funds makes the feasibility of this project low.", "q1r": 2, "q2": "No roadmap, KPIs or defining of what success looks like makes this project impossible to audit. ", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Nous proposons la propriété fractionnée de biens immobiliers entièrement gérés afin de réduire le montant d'entrée, de supprimer les frictions non monétaires et de faciliter la liquidité.", "experience": "Vaste expertise en matière de finance et de droit, acquise au cours de plus de 25 ans dans des banques, et expérience personnelle en matière d'investissements immobiliers dans différentes villes."}