{"id": 383459, "author": "dcspark", "title": "DeFi 2.0 Hackathon", "url": "https://cardano.ideascale.com/a/dtd/383459-48088", "category": 26233, "amount": 50000, "description": "De nombreux développeurs Ethereum ne savent pas qu'ils peuvent déployer leur contrat sur Cardano via Milkomeda.", "funded": 1, "upvotes": 117882613, "downvotes": 8018295, "votes_result": 109864318, "votes_cast": 581, "f6_no_assessments": 7, "f6_rating": 3.2857142857142856, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer is trying to organise a hackathon for people who want to build defi projects on the cardano network. While this can be a good idea, the proposer failed to explain clearly how this will add value to the cardano network. I I think that the proposer could add more information about the  key metrics and the goals of this project. Furthermore I don't see this project scaling in future challenges.", "q0r": 2, "q1": "The proposer hasn't provided enough information to get a positive note on the feasibility of this product. My advice to the proposer is to add more information about the team. Evidence of skills and experiences of the team is needed as well as the number of team members required to complete the job. The proposer should also break down the budget into identifiable items. Furthermore the proposal should include a reasonable timetable to complete the work. Infine, I suggest to the proposer to use previous funded proposals and use them as references in order to improve this proposal structure.", "q1r": 2, "q2": "The information missing in this proposal makes it difficult to give a positive note to the auditability of this project. The proposer should add a roadmap with reasonable milestones. Furthermore the proposal should include metrics and kpis that will help measure its success. So, I think the proposer can improve this proposal by adding all the information missing. That will increase its chances to receive a positive rating and help being funded.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is align to the challenge as it'll help many Ethereum developers to know they can deploy their contract on Cardano through Milkomeda", "q0r": 5, "q1": "The idea behind this proposal is very thons interesting, hosting that hackaton for individuals and compagnies. It contributes to boost the Cardano 's Defi.\r\nHowever, I don't find myself well equipped to give more details and a proper assessment about this proposal as there's no much information from my point of view.\r\n", "q1r": 3, "q2": "Not much information about how is the budget allocated, and as said previously, I feel not having much details to allow me an objective assessment.", "q2r": 3, "assessor": "z_assessor_478", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Hackathon is a great idea! This proposal wants to attract other blockchain developers to build on the Cardano Ecosystem. As defiprime.com mention that DeFi protocol on Ethereum networks are still on the top rank with 213 projects (BSC = 43 and Polygon = 48). With cryptocurrency trends about Layer 2 as a scaling solution, proposer are already build Milkomeda protocol that will be the Cardano sidechain. Their gitbook are well defined. Hope with their hackathon, it will boost Cardano's Defi adoption.", "q0r": 5, "q1": "Not really a fan when the proposer explain this project. Love the idea to host virtual hackathon, but authors not really want us to know the detail.\r\n\r\n(+) Team members experiences are great (ex-EMURGO and ex-IOHK), but there's no link to their profile. I have to find their website then manually search their LinkedIn profiles.\r\n(-) No budget breakdown. Proposer only written down $50,000 with only explanation of the hackathon budget for $5,000. Where will others $45,000 budget going?\r\n(-) There's no timetable. It would be good to be explicit about the timetable. Next information you should add: What to prepare for the hackathon? When it will release the information of the hackathon? Where and when you will share about this hackathon? etc...", "q1r": 2, "q2": "While the proposer not describing the roadmap and the KPIs, we can find the key metrics explained implicitly in their solution. With hosting a virtual hackathon for individual developers and companies, it will attract the interest from other blockchain developers to create projects on Cardano. Next time, if the author create another proposal(s) better to explain the key metrics or target for the proposal.", "q2r": 3, "assessor": "z_assessor_639", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This is an experienced working group at emurgo, which organizes smart contract development idea contests on cardano, and is geared towards developers on ETH.", "q0r": 5, "q1": "The idea is very good, but the team has not given a specific method, implementation plan and communication plan to convince the ETH development team to learn and develop smart contracts on Cardano.", "q1r": 3, "q2": "Through these group events held online on youtube, the authenticity and effectiveness of the project can be checked. And see how well they implement the plan and how much influence they have on the community.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The problem is definitely within the challenge but I think the proposer should provide a lot more info for CA and voter to assess this idea.\r\nMy advice to them is to provide some key metrics that relate to which the challenge set, for: number of developers, or team, or idea will join in their hackathon event... ", "q0r": 3, "q1": "There is no roadmap for implementing this idea. Moreover, as a CA that stands for Catalyst community I do want to know about how the budget will be used for, how much for managing the event, how much for funding, or which field of the idea will be funded and their allocation... \r\nMore than that, it's also a big event because it will affect a lot of developer communities. So, the proposer should give some more info about how their team can hold an event and get rid of a lot of risks that will appear. \r\nThis proposal is lacking a lot of info that is hard to believe will be feasible to do. ", "q1r": 1, "q2": "The proposer doesn't provide any info about the roadmap, timeline, and even key metrics. So it is impossible for auditing this project when being funded. \r\nMoreover, they don't have enough detailed information about how they will hold this event. \r\nSo, I rate 1 out of 5 for the auditability. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposer has clearly identified the problem; many developer are currently unaware of the proposition of launching there contracts onto Milkomeda- an EVM compatible sidechain for Cardano. By gaining the awareness of Solidity developers, this gels well with the challenge- \"boosting Cardano's Defi\". By deploying their contracts to the sidechain and therefor gaining access to the Cardano ecosystem as a whole; this will only add value to Cardano and will appeal to many developers that aren't comfortable with core language of Cardano (Haskell).  ", "q0r": 4, "q1": "The proposers are well known within the ecosystem, that being dcSpark and have a proven track record. Many of the developers in question have formerly worked for Emurgo and IOHK. The budget being asked for $5k USD is completely reasonable for prizemoney for the Hackathon. And the timeframe given for Q1 2022 is also very achievable. ", "q1r": 4, "q2": "Currently there is no date set in stone for the Hackathon only a rough estimate. Further updates will be needed if the proposal gains funding. Also the community, to my knowledge will be able to keep track of the proposal via updates from dcSpark on there socials; Twitter, discord etc. ", "q2r": 3, "assessor": "z_assessor_858", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is effectively addressing the challenge to boost Cardano DeFi with a virtual hackathon event for Ethereum DeFi teams to deploy on Milkomeda EVM sidechain.", "q0r": 5, "q1": "The team at dcSpark has built Milkomeda which is now deployed on testnet and is now attempting to begin scaling its utility by hosting hackathons for Ethereum DeFi devs. The hackathon plan is highly likely to be successfully implemented.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the dcSpark are Cardano native community members with experience running previous dApp accelerator programs.", "q2r": 4, "assessor": "z_assessor_940", "no_vca": 23, "ne": 2, "ng": 12, "nfo": 9, "vca_o": 1}], "solution": "Nous organiserons un hackathon virtuel pour les individus et les entreprises qui construisent DeFi 2.0 et partagerons nos connaissances sur Cardano et Ethereum.", "experience": "Notre équipe est composée d'anciens employés d'Emurgo et d'IHK bien connus qui ont construit l'écosystème Cardano au cours des dernières années."}