{"id": 383916, "author": "konmagat", "title": "Konmaswap a DEX for Cardano", "url": "https://cardano.ideascale.com/a/dtd/383916-48088", "category": 26233, "amount": 73600, "description": "Il n'existe pas de plateforme permettant aux nouveaux utilisateurs d'accéder à Cardano en utilisant facilement les différentes solutions intégrées de DeFi et les ICO.", "funded": 1, "upvotes": 78268771, "downvotes": 22511094, "votes_result": 55757677, "votes_cast": 426, "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=16280"], "media": [], "f6_assessments": [{"q0": "La proposition dans son ensemble semble prometteuse. L'auteur aborde le problème de \"l'absence d'une plateforme où les nouveaux venus peuvent utiliser les solutions intégrées de Defi et l'ICO\" en proposant une solution consistant à \"fournir un moyen facile de déployer des contrats intelligents sur la chaîne Cardano\". Les données démographiques sur lesquelles l'équipe prévoit d'avoir un impact sont principalement les utilisateurs existants sur d'autres chaînes et également les nouveaux utilisateurs. Ainsi, une mise en œuvre réussie de la proposition fera de Cardano l'une des destinations privilégiées pour l'hébergement de Defi. L'achèvement positif de toutes les phases du plan, y compris le marché DEX et NFT, apportera beaucoup de variété à l'écosystème, stimulera les nouvelles contributions et augmentera la surévaluation de la chaîne Cardano.", "q0r": 5, "q1": "Le proposant a fourni une feuille de route détaillée sur une base hebdomadaire, ce qui ajoute beaucoup de crédibilité à l'équipe. L'équipe mentionne également un ensemble de compétences requises qui semblent appropriées pour le défi à relever et Konma Labs a montré son expertise et son succès dans les entreprises précédentes, ce qui rend la probabilité de mise en œuvre réussie de cette solution très élevée. Le budget demandé est également bien en deçà de la limite de 20% du total des fonds mentionnés dans le briefing de la campagne. Et la ventilation du budget est très élaborée et lucide. Cependant, je pense qu'il faudrait un peu plus d'informations sur les risques et les défis auxquels l'équipe pourrait être confrontée et sur les stratégies d'atténuation mises en place. De même, comment cette nouvelle solution au défi surmonte les vulnérabilités déjà existantes dans les autres chaînes. Un peu plus d'informations à ce sujet permettrait aux lecteurs et à la communauté d'être plus facilement certains du succès de la proposition.", "q1r": 4, "q2": "Les informations fournies dans la proposition sont suffisantes pour vérifier et suivre le succès de la proposition. L'auteur de la proposition présente à la fois les indicateurs clés de performance du produit et du projet afin de les vérifier des deux points de vue. L'équipe a également prévu de mettre le logiciel à disposition sous forme de code source ouvert, ce qui permet à la communauté de contrôler les progrès réalisés. En outre, l'augmentation du nombre de NFT de jalonnement et d'échange permettant la transition depuis d'autres chaînes montre l'augmentation du trafic et de la valeur du réseau, un outil transparent qui aide les auditeurs à tirer leurs conclusions sur le succès de la proposition. Avec l'achèvement de la phase I, le nombre de pièces cotées sur le DEX mis en œuvre au bout de 6 mois sera également une mesure supplémentaire que le processus d'audit pourra utiliser. Compte tenu de ce qui précède, la clarté et l'auditabilité sont distinctes et je voudrais donc attribuer une note de 5 sur 5 à cette proposition.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 18, "ne": 13, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This proposal intends to create a DEX featuring an array of DeFi-options.  It is part of a larger project spanning 7 proposals in fund 7. The intention of the main project seems to be to create a sub-ecosystem on the Cardano blockchain. A DEX with DeFi-abilities is a crucial part in the whole that is intended. The DEX has a dual function as there is a set objective to bridge with other blockchains, putting the ERC20-converter to use and generating an influx of community members on this one. ", "q0r": 5, "q1": "The plan is ambitious, but not impossible. The proposers still need to assemble a team for this. There has been provided a clear definition of the functions that are still needed.  It also needs identification of who already is in the team. ", "q1r": 3, "q2": "Highly auditable proposal, aside from the team member identification and expected public launch date. To improve, try to include profiles of each team member and corresponding skills. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 24, "ne": 2, "ng": 19, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is clearly a DeFi protocol that seeks to become a competitor in the DEX space of Cardano. ", "q0r": 5, "q1": "Although they give some indication as to recruitment of various personnel and developers that can work in Haskell, not much evidence is presented in regards to the team and why we should trust that they will be able to successfully do all of this. \r\n\r\nFrom what can be inferred from the proposal, the budget is mostly going to be used to recruit developers and so it seems like the proposers will fill the role of being managers and strategists. However, if this is the value-added of the team itself then more details in regards to the team's capacity to recruit effectively and the details of the DEX itself. Usually proposals that ask for amounts in the range of $75k will have MVPs or a very strong track record. ", "q1r": 2, "q2": "The milestones provided are very clear and easy to follow up on as they are provided on a weekly basis with recruitment in the first two weeks and ICO by week 23. However, they do not indicate any KPIs such as the number of users. This is a minor point that doesn't justify a reduction of stars but still something they could improve on for the next round. ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal able to identifies the problem properly, by creating a DEX platform for the Cardano ecosystem. They create this DEX to provide an easy way to deploy smart contracts on the cardano chain and utilize Sales tools for an easy ICO process and more, which not only aligned to this challenge settings but also will further drive adoption to Cardano ecosystem in the future. ", "q0r": 5, "q1": "The team working on this proposal can be verified and proven on their website link, which have Linkedin profile. Konma is an organization and have an orchestra of different proposal (seven of them) on this Fund 7. Konmaswap is one of their project out of many, but that doesn't lower the quality of each proposal they made. From the knowledge of the teams needed (and how to find them), the detailed goals and plan, budget breakdowns, action plans, the KPI, product KPI, all of this is explained very well and in details. Especially regarding the skills requirement for the team. It shows that Konma are able to identify the resource needed for this kind of project to succeed. Overall, from this well written proposal alone, there is a high chance of success that this project will come to fruition. Keep in mind that there are 6 other proposal by Konma team in this Fund 7, and it shows their dedication and hardships.", "q1r": 5, "q2": "The roadmap is explained in weekly basis. Metrics and KPIs are provided, alongside with their goals, demographic description, and action plan. In term of auditability, this proposal is feasible to be audited from the activity on their website, social media, and the project metrics / KPIs itself.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal accurately addresses the challenge and if successful would boost Cardano's Defi Ecosystem. However it would be great to hear what makes Konma unique in its proposal as there are already multiple DEXs launching on the ecosystem.", "q0r": 4, "q1": "Whilst links to Konma are provided it is very difficult to determine what skills exactly the team brings with them. There is mention of Consulting Mlbas, or Emurgo but due to the size of the funds requested it would be great to see the in house experience available. The funds requested are broken down and the timeline seems accurate for the scope of the work but without knowing the experience of the team it is impossible to determine feasibility.", "q1r": 3, "q2": "A clear roadmap has been provided that can be followed and aids in audibility. The KPIs could use some refinement in terms of how much value the proposal is actually bringing to the ecosystem as a whole. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "KonmaSwap fournira un moyen facile de déployer des contrats intelligents sur la chaîne cardano et utilisera des outils de vente pour un processus d'ICO facile et plus encore.", "experience": "Konma Labz a participé à des hackathons menés par différents protocoles et projets. Il a également contribué à l'intégration de la blockchain dans plus de 15 secteurs."}