{"id": 384325, "author": "adilabd", "title": "Incrypture - Smart Structure", "url": "https://cardano.ideascale.com/a/dtd/384325-48088", "category": 26233, "amount": 50000, "description": "La titrisation répond à une inadéquation entre les besoins des prêteurs et des emprunteurs, mais la solution actuelle profite plutôt aux intermédiaires.", "funded": 1, "upvotes": 47280024, "downvotes": 11962984, "votes_result": 35317040, "votes_cast": 292, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=28723"], "media": [], "f6_assessments": [{"q0": "Ce projet fait partie du grand projet Incrypture du Fonds 7. L'équipe propose ce projet afin d'encourager la titrisation par des jetons qui bénéficieront directement aux emprunteurs, même les plus petits, dans les marchés en développement. La titrisation répond à une inadéquation entre les besoins des prêteurs et des emprunteurs, mais la solution actuelle profite plutôt aux intermédiaires. Le projet peut changer la donne dans le domaine du DeFi et conduire à une adoption massive du DeFi dans les marchés en développement. Ce projet est certainement celui à surveiller dans le Fonds 7 et peut générer un retour massif pour la communauté Cardano.\r\n", "q0r": 5, "q1": "Compte tenu de l'expérience combinée présentée par les membres de l'équipe, il est fort probable que le projet puisse être un grand succès. L'équipe fournit une feuille de route pertinente et demande un budget raisonnable. Le livre blanc fourni par l'équipe contient des explications techniques approfondies. L'énoncé du problème et la solution fournie correspondent et répondent tous deux au défi de manière efficace. La mesure du succès de ce projet est très raisonnable, mais il manque l'objectif de temps. Les autres inconvénients de cette proposition sont l'absence de ventilation détaillée du budget. L'équipe ne mentionne que le nombre total d'heures de travail du développeur mais ne donne aucun détail sur la ventilation des heures. Je suggère à l'équipe de mettre à jour la proposition avec des informations plus détaillées.", "q1r": 4, "q2": "Les critères de réussite fournis dans la proposition sont raisonnables et réalisables, ce qui rend le projet faisable et réaliste. L'équipe ne mentionne pas où elle publiera les progrès de l'exécution du projet, ce qui fait de son site web la seule source de contrôle ou d'audit du projet. Les critères de réussite sont pertinents et réalisables, ce qui rend le projet non seulement auditable mais aussi réaliste. Cependant, l'équipe peut améliorer l'exécution de ce projet en publiant le budget détaillé des dépenses sur le forum cardano afin qu'il puisse être audité par les membres de la communauté. Même avec tous les défauts de la proposition, il s'agit certainement d'un projet très potentiel qui doit être voté.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "(This proposal cannot be considered in isolation but the assessor should be aware of the team's other three proposals as well.)\r\n\r\nIf I understood correctly, the team has already developed C# software for Fannie Mae / Freddie Mac and now they would like to create the same Credit Risk Transfer solution but this time built on Cardano. This would essentially mean that huge government sponsored clients start using solutions built on Cardano. That's huge!\r\n\r\nThe solution is aligned with the challenge brief and can have a massive positive impact.", "q0r": 4, "q1": "The plan is written on such general level that it is a bit difficult to get into the nuts and bolts of it.\r\n\r\nThe team is highly skilled and experienced.\r\n\r\nThis Project Catalyst funding would help the team to build the MVP and later get further funding from other sources.", "q1r": 3, "q2": "There are no KPIs / metrics tracking the progress, only the outcome. This makes it a bit difficult to audit. As for the budget, it's quite realistic and the time commitment basically means that if both of their main proposals are funded, this will employ both the founders full-time for four months.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 21, "ne": 1, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The proposal brings a new kind of a Defi product to the Cardano stage which will bring researchers, developers and users together. ", "q0r": 5, "q1": "The credentials of the team are impeccable. The amount of research and patents behind them is staggering. ", "q1r": 5, "q2": "Once the proposers sufficiently confirm their identities, then this will be a large step forward transparency- and auditability-wise.  The budget seems plausible, however the breakdown of it leaves a bit to be desired. The project does not mention open-source, but they will allow for user feedback. ", "q2r": 3, "assessor": "z_assessor_832", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal has the potential of laying out the groundwork for a platform that could become a fantastic driver of Cardano DeFi. It's quite a preliminary effort, however; they're aiming just for a MVP, and success is defined as having one issuer and one user. ", "q0r": 4, "q1": "Experience of the team seems relevant, but it looks like they'd need at least some external developers that might be hard to find (Plutus/marlowe talent is hard to come by). The project timelines are quite aggressive, the plan only allows for a month of development and a month of testing before having a PoC to get user feedback. This does not seem particularly realistic, given the cutting edge technologies to be used. \r\nThe budget is very brief, and is only considering cost of developers, I assume the core team tasks will not be funded by this proposal, but it's not clear.", "q1r": 3, "q2": "There is one clear goal, that is hard to verify (one issuer/one user), and a very nebulous goal of having an \"MVP developed\". How would that look like? A smart contract deployed on the testnet? A number of mortgages securitized through it? A basic interface to set up on-chain securitization? ", "q2r": 2, "assessor": "z_assessor_941", "no_vca": 20, "ne": 4, "ng": 15, "nfo": 1, "vca_o": 1}], "solution": "La titrisation encouragée par la symbolique profite directement aux emprunteurs, même les plus petits dans les marchés en développement non desservis par Wall Street.", "experience": "Des mathématiciens, des informaticiens, des spécialistes de la finance structurée et un SPO qui ont négocié des titres adossés à des créances hypothécaires de manière intensive."}