{"id": 381003, "author": "dwayne", "title": "DAO-NET: Voting DApp", "url": "https://cardano.ideascale.com/a/dtd/381003-48088", "category": 26240, "amount": 49000, "description": "DAO Net proporciona uma participação incentivada significativa no ecossistema Cardano, porém requer uma carteira de voto Dapp fácil de usar.", "funded": 1, "upvotes": 84377037, "downvotes": 9211936, "votes_result": 75165101, "votes_cast": 329, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "As propostas desejam ter um Dapp que permita uma participação significativa no processo DAO-net - ou seja, votar e trabalhar com fichas. A proposta tem várias propostas interessantes no Fundo 7 que jogam bem umas com as outras, mas que podem ser vistas como propostas individuais no caso de nem todas serem votadas. A proposta faz um trabalho autônomo de explicação de como ela trará valor ao ecossistema cardano, fornecendo uma combinação entre muitas pessoas com o mesmo objetivo de trabalhar em colaboração, mantendo suas identidades em segredo. As principais métricas do propoesal são relevantes para o cenário do desafio. A proposta tem uma seção separada sobre como ela será capaz de enfrentar futuros desafios e escala. É muito detalhada e parece ser um exemplo a ser seguido por outras propostas. Não vejo faltando grande parte da proposta, mas há algumas áreas que podem ser melhoradas, como a quebra do orçamento. Esta proposta é como nenhuma outra que eu tenha visto, tendo em mente que já examinei mais de 50 projetos e li os títulos de quase todos eles. Esta é uma idéia muito interessante e inovadora. Como desenvolvedor, estou muito interessado nesta proposta e estarei aguardando a fase de votação para dar meu voto. Boa sorte para as propostas com este grande projeto.\r\n", "q0r": 5, "q1": "Os proponentes têm fornecido perfis interligados e têm toda a experiência necessária para cobrir o que é necessário para esta implementação e muito mais. Há um número definido de membros da equipe, mas há espaço para crescer e escalar, se necessário. Pessoas concretas e habilidades que devem ter para aderir a este projeto também são listadas. Isto traz credibilidade para o projeto. O orçamento está claramente delineado e dividido em itens confiáveis a serem executados. Há um calendário realístico e detalhado para levar o projeto a um final bem sucedido, mas não acredito que ele acabará nunca e mais como continuar crescendo a custo.  A proposta mostra um plano muito detalhado de execução, juntamente com uma seção muito específica relativa a toda a gestão de risco para muitos casos delicados, como a forma de preservar a anonimidade no DAO. O plano para a proposta e sua implementação é razoável dado o cronograma e os objetivos. A proposta poderia ter feito um trabalho melhor explicando os aspectos técnicos da mesma, mas não é tão grande coisa.  Mais importante ainda, o projeto fez algumas pesquisas sobre o que já foi feito e vai se desenvolver por cima. Em geral, uma boa proposta viável.", "q1r": 5, "q2": "O catalisador do projeto já tem requisitos de auditoria para alcançar marcos antes que os fundos sejam liberados, mas eu esperava que a auditoria da comunidade não se limitasse aos catalisadores do projeto. A esse respeito, há um reporte github ligado, para que qualquer interessado possa dar uma olhada dentro e acompanhar o progresso da proposta. A rastreabilidade é boa, pois haverá telegrama e engajamento discordante. As métricas mencionadas são relevantes para o objetivo final e para o sucesso do projeto. O roteiro e os marcos também são bem detalhados e fornecem um plano detalhado passo a passo para alcançar o sucesso. É fornecida uma descrição clara e compreensível, bem como uma explicação muito detalhada e a maior parte das explicações aplicáveis e práticas.  É claro que os proponentes se colocaram nos lugares dos eleitores e ouviram os comentários de seus membros da comunidade, porque esta é uma versão melhorada da proposta original. Boa sorte tanto para Dwayne quanto para Jude!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "O manifesto apresentado compreende claramente o desafio em questão e fornece uma solução prática para o problema da inexistência de um Dapp de votação confiável. O resumo da campanha é melhor dirigido a ele através desta solução. Além disso, o proponente deixou claro que o objetivo a longo prazo seria implementar uma carteira para as fichas DAO. Assim, aumentando a adoção e integração do Cardano, que é um dos principais requisitos do desafio. A proposta em sua totalidade poderia ter um impacto cósmico sobre o ecossistema Cardano e seu calibre. Por isso, eu tenho nota máxima em termos do impacto da proposta.", "q0r": 5, "q1": "Os detalhes do plano de ação e os possíveis desafios que a equipe pode enfrentar são intrigantes e estão de acordo com a idéia proposta. Os fundos solicitados também parecem práticos e razoáveis depois que se passa por sua avaria. Os marcos de fase e a restrição de tempo pela qual eles são planejados para alcançar também parecem ser sensatos. A única razão pela qual eu daria 4 de 5 pela viabilidade é que, embora o gerente de produto e o líder sejam muito talentosos e bem capazes de conduzir a proposta em direção ao sucesso, os membros irresolutos para preencher os sapatos de desenvolvedores de front-end e contribuintes de carteira de código aberto deixam uma sensação de dúvida em relação à implementação 100% bem-sucedida da proposta dentro dos prazos tentativos.", "q1r": 4, "q2": "Apesar dos membros da equipe não estarem em condições, o proponente não comete erros ao fornecer as métricas que os auditores poderiam usar para monitorar o progresso. A definição clara do sucesso e o roteiro instila confiança entre a comunidade em relação ao sucesso da proposta. O proponente também mostra sua intenção, vontade e paixão em alcançar o destino, fornecendo uma pequena síntese sobre a possível necessidade de fundos durante as próximas rodadas. Os 3 principais KPIs fornecidos na proposta estão em alinhamento com as métricas esperadas da campanha. O DAO sendo feito de código aberto e licenciado torna o processo de auditoria mais fácil e prolífico. Acredito firmemente que esta proposta tem todos os traços de ser um peso pesado neste desafio, uma vez que eles montaram uma equipe forte para preencher todas as lacunas.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is about creating a voting DApp that incentivizes meaningful participation in DAO Net processes, including a wallet for DAO token awards. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, suitable for the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of very active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. However, some members [Atala Prism Developer] and partners [Legal Firm, Tax Accountant] are not defined. After all, in my opinion, this is proof of feasibility from the team profile. The budget is clear and logical. Risk is very clearly defined with mitigation, and further analysis [this is very convincing, I think]. After all, based on the given information, I still strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links [profiles, resources, documents] for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "Integration and/or stand alone voting apps for DAO's if a need not yet filled. ", "q0r": 4, "q1": "The proposers however look to bolt this on to their own product and dont describe solution that could work with ANY DAO. I would however be a step in the right direction if a codebase was made for DAO voting and integrated with wallets (as they suggest), but would be better if it could be used by any DAO or easily modifiable to work on custom DAO's. The proposers have proposed DAO NET in another proposal however, so what happens if they dont build DAO NET? does DAO voting (this proposal) not work at all?, or can they adjust it to be less DAO contract specific, i.e., not only work with their DAO product? ", "q1r": 4, "q2": "I agree that this team has a good understanding and sets goals that can be measured, however my concern still lies in their budget for DAO contract code development. This particular proposal would be a good if it wasn't so DAO NET specific and made a suggestion to layer to improvements (if possible)", "q2r": 4, "assessor": "z_assessor_750", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Criar um DApp de votação que incentive uma participação significativa nos processos DAO Net, incluindo uma carteira para a premiação de fichas DAO.", "experience": "Uma equipe experiente de desenvolvedores Blockchain, pioneiros de Plutus, operadores de SPO, Conselheiros Comunitários e Analistas de Soluções."}