{"id": 381221, "author": "lley154", "title": "The Climate Change Lottery", "url": "https://cardano.ideascale.com/a/dtd/381221-48088", "category": 26240, "amount": 17000, "description": "A maioria das pessoas gostaria que fossem tomadas mais medidas para combater a mudança climática[1] mas isso precisa ser feito de uma maneira divertida e envolvente", "funded": 1, "upvotes": 31930700, "downvotes": 13230515, "votes_result": 18700185, "votes_cast": 235, "f6_no_assessments": 5, "f6_rating": 4.199999999999999, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=25125"], "media": [], "f6_assessments": [{"q0": "Gostei muito desta idéia e acho que ela dialoga muito bem com o objetivo do desafio. Em resumo, a idéia é criar um sistema de loteria, no qual as transações ocorreriam através de fichas e as recompensas seriam em ADA (que beneficia o ecossistema Cardano), e também converter metade do lucro de cada sorteio em árvores plantadas, favorecendo o meio ambiente. É muito positivo que o autor da proposta anexe um post no Medium (um site onde você pode criar uma espécie de blog, de forma prática), mostrando muito envolvimento com a idéia, que é mais detalhada lá. O que foi um pouco confuso para mim foi como este projeto seria hospedado, neste caso eu acho que seria através de uma aplicação web, mas eu gostaria que esta pergunta fosse enfatizada. Em geral, é uma proposta de alto valor que reúne duas questões muito relevantes: a conservação ambiental e o gosto pelo jogo, o que já notei ser bastante comum entre a comunidade criptográfica.", "q0r": 5, "q1": "O próprio autor parece muito experiente e tem uma sólida formação, sendo formado pela Universidade de Toronto em Ciência da Computação e tendo duas décadas de experiência, mas seria incrível se pudéssemos nos aprofundar em sua formação. Também podemos ver mais detalhes sobre sua carreira na parte final da proposta, onde ele incluiu seu perfil no LinkedIn, dando-nos a possibilidade de conhecê-lo mais profundamente. Sobre o resto da equipe, o autor afirma estar procurando profissionais para trabalhar com as partes de design, marketing e gerenciamento de aplicativos, o que é um pouco preocupante, pois o valor solicitado em financiamento é alto, então seria melhor se ele já estivesse com uma equipe formada. O ideal seria ter uma equipe que fosse devidamente apresentada, onde pudéssemos conhecer cada componente em profundidade e entender como cada um se relaciona com a idéia deste projeto, pois ele tem um caráter ambiental, por isso acho importante que os profissionais envolvidos também tenham um bom engajamento com a causa (não trabalhem apenas pelo salário...). O autor está preocupado em desvendar bem uma linha do tempo, para que tenhamos uma noção sólida e cronológica das tarefas que precisam ser feitas para alcançar o todo. E quanto à justificativa do valor do financiamento, aqui temos uma divisão de valores para as partes do projeto, mas senti falta de detalhes em algumas coisas e um grande detalhe em outras. Por exemplo, sobre a questão do marketing, o autor é muito específico ao explicar quais estratégias seriam adotadas para promover a aplicação, mas sobre a construção do projeto, uma espécie de identidade visual embrionária não é desenhada tão bem, ou seja, como se pretende construir a UI/UX. Portanto, acho que temos grandes pontos aqui e coisas a melhorar.", "q1r": 4, "q2": "Ao ter um plano de marketing extremamente detalhado, o autor deixa muito claro quais são suas intenções de alcançar o público com este aplicativo. Dessa forma, podemos ter uma prévia bastante sólida do que está por vir. Estes valores também são resumidos no final da proposta, assim como o que se pretende coletar no ADA e quanto seria convertido para plantar árvores. Uma coisa que eu pensava aqui era: Gostaria que pudéssemos ter um monitoramento mais próximo de como o plantio estava sendo realizado, um monitoramento do crescimento das árvores, uma prova de como este reflorestamento estaria impactando positivamente os ambientes. Outro detalhe seria onde este reflorestamento aconteceria, não está claro para nós, o autor meio que terceiriza esta parte da proposta para outra empresa, mas para mim é tão importante quanto a criação da própria aplicação. Seria incrível se o aplicativo tivesse este espaço dedicado para acompanhar o sorteio do posto, por assim dizer. Portanto, considero que a auditabilidade é boa, mas há algumas coisas a melhorar, a comunidade certamente teria certeza dos benefícios que receberia com esta proposta, mas a questão ambiental poderia ser mais enfatizada.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Esta proposta é uma grande idéia que cumpre os objetivos do desafio. Os modelos de loteria são definitivamente escaláveis e atraentes para muitas pessoas, tanto fora da cadeia quanto dentro da cadeia em outras cadeias. É ótimo que o modelo de loteria tenha como objetivo apoiar as atividades de mudança climática que é uma área chave hoje em dia no mundo todo e também compartilhar os valores de Cardano. A proposta articula claramente como irá agregar valor ao ecossistema Cardano tanto em termos de escala quanto em termos de posicionamento Cardano como líder no fornecimento de mitigação da mudança climática As principais métricas e objetivos da proposta se alinham com os desafios delineados.\r\n", "q0r": 5, "q1": "O proponente fornece provas de habilidades e experiência relevantes necessárias para implementar a proposta com foco na área de desenvolvimento tecnológico. Poderia ter sido bom mencionar qualquer expertise relevante para o gerenciamento de uma plataforma de loteria ou potenciais membros da equipe/conselheiros/ parceiros que tenham tal expertise. Por exemplo, em torno de questões legais relacionadas ao gerenciamento de uma tal plataforma. Também poderia ter sido bom alinhar-se com outros projetos sobre Cardano relacionados à mudança climática, como o projeto Veritree (como a verificação do destino do dinheiro e seu impacto também é de grande importância). O proponente afirma que ele precisa de alguns membros adicionais da equipe para entrar a bordo, mas ainda mantém uma questão em aberto se outras pessoas forem necessárias. É bom perguntar e poderia ter sido parte do processo de proposta, mas dentro da proposta, é bom ser o mais preciso possível sobre as necessidades.\r\nO orçamento é delineado claramente e dividido em itens identificáveis. É uma boa idéia dividir o orçamento em dois fundos e fornecer provas suficientes para a comunidade apoiar a fase 2 com base nos 3 KPIs mensais. O orçamento não inclui custos legais para estabelecer o DAO, por exemplo, bem como para trabalhar na governança do DAO, que será bastante importante para tal iniciativa.  Mais informações sobre o orçamento do desenvolvimento do aplicativo nos primeiros 3 meses teriam sido úteis, pois este é o custo chave (ou seja, como você chegou a $15k?). A proposta oferece um cronograma realista para completar o trabalho. Muito bem feito para o trabalho de desenvolvimento do Plutus e que na fase 2 o orçamento chave é para a tesouraria. Teria sido útil ter alguma estimativa da tesouraria até o final do ano e se eles cobrirão os custos operacionais e de desenvolvimento em andamento.\r\nO proponente não incluiu desafios e riscos relevantes para uma implementação bem sucedida. De minha experiência como empresário (20 anos) com atividades também relacionadas à mudança climática (trabalhando para uma ONG), há alguns desafios tanto na implementação quanto no impacto (mencionei alguns acima, ou seja, jurídico, equipe, verificação de impacto, Governança).  \r\n\r\nCom base em minha experiência, há bons detalhes sobre o processo e bons conhecimentos de desenvolvimento tecnológico, mas faltam ainda muito mais detalhes sobre a gestão do DAO e membros adicionais da equipe chave para dar mais confiança à viabilidade.  ", "q1r": 3, "q2": "Os resultados e o cronograma para os primeiros 3 meses são claros e mensuráveis.  A divisão do financiamento para o Fundo 7 e 8 dará à comunidade a oportunidade de avaliar os resultados e decidir se deve continuar e apoiar o Fundo 8.  Ao analisar a proposta, no entanto, não está claro quando é a data de lançamento e muitos KPIs específicos chave serão verificados 3 meses depois desta data.\r\nComo o software será licenciado sob uma licença de código aberto e pode ser usado como modelo para outras loterias potenciais construídas em Cardano, ele dará à comunidade visibilidade sobre a qualidade do código (ainda precisa entender mais sobre os termos da licença). Ter uma equipe, ou estar ativo na comunidade pode aumentar a confiança para auditar a proposta e eu recomendaria que você a considerasse para a aplicação do Fundo 8. Como mencionado, ao dividir o orçamento em dois fundos, você dá à comunidade a oportunidade de avaliar o produto a ser entregue.", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 17, "ne": 10, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This is a very original idea to a problem that is getting complicated to solve in our world. The project will be a decentralized application so this addressess the challenge.", "q0r": 5, "q1": "The proposer has a lot of experience, studies and seems to be ready for the proposal but still seems to need some people for the project. The plan is not presented, he should write how to implement the platform and the phases that he is going to follow.", "q1r": 3, "q2": "Timeline and targets to achieve are provided but where are the KPIs described as measurable properties? He provides how the success will look like in term of targets but it would be nice to have increasing targets.", "q2r": 3, "assessor": "z_assessor_432", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal has a very noble cause and represents what Cardano stands for. The open-source nature of the project will also provide avenues for more such lottery systems which is a viable and sustainable business model. Therefore the proposal is effectively addressing the challenge. \r\n", "q0r": 5, "q1": "The proposal is straightforward and simple. It has been clearly articulated. The proposer has more than 20 years of experience in software development and with an enthusiasm for Cardano. With these credentials, it is highly likely that the proposal will be implemented in earnest. ", "q1r": 5, "q2": "The proposal is for building and operating an open-source lottery system which will contribute 50 percent of the rewards for the fight against climate change. The project will result in creating an open-source lottery code for 17 thousand USD. The amount is very reasonable and it is like improving the smart contract codebase in Cardano. The proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This is a simple and fun idea that due to the good PR and trending nature of climate action promises to boost Cardano's reputation as a green blockchain, create mass appeal for its use and attract new eyeballs to the ecosystem. While gambling and lottery may not be allowed or viewed favorably in all jurisdictions, they are an effective way to raise funds and could be carried out with much lower overheads and operating costs than off-chain.", "q0r": 5, "q1": "The github profile and repository, information about the proposer and unclear wording about whether the Plutus Pioneer program was finished successfully make it difficult to assess the experience and skill of the proposer. The proposal itself is thoughtfully worded and backed up by well-chosen performance metrics and milestones. ", "q1r": 3, "q2": "This $17K in ADA proposal presents a much deeper analysis of its costs, risks and milestones than many proposals requesting $50K or $100K so I give the proposal 5 stars for their impressive presentation and thoughtful due diligence.", "q2r": 5, "assessor": "z_assessor_692", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Incentivar as pessoas a agir através da criação de uma loteria onde 50% das recompensas vão para o combate à mudança climática", "experience": "Mais de 20 anos em desenvolvimento de aplicações web, graduado em ciências da computação na Universidade de Toronto e inscrito no programa dos pioneiros do plutus 2ª coorte"}