{"id": 381393, "author": "valerio.mellini87", "title": "DeFi tools for Content Creators", "url": "https://cardano.ideascale.com/a/dtd/381393-48088", "category": 26240, "amount": 10000, "description": "O carma é orientado aos Criadores de Conteúdo para ajudá-los a financiar e estruturar sua vocação.", "funded": 1, "upvotes": 37298570, "downvotes": 6549748, "votes_result": 30748822, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "O proponente quer construir uma plataforma onde os criadores de conteúdo possam interagir com seus seguidores de uma nova maneira mais interativa. Falta a declaração do problema, mas eu implicitamente entendi a idéia e é uma boa idéia que se enquadra no desafio em que se encontra. Acredito que este tipo de plataforma se tornará um lugar comum no futuro, como já ouvi idéias semelhantes antes, mas esta é a primeira proposta real. Trazer pessoas criativas, como criadores de conteúdo, trará muito ao ecossistema. As métricas estão de acordo com o cenário de chellenge da proposta. Não estou muito certo sobre a escalada do projeto tão facilmente, uma vez que o trabalho é feito por um develador neste momento. IMHO a proposta carece de uma equipe, porque a idéia é construir muito conteúdo e não foi mencionada a reutilização do esforço de outros membros da comunidade. A proposta vai absolutamente acrescentar algo que falta ao ecossistema, ou seja, mais criadores de conteúdo e seus seguidores, o que é eficiente para o crescimento de uma comunidade.  No geral, é uma proposta decente e eu gostaria muito de vê-la ter impacto na comunidade.", "q0r": 5, "q1": "O proponente forneceu um vínculo com sua acocuntaria e ele tem as habilidades necessárias para realizar tal tarefa, mas o tempo será um problema neste caso. Entretanto, o fato de ele estar por trás de seu projeto com seu nome faz com que o projeto se sinta mais real e traga credibilidade. Valerio tem uma idéia da equipe que ele precisaria reunir para levar a proposta ao seu sucesso, mas acho que ainda não encontrou as pessoas. Uma coisa que acho estranho é que ele mencionou a necessidade de mais fundos se ele tiver que contratar pessoas (o que seria ótimo neste caso), mas ele não parece planejar fazer isso, pois não pediu este orçamento e sim planeja trabalhar por conta própria. Embora isto seja nobre, não é o melhor para o sucesso. O orçamento poderia usar um pequeno desdobramento como uma taxa horária e uma estimativa de trabalho. Não tenho certeza se o horário estabelecido é realista ou não para que uma pessoa o faça.   A proposta pinta um mapa realmente claro sobre a tokenômica do projeto, algo que não é visto com freqüência e que vale a pena ser elogiado. O proponente mencionou desafios sensatos como encontrar criadores de conteúdo enquanto se mantém competitivo com outras plataformas, o que é novamente difícil para uma única pessoa fazer. Minha sugestão para o proponente seria dar uma olhada nas ferramentas que a comunidade já construiu e reutilizá-las para acelerar o processo de desenvolvimento e concentrar-se em encontrar contratos com os criadores de conteúdo. Em geral, não tenho certeza se esta proposta é viável, mas encorajo o proponente a procurar uma equipe e tentar novamente para a próxima rodada de financiamento!", "q1r": 3, "q2": "A traçabilidade do projeto não é mencionada na proposta. Não vi uma forma de a comunidade acompanhar o desenvolvimento ou o progresso do projeto. Eu sugeriria com base no que outras propostas estão fazendo para ter um telegrama ou um canal de discórdia. Isto ajudará a encontrar futuras pessoas com quem trabalhar, assim como criadores de conteúdo e simplesmente seguidores para o projeto em um só lugar. Os KPIs parecem relevantes, mas não há nenhuma métrica mencionada para medir esses KPIs. O roteiro é suficientemente simples e os marcos são relevantes para o projeto, e eu difiro para o autor para a estimativa de tempo. A proposta poderia ter tido uma melhor descrição do problema visado, mas a declaração de solução parece sólida e compreensível.   Em resumo, os catalisadores do projeto têm uma maneira de verificar o progresso do projeto antes de liberar fundos, mas IMHO o proponente deve permitir que a comunidade acompanhe o progresso do projeto também.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Esta idéia está em perfeita harmonia com o objetivo principal do desafio. Aqui, a intenção é criar um Dapp, onde pessoas fora do universo da cadeia de bloqueio possam, como o autor cita no início da proposta, mentir e manipular as atividades nativas sem maiores dificuldades. A diferença aqui seria uma interface muito \"amigável\", como ele a descreve, acredito que seria então uma plataforma ergonômica e fácil de entender; além disso, o Dapp não está 100% focado em um tipo de público, haveria criadores (que podem ser pessoas ou pequenos grupos) e apoiadores. Desta forma, o público alvo seria diverso e, com a facilidade de manuseio de fichas e NFT, Cardano certamente se beneficiaria muito, alcançando plenamente o que este desafio propõe. É muito positivo como o autor descreve para nós o que cada ator (criador ou apoiador) poderia fazer, quais seriam as principais atividades em ação no Dapp, dando-nos uma sólida compreensão do que se trata esta idéia e como ela aconteceria na prática. Acredito que é uma proposta de alto valor e que trará impactos positivos para nossa comunidade.", "q0r": 5, "q1": "A descrição sobre o autor é muito curta, ele poderia ter escrito um pequeno texto que explica, além de suas funções de trabalho, algumas experiências e projetos anteriores nos quais ele participou. Essa lacuna é preenchida, porém, quando ele nos fornece seu perfil de linkedin; mas acho que o ideal seria ter uma apresentação mais detalhada e também o linkedin. No final da proposta, o autor menciona os outros profissionais que trabalhariam na equipe, mas pelo que entendo ele ainda não tem pessoas definidas, estes profissionais ainda seriam contratados. Seria melhor, transmitiria mais segurança, se ele já tivesse uma equipe formada, mas como não é o caso, sugiro que esta contratação seja feita com base em muita pesquisa e quando a equipe é formada há algum tipo de reunião com o resto da comunidade, a fim de apresentá-la. O autor não incluiu ninguém no team building para promover a Dapp, como se daria a publicidade? É importante que este projeto seja amplamente divulgado, pois seu principal objetivo é facilitar a vida das pessoas no que diz respeito à gestão dos nativos, mesmo aqueles que não são da nossa comunidade, especificamente. O autor apresenta um roteiro, um passo a passo a ser seguido a cada 3 meses, podemos saber o que ele quer alcançar em cada período de tempo em geral, pois não há muitos detalhes. E em relação à divisão de financiamento, os detalhes são satisfatórios, sabemos para onde vai cada parte do dinheiro solicitado. Mas o valor é basicamente dividido entre os salários dos envolvidos, não está pensando, como disse antes, em nenhum plano de marketing, mais do que o necessário para o sucesso da proposta. Portanto, sugiro que estes detalhes sejam revisados a fim de elevar ainda mais o nível da proposta.", "q1r": 3, "q2": "O autor nos apresenta alguns KPIs que são, em resumo, o número de usuários da aplicação e a quantidade de fichas que seriam criadas/circuladas. Entretanto, como se trata de um projeto muito complexo e caro, creio que seria mais apropriado que houvesse um monitoramento mensal. Assim, é necessário que o autor estabeleça metas mais específicas para passar a cada mês, seria ainda melhor se ele olhasse o trabalho a ser feito em menor escala e fornecesse detalhes; por exemplo, no primeiro mês, o que você faria por semana? Como poderíamos fazer uma auditoria além disso? Talvez, eleger alguns membros preparados da equipe para acompanhar de perto o progresso do projeto, todas as fases de seu desenvolvimento. Portanto, acredito que sim, o autor nos fornece conteúdo para trabalhar a auditabilidade, mas por causa do projeto, sinto que há uma necessidade de conteúdo ainda mais detalhado e específico que possa ser monitorado periodicamente, com os resultados desta análise chegando à atenção do resto dos membros da comunidade.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "There are a large number of content creators who could sell NFTs,royalties and fan tokens if the technical threshold to create, sell NFTs and present NFTs are made userfriendly. This proposal is aiming to address this important issue and more such experiments are required to create a user-friendly NFT world. Therefore it can be said that the project is addressing an important challenge in the ecosystem. ", "q0r": 5, "q1": "The proposer has five years of experience in software development and good academic background as seen from his LinkedIn profile. The proposer also has to onboard a Plutus developer for the development of smart contracts which have to be included in the site. The proposal is for creating a site that will enable minting and selling of tokens on Cardano easily. This can be used by content creators and others to raise funds for their enterprise or work. The proposer should be able to implement the project successfully.", "q1r": 5, "q2": "The fund requested is in alignment with the task in hand and seems a reasonable estimate. The project has economic sustainability and may bring value to the ecosystem in a reasonable time if successful. The project has well defined achievable task. Therefore the project is assessed as auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "The proposal includes a nice dapp overview and the github wiki link provides solid content but the proposer does not include any in depth technical documentation on their dapp/plan to get to MVP. ", "q0r": 3, "q1": "Usually the dapp technical design and team development comes before funding requests, odd to see it in reverse here. 3/5 because the proposer has a solid well built github wiki/team development plans mentioned in proposal. The proposer has technical plutus development experience.", "q1r": 3, "q2": "The proposer goes into strong detail in the github wiki, less so in the proposal budget/roadmap sections. Still so for the development of an MVP this proposal is solid.", "q2r": 4, "assessor": "z_assessor_826", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The Karma solution is a unique dApp for content creators and consumers and effectively addresses the dapp challenge.", "q0r": 5, "q1": "The main developer of this project has a Cardano background receiving the Emurgo developer certification. The Github link contains good details on the technical components of the system. ", "q1r": 5, "q2": "The information provided in this proposal is sufficient and includes a roadmap, GitHub Wiki, budget, KPIs, Risks and a initial product feature set. ", "q2r": 5, "assessor": "z_assessor_828", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "A missão consiste em produzir ferramentas para criadores de conteúdo e freelancer para obter fundos e fazer valer suas marcas com tokenomics", "experience": "- Arquiteto de software em microserviços e arquitetura em nuvem com mais de 5 anos de experiência\n- Certificação Emurgo Cardano Developer Associate"}