{"id": 381658, "author": "didnkallaehawe", "title": "Decentralized Bees Delivery System", "url": "https://cardano.ideascale.com/a/dtd/381658-48088", "category": 26240, "amount": 21000, "description": "A maioria dos sistemas de entrega hoje em dia nos países em desenvolvimento, como a CMR, são centralizados e não aproveitam as vantagens oferecidas pelo contexto local.", "funded": 0, "upvotes": 14662522, "downvotes": 16876212, "votes_result": 2213690, "votes_cast": 142, "f6_no_assessments": 6, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal suggests to change the system of pickup-points to dropoff-points by using the public transportation infrastructure. An intriguing insight that might work if the buses can process this volume. ", "q0r": 4, "q1": "This proposal has been submitted by a WADA-hub in Cameroon. WADA has an extensive trak record of successful operations in Africa. Disagreement on the feasibility of this proposal as implementing a DID for this many people alone would supercede the requested funds by far. ", "q1r": 2, "q2": "'***More details coming soon!!!' unfortunately did not come this Fund. So at this time all there is to assess is a basic outline of the general plan. Looking forward to when it is completed with a roadmap and especially funding breakdown explaining how implementation of a DID on a mass scale and the creation of the payment interface would be done. ", "q2r": 1, "assessor": "z_assessor_113", "no_vca": 29, "ne": 3, "ng": 24, "nfo": 2, "vca_o": 1}, {"q0": "A real problem is identified which is lack of courier services in Cameron as we know it in developed countries. This proposal describes a great solution of integrating blockchain and DID as a means to promote a better service, a bit like a Uber for package deliveries.  This fits well within this challenge, and would be a great use case of Cardano.", "q0r": 5, "q1": "Unfortunately this reads more like a concept than a executable proposal. 90% of the proposal is just describing the problem. The proposer describes briefly what steps are required but there are really no details on the How to achieve these or on any of the technical and logistics aspects. This would be a huge project, and each of the 4 steps you describe could have their own proposal. I would suggest creating a proposal focused on the first step - \"Build a decentralized ID system for governance and delivery reputation management\". There's also not much information on the team, their skills and experience, so adding some CV's and examples of previous projects would add re-assurance. There is also no timetable or budget presented.", "q1r": 1, "q2": "As mentioned above, there are some very broad steps mentioned and the order of these make sense, but there are no milestones or timings attached to these. There are also no KPI's mentioned, this would be things like Number of packages delivered using service 3 months from launch.", "q2r": 1, "assessor": "z_assessor_125", "no_vca": 28, "ne": 6, "ng": 19, "nfo": 3, "vca_o": 1}, {"q0": "This proposal problem statement and solution are aligned with the challenge. \r\nThis proposal also clearly articulates how it will add value to the \r\nCardano ecosystem by increasing transaction on the network and boarding their local community with the delivery system app. \r\nHowever, the key metrics and goals of this proposal are unclear. Please elaborate more on the goals of this project.\r\n", "q0r": 3, "q1": "The proposer fails to provide evidence of relevant skills and experience needed to implement the project. Moreover, the proposer did not specify the required manpower and resources to successfully implement the project. Furthermore, the budget presented is not outlined clearly and broken down into identifiable terms. Therefore, it is hard to assess whether the requested funds are reasonable to achieve the set goal.\r\nFurthermore, this proposal did not provide a sensible and conductible plan for implementation. ", "q1r": 1, "q2": "This proposal did not provide a roadmap with milestones and a time horizon for achievement. Moreover, the proposer did not provide key metrics and KPI that define the success of the proposal. \r\nIn addition, the proposer did not provide any information for the voters to keep track of their progress. Therefore, the information provided is not sufficient to audit the progress and the success of the proposal.", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 22, "ne": 0, "ng": 12, "nfo": 10, "vca_o": 1}, {"q0": "Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects.  In addition to this, I learned some programming during my university studies, so I can comprehend the basic ideas behind a lot of the technical details. This proposal seems like an unfinished duplicate of the bees delivery system proposal by the same proposer that was forgotten to delete. Please delete or in case deleting it is forgotten: @Voters: Please vote against. There is a really well-made version of this proposal in another challenge that I can fully support, but it makes no sense to vote for the same proposal twice.", "q0r": 1, "q1": "This proposal seems like an unfinished duplicate of the bees delivery system proposal by the same proposer that was forgotten to delete. Please delete or in case deleting it is forgotten: @Voters: Please vote against. There is a really well-made version of this proposal in another challenge that I can fully support, but it makes no sense to vote for the same proposal twice.", "q1r": 1, "q2": "This proposal seems like an unfinished duplicate of the bees delivery system proposal by the same proposer that was forgotten to delete. Please delete or in case deleting it is forgotten: @Voters: Please vote against. There is a really well-made version of this proposal in another challenge that I can fully support, but it makes no sense to vote for the same proposal twice.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "The issues in this proposal are clearly presented and an excellent solution is offered. Constructive questions were asked in the comments and suggestions were given on how to improve the proposal itself, but unfortunately no one responded to any of the comments. If such a project were to be implemented, it would definitely have an impact on the people living in Cameroon, but also on the Cardano ecosystem. To improve the lives of Cameroonians, the value of the Cardano ecosystem itself would grow. Because there are no KPIs, it's hard to compare KPIs with challenge setting.", "q0r": 1, "q1": "It would be good to have an insight into the team of people who will realize this idea. Proof of existence, experience, skills via LinkendIn, Github is necessary. The budget is reasonable and it is clearly specified but we have no insight into what exactly it will be allocated. There is a detailed implementable plan but missing details of actionable tasks and order of execution. Unfortunately, time frames for the implementation of this plan have not been set to complete the work. The plan describes the resources necessary to implement the proposal but does not describe how it will be reported on technical aspects such as architecture, language and technologies. This propsal does not mention possible risks or how to address them.\r\n\r\n", "q1r": 1, "q2": "It would be good to have a roadmap with milestones and KPIs to track the progress of this project", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "I appreciate the clear and simple explanation of the problem in Cameroon - certainly this should be solved and is a great opportunity to use blockchain to help people improve quality of life by not spending it en route or returning home from package pick-up. It also seems that a system like you are envisioning could be easily replicated, create jobs and improve environmental and economic circumstances in those communities. ", "q0r": 3, "q1": "It seems that the team has a strong understanding of the problem and that the list of action items would begin to build a solution. While the problem is clearly outlined, and an idea for the solution presented, the solution needs a lot of explanation and robust details in order to consider it feasible. The proposing team would do well to add a breakdown of budget explaining how they came to the total, a timeline for implementing the solution and a set of criteria by which they will evaluate themselves and open themselves to external critique. Some of the deliverables could include the build of the app, development of the appropriate relationships with current delivery entities, sparking of new connections with potential delivery personnel, evaluation of routes and needs, etc. ", "q1r": 1, "q2": "As the feasibility section is lacking, the audibility section is subsequently not sufficient to support this project as ready to go. If the proposing team takes the time to outline the timeline, budget and strategy for solution at the same level that they have outlined the problem in Cameroon, surely there will be a greater success in being able to march forward in improving the daily lives of citizens there and beyond. This should be encouraged, as developing an appropriate solution for this need could be well extrapolated in other communities. ", "q2r": 1, "assessor": "z_assessor_856", "no_vca": 18, "ne": 2, "ng": 15, "nfo": 1, "vca_o": 1}], "solution": "Construir um sistema de entrega descentralizado que aproveite os moto-táxis e ônibus intermunicipais para criar um sistema mais eficiente para todas as partes interessadas", "experience": "Wada Cameroon Hub: 3 arquitetos e desenvolvedores de software sênior"}