{"id": 381646, "author": "oswald", "title": "Interaction with blockchain", "url": "https://cardano.ideascale.com/a/dtd/381646-48088", "category": 26240, "amount": 20000, "description": "Na África, comprar, vender, trocar os criptos, NFTS ... continua uma preocupação descuidada e carrega um freio na adoção", "funded": 0, "upvotes": 14606923, "downvotes": 18493204, "votes_result": 3886281, "votes_cast": 144, "f6_no_assessments": 6, "f6_rating": 1.5555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "Penso que a proposta é de muito pouca importância para o ecossistema Cardano e para o próprio desafio do DApps & Integrations. Sim, o BCoin é uma nova coing. O BXchange é uma nova troca de calouros. Sim, há um white paper. O livro branco afirma especificamente que \"BRYO Xchange Coin AKA Bcoin é o símbolo que será usado no ecossistema do BRYO Xchange. Seu contrato inteligente foi projetado com os atributos da cadeia de bloqueio Ethereum e foi implantado no BSC (Binance Smart Chain) para ligar as trocas dentro do BRYO Xchange e muito mais\". Ok, então - desde o início - vemos que a plataforma BCoin não é uma plataforma Cardano nativa. Entendo que algumas novas abordagens poderiam ser usadas (fichas embrulhadas? protocolos de ponte?... mas nada está em pedra aqui). Na verdade, o livro branco não menciona Cardano em nada. Então há alguns elementos relativamente amadores no site da bolsa. Por exemplo, ao responder a pergunta \"Por que não vou perder esta pré-venda?\". (da ficha BCoin), o site declara: \"Você deve absolutamente participar desta pré-venda porque depois desta última, o preço da Bcoin aumentará consideravelmente e sua chance de ganhar será muito baixa. Além disso, as pessoas querem ganhar dinheiro. Mais prospectivo é o projeto, numeroso é o uso do token no sistema e maior é a chance de aumentar o preço\"... OK, vamos lá, essa é a utilidade? A única menção de Cardano na proposta é a seguinte frase: \"-Compatibilizar o Bcoin com outras cadeias de bloqueio (Cardano Ethereum ...) para acelerar sua adoção\". No entanto, não vejo um plano para isso. Portanto, a proposta precisa de mais ajustes a fim de visar diretamente as principais questões deste desafio: Nossos esforços conseguiram atrair os usuários para a plataforma [CARDANO]? Nossos esforços resultaram em aplicações novas e viáveis construídas sobre a plataforma [CARDANO]?", "q0r": 1, "q1": "A viabilidade é um animal completamente diferente do Impact. Sim, o impacto de uma proposta pode ser baixo em um desafio, mas a viabilidade pode ser muito alta. O que significa que sim, pode ser implementado facilmente e é provável que isso aconteça. Portanto, embora eu tenha pontuado o impacto como baixo - podemos ver que esta proposta pontua alto para Viabilidade. Infelizmente, não tanto neste caso. A solução proposta é mais parecida com uma lista de desejos e o verdadeiro nível de conclusão é apenas descrito em palavras. Um link para uma demonstração do Exchange V1 [ https://xchange.bryocorp.com/demofiat.avi ] não estava funcional quando tentei abri-lo. Uma das explicações não fazia sentido: [Exchange V1 e a plataforma de e-learning já estão pouco desenvolvidas de acordo com nosso roteiro]. Não tenho certeza do que significa \"já subdesenvolvido\" neste contexto. Então há muitas referências à África como continente e referências a alguns países sem nome [\"Nosso Token está no ico, e as pessoas compram diretamente de seu celular com moedas locais de 5 países da África através de nossa ferramenta de pagamento\"]. No entanto, cabe a nós procurar esses países específicos (não os encontramos) - e como sabemos, as trocas criptográficas são reguladas a nível nacional, não a nível continental. Eu aconselharia os proponentes a serem muito claros sobre os mercados que eles estão visando ou servindo, para que o sucesso da proposta possa ser posteriormente auditado. O uso proposto do orçamento de US$ 20.000 parece ser aleatório e muito geral: \"80% para acelerar o desenvolvimento do ecossistema e para a brigada Bcoin com outras cadeias de bloqueio\" e os \"20% restantes serão utilizados para a comercialização em torno do projeto e para o crescimento da comunidade\". Isso parece estar presumindo muita confiança em uma equipe que ainda tem que provar seu know-how técnico no ecossistema Cardano. Além disso, já existe um BCoin (Rank #2819) em https://coinmarketcap.com/currencies/bombcrypto/. É a abreviação de Bombcrypto. É a mesma moeda? Se não, haverá problemas? Vi BCOIN na troca que você incluiu [https://info.bankcex.com/project-list.html] Menciona que o projeto foi submetido em 25 de novembro de 2021 e tem um suprimento total de 1.100 [embora seu próprio site mencione um TOTAL DE FORNECIMENTO\r\n16.000.000]. Presumo que o fornecimento seja de 16 milhões. Seu site de câmbio afirma que \"O BRYO Xchange permite que você converta suas moedas criptográficas em moedas locais e estrangeiras em todas as partes do mundo\". - no entanto, não vejo onde está baseado o BRYO Xchange e onde estão seus dados oficiais de registro. Os únicos contatos são e-mail e um grupo de telegramas. Quem fará o KYC e tem um acordo de parceria com uma empresa KYC concluído?", "q1r": 2, "q2": "Há coisas boas sobre esta proposta. Tentar melhorar o acesso ao comércio de criptos e NFTs nos mercados africanos. Isso é um desure digno. Entretanto, a África (como todos os outros continentes) tem limitações específicas regulamentares e infrastruturais e de mercado que diferem de país para país. Para que os proponentes atinjam seu objetivo - eles têm que ter um projeto bem direcionado que supere essas barreiras. Se eu entendo bem, esta é uma proposta para algo parecido com um Binance for Africa com uma moeda Binance para uso na troca. Parece haver muita coisa acontecendo aqui em termos de ambição, o orçamento é relativamente pequeno para tal ambição (US$ 20.000) e a ligação com Cardano é muito discutível e distante no horizonte. Penso que será relativamente difícil auditar a proposta na sua forma atual. As métricas e os KPIs não são precisos. Por exemplo: \"Lançamento da troca v1, que facilitará muito a adoção de moedas criptográficas nos países africanos que cobriremos com nosso sistema de pagamento \"fiat\" (moeda local)\". Soa bem - até pensarmos no fato de que não sabemos quais países estão sendo visados. Mais uma vez, \"-Lançamento da plataforma BLearn e-learning\" - soa bem até pensarmos que não sabemos sobre o que é a plataforma BLearn. OK, sim - a equipe afirma que o Blearn deve ser: \"Uma plataforma de e-learning totalmente descentralizada e segura para facilitar o acesso ao conhecimento de campo\". Mas isso apenas abre uma nova lata de vermes. O que é uma \"plataforma de e-learning totalmente descentralizada e segura\" e por que uma troca centralizada e uma moeda criptográfica precisam de uma \"plataforma de e-learning totalmente descentralizada e segura\" - por que esta parte está focada especialmente na segurança e na descentralização? O que há de errado com uma plataforma de e-learning centralizada que tem um escopo restrito? Então, o projeto parece estar entrando em muitas tangentes ... com muitas declarações e aspirações ... e o orçamento não parece corresponder.", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "There's no correlation about the problem and proposer's solution. This proposal is trying to get funding then develop their BRYO xchange coin (or they said BCOIN) with their planned ecosystem. I don't really understand what they wanna bring to provide the most value for end users in 2022 in Cardano blockchain. I read BCOIN whitepaper v2 and it explanation makes me confused. Whitepaper explained all the basic of cryptocurrencies but I found no correlation at all. There's no proof this \"Bryo xchange\" is developing in Cardano.", "q0r": 1, "q1": "The website have Team Members section with some link to LinkedIn profile, but the profiles they linked seems look kind of suspicious. Example: CEO start working at February 2021 with no other experience, some members also not add their latest job at Bryo on their LinkedIn profiles.\r\n\r\nBudget are broken down generally. Proposer asked for $20,000. 80% (means $16,000) will be used to accelerate their ecosystem and for the Bcoin brigde with other blockchain, but with no detailed what will they working on first or later. If the proposer want to build bridge to other blockchain, it means Bcoin have their own blockchain. There's no link to proof their blockchain are exist. Better to detailed down the budget, so the community can audit this project easily.", "q1r": 1, "q2": "Proposer written the timetable in their website, but there's some typo with all of the roadmap. For example April 2021 = Q1, Januari - May 2022 = Q1 2022. I assume the team behind this BCOIN projects are not aware with this typo thing. Author explained in their Whitepaper V2, but it's too basic for a whitepaper. KPIs or key metrics are rewritten roadmap. Better put some relatable key metrics the team will working on.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This ecosystem is necessary for helping the situation that the team mention in the problem, it can help boost more adoption in the Cardano ecosystem too. But they should provide much more info to show their plan. For making an impact with the challenge, the team should have some key metrics that align with the challenge given, they can refer to the tab \"about\" of the challenge, then write down some word to explain why their idea impact or bring value to Cardano ecosystem. This proposal has none of those. ", "q0r": 1, "q1": "The team should provide more detail about the implementation plan than just a few words about features and outline what needs to do.  For getting a high assessment on feasibility the team must show how good their ability on implementing the project is. A detailed implementation plan for their solution in this scope can be coding features in the ecosystem, launching plan, marketing activities... they're something that the team should consider and well explain to convince Catalyst community. \r\nGood thing is that the team provided an demo, e-learning platform that is in scope of whole project. But for all of them, they lack a detailed roadmap that help CA/ vCA assess whether the required budget is reasonable or not. \r\n", "q1r": 3, "q2": "We can't audit this proposal because there is nothing for it. They have outlines of what steps they will do, but I don't think it's a roadmap. \r\nFor info, the team will have to report regularly to Catalyst their progress, hence, the team must provide a roadmap and key metrics for CA/ vCA assesses that are available to audit this project. And the key metrics must be aligned with the challenge given as first, they don't have it, too. \r\nOne more thing is the team must describe how they are aware of the problem context by detailed explaining it, then detailing the solution that must address those problems. If not, it will be hard for everyone to understand what the team wants to do and is it helpful or not. This means the proposal can get a low scoring in all three-part: impact, feasibility, auditability.", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The solution in this proposal is making an ecosystem that helps facilitate interactions with blockchain that address the problem, is within the challenge, but the proposal doesn't have basic things for assessing the impact: \r\n- Explanation about how it will add value to Cardano ecosystem, this help convince CA/ vCA and voter to easily clear the impact of the project on the ecosystem\r\n- Key metrics that align with the challenge setting, it will show how the project will affect the ecosystem by specific criteria. ", "q0r": 2, "q1": "This proposal has some referral links to show their done work including: \r\n- Demo\r\n- Platform that they say it's finished 50% without evidence\r\n\r\nThen it lacks all the basic things for assessing the feasibility. Include: \r\n- Detailed roadmap to help CA/ vCA know its milestone and summery things to do or finish at this time. \r\n-> All it has there are outlined steps to do without explanation. \r\n- Detail implementation plan with a detailed explanation about features, actions, activities of the plan. This will help to assess all other parts in the proposal are suitable or not. \r\n-> The proposal only has features descriptions. \r\n- Detailed budget that should be pointed which/ who it will be used for. Based on the plan, it will be assessed reasonable or not to be funded and help voters make decisions on voting. \r\n-> In this proposal, the budget is 100% nonsense. \r\n", "q1r": 2, "q2": "The proposal doesn't have the basic things for auditing, including: \r\n- Roadmap with a detailed and realistic timeline, its outline about the steps is nonsense because doesn't have a timeline. More detail will help Catalyst team easier on track and check the project regularly, currently, the project team has to report in biweek. \r\n- Key metrics that are clear and fittable with the plan and vision of the team, of course, must be aligned with the challenge setting. \r\nAnd 2 explanation to help Catalyst team easy understand what the proposal want to do: \r\n- Problem explanation, should be in case studies, context that the team has been aware and motivated to make the proposal.\r\n- Solution explanation, to explain detail about how the solution can help to solve the problem. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This proposal just has a few outlined features with poorly brief and simple steps to do that cannot be named as a plan. It has no impact on the Cardano ecosystem because they have no info to tell that what value their project adds to the Cardano ecosystem and all of these infos are common, and key metrics to make sure that they are concerned about the challenge setting. ", "q0r": 1, "q1": "The proposer showed only some outline brief about the features, some attach a link to the demo, this project has whitepaper in their website... those some info can't help I figure out what they gonna do in the future after being funded. \r\nThe roadmap the proposer showed in the proposal is just some outlines that have no timeline and are without detail, I think can't help to track anything. \r\nMoreover, the budget breakdown and explanation are so confused. If that budget for development, at least they have to clear those amount of money will be used for how long (hour/ day/ week/ month) ", "q1r": 2, "q2": "The proposer does provide not enough info that's sufficient to audit the progress and the success of this project. He has no detailed roadmap and key metrics, that's the basic things for auditing the project. \r\nMoreover, because the content in the proposal is poorly explained about what he want only, all only feature brief, so I can't understand in detail the problem that the propopser wants to solve and their solution can address it or not. Of course, there is no risk management that is included in this proposal also. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The problem stated by this proposal is a brake to Cardano adoption, caused by a difficulty in interactions with blockchain. The team does not provide a very detailed description of the problem to be solved, and at the same time the plan describes a very wide range of tools as a solution.\r\nThe plan includes a very wide list of modules planning to be developed (exchanges, crowdfunding platform, e-learning platform, a tool to create NFTs and tokens) :  there is no clear description on what impact is expected from each part of the project, and no Kpis. The added value of each part to Cardano ecosystem is not explained, and it is difficult to estimate for the community.\r\nI would suggest the team to focus on a short list of short-term objectives, to ensure a better description to the expected impact with some quick success. \r\nI disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "Some demos are provided of the website which suggests that a development has indeed started. \r\nHowever, the team is not identified, and it provides no evidence of having the required skills to manage all the targeted development. I recommend to the proposer to further detail the plan by giving a timeline for the project and elaborate the challenges to be taken at each step of the development.\r\n", "q1r": 2, "q2": "The proposal states that 80% of the budget will be used to \"accelerate the development of the ecosystem\" : that is unprecise and needs to be detailed. It also states that part of the budget will be dedicated to the \"Bcoin bridge\" development, but there are no description and details about this bridge.\r\nBased on the current description of the proposal, I consider that the community will not have the capacity to estimate the progress of the project in attaining its goals. This proposal needs to be reworked for a coming Catalyst Round : I recommend to add more precision about everything that will enable the community to monitor the progress (roadmap, Kpis, budget detailed breakdown).\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Criamos um ecossistema que facilita a interação com Blockchain e seus derivados a qualquer pessoa, particular ou empresa, para impulsionar a adoção", "experience": "Nosso Token está no ico, e as pessoas compram diretamente de seu celular com moedas locais de 5 países da África através de nossa ferramenta de pagamento"}