{"id": 381842, "author": "dvarnas", "title": "Estati - Real Estate Investments", "url": "https://cardano.ideascale.com/a/dtd/381842-48088", "category": 26240, "amount": 11000, "description": "Como as transações imobiliárias podem ser facilitadas na cadeia de bloqueio usando contratos inteligentes?", "funded": 1, "upvotes": 73905328, "downvotes": 8982352, "votes_result": 64922976, "votes_cast": 187, "f6_no_assessments": 6, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Se não estou enganado, eu já aliviei uma proposta desses autores em um fundo anterior, desse mesmo projeto. É ótimo ver quando as coisas vão adiante, e isso significa que o impacto aqui é uma realidade. Como o projeto está em desenvolvimento desde a f4, isso significa que os sucessivos financiamentos foram bem utilizados e, portanto, renovados, os autores listam uma série de impactos que já foram alcançados em rodadas anteriores, esclarecendo bem o que foi feito. O mercado imobiliário é certamente um dos mais rentáveis, e também tradicional, o que requer muita dedicação por parte dos autores para quebrar um pouco desta tradição, incluindo aqui transações em moedas criptográficas. A plataforma que eles desenvolveram e continuam a melhorar é certamente de alto valor e gera impactos positivos para o ecossistema Cardano. Digo isto porque misturam as atividades do mercado imobiliário, primeiro a compra e venda direta de imóveis, e depois outros tipos de ações mais complexas (como investimentos através de empréstimos, etc.) com as tecnologias do nosso ecossistema. Desta forma, estão abrindo novas possibilidades que vão além das práticas mais comuns no mundo criptográfico, como a comercialização de NFT, jogos de azar/jogo em geral, trazendo novos usuários para Cardano, seja através da adoção da moeda ou através do desenvolvimento de contratos inteligentes, como é o caso da proposta específica.", "q0r": 5, "q1": "Quanto à capacidade dos autores de realizar o projeto, acredito que não há muito a ser discutido. Eles vêm realizando este projeto há muito tempo, eles já têm vários marcos de sucesso que comprovam o quanto estão preparados para realizar tais atividades, e o que eu acho positivo neles é a consciência de ir pouco a pouco, como eles comentam, seu projeto geral é extenso e caro, mas eles estavam gradualmente pedindo financiamento. Desta forma, eles apresentaram resultados e provaram seu valor na prática, esclarecendo quaisquer dúvidas a respeito desta parte do projeto. Sobre a divisão financeira, infelizmente, achei que esta parte deixava um pouco a desejar. Eles dividem o montante total em porcentagens, e estas são explicadas de forma superficial. Gostaria de entender, por exemplo, qual seria a relação entre a parte que vai para o próprio contrato inteligente e a parte que vai para os salários dentro de 90%? E como aconteceria a campanha de marketing mencionada nos 10%? É verdade que já têm o projeto consolidado, mas acredito que as melhorias também geram a necessidade de uma forte divulgação. Quanto aos passos a serem seguidos, eles foram bem explicados, esta parte foi adequadamente detalhada em minha opinião; sabemos o que vai acontecer e em que ordem, e as pequenas atividades que vão compor um todo. Portanto, penso que neste tópico da proposta somente a explicação do financiamento poderia ser melhorada.", "q1r": 4, "q2": "A proposta é muito bem coberta no que diz respeito à auditabilidade. Os autores nos dão muitas informações através das quais podemos monitorar o desenvolvimento do projeto. Em \"métricas\", podemos saber que medidas pretendem tomar em relação à melhoria do projeto, para que possamos monitorar se tais ações foram de fato realizadas após o financiamento. Eles também explicam como sua plataforma funciona na vida cotidiana, ou seja, há como entrar, navegar, até mesmo fazer uma simulação de transação para verificar se tudo está acontecendo corretamente. Além disso, os autores nos fornecem uma visão geral de como é o mercado imobiliário em alguns locais que pretendem operar. Isto me fez pensar que talvez fosse interessante que algum membro da comunidade, que tem experiência na área imobiliária, pudesse atuar como mediador entre este projeto/seus autores e a comunidade Cardano, fornecendo feedback com alguma regularidade, que poderia ser apresentado em alguma prefeitura ou simplesmente disponibilizado para a comunidade em geral. Dito isto, os autores nos fornecem os meios para realizar a auditabilidade, é necessário que façamos isto através de monitoramento constante.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Real estate investment is a high stake high risk endeavor with complicated local laws and procedures. There is a need for innovative abstrationis to overcome the local settings into a smooth business model This will encourage large flow of value across the glob. The proposal has the potential to provide this abstraction using crypto. Therefore Cardano exosystem is ideally suited for hosting this due to its superior security model. ", "q0r": 5, "q1": "The proposing team has experience and are already running an initiative which enables people to invest in property through bitcoin. The team has expertise from three different fields and is likey to complement the balance. The proposal is clear with realistic budget projections along with milestones. The proposal is likely to be implemented. ", "q1r": 5, "q2": "The legal requirements are quite complicated in property ownership across the countries. However, the initiative can be pathbreaking and might provide a better opportunity to unlock the crypto value in physical world. The proposal is requesting a very reasonable amount and have clear milestones. The progress is clearly auditable ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This is a proposal for an application that supports electronic identification and payment in the real estate sector. The team has real estate business experience but has not shown much blockchain-related technical experience before. This is an area that requires multilateral participation: local authorities, land owners, buyers, tax authorities... But the solution has not been detailed yet for the synchronous settlement of dealings with the participating parties. during implementation.", "q0r": 4, "q1": "This proposal is highly practical, implemented in countries that are accepting cryptocurrencies in real estate payments and paying full state taxes. Advantages in some countries such as: Dubai, Austria... But it has not been possible to deploy in countries that have not yet opened the application of electronic money in payment.", "q1r": 4, "q2": "The review and review of this project KPI requires a lot of information sources such as: real estate documents, information on how the agreement on the purchase and sale contract agreement on the application corresponds to the actual documents, how to Verification. Not to mention that user information and private information need to be confidential for customers, so it will not be easy to control the results of implementing this proposal.", "q2r": 3, "assessor": "z_assessor_648", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "How to connect Blockchain with the real world we can read in this idea that is in front of us. The proposal clearly addresses the problem and offers a solution. It is not clearly defined how this project will have an positive impact and how it will increase the value of the Cardano ecosystem. Of course we can conclude when the project is realized and purchases and sales take place through the smart contract of the Cardano system if that happens that will be very useful  for Cardano ecosystem. KPIs indicated in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 3, "q1": "It would be good to know who is behind Estati real estate invesmennts. We do not have any links via LinkedIn or Github to confirm that the team has the experience, knowledge and skills to complete this project. I guess the team from Estati has experience in selling real estate but not in the blockchain. That is why they put a link in the proposal from a company that deals with blockchain, and their team is professional and transparent. In this proposal, an external associate is taken who will be paid if funds are received. The proposal states a clear reasonable budget from which 90% of the funds will be allocated to external collaborators. But it would be much better to specify in more detail exactly what the funds will be allocated for. There is a clear plan and details of actionable tasks and order of execution. Proposal offer a timetable through which the work would be completed but it would be good if it was a little better worked out. There are details of actionable tasks and order of execution and proposal explains technical aspects. There is no mention of risks in this proposal, nor is there any awareness of the risks.", "q1r": 2, "q2": "The roadmap with milestones and a time horizon for achievement is not clearly presented in this proposal. KPIs have not been properly clarified so KPIs are not relevant in quantify the success of the project. We can believe that the partner firm will make the necessary smart contract but in no way can the community track the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 4, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This project has the great idea about facilitating real estate transaction using smart contracts on Cardano blockchain. The proposer shows some evidence about project's progress and activities for the early stage. If the initial foundation is complete, this project could bring positive effect on the real estate field and adoption of Cardano in real life. ", "q0r": 4, "q1": "The proposal has two qualified members with many years of experience in real estate and tech and developer team. The proposer gives clear evidence about what they are doing and the progress of the project and a very detailed roadmap, KPI which makes me believe in the success of the project. ", "q1r": 4, "q2": "We could audit the process of the proposal following their given information. I suggest the proposer should add their timeline to their roadmap to make it easier for auditing. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Real Estate management is a use case Cardano is well positioned to tackle with dapps that combine investing in the asset class with identity and proper legal forms based on jurisdiction. The team has a solid plan/vision and has begun to execute towards building this exact solution on Cardano.", "q0r": 4, "q1": "The plan presented is compelling, the team has established partners, is taking a cross-jurisdictional approach and has already begun building. ", "q1r": 4, "q2": "The team provides a fair amount of information to audit the proposal in there MVP build and metrics section, these could both be expanded upon. ", "q2r": 3, "assessor": "z_assessor_870", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Interface tudo em um para facilitar as transações imobiliárias (compra e venda) usando contratos inteligentes na cadeia Cardano Blockchain", "experience": "Donatas Varnas - Empresário, Imobiliário, +6 anos\nCTO - ex-2 startup CTO, +9 anos\nClearContracts.io - Parceiro de desenvolvimento de contratos"}