{"id": 382576, "author": "andrea687", "title": "Events Adoption & Reward", "url": "https://cardano.ideascale.com/a/dtd/382576-48088", "category": 26240, "amount": 39000, "description": "Os eventos sofrem com a falta de avanço tecnológico, os altos custos dos fornecedores e a falta de patrocínios e recompensas específicas.", "funded": 1, "upvotes": 40288500, "downvotes": 7745381, "votes_result": 32543119, "votes_cast": 221, "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Uma dapp que funciona tanto para businecess (organizadores de eventos) quanto para consumidores (frequentadores de eventos). Ela ajuda na organização da entrega/pick up de alimentos para permitir a máxima otimização. Eu adoro isso! A proposta identifica problemas com a atual entrega de alimentos e aplicações industriais como falta de DID e velocidades de transação e custos para o consumidor principalmente, mas também para as empresas. Isto os deixaria alinhados com as configurações de desafio. Esta proposta é uma grande maneira potencial de trazer mais e mais clientes para o ecossistema cardano. Meu único problema é que está localizado para a Inglaterra e espero que se espalhe globalmente. Há métricas relevantes sobre a adoção do usuário e os objetivos da proposta são relevantes para o desafio, pois eles querem integrar algumas soluções descentralizadas na plataforma já existente para possibilitar alguns dos benefícios oferecidos por uma forma descentralizada de fazer as coisas. A proposta não deve ter problemas de escala, considerando o que a equipe e a empresa já conseguiram. Como desenvolvedor, não vejo nada que falte na proposta e gostaria de ver mais sobre o lado técnico das coisas, porque me deixou curioso. A proposta acrescenta algo que falta ao ecossistema e que é integração, em vez de construção a partir do adulto. Ambos têm seus benefícios.  No geral, eu realmente gosto da proposta e acredito que terá um grande impacto na comunidade cardano se esses milhões de clientes começarem a usar o ADA para pagar pelos serviços utilizados.", "q0r": 5, "q1": "Há todos os links e referências relevantes para verificar a credibilidade dos projetos. Os membros da equipe listados e as colabrações são todos verificados. O número de membros da equipe está listado e estes são pessoas com ampla experiência na indústria alimentícia e no aplicativo para dar suporte à parte técnica da equipe. O orçamento poderia ter tido uma melhor repartição, mas mesmo como está agora está claro e delineia os principais custos.   Há um cronograma realista para completar o trabalho e se estende por um período de 2 anos, mas os fundos solicitados são apenas para os próximos 3 meses, pois este será o período para a próxima fase de financiamento. Também é mostrada uma implementação sensata que mostra o sucesso anterior, mas reconhece os pontos fracos reunidos ao longo dos anos e procura uma maneira de mitigar os custos extras de transação. Adoro que os autores tenham fornecido uma forma mínima de engajamento para as filas de espera e na situação de pandemia esta é uma questão realmente importante a ser resolvida. Os aspectos técnicos não são tão bem explicados como tudo o mais, o que é uma chatice, porque eu estaria interessado em pesquisar. Há muitos riscos para os consumidores, mas também para as pequenas empresas, e este é um ponto de dor que a equipe tem sido honesta e reconhecida como um desafio futuro. É importante dizer que eles têm algumas boas idéias para resolver isto no futuro, principalmente através da criação de confiança.", "q1r": 5, "q2": "A rastreabilidade do projeto não é problema, uma vez que a empresa tem todos os tipos de presença nas mídias sociais juntamente com os canais de comunicação de volta para a comunidade. Acredito que o catalisador do projeto já dispõe de alguns mecanismos para resolver a liberação do financiamento a vapor, de modo que isso não é um problema também. As métricas mencionadas são relevantes para a proposta, pois a adoção do usuário é um dos KPIs importantes para mostrar a adoção. O Roadmap está presente e é relevante. Os marcos são realmente longos, com duração de 2 anos, mas é bom ter uma visão de longo prazo. Os proponentes têm mostrado uma solução em andamento para o problema declarado!  Espero que os proponentes vejam através dos olhos dos consumidores e dos eleitores a possibilidade de ter uma proposta tão boa em primeiro lugar. A melhor das sortes para vocês!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "A idéia é ótima e se alinha muito bem com os objetivos do desafio. O autor contextualiza bem o que é um problema com o qual ele está lidando aqui: a falta de boa organização durante os eventos, sejam eles pequenos ou grandes, o que gera mais despesas tanto para os fornecedores quanto para os consumidores. Eles enumeram uma série do que poderiam ser estas questões, dando uma boa compreensão da situação a ser resolvida. Portanto, a idéia é criar um sistema que possa beneficiar e facilitar tanto as atividades dos clientes quanto as dos fornecedores - e eles explicam muito bem quais seriam essas atividades. No caso dos clientes, isso reduziria, em suma, o tempo nas filas de espera e encomenda de alimentos e, no caso dos fornecedores, criaria uma ferramenta para simplificar as transações diárias (seria interessante dizer quais). Eles listam de forma geral quais ações individuais promoveriam, dando-nos uma grande compreensão do que é este projeto, na prática. E, sobre como tal projeto poderia se beneficiar especificamente do ecossistema Cardano, eles explicam que pretendem criar carteiras digitais para agilizar as transações monetárias, realizar pagamentos em ADA e também usar seu próprio token; eles também implementarão identidades digitais com o Atala Prism! Em outras palavras, eles usarão muitas tecnologias relevantes ao ecossistema Cardano, atraindo novos usuários, aumentando a circulação do ADA e criando carteiras digitais, atendendo diretamente aos objetivos deste desafio, e também se beneficiarão do desafio enfrentado pelo DID Prism Atala, presente nesse mesmo fundo.", "q0r": 5, "q1": "Esta equipe demonstra de muitas maneiras ser muito capaz. Eles fornecem detalhes sobre a equipe administrativa: seus nomes, funções e perfis vinculados. Assim, temos um conhecimento muito profundo de quem é esta parte da equipe, mas sabemos que também existem outros profissionais aqui, como os desenvolvedores. Por que não há uma ruptura sobre eles também? Gostaria de entender quem são, em que idioma programam, quais são suas conexões com o ecossistema Cardano... Penso que a explicação da equipe foi um pouco incompleta a este respeito. Por outro lado, você pode ter certeza sobre sua preparação e capacidade de realizar o projeto devido aos vários conteúdos que eles disponibilizam: entrevistas, links para eventos que eles já organizaram, etc. Sabe-se que ele já é um iniciante ativo e que tem experiência no local que se propõe a lançar o projeto inicialmente (Reino Unido). Em outras palavras, se houvesse detalhes individuais sobre cada membro da equipe, esta parte seria perfeita; é ótima, mas não ideal. A equipe tem um roteiro bem sintetizado, no qual eles informam o que seria feito de acordo com a passagem do tempo. Entretanto, isto não é um problema, pois eles entram em muitos detalhes, não necessariamente no roteiro, o que eles querem fazer, como vão fazê-lo e por que precisariam ser feitos. O único detalhe que poderia ser mais claro seria quem faria qual parte - como eu disse, infelizmente só conhecemos parte da equipe. Gostaria de saber qual desenvolvedor faria o quê, como o marketing seria gerenciado e por quem e assim por diante. E sobre a divisão financeira, eles explicam para que pediram o dinheiro, fornecendo muitos detalhes nestas explicações. No entanto, na parte em que eles indicam especificamente para onde cada parte do dinheiro iria: Achei os valores muito altos, principalmente porque era apenas uma parte do projeto, não o todo.", "q1r": 4, "q2": "Acho que esta proposta é facilmente auditável porque há muita informação disponível aqui para monitoramento. Por exemplo, eles estabelecem métricas de sucesso através das quais podemos obter um sentido específico dos resultados esperados. Além disso, eles incluem na descrição da proposta amplas explicações sobre o que seria feito e com que objetivo, desde o início esta proposta é rica em aprofundar o conteúdo a ser feito, através da enumeração de tópicos de atividades. Eles separam atividades que serviriam para melhorar a experiência tanto dos usuários quanto dos provedores de eventos. Penso que poderíamos auditar esta proposta de duas maneiras, a primeira seria acompanhar o desenvolvimento do próprio projeto, a comunidade Cardano poderia estabelecer um contato próximo com esta equipe para entender se os processos estão sendo feitos corretamente. Além disso, poderia ser realizada uma pesquisa com os clientes/fornecedores dos eventos. Como este projeto está ajudando-os? O impacto é real? Quais são as principais diferenças entre antes e depois? Eles estão realmente utilizando nossas tecnologias de cadeia de bloqueio? Em caso afirmativo, quais, e o que você está pensando da experiência? Através destas perguntas, teríamos uma compreensão direta e real do sucesso ou não do projeto, sem rodeios. Acredito que a equipe forneceu informações suficientes para promover uma auditabilidade eficaz, a comunidade apenas tem que manter contato com o projeto e, para ir mais longe, a equipe poderia fazer esta pesquisa de experiência com os envolvidos.\r\n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 12, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "A demanda por transações de Eventos mais rápidas e seguras tanto para os comerciantes quanto para os clientes cria um nicho negligenciado para o ecossistema Cardano tomar posse.  Esta proposta, especializada em Alimentos e Bebidas (F&B) é bem elaborada para alcançar primeiro os comerciantes e eventualmente os clientes a bordo, começando com AtalaPRISM DID para assegurar a KYC do comerciante e outros dados críticos.  Como um negócio que já vê milhões em fluxo de caixa, eles já têm uma base comercial com a qual estão trabalhando (e indicam novas parcerias por trás de um NDA que poderia aumentar esses números iniciais em milhares).  Seria útil saber qual é sua base comercial existente - o número que não está por trás de um NDA que é um indicador confiável de adoção.  Se esses comerciantes forem bem sucedidos, eles seriam realmente capazes de impulsionar a adoção de DIDs, carteiras e fichas de recompensa pelos clientes, todos baseados em Cardano.  Não é difícil imaginar a adoção do Cardano como A moeda do evento em todo o mundo, um mercado de $1,5 trilhão de dólares, já que esta proposta é expandida ou implementada em outros lugares.  Deve-se notar que esta proposta teria sido igualmente adequada para ter sido apresentada sob a F7: Acelerar a Identidade Descentralizada, onde teria obtido a atenção do AtalaPRISMO.", "q0r": 4, "q1": "A implementação proposta parece ter uma grande chance de sucesso: a equipe já está estabelecida com um front end operacional para o aplicativo e uma base de comerciantes para alcançar (e negociações em andamento para trazer mais), eles têm um roteiro claro com metas para o curto prazo detalhadas e com resultados a curto prazo, e metas para o longo prazo claramente vislumbradas.  Eles priorizaram corretamente o alvo dos DIDs dos comerciantes em vez de saltar diretamente para os clientes e carteiras, de modo que eles serão capazes de se apoiar e fortalecer as relações existentes, utilizando o potencial de Cardano.  Se há uma preocupação aqui, é que o orçamento, embora não esteja fora de linha com os custos de bootstrapping, pode acabar sendo muito alto para competir neste desafio.  Eles indicam que têm uma equipe de 12 desenvolvedores disponíveis que já estão criando ferramentas para seus negócios, por isso é difícil imaginar que não poderiam ter um orçamento melhor para que um desenvolvedor JS se integre à AP.  Se a equipe ainda não o fez, eles PRECISAM alcançar Tony Rose e AtalaPRISM para receber orientação sobre esta proposta, seja financiada ou não, e talvez afinar o orçamento para financiamento posterior.  Devo mencionar um possível risco: os eventos podem ser boom/bust em termos de carga de trabalho, e pode ser uma preocupação que a integração DID, se se mover lentamente e se levar para além da primavera e para o verão, possa ter que ser adiada enquanto a equipe administra as preocupações comerciais existentes.  Algo para se pensar.", "q1r": 4, "q2": "A equipe de proposta elaborou um roteiro com marcos verificáveis (integração AP, front end, back end, etc.) que são pontos de auditoria naturais.  A linha do tempo não é apresentada de forma granular e pode ser útil para os eleitores saber, talvez com uma resolução mensal ou quinzenal, como o desempenho será acompanhado, o que, por sua vez, levará a um monitoramento mais fácil do progresso pela comunidade.  Como a meta está no nível do comerciante, seria útil para a equipe incluir KPIs referentes ao tamanho do pool de teste ou quaisquer parâmetros mensuráveis do pool (agregação de vendas previstas a bordo, Tx previstas, etc.).  Um levantamento dos comerciantes que utilizam o DID também poderia ajudar a comunidade a avaliar o progresso do projeto.", "q2r": 4, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The team is proposing an innovative use of Native tokens for overcoming centralized opaque systems. There is an ever-increasing requirement for Point of sale systems that have to cater for fast and dynamic events. The use case has many similarities with ticketing for events. There may be scope for combining the two to improve interoperability and homogeneity in event management as a whole. Overall the proposal is effectively addressing an important adoption challenge. ", "q0r": 4, "q1": "NOQ has presented an excellent use case for blockchain tokens that can bring about transparency in  Electronic point of sale systems using their mobile ordering platform. The company LinkedIn references five employees and has presented an excellent proposal with a clear roadmap and outputs. The proposal is feasible to implement and the proposers should be capable of implementing it. ", "q1r": 5, "q2": "The proposal is for paying a full stack developer and front end developer for 18 months. The tasks which are included and the analysis of features has been presented in a comprehensive manner. With the credentials presented I feel the team will be able to complete the project. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Na NOQ desenvolvemos e ainda desenvolvemos um sistema para melhorar e recompensar tanto o Gerenciamento de Eventos (B2B) quanto os participantes de eventos (B2C)", "experience": "Somos uma Startup estabelecida a partir de 2020, com sede no Reino Unido, que vem trabalhando com mais de 300 eventos de mais de 100 a 20.000 pessoas. (veja nossos links)"}