{"id": 382825, "author": "tihomir.dimov", "title": "Divine Blockchain - Phase I", "url": "https://cardano.ideascale.com/a/dtd/382825-48088", "category": 26240, "amount": 35000, "description": "Má monitoração da temperatura, as condições de armazenamento através de toda a cadeia de fornecimento são a causa mais comum de perda de qualidade de um vinho.", "funded": 1, "upvotes": 45396300, "downvotes": 7037170, "votes_result": 38359130, "votes_cast": 144, "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta começa descrevendo o desenvolvimento e a implantação de um DApp para tratar de questões no monitoramento da qualidade do vinho enquanto este percorre o caminho logístico. Mas este é essencialmente o mais próximo que tocou nos objetivos do desafio e, como tal, não concordo nem discordo que ele se alinhe. O proponente descreveu a criticidade do monitoramento da qualidade e do tempo gasto pelo vinho através do caminho de distribuição, mas não oferece as especificidades de como isto será alcançado. Há menção da Indústria 4.0 e da IoT, entretanto, estas não estavam de forma alguma ligadas ao DApp que estão desenvolvendo nem às suas iminentes funcionalidades. Todos conhecemos a EmurgoTrace e a Cardano's ScanTrust, esta última utilizada como um mecanismo de rastreamento pela indústria vinícola georgiana para autenticar garrafas de fazenda para mesa. Se esta proposta pretende ser uma melhoria sobre estas aplicações existentes, ela de certa forma não a descreve adequadamente para receber uma classificação mais alta.", "q0r": 3, "q1": "Eu me sento na cerca em termos da capacidade desta proposta de entregar um produto que funcione, principalmente porque faltam os detalhes pertinentes. Para ter certeza, dois dos membros da equipe são nomeados, mas seus perfis no LinkedIn não oferecem experiência direta no desenvolvimento do DApp, o que poderia proporcionar confiança. A Intellics Engineering parece estar mais focada na indústria automotiva e não há informações sobre as implantações atuais e passadas da cadeia de bloqueios, como alegado. Se as experiências na indústria automotiva devem ser aproveitadas para melhorar os relatórios sobre a qualidade do vinho, uma vez que estão relacionadas ao transporte do produto, isto deveria ter sido melhor explicado a fim de criar a ligação entre seus conhecimentos e a implantação pretendida. A proposta descreve marcos ao longo de um período de 16 semanas que se concentra na pesquisa, conceituação e prototipagem e tem fornecido custos para os US$ 35.000 solicitados. Parece haver uma desconexão entre as 16 semanas de atividades listadas e a distribuição pretendida dos fundos. Embora o custo seja centrado no desenvolvimento, as atividades planejadas a serem conduzidas estão mais focadas na pesquisa. Acredito que esta proposta pode se beneficiar de uma descrição mais clara do próprio DApp, como um ponto de partida. Quais são suas funcionalidades, o que irá monitorar e como, quem seriam os participantes ao longo da cadeia a quem dependem os bons relatórios de dados e que tipos de eletrônica e hardware de monitoramento serão utilizados. A partir deste ponto, os marcos e o caminho de desenvolvimento podem ser extraídos e, com custos adequados e alinhados, podem aumentar as chances de viabilidade do projeto. O proponente também pode acrescentar detalhes sobre a experiência que eles fazem e não têm; e a partir do que eles têm, mostrar links para os desenvolvimentos da cadeia de bloqueio, conforme alegado. E do que eles não têm (por exemplo, desenvolvimento em Plutus), como eles irão obter tal conhecimento especializado. Os marcos descritos aqui podem ser o ponto de partida sem qualquer assistência catalizadora e seriam uma boa base para uma proposta DApp mais substancial em uma futura rodada de financiamento. Boa sorte.", "q1r": 3, "q2": "Não há muito apresentado na proposta que proporcione alta confiança para a auditabilidade. Além do site intellics.com, que carece de detalhes substanciais em termos de como o projeto resolverá realisticamente o problema apresentado, não há githubs nem contas de mídia social oferecidas que possam fornecer um meio de acompanhar o progresso e fazer perguntas. O roteiro e os marcos pesados da pesquisa seriam uma fonte dos dados que eles podem apresentar ao Catalyst e à comunidade, no entanto, não há menções de como as descobertas serão compartilhadas. Esta proposta, especialmente tendo em vista que está sob o desafio do DApp e da Integração, seria mais alta se um GitHub fosse apresentado. Os proponentes também podem informar sobre os resultados de suas atividades de conceituação, talvez usando o gitbook ou um mecanismo de publicação similar. Dito isto, sugiro que as atividades de pesquisa sejam conduzidas primeiramente pela equipe para solidificar as idéias e a direção, pois estas levariam a uma proposta mais detalhada para futura apresentação.", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 25, "ne": 14, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The proposal will provide a dApp with temperature sensor integration and tracking capability to monitor the storage condition of Wine. This is appreciated as a standard use case for blockchains in general. There is a need to create a demonstrable and well-marketed solution to improve adoption. Therefore the proposal is very much in alignment with the challenge. ", "q0r": 5, "q1": "The proposing team has about 20 years of experience in engineering and management. The solution proposed in a standard use case for blockchain is being experimented with and under implementation. Therefore there is likely to be a paved road technically ahead of the team which will substantially reduce the technical risk. I believe that with this consideration there is a strong chance the team will be able to complete the proposal in time.", "q1r": 5, "q2": "The fund requested in this phase is about one-fifth of the total estimated cost. The fund caters to developers, Project managers, and misc activities. The end state and KPI of this phase I is to build the dApp including both frontend and backend. However, the allotment for funds for software developers is only $ 7000. Notwithstanding the project clearly brings out steps and is auditable. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The idea here can be well defined in the following snippet: “real-time wine quality tracking across many supply chain checkpoints, supported by a blockchain ownership and monitoring solution”. This proposal aims to store in the Cardano blockchain some characteristics about the quality of wines, such as their location, temperature, etc. Unfortunately, I see several points to be problematized here. The situation is similar to another proposal that also deals with the world of wines, which I evaluated recently (Wine open market - Stappato, present at the following link: https://app.ideascale.com/t/UM5UZBq7U). We know what the idea is, but there are not enough explanations for us to understand well how all this would benefit the Cardano ecosystem. It is not specified how this bridge would be established, which technologies would be used, how Cardano would be integrated, in a detailed way, in this project. All we are told is that the blockchain would be used to store some information, which would be tamper-proof, traceable and all the other advantages that the blockchain provides. But little is said about it. The proposal is concerned with explaining the crux of the issue much more - guaranteeing final consumers control over the entire wine-finding process - than how all this would use and impact Cardano. Another point I would like to highlight is: as in the other proposal on wines, I find it difficult for the target audience here to actually purchase these services, use this platform (from the attached photo and from the understanding I had, it would be a Dapp). How to reach people who are commonly unaware of blockchain? How to persuade them to use this Dapp, in addition to wanting to have greater control over the wine they will purchase, how would they relate to Cardano? The target audience here would be consumers of refined wines, usually older people and those with good purchasing power. In general, this is the target audience for fancy wines, right? I am not generalizing and putting them in boxes, but more practically, it is not a part of the population that uses blockchain. I would like to understand more in depth how this adoption would take place. In other words, unfortunately I do not see this proposal as something that will guarantee a good return for Cardano, both because it is something extremely specific, a very unique niche, in which consumers need a good direction to use blockchain (if the author had better explained the user experience, maybe this issue would be clearer); both because I could not visualize, in practice, how Cardano would be used here.", "q0r": 1, "q1": "Explanations about the company involved, Intellics Engineering, are confusing. To begin with, they say they have experience in many very different areas, such as \"space technology, hotel systems and market industry\". How would it work in such diverse fields? What do they do with blockchain specifically? Have you ever worked with Cardano, or was it another blockchain? What is \"Industry 4.0 and IoT\"? It would be very positive if they had made a clearer definition of what their activities are, conceptualizing these different definitions that I mentioned last, in this way the understanding of the CAs would be much more solid as to who they are and what they do. Individually, the situation is much better, since they make the linkedin profile of their members available. With that we can get to know them individually, but that doesn't make up for the lack of knowing who would do what in this project. It would be necessary for them to clarify who would work here, developing which role and carrying out which activities. About the roadmap, we know which phases would be done and their respective costs (the funding requested would only cover the first phase). In the first phase, for example, the construction of the Dapp would be carried out, this would take 4 months and cost USD 35k. Right. But who would work here? The smaller tasks are defined, in fact, in the topic \"this phase will contain several important milestones\". This allows us to understand what would be done and in what order, as well as how long each activity would take. However, each topic could be detailed better, there is no way to fully understand the development of the project without knowing who would be responsible for each part, for example. The budget is explained in a somewhat superficial way, it is said how the money would be distributed, but each topic should also be more detailed. For example, 6k for marketing. It is said that some promotional materials would be made, such as pamphlets, shirts and publicity on social media. But in what way? What social media? How to reach the target audience? As in the marketing example, the other expenses could be better broken down. In summary, I think it's a little difficult to understand the activities of this company, but it's possible to get to know each stakeholder well; the roadmap is present and satisfactory, although not very detailed in some ways, as is the budgetary justification. The topic is well covered, just needing some adjustments.", "q1r": 4, "q2": "The proposal is admissible through the data provided in the KPIs part, I found it positive that these data are quite diverse and are not limited to just measuring the amount of products/transactions performed. But some parts could be better explained; for example, user satisfaction. How would that be done, would any research be carried out? And what research? Would the results be shared with the rest of the Cardano community, and if so, through which platform? In my view, however, there could be more KPIs directly focused on the benefits of the Cardano ecosystem. In other words, if new members were acquired for the community, if they are active, if they suddenly started other activities within the ecosystem beyond the use of this Dapp. In the \"Challenges/Risks\" section, some possible obstacles are outlined, and a good way of auditing the proposal would also be monitoring if such problems really happened and if they were resolved. All this data must be directly presented to the Cardano community, as it is a project that has several phases, an idea would be that there was a meeting at the end of each stage, to situate the community on how the development is going and the results already partially obtained. I believe this topic was well thought through by the author, but some tweaks would make it even better.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 27, "ne": 12, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Innovative solution to create an IoT-cork that transmits storage data on-chain to an app. By doing this, the owner can ensure better quality for wine. This could also impact insurance policies on shipments, which can decrease costs overall as there would be less loss of shipments and proof of transportation conditions in the data log. There seems to be a real opportunity to go broader with this in the future and extend this to shipments of all kinds, reaching a larger market. ", "q0r": 5, "q1": "The proposers have the engineering knowledge, but some details were not entirely clear to determine the feasibility of this project correctly. That is: how the cork works. Judging from the gallery images on the website, the cork will need to be replaced by this device in order to determining the climate of the bottle's interior. Could this re-opening of bottles impact product quality and will this bottle be regarded as a loss in a shipment lot? Clarification on this could improve the proposal. ", "q1r": 4, "q2": "The requested funds is reasonable as the proposing team intends to continue later phases of the project with generated revenue. There is a thought-out plan present in the proposal and several risks have been considered. What could improve the proposal further is an explanation of how potential clients would be reached. The marketing plan mentions various forms of advertising, but not how clients could be actively aproached like sending out agents or attending economic gatherings. Including more information on how this would be done would improve the auditability and assure how 100k clients could be accomplished within the first year of operations. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The proposal tends to a create an application to ensure quality authentication and real time monitoring of wine production to the consumers with specific attention to temperature monitoring with the view to confirm quality of the products to the end users. It is nice idea and it aligns with the campaign challenge which will definitely expand  the adoption and depth of the DApps ecosystem in Cardano including onboarding of more members.", "q0r": 4, "q1": "From the information provided, the team's qualifications and experience did not give me enough confidence that they can deliver this proposal. None of the team's experience in the winery business. In addition, the budget is not well detailed to justify the fund requested.", "q1r": 3, "q2": "The proposal main objective is create a Dapp and there is no mention of exact date to deliver this MVP. The KPIs mentioned is not related to this phase of the proposal.", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 26, "ne": 2, "ng": 19, "nfo": 5, "vca_o": 1}, {"q0": "I’ve seen another proposal that is tackling wine and I’ll make the same comment here. The wine market size is enormous nowadays and its projection is to grow from USD 340,23B in 2021 to almost USD 0,5 T in 2028 (https://www.fortunebusinessinsights.com/wine-market-102836#:~:text=The%20global%20wine%20market%20size,6.06%25%20during%20the%20forecast%20period.). Therefore, it has a huge potential to those who enters in this market. Moreover, the e-retail is growing in a fantastic speed, the growth projection to 2022 is about USD 5,4 T in 2022 (https://www.statista.com/statistics/379046/worldwide-retail-e-commerce-sales/). Coming with all this growing environment, the e-commerce will start (and has started) to focus on quality as well, and here is where this proposal enters, guarantee of quality. If you be able to achieve just a fraction of this volume you’ll create a huge impact in ADA community.", "q0r": 5, "q1": "I really approve how this proposal was written, it brings all the confirmations needed (about the team’s capability).  Furthermore, the budget seems solid and it follows a reasonable timetable.\nHowever, I would like having a risk map more explored. I’m not talking about this phase specifically, but the whole project. E.g. how about the competitors? I do not think that there is someone using the same technology as you, however, since the big sells go inside containers or it needs some specific logistic business to provide the service, is there possible for them to guarantee the quality of the product during the transportation (implementing one temperature’s sensor inside a container, for example) in a cheaper way? The same with the warehouses and selling points. Of course your solution focus and guarantee the bottle, but there are some other products (meet, e.g.) which uses the batch quality.\nOne info that could be added is the expected (or real) price of the product and how much it is going to cost to wineries (to estimate how the price would change to the final consumer).\n", "q1r": 4, "q2": "I like the timetable however I do think it could be added some milestones (although the whole phase 1 is quite short).\nThe KPI provided is to the whole project, aiming to achieve 100K users and USD 100K revenue (are you going to raise USD 1 per user early?)\nIt could be added #wineries, #countries attended, #wines in the platform, #of grape, etc. (it would make the project more robust to those who are arriving in the platform).\n", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 23, "ne": 5, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Rastreamento da qualidade do vinho em tempo real em muitos pontos de verificação da cadeia de fornecimento, apoiado por uma solução de monitoramento e propriedade da cadeia de fornecimento.", "experience": "Durante os últimos 3 anos, a Intellics Engineering esteve envolvida em produtos de cadeia de blocos e desenvolveu muitos sistemas para a indústria 4.0 e IoT."}