{"id": 382955, "author": "jcb.technologies", "title": "Breaking Worthless Traditions", "url": "https://cardano.ideascale.com/a/dtd/382955-48088", "category": 26240, "amount": 55000, "description": "Os intermediários de todo o mundo exigem que confiemos neles. Um desses intermediários são os agentes imobiliários.", "funded": 0, "upvotes": 15649605, "downvotes": 18175331, "votes_result": 2525726, "votes_cast": 147, "f6_no_assessments": 8, "f6_rating": 2.0416666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Do meu entendimento, este projeto visa (a longo prazo) criar uma plataforma para negócios imobiliários, mas sem incluir intermediários desnecessários. Usar contratos inteligentes e tecnologia Blockchain nos mercados é definitivamente uma área relativamente inexplorada e subdesenvolvida, e seria revolucionária se o projeto correto fosse desenvolvido. Se tal projeto (como esta proposta, por exemplo) fosse desenvolvido em Cardano, ele não só revolucionaria o mercado imobiliário em geral, mas também atrairia uma das indústrias mais rentáveis do mundo. Há um forte sabor humanitário na essência desta proposta, na medida em que ela procura reduzir a quantidade de exploração do sistema atual no mercado imobiliário. Seria um uso muito bom do tesouro Catalyst (mesmo pedindo cerca de 20% do total dos fundos para o desafio), mas eu gostaria de ter visto detalhes mais específicos ligados ao desenvolvimento do projeto. A idéia central e o conceito é surpreendente, mas para que eu (como um consultor comunitário experiente) pudesse avaliar a proposta, precisaria ter mais informações incluídas nela. Mas, quanto ao impacto, concordo que esta proposta trata efetivamente do desafio.", "q0r": 4, "q1": "Esta proposta seria muito benéfica se incluísse uma apresentação da equipe, juntamente com alguns links para verificar a competência e a experiência. Talvez incluir uma estimativa de quantas pessoas estarão trabalhando com este projeto e por quanto tempo, e adicionar algumas páginas de perfil do LinkedIn da equipe principal, desenvolvedores e outras pessoas-chave envolvidas. A fim de avaliar a viabilidade desta proposta, a proposta precisa descrever quem estará trabalhando no projeto, e como. Há uma menção de contratação de desenvolvedores experientes e uma data estimada de lançamento da plataforma de 2024, mas seria valioso saber se esses desenvolvedores já estão contratados, quantas horas por semana eles trabalhariam e qual a grande parte do orçamento que será alocada a eles. Uma alocação orçamentária detalhada aumentaria a credibilidade da proposta, se pudéssemos ver como e quando os 55.000 dólares solicitados seriam distribuídos ao longo dos 3 anos. Além disso, uma vez que a proposta visa uma indústria tão grande, existe algum plano para solicitar os próximos fundos, já que o prazo se estende por mais de 3 anos? Mas mais sobre o roteiro mais tarde. No que diz respeito à viabilidade, discordo que seja altamente provável que esta proposta seja implementada com sucesso.", "q1r": 2, "q2": "A proposta fornece um prazo estimado de 3 anos, mas não muito mais detalhes do que isso. Se a comunidade, investidores e usuários potenciais tivessem uma maneira de acompanhar o desenvolvimento e o progresso da plataforma, isso aumentaria imensamente a força desta proposta. Uma sugestão poderia ser expandir o roteiro do projeto, adicionar alguns marcos (onde estará o projeto em 3 meses, 6 meses, 12 meses?) e algumas medidas de sucesso (KPIs). Por exemplo, \"planejamos ter 200 pessoas a bordo usando a versão beta após 12 meses\". Depois de 24 meses, embarcaremos mais 400, juntamente com algumas colaborações de organizações (links) que têm longa experiência com o mercado imobiliário\". Considerando que não sou um profissional do ramo imobiliário, estes exemplos servem apenas para explicar o conceito do que eu gostaria de ver incluído na proposta, e não os detalhes que estão faltando. Do meu ponto de vista, transparência e segurança são um elemento importante nos valores centrais desta proposta (que são surpreendentes), mas eu gostaria de ver esses níveis centrais de transparência refletidos tanto na proposta quanto na idéia da mesma. Finalmente, uma coisa que está incluída na proposta que não é muito comum é que o proponente dá uma breve reflexão sobre alguns riscos e desafios potenciais que podem surgir durante o desenvolvimento deste projeto. Ver o proponente compreender os riscos potenciais de desafiar uma grande indústria como a imobiliária e como isso pode levar a algumas questões legais e empresas e indivíduos problemáticos, me leva a pensar que o proponente tem uma compreensão profunda do mercado imobiliário, o que aumenta a confiança e credibilidade da proposta. Entretanto, devido ao fato de que falta muita informação, discordo que esta proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The proposer want to build a platform to circumvent the middleman which in this case is the real estate agents. The problem identifies a problem, that smart contracts on cardano can help with, so such a project will bring value to the community. There's a good description of how that will happen and what are the plans for the future of this project. I don't see any KPIs or metrics to measure the success of the proposal, so it's going to be hard to measure the projects success and impact. No team is mentioned so It's hard to judge if the project will be ready for future challenges. Currently there are a couple of major items missing from the proposal like: KPIs, metrics, verifiable team members, a roadmap and a tracability channel for the community to follow along. Because of the reasons listed It's hard for me to say the project will bring value in practice, but the idea is definately good and I would encourage the proposer to follow the suggestions in the comments and build a better proposal for the next fund. ", "q0r": 3, "q1": "There are no links for team members provided which takes away from the credibility of the project. There are no links pointing to any kind of reference that I can investigate. There is no mention of a team, and this seems like a laarge project to me and the people in the comments. The budget has no breakdown and identifiable items or a reasonable timeframe for the project success.  The project describes what is the searched for end result, but not the steps how to get there. There are no resources that would describe how to implement the given proposal. No technologies or technical aspects of an implementation are mentioned in the proposal. The proposer has considered challenges and risks, and have provided some explanation on how this business will stay competitive by incentivising the users with lower fees than the current ones. By reading through the comments, I saw that there are already other projects in the community that try and do the same thing and a collaboration between this proposal and others may prove to be more practical and possible. Overall for the reasons listed above, I'm sceptical for the feasibility of this proposal.", "q1r": 2, "q2": "No mention of a social network group, discord channel or any kind of method of informing the community for the projects success. No KPIs or measures mentioned in the proposal. No roadmap given, just an end year of 2024 for the website deployment by unknown developers. There's a clear and udnerstandable description of the problem and an idea of a solution.  I would encourage the proposer to put himself in the shoes of a voter that reads his proposal and try to think of what would a voter expect to read in order to vote. For these reasons I don't see the project being auditable or easily tracable. Good luck to the author of the proposer, I hope I'll see you in the next funding round with a new and improved proposal! ", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal tried to address the main objectives of the challenge, by proposing to use smart contracts on the Cardano blockchain to cut off real estate brokers. Real estate market is very rich with human interaction, and it is interesting to see how this project wants to try and replace human with automation. In my opinion this proposal needs to be improved in order to meet the challenge objectives. The solution should add more details on how the solution can be integrated to the overall Dapp ecosystem in cardano.", "q0r": 2, "q1": "Although the project founder is very optimistic about implementing his idea, I have a lot of doubt in the success of this project. The team does mention relevant experience in the proposal, but it lacks the evidence to back up the claim. The project founder provides details about how to execute the project but lack any milestones, detailed roadmap for three, six, and twelve months. Even though the proposal mentioned the required total budget, it does not have the detailed breakdown of its budget. My suggestion for the team is to add budget breakdown as well as team member profile that can be verified and pass basic online due diligent.", "q1r": 2, "q2": "The team does provide deliverables, roadmap, and detailed plan on how to execute the project but there are no clear success metrics or KPI in the proposal. There is no budget breakdown in the proposal and team does not mention where they will publish the progress of project execution making it difficult to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including budget breakdown. Also, I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 2, "assessor": "z_assessor_643", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Middlemen in every industry can help their customers a lot, but there is also a lot of bad effect from this model. I believe that the idea of this team will erase the gap between owners and real buyers, flattening the information gap between them means that it can save a lot of time and money for that industry. The scope of this proposal is real estate in US. But I hope that the team can give some key metrics to help us check whether this idea is aligned with the challenge givens or not. But their proposal just have only the introduction info", "q0r": 2, "q1": "Making a platform like this is not simple with just coding the system, designing the web... the team must have a good implementation plan that drives both seller and buyer to their platform and it's the hardest part. It's a mixed plan of a ton of activities. But the team don't show any words about their plan. \r\nThere is no roadmap, no key metrics, no goals, no features explanation, no technical explanation, and no budget breakdown in this project to believe that it will work. \r\nI mean, this can't be real by this team. ", "q1r": 1, "q2": "We can't audit this proposal because there is no roadmap and key metrics.\r\nThe good thing is that they have a good acknowledgment of the problem context, and that helps them make a good solution that addresses the problem. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 18, "ne": 0, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The problem is within the challenge. Because it can drive a lot of users to Cardano ecosystem. Real estate is a daily problem that everyone in the world cares about. \r\nThe proposal also telling about sharing 1% commission fee will be charged when selling properties listed on the site. \r\nBut the proposal doesn't have key metrics that align with the challenge setting, it will show how the project will affect the ecosystem by specific criteria. ", "q0r": 2, "q1": "This proposal only provides the vision and benefits that buyers and sellers receive when using it. \r\nIt lacks all basic info for assessing the feasibility. Include: \r\n- Detailed implementation plan for knowing what they will do. Not just about the features of this platform, but also includes use cases, technology explanation, marketing, activities... \r\n- Detailed roadmap and budget to assess that are they reasonable with the plan or not. \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. ", "q1r": 1, "q2": "The proposal doesn't have the basic things for auditing, including: \r\n- Roadmap with detail and realistic timeline. \r\n- Key metrics that are clear and fittable with the plan and vision of the team. \r\nBut it has a good problem explanation and can explain detail about how the solution can help to solve the problem. ", "q2r": 2, "assessor": "z_assessor_670", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This project will make a website that connects the buyers and properties seller directly without the need for a middleman. This project will make a big disruption in the real estate industry in US.  Hence, I believe that this project when deploying will make a big impact on Cardano ecosystem.\r\nUnfortunately, the proposer doesn't have any key metrics for assessing whether this project is aligned with the challenge setting or not. ", "q0r": 2, "q1": "The idea is good but it will be complex to do, for this type of dApp there should include a lot of activities: coding, marketing, supplier developing, event organization... Then the hardest part in real estate is marketing, which can also take a lot of money but still return poor results. \r\nBut the proposer has no content about the plan for making this platform. \r\nMoreover, their budget is nonsense for being funded. ", "q1r": 1, "q2": "The proposer does not provide enough info that's sufficient to audit the progress and the success of this project. He has no detailed roadmap, and no key metrics, they're the basic things for auditing the project. \r\nHowever, the proposer has a good awareness of the problem and explains well how this project can help to solve that. But I hope that he can discover some risks on the plan then show here in the proposal. ", "q2r": 2, "assessor": "z_assessor_671", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Using Cardano for real estate is an interesting idea and will help bring awareness and utility to the community.\r\nA recommendation would be to provide more detail in the problem statement.  Why is trust in the traditional real estate market a problem?  There is more detail in the plan, but it would help if this was quickly summarized in the problem statement.\r\nAlthough the title is attention grabbing, it does not convey what this project is about and may benefit the proposal if it described the real estate nature of the project.", "q0r": 4, "q1": "This proposal is asking for over 20% of the challenge funds, but there is no breakdown of the budget.  With a target launch date in 2024, this budget may also be insufficient for staffing or hours needed.  If additional funding is needed to keep the project going, I would recommend disclosing how that will be achieved or supplemented.\r\nConsider breaking this project into different funding rounds (fund 8, 9, etc.) in smaller intervals of 6 to 9 months.\r\nAnother recommendation is to list the team members, their relevant skills and qualifications.  If those team members are not onboard today, what/who is needed to complete the team?", "q1r": 2, "q2": "The proposal goal timeline is to get a website up by 2024, but there is no mention of major milestones nor a roadmap.\r\nThere aren't any KPI's or success measures.  A recommendation would be to put some sales, listing and active user quantity goals at certain parts of the websites lifecycles.", "q2r": 2, "assessor": "z_assessor_674", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Disrupting the real-estate market could potentially be a very beneficial development for the Cardano ecosystem, yet the proposal lacks specifics and is more of an overview of what could be potentially achieved. I would really like to see a resubmitted version of this proposal with clearer implementation details that would present a clear path to getting to the desired outcome.\r\nFor instance, smart contracts are mentioned as a way of closing real estate deals, but the description of how these would work lacks clarity.", "q0r": 2, "q1": "The proposer mentions that the product will take till the end of 2024 to build and mentioned several developers needed to complete the project, yet the requested funds of 55000 seem very low for such a task. If this is just a proposal for the first part of the project or if further outside funding will be sought I would have liked to see this clearly presented. As it stands now no mention of either is made.\r\nThe proposal lacks clear references to the skills needed to implement it and makes no mention if the proposer would also be the implementer or if outside help would have to be hired.", "q1r": 2, "q2": "The proposal would be quite difficult to audit properly as the deliverables are vague. In its current form, it lacks a detailed budget, KPIs, definitions of success, bios and references of the implementers. These elements have been marked as present in the self-assessment checklist so, if the proposer is working on them I would suggest that they be included in a future version of the proposal. \r\nMost importantly I would suggest including a clear breakdown of all costs in the requested budget. As this project requires a complex platform being built, I would have liked to see a clearer description of the development work required and a clearer task assignment, it's a larger project and it's unclear if the team would need to hire outside help. The metrics that are given are very broad and would make keeping track of precise deliverables hard.", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Com contratos inteligentes na cadeia de bloqueio Cardano, podemos eliminar corretores imobiliários e fornecer o máximo de informações que um MLS pode fornecer.", "experience": "Sou um desenvolvedor de full-stack que trabalhou de perto com três corretores imobiliários diferentes e mais de uma dúzia de agentes nos últimos 3 anos."}