{"id": 383736, "author": "itakademia", "title": "Cardano Smart Students DApp", "url": "https://cardano.ideascale.com/a/dtd/383736-48088", "category": 26240, "amount": 80000, "description": "A educação em TI e o diploma europeu devem ser acessíveis a estudantes de todo o mundo. Mas é caro e dificilmente acessível.", "funded": 1, "upvotes": 28614008, "downvotes": 16286049, "votes_result": 12327959, "votes_cast": 191, "f6_no_assessments": 9, "f6_rating": 3.814814814814815, "videos": [], "media": [], "f6_assessments": [{"q0": "Em toda minha experiência como Conselheiro Comunitário, esta pode ser uma das propostas mais ambiciosas com as quais já me deparei. A partir do meu entendimento, a proposta visa criar uma plataforma educacional (Smart Student dApp). Em parceria com universidades e escolas, mas na cadeia de bloqueio e em Cardano. Se esta proposta tivesse o sucesso pretendido, seria um enorme trunfo para pessoas em áreas remotas que não têm tantos privilégios como em outros países.  Se a equipe conseguisse iniciar colaborações com algumas universidades, seria também uma verdadeira mudança para o Ecossistema Cardano. Teria o potencial de trazer centenas de milhares de usuários. Como educador e pesquisador, acredito que parcerias ao invés de competir com universidades é o caminho certo a seguir. A declaração do problema é apresentada de forma clara e compreensível, e a solução para o problema está correlacionada tanto com a declaração do problema quanto com a definição do desafio. Se é ou não um bom uso da tesouraria depende de se o projeto é capaz de ser dimensionado adequadamente. É altamente ambicioso e tem como objetivo fazer UM LOT em um tempo muito curto, mas a proposta também é clara ao afirmar que é um investimento e desenvolvimento a longo prazo para um futuro mais longo. Eu diria que a disponibilidade e a idéia de colaboração do projeto é uma das características mais fortes desta proposta, tornando-a muito desejável se ela fosse comercializada corretamente. Depois de ler a proposta muitas vezes em profundidade, fica claro que a equipe pretende incluir Cardano como uma grande parte do desenvolvimento, e não apenas um trampolim para que ele funcione.\r\nEm resumo, concordo plenamente que esta proposta trata efetivamente deste desafio.", "q0r": 5, "q1": "Muitos detalhes úteis são fornecidos na proposta, apresentamos a filosofia central, razões e idéias que formam a estrutura do projeto juntamente com detalhes sobre como a dApp Smart Student funcionará em diferentes estágios de desenvolvimento. A idéia de conectar instituições educacionais e estudantes europeus e torná-la disponível para pessoas fora da Europa é uma tarefa gigantesca, mas a proposta fornece muitos detalhes sobre como a equipe pretende fazer com que ela funcione. A fim de combater o grande escopo do projeto, é minha opinião que a equipe consegue fornecer algumas boas soluções (quebrando as coisas em módulos, estágios, usando IA) para garantir que a plataforma seja modificável e escalável. O fato de a plataforma ter sido desenvolvida (e existir, embora não integrada à cadeia de bloqueio Cardano) desde 5 anos atrás é muito promissor, dado o escopo do projeto. A proposta inclui uma repartição orçamentária e uma justificativa para a grande quantidade de fundos solicitados. A fim de trazer mais clareza ao orçamento e à proposta em geral, eu teria gostado de ver mais detalhes fornecidos no orçamento. Por exemplo, quantas horas por semana irão para o projeto da plataforma, e quantas pessoas estão incluídas na equipe de projeto? Quantos desenvolvedores estarão trabalhando no desenvolvimento de seus aplicativos móveis, e será com o mesmo salário por hora? Quantas pessoas, no total, estão incluídas no orçamento? E por falar em equipe. A fim de aumentar a viabilidade e transparência da proposta, uma breve apresentação com os links fornecidos pela equipe central e sua experiência e competência relacionadas ao desenvolvimento do projeto fortaleceria imensamente a proposta. Alguns perfis do LinkedIn para cada um dos membros do núcleo, talvez universidades parceiras ou até mais material para dar alguma prova de trabalho anterior. Como mencionado na seção de comentários, compartilhar algum progresso do pré-desenvolvimento da aplicação que os proponentes alegam que faria uma grande diferença. Há um plano detalhado fornecido com uma perspectiva de longo prazo (talvez fosse também mais claro se a proposta esclarecesse se a equipe pretende ou não solicitar financiamento em futuros fundos catalisadores), mas mais informações sobre quem está por trás disso seria benéfico.\r\nEm suma, concordo que é altamente provável que esta proposta seja implementada com sucesso.", "q1r": 4, "q2": "Esta proposta seria muito beneficiada se tivesse incluído uma pequena seção sobre os desafios potenciais durante o desenvolvimento deste projeto. Por exemplo, (como apontado na seção de comentários), o projeto visa receber um diploma oficial credenciado dos governos da UE, ou algum tipo de selo de qualidade dos padrões da UE? Como a equipe pretende atingir esse objetivo?\r\nHá um roteiro com prazos previstos, que se estendem até 9 meses. Isto é ampliado com uma lista muito abrangente de indicadores-chave de desempenho (KPIs), embora eles sejam muito ambiciosos. 1000 estudantes matriculados e 50 institutos educacionais a bordo dentro de um ano é certamente possível se o marketing for bem feito. A equipe visa ter um sistema de classificação incorporado à plataforma (por causa da personalização para os alunos e professores, entre outras coisas), mas isto e as colaborações com as instituições proporcionarão uma \"auditoria extra\" bem necessária, uma forma de a comunidade acompanhar o desenvolvimento da plataforma. Um aspecto absolutamente fantástico disto é que a equipe pede especificamente que a Comunidade Cardano faça parte do processo de testes nas etapas finais de desenvolvimento. Durante meu tempo como Conselheiro Comunitário (e inúmeras avaliações) nunca vi esse tipo de convite, o que fala muito a favor desta proposta. Em geral, concordo plenamente que esta proposta me fornece informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 5, "assessor": "z_assessor_349", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2, "reply": "Here are some educational institutions interested in Cardano Smart Students DApp: https://gikn.eu/ ; https://collegeomega.com/ and a project of the International Higher School of Informatics and E-Leadership, Plovdiv, Bulgaria (in process of accreditation). We have presented the Smart Students DApp project to some other universities and we hope it will be accepted."}, {"q0": "O proponente planeja fazer uma plataforma de aprendizagem on-line de código aberto, que trabalhará com a UE para fornecer aos usuários o \"diploma europeu\", caso as condições sejam cumpridas. A proposta se enquadra no contexto do desafio, uma vez que será uma dapp. Está claro para mim que haverá um valor agregado para os usuários da aplicação e se implementado o impacto para a comunidade cardano e além seria grande. Dito isto, tenho algumas reservas em relação à proposta como (falta de pagamento, como foi dito). Não tenho certeza sobre o escalonamento também. Não há detalhes suficientes fornecidos para me fazer pensar que a equipe pode gerenciar todo o trabalho que precisa ser feito para tornar isto uma realidade. A proposta é extremamente ampla e tem muitas partes móveis e para mim há uma falta de detalhes na proposta que aliviaria essa preocupação.  Como desenvolvedor, estou vagueando porque eles gostariam de transformar uma plataforma para seu uso interno em vez de reutilizar uma que tenha APIs prontas para serem utilizadas com um painel administrativo e uma arquitetura necessária para manter todos os recursos e relações e apenas refatorá-la para ser usada em coalizão com a cadeia de bloqueio. Apenas me parece que é muito esforço para um resultado que pode ser alcançado de uma maneira muito mais direta.", "q0r": 4, "q1": "Infelizmente, não consegui encontrar nenhuma evidência para o conjunto de habilidades ou para o mencionado \"Akademia JSC\" ou qualquer membro da equipe, portanto nenhuma verificação nessa frente. Não há menção de membros específicos da equipe, apenas uma vaga idéia de que mais de 1000 horas ou 2 ou 3 vezes mais serão necessárias para implementar tal plataforma. Como desenvolvedor, acho esta estimativa extremamente insatisfatória, dado que a pesquisa do proponente afirma que foi feita. Dada a pesquisa feita, não vejo como isso poderia ser o caso. Há muitas plataformas de código aberto para o aprendizado semelhante à academia Khan, e os autores teriam apenas que fazer a implementação da cadeia de bloqueios em vez de reprogramar uma ferramenta interna. Falo por experiência própria quando digo que reutilizar plataformas de código aberto com uma grande comunidade é muito mais barato e melhor a longo prazo. Há um orçamento mencionado e algumas falhas são dadas, embora não haja uma lógica real por trás dos números. A proposta diz 40.000$ para um painel administrativo e 15.000$ para o desenvolvimento de um aplicativo móvel. Tenho 4 anos de experiência como desenvolvedor de andróides e posso dizer agora mesmo que 15.000$ para um aplicativo desta magnitude não vai cortá-lo. Já fiz cerca de 3-4 painéis de administração também e posso garantir que não é mais difícil do que uma aplicação móvel inteira. Isto me leva ao meu ponto anterior sobre a reutilização de uma plataforma de código aberto com e emin painel já feito. Com base nas razões mencionadas acima, não acho que o cronograma seja possível. Eu sugeriria aos autores que dividissem esta proposta em várias outras menores e trabalhassem nelas de forma crescente nas próximas rodadas de financiamento. Um orçamento para comercialização de US$ 20.000 parece estranho, uma vez que nenhuma razão ou pesquisa é dada para contabilizar este número. Na situação atual, eu não saberia se 20k é suficiente ou 10k é demais porque não há menção de plataformas ou agências que serão utilizadas. Há menção de recursos que serão necessários para implementar esta proposta, mas a todos eles faltam detalhes. Nenhum aspecto técnico é mencionado, o que é uma chatice, mas eu não posso opor isso aos proponentes e não vou deduzir pontos por esse fato. Penso que o autor da proposta pode pensar mais sobre os riscos relevantes que poderiam impedir esta proposta como: E se a UE não quiser fazer parceria com sua plataforma?  Em geral, não posso dizer que espero que a proposta seja implementada com sucesso. Simplesmente não parece viável. Espero que você tenha em mente meu feedback e volte com propostas menores para as próximas rodadas de financiamento.", "q1r": 2, "q2": "Não parece haver uma maneira fácil de acompanhar o progresso deste projeto. A primeira menção de feedback é no 9º mês quando haverá uma campanha de marketing para popularizar a plataforma, mas não vejo nenhuma menção de receber feedback da comunidade antes dessa data. Os KPIs e métricas são razoáveis, mas mais uma vez não há nenhuma menção de verificação de infrações da comunidade.  O projeto é uma boa idéia, e a descrição é suficientemente sucinta e compreensível, mas a descrição da solução precisa de mais algum trabalho da IMO.  Eu sugeriria ao proponente ver através dos olhos de um membro da comunidade que queira acompanhar e ajudar na implementação do projeto e acompanhar seu progresso. Mantê-lo em mente quando a próxima proposta estiver sendo feita, melhoraria muito a qualidade da IMHO. Em geral uma boa idéia, e desejo-lhe boa sorte nas próximas rodadas de financiamento.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 29, "ne": 20, "ng": 7, "nfo": 2, "vca_o": 2}, {"q0": "Como professor, antigo cofundador de uma Academia e membro ativo do ecossistema Catalyst, concordo que a proposta se alinha com os objetivos do desafio, já que eles pretendem utilizar a cadeia de bloqueio Cardano dentro do sistema, e que eventualmente trará mais transações e interações com a cadeia de bloqueio.\nMas para que esta proposta realmente alinhasse mais alguns detalhes sobre como e para que será usada a cadeia de bloqueio, teria sido melhor.", "q0r": 4, "q1": "Embora existam vários grupos identificados como os que farão esta proposta, e haja uma menção de uma empresa já em funcionamento em torno da educação, nenhuma ligação, referência ou mesmo experiência foi detalhada dentro da proposta. O sistema LMS a ser proposto para ser aprimorado é baseado em um sistema existente e funcional que não foi fornecido qualquer referência, link ou detalhe. O cronograma proposto tem muitas horas de trabalho que se estendem por 8 meses (2 para design e 6 para desenvolvimento da Web/API e aplicativos móveis) o que parece razoável para algumas iterações do produto, mas teria sido melhor dividir os esforços em um MVP inicial que poderia ser validado primeiro pela comunidade com menor quantidade de dinheiro solicitado e menos risco.\nO orçamento solicitado parece corresponder aos fundos já investidos pelos proponentes ($80K investidos) e detalhes sobre a alocação foram fornecidos, mas nenhuma indicação sobre como a equipe será composta, quantos UX/UI ou Desenvolvedores, haverá um Líder de Equipe? Quanto cada um dos grupos de proponentes estará envolvido.\nDetalhes sobre a divisão do orçamento foram fornecidos e poderiam parecer razoáveis para a quantidade de tempo indicada ($5K por dois meses de projeto, $40K por 6 meses de desenvolvimento), mas como a força de trabalho não é detalhada, não é possível avaliar melhor essa estimativa.\nNenhum risco ou mitigação foi fornecido, e como este é um projeto que durará quase 1 ano que deve ser considerado para o sucesso do projeto.", "q1r": 2, "q2": "Embora alguns KPIs tenham sido fornecidos sobre a quantidade de estudantes e professores que a plataforma visa atrair, esses KPIs serão viáveis uma vez que a plataforma esteja online e o marketing seja feito (9-12 meses desde o início), e como não há detalhes sobre a equipe e o esforço necessário dentro do projeto, será muito difícil para a comunidade acompanhar o progresso e o uso dos fundos durante o projeto.\nSe o projeto for votado, a primeira coisa que a equipe proponente precisa abordar é um plano detalhado que inclua as funções e o número de profissionais necessários em cada etapa e os resultados intermediários e marcos que o projeto terá para que possa ser devidamente auditado e um cronograma de financiamento adequado possa ser acordado.", "q2r": 2, "assessor": "z_assessor_288", "no_vca": 29, "ne": 16, "ng": 12, "nfo": 1, "vca_o": 2}, {"q0": "Durante a apresentação da proposta, fiquei um pouco confuso sobre como a Dapp funciona. No início, pelo que entendi, o projeto visa gerar diplomas europeus em TI através de uma Dapp chamada Cardano Smart Students. No entanto, o que era um tanto incerto era onde tais graus seriam gerados. As universidades européias estariam online, o que formaria uma espécie de parceria com a Dapp, permitindo que suas graduações fossem geradas através dela? No trecho \"o projeto representa a evolução dos \"tijolos\" (edifícios) para uma Universidade Eletrônica Virtual (VeU) - um ambiente baseado na web que modela o processo de aprendizagem na Cardano Smart Students Dapp\". Esta Universidade Virtual Eletrônica representaria as universidades que aceitariam a Dapp ou é uma única instituição? Na seção \"usuários adquiridos\": 1.000 estudantes matriculados e 50 instituições educacionais registradas na plataforma no primeiro ano\", na parte de KPIs, é mais evidente que o caso seria de várias universidades adotando o sistema. Entretanto, eu gostaria de um melhor esclarecimento sobre este assunto. No entanto, se pensarmos na teoria da coisa, é uma proposta que atinge bem os objetivos do desafio, pois criaria um Dapp que se basearia na cadeia de bloqueio Cardano para gerar graus, aumentando assim o armazenamento de informações em nossa cadeia de bloqueio. Também seria muito positivo para aqueles estudantes que, como afirmam os proponentes, não podem se dar ao luxo de se mudar para a Europa para estudar, seja por razões financeiras ou burocráticas. Outra observação que gostaria de fazer é que seria interessante para os proponentes explicar com mais detalhes os custos de utilização desta Dapp pelos estudantes. No tópico \"aquisição\", os autores da proposta explicam que algumas coisas seriam gratuitas (downloads, assinaturas, etc.) e outras seriam pagas (quando o estudante aderisse a um programa de ensino específico). Mas de quanto dinheiro estamos falando? Quem receberia este pagamento, através de fichas? Portanto, minha conclusão sobre o impacto é: a problematização é clara; a solução também. Entretanto, as especificidades deste projeto são um pouco confusas, portanto não é possível entender se o impacto seria muito positivo ou não para o ecossistema Cardano.", "q0r": 4, "q1": "Infelizmente, a equipe envolvida, It Akademia JSC, tem muito pouca informação sobre quem eles são. Eles afirmam ter o conhecimento necessário para o desenvolvimento adequado do projeto: desenvolvimento de plataformas on-line e de blockchain e TI. Mas isto é apenas um resumo. Precisamos entender mais profundamente sobre quem compõe esta equipe, quais são seus papéis individuais, como eles contribuiriam para este projeto. Também seria importante que tivéssemos alguns exemplos de trabalhos anteriores, porque, por mais que tenham explicado de forma tecnicamente impecável o que pretendem fazer, uma demonstração prática é sempre bem-vinda. Os proponentes afirmam que o projeto não começaria do zero e que já têm experiência no desenvolvimento de plataformas on-line, portanto, gostaria de ver algumas delas. Também seria muito importante entender quem na equipe seria responsável pela integração com nossa cadeia de bloqueio, qual é o seu histórico, se já têm experiência de trabalho com Cardano, etc. Quanto ao roteiro, acho que temos boas informações aqui, de modo que temos uma compreensão geral de como tudo isso funcionaria. No entanto, as explicações também são muito abrangentes. Por exemplo, no início do projeto, eles dedicam 2 meses para criar a interface, basicamente projetando o projeto UI/UX. Mas o que aconteceria no primeiro mês, e no segundo? Quem trabalharia aqui, qual é a rotina de trabalho? Da mesma forma, nas etapas seguintes, poderia ter sido mais específico. Isto nos permitiria ter uma visão mais concreta do processo. Sobre o financiamento, apesar de ser de alto valor, faz sentido com a complexidade do projeto. No entanto, mais uma vez, acho que poderia haver mais detalhes. Por exemplo, eles pedem 20k em marketing, mas não explicam por que este valor, como a estratégia publicitária seria dada, etc. Seria importante entender isto por menores. Em geral, a parte de roteiro e orçamento são bons (embora pudessem ser mais detalhados), mas a parte de apresentação da equipe deixa algo a desejar.", "q1r": 3, "q2": "A definição de KPIs é ótima. Os proponentes nos dão muitas informações sobre o que esperar, e isto abre a possibilidade de monitorar o resultado do projeto de uma maneira muito sólida. Tanto os dados quantitativos como qualitativos são fornecidos. Alguns dados se referem ao número de estudantes e instituições registradas na Dapp e outros à estabilidade da rede e à qualidade do serviço (como dizem os proponentes): \"confiabilidade, confiança, segurança e eficiência do ecossistema Cardano\"). Acredito que estas são formas bastante diversas e justas de monitorar o projeto. Além disso, é possível acompanhar o progresso do projeto no sentido de como as atividades estão se desenvolvendo, o processo da coisa, através do roteiro fornecido. Digo novamente, se o roteiro fosse mais detalhado, tal monitoramento poderia ser feito melhor. Aconselho os proponentes a quebrar um pouco mais esta parte, a fim de facilitar o monitoramento da comunidade para o projeto. Uma definição de tarefas e metas mensais provavelmente preencheria esta lacuna. Mas, em geral, acho que é uma proposta muito auditável através das informações fornecidas.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 28, "ne": 18, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": " Projeto interessante. Isto resolve um problema que muitas pessoas enfrentam ao redor do mundo (inclusive eu). Eu tive a oportunidade de ter um ano no exterior estudando engenharia (sou do Brasil) na UoM (Inglaterra) e um professor me convidou para me inscrever no programa de mestrado deles. Fiquei super empolgado, porém, quando estava conversando com o Eng. Diretor, ele disse que não havia bolsa de estudos para estudantes que não eram da UE. Dito isto, se eu tivesse a oportunidade de usar esta ferramenta naquele momento, seria fantástico. Além disso, pelo menos aqui no Brasil, devido à situação pandêmica, várias instituições continuam seus cursos on-line, portanto, acho que o momento é perfeito.", "q0r": 5, "q1": "Embora a proposta esteja bastante bem escrita, infelizmente o proponente não deu nenhuma prova de experiência (links, etc.) - a proposta ganharia muito se pudesse ser adicionada.\nUm ponto que chamou minha atenção foi a explicação do orçamento. Parece razoável, porém, logo antes de decompô-la houve uma breve explicação e ela diz \"Como o Cardano Smart Students Dapp é um projeto em cadeia e terá características únicas, então a estimativa final pode exceder duas ou mais vezes as horas necessárias para o desenvolvimento da plataforma\". O que é bastante estranho para mim, porque você está quebrando um orçamento que não tem clareza de quanto tempo precisará para desenvolvê-lo - o que é uma métrica importante, já que o preço do trabalho é baseado no tempo trabalhado. Portanto, uma informação que poderia ser acrescentada é o tempo real necessário para o desenvolvimento (uma aproximação próxima).\nUm ponto que eu não entendi é quando você vai iniciar o mercado. Se todo o anúncio começará a partir do financiamento ou você vai esperar o desenvolvimento completo. Se for a segunda opção, uma coisa a considerar é quebrar a proposta. Já que você está pedindo +/- 30% do orçamento do desafio, você poderia reduzir um pouco o escopo e ter mais chances.\nDeve ser interessante acrescentar um mapa de risco (concorrência, plataformas próprias, custos, etc.).\nUm aspecto que eu não mencionei antes é o custo. Como na declaração do problema você está realmente dizendo que o custo para adquirir um diploma da UE é alto, qual é a estratégia para torná-lo acessível a todos. Por exemplo, o salário mínimo no Brasil é de +/- 200 USD e 90% dos brasileiros ganham menos de 3,5 de seu valor (https://economia.uol.com.br/noticias/bbc/2021/12/13/calculadora-de-renda-90-brasileiros-ganham-menos-de-r-35-mil-confira-sua-posicao-lista.htm#:~:text=A%20renda%20mensal%20m%C3%A9dia%20de,as%20fontes%202019%2C%20do%20IBGE). . Portanto, pode ser uma barreira de implementação.\nDica: Um aspecto importante dessas entidades (Universidades) é sua identidade visual. Como você trabalhará como uma interface, é importante que o aplicativo permita à universidade acrescentar sua identidade visual na plataforma.\n", "q1r": 3, "q2": "Normalmente, os KPIs são um índice numérico, que dizia \"Product Capability Built\", \"NetWork Stability\" deveria ser mais bem desenvolvido. Um KPI interessante a ser seguido são aqueles associados ao marketing para ver se você está conseguindo muitas pessoas. Outra coisa que deve ser acrescentada é o número de alunos associados à sua classe social e o número de alunos por país - estas métricas devem ajudar a verificar se o objetivo de seu aplicativo está sendo alcançado.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 28, "ne": 16, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "The proposal seeks to create a DApp centred around education yet it is unclear exactly how the proposal will be linked to the Cardano ecosystem. It is difficult to determine the value this proposal will provide without a clear explanation of how it utilises blockchain technology fo its benefit, for example will there be some form of DID implementation?", "q0r": 3, "q1": "The project sets exciting and ambitious goals however without a detailed breakdown of the team and the requisite experience it is difficult to asses the feasibility of such an undertaking. Due to the large amount of requested funds a more detailed  breakdown is required.", "q1r": 3, "q2": "The project has a defined roadmap and KPIs are listed. As it is such a large undertaking it would be good to see interim metrics to measure continued success on a weekly/biweekly basis.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Providing an online Blockchain learning platform with an engaging DApps, is within the challenge brief as the project is poised to bring enormous adoption and onboarding of new members into the ecosystem.", "q0r": 5, "q1": "There is not much information about the qualification and capacity of the team to deliver on this project. However, it is clear that much thought and planning had been made couple with fact the project has been worked to some level. It is obvious that this is a proposal that might require funding beyond this funding cycle as stated and with with the budget breakdown of funds required and the articulated timelines for the project, this proposal can be effectively implemented.", "q1r": 4, "q2": "The proposal has provided enough information to assess and monitor the progress of this project. The KPI and the well detailed milestone", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 27, "ne": 0, "ng": 19, "nfo": 8, "vca_o": 1}, {"q0": "The proposal seeks to launch an online education in IT and Diploma for people all over the world who have not had opportunity to acquire IT education in Europe where IT education and Diploma is expensive and not even easy to access. The end impact is to give reliable on line educational environment for students in the world making it affordable and accessible. This is laudable. Hence my 4 star rating.", "q0r": 4, "q1": "The proposer called Akademia JCS already has experience in development of online platforms, IT education and block chain applications and are capable of implementing the project successfully. The detailed plan mentions, among others, that the education is online and will cut transportation cost; virtual E-Library, access to E-Resources, etc. bringing education closer to students all over the world. This proposal can be implemented successfully.", "q1r": 4, "q2": "The road map clearly shows 2 months, 6 months and 9 months with different schedules of work which will make auditing easy. The KPIs are also clear showing that 1,000 students are expected to be enrolled within the period; 50 educational institutions to be registered; 10,000 students and 300 additional institutions in the second year expected. All these can be measured easily. The budget is broken down with details for easy auditing. Hence my 5 star rating.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 29, "ne": 2, "ng": 23, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is a game changer and is capable of onboarding many users thereby bring value unto the cardano ecosystem. The proposal is elaborative and addresses the challenge.", "q0r": 5, "q1": "The proposer seem to posses the skill for the task. The proposer however has not provided any information about the team members who will assist in the execution of the project.  Furthermore more the budget is not so elaborative which makes it a little difficult to draw a reasonable conclusion.", "q1r": 3, "q2": "The proposer has done a great job by outlining the roadmap,  listed the KPI's and clearly stated how success will look like when the project is executed. ", "q2r": 5, "assessor": "z_assessor_420", "no_vca": 26, "ne": 1, "ng": 14, "nfo": 11, "vca_o": 1}], "solution": "O diploma europeu em TI poderia ser obtido on-line através do Smart Student DApp e seu ecossistema, sem comissão na rede Cardano.", "experience": "A Akademia JSC tem ampla experiência no desenvolvimento de plataformas on-line, educação em TI e aplicações de cadeias de bloqueios."}