{"id": 383849, "author": "sucy", "title": "Virtual Billboard", "url": "https://cardano.ideascale.com/a/dtd/383849-48088", "category": 26240, "amount": 60000, "description": "As pessoas estão comprando terras e mais na cadeia de bloqueio. Os usuários podem anunciar estes bens e mais dentro do Metaverso com outdoors virtuais.", "funded": 0, "upvotes": 14772493, "downvotes": 19810969, "votes_result": 5038476, "votes_cast": 166, "f6_no_assessments": 6, "f6_rating": 1.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta visa criar uma plataforma de venda de anúncios, onde as empresas possam anunciar ativos e serviços virtualmente. Não é segredo que projetos metaversos têm explodido ultimamente, e esta proposta parece ir de mãos dadas com isso. Gostaria de ter visto uma formulação mais clara ou detalhada da declaração e solução do problema, e principalmente como ela está relacionada com o crescimento da Cardano. Estou assumindo que a plataforma será construída sobre Cardano ou usada de alguma forma, mas isto não está claro, já que a equipe pretende construir a plataforma em cima de uma plataforma já existente. A fim de avaliar esta proposta adequadamente, eu gostaria de ter visto uma explicação mais completa de 1: qual é o projeto e como ele será desenvolvido? 2: Como ele irá atender as necessidades dos usuários de Cardano? E por último 3: O que a proposta proporcionará ao ecossistema? Se muitos anúncios em diferentes plataformas atrairão empresas maiores para anunciar na plataforma, descreva como a equipe pretende alcançar isso e como isso trará valor a todo o quadro. Onde estará o foco? A imutabilidade da tecnologia da cadeia de bloqueio pode de fato revolucionar muitas indústrias diferentes, mas para que eu (como um Conselheiro Comunitário experiente) possa avaliar com justiça o impacto da proposta, ela precisaria conter mais detalhes. Uma vez que o financiamento solicitado é bastante substancial de mais de 20% do orçamento total do desafio, este tipo de informação é importante. Não há nada de errado com o conceito central, eu gostaria apenas de saber mais. Em resumo, discordo que esta proposta aborde efetivamente o desafio.", "q0r": 2, "q1": "Creio que esta proposta se beneficiaria muito com uma breve apresentação da equipe principal, juntamente com links suficientes fornecidos para verificar sua competência e experiência. Talvez um link para projetos anteriores, ou perfis LinkedIn? Se a equipe tem 12 anos de experiência no desenvolvimento de campanhas publicitárias de alta qualidade e no gerenciamento da Times Square, deve haver muitas informações a serem compartilhadas a partir disso. E todas essas informações beneficiariam a proposta. Dito isto, a equipe se refere ao seu projeto GOTIGER (quando solicitado algumas informações sobre a equipe nos comentários), mas infelizmente não há muitas informações relacionadas nem à equipe nem a este projeto em particular que pode ser encontrado lá.\r\n\r\nIsto vai de mãos dadas com a alocação do orçamento, que eu gostaria de ser um pouco mais detalhado. Por exemplo, saber quantos Gerentes de Produto ou Desenvolvedores fazem parte da equipe, como o orçamento será alocado entre os indivíduos juntamente com quantas horas de trabalho são estimadas para cada posição realmente aumentaria a viabilidade da proposta. E, posteriormente, a confiança na equipe. Finalmente, para que a proposta fosse mais tangível, eu gostaria de ver uma explicação mais detalhada sobre o que o projeto pretende fazer. Para que seja entendida pelas ACs e pelo público em geral, precisaria conter explicações que dissessem imediatamente se a proposta visa ter seus Painéis Virtuais em metáforas já existentes, ou se eles pretendem hospedar seus próprios espaços. Eu poderia estar errado ao questionar a tangibilidade das explicações das propostas, e ficaria feliz em ser corrigido se este for o caso. Devido à falta de informações fornecidas na proposta, discordo que esta proposta seja implementada com sucesso.", "q1r": 2, "q2": "A proposta inclui algumas informações valiosas sobre medidas de sucesso, e KPIs, embora se beneficiaria de mais detalhes. Se houvesse um roteiro com marcos e prazos estimados adicionados e depois fundidos com algumas informações de KPI, acredito que isso aumentaria muito a qualidade da proposta. Por exemplo: Após 3 meses após o financiamento, pretendemos ter 5 cidades virtuais incorporadas no sistema, após 6 meses esperamos ter 25 campanhas publicitárias ativas (no mínimo) em cada cidade virtual. Após 12 meses, reuniremos informações sobre quanta presença nosso projeto terá nas mídias sociais, e mediremos os níveis de sucesso de acordo com esta escala: [números]. Novamente, estas explicações são apenas algaraviadas. O que eu estou tentando dizer precisa de esclarecimento é o conceito e a apresentação. Além disso, um canal onde a comunidade ou os investidores/usuários das plataformas possam monitorar e interagir com os proponentes aumentaria ainda mais o nível de auditabilidade do projeto como um todo. A partir de minha experiência como Conselheiro Comunitário e trabalhando com a tecnologia Blockchain, a transparência é parte integrante do mesmo. Se esta proposta refletisse esse tipo de transparência para com seus usuários e investidores, ela seria muito benéfica. Uma breve descrição dos riscos potenciais e obstáculos ao desenvolvimento também fortaleceria a confiança na competência da equipe e provaria que a equipe tem uma profunda compreensão e perspectiva da indústria e do projeto. Em geral, discordo que esta proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 20, "ne": 12, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Concordo que esta proposta trata efetivamente do desafio. Em certa medida, ela dá uma boa idéia com base no domínio de trabalho do proponente.\r\n\r\n\r\nO que me está faltando, no entanto, é por isso cardano? Qual é a visão da empresa em mudar para o espaço da cadeia de bloqueio e como Cardano se encaixa neste espaço e não em qualquer outra cadeia de bloqueio, como Solana, Ethereum etc. ?\r\n\r\nTambém teria sido bom se a proposta mencionasse por que e como o sistema cardano eco crescerá OU terá um impacto positivo se esta proposta for implementada com sucesso.\r\n\r\nHá certamente espaço para melhorias na solução aqui apresentada, portanto não concordo plenamente", "q0r": 4, "q1": "Eu discordo, uma razão é que eles afirmam ter 12 anos de experiência em desenvolvimento, mas quem são esses desenvolvedores ? Quais são as suas credenciais ? Qual é o envolvimento deles no espaço de desenvolvimento em cadeia de blocos ? Estes detalhes não são apresentados, portanto, não posso concordar que a equipe tenha boa experiência para a implementação desta proposta. Seria muito melhor se o proponente da próxima vez fornecesse bons detalhes sobre a equipe para que eles possam alcançar uma pontuação mais alta no processo de revisão.\r\n\r\nO plano mencionado é um plano detalhado, e foi feita uma proposta genérica de como a cadeia de bloqueio pode ajudar com sua natureza imutável. Mas isto não é suficiente imo, eu acho que o proponente deveria gastar mais detalhes ali, sobre quais problemas (com exemplos do mundo real, já que eles já são uma empresa que trabalha com casos reais de uso) existem e como sua solução (com exemplos) ajudará neste domínio.\r\n\r\nAlém disso, a repartição do orçamento não é feita corretamente. Como este número de 60k$ é alcançado, este é um valor bastante alto, mas nenhuma outra informação é dada sobre quantos desenvolvedores irão trabalhar, qual é o modelo de distribuição para o orçamento, por exemplo, front end, back end, contrato inteligente, testes, etc., taxa mensal OU taxas horárias", "q1r": 2, "q2": "Discordo totalmente que estas informações fornecidas sejam suficientes para auditar o progresso e o sucesso desta proposta.\r\n\r\nO KPI é mencionado, mas falta totalmente o roteiro, nem qualquer informação disponível da equipe na própria proposta. Alguns membros da comunidade mencionaram este ponto nos comentários e o proponente forneceu um link, no entanto, não consigo encontrar nenhuma informação sobre a experiência técnica dos membros da equipe, especialmente no contexto da programação da cadeia de bloqueios (plutus).\r\n\r\nSe o roteiro em si não for dado com uma clara distribuição de marcos, que podem ser rastreados pelo menos quinzenalmente se não semanalmente, então vejo que esta não é uma boa proposta escrita.", "q2r": 1, "assessor": "z_assessor_454", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement chosen is a very vast area for making provision for the B to B platform where businesses can advertise their assests and and services being provided by them but the platform just focuses on developing a ad selling platform focusing mostly on the virtual assets than the actual scope of it in thecardano based blockchain ar any relevant necessity of using cardano features for the same.  ", "q0r": 2, "q1": "The proposal mentions about having experience of developing ad software and managing campaigns but doesn't provide details on relevant info on either developers with technical expertice for building platform. Also the proposal doesn't provide details on phase wise details of technical implementation and experince/plan to implement the proposal including these informations would have been great way to approach for the fund request.", "q1r": 2, "q2": "The proposal unfortunately doesn't hold the details to how the proposal will be realised wrt to phase wise details or milestones which would have been an important metric to measure the progress of the project. Also there is no details on fund breakdown wrt time of work apart from highleve team wise fund requirement, adding these details would have been plus point for funds to trustfully served to the proposer and audit the project progress", "q2r": 1, "assessor": "z_assessor_16", "no_vca": 22, "ne": 3, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "Simple solution to answer the problem. Since metaverse is a hot thing nowadays and Facebook announced that they wants to expand its business into the world of the metaverse, this idea will booming if Metaverse boom starting. But, some things concerns me. While the Metaverse world are already booming in Ethereum platform and Cardano is still working on its ecosystem, how proposer will build the virtual billboard project? Maybe try to build on Ethereum then bridge the code to Cardano ecosystem? Or what will proposer do? I personally, think that this Virtual Billboard project will get great traction from the community IF Metaverse Cardano is up and running. Before that, the proposer should do further research on this project", "q0r": 3, "q1": "Team have 12 years of experiences in real life, this project seems a little ambitious. Although they said it was easier to build a virtual billboard in the metaverse, the proponents didn't say anything about the schedule or what they would be working on. This proposal did not mention anything how much time they will work on, what metaverse they already research and approach to take partnership with, or when they will finish the product. Budgets are only written in general without further explanation. The author replied to some comments asking for information about the team with the link THEGOTIGER.com, but the credentials and or experiences of the members are still nowhere to be found.", "q1r": 1, "q2": "KPIs are clearly written with a simple way. But without a  detail roadmap, this proposal becomes difficult to audit publicly. KPI wanted us to know that the team would be creating a virtual billboard in metaverse cities/lands. But the proposer did not mention what specific virtual cities/lands they would approach. At least the proposer should already have done a little research on what virtual cities/land would be interesting to build a virtual billboard, that would be great.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This is a revolutionary idea in which the proposer clearly explain the problem and offers a great solution. Definitely such projects have a positive impact on the Cardano ecosystem but it is not explained how this idea would have an impact on the Cardano ecosystem nor is Cardano mentioned at all. The KPIs cited by the proposer partially correspond to the ones indicated in the challenge and proposal is not able to scale and address future challenges.", "q0r": 2, "q1": "The link to the website that the team provided is not transparent. We do not know how many people would work on this project and we do not have a clear insight into whether there are skills, knowledge and experience needed to realize this idea. We do not have information on the website how this idea will be realized and adapted to Cardano and there is no indication that there is experience and skill required for such an operation. The budget is clearly presented but not realistic and is not broken down into identifiable items. The plan was not elaborated in the proposal and details of actionable tasks and order of execution were not presented. It would be great to present a time frame within on how to implement this idea with clear dates and to list the necessary resources and technical aspects of the implementation itself. Unfortunately the proposal does not mention possible risks.", "q1r": 1, "q2": "It would be great if this superb idea was followed by a roadmap with milestones and a time horizon for achievement and if the KPIs where worked out everything would be in place. Unfortunately, the community cannot follow the further development of this idea due to lack of information.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal assumes the metaverse is already in existence, something already running on Cardano, rather than something which will take years, to decades to build. \r\nThe impact of the project presented in the proposal would be non-existent, simply because what is being proposed can't be deployed at this point in time. This will surely still be the case in the timeframe presented in the proposal, of a few months.\r\nIt's this CA's assumption that the proposers are simply trying to play on the metaverse hype, without giving too much thought to the concept.\r\nI would recommend studying the topics of blockchain and metaverse more before potentially resubmitting the proposal. Digital advertising in the metaverse is sure to be an explosive topic once the metaverse is actually implemented.", "q0r": 1, "q1": "Besides the concept of \"billboards in the metaverse\", almost no details are given about how the project would actually work, making it almost impossible to assess if it can be successfully completed.\r\nI would suggest a stronger emphasis on the \"how\" of the project next time.\r\nA brief mention regarding the team behind the proposal is made, however, no actual identifying information is given, even though the \"Included identifying information about all proposers\" requirement was marked as successfully completed in the self-assessment checklist. Not knowing who is behind the project makes it very hard to assess if it would actually be completed. No mention is made about if and what roles would need to be recruited for.", "q1r": 2, "q2": "The KPIs are very vague and don't go in-depth, and no definitions of success are given making tracking the deliverables of the project a very hard task.\r\nThe breakdown of the budget is very shallow in its current form. I would suggest giving it more thought and elaborating more on each budget line before resubmitting the proposal.", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Desenvolveremos uma plataforma programática de venda de anúncios com configurações sob medida onde os compradores podem anunciar ativos e serviços virtualmente.", "experience": "Nossa equipe tem mais de 12 anos de experiência no desenvolvimento de software publicitário de alta qualidade e interativo DOOH e na gestão de campanhas publicitárias da Times Square."}