{"id": 384218, "author": "megasquallers", "title": "Rythmeet:a versatile music platform", "url": "https://cardano.ideascale.com/a/dtd/384218-48088", "category": 26240, "amount": 35000, "description": "A música não é acessível a todos e a ADA não atrai pessoas de fora da bolha criptográfica", "funded": 1, "upvotes": 54679167, "downvotes": 7837628, "votes_result": 46841539, "votes_cast": 298, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Impacto:\r\nRythmeet propõe atrair usuários para Cardano através da construção de uma plataforma de locação/venda/agendamento de música no topo do ecossistema Cardano com o objetivo de facilitar o acesso aos instrumentos musicais, aulas e concertos enquanto introduz o mundo da música Cardano.  Eles propõem usar o ADA como um meio de troca de bens em serviços transacionados na Blockchain.  A Rythmeet planeja trazer músicos para a eco-esfera Cardano, fornecendo uma plataforma onde eles possam se encontrar e construir grupos, alugar e vender instrumentos, ao mesmo tempo em que obtêm muita necessidade de exposição ao ADA.  \r\nEste projeto propõe usar o apelo universal da música para criar uma plataforma musical que tenha o potencial de atrair mais adoção para o ecossistema.  A proposta Rythmeet estabelece uma definição muito concisa e clara do problema da adoção por parte dos usuários que não usam a moeda de cachimbo dentro do espaço da cadeia de bloqueio.  Ela estabelece o potencial para aumentar a capitalização da participação no mercado mundial de instrumentos musicais no valor de US$ 10 a US$ 11,5 bilhões.  É um argumento convincente para criar um mercado de instrumentos musicais peer-to-peer e capturar o mercado de aproximadamente 68 bilhões de instrumentos musicais peer-to-peer no processo.\r\nAlém disso, a proposta ilustra as 2 partes principais que compõem a proposta, sendo uma a criação da plataforma Rythmeet e a outra uma plataforma (rm)NFT onde artistas e músicos podem cunhar e vender NFTs e integrar-se diretamente com contratos inteligentes, tudo a partir da mesma plataforma.\r\nA proposta vai em profundidade para descrever cenários muito detalhados e usar casos para apoiar sua reivindicação e como a ADA e a Cardano trabalharão para provocar esta adoção em massa no mundo da música. Os proponentes planejam imergir os músicos, permitindo que a plataforma ajude os músicos a encontrar locais de atuação, permitindo que os músicos pré-visualizem as capacidades musicais dos membros potenciais da banda antes de se conectarem enquanto usam a plataforma como um recurso de captação de recursos.  O dinheiro arrecadado pagará bolsas de estudo para escolas de música para estudantes que não podem pagar taxas de inscrição para escolas de música. Usar a plataforma Cardano desta forma ajuda a aumentar o volume total do ADA envolvido em transações de aplicativos, ajuda a aumentar o uso de recursos por aplicativos e ajuda a aumentar o número de transações de aplicativos.  \r\nA proposta continua sendo inicial, pois expõe seus desafios para o futuro na percepção de que as pessoas podem não estar confortáveis com transações em moeda criptográfica.  A equipe entende que os músicos podem achar o uso do ADA complicado e reconhece que este é um desafio futuro potencial que eles estão dispostos a enfrentar. A equipe também reconhece que os instrumentos musicais são muito caros, e as pessoas podem não confiar na plataforma para compensar a perda/roubo ou a danificação dos instrumentos musicais.  Eles acreditam que um contrato inteligente pode ajudar a aliviar algumas das questões nesta área.  O projeto reconhece que a transparência terá que estar na vanguarda do aspecto de captação de recursos da plataforma e está preparado para ser exatamente isso em seu esforço. PONTUAÇÃO DE AVALIAÇÃO 5\r\n", "q0r": 5, "q1": "Viabilidade:\r\nO projeto Rythmeet vem preparado com um plano sólido e bem definido, elaborado através de linhas de tempo.\r\nOs cronogramas das semanas 1 e 2 incluem: Criação do website e das estruturas iniciais da plataforma de comércio eletrônico, instalação de plugins e divulgação dos documentos do projeto para os membros da equipe de desenvolvimento.\r\nSemana 3 - 5 Envolve o desenvolvimento dos processos que permitem o aluguel e o comércio de itens físicos.\r\nSemana 6 vê o desenvolvimento de recursos de pagamento que permitem aos usuários da Web negociar com Cardano (ADA)\r\nNa semana 7, a equipe planeja desenvolver características para cada conta, tais como mudança de perfil, compartilhamento de informações através das mídias sociais.\r\nA Semana 8 verá o desenvolvimento de recursos do tipo comunidade entre contas como classificação, revisão e bate-papo de texto.\r\nA Semana 9 envolverá testes de sistema para recebimento e inspeções.  Search Engine Optimization, solução de problemas derivados dos testes do sistema.\r\nA Semana 10 tratará de problemas de lançamento encontrados pelos usuários.  Esta parte da linha do tempo sugere testes alfa ou beta, mas não diz diretamente isso.\r\nNos próximos meses, o projeto pretende realizar mais análises comerciais e adicionar recursos com base nas opiniões dos usuários.\r\nEste projeto delineia um orçamento bem desenvolvido, assim como um modelo de receita sustentável, durável e auto-suficiente.  \r\nParte do modelo de renda descreve como, para as aulas de música, aluguel de instrumentos/materiais, venda de instrumentos/materiais e locais para alugar, o professor/locatário/vendedor obterá 100% do preço que deseja. As taxas serão adicionadas com base em 8% se o comprador pagar usando ADA ou 15% se o comprador usar outra moeda. Ambos os preços serão indicados na plataforma para pressionar as pessoas a usar o ADA.\r\nUma opção para colocar o anúncio no topo da lista estará disponível por uma taxa de 2$ ou o equivalente a 1,50$ em ADA por semana.\r\nPara as pessoas que procuram um grupo musical para dar um concerto particular a título de remuneração, haverá uma taxa de 8% usando ADA ou 15% usando outras moedas sobre o valor total pago.\r\nA preocupação com um modelo de receita que depende da ADA é que a flutuação de preços devido à volatilidade inerente do mercado de moedas criptográficas afetará a estrutura de taxas/pagamentos do modelo de receita.  A taxa de 8% será baseada no preço de mercado atual e poderá ser diferente para cada indivíduo envolvido, com base no tempo da transação.\r\nA definição de sucesso do projeto inclui:\r\n3 meses: O website Rythmeet é lançado e os primeiros usuários começam a se registrar.\r\n6 meses: Todos os problemas técnicos foram resolvidos e o site funciona sem problemas. Atingimos 5.000 usuários e 15% deles usam a moeda Cardano. Estamos desenvolvendo a parte NFT em paralelo (se nossa 2ª proposta for aceita no Fundo nº 8).\r\n12 meses: Alcançamos 15.000 usuários e 50% deles estão usando a moeda Cardano. As pessoas começam a dar dinheiro para o projeto de captação de recursos. Também teremos lançado a nova plataforma Rythmeet 2.0 incluindo a cunhagem NFT e as vendas se nossa 2ª proposta for aceita no Fundo #8.\r\nO projeto é apoiado por uma forte equipe experiente com vários anos de backend, frontend, desenvolvimento UI/UX.  Design gráfico, desenvolvimento de software, experiência em gerenciamento de projetos ágeis e de cachoeiras.  A equipe está empilhada com todas as pessoas certas no lugar para conseguir isso.  A proposta parece estar pronta para cumprir seus objetivos declarados ESCORDO DE AVALIAÇÃO 4\r\n", "q1r": 4, "q2": "Audibilidade:\r\nO projeto traça marcos detalhados que podem ser utilizados para acompanhar seu progresso:\r\n Etapa 1: Definição do projeto definindo formalmente o cenário jurídico necessário para assegurar a função central da plataforma.\r\nIntegração de um CDN e desenvolvimento de um banco de dados .NET ou SQL para todas as funções necessárias no local.\r\nDefinição do público-alvo on-line e do mercado alvo, a fim de ajudar os designers a entender as preferências do usuário final com a intenção de criar uma experiência incrível para o usuário.\r\nEtapa 2: Planejamento baseado em dados coletados, criando uma visão Birdseye do mapa do site para determinar a lista e o número de páginas, juntamente com sua colocação e relacionamento no site.  A fase de planejamento também inclui elementos voltados para o usuário e elementos backend.  O mapa do site ajuda a definir e organizar o conteúdo de uma maneira coerente.\r\nA fase 3 abrange o aspecto de design onde o design da interface do usuário irá incorporar a marca.  O estágio 3 é crítico para o sucesso deste programa à medida que mentes criativas se reúnem para criar uma representação visual do projeto.  \r\nA etapa 4 envolve a criação de conteúdo.  Isto marca os estágios iniciais do ciclo de desenvolvimento real.  Vários elementos de conteúdo incluem:\r\nPáginas de aterrissagem\r\nDepoimentos\r\nPublicações no blog\r\nImagens\r\nDescrição do produto/serviço\r\nEstudos de caso\r\nA etapa 4 permite que os redatores do projeto elaborem mensagens convincentes que chamem a atenção. A equipe do projeto entrará então em desenvolvimento na etapa 5.  Isto inclui testes de funcionalidade do site do desenvolvedor e outros desenvolvimentos backend/front-end.\r\nA etapa 6 está testando e é uma das fases mais críticas do projeto.  O software será colocado à prova a fim de garantir que tudo funcione corretamente.  É desta vez que os validadores serão usados para garantir a integridade do código/desenvolvimento.\r\nA fase 7 é a fase de manutenção onde o cronograma de desenvolvimento é estabelecido e é projetado para que o trabalho seja feito.  \r\nA linha do tempo do projeto apresenta soluções de planejamento robustas e eficientes projetadas para obter resultados enquanto aumenta funcionalmente. O prospero planeja fazer um caso muito convincente para o usuário do ADA como um meio regular de intercâmbio.  Este projeto tem tudo isso, uma equipe bem formada, um plano sólido, quebra de orçamento, indicadores-chave de desempenho, os trabalhos!  PONTUAÇÃO DE AVALIAÇÃO 5\r\n", "q2r": 5, "assessor": "z_assessor_479", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is a great approach to creating a excellent web product that is user friendly, searchable, and available. I agree music would be great on Cardano to bring people together.\r\nThis is an important proposal to integrate new developers and connect them.\r\nThe proposal clearly articulates the contest, the problem (most of websites offer a platform where to sell NFTs, but not a place to create them) and how it will add value to the Cardano ecosystem and for all of the stakeholders (to bring people that are outside the crypto bubble and not aware of new technologies, into the Cardano community).", "q0r": 5, "q1": "The proposer team is skilled about the context and experienced, knows the Cardano community very well because there are 2 PhDs with 8 years in research and project management, and the team with 30 years cumulated in software development and project management.\r\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, coherent KPI metrics and a defined time horizon. The only thing I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in market adoption, revenue model for cardano ecosystem and SPOs…) The proposal offers a realistic timetable to complete the work.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 33, "ne": 4, "ng": 19, "nfo": 10, "vca_o": 1}, {"q0": "The proposers want to create a platform targeting musicialns that want to find rental places to play and rental instruments as well. Basically connecting musicians with their future place of work. Further down the path, the platform will allow musicians to mint nft and sell them along with a couple of other functionalities. The proposal matches the category it's in and it's challenge settings. It's calerly articulated how this project will bring in new people outside of the crypto buble into the ecosystem. The key metrics are good and relevat to the challenge settings. The proposer has already thought of possible challenges and specified solutions or at least paths to take based on them. Currently I'm lacking a place where I as a community member can follow the progress of the project's implementation, because no repository or social media links were provided. This proposal will bring artists to the cardano ecosystem. That would mean more money flowing through the cardano network, which is always good. I don't have any concerns about this proposal except for maybe more auditability and tracability of the project. ", "q0r": 5, "q1": "The proposer has provided names and team members which I was able to verify along with their skill set. A clear idea of how many team members of what type are necessary to do the work is described. The budget is outlined clearly and broken down in items, but could have been even more concrete like mostt projects are doing giving either reference points or hourly rates. As a developer myself, the timetable for the described work seems reasonable. There's a sensible plan for implementation that shows what's going to be done and in what manner.   The proposer has done great analysis of the challenges and risks relevant to a successfull implementation of the project. Not only that but has plans how to evolve the project further down the line and having that clear vision is what helps products such as this one keep north. The projects has plan to reuse some smart contracts functionality and build on top of what the community provides further down the line, which is a great indicator the project and authors have a clear view and understanding of where things are right now and how to take advantage of the ecosystem. Good luck to you and the project!", "q1r": 5, "q2": "Tracability is the one part I'm a bit concerned about that is somewhat aliviated by the mention of social platforms and total transparency along with giving money to charity, but some more concrete evidence would have been welcomed. The metrics and KPIs are present and on point. A proces that can be measured can be optimised and I write that everywhere I go because I believe in that. The roadmap with milestones is easay to follow and the time given for implementation and realization of all steps seems reasonable. There's a clear and understandable description of what problem is being solved and a clear and sensible explanation on the problem solved and how will future users be incentivised to use the platform and ADA in particular.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Traga músicos para o mundo Cardano fornecendo uma plataforma onde eles podem encontrar e construir grupos, alugar e vender instrumentos e descobrir o ADA", "experience": "Proponente: 2 PhDs, 8 anos em pesquisa e gerenciamento de projetos\nEquipe: 30 anos acumulados em desenvolvimento de software e gerenciamento de projetos"}