{"id": 385138, "author": "javiertc86", "title": "Distributed storage Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/385138-48088", "category": 26240, "amount": 15000, "description": "A manutenção de uma infra-estrutura IPFS é demorada e cara.", "funded": 1, "upvotes": 75187394, "downvotes": 3789782, "votes_result": 71397612, "votes_cast": 324, "f6_no_assessments": 4, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta enfrenta o desafio de forma muito eficaz e fornece um plano completo para construir um conjunto de ferramentas de desenvolvimento para solução de armazenamento descentralizado usando IPFS em Cardano. Eles articulam claramente como abordariam este problema, fornecendo um API e ferramentas de desenvolvimento (SDKs) de fácil utilização e alta disponibilidade para interagir com o IPFS. A criação destas ferramentas para o desenvolvedor facilitará o desenvolvimento das pessoas que estão desenvolvendo em Cardano (particularmente para o criador de NFTs), ao mesmo tempo em que atrairia mais desenvolvedores para construir em Cardano (menor barreira de entrada para entrar no desenvolvimento), o que eventualmente levaria à crescente adoção do dApp construído em Cardano.", "q0r": 5, "q1": "Esta proposta provou ter uma equipe experiente e excepcional, e podemos verificar seu perfil no Linkedin. Não apenas o papel da equipe está bem estabelecido e explicado em detalhes, cada pessoa também tem mais de 7 anos de experiência prévia em sua respectiva área. O orçamento é razoável para o salário de hoje de cada função respectiva, mas faltam detalhes sobre o que custaria. Seria útil se pelo menos eles pudessem fornecer mais detalhes, por exemplo, sobre o custo da infra-estrutura do servidor: que tipo de servidor você usaria? Quanto custa e manter? etc. Além do orçamento, eles fornecem um plano de implementação de forma sensata e conduzível, por exemplo, como seria o JS SDK, quais são os pontos finais da API HTTP, como a interface do usuário seria implementada, etc. O motivo pelo qual não estou dando uma 5 estrelas, é a falta de detalhes orçamentários, especialmente em relação ao orçamento de 'infraestrutura de servidor'. Fora isso, de modo geral, esta proposta tem um grande potencial de ser implementada com sucesso.", "q1r": 4, "q2": "O sucesso desta proposta é claramente definido e facilmente medido no sentido de que os APIs e os SDKs ou são entregues com sucesso ou não são. Entretanto, eles não especificaram que estes SDKs serão de fonte aberta no Github ou não, e isso tornará menos transparente a verificação do progresso ao longo do caminho. Olhando para seu repo anterior Github (cardano-wallet-js), parece que eles poderiam facilmente criar um novo repo sob o tango-crypto. Mas, novamente, como parece ser um serviço pago (de seu site, existem camadas para serviços diferentes), não posso ter certeza se eles fariam este repo de fonte aberta ou não. Dando 4 estrelas porque eu gostaria de ter certeza sobre como verificar o progresso de forma mais transparente.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Could not stress enough how important distributed storage is for DApps going forward.\r\n\r\nIn fact, most \"decentralized\" applications still rely on some centralized backend utilising PostgresQL or some other database. This challenge is perfect for the Cardano and web3 ecosystem in general, and could be utilised, if successful, by basically every DApp.", "q0r": 5, "q1": "Given the progress made on other tools created by the team members, the progress on the API endpoints that the team has mapped out already I cannot give this proposal any less than 5 stars when it comes to how likely it is that team will successfully implement this roadmap and reach their milestones.", "q1r": 5, "q2": "The roadmap too, looks great. Roadmap includes detailed milestones with specific KPis for each which is what I generally like to see because it greatly enhances our ability to audit the success of the proposal.\r\n\r\nThe team has provided a very detailed look into the very API endpoints that they are creating for this JS SDK.\r\n\r\nThis proposal is highly auditable and is definitely worth of 5 stars!\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal will have a positive effect on the Cardano ecosystem and will drive NFT consumers and producers to Cardano, however the risk could be in gateways which seem to be centralized. This could lead to time lag when resolving IPFS URLs. ", "q0r": 4, "q1": "The proposers have a vast range of experience with all things Cardano and have presented a rich amount of evidence to that effect. ", "q1r": 5, "q2": "Going from the history of the team, it is very likely that their solution will be open-sourced, and therefore subject to public scrutiny, although that is not explicitly mentioned. ", "q2r": 4, "assessor": "z_assessor_832", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "Decentralised File Systems like IPFS are fundamental to build pure DApps. This proposal will heavily drive an increase of the utility and adoption of Cardano by allowing other projects to use IPFS through their APIs. Plus, it will provide a service layer which will allow to mint NFTs. To me, it looks like an essential piece of infrastructure needed by other projects, in order to be more productive and focus more on Their business objectives.", "q0r": 5, "q1": "The plan is detailed and clear. The team is experienced and has built with success several other applications in the Blockchain space. From my point of view, the budget should have been a bit higher to cater for unforeseen circumstances. \r\nOf course, I believe the server infrastructure is 9000 and not 90k - That 90k is probably a typo. ", "q1r": 4, "q2": "The proposal roadmap is simple, clear, and can be audited effectively. I really wish I could give 5 stars, because the roadmap is linear and easy to audit. However, we are  missing Key elements from the challenge that is the measure of the growth/usage of the system.\r\nI think this is because in the roadmap are mixed the auditability with the implementation plan and. There is a simple way to add the missing important information: I would have added one more step to the roadmap: After the service is launched, monitor (1) how many projects are actually using the APIs, and (2) how many files are added to IPFS, (3) how many NFTs are minted. \r\n", "q2r": 4, "assessor": "z_assessor_956", "no_vca": 22, "ne": 7, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Fornecemos API e SDK HTTP fáceis de usar para armazenamento IPFS.", "experience": "Operamos o pool de estacas TANGO e desenvolvemos o Cardano-wallet-js e o Tangocrypto Software as a Service."}