{"id": 396554, "author": "joshf", "title": "Cardano Hubs Directory", "url": "https://cardano.ideascale.com/a/dtd/396554-48088", "category": 26439, "amount": 28000, "description": " Community hubs lack the visibility needed in order to attract new members, connect with each other and share resources.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 208, "q0": "The solution and problem outlined in this proposal are aligned with the challenge setting. Cardano community hubs currently operate in a fragmented manner and it would be advantageous to create an open platform that all hubs within Cardano can use to spread the word about their location, resources, and objectives. \n\nOne of the main objectives of this challenge is to enable others \"pursue their goals within the ecosystem, both macro, for Catalyst and micro, within the Challenges themselves.\" This proposal, in theory, would enable the hubs within Cardano to obtain a broader reach within the ecosystem, thereby enhancing their ability to pursue their specific goals. \n\nBy creating a central database for all cardano hubs collaboration potential between hubs exponentially increases. \n\nOverall, this proposal fits the challenge setting because it will enhance the ability for hubs to communicate with the community and collaborate amongst each other.", "q0r": 5, "q1": "It is evident that the plan and implementation of the plan has been well thought out by the proposer and team members within the proposals. By communicating past proposals and detailing sustained involvement in the catalyst community, the proposer creates a compelling narrative of why this team is incentivized and well equipped to deliver on the promises within the proposal.\n\nThe roadmap and budget allocations are logical and reasonable. The objectives laid out for 1, 3, and 6 months are feasible to complete in the communicated time frame. The proposed spending communicated aligns with the objectives laid out in the roadmap.\n\nOverall this proposal is highly likely to be implemented successfully based off the experienced and capable team, feasible timelines, and cohesive budget allocation that aligns with objectives on the road map.", "q1r": 5, "q2": "This proposal can be easily audited should the team provide development updates. Should the key metrics detailed be provided regularly as the proposal progresses, the community will be able to gauge the success of this proposal. \n\nThe team involved in the proposal seems to have a sound understanding of their target audience through their continuous involvement in the Catalyst and Cardano community. \n\nThe proposer communicates what success will look like with seemingly reasonable numbers about servicing and onboarding x # of hubs throughout different time frames. \n\nOverall this proposal will be key in \"Delivering information to people who would not otherwise have the access.\" by providing a central database for Cardano hubs to share their objectives, events, and locations. \n\nThis proposal can feasibly be audited should the team communicate development updates and key metric updates.", "q2r": 4, "assessor": "z_assessor_1087", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"id": 480, "q0": "Directories as we all know is an essential user base platform that helps to find crucial information about a business/institution. This proposer seeks to create a central repository for all Cardano community hubs globally and this is a wonderful idea to grow the Cardano ecosystem. This intended directory hub will create a good user experience, taking inspiration from the AirBnB user interface model and that in my view will help users have a simple interface to interact with. The problem statement looks at the lack of visibility needed to attract new members and connect and share resources. Given this, the proposer seeks to open a platform that allows community hubs to list their location, resources and current objectives. This hub seeks to provide a meta-hub experience with interlinking nodes, immersive experience and innovation centres looking into the future. Given the proposal, the key performance indicators that help to measure the performance over the long term can be identified. There seems to be an understanding of their target audience and have an indication of a financial sustainability model that aims to channel fees towards paying for maintenance and growth of the hub network. Overall, I can attest to the fact that the proposal will be able to scale into the future.", "q0r": 5, "q1": "In view of this proposal, i have really gone through the plan and there are the necessary details of all the steps needed to finish the project, from the kickoff all the way to the project delivery process. It can be seen in the timeline for delivery of the first 30 days of activities, followed by a 3-6 months continuous action plan that shows the details of the implementation plan.\nThere is a great team with a wonderful experience to help deliver their goals and target with the likes of Josh who is a seasonal great team lead, Mercy with 25+ years of experience in project management, Richmond an amazing all-time graphics designer and Daniel an exceptional front-end developer with vast experience. \nA principle in relation to this Scale-Up Cardano community hub is the delivery of information to people who would not otherwise have access to the needed information and in view of that, the hub's directory will help create that visibility to help disseminate the needed information. \nThe budget for this proposal sounds reasonable to me and looks well defended with a detailed breakdown. The challenges that are likely to arise has been mentioned and there have been suggested ways to curtail those challenges that are likely to come by during the course of the project. I will like to put a question across to the proposer to help me know what is likely to happen if there is the need for additional funding to complete the proposal?\nIt can be seen that the plan itself will be a more technical one that has to do with UX design, back-end and front-end computer development. Confidently, the team are very good to help with their vast level of experience and also the positive impact the WADA global team will have on the project.", "q1r": 4, "q2": "With regards to this challenge, proposers are to note that the total challenge budget should not exceed 5% of the total challenge budget and given this, the Cardano hubs directory budget really falls below the overall challenge allocated budget and it's acceptable. This project intends to help build an ecosystem that is truly global and will help attract new members and connect irrespective of the level of the knowledge base about the ecosystem.\nBecause of the timeline for delivery, the proposer has a detailed plan for a good delivery of the project. The first 30 days has in play, the identification and hiring of the key role, website landing page launching and platform design with specification created. The 3rd to the 6th months also looks at other activities like the UX design, configuration and testing, MVP launching and many more.\nAnother metric to look out for to ensure audibility is the key performance indicator that refers to a degree of measurement used to gauge a project's overall long term performance. This project has quite a several metrics to ensure the development and sustainability of the project. The team have an understanding of their target audience and this will be enhanced through the social media engagement metrics and also the number of hubs actively using the platform. The overall listed metrics stated in the proposal can be used to assess the long term performance and success of the project.", "q2r": 4, "assessor": "z_assessor_1170", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2455, "q0": "I believe this proposal addresses the challenge as it seeks to create a database/ platform for all Cardano/ catalyst hubs globally. This database will include relevant information about all community hubs to foster a network between the hubs. This proposal also gives the Cardano community and the general public at large, information on the hubs available, their locations and the resources available to them. It’ll also make available updates and feature add-ons, organization of virtual meetings and education for scaling up the Catalyst/Cardano community.", "q0r": 5, "q1": "The information provided on the team members and the experience they have shows they are capable of implementing the proposal. However, the roadmap presented for delivering the solution could be more detailed than it is for clearer understanding.", "q1r": 3, "q2": "Given the detailed outline of the metrics, the success of this proposal is defined. Also the key indicators are measurable and clear for auditing.", "q2r": 5, "assessor": "z_assessor_1505", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7874, "q0": "Another activist group active in Africa (Wada) wanted to propose the creation of a mobile application as well as a website that could help the community access and locate event venues, financial resources or service locations. Infrastructure in Africa is too inadequate, so it is necessary for the involvement of the local government to improve facilities, especially internet services in Africa. Because this is an important premise to develop technology and connect people. Which is extremely rare in Africa. Even many localities do not have electricity. Giving the background to develop an application on blockchain in Africa also encounters many obstacles.", "q0r": 5, "q1": "Ho has a team working with an experienced leader with more than 25 years in the IT field with the necessary skills to carry out this project. The plan is outlined in 6 months with moderate expenses. However, in the planning section, I see that they have acquired 3rd party software, showing that the capacity of team members is not really equal and self-reliant. Because this group needs additional qualified personnel or needs internal training classes or invites highly qualified experts to train - a problem that is quite urgent in less developed countries like Africa.", "q1r": 5, "q2": "\"I see some overlap in the Wada team's recommendations in this section. Because this group has broken down the different proposals of the group into many submissions, and in this part 3 alone, I see that they have duplicate content about the project evaluation criteria, and individual member profiles as well as some websites. their. Some criteria are:\nThe number of integrated centers, the number of centers using the platform, the total amount of data collected, interaction metrics, website traffic...\nI have reviewed other proposals for their projects.\"", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8719, "q0": "I give a score of 5 to the impact of this proposal because a problem needing to be solved within the challenge which is visibility and accessibility to Cardano community hubs has been identified and the solution being provided by the proposal is phenomenal! A database with central repository loaded with information about exact location of CCHs and their activities is indeed a project that articulates how it will add value to the Cardano Ecosystem. Recently, I came across a new member who had joined the Cardano community and he seemed to be stranded as to where to go and make connections. He's from Sweden and wanted to know if there are any CCHs in Sweden that he could access information about Cardano from. Due to lack of resource like what this proposal seeks to implement, the only option this new fellow has is to perhaps write to the various channels on telegram asking for information about a CCH in Sweden. This may take him couple of hours or days to get a response as to whether there is or there is no CCH in Sweden. However, if the solution in this proposal was already an existing one, I'm sure this new fellow wouldn't be stranded as he could easily tell if there's a CCH in Sweden or not from the platform. Another great impact is access to the resources and event schedules of these hubs listed on the platform. \nThe proposal has been written very well to align with the challenge setting except for the fact that the budget is slightly above the percentage of request set by the challenge which is 5% of the total challenge budget. Anyways, I don't see the need to deduct a star for that as the difference is only 0.6% increment which's worth it looking at the impact the proposal is going to have on the community.\nThe key metrics of the proposal (a) Number  of hubs onboarded, (b) Number of hubs actively using platform, (c) Number of Catalyst-funded hubs onboarded. (d) Total data points gathered, (e) Social media engagement metrics, (f) Website traffic metrics, and (g) Number of countries with hubs listed aligns with the key metrics of the challenge as far as the rate of onboarding and flow of information is concerned.", "q0r": 5, "q1": "An online community platform for all hubs to list their location and services is indeed a proposal that can be implemented successfully at the end of 6 months post-funding. The proposal has stated concisely what will be done at every stage of the roadmap and looking at the team and relevant experience, I am certain that this can be implemented successfully. \nThe breakdown of the budget which amounts to $28K is sensible to me and I think it's going to carry the team through to success. However, what I feel should have been included on the budget is cost for miscellaneous as prices of goods and services may not be the same in some weeks to come when they have successfully been funded for implementation. \nWith regards to relevant links provided, I have clicked to verify the validity and efficiency of them and I can say on authority that no fake or broken link was provided in the proposal. In other words, all links work and they lead exactly to what description is stated in the proposal.\nCatalyst Swarm and Wada are already two great entities in the Catalyst community who have been immensely doing great job as far as sustainability of Cardano is concerned. These two entities have hosted numerous workshops and outreach events to aid in the onboarding and coaching of members who join the community and I believe that with their experience and information, they'll contribute immensely to the successful implementation of this project.\nThe proposer has also done a good job by taking an extra mile to explain the technical architecture of how the platform is going to look like after successful build. Through that, he takes the opportunity to describe the relevant resources needed to implement the project successfully. This gives a hint of the team having great knowledge of what they propose to do.\nTo conclude, I had a look at the foreseeable challenges that could hinder the successful implementation of the project and they have been well addressed by the proposal with relevant alternatives and certainly, nothing may hinder the implementation unless they're not funded.", "q1r": 5, "q2": "First of all, this proposal has a well written roadmap which defines what would be achieved at the end of every milestone. For instance, the community can expect that by at the end of 30 days post-funding, a website landing page should be launched whereas configuration and testing takes place at the end of 3 months post-funding. Also, a Minimal Viable Product (MVP) should be launched at the end of 6 months post-funding. These are clear milestones that can be measured by any auditor who takes up the auditing process of this proposal as he/she is provided with exactly what to look out for in terms of progress report analysis is concerned.\nSecondly, the problem statement and solution statement as well as project brief indicates clearly that the proposers are aware of the targeted problem needing to be solved and their solution is genuine and clearly addresses the problem.\nLastly, the key metrics of this proposal provides me with sufficient information to assess the progress in attaining its stated goals and hence my 5 star scoring.\nGood job done and good luck!", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8976, "q0": "If funded, this proposal will have a huge impact on the ecosystem by making it easier to identify the various Cardano community hubs created and also share relevant information within the hubs. This will help onboard new members onto the catalyst platform and help deliver information to the community. As an active catalyst member, sometimes it is a bit difficult finding information about the community hubs created, you would have to go through some information that is irrelevant to you at that moment but the idea in this proposal is to create one big database or directory with all you need to know about the community hubs. so it makes it easier for members to get the needed information without difficulties. ", "q0r": 5, "q1": "Given the information in the proposal about the team, the team has great talents and experiences and if funded, they will be able to implement this proposal successfully. The team has a detailed plan about the proposal with specific timelines accompanied by a budget breakdown with identifiable items. This is great.", "q1r": 5, "q2": "The proposal has key metrics that clearly define its success. The proposal's objective of getting all Catalyst-funded hubs listed and profiled within 6 months of launch is proficient. The proposal has measurable KPIs that can be easily audited and followed by the community.", "q2r": 4, "assessor": "z_assessor_715", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "An open platform that allows community hubs to list their location, resources and current objectives.", "experience": "Funded F7 'Scale-Up Hubs' proposer, Global Lead for Wada with a network of 5+ hubs based in Africa."}