{"id": 396546, "author": "joshf", "title": "Cardano Kiosk | Hub-in-a-box", "url": "https://cardano.ideascale.com/a/dtd/396546-48088", "category": 26439, "amount": 35000, "description": "The large capital requirements for a brick-and-mortar community hub are prohibitive to wide scale adoption.", "funded": 1, "upvotes": 33550031, "downvotes": 10158053, "votes_result": 23391978, "votes_cast": 151, "f6_no_assessments": 14, "f6_rating": 4.476190476190476, "videos": [], "media": [], "f6_assessments": [{"id": 8718, "q0": "Honestly, this is a well written proposal with a fantastic idea and vision for Cardano scale up. \n\nWith reference to the campaign brief, I would say this proposal addresses the challenge 90% and hence the reason why I have deducted 1 star from my rating. The campaign brief emphasizes that CAs should have their assessment score favoring proposals that: \n1. Have a budget.\n2. Do not exceed 5% of the total Challenge budget.\n3. That account for local needs and infrastructure concerns.\n4. That show creativity and ingenuity around hub design and information delivery.\n5. That are using local, recyclable materials and have a commitment to sustainable practices.\n\nMy justification is that the proposal satisfies all the above challenge emphasis except for point two (Do not exceed 5% of the total challenge budget). The budget of this proposal is $35000 which equates to 7& of the total challenge budget. \nI suggest that the proposer, in next iterations, should pay attention to every single challenge emphasis in order to grab all 5 stars.\n\nThe proposal clearly identifies a problem needing to be solved in this challenge setting. Usually, when we say \"Hub\", the attention lays on brick and mortar structure that's been put up to house a certain group of people for whatever purpose it may be. These structures normally requires huge sum of money (not less than $100K) to completely build and furnace and this is indeed  a problem for scalability especially when you consider the total budget of this challenge ($500K). It literally means that only 5 or less hubs could be established out of Fund 8. However, the solution provided by this proposal, I think is genius. From the YouTube video provided, it's clear that this structure is not built out of a mortar and brick but out of recyclable materials  and duration for assembling could take not more than 48 hours. \nThis is absolutely fantastic, as key metrics aligns with the challenge setting and clearly articulates how it will add value to the Cardano Ecosystem through the concept delivering information through the hub to people who would not otherwise have the access to a host of services that would have previously been unavailable to many of these rural communities.\n\nI wish this proposal all the best of luck!", "q0r": 4, "q1": "I will start off with the budget aspect of the feasibility criteria. In the exception of the challenge setting placing a precise cap on how much should be requested by proposers, the budget sits well and is feasible for the successful implementation of the project. The budget, $35K, is broken down to showcase how the money would be spent in view of project implementation. The only thing I'm wondering to know, which was not stated in the proposal is how many CIK is going to be built out of this budget. However, from the BOXABL website, it looks like $50K could be used to secure one Kiosk, which means a least of 3 kiosks could be achieved out of the stated budget. This, I believe would be awesome prototypes to help the proposal come back for more to do more.\n\nI have been an active member of Catalyst since Fund 3 and I can boldly say that the core team behind this proposal is able to successfully implement the project if funded. \nAs stated in the proposal, Josh F, has been an active member of Catalyst since Fund 2 and that's evident to his IdeaScale profile which states that he's been a member since 17/10/20 with 16 ideas posted so far. My research indicates that he's successfully implemented 1 idea (West Africa Proposer Outreach) even though his IdeaScale profile is tagged 0 idea implemented. For me, it indicates that he has the capacity to further implement more projects.\nWada, on the other hand is also a community in the catalyst community with 25+ members of diversified expertise that's known for their collaborative efforts in driving the adoption of Cardano in Africa. From their website and the Project Catalyst - Funded Projects Report, I could tell that they've implemented quite a good number of projects both from individual and collaborative perspectives. This also confirms to me that they're a good stakeholder to have on this project for successful implementation.\nThe description on the website of the relevant partner (ADA sustainability) \"Sustainable ADA is a space where you can learn more about the transformative potential and impact of Cardano & collaborate with others to receive guidance, access to tools, and community support while integrating solutions to challenges faced by you, your business, or your community.\" is an indication of indeed their relevance to the success of the project.\n\nOn personal note, I clicked all links provided by the proposer to verify their validity and efficiency and the outcome is that all links are valid and efficient.\nThe proposer knows clearly the number and type of team members required to have the project implemented successfully.\nA sensible and conductible plan that shows what and how it's going to be implemented has also been showcased by the proposal.\nRisk assessment has been done as well and it gives the proposal a lift.\n\nThe proposer has done an excellent job with regards to feasibility and hence my 5 star scoring.", "q1r": 5, "q2": "According to the proposal, 6 months after funding, the CIK should be readily accessible to the public with at least 100 service events hosted. I think this is a clear milestone that can be measured by the community. Since is  a product (Kiosk), it should be visible for everyone to see, feel and touch if need be. Clear metrics that defines what the community should expect out of this proposal at the end of the stated roadmap is well written and I strongly agree that it'll enhance the work of auditing for anyone who picks up the project proposal.\nThe proposer does well by projecting in the proposal what success would look like after 1 year of implementation and I am certain that 500 people could be serviced by the CIK.\nThe proposal problem statement \"The large capital requirements for a brick-and-mortar community hub are prohibitive to wide scale adoption.\" gives a clear description of the targeted problem whilst the solution statement \"Create a stationary minimum-viable hub unit that can be set up at a relatively low cost. Flat-packed, portable and set up in under 24 hours.\" also clearly addresses the problem. This is so because, immediately you read these two statements, a clear image of what the project is seeking to do is exposed to you.\nI do not see any fault that could prompt me to deduce a star from my rating, hence my final score, 5 stars for auditability. Good job done! and good luck to the proposal.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 479, "q0": "The core of Cardano is for technical people with blockchain expertise. Hence the need for users on the ground level to make the technology a reality brings the need for the Hub. I just love to hear the name ''Hub in a Box'', this is exclusively in line with the challenge's purpose. This proposal shows to qualify on the important criteria needed under this challenge given activities that seek to account for local needs and infrastructure concerns. There will be the provision to construct small scale, cost-effective hubs that will create access to a host of services like DID services, Exchange services and mobile money, wallet set-up and Defi banking and many services. Also, this proposal seeks to use local, recyclable materials and have a commitment to sustainability practices. Taking a look at the problem statement which mainly looks at the cost and time of building a brick and mortar community hub, this proposal looks to get a set up in under 24 hours all things being equal. This is just an amazing project that needs over 100% rating for its rationale for impact. Reading deeper into the proposal, you can clearly articulate the great value this project will have on the Cardano ecosystem and which has a positive impact on the proposal being able to scale to address future challenges. Another important criterion we have to bear in mind is the success metrics that channels to the key performance indicators(KPIs). As we all know the KPI serves as a measure to ensure long term performance which helps with operational achievements. First of all, there is good evidence that this project satisfies the minimum viable hub(MVH) and thus the smallest effective unit for a hub. I strongly believe in effectiveness when it comes to working in small groups and this project seeks to attain that. It also can be seen that the team really has an understanding of their target audience and that is also a key metric. ", "q0r": 5, "q1": "The world is now trying to go green to save ourselves from environmental toxins and pollutants. Given this, the use of recyclable materials is vital to ensure sustainability concerning this project to achieve a sense of feasibility. The proposer has laid out its detailed plan and a concise timeline which will help the team achieve success and also accurately project their reach both physically and online within a period of time. Taking a close look at the financials which is a key model of sustainability, there seems to be a well-developed budget with a detailed breakdown. Despite being okay with the content of the budget, I was expecting to see the budget cost versus the cost to launch. So can I know what the team will do if only 1/5 is to be applied as the cost to launch due to demand pressure of acquiring funds from the treasury?. Overall, the proposer has a good potential partnership a project can have to scale well and given his potential partnership, there are world mobile, Boxabl, Raspberry Pi, Brightbox. With regards to technicalities, I strongly believe in the WADA team's support to assist with their pool of great expertise in the field of human and technological resources. Considering the several risk factors that were outlined in the proposal and the provided means of mitigating those risks through strategies that will help either to avoid, reduce or transfer those risks when they occur shows readiness by the proposer to achieve success. Realistically, the project seems to have a workable timetable that will ensure successful completion. Kudos", "q1r": 5, "q2": "The proposer has really provided sufficient information needed by stakeholders of the Cardano community to help get clarity in his proposal. A very well laid out plan has been outlined with the timelines for delivery looking at the first 30 days, followed by the next 3-6 months projections. As a criterion in relation to this Scale-Up challenge setting, a proposal should not exceed 5% of the total challenge budget and I can very well say that this proposal has met that target with their total budget outlined. The key performance indicators that explain the success of this proposal ha been touched on and some of the metrics that were in the proposal are the MVH principle, having a financial sustainability model and also having an understanding of their target audience. ", "q2r": 5, "assessor": "z_assessor_1170", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1006, "q0": "This proposal addresses people in rural areas with low-internet access.\nWADA is working on a lot of different projects to improve the lives of people in Africa.\n\nBy using a Cardano Information Kiosk (CIK), they want to inform the rural areas about the possibilities of the Cardano blockchain. Furthermore, it also helps to inform people about other funded projects from WADA to boost the impact of those.", "q0r": 5, "q1": "WADA is a well-known Organization in the Cardano ecosystem. With many funded and successful implemented projects, the Organization can be trusted. \n\nThe roadmap is a rough draft and needs to be specified when a design and engineers team is created. \nThe Budget breakdown is detailed and plausible.", "q1r": 4, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. The KPIs (number of wallets, new members for catalyst) were well-chosen, and I believe they are good indicators for evaluating success. The announced service events are the only things that's missing a detailed explanation.", "q2r": 4, "assessor": "z_assessor_1252", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 1754, "q0": "\"The proposal identified many issues in the challenge at once, and those issues had wide-ranging impacts. The proposal raised the idea of building a Cardano Information Kiosk (CIK) but solved many related issues in it at the same time. It provides services of Cardano platform such as DID service, Stakepool, Defi bank...to facilitate community participation in rural and disadvantaged areas. I think this is a very useful idea to develop Cardano's community network far and wide, creating a balanced and equal development, leaving no one behind. The proposal is the answer to the difficulty. Difficulty in spreading Blockchain technology, including the Cardano platform, to disadvantaged and underdeveloped areas compared to the rest of the world. In particular, this proposal is extremely feasible for worldwide scaling in the development journey with Cardano. It not only helps the Cardano community grow stronger but also has a very human meaning in the development. general development of society.\nThe proposal correctly identified a few issues in the challenge. Present the problem clearly and convincingly. The proposal identified the problem of helping the Cardano community grow by expanding its reach with the Cardano Information Kiosk (CIK) idea. There are very practical Cardano platform-related services for participants. You guys have built on the success of the Internet Kiosk idea to develop, helping the Cardano community to grow widely even in difficult areas. You have demonstrated a deep understanding of the Cardano platform to painstakingly design the services included in your solution such as DID Service, Charging and Repair, Stakepool Service, Oracle Data Provider, Service exchange, and mobile money, Set up Defi banking and wallet... To me, it's a “big value small house”! So your goals are also clearly stated: Providing information to those who do not have access, providing services that many rural areas do not have, “Banking without banking” service. In particular, I am impressed with the extremely civilized solution that is the network of CIKs that will be owned by the community members themselves, jointly organized and managed by smart contracts - This is what the platform Cardano is moving forward, very possible. This proves that you have a very in-depth study of not only the Cardano platform but also the characteristics of the countryside, where there are many difficulties in accessing new technology. Your proposal also provides a “very high” “high” level of success for the plan and the outcome of the project will be communicated through the Wada website and the Cardano Central Directory (CHD). However, I would like you to present specific results with numbers, the more convincing it will be. The proposal has identified several risks during the implementation process and proposed solutions to overcome all of those risks. Your proposal also identifies four major risks in doing your job. The first is 'security', this is a big issue that the community cares about and you guys come up with a very professional and highly academic solution to this risk, that is, CIK will have a high IoT security system. provision as well as remote locking and SMS alerts for tampering. As a source of connectivity, the 'always-on' nature of the hub prevents any tampering or corruption; the second is “local demand”, This is the decisive factor for the success or failure of any project and the nature of your proposal is also an answer, specifically you propose a solution with CIK's portability thanks to its form-factor design. flat package, it benefits from both the flexibility of a mobile hub and the community presence of a traditional mall. By renting a moving van for a day, with power tools available, a CIK will be able to be moved and repositioned in a few days; The third risk is “environmental sustainability”, this is an objective risk that you also have a very feasible solution to, All CIKs will be assessed according to sustainability assessment, in terms of production. , using recyclable materials and transporting them to the site. CIK will use renewable energy sources to power its operations. And the last risk is the “sustainability of the project”, you guys come up with a very creative solution, the financial model of the CIK project (Future Design, Specification, and Material Orders). hybridization from future CIK holders and crowdfunding to build local CIKs) and CIK's financial model itself (Services provided by CIK and advertising from local businesses on CIK side panel, In addition, I would like to advise you of a potential risk that is fire, explosion, I hope you pay attention to this risk!. \" I rate: 4 point\n", "q0r": 4, "q1": "The proposal has given clear, detailed, and reasonable work implementation timelines with specific goals. The proposal presented very clearly the timelines for its work. Specifically, you have divided the work schedule into 4 times and each time has its own specific goals: the first 30 days your goal is for the design team and engineers to document the requirements. and specification, identifying partners to provide hardware; In the next 3 months, your goal is to complete the Web site, launch a marketing campaign, purchase equipment; Next 6 months specific goals are a finished product and delivered on-site, on-site installation and launch, second marketing campaign, Feedback is collected on prototype and second iteration in phase. design paragraph. buy equipment; and post-launch work. All project progress is updated via Wada Web and easily accessible Cardano Central Directory (CHD) to check it. However, to make the proposal clear, I would like you to have more specific and detailed data for your goals. For example, who is the design and engineering team? What is the equipment that was purchased?.... The proposal has been disbursed by the pre-fund of more than 20% and has a reasonable and clearly explained plan for allocating expenditures for each specific activity. Have a very detailed, specific, clear, and transparent budget allocation plan. The total application budget is $ 35000. However, I don't see you have a backup budget. I have an additional $3000 contingency budget for ADA price fluctuations and market slippage in the equipment market for your proposal. The proposal has assigned specific tasks to each member; Experience relevant to assigned tasks; The identity of group members is easy to verify. The proposal also assigns tasks to each specific and appropriate group of members, each core group will take on a specific job (Team leader, Wada support group). The assignment is based on the capacity of each group. Team identity and team leader easy to verify, Linkedin link of team leader, Web of the support team. I rate: 5 point", "q1r": 5, "q2": "Proposals provide KPIs, but some are difficult to accurately quantify the effectiveness of proposals. The proposal has indicators/KPIs to measure project performance and progress such as Total reach (live and online), several new wallets created, several new members joining Catalyst, the number of new proponents introduced, Number of new hubs created using the CIK, CPE (Cost Per Engagement) model - Measures the annual cost of a hub per 'service event' and compares with traditional quantification central passage. All indicators/KPIs are easy to measure and check easily on the Web platform, LinkedIn. However, in my personal opinion, you need to build more KPIs/numbers like Twitter, Facebook to facilitate things. The proposal has clearly defined success and has been successfully tested in practice. .. The proposal has shown clear results when implemented: After the first year of installation, CIK will serve at least 500 people through creating wallets, charging devices ... this is a modest number though. but has demonstrated the scalability and growth of the Cardano community. . The product has been designed and perfected, after its launch, 125 service events were held. The proposal received the money in the previous rounds but did not make it to the top 50% of the voting results of the whole fund. A proposal has been converted capital, relevant to this topic. It sponsors with a vote rate that is in the 50% of the most interesting voting ratings. I rate: 3 point", "q2r": 3, "assessor": "z_assessor_1410", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 2244, "q0": "to make a small hub is a good idea, with small amount of people could operating the hub. it's important to provide information and expose cardano to more people to let the community grow. the proposer is also focused on MVH, and trying to create an efficient way to sharing and provide informations to public.", "q0r": 4, "q1": "the budget is over the 5% challange budget limits. some of the budgets is also expensive, such as providing materials and equipments they didn't state it in details. the working hours for the team and consultants also didn't stated in details. they have the experiences to implement the project since the proposer have joined with organization that sharing Cardano informations.", "q1r": 3, "q2": "they explain the details for each step and put actual numbers to audit their project. they're also collects data from people such as cost per engagement, that could help us to audit and set a standard with the other hubs projects. i also would like to see number of people this hub could serve within time limits.", "q2r": 4, "assessor": "z_assessor_1469", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2380, "q0": "Yes; a CIK (as mentioned) can facilitate DID services, stakepools, oracle access, exchange services, mobile money, wallet-related services, and DeFi banking. Each of these functionalities could immensely help rural and low-income communities, where many of the people in these communities are surviving with $2 of less per day and lack access to internet and mobile banking, among other core concerns. Curious: would these booths be self-powered through solar cells? Also, what DID solutions are being considered (Atala PRISM, RootsID, Proof of Humanity, etc.)? ", "q0r": 5, "q1": "Yes; it's impressive that Josh is a funded proposer and active Catalyst community member since Fund 2. This expertise, along with Josh's Cardano Hub experience,  undoubtedly helps prove credibility. As the proposal states, technical specifications / requirements are to be presented in the first 30 days. It'd be helpful if these were available now, but I suppose this information is critical to make a final assessment with regards to feasibility. ", "q1r": 4, "q2": "Yes; the information provided to conduct an audit is able to be queried / calculated relatively easily, and therefore is a good choice for a collection of metrics to be audited to inform progress / completion of milestones. Would these metrics (total reach, new wallets, new Catalyst members, new proposers onboarded, new hubs via CIK model, cost per engagement) be available in a periodic report? Could these metrics be viewed openly through a dApp or custom oracle? ", "q2r": 5, "assessor": "z_assessor_1485", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2606, "q0": "The project will help many people directly access the practical application of blockchain through the Cardano ecosystem. However, is it appropriate in terms of legal issues and receive support from the local governments to implement the project? And the team, please list for me what are the benefits of people using this service? Is it powerful enough to convince people to change their habits of using current tools? At the same time, the website you provided https://adahubs.io/kiosk under the heading “Website/GitHub repository (if relevant)” cannot be linked. Scoring: 3", "q0r": 3, "q1": "I want the project to be born and develop sustainably. Please provide documents that the project has studied so far on how it works, initial hardware requirements... for community evaluation and support. Regarding the cost, I have an opinion like this, should franchise the kiosk business, members from the Cardano community around the world can support the site, it will reduce a lot of construction costs, they also collect % profit from providing services, the project will develop sustainably, please give me feedback on this idea. Scoring: 4", "q1r": 4, "q2": "The metrics you give to track the development project are easy to quantify, I appreciate this, through which channels can we track the progress and check the information? Please give us. The rest, all is fine. Scoring: 4", "q2r": 4, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2884, "q0": "This proposal aims to build low cost and portable Cardano Information Kiosks to scale adoption of Cardano for rural communities. The proposal is clearly in line with the purpose of this challenge. By creating minimum viable hubs, the WADA team will help the Cardano ecosystem have more chances to reach the poor people from remote areas. Since the hubs are portable and able to set up within 24 hours, it also could reach many more people than normal methods. The idea also has the potential to expand the future, especially for African countries. I personally love this idea since it could touch the most difficult part of the world with a solid solution. In conclusion, this proposal addresses the Challenge excellently.", "q0r": 5, "q1": "Based on the proven effectiveness of adding value to the community of the team, I believe that the proposal is highly likely to be implemented successfully. All the information related to the key persons and partners of the project such as Mr. Josh Fielding – the leader of the project, WADA team support, relevant and potential partners are clearly indicated with proper links. It helps the community easily verify the team’s experience. There is also a detailed road map indicating clear timelines and achievable objectives. The team also provided a very clear detailed budget breakdown. It seems that all the expenses are reasonable. However, it would be much better if the most expensive item “Materials & Equipment'' could be more specific. Another impressive feature of this proposal is the risk management of the team. They have foreseen several risks and have proper preparation to mitigate them.", "q1r": 5, "q2": "The team has defined the KPIs and success metrics very clearly. It would be easy for the community to audit the progress. All the KPIs of the projects are in number. The success metrics are also linked to the project timeline. They are all easy to measure and record.  There are few metrics that would be more difficult to verify such as the total reach in-person, but it is common sense. By using the Cost-per-engagement to measure a hub’s annualized cost per event, we also could have a quantitative comparison with traditional hubs to define the success of the idea.", "q2r": 5, "assessor": "z_assessor_1588", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4512, "q0": "this proposal satisfies the challenge's goal of providing a minimum-viable hub (MVH) solution, by cutting down the initial and usual cost. The proposal satisfies the challenge setting. However, I suggest the proposer includes maintenance of the kiosk as a likely challenge since infrastructure seems to be an issue especially in Africa", "q0r": 4, "q1": "Timeline provided by the proposer is reasonable. A well broken down and easy to understand budget is provided in addition. The proposer indicates those he will be reaching out to for external assistance and they are credible enough to provide the needed help for making this project a success", "q1r": 4, "q2": "Considering the key performance indicators of the challenge, the metrics provided by the proposer can be used to track the progress and success of the project. Also, the proposer has had several proposals funded and so finding his way around this proposal shouldn't be that much of a headache", "q2r": 4, "assessor": "z_assessor_1744", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7031, "q0": "The proposal addressed the challenge as it aims to Deliver a kiosk-sized hub that can set up without industrial equipment in less than 24 hours. This hub will be operated by 1 or 2 people and act a first-point of contact for those in rural or low-income areas.\nIn particular, the kiosk will be useful to provide services as stakepool services, Data Oracle provider, Exchange services and mobile money, Wallet set-up and DeFi banking.\n\nThe goal is to reach a greater number of people with a single kiosk moving from one place to another, to lower down the cost per engagement", "q0r": 5, "q1": "The proposer has been already funded in fund 7 and he's Global Lead for Wada with a network of 5+ hubs based in Africa.\nThe budget requested is adequate to cover all the cost item outlined, such as security system for the kiosk, manufacturing and marketing. \nMoreover, the kiosk creation will leverage on partnerships with Cardano related brands like worldmobile.io", "q1r": 5, "q2": "The timeline covers a period of 6 months before launch and takes in account further items tbd. post launch of the kiosk. KPIs go beyond the number of used reached and consider other metrics like Number of new hubs created using the CIK (cardano information kiosk) model and CPE (Cost-per-engagement)", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7872, "q0": "\"Africa is a poor region with an underdeveloped technology base. Therefore, even the most basic facilities such as the internet and the workplace are very lacking and difficult. Usually other projects are mainly focused on personnel costs and direct costs surrounding the development of the project. But in Africa they have to ask for the basic costs to maintain the internet, the workplace. It is hoped that Africa will have many young people who work hard to learn so that they can change reality and have a better life thanks to the support from catalyst projects.\nHere the goal is simply to create a mobile technical \"\"box\"\", a place to work, to repair, to guide staking ada... (something like that). And this \"\"box\"\" is designed and made as a small, portable house, convenient for serving many places.\"", "q0r": 5, "q1": "\"I personally think this is a good initiative, but it is necessary to control costs well and avoid waste.\nAlthough your plan is clear, the costs are fully listed, but I still want to contribute to the success of the project:\nIn addition, it is advisable to combine work and internal training. Team members train each other, or invite experts from other countries to teach blockchain programming.\nIn addition, it is recommended to cooperate with the government to expand and respond to this model to young people, increasing jobs and income for local people.\"", "q1r": 5, "q2": "\".\n\n\nThrough the reach to the user community, the number of newly created wallets, the number of new members joining, the number of new catalyst proponents, the number of events organized for the public to participate to show progress and progress. success of this project. These are also necessary parameters to evaluate a community project.\nHowever, you should have in-depth shared content and should have in-depth code or CA training courses so that the outreach is more effective than simply giving information.\nIf possible, it should be combined with government departments to make activities that are widely responded to be more effective.\"", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 8975, "q0": "The proposal distinguishes an issue in the challenge setting that should be tackled. The proposal has clearly outlined how it can drive adoption at the ground level by providing the community with a minimum-viable hub that gives information to people who would not have access to information about Cardano. This idea is interesting.", "q0r": 4, "q1": "The proposal has a great team backing it with verifiable links of relevant skills needed to implement the proposal. There is also, a detailed budget breakdown which is reasonable to achieve the aim of the proposal.", "q1r": 4, "q2": "The proposal's success and key metrics are aligned with that of the challenge setting such as increasing adoption at the ground level and onboarding new members to project catalyst. the proposal also has measures of success that can be measured by the community when achieved.", "q2r": 5, "assessor": "z_assessor_715", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9981, "q0": "Many of the challenges around growing cardano is to locally reach the unbanked population. For this reason the proposal here to provide a unique creative solution to have a portable Kiosk is geniune and can help overcome some obstacles. \nI am pleased with the use of the media and creativity of this proposal. It not only uses digital but also handout material and in person engagement. \nSince cardano is focused on reaching remote location the portable kiosk can allow local member with additional tools to setup and have a local outreach program and then move to nearby locaiton. In other words bringing the action to the people. the use of iOT locks and tracking is also great and could eventually be tracked on the blockcahin. ", "q0r": 5, "q1": "Integrating with Raserry Pi and World Mobile is a great way to synergize since they are also on the ground locally to distribute connectivity and computing power to Africa and other remote locations. \nThe temmembers involved in the project Wata are active and have shown a good understaning of Cardano ecosystem. \nFinally the buget around preparing the mobile Kiosk is ambitious and very competitif. In my opinion as an engineer I would recommend at least a prototype phase where 1 - 2 units are fully built before starting to receive orders. \nOverall the idea is based on previously tested and implemented technologies. They overcome many risks by including locks and security mechanism. Very impressive and overall covergage of the proposal. ", "q1r": 5, "q2": "The physcial aspect of the Kiosk and building this is part of the proposal would be easy to audit. Simple picutres of the final design and built kiosk would prove that the propsal was acheived and completed satisfactory. \nAlso the short / medium / long term milestones of visits and people is well described. \nFinally I would like to see a small comment on the financials for setting a Kiosk cost price or material cost. As this is the majority of the proposal fund. ", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10526, "q0": "This a very well tought-out proposal, with the potential of having great impact in rural areas. I've lived in an area where certain services where available only a specific day of the week (when a bank employee, the mailman or the cobbler was in town), and this Kiosks could enable the same thing for Cardano based services.  If World Mobile Network is successful, this could fill a void while they reach more territories. ", "q0r": 5, "q1": "There is a well tought-out plan, but there are significant risks that affect feasibility, the biggest one in my opinion is the reliance on a yet-to-be-found provider to actually manufacture the kiosk. If that's dealt with, the rest of the plan seems well within the reach of the proposer. \nI appreciate the budget covers design and build of a prototype, but I'm concerned about the overall project feasibility if the stated costs can't go significantly down for production (e.g. $2500 for the IoT security system with GPS and remote locking). The proposer might consider a speced-down version, as I guess the kiosks would require an operator, so maybe physical security is not that relevant.", "q1r": 4, "q2": "Proposed metrics are appropiate, and more importantly, measure significant impact to both the Cardano and local communities served by the kiosk. Roadmap is in my view quite optimistic for the first milestone (prototype built and 25 events in 3 months), but that's not a main concern, and should not affect auditability if the team provides updates on progress.", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a stationary minimum-viable hub unit that can be set up at a relatively low cost. Flat-packed, portable and set up in under 24 hours.", "experience": "Funded F7 'Scale-Up Hubs' proposer, Global Lead for Wada with a network of 5+ hubs based in Africa."}