{"id": 396845, "author": "headelf", "title": "C4S - Cardano for Seniors Hubs", "url": "https://cardano.ideascale.com/a/dtd/396845-48088", "category": 26439, "amount": 25000, "description": "Senior Citizens learn differently than other age groups and have been slow to adopt Defi. How do we engage a Worldwide population to ADA?", "f6_no_assessments": 7, "f6_rating": 4.142857142857143, "videos": [], "media": [], "f6_assessments": [{"id": 7281, "q0": "The proposal is very good and certainly aligns with the objectives of the challenge. Here, our intention is to disseminate knowledge about the Cardano ecosystem to more specific audiences, respecting its characteristics and particularities. The idea is to teach the elderly about our blockchain, in a way that is more adapted to their learning process, as certainly the explanations provided for a young person who is already familiar with technology and an older person who has never been in contact with blockchain are very different. . I found it extremely positive how the proponent, in addition to explaining what he would do, gives a lot of details about how it would be done. How can we present knowledge about Cardano to this target audience? A whole scheme is outlined, in which some steps would be taken: first, a study would be carried out on the way in which the elderly learn. Second, the content itself would be developed, following the principles researched in the initial phase of the project. Afterwards, such contents would be disseminated, I think it would be interesting if, in addition to social networks and institutions that target the elderly, alternative means of communication were also adopted, such as: a survey could be carried out on the main radio stations that the elderly listen, and during the programmes, something about Cardano could also be included. But this is just a suggestion, as the proponent already demonstrates that it has several options on how to disseminate the contents generated here. It is also very good that the proponent has already provided the KPIs since the impact analysis, as it demonstrates that he has precise goals, knows where he wants to go and that all the work will be based on these objectives. In other words, I totally believe in the potential of this proposal, I think it was described in a very rich way in detail, we know what the intention of creating content is, through which activities this will be developed and also what particular goals we seek to meet. I also think that the elderly are a very relevant audience for us, because it is not because they are more mature that they do not have the capacity to understand, learn and enter our community. Precisely, I think that they only need to be guided through specific approaches, as is suggested here. \n", "q0r": 5, "q1": "The feasibility of the proposal is good, but not ideal, in my view, there is a lack of detail both in the presentation of the script and in the explanation of the budget, and on the team, a certain trust is passed, but it is not very clear how these people relate to the Cardano ecosystem directly. However, let's go by parts. In relation to the script, we are shown which activities would be developed according to the passage of time. The way this is done, we have a good general understanding of things. We know what to expect and when. However, the activities themselves could have been better detailed. In the first month, for example, recording equipment, spaces on social media would be acquired and research would also be carried out regarding the best ways to teach the elderly. But what equipment would be purchased/leased? And about this research, how would it be done? I found the research to be one of the most interesting parts of the proposal as a whole, so I think more details should have been provided on this: what sources would they study from, what research methods would be used, who would be the people involved (all who were mentioned in the team presentation, or just some of them?). Likewise, the other activities could also be better described. Now talking about the budget, something similar happens, we can generally understand how the requested money would be used, but this understanding is not deep. For example: “sales and travel expenses $2,700”. What sales, what trips? It is not very clear what these parts would be, I wish there was more detail. Some topics are better explained than others, such as “content writing for recording segments”, as the total number of hours this activity would take to be developed is provided, so we know the value of the writers' work hours. Finally, as far as the team is concerned, we are introduced to the team (Tom Frey, Theresa K and Kevin Burke). Their areas of expertise are explained, however, it is not clear, as I said at the beginning of this topic, how they relate to Cardano. Their linkedin profiles are also not attached, where we could have more practical examples of their past experiences. Therefore, I think the project's feasibility is good, but it can still improve. \n", "q1r": 4, "q2": "The auditability of the project is good, as we know in what ways we could monitor both the process and the final results of this proposal. Regarding the process, I believe that this part is perfect, as the proponent states that a task flowchart will be created that will be available in the Miro tool; this tool is very interesting because it allows videos, links, images, drawings and texts to be posted. That is, we would be able to follow in many ways how the stages of the project would be developing. It is also positive how the proponent places us in relation to the frequency in which this flowchart would be updated: weekly. Therefore, in order for the progress of the stages to be audited, it is enough for us members of the Cardano community to log into Miro weekly to check the available updates. Regarding the auditability of the final scenario, I think that the audit quality drops a little, because we know what is wanted to achieve (launch of the C4S Cardano Hub for Seniors platform, FAQ and ELI65 library and its use (until the translation) by Seniors English speakers or other NEWBS who like the ELI65 system + animated content translated into different languages). However, I think it's not that simple to check out as diverse a range of information as it would be to follow the steps through the miro. I think the proponent could, together with his team, collect and summarize the main information that concerns the success scenario. Afterwards, all this could be organized in a slideshow (just an idea) that would be shared in synchronous moments with the community during Town Hall or, even, another option: the presentation could be created, the meeting would be held between the members of the team and recorded, and then the link could be made available so that the rest of us understand what this project actually generated as a result. In this way, I think we would be monitoring the end scenario as well as the gradual progress. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 342, "q0": "We realized that with the success of the proposal, several ideas about products and services belonging to the DeFi universe will be learned by seniors. This is in line with the SDGs and also with the goals indicated by the challenge in which the proposal finds itself. In addition, Cardano's knowledge will be widely disseminated with the success of C4S, since the project has as one of its precepts the translation of material into several languages. In this way, we see a very positive impact on Cardano's ecosystem. In fact, the material will use a methodology aimed at the target audience, but as mentioned, other people who like this model will also be able to use the material, intensifying the permeability of the content. Given all the possible impact to be generated by the project, we realized that the amount of funding being requested of $25,000 is reasonable. The project also has a good innovative feature, as most of the projects on blockchain education are focused on a younger audience.", "q0r": 5, "q1": "Regarding the steps present in the feasibility plan, we noticed that the steps include a very logical temporal progression. We see that efforts are first concentrated on finding ways of teaching so that seniors learn more efficiently. And only then will educational materials be developed and posted. We also noticed that the search for partnerships with senior organizations to make sales is carried out only at a later stage.\n\nRegarding the budget details, we found a clear explanation of how many hours will be spent in each stage, and what the total cost of each one of them will be, which even allowed the information of the cost per hour to be provided. We also note that the higher capital allocation is consistent with the main scope of the project: recording and editing the videos will cost $9,500. But it is worth mentioning that the production of materials was not aimed only, ways of disseminating similar materials through Youtube were also considered, as well as the creation of a FAQ related to ELI65, factors that increase the chances of the project's success.\n\nWe also have as another element favorable to the viability of the project the proximity of the professionals involved with the fundamental concepts of the proposal. We noticed that Tom Frey has experience with the senior market as well as marketing and recording. Theresa K., for example, has experience in learning optimization research. It remains as an observation that it would be interesting to also make available the curricula of the professionals involved in the project.", "q1r": 5, "q2": "We noticed that ways were indicated to follow the development of the project, using tools such as Miro. But it would also be nice to present some goals to better understand how the project is doing in terms of adoption and visibility. Some suggestions would be a number of close partnerships with organizations interested in the project or an average amount of expected questions in the created FAQ.\n\nAdditionally, it is also suggested that Cardano members be placed in the Telegram room that will be created so that the progress of the project can also be monitored by them. A possible contact with authors of other proposals from the Cardano ecosystem also aimed at education seems favorable so that possible errors when creating educational materials are avoided.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2610, "q0": "Everyone will have a time to understand what Blockchain is, how is its application, young people today do not properly understand or master, will the elderly be open enough to receive? And I see you have used the word \"invest in ADA\", I don't think so, people over 65 years old need stability and peace. Crypto is the opposite, very volatile, assets can be x10, x20, x100 but also /2, /3…or lose everything. I really disagree with the goal of the project", "q0r": 2, "q1": "The majority of elderly people are very rarely actively learning new things, especially what changes the daily familiarity, of course I am referring to the Defi array you want to aim for. Have you built any elderly community or nursing center yet? These are the places you are easier to reach, instead of every elderly person in the society. If so, please list them for everyone to know. Group members have not provided enough information for the community to consider transparency (telegram, facebook youtube...)", "q1r": 2, "q2": "You mentioned an established telegram group, please provide a link for us to verify. Miro flowchart where and how do you get the data, please be more specific so that we can be clear. I really wish everyone understood blockchain technology, but this project needs to change its approach to be more appropriate.", "q2r": 2, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5470, "q0": "There are a lot of learning resources designed for youth and adults, but for the senior space there is not much available. Having a program specifically designed with the purpose of educating senior citizens, who will most likely need to have everything explained in a different pace and with more details is a great idea that can have a great impact not just on the Cardano eco-system, but on the whole blockchain, as well. And the solutions brought forward in its implementation, like working together with organisation like Senior Planet are a great way of making sure that the project can actually be successful.", "q0r": 5, "q1": "The timeline has been carefully thought out over the course of 5 months. The concise description helps in following the course of action and at the same time is comprehensive enough to paint a full picture of the efforts required. The budget is also balanced and broken down in sufficiently small chunks to grasp the financial measures necessary. From the description provided, the proposers have the necessary knowledge to successfully implement the project, though some links to their previous works would have brought some extra confidence.", "q1r": 4, "q2": "The team is careful in planning to grant access to some of the internal documents where they’re keeping track of the described steps, though for some of those steps (the animated created content) there are other ways to measure progress, like uploading the video to YouTube or any other social channel. \nThe success of the project is measured for each phase separately and for the purpose of this project the information described is sufficient.\nOverall, the proposal is adequately devised, and the progress and success evaluation can easily be tracked by the community.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7899, "q0": "\"Older people's perception will be slower and more limited than younger people. An initiative for a live-and-animated education platform for the elderly will simplify blockchain knowledge and make it more accessible to the elderly. This is a humane and very active application.\nThis proponent has long experience in the insurance industry in a nursing home. He has experience in training and community organization. This activity not only increases awareness among the elderly, as long as they can access the internet. The majority of the world's population who are not technical people or programmers will have the opportunity to access blockchain and thereby understand and generate more needs for applications on blockchain.\"", "q0r": 5, "q1": "The entire process of the project is calculated by the number of hours worked and averaged $35/hour. This is a reasonable cost. I have read his implementation plan for this project, it is full of details for each month of work, so I believe he is a detailed, careful and dedicated person for this project. Their membership includes 3 founders with experience in educational content creation, Account Manager at Xerox, Pitney Bowes and Credit Risk Monitoring, and media marketing. All 3 skills are needed for this project. So I see the project as feasible and serious.", "q1r": 4, "q2": "They will report via the whiteboard weekly. Tasks are assigned and referenced by each team member. They have a communication plan to receive support from the community, have their own telegaram group for the community as well as monitor the project progress. They will launch the first version of the C4S Cardano Hub platform for seniors. Next phase they will animate and translate into major languages and start distributing C4S worldwide. These are goals I appreciate, and are fully auditable.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8138, "q0": "The proposed group argues that elderly citizens learn differently from other age groups and are slow to accept Defi. To expand the attraction of people worldwide to join Cardano, the elderly cannot be ignored. We've had a lot of suggestions for educating Cardano for students, adults, or people learning Cardano, and this recommendation is geared toward another age group: the elderly. The solution was a series of animated C4S - Cardano messages for Seniors (like PSA) to enable translation of languages ​​around the world. These C4S messages will be tailored to Seniors and how they learn and will include the ELI65 (Explain as I'm 65) style has evolved. The problem raised and the proposed solution presented in the proposal fit the challenge meeting in a clear and logical manner.\nI think this is a very good idea because if it works then the elderly will be put into a safer and less regulated financial space. To do this will probably take a long time because it is difficult for the elderly to grasp the technology. The proposal has reflected a number of potential challenges and risks but has not yet provided a solution to address the above issues.", "q0r": 4, "q1": "The entire plan has been thoughtfully planned, suggesting a 5-month roadmap with goals tied to easy-to-follow timelines. This proposal is very detailed on time frame with all phases, with actions to be taken.\nThe cost required to implement this proposal is $25,000, which I think is reasonable. All budget allocation details are clearly stated, making it easy for the community to audit. The proposed team consists of 3 members: Tom Frey, Theresa K., Kevin Burke mentioned with appropriate experience and qualifications to undertake this project. However, it would be beneficial to suggest if there is some evidence to verify the team's experience, e.g. LinkedIn or a website", "q1r": 4, "q2": "A very detailed plan is presented, the proponent is very transparent about the funding, which clearly shows the honest motives of the announcer. The provided KPIs will provide the community with clear evidence to evaluate and measure the progress of the proposal.\nThis is a brand new proposal that has never been presented before. In my opinion, this proposal is short and solid, which easily attracts a lot of community interest.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8721, "q0": "A hub for seniors is indeed a great step in the right direction of addressing the challenge. Usually, seniors are people we normally think to have everything at their exposure but their mode of learning is truly different as compared to that of the younger ones. For example, information in Cardano and Catalyst obviously may seem much easier to a youngster and more complex to a senior.  I strongly agree that for successful onboarding of seniors onto Cardano, their mode of learning should be considered just so that they don't end up being confused and feeling left out. I would gladly use the end product of this proposal to onboard my dad who's a senior onto Cardano. I have made several attempts with several approaches but all of them were to no avail and it looks like this is the solution I was lacking.\nThe KPIs presented in this proposal is very simple and clearly aligns with that of the challenge setting and thus articulating how it will add value to the Cardano Ecosystem as explained above.\n", "q0r": 5, "q1": "According to this proposal, only three 3 persons (Tom Frey, who is an organizer, has experience in the senior market, is a senior and also has sales, marketing, writing and recording), (Theresa K. has education and experience in programming/coding. She has extensive experience in researching, and specifically research for special needs and learning optimization.), and (Kevin Burke, a marketing and sales pro with Account Management experience at Xerox, Pitney Bowes and Credit Risk Monitor.) are needed to successfully implement the project. However, no information of a video editor is provided even though it's a crucial role in the building of the video to be uploaded to YouTube. The team probably may have plans of hiring an editor but I think that information should've been provided in the proposal to boost the confidence of CAs that the proposal has the relevant required team to implement the project successfully. \nFrom the budget breakdown, it's stated web development will be outsourced. However, it's mentioned in the proposal that Theresa K. has experience in programming/coding so I'm wondering if she's going to be of support or entirely focus on research as it is the other side of her expertise. A little clarification could have been useful.\nThe budget of $25K sits perfect on the threshold described in the challenge setting (5% of total challenge budget) and is reasonable to drive the project to its destination at the end of 5 months as indicated in the proposal. However, I think the team should've factored miscellaneous cost to take care of any further cost increment of services that will be incurred even though they did a good budget breakdown.\nA realistic timetable relevant to the successful implementation of the project is well articulated in this proposal. At least the community, through the project roadmap can expect to have recordings on the subject matter released via social media.\nOn the other hand, this proposal identifies challenges that could hinder the successful implementation of the project but alternative solutions weren't provided. What I advise a CA is that the team should analyze these challenges and address them carefully in subsequent iterations in order to get great score ratings from CAs and also enhance the feasibility rate of the project.\nIn spite of the necessary errors needed to be improved upon, I agree that is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "A calendar and flowchart via Miro to track each step stated in this proposal is a great idea on how the progress of the project could be measured. However, it would have been a great information to have in the proposal whether or not the Miro board is going to be open to all (the community) Challenge Team members (CT) or not. Anyways, from the statement \"The tasks will be referenced to each team member or outsourced entity with deadlines. The progress of each step will be tracked weekly via the whiteboard.\" it looks like the Miro board would be accessible only to the people responsible for working on the project and not open to the community. I think it would have been great to at least have this Miro Board accessible to CT members so they could read progress about the project as it grows. With that, a certain level of transparency which's key to great reputation in Catalyst is achieved.\nA clear roadmap with milestones has been provided in this proposal to enhance auditability process and that's a good job done. The problem needing to be solved is clearly described in this proposal with clear understandable solution to address the problem.\n", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "An education and community outreach program tailored to how the Senior Population learns, comprehends and motivates. Develop the ELI65 style", "experience": "I founded and was CEO of a brokerage that handled Insurance, Nursing Home Coverage, and Taxes for Seniors. I taught at College Level and I hosted a weekly radio program.  Currently, I farm and I am a Senior! I have placed a F9 Challenge Setting also to develop Senior Marketing."}