{"id": 397213, "author": "baxter30", "title": "Blockchain Learning Center + Coffee", "url": "https://cardano.ideascale.com/a/dtd/397213-48088", "category": 26439, "amount": 33800, "description": "People need access to high quality information about blockchain technology. Fun approachable ways to learn are hard to find.", "f6_no_assessments": 10, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "I liked the idea and I think it relates well to the goals of the challenge. It's about creating a space that is both a café and a learning center about Cardano at the same time. The intention is that people can go there to have a snack while, in a space separated by a glass wall (according to the proponents, to arouse curiosity), these learning sessions take place, which will be attended by two different parts: people quite beginners in the cryptographic world and those who wish to delve into the subject. I find it positive how proponents cite what subjects specifically will be covered in these classes, from a basic level with “things like wallets, staking/mining and all the things blockchain is being used for, like tracking logistics, voting, identity storage.” , file storage”; to a more advanced approach like “developing with Plutus, smart contracts, token economies, DAOS, building NFT campaigns, and more”. Another positive point of the proposal, in my opinion, is that we know where this space would be built, in the state of Arizona, in the United States. I think it makes a lot of sense to launch this project in a location where blockchain is already relatively well-known, because if the cafe opened in a country and city where people have very little information about it, I don't think it would generate any curiosity or interest. Unfortunately, most people still see the cryptographic world as just a way to get rich quick, when we know that it is not, especially in Cardano, where we have social and environmental goals to be achieved, in addition to the economic bias that is the basis of everything. . An observation that I would like to make is that it would be interesting for the proponents to mention what is the future expansion plan, that is, in which cities do they intend to open their franchises, if the initiative is successful? We know that the intention is to focus on the United States and Europe, but which cities? Another topic that could have been addressed at impact is who would be the partners and people who would teach these classes. As I understand it, the sessions would be weekly. But in this case, would it be a basic level class + an advanced class per week? Or just a basic class, and next week advanced? Details such as who will teach the classes, which faculties they intend to promote partnerships, how they will attract the target audience and which day of the week will be chosen for these classes to be held could be included. Furthermore, I think that the objective of the challenge is being well contemplated, to promote local hubs that facilitate the participation of diverse people (not just those in the technology field) and that dialogue with specific local characteristics. If the cafe is successful, I think their franchises could have the same basic idea and adapt to the characteristics of the local community in which they are launched. \n", "q0r": 4, "q1": "Regarding the roadmap, the proponents cite the objectives to be achieved in periods of 3, 6 and 12 months. In the first quarter, they expect trainers to be selected, the physical space to be in the negotiation process (from what I understand it will be leased), the first coffee cart is being built, etc. Notice that they explain what they want, but not how are they going to get it? We don't know, for example, through which selection process these coaches would be chosen, at which faculties they will establish contact, which Cardano specialists they intend to try to partner with... Regarding the coffee cart, we don't know how this would be built, what the elements necessary for this project to be completed; About the physical space, how would they get in touch with real estate agents? What approximate lease size are you looking for? I think the ideal would be for them to divide the activities monthly, not every 3/6 months, this is a very long time for us to understand exactly the process that will be developed. If the activity division were monthly and we knew more details about each one of them, the understanding of the process would be better contemplated. In the completed milestones part, we see that the main author of the idea has already started to put into practice what he wants to accomplish, and has already achieved many milestones. This conveys a lot of confidence about his involvement in the whole process. Now, in relation to the budget, around 38 thousand dollars are requested, it is a high amount, but the project involves many things and, in fact, many expenses, so I don't think it's an amount that is incompatible with what is proposed. However, this part of the proposal is a bit confusing. During the financial breakdown, the author of the idea cites various amounts and expenses that exceed $40,000. In this case, the proponent claims that he is investing his own savings in the project. Y value would be necessary for maintenance of the physical space, being divided into several parts such as rent, electrical part, ventilation and etc. In this way, it is quite understandable how much the project would cost and why. Finally, analyzing the team part, this part of the proposal is quite adequate, we know the names and main roles of the team members, as well as we have a link (either linkedin or github) where we can see the work they develop in practice. I think the detailing about their resumes could be more intense, but the way it is, it already conveys a lot of confidence. It is extremely important that they have partnerships with teams already consolidated in the Cardano ecosystem, such as the Catalyst School group. So, in terms of feasibility, the improvement I can suggest is more restricted to the roadmap. \n", "q1r": 4, "q2": "I really liked the auditability of this project, because I feel that the author is not only concerned with informing what the goal is, but also why that is the goal (there are several related goals). It breaks auditability down nicely into the two necessary parts, project progress and end results. The specific goals of progress, such as “portfolios created, sustainability, conversion rate and etc” are very well argued, as I said, we understand why this is important and how we can see if these goals have been achieved or not. My suggestions for this part of auditability are: could the author of the idea clarify how these objectives will be taken to the Cardano community, that is, how will the information collected reach everyone's knowledge? In my view, it would be important for him to make an overview, at least monthly, where all the necessary information would be gathered and forwarded directly and easily to the Cardano community. The author seems to be a well placed person in our community, so he is definitely in our discord, telegram and etc groups, where this report could be published. Now in relation to the final results, I think that the author is very aware of where he wants to go and where he will walk the path to it, but I think that it is also necessary to situate the Cardano community in a more direct way. How can we, people who live so far away from the café, know how this experience is developing in practice? In my view, it would be very interesting for the author to produce a short video, where he, his team, some teachers, some students, clients and anyone who was captive with the project would report how everything developed and what the current scenario is. If the objectives mentioned in the 3, 6 and 12 month roadmap were achieved, if the local community really got more involved with Cardano, if new wallets were in fact created, if young people were interested in learning and investing in our blockchain, who knows if local designers were interested in participating in the construction of our Dapps... Anyway, how was the process and the final results. This video would be great to play in Town Hall and maybe it could even be released in the audiovisual challenge in traditional media, for example. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "We can see that the purpose of the proposal in question is to increase the visibility of blockchain technology and various concepts belonging to this universe. For this, a not very traditional idea is imagined, to open a teaching center on technology combined with a cafe. In fact, the ideas propagated by the project fit the goals of the challenge in question, as it was planned to make several references to the Cardano ecosystem in this cafe. Thus, it is understood that with its success, more visibility will be brought to Cardano. However, as we will discuss below, there seem to be some quite considerable challenges for this idea to actually be successfully implemented, making the requested budget of $33,800 perhaps not adequate.", "q0r": 3, "q1": "We can see that the author was very detailed and knew how to develop the various aspects that the project had to generate public engagement in the feasibility plan very well. We sought to go far beyond a simple collaborative workspace, the concern to build an environment that breathes the idea of ​​blockchain is perceptible. But in my opinion, there is a considerable problem that is intrinsic to the strategy that was adopted. Notably, the monthly cost of a space like this will be quite high, and the fact that a unit (or a few) in the United States is successful does not seem to guarantee that the model is validated. Unlike a common franchise business, the success of a cafe with these characteristics will depend a lot on its surroundings. Therefore, there seems to be a great risk inherent in the idea of ​​expanding this model. And without the expansion, the visibility that blockchain technology seeks to give would not be as broad.\n\nWe note that the proposed ideas are driven by the author's clear motivation to promote the use of blockchain to make the world a fairer and more inclusive place. The different ways of doing this, both with free and paid classes, in addition to the concept of having an incubator and all the partnerships made, show the energy that is being used in the project. But we have a perception that it would be possible to reduce the risk mentioned above by carrying out actions similar to this one, but without the physical environment factor in these proportions. But we can mention that the engagement of the project is very remarkable, the professionals involved also seem very competent and there is the positive factor of the curricula having been made available.", "q1r": 2, "q2": "Regarding the ways to measure the success of the project, we see that the team was very detailed and chose very precise ways to measure the engagement around the proposal. Such parameters were not limited only to conceptual ideas of what would be implemented, but also involved numbers as goals to be achieved. The conversion rate of people into members, the number of portfolios created and projects helped demonstrate that the team knows how to monitor results well, given the premises that were established for the proposal. In addition, we also see that the ideas conveyed in relation to the perception of success are very consistent with everything that has been proposed about the awareness-raising role of the process.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The project has a relatively large scope of impact, identifying the problem of the challenge. The project targets many segments of society, so this project will significantly change the perception of blockchain in general and Cardano in particular for those who have access. However, you should also consider other risk factors that arise during project implementation. If many people are wishing to receive face-to-face training, while your coffee shop does not have the space, you should have a solution for renting another training place with a larger space. This will get a little more difficult when you expand this project to Europe. Mobilizing resources from the local Cardano community you host can be one solution to this problem. You should also have a plan to reward outstanding instructors from the community who help you spread the knowledge about blockchain and Cardano.", "q0r": 4, "q1": "The team has a detailed implementation plan. The members participating in the project have the appropriate capacity to implement the project. However, I have not seen an option to assess the capacity of the faculty from the community, which is also important for attracting people to attend the courses. I appreciate using your savings to implement the project, as your commitment to this project. However, you should also consider ADA price fluctuations that may affect your spending plan for this project.", "q1r": 4, "q2": "This proposal has a large impact, so it makes sense to take it to step by step and with a clear roadmap. The proposer has given very specific goals in each phase. However, the step-by-step audit method has not been fully mentioned. It would be great if the method of tracking progress and the success measurement of the project was mentioned, it would increase the credibility of the project.", "q2r": 4, "assessor": "z_assessor_1220", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Blockchain is quite a new technology for many people, but we can push the adoption of this technology faster and I think coffee shops are a good place to implement because in Vietnam we do the same thing to make many young people able to approach and learn English skills. This business model is quite successful and still exists in the market.\n\nI read the impact of your team and I see a lot of benefits for people when they go to Beanchain Coffee, but how much of anything do people have to pay for this service, I do not see your team mentioned in this proposal. If everything is free I think it is not sustainable for the financial statements. \n\nTo my knowledge, to run a coffee shop, the management of cash flow is very important. And with English coffee shops in Vietnam, young people must pay for their drink but the English talk or game or event is free.", "q0r": 5, "q1": "\nLike I mentioned above, to make this proposal successful I think cash flow management is very important. Besides the cost break, your team needs to estimate the revenue of Beanchain Coffee. But I see one of your consultants has fundamentals in accounting and project management, so I believe your team can handle it when the proposal is funded.", "q1r": 4, "q2": "I see your team quite understand the importance of revenue when you mention it in the Sustainability metric, I totally agree with your team, but I just have one concern about your goal in this part is: Revenue to Cost ratio of 1.0 or higher, in my opinion, is quite optimistic because when you run a coffee shop in short term, the revenue is not cover enough cost. I suggest your team can set the ratio for the short term, middle term, and long term. For example: in the short term (under 06 months) ratio is 0.75, in the middle term ( 12 months) the ratio is 1.0 and in the long term (more than 1-2 years) the ratio is higher.\n\nBy the way, this is my small suggestion, in general, you set the metric very clearly and I give your team my trust.", "q2r": 4, "assessor": "z_assessor_1344", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal offers an interesting approach to combining Blockchain and coffee to become a local community hub that provides high-quality information, demonstrations, and classes about Blockchain technology for anyone who wants to learn about it. With this model, the team will be accessible to a wide range of customers and inspire participants through classes, live seminars. and online, thereby adding value to the Blockchain community in general and the Cardano Ecosystem.\nThe Blockchain Learning Center + Coffee model makes the group self-sufficient and can scale up by opening new locations; it conforms to the 'minimum viable centers' (MVH) principle.\nThe proposal also clearly identifies difficulties and challenges in the process of implementing and expanding the project and offers appropriate solutions to solve the problem: Developing relationships with colleges and clubs local ministry enthusiastic about blockchain; Diversify revenue sources to maintain and develop the system and build a large and inclusive community.", "q0r": 5, "q1": "The team has the technical expertise and experience required to implement the proposal from the link provided. The proposal is in the process of actual implementation and the team proposal also provides a reasonable budget linked to specific time and goal constraints, not only showing what is being done but also Implementing how to get the job done.\nThe cost to set up and operate a coffee shop is large, however here the proposed team only requires a reasonable amount of money to set up and operate the learning center without requiring Catalyst to pay for the business coffee shop and they also offer solutions to mobilize capital for the remaining costs to ensure the project can be successfully implemented. In addition, proposing solutions to increase revenue and expand the model.", "q1r": 5, "q2": "The proposal has a clear step-by-step plan with specific timelines that allows the community to track its development and provides several metrics to measure the project's success. The proposal offers a financially sustainable model with the possibility of scaling up if the proposal is successfully implemented.", "q2r": 5, "assessor": "z_assessor_1457", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "As we all know Blockchain is being developed more and more strongly, but in fact, many people do not know or still understand very vaguely about Blockchain. With the idea of ​​​​building chains of restaurants, or cafes for everyone to have a place to work and learn about Blockchain technology is a great thing. I think Blockchain technology is not really popular with everyone, and knowledge about Blockchain is very vast, creating a good environment for everyone to learn and exchange knowledge is a very important job. necessary, needs. here the proposed group has raised the issues and is very clearly defined. will open a cafe with large space. so that everyone can gather here. I think this proposal is well suited for future challenges. I think it is advisable to scale up to develop this model more widely. I think this idea will solve future challenges. The solutions offered by the team are also very reasonable and will be aimed at those who do not know, do not understand, or still have doubts about Blockchain technology. to change their minds to help them see the good that technology can do. I found this project to have presented evidence, arguments, very well. Besides, the group also pointed out some risks that the project may face. and have shown how to overcome those risks in a reasonable way as in the project mentioned above. I would like to add a comment. when building a cafe or a certain service. then it is necessary to have strategies to attract new people who want to be interested in the accompanying Blockchain, so that they find Blockchain technology interesting and they have a need to learn about blockchain.", "q0r": 4, "q1": "With a detailed plan and timeline provided. I saw in the group project that a specific milestone was stated. that is to be completed in 12 months. and has been divided into three sub-stages. I think the timeline that the group has split up is reasonable. with this timeline in my opinion is enough to complete the set tasks. The team also had specific goals set for when this milestone was reached. The progress of the project is also easily tracked by the community. with a budget of less than 10% of the challenge's budget and has been broken down for each phase. I find the splits to be quite reasonable. but I need the proposal group to state more tentative options in case of need to supplement the budget, what to do. Regarding team members, I see that the group has mentioned two members, and has assigned specific tasks to each member. I think with two members is not enough. However, through research, I found that two members of the team have experience, very good qualifications, and the identity of the member is verified. and easily checked by the community. I strongly believe in the suggestions that the group has presented.", "q1r": 4, "q2": "In the description measure progress and development. I see that in the group proposal, there are quite specific measurement indicators. There are five goals to be achieved. The indicators are also easy to check by the community. The successful part of the project is also clearly described that it will attract more people into the community, offer a variety of courses, and seminars. I see the success of the project in relation to the challenges of the campaign. What's even more amazing is that the team's project has been piloted at a small local scale, there have been, with some small successes, for example, partnerships with local trade schools and local businesses. Other prestigious schools agree to sponsor and incorporate. Although this is a new project, it has not been funded yet. but I see that the proposed team is very enthusiastic about this project. I hope the group's project will gain more success. will get many votes from the community. and has high ratings. I fully support this project.", "q2r": 5, "assessor": "z_assessor_1486", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The idea of the project is close to daily life, the location of the cafe is quite smart, helping to target a specific audience. You are worried about the teacher, I have the following suggestion, please turn the courses into small seminars, anyone with enthusiasm can discuss and present to everyone. Instead of spending time looking for capital to invest, you also have to ensure a profit for each of those capital sources, focus on coffee, other drinks, fast food, coffee shops that will feed themselves. Also, if the project goes well, you just need to write the next proposal, the Catalyst fund and the Cardano community are always with you.", "q0r": 3, "q1": "I appreciate it when you set aside 20% of your savings to get started. You can list more clearly the expenses in the section “Implementing system for hosting and distributing courses” so that the community can see the appropriateness. You are aiming for cafe + blockchain, I think the members' media should be diverse, if there are any other interactive channels (telegram, facebook...) please send us more links", "q1r": 3, "q2": "You state a lot of ideas, but not to the point. You should specify the numbers achieved by each milestone in terms of revenue, the number of people interacting with the blockchain, the image of the cafe, the seminars, the number of people in the community channels… I respect your ideas very much, the proposal is long but has not highlighted the core things, hope my suggestions help you somewhat", "q2r": 2, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The idea behind this proposal is revolutionary to say the least. Basically it’s about having a blockchain learning center inside a coffee shop. The goal here is to arouse the interest of the shop clients about the courses taking place inside the learning center which will be separated by a glass with the coffee shop. The thing with revolutionary ideas is that they can work, so why not give it a try. A certainty is that if it works, it will bring a lot of value in the cardano community. Personally, I support the idea and I wish good luck to the proposers.", "q0r": 5, "q1": "I have high confidence in a successful implementation of this proposal. The proposers have included all the information necessary for a proper execution of this project. The budget has been broken down accordingly and the proposer will inject his own money in this project which is really great. I know that one of the metrics of this challenge is to favor a proposal with a fund request not superior at 25000 usd - but the proposer has already done so much and even invested 40k usd already and committed to invest 200k usd. This proposer has shown me that he believes in the project which makes me a supporter of the project. Altogether, there is a roadmap, a great budget breakdown and the commitment of the proposer, which give me confidence  in a successful implementation of this proposal.", "q1r": 5, "q2": "I think that this proposal included all the information needed to track its progress. They have provided a roadmap with milestones for 3 months, 6 and 12 months. Furthermore, the metrics/KPIs that they have provided are pretty strong. As a digital marketer I’m familiar with ecommerce industry standard metrics such as the 2%  conversion rate they have included in the proposal. Altogether I have high confidence in the auditability of this project.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "\"With more than 1 year of experience in community building and stake pool operation. I understand better than anyone about the community's needs for support: the need to understand how to create a wallet account, use the wallet to buy and sell transactions, stake... I currently manage a group of more than 46k members. On Facebook. But I fully support them by creating online video tutorials. And just these videos all the community can do by themselves. I want to analyze a point here is:\nAdvanced subjects like programming require long, quiet classes, and at least one peer teacher with them. Therefore, it will be completely unsuitable for the cafe environment.\nBasic knowledge can be taught at cafes or online.\nIn any locality, especially cities, there are many cafes. Your team can choose any cafe you want and just need an internet to start working.\nI don't think it's necessary to create a new cafe for the activities you mentioned in the proposal.\nI don't really support projects that \"\"make excuses\"\" to ask for money but actually do not use the right goals that the cardano platform is aiming for: developing applications on the cardano platform, and educating the market school for them to use more.\nBasically I think you should pay for opening a cafe for your personal business purposes.\nYou should only claim a portion of the cost if you create educational apps or products to support and grow the community.\"", "q0r": 4, "q1": "\"I envision a cafe where people exchange information about blockchain. Mainly to support the community to access and know how to use wallets, crypto transactions...\nYou should supplement the content of the intensive courses your team is aiming for to increase awareness and understanding of the community.\nIn addition, activities about in-depth education, and really creating applications that come to life on the cardano platform are needed.\nYour project is feasible, I just find the funding part a bit unreasonable.\"", "q1r": 4, "q2": "\"You asked for $40k for community support activities at the cafe, but the plan didn't work out:\n\"\"Goal: 5 wallets per week in first 3 months, up to 5 wallets per day after 6 months\"\"\nYou may not like to hear this, but this goal may not cost a dime to achieve.\nCan you give us an explanation for this?\"", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "\"Opening one Beanchain in Mesa Arizona to start and hosting only as many workshops as we can support with a couple teachers\" is a smart way of addressing the challenge and in return adding value to the Cardano Ecosystem. I have not had the chance to live in Mesa Arizona before but as said in this proposal, there's always a group of people in every country who are suspicious of blockchain. Through several workshops hosted in the hub, it's definitely clear that after education, Cardano will see some new people being onboarded to ecosystem and that's why I think this proposal addresses the challenge effectively.  \nOne can tell clearly that the main goals of this proposal and that of the challenge setting aligns as there's going to be a hub accessible to all at the end of 6 months post-funding. Also, information will be made available to even those who may not have access.\nI see that this proposal will scale to address future challenges looking at its scope and vision.\nTherefore, I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "With a clear timeline provided by this proposal, the community are able to expect a certain deliverable at the end of a certain period. This proposal wishes to provide KPI report at the end of every 3 months post-funding which is great but I think it would have been nice if at least there's something to show at the end of every month with regards to progress report because it's a very promising project and I'm everyone would love to know what's going on with it almost all the time. However, that's not the reason for deduction of star though. Instead, the budget being requested by this proposal which's $33.8K is out of scope with regards to a cap emphasized by the challenge setting that CAs should favor proposals that are seeking not more than 5% of the total challenge budget. It is clear that this proposal is requesting for 6.76% which's 1.76% more than budget cap. Significance is that, 1.76% which is equivalent to $8.8K could be of aid in funding another hub to increase scalability. \nAside that, the proposing team have done a great job by breaking down their budgets into verifiable items and expense. It makes sense to me that the requested budget could definitely ensure the successful implementation of the project but the team should pay attention to challenge caps during next iterations.\nA team of three (3), i.e., David Baxter, William Burns, and Simon Fleck, with respect to their relevant experience and partnerships with Gimbalabs, Catalyst School, Cardano4Climate and local trade schools and universities gives me the surety that this proposal if funded, will be successfully implemented. \nThey've also done well by articulating the potential risks and providing alternatives that would help them implement successfully should in case any of these challenges pops up.\nI want to congratulate the team behind this proposal and wish them good luck! as I agree that it is highly likely that this proposal will be implemented successfully if funded. ", "q1r": 4, "q2": "\"Success will be measured by how well we can serve the people in our local area and those online that want to learn more about the blockchain.\" This clearly indicates a clear understandable solution that addresses a clear understandable description of the problem. Looking at the roadmap which is pegged with milestones even though I wish it could be on monthly basis, a time horizon for achievement is clearly indicated. The metrics/KPIs of this proposal aligns perfectly with that of the challenge setting and there's sufficient information provided to aid the community in auditing the progress of this project if funded. Good job! and Good luck!", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Provide a community learning center attached to a crypto positive coffee shop that offers demos and classes covering a wide range of topics.", "experience": "I'm a front end engineer and I have been a barista in the past. I have been inspired by the passion of the Cardano community! I've been working with many organizations within the Cardano ecosystem to refine and develop this project."}