{"id": 397460, "author": "vcoincheck", "title": "Knowledge hub for Vietnam and Japan", "url": "https://cardano.ideascale.com/a/dtd/397460-48088", "category": 26439, "amount": 14000, "description": "Cardano originates from Japan and has a lot of ADA holders but the problem is the level of engagement with the int' community is still low.", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": ["https://www.youtube.com/watch?v=t86e0M-262A&start=6045"], "media": [], "f6_assessments": [{"id": 588, "q0": "- Japan is a difficult market but also very potential with leading technologies in the world. However, the Japanese have a large language barrier to access information about blockchain technology written in languages ​​other than Japanese.\n- The project is an extension of the vcoincheck 1.0 project but in Japanese language. Help the Japanese community have more information and knowledge about blockchain as well as cryptocurrency projects. Through the project, many Japanese will be able to evaluate which Cryptocurrency projects are good and which are scams, thereby avoiding financial losses and having a better life. More Japanese people will know Cardano.\n- The project also helps many Japanese to have more knowledge about Blockchain, Cardano will have more quality CAs as well as many additional quality proposals for Catalyst.\n- The project also helps many Vietnamese who know Japanese to have more income from the new job of translating and analyzing cryptocurrency projects.\n***Suggestions/ advices:\n- Project to find Vietnamese people who know Japanese in Japanese language training centers. At these centers, the level is not really uniform, so if the project can provide specific selection criteria, the efficiency will be higher. For example: Japanese language level of N3 or higher and interest in technology will be a priority.", "q0r": 4, "q1": "- The project is an extension of the Vcoincheck 1.0 project, besides having a clear implementation plan every month, the workload is not too much, mainly translation and training, so the project is completely feasible.\n- The project has been carefully planned and calculated: the work items are allocated and detailed monthly according to a reasonable schedule.\n- The project has a plan to interact with the community through periodic Zoom meetings. This will help the project owner evaluate the effectiveness of the project through the number of people attending the zoom meeting from which to make adjustments on how to do it.\n- Reasonable budget allocation for each item. In addition, the project took advantage of available things such as a professional Zoom account and did not ask for capital in these categories.\n- Strong team with many suitable skills to execute and develop the project\n- Information about each member is transparent and clear, and can be connected at any time\n- Rich blockchain experience\n***Suggestions/ advices:\n- Currently the project's planning focuses largely on how to build a good product and Marketing mainly through face-to-face or passive meetings. Marketing strategy is an extremely important part of the project to attract more Japanese to know and join the team. Therefore, the project needs to have a more detailed online marketing plan with many online marketing plans suitable for the Japanese market.", "q1r": 4, "q2": "- The project has its own website\n- The given project indicators are useful and completely measurable through the project's website\n- The project gives a committed number for each criterion to be completed in each phase\n- The project describes very clearly and in detail the goals the project will achieve to describe the success of the project.\n- Indicators can be easily measured publicly through the project's website as well as the number of people participating in periodic zoom meetings.\n- Measuring website traffic is also very simple with a small add-on\n***Suggestions/ advices:\n- The project builds more Marketing categories to attract the community as much as possible because this is an online product. Resources spent are the same for different users. For example, in a zoom meeting to share knowledge, the resources used to share with 10 people are not much different from sharing with 1000 people.", "q2r": 5, "assessor": "z_assessor_1192", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1369, "q0": "We acknowledge that Japan is one of the biggest markets of Cardano and the community for this market is also big too. Vietnam has a large number of young laborers, is interesting in technology, and also has a reasonable salary for people who know Japanese.\nSo we must do a lot of things to serve and connect these markets together and make them love Cardano more and more. English is not a parent language of this market, so the project to translate knowledge of Cardano and Catalyst to Japanese is very necessary. After having content for suitable language, we can create a lot of things such as the library, course, webinar,...for people of the Japanese community. When people have knowledge or understand about Cardano, they will believe and maybe become a volunteer ambassador for it. And if your team do this project well, I hope the number of new joiner for Cardano is increased much.", "q0r": 5, "q1": "I feel so impressed with the number of your team member joining this project and their experience. With the kind of content project and huge information Cardano published every day, I think the manpower and their qualification for this project is the most important thing to make sure the success of the project. One of my suggestions for your team if this proposal be funded is to not forget about Marketing activities, because if you have a good product but do not have good marketing activities, your project will not go far and maybe can not compete with other projects.", "q1r": 5, "q2": "Because your content is displayed most on the website, besides the metric of quantity for the content we should add more metrics to evaluate the quality of content. On the website, to evaluate the quality of content, I usually use some of the metrics such as the average time on page, the page per session, and the bounce rate,...To evaluate the quality, of course, your team should create a survey after ending of each course, based on the result of the survey, you have a lot of insight to improve your content, trainer,...to get more people joining the next courses.", "q2r": 4, "assessor": "z_assessor_1344", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1598, "q0": "I strongly agree with the proposal for the idea of ​​expanding coverage to the Japanese community. The proposal matches the challenges of Scale-Up Cardano's Community Hubs. Currently, English is considered a common language for the whole world, but the number of people who can use English fluently is very small and there is still a language barrier. Therefore, the exchange of culture and knowledge is still limited. The proposed approach to solve this problem is to build a website for project evaluation, where information about the project can be found, as well as sources of knowledge that are scientifically synthesized and methodical and translated into Japanese. This will help a large number of Japanese people to better understand the Cardano ecosystem, increase adoption and raise awareness. In addition, it is also a cooperation between two countries, Vietnam and Japan, creating a sustainable community in the spirit of learning from each other. This is a very useful proposal, helping the blockchain space as well as the Cardano ecosystem to develop sustainably in the future.", "q0r": 5, "q1": "I completely agree with the roadmap proposed by the proposer, very specific and detailed for each work to be done to realize the idea. The proposal also discloses very specific information about each team member, working experience as well as professional qualifications to meet the quality of the project.\nChallenges and risks are also highlighted so that voters can understand the difficulties of implementation.\nI am confident that the proposal will be successfully funded", "q1r": 5, "q2": "I completely agree with the milestones and timelines given by the proposer. It is suitable to measure the success of the project. Provide multiple sources for readers to check the accuracy of information.", "q2r": 5, "assessor": "z_assessor_1394", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3689, "q0": "Vietnam and Japan set up the strategic partnership for peace and prosperity in Asia, marking a significant milestone in the bilateral relations. The good relations between Vietnam and Japan have been strengthened through regular high-level visits and exchanges by leaders of the two countries. The proposer want to build a website to evaluate project quality according to decentralized model and project quality in 2 languages Vietnamese and Japanese which will bring both the community together involved in the cardano system. The proposer has identified the need for Knowledge hub for Vietnam and Japan and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 4, "q1": "The proposer has a very innovative idea of introducing Knowledge hub for Vietnam and Japan and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 14000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more users which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5078, "q0": "In my opinion, expanding the Cardano system in Asia, specifically Japan and Vietnam, is a pretty good project. Because at present in Vietnam, the development community sharing knowledge and experience on assessing the quality of cryptocurrency projects is in a rather narrow scope. Building a community center on the basis of your existing website Vcoincheck is really useful because it will save the initial cost but still create an effective community spread. However, the language barrier is still quite large because currently Vietnamese people know a lot of Japanese, but the Japanese language for specialties is not really much. Therefore, this project will also have the potential for development and be very useful, but there will be many difficult challenges.", "q0r": 5, "q1": "With this Vcoincheck project, I find it possible to do with the detailed development plans and cost targets that this project offers. Besides, currently the number of Vietnamese people learning Japanese at the center. to export a lot of labor so there will be a large number of people who know Japanese. This is also an easy advantage to train these Vietnamese to learn more specialized Japanese. This project has a team with many years of experience and good capacity. I also agree with Vcoincheck's specific standard that Admin will be Vietnamese fluent in Japanese at N1 level, with good knowledge of blockchain, Cardano and professional project evaluation skills. . This will help the project develop in the best way when selecting really qualified people.", "q1r": 5, "q2": "I think even though all industries are facing change, the digital asset ecosystem is growing out of the box. Auditing policies that conduct audits of entities in this ecosystem should be prudent and weigh their own risks and challenges.", "q2r": 4, "assessor": "z_assessor_1844", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9973, "q0": "The proposal is clearly focused on the Japanese-Vietnamese community exchange knowledge based on the East Asia in culture, history and humany ideology. The problem is sharply defined. Regarding the solution is simple a translation of the Vcoincheck.io (in which the team has a separate proposal.) with same team members. The solution is simply a swap exchange knowledge between the working expats.  The more advanced solution should not only be stopped at the translation, the team also propose the training course for deeper and more interactive communication. It would be more holistic approach if the proposing team can really understand the needs of Japanese community. Moreover, the risk is only mentioned about the language barriers. The proposal is an extentional feature based on the ecosystem of VCoincheck.io, this would be really encouraging for language adaptation to grow the community, thus the proposal is well aligned with the challenge setting of  Scale-UP Cardano's Community Hubs. One suggesion for the team is the key successful factors should be the ambassador from the Cardano Japanese community based in Japan.", "q0r": 5, "q1": "The budget is 3% of the total challenge is reasonable for the whole challenge setting. The milestones is a consequential step based on the roadmap of the vcoincheck.io. The training part via zoom is only mentioned about zoom account cost and instructor fee, the criteria to pick the right instructors is highly recommended as a proof to show the feasibility of the project. The duration and agenda of the training zoom session should also be well identified at this stage, and the interactive Q&A is such important for the community to verify.The Japanese content team is the improvement from the previous fund with the connection of the Japansee ambassador hub in Vietnam makes it very feasible for the project to be deployed. Once again, the initial survey should be really crucial for the understanding the need of the Japanese users. It is a point for the risk management of the buffering budget for the fluctuation of the ADA price during the releasing of the fund.", "q1r": 4, "q2": "The target mostly depends on the roadmap of the vcoincheck projects. There should be a demo of the wireframe/translated page for the Japanses users to judge/comment at this phase. The monthly introduction online meeting should be clearer with agenda and the how to attract the estimated participants. Training instructor profile is a key successful factor that should be mentioned so that it can be tracked at the later stage of the proposal. The project team got funded in the Fund7 https://cardano.ideascale.com/a/dtd/Project-Evaluation-Website/381388-48088  and the team also has the website vcoincheck.io to go live. The  knowledge piece and the content of the zoom instruction session is not yet well-defined at this time of the proposal, however it should be highly appreciated the team think about the East Asia connection and exchange knowledge. \n", "q2r": 4, "assessor": "z_assessor_782", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10158, "q0": "-The proposal's problem statement shows directly and clearly issues about Japan ADA holders who do not join international Cardano community widely. In spite of they hold a lot of ADA coin.\n\n-Its solution make a website, what shows evaluated projects are built on Cardano platform. According to the solution that they will connect and improve Japanese community,who are living from both Vietnam and Japan. They also make courses to train Japanese in order to be able to analyse and assess crypto projects ang help Japanese community to get knowledge and experience about Cardano blockchain ecosystem.\n\n-Its proposal presents that they will evaluate total numer around 200 quatities of projects.\n\n-In conclusion, Its solution is coincident Cardano's vision that thay will grow community to be popular.", "q0r": 5, "q1": "-The proposal's timeline plan shows detail clearly. Its plan devide works properly. The first month and second month focus on writting content of 50 projects and translating them to Japanese. They arrange thier works for 2 months properly.\n\n-Its plan for third month focus on marketing  in detail about introduce the proposal to Japanese community through Catalyst town hall and social channels. They will also recruit and train more participatants. And target for third month is avaibable and possible.\n\n-Its team members of the proposal can be checked through links from social channels. They joined to research Crypto from 2017 so thay they have experience to assess and train   participants to be able to evaluate projects that are built on Cardano blockchain ecosystem.\n\n- Its team members who have N1, N2 level certificate for translating Japanse. Their certificate shows most of them to have at least 5 years to 10 years experiences in translation career.", "q1r": 5, "q2": "-Its proposal plan targets in 3 months that shows specific number of the evaluated projects are 200 quantities. All projects are also translated to Japanese.\n\n- They commit to train at least 5 participants who will be able to assess and analysis crypto projects after training courses.\n\n-The number,100 Japansese will know their website and 200 interactions or visitors, are specific and can be got possibly.\n\n- Each of month has a specific target which can be checked easily.", "q2r": 5, "assessor": "z_assessor_818", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "we want to create a knowledge hub for project quality evaluation for the Vietnamese and Japanese communities through our Vcoincheck.io", "experience": "Our core team Vcoincheck.io team, more than 5 years of experience in translating and interpreting Japanese and English, working with Japanese people and having at least 2 years of learning blockchain knowledge, knowledge of Cardano, information from Catalyst."}