{"id": 398044, "author": "tienna", "title": "Townhall Channel in Vietnamese", "url": "https://cardano.ideascale.com/a/dtd/398044-48088", "category": 26439, "amount": 17100, "description": "Strategy info from the weekly Cardano Townhall has not promptly reached the majority of Vietnamese and avoid mis/disinformation.", "f6_no_assessments": 11, "f6_rating": 4.575757575757575, "videos": [], "media": [], "f6_assessments": [{"id": 7318, "q0": "The idea is excellent and fits very well with what is sought in the challenge. It's about summarizing the Town Hall content into small podcasts about 5 minutes long, and translating that content into Vietnam's native language. I believe in several points that make this proposal a great potential for success, but we are going little by little. At first, I would like to reinforce that this challenge of hubs, unlike the challenge of new members on board, seeks to promote and popularize our blockchain for more specific communities; therefore, translating the contents of the main meeting of our ecosystem into Vietnamese is certainly making this information more accessible to the natives of the country, mainly due to the fact that a very long time (from 2 to 3 hours) will be converted in a few minutes. I believe it is a problem for everyone, not just the Vietnamese, to set aside so many hours in their work and study routine to regularly attend the Town Hall. So this idea corresponds exactly to what we are looking for in the challenge: to make information about Cardano more accessible to a particular community. This objective can be very well identified in the following excerpt, found in the description of the challenge, which talks about what success looks like: “Local Community Hubs across the world where the average person can take part in their own language and with their own cultural understanding” . Another very positive point that I believe will increase the impact of this proposal is the fact that the Vietnamese community is very strong in our blockchain, I say this because I have already evaluated several proposals that said about the country. As I recall, it is one of the places where Cardano has one of the biggest fan base when it comes to its geographic region. Another proposal that can relate very well to this topic is the 2-minute review of proposals for Vietnamese, if memory serves, launched and financed from fund 7. Therefore, we have a lot of evidence that this specific audience should be a target for investments, as once we manage to strengthen a community that is already quite active in our ecosystem, it will be easier for us to win fans in places where Cardano is not so well established, in my sincere opinion. Therefore, I think this proposal deserves maximum marks in impact, the idea is very good and I would like it to be done in several languages ​​(I would adopt a summary of the Towns Halls myself, because between work and studies, it is not so simple attend meetings every week). \n", "q0r": 5, "q1": "The script presented is, in my view, superficial. Although the proponent does not divide the activities into very long time intervals (when this is done, it becomes difficult to visualize the process, as there are many activities for many months, so we do not know when each thing will happen, if parallel activities could occur and etc), yet the level of specificity is low. In fact, the time becomes very long from 4 months onwards, where the next milestones are only expected for 8 months. I say this because there is no deep detail about the activities. For example, in the first three months, they are expected to establish “workflow/tools” that help guide the work. What tools would these be? How would they be selected? What would be the work routine of those who will summarize and translate the Town Halls? It is said that from the third month onwards, feedback would be collected, KPIs that would serve as a basis for the team to adapt the work being done to the needs of its viewers. What KPIs exactly are we looking to collect? How would this information be collected? I think the script could be different, if it were divided monthly and all activities were well explained, the quality level of this part of the proposal would certainly be increased. Regarding the budget, the requested value is approximately 17 thousand dollars. This value is explained in great detail, but could still be better argued. For example, we have fixed costs, but we don't know why each quoted part has the amount that was requested. The site operations would cost about 1500 dollars, but why? Who would work on it and for how long? Regarding the cost of the Town Halls translations, I don't think the best way to calculate the final value of each meeting is by the number of words, even though the proponent has made the calculations that the average duration is 2 hours per meeting that approximately 18,000 words would be spoken in this... these values ​​are not easy to check. I believe that no one will count the words, neither the team involved in the project nor the members of the Cardano community. Therefore, the fairest way in my opinion would be to establish an average price per minute. For example 1 minute would cost X in translation, you know? Therefore, I think the financing part could still be better. And finally, speaking of the team, this part of the proposal is really very good. We know the names of each team member (I don't understand about the @, would they be for instagram?), a small resume of what they've done so far, how they relate to Cardano and several links from their social networks, including their linkedins, where we can see their professional backgrounds in a proven way. The only observation would be to more clearly determine who would do what in this project. \n", "q1r": 4, "q2": "Regarding the audit of the process: it is mainly based on how many people visited the site, listened to the podcast, how many documents were translated and how the feedback from the target community is being. In my perception these are really the most direct and correct ways of perceiving if the small, gradual conquests are being achieved. However, two things come to mind: first, how will we have access to all this information? How could the Cardano community check these statistics? I think the team needed to make this clearer. The professionals that make up the team actually seem to be highly qualified people and involved in our ecosystem, so I conclude that they know the various ways to share information of this type, such as telegram or discord channels, for example. I also think that the focus here was very much on what was achieved and not on how it was achieved, that is, it is not described how the team's daily work would be audited. It is very important that this is also discussed. How can we know if, within X period of time, the activities were developed by the right people, in an adequate way, if there were any problems, any difficulties with deadlines? How can we resolve the possible impasses that will arise along the way? Therefore, I believe the team should also look for ways to demonstrate how the day-to-day development of the proposal has been. And finally, about the final scenario that is imagined: we know well where we want to go, as the bidder explains in great detail what would need to be achieved in the 1, 3, 4 and 8 month milestones. In my view, the detailing part leaves nothing to be desired in this final part of the proposal, as the proponent makes it clear how important it is to understand qualitatively what has been achieved, and not just quantitatively. My suggestion here is the same, how do we make all the information easily accessible to the Cardano community? Due to the nature of the proposal, my suggestion is that a large final report be made, containing infographics that can visually demonstrate the data studied, and that this be sent either via email, or by telegram, or discord, in short, any platform already used by the community. The bridge between team + data and community must be solid. I will give the maximum score for auditability because I believe that the bidder was concerned and explored very well ways to monitor this project, just make them more accessible to all members of our ecosystem. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2, "reply": "Thank you, and we highly appreciated superb valuable comments on possible gaps in the proposal.  \n\" (I don't understand about the @, would they be for instagram?)\" after @username is ideascale username. Very details comments actually. Thank you. Hopefully, this round, we will be fortunate to grant the fund and delivery this exciting project to the Vietnamese community and potential as a pilot test for other non-native English languages involved in the Cardano ecosystem.   "}, {"id": 365, "q0": "With the aim of periodically producing translated materials that will serve not only the population of Vietnam, but like all those speakers of Vietnamese, we see that the idea of the proposal fits the objectives of the challenge in question. It is also interesting to note that the Townhall will be translated weekly, in addition to the production of summaries and texts, and the periodicity of production of all these materials helps to bring greater engagement so that speakers of the language are updated and more comfortable in expressing opinions. about the ecosystem. We can also mention that, clearly, this increases Cardano's visibility and can attract new ideas that reflect regional needs that are often unknown. We also see that the amount of funding being requested of $17,100 is reasonable for what you want to accomplish in the given time.", "q0r": 5, "q1": "It is interesting to see that the project was not initially planned for a very long period (which could trigger a very expensive budget). The strategy of first producing materials for a period of 4 months was good for mitigating risks. Another positive point that we see is the organization of these actions over time. In the initial months, the first objective is the production of materials, so that only from the third month onwards, these materials begin to be disseminated. It is also worth noting that in this period, feedback is already sought and, if necessary, production strategies are adapted, showing the team's preparedness for possible changes along the way. In fact, we see that the professionals who make up the team have very relevant experiences for the project. Some of the attributes that the team has are experiences in the area of ​​computing, translation, business and previous knowledge about Cardano. Additionally, we note that the CVs of the professionals involved were made available.\n\nRegarding the breakdown of the budget, it was interesting to see the division between fixed expenses and expenses for video. Which allows us to come up with the average monthly expense of $4,275. Given the tasks that will be carried out monthly for the maintenance, translation and publication of the materials, we see that the calculation to arrive at this value in general seems consistent, but the caveat that perhaps the cost per hour of work mentioned in “expense per video” seems valid. $60 is perhaps a little high. Another observation that seems pertinent would be an allocation of capital aimed more specifically at the marketing of the project, seeking to give more visibility to this new way of obtaining knowledge about Cardano.", "q1r": 4, "q2": "Regarding the stated ways to check the project's progress, we see that the team stipulated clear ways to follow this. User feedback and the number of visits to the site were established as parameters, which are good ways to capture impressions about the scope of the project. It's interesting to see that the team even has well-defined quantitative goals about the expected impact of the project, and we can see this by the expected growth that was indicated, as in relation to the audience of the podcast, for example.\n\nRegarding the ideas conveyed in relation to the perception of success of the project, it is very cool to see here that the focus is not simply on achieving the goal of delivering the translated materials. We also observed a constant concern of the team in making refinements in the way of work being carried out, as well as introducing questionnaires in these translated materials to collect feedback. In addition, we also see that the verification of compliance with the KPIs will be considered, not only to assess the performance of this first stage of the project, but also to decide on a possible continuation of the same.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1370, "q0": "I think English is not the main language in Vietnam, so this is a reason a lot of Vietnamese can not approach the Catalyst Project. If they see any webinar including English, they usually ignore it. And the result is that Cardano Eastern town hall in Vietnam has very few people joining (maximum is 41) compared to Vietnamese population is approximately 100 mil.\n\nTo solve this problem we need someone who can do a translation job with clear, accurate, and easy-reading information from English to Vietnamese. If they understand something, they can easily accept it, and we can increase the number of Vietnamese who have knowledge about the Catalyst Project, and also increase the number of people joining Town Hall webinars. I very much appreciate this proposal of your team. I hope your proposal can be funded and your team can bring Catalyst and Town Hall more popular in the Vietnam market.", "q0r": 5, "q1": "In my point of view, the success of this project depends on the knowledge of your team members about the Catalyst Project to summarize or re-writing the information from Town Hall to suitable Vietnamese content (Video, podcast,...) and I see this thing when I read your profile and experience of each member.\n\nI see the final cost ($360 to 400$) per video is quite reasonable, but I need more detailed information or explanation about the labor cost for converting/uploading documents and podcasts to the website, sending the update to social networks that your team estimate is 120$/video, I think it a little bit high because it is not a difficult tasks and account for more than 30% (=$120/$360) of cost to make video. I suggest this cost account for 10-15% of video creation ($36-$54) is reasonable.\nIn other hand, with the task “Survey analysis, reporting, PM” to make voters have more insight, please describe more detail what information you want to survey and if can the methodology your team create a questionnaire and conduct a survey, these things can make your report is more reliable.", "q1r": 4, "q2": "One of the metrics I think your team can consider is “Number of people joining Town Hall” or “Percent increase of number people joining Town Hall”. Because when people join Town Hall webinars, we can interact with each other directly, so we can understand their demand to improve webinars or Catalyst projects. \n\nBy the way, content is king but the way you communicate also is the queen. So if your team can add the communication plan for the proposal stick with the metrics used to measure the performance I think it makes the proposal more comprehensive.", "q2r": 4, "assessor": "z_assessor_1344", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2613, "q0": "Congratulations Townhall Channel has started and maintained steadily. The project should link with the Cardano Vietnam community through communication channels such as telegram, facebook... to reach listeners quickly, they already have very strong communities in the country such as: Fimi, Coin 68. .. I have a small question how will the weekly topic be selected? In addition, your arguments in the topic are very tight, I am happy to rate 4", "q0r": 4, "q1": "The budget presented by you is very clear, easy to understand, the right amount. Also, I appreciate you breaking the project down into small phases for ease of development and sticking to the roadmap. The team has suitable capacity, develops many communication channels, is dynamic. My suggestion is that each topic should have two English and Vietnamese versions, because I think the first step is to summarize in English and then translate it into Vietnamese, without much effort, but support the communities all over the world. Great.", "q1r": 5, "q2": "The milestones given by you are very clear, the community will follow closely to monitor the development of the project. Regularly update the Catalyst fund, that will build transparency, the next funding rounds will be approved by the community. We are happy if the project goes a long way, and the members of the project are really pleased with the results", "q2r": 5, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4756, "q0": "The purpose of this project is to summarize the important contents of the weekly Cardano Townhall meetings in Vietnamese as a podcast within 2 and 6 hours from main Townhall. Sessions usually last 2 hours or more and are in English, so many Cardano project enthusiasts who don't have much time or have limited English will find it difficult to access, so the project is very urgent, it will help the community of Cardano lovers in Vietnam have the opportunity to access information more easily and quickly. Therefore, the project is suitable for the goal of this challenge to expand the community size and local characteristics.", "q0r": 5, "q1": "\" - The project has a detailed roadmap as follows: 1-2 months: Have a workflow (how to convert text to audio), tools and at least 05 translation documents, ready podcasts. 3 months: Provide translated documents, podcasts to at least 5 of the largest local groups on Facebook/Telegram; Collect feedback, collect KPI data, refine processes/tools. 4 months: Data feedback and KPI analysis, impact assessment of projects. 8 months: Expanding groups that need to spread translated materials, podcasts. The project has a clear and appropriate roadmap that can be successfully implemented.\n - The total cost of the project is $17,100, in line with the challenge requirement of not exceeding 5% of the total Challenge budget. This total cost includes a fixed cost of $3,500 for Website Dev/Ops labor, integrate text to speech converters and Website resources, a weekly cost of $700 for summarizing and making videos/podcasts and a contingency of $1,700. The translation cost is based on Cardano paying 0.02 USD/word, so this cost is reasonable. The cost of labor for converting, downloading documents, analyzing, surveying... 60 USD/hour is quite reasonable. However, with the cost of risk provisioning at USD 1,700, the project has not yet stated what unforeseen risks are. If the project is funded, the proposed team should anticipate risks such as the duration of sessions may be longer than 2 hours, staff may be sick or have unexpected events affecting the topicality of the meeting, have to find a replacement in a short time…so the cost may be increased.\n- The project's personnel are experienced in translation, software development, understanding of the Cardano project, etc. The personnel information has a link to learn, so the personnel is very reliable. Therefore, the project can be implemented successfully.\"", "q1r": 5, "q2": "The project has set indicators to measure the progress and development of the project such as: Increase the number of the visitor by 30% every month, the number of podcast listeners by 20% every month, the number of ratings as a valued translated document (4 or 5 stars) from the feedback form by 30% every month, the number of monthly feedbacks by 20% every month. The key metrics to measure is consistent with the key metrics given by the challenge. And with these indicators, the community can completely check and evaluate the project easily and transparently.", "q2r": 5, "assessor": "z_assessor_1768", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5082, "q0": "The issue is identified as an important issue, the time zone difference leading to the delay in receiving cardano's information to members in Vietnam really needs to be resolved. With the above suggestion, I find that very reasonable. Especially Townhall is built as a Podcast which is very convenient for everyone. While people are busy with something in a space that is not convenient for watching videos, or low-profile electronic devices cannot watch videos. Besides, at present, Vietnam is a developing country, so it has a lot of potential and also has a lot of talented, enthusiastic and eager people to learn, so investing and developing Townhall is very right.", "q0r": 5, "q1": "The goals and estimated costs of each stage are very specific and detailed. I found it necessary to calculate the risks and you guys got it. This helps the project to be predictable and has a different plan for development. The way the budget is calculated is also listed very clearly, many other projects do not have the detail as this proposal. This is something that needs to be further promoted to continue developing the project. Townhall's team is also talented people in Vietnam, so it will be a promising project with a lot of potential, I believe Townhall will be a very useful contribution to the Cardano ecosystem.", "q1r": 5, "q2": "This is a good way to measure the progress and progress of this project. The proposal has given specific target numbers and KPIs that need to be achieved in order to be able to carry out the next steps in the plan. In particular, there is a plan for the second phase of the project, which is that if the project achieves its goals, it will continue to expand its reach by using facebook, which is a very popular social networking platform. Facebook is popular in Vietnam because Vietnam has more than 70% of the population using Facebook. This will help Townhall be known to more people, helping to reach faster and wider to everyone.", "q2r": 5, "assessor": "z_assessor_1844", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5283, "q0": "A not new but good proposal for the Cardano community in Vietnam. Carnadian has an additional choice of Podcasts with Vietnamese versions in addition to Youtube channels running Vietnamese subtitles. They can listen while driving, jogging, cooking... also a good choice. I rated: 3/5", "q0r": 3, "q1": "First of all, the workload is quite simple. The budget is set clearly, not too big. Participants have the experience to meet the proposal's workload. This proposal is workable, maybe even completed earlier. I rated: 4/5", "q1r": 4, "q2": "The proposed workload is quite light. The complexity of the work does not require a lot of time and special skills. It is possible to check progress and compare costs in the Vietnamese market. I rated: 4/5", "q2r": 4, "assessor": "z_assessor_1913", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8726, "q0": "As described in the proposal solution, a community of Vietnamese is going to be created via a website and through that information that's disseminated would be converted and shared to the commuters. This implies a virtual hub which is indeed an MVH. The idea of working within 2 to 6 hours after Eastern Town Hall (ETH) to summarize, translate, and produce a podcast (audio and text) to be uploaded onto the platform (website) is indeed a genius solution that addresses the identified problem of time and language barriers. \nAs requested in the challenge setting, a proposal should look at delivering information to people who would not otherwise have the access and ensuring resilience and self-reliance within the community. This proposal satisfies these two main requests and clearly articulates how it will scale to add value to the Cardano Ecosystem while addressing future challenges.\nGreat idea, great proposal and I strongly agree that this proposal effectively addresses the challenge. Good luck to it!", "q0r": 5, "q1": "From the roadmap, the this proposal clearly states what's to be expected by the community and auditors. However, no information is provided on whether or not connections with large Vietnamese groups on social media platforms are already established or yet to be established even though it states that at 3 months post-funding, translated documents and podcasts will be provided to at least 5 local largest groups on Facebook/Telegram. It would have been great if such information was provided clearly to satisfy the 3rd month KPI.\nThe budget for this proposal which is $17.1K sits perfectly below the budget cap indicated in the challenge setting and it comes with a very detailed and feasible breakdown indicating exactly how the requested funds, if funded is going to be spent. The team behind the proposal also did a good job by providing some links that could help confirm exactly what is being demanded. Also, a budget for risk is also reasonable as we all can attest to the fact that prices of services and goods may not be the same at time of implementing. This proposal has also indicated that the funds being requested is going to be fully exhausted at the 4th Month post-funding and they would write another to seek more funds to execute the remaining KPIs once the all KPIs estimated to be achieved within 4 months post-funding is achieved and that's a good step I think. Very transparent.\nFrom the proposal team details, it denotes clearly that this proposal has the relevant team members needed to successfully implement the project. However, I think only 1 translator (Mie Tran) may not be enough to execute the translation workload. I suggest that the team hires at least one more translator to help in the delivery of that particular task as it's not easy to do. Better still, if they plan to make use of a special tool to help in the translating process then that's great but at least it should've been stated in the proposal to enhance feasibility.\nWith foreseeable risks being considered in this proposal and adding to all that I've expressed above I agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "This proposal indicates exactly the mechanism that will be used in measuring progress or performance of the project which is by conducting of surveys to collect feedback from the commuters who make use of the work they do. The number of website visitors or website traffic is also going to be a great mechanism to detect how many people are interested in relying on this solution. Weekly measurement of progress definitely would be helpful to the improvement of the project.\nThe provided roadmap in this project is well written and directly connected with KPIs that can easily be audited by the community. \nAlso, this proposal clearly provides an understandable description to the targeted problem and as well a clear and understandable solution that addresses the problem.\nTherefore, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8941, "q0": "It is certainly that the proposal is a great idea and fits very well with the objective of the challenge because a summary podcast of the Cardano weekly Townhall meetings in Vietnamese will help Vietnamese Cardano community easy to touch strategic information from Townhall in a covenient way and saving time since the Cardano Townhall time weekly starts at 1:00AM Vietnam time. We can see the proposal addresses the objective laid out in the challenge as “delivering information to people who would not otherwise have the access” and help “ensuring resilience and self-reliance within that community”. Once it is successful, the project will help increasing the number of Vietnamese people who want to be onboarded, the number of meaningful Vietnamese participants in Cardano community, the number of quality proposals from Vietnam due to capturing reliable information from Townhall when the language and time barrier is removed.", "q0r": 5, "q1": "Certainly the project is built by a good team because of the presented and described in details about what their areas of expertise are, as well as their previous experiences, detail of projects they have already done, how long they have been in the areas with evidence provided. Their linkedin profiles are also provided, so that we can see more information about each of members involved, where we can contact them to know them better. \nAbout the financial amount, it is explained very detailed, and split quite fair and reasonable as we can see which identifiable items need to be spend money on, and how much would be use for them. Moreover, budget $17100 is 3.42% of total Challenge budget, therefore it aligns the condition “does not exceed 5% of the total Challenge budget”.\nThe detailed plan is given in a clear and succint way what is being done in each of months in a period of 8 months and the challenges/risks that the team has to face when conducting the proposal are also explained as well as the solution given to solve the problems. The well-prepared plan and the description of budget breakdown give us a vision of the project as a whole. Therefore, I give the feasibility with a score of 5.", "q1r": 5, "q2": "The information which is given for auditting is more than enough, consist of roadmap and milestones, KPIs and success metrics, which are very clear and understandable to be monitored. Regarding to the authors’ statement about the new section named \"Townhall2vn” will be create on the website to store translated documents and podcasts, it is easy for the internal and public tracking. Therefore, I strong agree that the proposal is fully auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9005, "q0": "The proposer has identified an issue which is that the Vietnamese are not able to have access to Cardano TownHall meetings. The problem identified here fits into the challenge setting. Vietnamese are really going to benefit and not just them alone but Cardano as a whole will benefit because the project has the ability of bringing more members to the ecosystem, and that’s a thumbs up to the team. I also appreciate the fact that the TownHall meetings that would be held according to this proposal are to be delivered in the local language, Vietnamese, that’s actuaLou another key area of this challenge. One goal of this proposal is to summarize the critical contents of the Cardano weekly TownHall meetings in Vietnamese, this information allows me to conclude that the metrics and goals align with the outlined challenge setting. In the long term, I believe the project would reach out to many Vietnamese.", "q0r": 4, "q1": "Given the information about the team members and the relevant experience described, I am certain that the team possesses the required skills and knowledge to execute the project. \nThe budget is well prepared and broken down into identifiable items, and that for me is very good to see that. I am also certain that the budget is reasonable to achieve the outlined goals and it also adheres to the MVH principle which is a critical issue in this challenge. There is a well described and detailed plan for the project and also the time table given is clear and definite.\nThe proposer has also taken into consideration the challenges and risks that may arise during the execution of the project and have provided measures to mitigate them, I see this to be very much important for every project.", "q1r": 4, "q2": "The roadmap is well presented and described together with the milestones and time horizon. However, I have a challenge with the success metrics at 4 months because it appears like there is no certainty as to whether the second phase will be created if KPIs are not satisfied. I will advise that clarity and certainty should be made on this for the purpose of future proposals. All thesame, I believe that the targeted problem has been well described and the proposed solution is capable of addressing the problem.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10266, "q0": "This is a good proposal. It created a Townhall Channel in Vietnamese. Helping Cardano enthusiasts in Vietnam save time in capturing information from Townhall. Commuters whether on trains, buses, cars, or a quick gathering to have a coffee early in the mornings with the low-end smartphone-like devices equipping with the internet connection etc. would be able to obtain the update-to-day Cardano\nThis has a positive impact on the Cardano ecosystem", "q0r": 5, "q1": "Information about the team provided is very complete, they have all the necessary skills and experience to carry out the project. Profile, information is publicly displayed through Twitter, LinkedIn, Telegram. Each person in the team has their own strengths, have specific successes, they combine to form a unified team, I think with a strong team, this project is completely capable of succeeding. .\nThe roadmap is divided specifically, it identifies each job performed in each different time period. The budget is allocated clearly and transparently. I appreciate that you set aside 1700 dollars as a risk reserve fund, this money can be used to pay for unforeseen risks. Or if there is no risk, this money will be rewarded to those who have tried their best at work, helping to boost the morale of all employees. Criteria to evaluate success are provided in detail, people can rely on them to evaluate the success of the project.", "q1r": 5, "q2": "It's a pity that this proposal was not funded at fund7. With the information provided, I think this proposal is completely doable. It will help Vietnamese people access Cardano easily and quickly, thereby contributing to the development of the Cardano ecosystem. In the future, I hope to have more languages, for example: Japanese, Korean,...", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "After 2 and 6h from the main Townhall, a 5 mins brief and 30 mins summary Podcast versions in Vietnamese ready for commuters, TL;DR users.", "experience": "Our team with relevant experiences in translating projects, DevOps, blockchain tech-savvies, SPO, Eastern Townhall moderators/co-hosts."}