{"id": 398211, "author": "swhitenstall", "title": "Funded Proposer Sub-Circle", "url": "https://cardano.ideascale.com/a/dtd/398211-48088", "category": 26439, "amount": 14215, "description": "Proposers funded by Catalyst lack a collaborative layer to answer FAQ questions, leave feedback, and raise and discuss issues / problems.", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers seem to have studied and understood the challenge. This project might increase the quality of funded projects, as the members would be able to share knowledge, experience and even increase a sense of belonging. These risks are very valid, but the team seems to have come up with creative solutions. ", "q0r": 5, "q1": "As the project will kick off from existing projects, it is more likely it will be implemented since there is already a base. However, I would like a more defined timeline, specific to this project.\nThe budget is reasonable and very detailed. I think there should be some extra budget dedicated to unexpected expenses to mitigate any issues that might delay the project. Overall the budget is very in sync with what is expected in this challenge. \nThe team seems very fit for the challenge and seems to be already inside the Cardano ecosystem. Though I would like some links to check their credentials.", "q1r": 4, "q2": "The chosen KPIs are very aligned with the project's purpose and are easily measurable. I would like to know if there will be some routine monitoring to make sure the project's on the right track, but overall I do think this project is auditable.", "q2r": 5, "assessor": "z_assessor_1659", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Get a mechanism of connecting funded proposers teams in small one's would be beneficial to the community and would allow a collaboration and connection between different teams.\nThe impact would be noticeable to the catalyst as learnings and thoughts will be shared and different improvements ideas would come up from that collaboration.", "q0r": 5, "q1": "The proposers team is already working on this idea of the sub-circle since the previous fund. At this stage of the implementation it's a continuation and the financially resources would be needed in order to be successful.\nThe funding are reasonable and cover the needed expenses for this proposal.\nI wouldn't see much challenge for this to succeed and the necessity of having such a framework through which funded proposers would share, communicate and learn from each other is necessary.\n", "q1r": 5, "q2": "The community would easily audit such proposal as it'll be piloted by community members themselves who\\,s proposals got funded. Also information will be accessible through various Catalyst platforms. However, it'll be another group created within the Catalyst circle and it may look overwhelming to that members, as it may considered an extra one.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I have read the proposal carefully and per my findings, it's very clear that this proposal identifies a problem within the challenge needing to be solved which's distribution = dispersion of funded proposals. The solution being proposed in this proposal clearly articulates how it will add value to the Cardano Community and the challenge to be precise. A hub, which would serve as a focal point of organizing all funded proposals to help collate their issues, hurdles, suggestions, collaboration, etc., is a phenomenal idea and well thought out into an impactful proposal. The key metrics in this proposal indirectly aligns with the challenge KPIs and it's well thought out as well. Looking at the scope of this proposal, I may not have enough enough words to explain what the may be but trust me, this proposal clearly is able to scale to address future challenge and the impact is going to be great! Good job guys and good luck!", "q0r": 5, "q1": "This proposal respects the budget cap emphasized in the challenge setting and I think that indicates clearly that the the proposing team took the time to read and understand the challenge setting before writing their idea into a proposal. This points out to me that the team clearly knows exactly what is expected to be delivered and hence their timeline. Well articulated with clear indication of what the community should expect at funding. The team, currently making use of the Fund 7 CC-Funding mechanism to scope the work is a plus for them. \nI can say on authority that the team behind this proposal is really solid! With individuals like Mercy A, Steve Lockart, Mie Tran, Emelia Sarfo, Stephen Whitenstall. Vanessa Cardui, and Ale Pestchanker and their expertise plus work already done in the community, I have no doubt on their ability to successfully implement. Their expertise clearly matches the stated roles and tasks needed to be executed.\nWith a total budget of $14.2K requested to deliver the MVH of the project, I think it's reasonable. The budget has been broken down carefully to demonstrate exactly how and what the money will be spent on and I just love the transparency in there.\nThe team does a good work by identifying and addressing possible challenges that could hinder the successful implementation if funded and they address it really well.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal is equipped with a clear roadmap mapped to time horizon for achievement and it means that the stress in auditing proposal has been taken into consideration. The stated metrics in this proposal are a good mechanism to help the community in following the progress of this project  as they are well thought out.\nWith a clear understandable description of the targeted problem and clear understandable solution explained in this proposal, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is an incredible project that seeks to organize funded proposers in the ecosystem into one large community hub to be able to connect, share information, answer FAQ questions, leave feedback and discuss issues. The team has an array of experience and because most of them are proposers from previous funds till now, they will be very capable to handle this project. The intent of this proposal is to sustain communications and to provide a documentation platform and a means of problem-sensing, for the funded proposer community making it a perfect fit for this challenge setting.", "q0r": 5, "q1": "The plan for executing this project is solid with a detailed budget that helps us to know the cost involve in bringing this project to life. The timeframe, budget, and overall program are clearly laid out and make a great deal of sense considering the context that the team is working in. The budget provides stipends for sub circle members, cost of Administrative work, documentation, and social media management. All these are provided in detail. The core team also presented in detail proof of their expertise and experience needed to implement this proposal.", "q1r": 5, "q2": "There is clarity in the description of the problem, the solution, and how the proposal is aligned with them. The roadmap is very well designed, there are milestones that make auditing the proposal easier. The KPIs and milestones are clear and measurable. The delivery dates are not specific however its time-based milestones allow for project commencement to be in tune with the outcome of funding.", "q2r": 4, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Implement a collaborative layer (a community hub) to welcome and support funded proposers and to coordinate community problem-sensing.", "experience": "The Funded Proposer Sub-Circle comprises :\n\nMercy A, Alex Pestchanker, Steve Lockhart, Emelia Sarfo, Mie Tran, Stephen Whitenstall & Vanessa Cardui\n\nSee details of team members below."}