{"id": 398359, "author": "nvhieu", "title": "Cardano Coffee lounge in Vietnam", "url": "https://cardano.ideascale.com/a/dtd/398359-48088", "category": 26439, "amount": 24800, "description": "Need to diversify learning methods and exchange knowledge with experienced devs and Cardanian in Vietnam", "f6_no_assessments": 12, "f6_rating": 4.527777777777777, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal address problems clearly. Periodic activity with programmer only attendee is very good, since Cardano programming language is not very popular. This will help cardano ecosystem to create more DAPP. This proposal is scalable by having advanced courses.", "q0r": 4, "q1": "This proposal clearly stated timeline. The budget is very detailed with hourly working. However the proposer takes too much time to search for a coffee shop for meet up, my suggestion is to have a deal with some coffee shop to minimize of working only for searching a coffee shop. The proposer team really have a good experience in Cardano ecosystem and as well own a SPO. This proposal success is mainly in the team member, they have to be people well known in the Cardano Community to have this proposal gains success.", "q1r": 4, "q2": "This proposal goals is very clear, the proposer make targets realisticly with how many attendees and CA on boards to Cardano. This proposal is mainly offline meetings and the proposer clearly stated how to proof those meetings. The proposer also have a website, social media, and telegram. ", "q2r": 4, "assessor": "z_assessor_1432", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "In Vietnam, there have been many crypto-related scams that have lost the trust of participants, so it is proposed to provide solutions to increase trust and create a solid connection in the community. The goal of the proposal is to create Coffee-Cardano community centers in major cities such as Hanoi, Ho Chi Minh City, and Da Nang to organize periodic activities with specific content for those who want to learn. on blockchain and the Cardano platform. It is a very creative proposal to cooperate with existing local coffee shops to sign a long-term recurring conference contract with them instead of setting up and operating a coffee shop by yourself, this will help reduce costs, ease to choose a convenient location to help many Cardano enthusiasts will be able to attend and easily replicate the model. In addition, seminars will be streamed live for both online and offline audiences to attend, which will provide attendees with a more enjoyable learning experience, thereby engaging the community co-participating, raising awareness of Cardano among attendees, encouraging them to participate in various catalytic so that Cardano adoption will be higher and add value to the ecosystem. The proposal is described in a concise, clear way and addresses the challenge. ", "q0r": 5, "q1": "The team is knowledgeable about blockchain technology, has experience in the Cardano ecosystem, and has a proposal to be funded in previous funds, information about their relevant skills and experience can be easily found in the links provided; they are the right people for this challenge. The proposal provides a detailed plan, clearly describing the work to be done and the results to be achieved for 6 months. The budget is provided in detail, covers all the expenses required to complete the challenge, and is properly allocated. I appreciate the feasibility of this proposal. ", "q1r": 5, "q2": "KPIs are clearly described with quantitative indicators for each goal in each month. Problems and solutions are also presented in an easy-to-understand manner. The implementation roadmap is divided into 2 phases including many specific works which also make this proposal easily testable. In addition, the proposal also provides 6 specific quantified indicators of project success, which makes it easier for the community to grasp the success of the model. I rate 5 on Auditability.", "q2r": 5, "assessor": "z_assessor_1457", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The project will provide an active communication channel for Cardano Vietnam, as far as I know, the Cardano VN community is mostly on telegram, facebook platforms... I also recommend that you connect with admins in many channels communication, so the offline session will be more successful, the topic and quality of the meeting will be better. The conference should also not reduce the water price, both creating a cost burden and the attendees are also less interested in the meeting, they attend with a superficial spirit, do not actively absorb, the effectiveness will be reduced. This is simply human psychology. Just such small issues, I'm happy to give 4", "q0r": 4, "q1": "To maintain this project for a long time, the team will have to make a lot of sacrifices, because you have to move constantly, interrupt your daily life, the community appreciates your contributions, but the reality is: the problem How will this be handled? The budget section also doesn't see you listing moving costs. I don't know if the project can be developed in the long term, when funding is a burden. Let's find a solution together. ", "q1r": 3, "q2": "The audit options are easy to quantify, the community can watch on the media channels that the project provides, I appreciate this. I really hope the project is successful and can be maintained for a long time, for a growing and civilized Cardano community. ", "q2r": 4, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This Proposal came up with the idea of creating a coffee-cardano community in some big cities such as Hanoi, Ho Chi Minh City, etc. by holding periodic meetings at suitable cafes in the area.\nIn Vietnam, coffee shops are very popular places to meet and exchange information. When holding periodic meetings at the cafe, everyone will know about blockchain, cardano... in a close and friendly space. People will easily access, exchange and share knowledge, so the number of participants will easily increase. Besides, when held at a cafe, it is easy to attract the curiosity of customers at the shop, who does not know blockchain, cardano through images of Cardano, Catalyst.\nAs such, the goal of this proposal is in line with the challenge's goal of encouraging the local community to promote Cardano adoption and awareness, growing the Cardano ecosystem.\nIf this project is successful, the model can be expanded to some other big cities in Vietnam such as Da Nang, Nha Trang, Vung Tau... This contributes to the expansion of the Cardano platform.\nThe project presented 2 risks about the Covid -19 pandemic and the legality of local event organization, including the full solution. But I have some personal opinions as follows: Proposal is calculating, estimating the number of attendees of a meeting about less than 20 people. If the number of attendees is 50 or more, it will be more difficult to find the right cafe. Therefore, if the project is approved, the proposed team should choose a suitable place to sign the contract.\nIn addition, if the epidemic becomes more serious, the gathering of people at the cafe will be banned or the number of participants will be restricted, so the project will be interrupted. The proposed team should anticipate coming up with a suitable solution.\n", "q0r": 5, "q1": "This proposal has a clear roadmap:\nPhase 1 is a basic course and standardization: after 1 month will complete basic level training, sign a contract with a coffee to run a weekly event in at least 6 months term, complete areas of page design decoration, banners, standee, flyers. After 2 months, complete the advanced training course, conduct 3, 4 offline sharing sessions at Cardano Coffee lounge, invite more blockchain experts to participate and present key topics, deploy sharing sessions weekly basic and advanced with predefined schedule, weekly meeting.\nPhase 2 is to scale up: After 3 months, replicating the model in Ho Chi Minh City, holding weekly meetings in both areas.\nThe above route is reasonable, easy to implement successfully.\nThe total cost for the project is $24,800, of which the cost of designing and producing banners, standees, flyers for Catalyst, Plutus, Haskell for both Hanoi and Ho Chi Minh City, displayed on LCD screens at Coffeeshop in the events: $1,000, budget provision for discounts on coffee orders (from the audience): $1,500, event marketing and media: $1,800.\nThe rest $20,500 for 410 hours of labor, unit price is 50 USD/hour for the following jobs: design and create a basic course on basic Blockchain, catalysts, instructions for creating Daedalus and Yoroi wallets; searching and choosing a suitable coffee shop, labor costs to design and create advanced courses, speaker costs, recording, editing and uploading videos to youtube, project management… The above expenses on average 50 USD/hour, this level is reasonable. However, different jobs with the same unit price of 50 USD/hour are not suitable. Proposing the team to recalculate the detailed unit price to suit each type of work.\n        \tThe project implementation staff consists of 5 people who are qualified, knowledgeable and experienced in blockchain, Cardano, interpreter, design...so suitable for the project's requirements. The community can find out information about personnel easily via Linkedin. This information is reliable. Therefore, the project can be implemented successfully.\n", "q1r": 5, "q2": "The project has provided indicators to measure the progress and development of the project monthly, from the first to the sixth month. In the first month, the location of the first meeting cafe was announced on the website cardano2vn.io, completed telegram channels, documents for the basic training program (slides), from the second month there are specific numbers such as the number of attendees, the number of offline meetings…In the sixth month, there were 10 additional proposals to submit to Catalyst; 30 CA onboards. The project also summarizes the results of the whole project such as 20 meetings in Hanoi, 20 meetings in Ho Chi Minh City, 500 attendees, 10 proposers submit to Catalyst, 30 CA onboards, 100 new Cardano member onboards.\nThe Community are easy to check these metrics. In addition, the above metrics match the key metrics of the challenge: How many new hubs will be launched in 2022? How many new Cardano users were introduced?\n", "q2r": 5, "assessor": "z_assessor_1632", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I like the idea of the proposal, which aims to bring knowledge to the community and strengthen the connection between members. These meetups and seminars organized by Cardano  members play an essential role in increasing awareness of Cardano in particular and blockchain in general to attendees. Training sections with expertise and talkshows with KOL gonna bring great fundamental knowledge for attendees.", "q0r": 5, "q1": "The proposers provide a detailed timeline for what activities will be executed each month, as well as money usage. \n\nHowever, the team should provides more information about marketing strategy to attract the audience. Moreover, team should set out more risks that might occur and how to face with them. For example, what if the audience decrease after 2 months and they prefer online meeting, that could lead to redundancy in renting cost. What is the purpose of creating 2 sites instead of 1? ", "q1r": 4, "q2": "Proposer has provided detailed plan on how to measure the progress. There are some metrics to keep track that I think should be considered:\n- Rate of attendees increased through each meetups\n- Comments and feedbacks about the contents\n- Number of downloaded slides (if possible)\n- Number of recording views\n- Number of speakers / KOLs join", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Currently have classes in the cryptocurrency market in Viet Nam quite a lot, high tuition fees and it is unlikely that they know the knowledge or have been well trained or not. Sometimes I learn where money is lost and doesn't work. I went through a lot of courses and spent quite a lot of money, time, and effort. But the results still didn't get the way I want.\nThere are quite a lot of places to teach but the nature of fool people, scam investors... The above individuals have deteriorated the image of cryptocurrencies a lot, causing the news to spread falsely and affecting very badly when hearing about cryptocurrencies. Therefore, it is necessary to have a place that brings together individuals who have a value of the cryptocurrency market as well as a real legitimate belief in this new industry in Viet Nam. A place called a reliable infusion. A club where everyone can have answered correctly, appropriately, and reliably. Coffee ADA Channel solves the above problem. \nSo that I think  this proposal will 100% effectively solve the challenge.", "q0r": 5, "q1": "In the last 2 years, Corona has made us have to stay at home quite a lot. People always want to go out and communicate freely. The information on the internet about cryptocurrency knowledge is very diverse and varied, complete...But it is true that meeting and interacting face to face fully and objectively assesses a person's problem. Therefore, if the is a place (here is meet at the coffee every week/6 months). is extremely suitable and effective.\nFirstly, Vietnamese culture weekend coffee, a funny exchange, share eye contact. The coffee shop has a spacious relaxing space that makes participants free from pressure. Not over the luxury creates a sense of trust close to the top. There are also a lot of offline classes that take place in this form and are quite effective. Participants only have to pay for soft drinks. Discuss and solve the problem together in a comfortable way.\nSecondly, this team as well as experience as stated in the project will create trust. Everyone has clear and fully professional background on LinkedIn, has a support team working properly, professionally. Therefore, it is likely that the first-time participant will continue to attend the next time until the end of the course.\nThirdly, the cryptocurrency market is currently a new trend that dynamic young people want to assert themselves. many young people in Viet Nam have just become rich in this market. So that the information is quite fast, a place that can exchange reliable direct learning is an opportunity not to be missed.\nI think 80% of the project will be successful.", "q1r": 4, "q2": "The information displayed is quite detailed, however additional capital is needed for costs incurred. Currently, prices are escalating and inflation is also high. It is necessary to increase by 5-10% compared to the scheme to be safe. The cost of moving between places and regions currently increases by at least 10-20%.\nIn terms of auditing, having costs will not be a big problem. In addition, the human factors in the team must be also quite confident. \nI think the project will success rate is 80%.", "q2r": 4, "assessor": "z_assessor_1720", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is a good idea, it helps to raise awareness about Cardano among the attendees at each reunion, encouraging them to participate in a variety of catalytic roles (proposer, CA, vCA, referrer and voter) for higher Cardano adoption. I totally agree this proposal will effectively solve the challenge.", "q0r": 5, "q1": "The proposer team consists of 5 members, they are active members of Catalyst, have experience in the blockchain field, especially Cardano. They provided links that prove their experience. So they fit the proposal. The proposer provides a 6-month project implementation roadmap that will be held directly in Ha Noi and Ho Chi Minh City, the two largest cities of Vietnam. The total requested funding is $24,800 distributed in clear categories down to the working hours. Such a cost is very reasonable. The proposal also considered possible risks and had a contingency plan to deal with it. In summary I completely agree this proposal will be successfully implemented.", "q1r": 5, "q2": "The proposal provides a 6-month implementation roadmap with clear timelines. KPI metrics to measure the success of the project is presented in detail with the number of offline meetings, the number of attendees, the number of participants submitting the project and the number of CAs participating in the catalyst. The milestones and figures given are enough information to evaluate the progress of the project by month and the overall plan.", "q2r": 5, "assessor": "z_assessor_1820", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I find this proposal to have a very good marketing strategy and create credibility with people interested in Cardano in Vietnam. Because in Vietnam, people tend to go to cafes to work and entertain a lot, this will be a place to help people know Cardano more. Proposing to choose the main cities of Hanoi, Ho Chi Minh City, and Da Nang is also very wise and reasonable because these are the three largest and most developed cities in Vietnam today, where the population is concentrated. . Therefore, if this project is implemented, I think the group's proposal will be easy to implement because in Vietnam, all cafes have been restored to normal operations.", "q0r": 5, "q1": "Proposing a very detailed plan. The team calculated the estimated cost in great detail. Group members are listed with full information with access link. I agree with the group's plan when dividing the work plan into clear stages, how to organize the project implementation. The team can use social networking sites to announce information about Cardano before preparing the event to increase the number of participants. The group's proposal is good, highly feasible.", "q1r": 5, "q2": "In my opinion, the analysis and progress measures of the proposal are fine, there are specific KPIs to be achieved. In addition, there should be more measures to increase accessibility to people, for example, through surveys in Vietnam. I think the survey results will contribute a useful part to the project's organizational activities to improve efficiency. At the same time, strategic planning to have a long-term project for long-term development in the future.", "q2r": 4, "assessor": "z_assessor_1844", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal aims to widen the CA in Vietnam by operating Cardano Coffee lounges, gathering people with the same idea to share and widen Cardano brand in Vietnam. The target subject to attend the proposal is CA and people interested in assessment aspect. By gathering CAs, the information from Cardano is shared widely and exactly, therefore consolidating the Cardano brand. The proposal is firstly implemented in some big cities with the limited numbers for trial. Then, if the proposal is successful, the Cardano coffee lounge model can be operated not only in Hanoi, HCM, Da Nang but also in many other cities of Vietnam. In result, the Cardano brand and value is known widely, more and more members attend the Cardano team.", "q0r": 5, "q1": "Firstly, the proposal identifies step by step target in 6 months with estimated cost, expected number of people attending the lounge, place to organize the event in each month. The budget is divided into 6 months with particularly cost. The cost is estimated basing on the items to implement. Therefore, the cost could be logical to consider.\nSecondly, the organizers know the target subjects to invite to the team and how to connect with them. They use social network to connect with users broadly, organizing the meeting both live and indirectly, filming the event to broadcast on popular social networks.\nHowever, it is not mentioned clearly the risk and challenges it may face out, the solution to solve when the organizers meet these problems. ", "q1r": 4, "q2": "The proposal has detailed schedule and is expected to complete after 6 months. The problem is raised clearly (how to enhance the CA community in Vietnam and broaden the CA network). The solving method is easy to understand (organizing in coffee lounges, common places many people attend to easy organize the event and also showing the Cardano brand to many other people, the event is organized both live and directly). The proposal also gives the detail data, KPI to evaluate the success of each stage and the whole trial schedule.", "q2r": 5, "assessor": "z_assessor_1870", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has one of the greatest ideas needed to solve problems of onboarding new members to Cardano. The idea of partnering with coffee shops to create Cafee-Cardano Community hubs  in big cities like Hanoi, Ho Minh City, etc., is phenomenal. If anybody could get a discount on their coffee and get free education, it's a great impact! This proposal addresses the challenge as the team plan to make use of existing coffee shops to create the hubs instead of building new ones and this totally cut down the cost as requested in the challenge setting. Also, through this initiative, it is indicated clearly that this project would deliver information to people who would not otherwise have the access.\nI strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "This proposal is well written to provide all the necessary information provided to comment on whether or not it can successfully be implemented. This proposal has clear roadmap mapped to key deliverables which verifies that indeed the team is aware of what they want to implement and also how to implement it. \nThe implementation team described in the proposal depicts clearly that the team has the relevant and required experience needed to successfully implement this project if funded. After checking all the relevant links provided in this proposal, I realized and can confirm that all links are valid and efficient. \nThe budget of this proposal, being $24.8K, indicates that the team has taken into consideration the budget cap placed in the challenge setting. This proposals' budget is well broken down and thus reasonable to achieve the set goals of this proposal.\nI strongly agree that it is highly likely that this proposal will be implemented successfully with regards to the information provided in the proposal.", "q1r": 5, "q2": "It is really clear to the community what the main and mini expectations of this proposal are and thanks to the well written roadmap and KPIs of this proposal. They perfectly aligns with the KPIs of the challenge and would clearly make the work of auditors easy.\nI strongly agree that this proposal provides sufficient for the community to be able to audit the progress of this project if funded.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Anything coffee is well attended irrespective of the kind of event. With this the proposal is a progressive approach of meeting more and information needs of different people on the cardano ecosystem in two ways - Virtual and in-person. The solution of the proposal is to reach more members to learn on the ideals of blockchain and its associated opportunities. This is aligned to the challenge", "q0r": 4, "q1": "The team is familiar with the ADA ecosystem and some of the team members have tech knowledge to execute the project. The plans to execute the project is well detailed with numbers expected to reach at each stage. The schedules are look tight and could they extend the dates to allow for the team to organize themselves accordingly to deliver on the task. \nThe budget is also detailed but looks to many things to do to achieve the results. For example, 10 meetups offline in a month in 2 months would not be an easy task. ", "q1r": 4, "q2": "The details for evaluation is aligned to the challenge. The measurable deliverables are consistent with activities and the number of reach and value, expected to be created to add up to the cardano ecosystem  are spelt out. This makes more easier to measure success for the project.\n\nIf this proposal is funded, a sustainability roadmap should be looked so that this project does not become an event but could continue grow in value. \nA monthly progress report of each event/month should also be considered to also make then evaluation easier.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The idea is great. Although it doesn’t really talk about establishing a hub, it will end up achieving the goals of a hub. Having such meetings at a coffee shop have the potential of getting the attention of the people who come around to take coffee. By so doing the message of cardano will spread and give more ROI to cardano. The proposal has clearly spelt it KPL which confirms with the challenge.", "q0r": 5, "q1": "The proposer creates a feasible path by outlining the team and their various qualifications and appropriate links for verification. Also the budget is fine only that I am of the view that the budget for the designing and creating the course is quite high. The motivational package and marketing should take some more money to bring in more people. One great thing about this proposal is the beauty in the time lines provided. The challenges are well stated but the challenge or risk I can for see is a likely rejection by the coffee shops. How do you handle that.", "q1r": 5, "q2": "The proposal has outlined a verifiable pathway of auditing by outlining a clear timeline of activities and milestone to be achieved. A good metrics for measuring success mentioned categorically. My only concern is that the budget for subsiding coffee and advertising look small. I wonder if it can do the job. The information provided depicts a good understanding of the problem and has also provided a great solution.", "q2r": 4, "assessor": "z_assessor_728", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Host weekly coffee meetings to exchange information about Catalyst, Programming on Cardano in a close and friendly environment.", "experience": "We are full-stack developers, funded proposers, SPOs, Eastern Townhall moderators, Senior software engineers, blockchain tech-savvies"}