{"id": 398592, "author": "otaviolima", "title": "Cardano Kids Educational ComicBook", "url": "https://cardano.ideascale.com/a/dtd/398592-48088", "category": 26439, "amount": 34750, "description": "Children need to learn and be nurtured in different ways, so how do you prepare them for the decentralized, blockchain and crypto future?", "f6_no_assessments": 10, "f6_rating": 3.8999999999999995, "videos": [], "media": [], "f6_assessments": [{"id": 8730, "q0": "Partially, this proposal addresses the challenge. The idea of using kiddie drawings to create magazines with contents focusing on Cardano is indeed a project that I see would have great impact on introducing kids to the ecosystem at their early stage and also satisfying the part of the challenge where information could be brought to those who may otherwise not have access. Kids are genius when they understand exactly how things are done and thus I want to commend this proposal for thinking about the next generation already. However, I think the proposer should have considered creating an MVH, either online/offline to onboard kids who are exposed to these magazines. By so doing, this proposal would've addressed the challenge fully and not partial.\nGood luck!", "q0r": 4, "q1": "The team behind this proposal looks solid but unfortunately, it looks like none of them has the expertise in drawing according to the proposal. No information was also shared to communicate as to whether they have hired or are going to hire for that particular role. From the proposal, the main deliverable centers around artwork so therefore I'm wondering a little about the feasibility of this proposal since no information was provided on that in the team experience yet the team managed to have an artwork as showcasing their project title as an attachment. \nAlso, at 7 month post-funding, one of the deliverables is a website which's great. However, I think the team should have at least indicate in either the beginning or middle of the roadmap the commencement of the website build just to inform the community that a certain timeline is being allocated to website building.\nThe budget, I think is a good one to help implement the project successfully even though the team could not have it under 5% of the total challenge budget as indicated in the challenge setting. It would have been great if the proposing team could have respected that line or perhaps state the reason why they had to request more than the threshold.\nWith all these findings, I am quite skeptical about the team's full capacity to successfully implement this project even though it's a great idea!", "q1r": 3, "q2": "The KPIs and metrics provided in this proposal defines clearly what the community can expect from the project during implementation stage. However, with the metrics, it would've been extremely great if the proposer could quantitatively give estimates of  number of printed magazines they intend to share and as well number of schools they intend to visit. This would help the community and auditors know that at least X number of magazines are expected to be delivered to X schools at 8 month post-funding as indicated in the roadmap.\nHowever, I agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_69", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thank you very much for your comments, they were great points we raised and we are analyzing to make the proposal more powerful. \nWe really believe in the idea and we really think we managed to execute it, as we are passionate about what we do, we know the blockchain and cryptocurrency environment and we have a fantastic team. \nIf possible, we would like to have your support in approving the proposal, and we will take Cardano to our children all over the world."}, {"id": 569, "q0": "The proposal does address a problem and a good solution. However im not confident in the challenge addressing part. The addressing on the challenge section seemed to be aimed at a second stage of the project \"In the future we hope to create an \"ADAKIDS\" token created on the Cardano blockchain.\" The solution gave can address the challenge (local schools) but the answer in the challenge address part creates confusion. The proposal would benefit for a clear addressing of the challenge for the magazine since that´s the solution, for now... not the platform and token.  \nFor future reference, I would rewrite the proposal addressing the school deliver part of the plan, since that´s the part that addresses the challenge. I would go into more detail on how the deliver to schools and kids will be done. Maybe not that much on the actual writing and production.\n", "q0r": 3, "q1": "The team clearly has experience and knows what its doing. (With shown evidence) Its timeline is reasonable and budget seem well planed and was given a clear breakdown of the costs. It would be nice to have more work on the journalist in attachments, just a small thing could do :)", "q1r": 5, "q2": "I would give more detail on expectations for KPIs or Outcome KPIs. Which number of views are you expecting, how many deliveries are you planning on doing? It could be 1 or maybe 1000. Where are you delivering the magazines, Brazil, Portugal, US? How many schools are you going to? The proposal would HIGHLY benefit on giving this information. It will make the \"local part\" of the proposal auditable, if not you could print 2 copies and go to 2 schools and thats it, same on the digital KPIs.", "q2r": 3, "assessor": "z_assessor_1190", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Great feedback and comments. The focus is really on the magazine and on the educational side, we have this as a purpose, to bring Cardano to more people starting with children. We will seek to deliver more details on the auditability part, with more accurate, direct and objective information, which seek to lead to success in the implementation of the proposal. We count on you supporting this proposal."}, {"id": 1328, "q0": "The team has very interesting ideas to educate children on Cardano and cryptocurrencies through comic books. The team clearly articulates how they will deliver the project and what media platform they will utilize. However, I think it's better to give a more specific age target so that the team can focus and the works are not too board. Also if the team wants to create the ‘ADAKIDS’ token in the future they better explain why it helps them achieve their goals, especially regarding current comic books which are not clearly stated in the proposal.", "q0r": 4, "q1": "The proposal gave comprehensive information that needs to be disclosed: Proposers background, skills, experience, and a LinkedIn Profile. A realistic timetable along with points that need to be done at each step. Also, the team give a specific breakdown of how they will use the budget.", "q1r": 5, "q2": "The proposal state they measure success with the numbers of hits for various media outlets that they will use. However, none of them have a specific number and thus cannot be measured. It will be much better if each media outlet and parent/kids have a measurable target, for example, 200 website page views each day, 20 schools visited, more than 80% of parents like the comic books (from your survey), or user signup for newsletter grows 30% each month.", "q2r": 3, "assessor": "z_assessor_1342", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "We appreciate the comments and ratings on the comic book project. Our focus really is integral to the development of the comic book to aid understanding for children. We really appreciate your comments related to auditability, we will try to bring more practical, clear and objective data, with this we will be sure of the success of the project. It would be wonderful for you to support the approval of our project."}, {"id": 2617, "q0": "The project aims to educate children about blockchain, which is very encouraging. The impact will be strong and far-reaching. Can you tell the community what ages the project is aimed at? And I think there's also another challenge, which is censorship, because this is a children's book, and you have to convince at least one publisher to get it printed in large numbers, then the legitimacy will convince the child's parents or the school where you want to recommend the book. These are just a few of my suggestions, I'm happy to support the project.", "q0r": 4, "q1": "You must have misplaced the content of the 2 titles “Please provide a detailed budget breakdown” & “Please provide details of your team members required to complete the project”, don't be confused when publishing the book, I'm just joking. Besides the 8-month plan is appropriate. The project team is capable, suitable for project development, I appreciate this. ", "q1r": 4, "q2": "The criteria set out by the project are the results after the project is completed, the community needs to monitor the development of the project, I can suggest a few things as follows: update the titles, the results of each month, the number of partners that you contact to publish books, to print books, to introduce...", "q2r": 3, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "We were fascinated by your observations and comments on our proposal. We really need to make it clear to the audience that it is children up to 14 years old, to spark their interest in cryptocurrencies and Cardano. \nWe will update the issue of auditability, bringing practical and objective information, including making it public on a website that displays the information with transparency for the community. We would like to count on your support in approving this proposal :)"}, {"id": 2886, "q0": "We are all aware that technological advancements have resulted in the emergence of a number of  concepts such as blockchain, crypto, web 3, metaverse and different platforms such as Cardano cause many difficulties for the community to access. and understand. It is due to language and technical barriers. Simplifying complex concepts to easy-to-understand comic books make it more accessible to the community. Stories integrated with knowledge is a useful tool to help children and beginners understand the basic knowledge. It makes blockchain much more closer to everyone. It is beneficial not only for children but also all the community. \nSo this proposal effectively addresses the challenge.", "q0r": 5, "q1": "As a father of 3 children, the proposer clearly understand how his own children could understand the complex contents and have tried to do that. He has presented a very clear roadmap with achievable goals. The cost breakdown covers everything from creating content, creating finished products to advertising. It is also linked with the plan. The project also have a quite strong team. By reading the proposal, the community could clearly understand who will responsible for each task. They are all have relevant experience to implement this project. There are Linked profiles for each team member. \nThe proposal have awareness of the challenge to explain the complex contents of blockchain to simple one. I think there is also difficult for the artists to understand the ideas and convert them into drawing.  It's tough to explain intricate concepts with words; it's even more difficult to do it using visuals.\nIn conclusion, I strongly agree that given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has defined clear KPIs. They are all easy to measure and check since they are all in number, such as number of view, like, share. However, they should mention the way the community could check the progress when there is no website availabe. I suggess the team could update that information via there official communication tools such as Telegram, Twitter. In terms of success metrics, they should also indicate clear number. Such as target for number of interaction via social network is 1000/month. I give this proposal four stars since there is room for improvement. ", "q2r": 4, "assessor": "z_assessor_1588", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "We greatly appreciate your comments and feedback, we are very excited about what we can deliver to children and further evolve the Cardano ecosystem. \nWe're passionate about what we're building and we'd really appreciate it if you'd support us in approving the project :)"}, {"id": 5437, "q0": "To be frank, this is the best project I've read this time. We all know that the development of technology as well as the emergence of a series of concepts such as blockchain, crypto, coin, metaverse and different platforms such as Cardano cause many difficulties for the community to access. and understand it. It is due to language and technical barriers.\nSimplifying complex concepts to make it more accessible to the community, I think, is important not only for children but also young people who are not yet qualified to understand the new knowledge needed. needed in the new technology era.\nTherefore, a comic book with easy-to-understand drawings, characters with their own personality, and a story integrated with knowledge is really a useful tool to help children and beginners understand the basic knowledge.\nThe idea of ​​​​\"Aaa kid\" with applications in educational games and educational content is also quite meaningful. It makes blockchain much more intimate, real, and in-depth.\nMoreover, parents may be concerned about the problem that their children are online, using phones and computers too much, but they are very reassured when they see their children attentively reading books, comics, especially a comic book. which has great educational significance.\n\nI think what's more interesting is that they can incorporate some technology, for example, kids can use their phones to watch moving characters or live sounds from paintings. I'm sure they'll love it too\n\n\nWhat I'm worried about in this project is just that the content creators can understand blockchain knowledge, metarverse or knowledge from Cardano, but can artists - non-experts be able to convey it? Saying complicated things with words is difficult, with pictures is even more difficult.", "q0r": 4, "q1": "Although I was a little worried about the simplicity of his words, what reassured me most was the expertise and passion of the proponent. I see his passion and technology knowledge on his blog. And more importantly, he's also a father, understanding his own children is the way to help him understand how to make complicated content easier for them? Just imagine, he brought the content and pictures to his children, they understood, got excited about it, that was success! If you still don't understand, you have to fix it, you have to adjust it further.\nAnother thing that makes me quite confident in this project is that I see the cost breakdown. It almost covers everything from creating content, creating finished products to advertising. There are many projects that ignore the Advertising element, while it is very important if your goal is to get more people to know about your project and product.\nAlong with that division, I have a LinkedIn of associates: a content creator, an information technology engineer, a Marketers, ... and they all have a certain reputation for their expertise. This proves that the Leader has a pretty good mindset in terms of personnel organization.\nOne small reason I'm worried is that there's no mention of how the book delivery will happen? How do they use bookstore channels online, offline, and at events?\nSince I have worked in the publishing industry for a long time, I understand that in order for books to reach many people, the distribution network must be widespread. If you only play online, there are many limitations.", "q1r": 5, "q2": "The KPI numbers that the proponent gives are quite intuitive and specific. The number of online interactions, the number of people ordering the printout, the number of reviews, etc. That is, there are both physical measurements and online measurements, also quantity and quality,\nI quite like the calculation by the fields to visit and present. That's how we directly measure the impact and promote more of the image, not just the book.\nOrganizing more fun events mixed with knowledge such as book launches and measuring the number of people attending the event is also a good way.", "q2r": 5, "assessor": "z_assessor_1991", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "We are really excited and amazed by your comments and feedback. \nWe will adjust to clarify the distribution of magazines at events, fairs, schools, parks and not only in the online/digital environment. \nWe really want to approve this project and we count on you to help us with this. Thank you for the words!!"}, {"id": 7336, "q0": "I don't think this proposal fits the challenge, nor am I sure about how this idea could be put into practice and how it would affect the target audience. The idea is to bring to children and teenagers knowledge relevant to the Cardano ecosystem, instructing and educating them about what blockchain, cryptocurrencies, Cardano, Bitcoin and so on are. I'm really not sure if this is a good idea, in my view it might be interesting to produce youth content about it, focusing on those teenagers who already have an interest and a certain inclination towards business and technology. As a kind of playful magazine but that also introduces them to these subjects in a safe way. But for kids, I don't see much need to approach blockchain at this stage of life, honestly. I think at this stage, we're still understanding what money is, let alone something complex like a decentralized network of transactions. I think it is healthy to introduce financial education as early as possible, in a way that is compatible with the understanding of the target audience. For example, for very young children, the concept of value and exchange is taught at first, for example (let's go with a very playful example) a house is worth 3 cars, and so on. But how could we talk about something as advanced as Cardano's knowledge in fun, simple and accessible language? In fact, why should we do that? I would like the proponent to better argue in defense of their idea, both as to why it is necessary and impactful. If the magazine were focused on young people between the ages of 15 and 18, I think things would be different, because this is an age when they start to study computing, basics of programming, financial mathematics, and so on. So, in my perception, it's a more compatible audience with this introduction to blockchain. Another point is, I don't know if this proposal fits well with the objectives of the challenge, because in the hubs challenge we intend to create effective and simple ways to bring knowledge about Cardano to a specific group, respecting their cultural and linguistic characteristics. Until we have a very specific audience here, children and teenagers who speak English and Portuguese. However, it is not enough to be a single community, how many children speak English, they can be from the United States, Australia, United Kingdom, in short, culturally very different places! In the same way, in the case of Portuguese, we could be talking about a Brazilian, African, Portuguese-Portuguese audience, anyway... Unfortunately, I don't feel that this proposal aligns with what is sought here and I'm also a little unsure about its validity this idea, and, in my view, it is necessary for the author to argue better about it. \n", "q0r": 2, "q1": "The script is ok, we know what will happen over the months, but we don't have much detail about each of the activities mentioned. For example, it is said that, in the first two months, the script for the book would be written, the characters created, and everything would be validated. But how would the script creation process be done? Who would select how this story would be told? What topics would be addressed first? How would such technological concepts be described playfully? Who would be responsible for the script? The third month would be entirely dedicated to writing the chapters. I would like to understand how many there would be, who would write them, how long it would take for each and so on. Finally, details. We don't have many details on how this proposal would develop out of practice. I think the script is good for us to have an idea of ​​what happens, not for us to understand the details of how it all happens. Regarding the team, this part of the proposal, in my opinion, is perfect. We know exactly who we are dealing with: their names, linkedin profiles and we have a good description of their CVs, first it is said what area they work in and then it is explained what they have done professionally so far, at least in summary. I really felt confident in this team, as in addition to having explained their previous experiences very well, they made it possible for us to have proof of this by looking at their linkedin profiles. So I have no criticisms on that part of the proposal. Now finally, speaking of the budget: approximately 34 thousand dollars are requested to carry out this proposal, and this total amount is divided into smaller parts. However, each of these parts could have been better explained. The journalist will have a monthly salary of USD 1200, but why? What will his workday be like, how many hours per week will he commit to this project? In the same way that I ask in the case of the journalist, I would like to know more about how the work practice on the project will be for other professionals, the writer, the designer, etc. Look, I'm not saying that the amounts charged are unfair, however, in order to convey a more sense of need, it would be necessary for the proponent to better explain the degree of commitment each professional would have towards the production of this magazine. Therefore, my opinion on the feasibility of the project is as follows: the roadmap could be better detailed, as well as the budget; the description of the team members is excellent. \n", "q1r": 3, "q2": "The auditability suggested for the development process of this project is not sufficient. We only have numbers, which would serve to quantitatively understand the reach of the magazine produced: number of hits to the website, number of printed magazines, number of shares of the digital magazine (what would that be?). In this way, we even understand at what level the project is, however, it is not possible to understand if the small goals that were established were met. As it is a playful project, my suggestion is to have meetings, maybe monthly, but bimonthly would be a good size, where the project leader would demonstrate to the members of the Cardano community what stage the development is in, show the results obtained so far, such as drafts of the script, first illustrations, the balloons being inserted in the comics and so on. I think it is more interesting that these meetings are held in this case because the project is very visual, so the demonstration of the drafts is indispensable. I usually suggest that monthly reports be prepared and sent to the community in some of our media, such as discord and telegram, for example, but I don't think this is the best way for us to audit this project, specifically. In these meetings, it could also be said whether the professionals involved were able to follow the work routine they had planned, if they faced any difficulties and if so, which ones, and so on. Now talking about the final result, the success scenario, in my opinion the author of the proposal explores qualitative variables as well, in addition to numbers, such as the testimony of parents and children. But how would these testimonies be collected? I loved the idea, but I would like to know how this would be put into practice. Maybe school meetings? Maybe by video call? And how could every community be aware of the data collected? In addition to knowing the number of schools visited, it would be great if we knew how these visits were, the reception of the children, the teachers, how did all this really impact those involved? In my view, a slightly longer general meeting would be necessary for such information to be properly passed on to the Cardano community. In general, my opinion about auditability is that it is strong in some points but has to improve in others, it is stronger in the construction of a final scenario than in the progressive follow-up of parts. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 4, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Thank you very much for the comments, they were very thorough and necessary to help in the development of the proposal. We really believe that various concepts of digital currencies, blockchain and decentralization should be done very early for children, as they are already inserted in this context with digital games, applications, youtube and etc. \nWe will pay special attention to the details of the schedule, activities x technical hours of work and deliverables. \nThe auditability point needs to be improved to deliver greater transparency and help in monitoring the project with more objective, practical and real numbers. We count on your support in approving this proposal, your comments will be taken for an exhaustive discussion."}, {"id": 7721, "q0": "So this proposal is one step forward for a bigger projects. I like the proposer idea to steal a chance to educating children about CryptoEconomy, with the next generation will be more tech-ies, this comic book will encourage Gen-Z (or so Gen Alpha) to take take more deep dive about blockchain, crypto verse, etc.", "q0r": 5, "q1": "The proposer provides a good explanation of what exactly his project would be, and how it would happen. the roadmap is easily to understand. I have a little concern about pursuing the schools to present the project. Since the proposer has a team, why present this project to the school at the very end? I think it can be done in parallel, like in Month 5 before the comic book being colored. So after proposer got school list want to be partnered with, in Month 6 proposer can distribute to the schools.", "q1r": 4, "q2": "As this proposal still not have any website, I suggest proposer can create Google Docs with simple Feasibility Timeline for us to publicly audit your progress. The metrics and KPIs were well chosen and I believe they are good indicators for evaluating this proposal success.", "q2r": 4, "assessor": "z_assessor_639", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "We think your feedback is great and will be adopting some ideas to make it easier for the Cardano community to follow along. We are passionate about what we are building in the Cardano ecosystem. \nWe will have a website to support the transparency and dissemination of data, with news, photos and the possibility to download or read the magazine online. We would like to have your support in approving this proposal!"}, {"id": 8978, "q0": "This Proposal relates well with the objectives of the challenge setting of encouraging the delivery of information among people. The creation of awareness of the Cardano ecosystem through educational comic books for kids and teenagers to learn is awesome I might say. The authors of the proposal have also specified their target audience and how the proposal is going to benefit the Cardano blockchain.", "q0r": 5, "q1": "The team involved is certainly qualified to carry out the project well, looking at the brief history of their backgrounds and previous experiences, and also their LinkedIn profiles, where we can get to know each of them in more detail. The budget is on point, well-calculated and realistic with relevant details for a successful implementation of the proposal.", "q1r": 5, "q2": "This part of the proposal is comprehensive. There are in detail measurable KPIs that are needed to realize if the proposal will be able to achieve what it aims at. The proposal shows us how the community can assess the progress of the project. In all, I believe the auditability of this proposal is great.", "q2r": 5, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "It was fantastic to read your comments and get the highest rating. \nWe are really happy and excited to deliver this project for kids to learn more about cryptocurrencies, blockchain and Cardano. We would be even happier if we could count on your vote to approve the proposal."}, {"id": 10219, "q0": "This is a very interesting proposal. The proposer wants to write and publish comic books about Cardano/ blockchain for children and teenagers to read in two languages English & Portuguese. It’s also interesting that the team has the vision to build ADAKIDS token on the Cardano blockchain and this series of comic books is the start. However, I only rate 3 for its impact because of three reasons:\n(1) The proposal doesn’t specify the target audience & demographic where the team are going to focus. The age range of children should be determined exactly to prepare appropriate content. “Children and teenagers” are too general because the teenager is a subset of children. Moreover, the proposer wants to visit some schools to promote these comic books. I wonder where these schools are, and tried to look for them in the proposal but I couldn’t find one.\n(2) Before talking about how many digital magazines or printed ones has been published, we should ask an essential question: What will children contribute to Cardano after they read the comic books? – For me, to answer this question is to define the impact of this proposal. Supposed that comic books are very fun and children love them, I don’t see any further step to measure children’s engagement into Cardano. \n(3) Reading to the end of the proposal, the way the proposer listed down key metrics to success, again, makes me confused about who is the target audience of this proposal, children or parents/ teachers, or all of them? The purpose of this challenge is to scale up Cardano in those areas having potential users onboarding Cardano, I wonder if the schoolers and parents don’t approve these comic books for their children to read, then isn’t the target audience at the first place teachers/ parents?", "q0r": 3, "q1": "This proposal has a good team, each member would cover a role in the project independently. Yet, after reading the action plan, I’m confused about the role of journalist, writer and content editor because somehow they are overlapped. One more thing about human resources is that after I have checked LinkedIn of everyone, although the team has 3 roles of writing, only Gino Matos truly has some professional experience in writing but he specialises in journalism/ press release. In my opinion, writing fiction, especially for children is totally another thing from writing articles/newspapers. \nTimeline is clear and budget is requested reasonably. I still would like to see the budget be broken down even smaller, into how much dollars per hour for each role. Estimating salary by month is too general for me because I don’t know how many hours each person will work on this project in a month. \nI advise the proposer to discuss the risks and challenges of this proposal because approaching adults about blockchain/ crypto-currency is already difficult, here we are about to approach children. Some of my suggestions for the team: How could we approach schools and make teachers/ parents accept the project we are about to introduce to their children? What if children find comic books boring? What if children want to become users onboarded Cardano but their parents don’t approve?", "q1r": 3, "q2": "A roadmap with milestones is the best-written part of this proposal. Scope of work from months 1 to 8 is short but complete.\nKey metrics to success is unfortunately inadequate. The proposers leave all metrics/ KPI blank without any specific/ estimated numbers. I think it’s possible to set goals into numbers. For example, how to estimate the “number of deliveries of printed magazines”, we can set a goal because the team already have enough members, estimated salary for each person, the amount of time they can work for the project, then we can calculate in that 1,5 – 2 month – how many printed magazines can be written. A clear description of the targeted problem with actual figures is required in every fund of Catalyst. \nThe second point is about “what does success look like”, I think the proposer could write it better. Besides the number of interactions/ engagement online and physical, we can discuss further the metrics to get these “little users” onboarding/ learning/ contributing/ benefiting from Cardano. Here are some of my advice for better metrics:  \n- Number of places to answer children’s questions about Cardano if they get interested after reading comic books. \n- Metrics to run these hubs of students resiliently.\n- Number of external organisations to help these hubs stay connected (because there may have students from various schools)?\nAnd again, to have a good process, the proposer needs to relocate the targeted demographic as I said in the Impact. Good luck to the team!", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1, "reply": "Your comments and feedback were great and very well received by our team. \nWe really believe that we have a mission to bring knowledge, information and content in a different way to children, this new generation will be very important for the future of our planet. We will go deeper into the issue of execution, deadline, cost estimate x hours worked to deliver the best experience according to the cost of the project. \nWe are going to implement a better way to have the project auditability, bringing more objective and practical metrics for monitoring by the community, bringing more transparency and also security in the monitoring of project results. We would be happy to count on your support for the approval of the presented proposal. Thank you very much for your time."}], "solution": "Educational project with a comic book to bring Cardano ADA, blockchain, DeFI and cryptocurrencies to children and teenagers around the world", "experience": "I am father of 3 children, founder of CardanoFeed.com, the largest content portal related to Cardano coverage and I explain to all my children who are still children, the concepts of what cryptocurrencies, Bitcoin, Cardano are, in addition to applications and use of blockchain."}