{"id": 398647, "author": "otaviolima", "title": "Exhibit Largest Blockchain LATAM BR", "url": "https://cardano.ideascale.com/a/dtd/398647-48088", "category": 26439, "amount": 18755, "description": "Only a few Brazilian and LATAM companies know Cardano as a main Blockchain. Difficulty in adopting Cardano (ADA) in the real business world.", "f6_no_assessments": 5, "f6_rating": 3.866666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "I was really confused by this proposal. What's the point here? Help increase the size and reach of this event, called BITCONF? At what point would this be beneficial for the Cardano ecosystem? In this challenge, we seek to fund projects that help bring knowledge about the Cardano ecosystem to specific communities, seeking to respect and dialogue with their cultural and linguistic characteristics. In this case, the community would be Brazilians already adept in the cryptographic world. I agree that in a way this could be considered with the hub. However, it is very abstract what content would be covered in this event. According to the proponent, “BITCONF - Brazilian Conference on Bitcoin, Blockchain and Cryptocurrencies - is the largest and most traditional cryptocurrency event in Brazil”; in this edition of the event, the objective would be to promote a debate on free software. Perhaps this is where the Cardano community fits in. But what worries me is that these people seem to be much more familiar with and adept at bitcoin than they are Ada. This event, at least appears to be more focused on this cryptocurrency and this blockchain - which does not say about our ecosystem itself. Therefore, I think that this proposal very partially meets the objectives of the challenge, it is certainly aimed at a specific audience, which has its own characteristics and even a certain history with this initiative, but it is not clear how all this relates to Cardano . We need to popularize our blockchain, make it better known, encourage people to create digital wallets, participate in Catalyst, study more about our specific technologies, the ways we work and understand the principles that govern our community. And none of that is clear in the case of this proposal. Therefore, I suggest that the proponent revises explanation of the impact, as the way it is presented, I am not sure that this event will especially benefit Cardano - it seems to me more like something that will promote the propagation of the cryptographic world, of blockchain technology, of how decentralization can be used in many cases - but if it focuses exactly on our ecosystem. Therefore, I will give a neutral note, unfortunately, if the understanding had been firmer, my position would probably be different. \n", "q0r": 3, "q1": "From what I understand, the event would be organized in a month, and with that the proponent details which activities would be developed each week. In this way, the script presented is quite satisfactory, allowing a very solid visualization of the process. As in the case of the script, the part dedicated to the budget explanation is very detailed, of the approximately 38 thousand dollars requested, we understand very well how they would be spent. The total amount is divided into smaller parts like grant, organization, marketing and promotion and etc. Each of these parts has small topics by which we can understand more specifically what the larger divisions are about. However, my suggestion is that within these parts, it could still be stated what would be spent for each of these topics. Let's use the marketing and promotion part as an example: within this part there would be expenses related to: graphic material about Cardano, portfolios, catalyst, promotion and dynamism campaigns, etc”. How much would each of these things cost? How much would go to portfolios, and how much to promotion campaigns? I think that if small values ​​were assigned to each of these topics, surely the budget understanding would be perfect. Finally, let's talk about the team, this is without a doubt the best part of feasibility; We know the names of each professional involved, their linkedin profiles and a long résumé about all of them. This curriculum explains what their areas of expertise are and also some previous experiences, as well as how these people relate to the Cardano ecosystem. This gives me a lot of confidence, because, as I mentioned in Impact, in that part of the proposal I thought it was not so clear how this event would directly benefit the Cardano ecosystem, but seeing that the team is engaged with our blockchain, this concern of sure out I decreased. In other words, by the information that is passed on to us, it is convey a lot of credibility and trust in this team. Really, my only suggestion to make the project's feasibility even better is that the budget division be even better explained. Other than that, I think it's a very well presented proposal in terms of script and team, with the financing being explained in an ok way, but not perfect. \n", "q1r": 4, "q2": "I like the auditability of this proposal, the proponents explain very well what is expected for the progress and the final results of the project, but I think we still have aspects to improve here. Starting with analyzing the monitoring of the project's development, we know that this progress will be measured based on the number of event participants, gifts distributed, creation of portfolios and other indicators. However, in addition to these goals, I would like to know, for example, how we could follow the pre-production work of the event? We know that this will last for 1 month, and we know which tasks must be performed on a weekly basis. With this, it is enough for one of the team's participants to carry out this weekly inspection and gather general information on how everyone would be working, possible delays and difficulties, if the expected achievements for each period of time were achieved, etc. Due to the nature of the proposal, as it is the preparation of an event, I think it would be more practical that a small report (even small, maybe 1 page would be enough) could be prepared and made available to the Cardano community through some discord room focused on monitor projects financed in fund 8, for example. In this way, we would know not only if the goals were achieved, but also if the tasks necessary for this were performed in the most adequate way. Regarding the final scenario, I think we would need to do both a quantitative and qualitative analysis, it would be interesting for some entrepreneurs, participants of the event, to give feedback to the organizers, who would inform them if they decided to work with Cardano's blockchain, acquire Ada, invest in any of our Dapps projects and etc. It would also be interesting to carry out a survey with the general public that participated in the event, not just entrepreneurs or people already in the cryptographic field. Have laypeople come to understand better about blockchain and specifically about Cardano? I would really like the proponents to establish this contact between the public and the Cardano community, and of course, inform us if the KPIs outlined were achievements. I think that the format of presentation of such data would be according to the preference of the team, an office document could be prepared, a video call could be held... if there was such a call, it would be great for some event participants, in addition to team, make a special appearance. This could happen during town hall, for example. Anyway, I think the auditability is good, but it can improve in some points to make it perfect. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "We really appreciate your comments and ratings on our project. \nWe believe that Cardano has to be present at the largest Cryptocurrency fair in Brazil, after all we are one of the largest in the world, we have to always be present at these events. In addition, in addition to sponsoring the event, we will have a stand to promote Cardano, we will hold presentations, publicity, raffles, gifts and we will register many people to join our groups on social networks. \nWe will also be speakers on the main stage of the conference, which will give Cardano a lot of visibility. \nWe would like to count on your support in approving the proposal, we really want to hold this event in Brazil."}, {"q0": "This proposal aims to promote an event that will present concepts from the sphere of cryptocurrencies, blockchain and other technologies related to people who often do not know the benefits of this universe. We can thus see that the event is not aimed at specialists in the subject, but rather has a comprehensive idea, aimed at the Brazilian public. With this, we perceive the adequacy of the proposal to the metrics exposed in this challenge. Furthermore, with the success of the project, new people will be acquiring knowledge to enter Cardano's ecosystem, which generates a positive impact in the medium and long term. We also note that, given the expected number of participants for the event and its exhibition capacity, the requested budget of $18,755 seems appropriate, as we will address next.", "q0r": 5, "q1": "We can start the feasibility analysis taking into account a very favorable data for this project. It is not a first attempt or a pilot project that will still be validated, as we can see, there have been other editions of the event, so it is less complex to convince people to participate. But not so factors such as marketing or the search for sponsors were neglected, there is a good detail in the proposal about the actions that will be carried out with this purpose.\n\nIn fact, the general details of the actions to be taken are very detailed and describe well what needs to be done to successfully carry out the event. Even in terms of budget detail, we can see that expenses with organization, marketing and gifts are well distributed. We realized that the largest capital allocation ($9,000) goes to sponsorship, a notoriously critical factor in the success of the endeavor. As another factor that promotes confidence around the project's feasibility, we have a number indicating how many people have previously attended this event, with special emphasis on the more than 50,000 who attended the last two online editions of the event.\n\nThis whole project would be very interesting with what has been exposed so far, but it wouldn't make so much sense if it weren't for a clear parallel with Cardano. And we were able to perceive this connection with the Cardano ecosystem at different times, with invitations to follow on social networks, general explanations about Cardano and the presence of graphic materials about it. Regarding the professionals involved in the project, their experiences are very aggregating and their CVs were made available as an indication of their skills. In particular, we can also note that Otávio Lima and Marcus Vinicius have experience and previous contact, including with Cardano.", "q1r": 5, "q2": "Regarding the ways of observing the impact generated by the event, we found that quite reasonable ways of understanding this were chosen. We can highlight two indicators, the average number of explanations about Cardano that were made to business people, and the expected amount of hashtag tweets about the event. These two indicators were also accompanied by numerical targets that help to verify the result. It remains as an observation that for other parameters present in the proposal, numbers could also be chosen that would help in understanding the results of each action. As a suggestion of another factor indicative of engagement, it would be nice to try to follow the possible emergence of new stacking pools created by Brazilians after the event.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "We were very happy with the maximum score in our proposal. \nWe are very excited to have Cardano sponsor the Brazil cryptocurrency event. \nIt will be important to count on your support in choosing Cardano even further."}, {"q0": "The focus of the proposal is to exhibit at BITCONF - Brazilian Conference on Bitcoin, Blockchain and Cryptocurrencies, the largest crypto event in Brazil, to get people to know about Cardano as a main Blockchain and to adopt Cardano (ADA) in the real business world. Much as the proposal will deliver information about Cardano to blockchain and crypto enthusiasts, it does not really respond to the needs of the challenge. The focus of the challenge is to have a minimum viable hub around which a community can be built, attain resilience and self-reliance and be able to easily scale with minimal cost.  The idea is that the average person should be able to take part in the Cardano/Catalyst  community with their own cultural understanding. This is quite different from what the proposers intend to do which is more or less a one off event. To enhance impact, proposers could provide more information on the scalability of this idea and clarify how it positively impacts the Cardano ecosystem.", "q0r": 3, "q1": "The proposal needs a lot more information and clarification to facilitate an assessment of feasibility. For instance information on key activities proposers will undertake during the exhibition to engage participants is not provided. Also, how will information be presented to both exhibitors and participants? will there be presentations, pre-recorded videos, flyers and information packs etc. Such information is very relevant to the proposal. As a result of inadequate information, the link between the problem and how the proposed solution will address the problem is not clear. Also, in the detailed plan and timeline for the proposal, a number of activities are listed to be undertaken on a weekly basis but here too, there is little explanation to give a proper understanding. Based on the list of activities and budget, it appears the proposers rather intend to sponsor the BITCONF because they talk about contracting the sponsorship of BITCONF and signing of contracts with service providers. There are line items in the budget that also relate to coffee breaks, uniforms for event staff, payment of event organizers etc. Proposers generally need to clarify a couple of things, 1. Do they intend to participate in the conference as exhibitors or as conference sponsors 2. specific activities they intend to undertake within the context of the conference 3. link this clarification to the preparation of the budget. A lot more information will be helpful to ensure a better assessment of feasibility.", "q1r": 2, "q2": "The proposal provides a roadmap however, key tasks in the roadmap need to be clarified. The KPIs equally need some clarification and metrics to make them measurable. Proposers could therefore include measurable metrics for the following KPIs: Followers on Twitter, download wallets, gifts delivered to participants. Also, a process of communicating progress with the Cardano ecosystem needs to be incorporated in the proposal to enhance its auditability.", "q2r": 2, "assessor": "z_assessor_1437", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for the feedbacks and comments, we read carefully and go to the points covered. \nIn our proposal we will be sponsors of the event, we will have a Cardano stand inside the event to welcome people and present our ecosystem (including the layout is attached to the project) and we will also be speakers on the main stage of the event, that is, a very large and considerable within the event. \nI would like to count on your support in approving this proposal and also make a reassessment of your grades, they are well below the average we had. We strongly believe that we will be able to do a great project to promote Cardano in Brazil."}, {"q0": "This proposal aims to expose cardano at the BITCONF which is the biggest blockchains meetup in Brazil. While this can be a good idea and a good thing for the cardano ecosystem, the proposer failed to show exactly how they are going to do it. I recommend to the proposers to explain better what content they are going to provide on their stand. I don’t want to assume anything, and that’s why the proposers should provide more information so that we can truly measure the impact of this proposal. For that reason I give a 4 rating on impact, instead of 5.\n", "q0r": 4, "q1": "The proposers have done a good job explaining all the steps they need to follow to achieve the goals. I think that the proposers showed high confidence in the implementation of the proposal. They have a detailed breakdown of the budget which seems reasonable based on my intuition. For never having organized an event of this nature, I can’t judge the budget accuracy. That said, I recommend to the proposer to give more information on the lecture and the type of content they intend to deliver to the audience. Other than that, they have a 4 week plan to finalize the project and it seems promising. ", "q1r": 5, "q2": "I think that this proposal is auditable but it can also be improved. The proposers have provided a 4 weeks action plan to complete the work. They also have included metrics/KPIs that we can track to measure the success of the proposal. They intend to speak to ~ 800 people in person which is great. I think that there is a little of language barriers because some explanations are not clear, but altogether I think that this is a good proposal that can bring value to the cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "We appreciate your comments and evaluation, they were very important to us. \nThe Facebook group is the largest in Brazil, with over 162,200 members (https://www.facebook.com/groups/btcbr). \nWe will carry out several actions to promote Cardano within the event, with raffles, registration of users, presentations, we will speak on the main stage and we will also use a beep to collect information from people who visit the Cardano stand. \nWe believe that we were able to successfully hold this event, we are passionate about the Cardano ecosystem and we will bring ambassadors and various influencers to participate with us. If possible support and help us to approve this project, including with a more positive evaluation and grades. \nThank you very much for your support."}, {"q0": "capitalizing on already existing events of a mammoth gathering is a sure way to educate and create awareness to the population. This is an opportunity to introduce cardano blockchain to the masses where the possibilities of starting hubs would be a measurable outcome. \nThe proposal is meeting the principles of the challenge and could a genuine platfrom create a niche in Brazil and across borders.\n\nThere should be conscious effort to have more time to talk and discuss about the cardano ecosystem ", "q0r": 4, "q1": "The detailed evidence of the team depict the assurance of executing the proposal for success. The budget is also detailed but signing a contract with BITCONF should be made public for inputs before going into that agreement. A sample contract should be uploaded here to guide the decision on how the contract will allow cardano feature prominently on such events in future without subscription fees. \n\nThe team should also note that it is not that appropriate to pay salaries for organizing events but per diem or allowances would do so that more of the funds will be channeled into the event marketing to ensuring a great number of people are reached out for the event. \n\nThe proposal has no sustainability plan to keep the event running. The proposal seems to make this event a one time thing and should have indicated if the proposers will continue to receive funding from the cardano community. \n", "q1r": 3, "q2": "The information provided is enough for auditing. There are KPIs and at least two projections on increasing the twitter followers. The other KPIs should have also had measurable outcomes on how many people to reach at the end of the event and how many more could be joining the catalyst school.  \n\nA progress reprot is important at each stage of the action plan to make the evaluation more easier. The proposers should consider that if they are funded.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "We really enjoyed reading your comments and ratings, we really believe in the power that a conference of this size in Brazil could bring benefits to the cryptocurrency community and new Cardano adoptions. \nWe seek to do with the smallest possible budget for the event, we are talking about sponsoring the conference, having a stand on every day of the event and even holding a lecture on the main stage. \nThe event is annual and we hope to be present in more editions in the future. We would be very happy with your support in approving the project and bringing this achievement to the Brazilian community."}], "solution": "We will exhibit at BITCONF - Brazilian Conference on Bitcoin, Blockchain and Cryptocurrencies - is the largest crypto event in Brazil.", "experience": "The team: a journalist, cryptocurrency content editor, presenter, marketing, designer and social media. Conceived and produced by the CardanoFeed team, the largest media specialized in Cardano coverage. We already have over 800+ projects registered in the Cardano ecosystem."}