{"id": 399147, "author": "carlhenryglobal", "title": "CardanoCommunityHubs.com Worldwide", "url": "https://cardano.ideascale.com/a/dtd/399147-48088", "category": 26439, "amount": 19500, "description": "The successful global adoption of Cardano & ₳DA depends on exclusivity and building utility - We need more project led Hubs!", "f6_no_assessments": 4, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 7360, "q0": "I found the idea interesting despite being quite ambitious. It is about creating a connection network between various hubs relevant to our ecosystem. According to the proponents, a series of activities would be developed here. They are intended, as I understand it, to help solve the difficulty of “making all information about the Cardano blockchain, applications, projects, ₳DA and other native currencies available in multiple languages”. They are also creating a website where “the content being built is primarily informational, covering all aspects of the Cardano Ecosystem and native currencies”. The idea involves many things, but I would say that it can be summarized in the creation of virtual hubs and also by the greater networking between the existing hubs at Cardano, it is said that one way to promote the success of the hubs is ensuring that the activities that each one group proposes to do can be remunerated, both in Ada and in the respective currencies of each country. I agree with this statement, I think Cardano is currently in a state of promise because we have many technologies but in a way it is still necessary to generate more articulation between the parties, so that all the groups together can work well in their respective areas and with that, the widespread adoption of our blockchain is promoted. That it can grow not only in terms of investment and volume of Ada, smart contracts, CNFTs and etc in circulation, but that more people can work through smart contracts minted at Cardano, that they can participate in companies that use our blockchain and that All of this has a positive impact on their lives. I believe that this proposal will, in a way, meet these needs, and with that, it is aligned with the objectives of the challenge. What really worries me here is that there are many activities, which would have to be done by many people, there are so many issues to be resolved that it causes me a bit of confusion if I really understood everything that is being proposed and especially how these things would be put into practice. Proponents cite: networking, better remuneration for those involved with projects at Cardano and a greater sense of sustainability... many issues are being addressed at the same time. Therefore, I think that if the proposal had more clarity on how each of them will be resolved (we know they will, but it's not as clear how, in my view), I would give the impact of this idea a maximum score. \n", "q0r": 4, "q1": "I don't think the proponents have presented a clear and concise roadmap, and at the same time puts us in detail about what will be done. We know very well which activities will be developed, the problem is that we are told that they would be carried out with funding from fund 8, but we do not know for how long they would all take together. We also don't know in which stages of the year they would happen (in which month and weeks), so it's not possible to have a linear view of the process to be built here. I would like the phase, as they call it, to be more detailed, in the sense that we know what would happen each month, who would do what, what weeks are planned for certain tasks to be performed, and so on. Therefore, I feel that the script needed a reformulation to make it more understandable, in terms of time. The proponents talk about a series of KPIs that can be used to monitor the proposed activities, but I will comment further on this in the auditability part. Talking about the team, we are introduced to 3 professionals, but we have different levels of information about each of them. For example, we don't know as much about Carl Henry as we do about the others involved. I would like his resume to be more detailed, given that he has so much professional experience (43 years). Now, in relation to the others, I thought that a lot of trust is passed on because we know their names, in a very detailed way their previous experiences, and for the 3 the linkedin profiles are made available, so that we can have a real proof of the information that is said. I think this part of the team is good, overall, my only observation would be to really improve the detail about Carl. Regarding the funding, we can find your explanation via a link provided which gives access to a google docs spreadsheet, I found this part to be satisfactorily detailed. We were able to get a good understanding of how the requested money would be used. Therefore, I think the feasibility is ok, but it can still improve in some aspects, such as the greater detailing of the script, in my view, the contents of the spreadsheet could have been posted in the description of the proposal as well, to facilitate. \n", "q1r": 4, "q2": "It is quite possible for us to audit the process already based on the extensive information made available on the feasibility of the activities that would need to be performed. We have enough KPIs here, in my view, the only thing that could be better specified is how the Cardano community could have access to such information. As important as providing ways to monitor the project, it is necessary that we know how to carry out this monitoring. We know that the team provides a link regarding the metrics, but will they always update this site? How often would it be updated? How would the Cardano community be aware of the updates, when attached? Would any member of the team let you know through the Catalyst general group on Telegram? Finally, it is necessary to clarify this doubt. Now talking about the measurement of success as a whole, they quote the site again, but I don't think the proponents define exactly what the success scenario would look like. I think the problem here is exactly what I said in the impact part, we have many things that are mentioned in this proposal, it is really multifaceted, I think that in order to understand if the general success happened, a study and a extensive research by the team. I understand it's something they intend to extend to future backgrounds, but I think it's necessary to situate the Cardano community on the completion of each of these phases. And I don't think there is such a thing here. Therefore, I suggest that the team rate more objectively how we can understand whether the final results were achieved, as accurately as they do with partial results. My opinion is therefore that the auditability is great on the progress part but very incomplete on the final scenario, so the team needs to review this topic. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1957, "q0": "The proposal fully addresses the challenge and draws on the benefits and utility of blockchain and Cardano to projects. Hubs will therefore be formed around projects which makes it a win win for these projects as well as for the Cardano ecosystem. The project which is a fund 7 funded project currently has a website with tools and updated information to build a global multilingual Cardano community hub known as Gerolamo which will be subdivided by language, country, cities etc, in order to reach people in their own language and within their own cultural understanding and this is a key focus of this challenge. The proposal has a global reach and focuses on making Cardano multilingual so as to reach a wider audience. The proposal's KPIs align with those of the challenge because its focus is on determining for example the number of new Cardano Community Hubs established after 6 months, the number of businesses or organisations which become digitised using the Cardano Blockchain and accepting ₳DA, the number of new Haskell and Plutus developers, and applications, introduced into the Cardano ecosystem among others. This proposal will clearly add value to Cardano by highlighting the practical benefits of blockchain and Cardano on a global scale.", "q0r": 5, "q1": "This is a fund 7 funded project which is currently ongoing and proposers have attached a number of external links to their website showing the progress of work. The implementation draws from the current work being done from the fund 7 funding and clearly spells out the focus, which is to continue further development of Gerolamo in order to deliver a fully functional Decentralised Autonomous Organisation (DAO) by carrying out a number of tasks and activities listed. These include creating a native Cardano token called \"Gero\", creating a stakepool with profits plowed back into building the Gerolamo community etc.  The roadmap for implementation over the funding period is however not clearly elucidated. A clear roadmap detailing the tasks to be done within a certain timeframe will definitely enhance the feasibility of the proposal. The background and experience of the 3member core team is suited to the proposal and external links are available to view more detail on the profiles of team members. The team has also been involved in Cardano and Catalyst since fund 2, conducting research  and submitting various proposals in a number of funds.  \nA detailed breakdown of the budget has been provided and challenges/risks have been identified although proposers did not provide clear mitigation measures they intend to deploy to manage these challenges/risks. ", "q1r": 4, "q2": "The proposal provides quantifiable KPIs including metrics by which progress can be audited. KPIs include - to achieve a target of 1,000+ new Registered Community hub Members with wallets & ADA, 60 Active Online Community Language Hubs with at least 4 members each etc. over the next 6 months. In addition, a link has been provided to their website where updates on targets and milestones can be found, which is quite ingenious. This makes it easy for the Community to monitor progress", "q2r": 5, "assessor": "z_assessor_1437", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2182, "q0": "Proposal focusing on successful Cardano & ADA adoption globally by reaching people whose projects can benefit from Cardano & ADA through the Gerolamo platform to showcase Cardano & Project Catalyst, providing documents and building sustainable community centers. This is the next stage of development of a project that was funded at Fund 7 to further develop Gerolamo to create a DAO, backed by its native token. This proposal could generate many contributions to the Cardano chain and thereby boost its global reach.", "q0r": 4, "q1": "As it is the next development phase of the project funded by Fund 7, I am confident in the feasibility of this project, however, the proposal needs to describe more clearly the implementation plan, the tasks what to do, and how to use funded resources during this period.", "q1r": 3, "q2": "The proposed budget is for 3 months, however, the proposal does not clearly describe the goals to be achieved during that time; The specific goals in 6 months seem to be unchanged compared to Fund 7. My advice is that the team needs to come up with a specific roadmap, separate from the required goals to be achieved in Fund 7 for the community can monitor, evaluate the implementation progress and results of the project in this phase.", "q2r": 2, "assessor": "z_assessor_1457", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8980, "q0": "The proposal aims at onboarding more members from across the world by giving them the platform or the opportunity to learn about Cardano and also submit proposals that can benefit the Cardano ecosystem and the proposers themselves. This is a great way to onboard new members and shares information about the ecosystem with new members. if funded, I think this proposal will have a huge impact on the Cardano ecosystem.", "q0r": 5, "q1": "From the plan put forward by the proposer, I do strongly believe that they will be able to deliver on their specific targets. The amount requested seems legitimate and is sufficiently warranted to succeed. The team's written experience is relevant to implementing this project.", "q1r": 5, "q2": "This project promises to be transparent and will report on its successes with all information being sent to their websites, this will help the community to also follow the progress very well. Key metrics are clear and tell us how to measure the success of the project.", "q2r": 5, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We are reaching out across the world to people who have projects than can benefit from all that Cardano can offer & building community hubs.", "experience": "We are a Fund 7 funded project, we have demonstrated our abilities by starting the project months before funding and our current range of proposals for new projects & hubs."}