{"id": 399231, "author": "ditcameroon", "title": "French Haskell + Plutus Curriculum", "url": "https://cardano.ideascale.com/a/dtd/399231-48088", "category": 26439, "amount": 9000, "description": "--\nHaskell/Plutus French curriculum is non existent for central and west Africa developers. This is a drastic road block to adoption", "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 7365, "q0": "This proposal fits perfectly with the objectives of the challenge, as it seeks to translate teachings on how to program in Haskell/Plutus for French speakers in Africa. The problem statement already makes it very clear what difficulties must be overcome here: “The Haskell/Plutus French curriculum is non-existent for Central and West African developers. This is a drastic obstacle to adoption.” Therefore, the idea is to continue the development of two previously funded ideas: Spread Plutus in Africa and Clubs + Hackathon = Cardano Adoption, which, despite not being so well explained, can be inferred from the context that it aimed to bring knowledge about the ecosystem Cardano, focusing on the programming language used in our blockchain, for this French audience from Africa. In my view, this is totally in line with the objectives of the challenge, because in it we seek to fund proposals that bring knowledge about our blockchain to a specific audience, so that their cultural specificities and their language are preserved and respected. This is exactly what happens here, and I think that the initiative should also be taken to other groups and other languages, because learning Plutus is still quite inaccessible to those who don't speak English. Therefore, I believe that the impact of this project has the potential to be maximum; I would like, however, that the subjects that will be addressed in these learnings were better detailed, how will such instructions be made available to the target audience? Through video classes, written texts, would they be face-to-face, online, hybrid meetings? Anyway, I really like the idea and I think it has a lot of future, but it still leaves a little to be desired in terms of detail, as I mentioned above, so I'll give it 4 stars; if the idea were more deeply explained and detailed, it would certainly deserve a top score, as the alignment here is undoubtedly perfect with the present challenge. \n", "q0r": 4, "q1": "There is no script per se in this proposal. All we know are the stages developed in the project, as well as some tasks that would make up these stages. However, this is not related to any notion of time, so we have no way of understanding the process well. They understand that for a script to be adequate, 3 things are fundamental: what will happen, when, and how? In this case, the only information we have is what will happen, we don't know if the activities of the first stage would take, for example, 1 month, or 2, or maybe just a few weeks... As well as the other parts. Therefore, I suggest that the proponents improve the script in this sense, associating the activities described with some temporality. Regarding the budget, I think the asking price is very fair for the complexity and scope of the proposal. 9,000 dollars are requested, and it is explained in which parts this total amount would be divided. We know the prices of translations and curation, including how much you would be charged for each hour of translation. Note that the requested value for this is higher than the average of translations, I say this because many Catalyst proposals suggest translating different contents, but I understand that translating teachings about Haskell is Plutus is much more difficult and requires more technique than translate, for example, Town Hall meetings. The only part that I think could have been better explained is team coordination. What would be the exact job for whoever would coordinate it? How many hours would this person work per week, to what extent would they commit to this project? Finally, let's analyze the team members involved in this project. A drive is available, but my access was denied, I believe the team forgot to configure access permissions for anyone with the link. Anyway, we have good information about the team members, just that some people provide better details about themselves than others. It is also a fact that some provide linkedin profiles and others do not. I wish everyone had given the same amount of detail about who they are, that way our understanding of the team would be more equal. I think it's fantastic that they are partners with the Wada group, as it is already a well-established and respected group on Catalyst for its various proposals that involve the African continent. Therefore, I think the feasibility of the project is good, but it can improve in some aspects. \n", "q1r": 4, "q2": "The auditability of the process is great, we know what would need to be measured (number of documents/commits published in git hub weekly + number of Haskell material (video, text, audio) translated into French + number of Plutus material (video, text, audio) translated into French) and how this would be accessed: via github. This is exactly what I always suggest to be done in relation to the auditability of the proposals, it is not enough to know what will be analyzed, we need to understand how the Cardano community will have access to such information, and in this case, both information is made available. Therefore, I have no criticism to make regarding that part of the proposal. Regarding the final result: the indicators that would serve to let us know that the main objectives were achieved are outlined, namely: “01 Haskell French curriculum ready to be taught throughout the Wada hub network + 01 Plutus French curriculum ready to be taught across the Wada hub network + Bilingual material (French, English) for our hackathon sessions + More than 21 French-speaking developers actively using the material to learn Haskell/Plutus in the first 6 months after publication.” These indicators are very important to have a more precise idea of ​​what the success scenario would look like, however, the proponents do not make it clear how this information would be taken to the Cardano community members, as well as they do in relation to the monitoring of the process. Would this be done via github as well? Or is it on another platform? Will the team develop any meetings with community members to explain whether the desired scenario has been achieved? Will there be participation of some French speakers from Africa, the target audience of the project? In my view, this is the only one that is pending regarding the auditability of this project. Otherwise, it is possible to understand very well how the project could be monitored. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1989, "q0": "This proposal responds to a recurring problem for French-speaking developers when they want to start familiarizing themselves with the Cardano ecosystem and the Catalyst project, whose resources are for the most part only available in English.\nThe translation of content into French would be beneficial for the French-speaking developers of the various HUBs of WADA Alliance, but also for any French-speaking person wishing to do so.\nThis translation would also be beneficial for instructors who are going to focus on teaching Hashkell ​​and Plutus and not try to translate while teaching. \nThat why i strongly agree that this proposal effectively addresse the challenge.", "q0r": 5, "q1": "\nThe core team is made up of people whose experience is more than enough to carry out this project both at the programming level and for the two languages ​​to be used in the translation, I say so for having participated in an activity. that the Cameroon team (DITC) had organized in January 2021 as part of another project named: Clubs + Hackathon = Cardano Adoption which is based on the Haskell language which went well although the content of the course was in English and I French.\nThe distribution of the budget is well done but not on time. The only thing the team lacks is an expert in translating documents from English to French.\nThe rating of 5 out of 5 is not an exaggeration because the team has already compiled the necessary material in English and it only needs to be translated into French", "q1r": 5, "q2": "The team presents milestones that can be used to track its progress and the success of the proposal. However, the plan does not detail when the desired results of the project are expected to be achieved.\nThe team also presents a list of elements (video, text, audio); Element can serve as final measurements and can be used to audit its success it offers to do so via GitHub but does not provide the link to the GitHub profile for later use. A rating of 4 out of 5 for verifiability seems correct to me.", "q2r": 4, "assessor": "z_assessor_1445", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6593, "q0": "This proposal is a logical continuation of proposal funded in fund 7 which was about spreading plutus in africa. While creating content for the project, the proposers now want to translate the content into french which is the language spoken in this area. I think that will help onboard more developers in the Cardano ecosystem. For that reason, I consider that this proposal is in the scope of the challenge and its implementation will surely add value to the cardano ecosystem.\nHowever, I think that proposal can be improved by better stating the problem. Other than that, I think that the impact of this proposal is good and deserves a high rating.", "q0r": 5, "q1": "I have to say that I have high confidence in a successful implementation of this proposal based on the information provided by the proposers. In the proposal they have included links of the team members' linkedin profiles. Since this is backed by wada, I can rest assured that they will do their best to make it work. Moreover, they have broken down the budget into easy to understand items. And as a digital marketer, I believe that the budget is reasonable. That said, I have to suggest to the proposer to take more time improving the proposal by adding a timetable to complete the work. I can understand that this will complete another project, but it is still important to add as many components to the proposal as possible, to increase the chances of getting funded. Other than that, I think that the proposal should be successfully implemented by this team.\n", "q1r": 5, "q2": "The proposal should be auditable based on the amount of information given by the proposer. They have provided good metrics? KPIs that define the success of the proposal. Their goal is  to get 21 french speaking developers actively using the document  in the first 6 months. I think that this is good but I recommend to the proposer to add at least a roadmap and stronger metrics that will allow the community to better track the progress of this proposal. Other than that, I think it is a good project backed by WADA - a well known organisation in the cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9068, "q0": "The proposal addresses the challenge by breaking the language barrier to get more blockchain enthusiasts onboard. Most of the curriculum of the French speaking countries are thought in French, slowing rate of understanding concepts and with the translation it increase pace to learn and be developers. This on the approach of SDG is to leave no one behind. ", "q0r": 5, "q1": "The team looks organized and have the capacity to deliver for results. Having won funding in fund7, the team have the experience to break the language barrier and ensure success of the project. The budget is simple and reasonable showing how the funds will be used for its purpose.", "q1r": 5, "q2": "The KPIs are very much clear and outcomes are measurable to easily enable auditing. There are good projections of what the  outcomes could be. This shows that, the metrics is making evaluation done in a simple way. ", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "--\nExtend the curriculum already being developed through our fund 7 funded proposals to include a French professional translation services", "experience": "--\nWada Cameroon Hub:\n\n3 senior software architects and developers with 12+ years of experience\nNine interns and software developers actively learning Haskell, Plutus and software architecture\nWada network of resources\n"}