{"id": 399479, "author": "rivenbark", "title": "The ADA Cafe Grows Cardano", "url": "https://cardano.ideascale.com/a/dtd/399479-48088", "category": 26439, "amount": 50000, "description": "We need to strengthen the existing community while simultaneously making Cardano more accessible and easy to onboard net-new people.", "f6_no_assessments": 10, "f6_rating": 1.4333333333333331, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does address the challenge of the growing numbers of newcomers to Cardano.  We have seen incoming activity from other blockchains such as ETH, SOL and DOT, therefore, on-boarding new people to the Cardano Ecosystem is imperative! The general consensus, currently, among the present Cardano population that this on-boarding should including a welcoming environment and education on this ecosystem.  Nonetheless, the proposal left their specific method of accomplishing this goal in a vague and scant one sentence response.  In addition, the proposed solution and the discussion of relevant experience was diminished and brief.  The ability to discuss solutions and plans for a proposal is ideal.  It is beneficial to have a detailed strategy and also to discuss the experience that each member brings to the team, as it may illicit trust for the team and the project.  Currently, there is no clear plan on how this project will be executed who will be involved. When asked \"What does success look like for this team?\" A one word answer was given, \"Spaces\".  Furthermore, the breakdown for how and for what will the funds be used is confusing.  They state that \"60%\" of the funds are to be used in \"Spaces\", however, spaces is a free service to use.  Please clarify.   Supporting projects that grow the Cardano Community is critical and planning for this endeavor should be done with careful execution to ensure success.  Please consider spending more time on the process of execution, team coordination and funds that will distributed for this project.  It is a great community need that cannot be taken lightly.  ", "q0r": 2, "q1": "Unfortunately, this proposal is not able to present am executable plan to show that it can accomplish a project successfully.  It would be ideal for the Cardano Community to have a solid structure for on-boarding Cardano new comers.  The proposal submits a website that looks fragmented, with minimal information on the spaces such as names and what time it is held.  It would be ideal to discuss each Community Space and the content that is valuable to a newcomer to Cardano and the community as a whole.  Education is critical to ensure success for any new person learning an ecosystem.  Showing how your platform actually accomplishes this goal would be helpful to understand the value it would bring to the community.  It is with great interest that this information to improve the proposal for its success.  Ensuring that the team has the necessary experience, credentials and involvement in the community will help to strengthen the proposal.  Having a detailed benchmark of the how the funds will be distributed and spend for the benefit of the community will also go a step further to help solidify the project with fiscal responsibility. ", "q1r": 1, "q2": "The proposal does not offer metrics to to measure success.  It would be ideal for the team to come up with metrics which include a poll with all the new members who use their services at the inception of using their services and then a follow up with those members at one month or 3 month time frame.  This will allow the team to find information which may help to support any feedback from users/members that the services are helpful to newcomers.  Additionally, this poll or survey may also help with any additional suggestions or ideas that these members may have to improve the project.  There are many online survey tools that are free-to-use.  This project has an excellent idea,  with substantial plan of execution, it may be successful!  Best Wishes.", "q2r": 1, "assessor": "z_assessor_1185", "no_vca": 12, "ne": 6, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "They intended to open the Cafe and see success. They must now jump-start it. As you can see, the issue is well-defined and well-explained. Moreover, while the solution is obvious, it has yet to have a long-term impact on the Cardano environment. The concept of opening a coffee shop to draw the community is intriguing, however the author has not explained who the target consumer is or how the events will be organized. What makes your coffee shop stand out from the rest in terms of attracting customers? Obviously, this suggestion is imprecise in its approach to the problem, and the plan's influence on the ecosystem has yet to be determined. As a result, I disagree that this solution adequately addresses the problem.", "q0r": 2, "q1": "We can't find any general information on the proposer, which makes it difficult to assess its feasibility. In actuality, it appears that there is still no prototype. The target they set in this plan is specific and attainable; nevertheless, there are no metrics, a road map, or an abstract roadmap, making it difficult to assess feasibility. Risk is obvious in the absence of mitigation. As a result, I strongly disagree with neutral that this suggestion will be implemented successfully.", "q1r": 1, "q2": "We can't find any general information on the proposer, which makes it difficult to assess its auditability. Second, there isn't a single path in this plan. There are no metrics or key performance indicators (KPIs) in place (Metrics). This proposal had a total budget and item structure, but no explanation of how it was calculated. As a result, I strongly disagree with this proposal's auditability, and I can only give it a score of one out of five.", "q2r": 1, "assessor": "z_assessor_1413", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal aims to growing the ADA café. However, the proposer don’t have put enough information for the community to evaluate that whether the proposal addresses the objectives laid out in the challenge or not. It seems that the proposal was not reviewed before submit. I could not understand what is the problem and the proposed solution, so 1 star from me.", "q0r": 1, "q1": "With very limited information for the plan as well as the team’s relevant experience, I could not give more than 1 star. ", "q1r": 1, "q2": "The proposer haven't put any information for the community to track the project progress.", "q2r": 1, "assessor": "z_assessor_1588", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal does not provide enough information to assess how it could address the challenge. It seems that it has not completed.", "q0r": 1, "q1": "There is no plan for community to check in this proposal. The expenses are not clear enough. There is also no information of the team.", "q1r": 1, "q2": "There is also no sufficient information to audit the progress. Just a few words from the proposer only.", "q2r": 1, "assessor": "z_assessor_2001", "no_vca": 24, "ne": 1, "ng": 13, "nfo": 10, "vca_o": 1}, {"q0": "I believe this is an accidental duplicate proposal for the ADA Cafe. It might explain why this one is rail-thin on details but the other is well-written and fully fleshed out.  I recommend those looking to support the valuable work ADA Cafe is doing to check out their proposal here. https://cardano.ideascale.com/c/idea/405177", "q0r": 1, "q1": "The relevant experience given was vague and unverifiable. Again, I believe this is just a duplicate, placeholder proposal that failed to be archived. ", "q1r": 1, "q2": "This proposal is half-formed.  Proposer didn't take the time to flesh it out completely to give assessors and voters ample information to make an informed decision about supporting this initiative. I believe it's just a duplicate anyway.", "q2r": 1, "assessor": "z_assessor_407", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "Draft proposal. There is no clear problem identified in the proposal, it is not clear which solution will be employed. There are no metrics/KPIs to assess the potential for impact. Overall the proposal lacks a lot of information, so I would recommend that the proposer use the following documentation (https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true) as a reference to design the new proposal, including elements that help in the indication of impact.", "q0r": 1, "q1": "The purpose of this proposal is not clear, it is possible to identify the idea of creating something related to digital events but this is very subjective and little explained. There is no relevant information to assess the team's experience and as there is no plan for development it is difficult to judge whether or not the team is able to deliver.\n\nThere is no understandable budget breakdown. This proposal is still a draft, I would recommend that the proposer use the following documentation (https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true) as a reference to design a new proposal, including elements that help in the indication of feasibility.", "q1r": 1, "q2": "Draft proposal. There are not enough items to assess auditability (there is no plan with clear deliverables, roadmap, milestones, metrics/KPIs). I would recommend that the proposer use the following documentation (https://docs.google.com/document/d/ 1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true) as a reference to design a new proposal, including elements that help in the indication of auditability", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal doesn't effectively address the challenge because its lacking in a lot of key details. In this proposal about 'ADA cafe' more details like what ADA cafe actually is, where its located and how they are going to grow ADA cafe. \n", "q0r": 1, "q1": "Their plan seriously lacks in important information, including what their plan actually is. all they have written is 'Yes will do'. They have given a short budget breakdown, but more detail is still needed. The proposer/s have written that they will acquire a cafe team, but how will they achieve that? What will their advertisements be? How many people on that team? These questions need to be answered and a detailed plan needs to be given.", "q1r": 1, "q2": "Since the proposer/s plan is partially nonexistent, it will be hard to audit the success for this project. What success would look like for them is answered with 'spaces'. More information and details are crucial for this. For part of it, the response is just 'will fill out'. Overall some more effort and detail is important for this proposal and idea to be implemented successfully and easy to audit.", "q2r": 1, "assessor": "z_assessor_585", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Got me confused with the proposer's explanation about this proposal. I thought proposer asking funds to build \"Real Cafe\" in some place(s) until I understand that this thing is routine (Twitter) Spaces for Community with Cardano's Ecosystem as its main topic. Really appreciate the team to create the spaces.\nBut this proposal is too raw, I suggest if proposer want to resubmitted in next Funding: proposer can learn in Catalyst School to write a nice--and fully followed the guide--proposal.", "q0r": 2, "q1": "Although the proposer did not provide details of the budget and schedule, their ADA Cafe has been proven. Also, their team members (mentioned on their website) are full of Twitter Celeb (has 1k+ followers), I'm sure they will run the Café smoothly. Again, I recommend that the proposer consult their proposal with the Catalyst School.", "q1r": 2, "q2": "Fully raw proposal. Only one thing can be check, that is the evidence of their Spaces. The proposer updated perfectly on their website.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The idea is great but it seems the author forgot to edit the proposal. Because the information given is scanty. You can't understand some of the things said. It addresses the challenge setting well, just that there is little to no information in there. Maybe they forgot to edit or the proposal was rushed.", "q0r": 3, "q1": "There is no information on the team and roadmap set for this proposal. No specific timelines, no plans, absolutely nothing to work with here. I think with a little more information, this would be feasible, however, looking at the information given by the proposer, there is no guarantee that the proposal can be implemented successfully.", "q1r": 1, "q2": "I think this proposal should be kept in reserve because it was not worked on. There is nothing on the proposal to talk about. This can't be implemented nor can it be audited.", "q2r": 1, "assessor": "z_assessor_715", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does in fact emphasize scaling up community hubs, at least in the online world of Twitter. That being said, it does not make clear \"how\" it will scale up, which should be included in a future breakdown. The obvious response is 'more spaces', but I think it's important to emphasize everything the Cafe already does to onboard people in a well-developed proposal.", "q0r": 4, "q1": "The Ada Cafe needs no introduction and it is clear that the group behind it can create and sustain a variety of spaces. Again, the issue here is with the breakdown of the \"plan\" which is not provided. ", "q1r": 2, "q2": "My feedback relates mostly to what was included in the proposal and the feasability of what was presented. I have no doubts the Ada Cafe will continue to grow and onboard people, but as of now there is no such \"auditability\" to be measured-- at least not one stated overtly in the proposal. ", "q2r": 3, "assessor": "z_assessor_983", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "We made the Cafe and see success. Now we need to jump start it.", "experience": "Spaces, Cafe, etc"}