{"id": 399451, "author": "thenoetherprotocol", "title": "Science Hub in Argentina", "url": "https://cardano.ideascale.com/a/dtd/399451-48088", "category": 26439, "amount": 9620, "description": "There are no specific hubs to connect Argentina's scientific talent with the Cardano ecosystem and its multiple possibilities.", "f6_no_assessments": 13, "f6_rating": 4.641025641025641, "videos": [], "media": [], "f6_assessments": [{"id": 5815, "q0": "This specialized minimum viable hub is directed for young scientists in Argentina whose research is focused in science, technology, engineering and mathematics. The Science Hub in Argentina does not only aim for Cardano awareness and adoption but also to contribute towards the very scientific foundations of Cardano in the long run. This could easily become an example for other countries to follow.\n\nA series of two symposiums, a practical 5-day workshop and a closing meetup take the participating young scientists through a shared experience that connects their own research interests to that of the possibilities in Cardano and Catalyst. By the end of it, we can expect at least 5 quality proposals coming from the Argentinian scientific community and hopefully about 30 new scientists will remain as active participants in Catalyst. This is a prime example of empowering people and changing their lives in unimaginable ways.\n\nThese events serve as a basis for the hub. Even if not in scope yet, it would have been interesting to read what future plans the team has for this hub after the events. To make the proposal even stronger, it could have included some more visioning forward and outlines for how to make the hub financially sustainable.\n\nThe problem statement matches the challenge well. The proposed solution has room to grow in Argentina and it is also replicable globally. The potential reach is not limited to the Spanish speaking scientific community because the academia prefers English (according to Wikipedia, Spanish language publications in natural sciences and technology account for only 0.5% of the world total).", "q0r": 5, "q1": "Having followed the Noether team’s progress also in Fund7, I am impressed by their capacity to produce quality proposals. The team underlines the importance of wrapping the new and exciting blockchain topics in familiar packaging, offering symposiums and workshops that scientists are used to. Scientists themselves, the team clearly understands the needs, fears and potential hesitation of the target group.\n\nOne of the strengths in this team is their multidisciplinary background. The fact that they come from different faculties should help the team attract diverse participation. How many other teams can say they are well versed in Digital Marketing, Cyber Law, Mathematics and Quantum Mechanics?\n\nThe budget is less than 2% of the total budget allocation for the challenge. It is remarkable how much the team promises to deliver for such a small amount of money. Unfortunately this is the global reality we live in but, on the other hand, it’s more bang for the buck—not only return on intent but, in fact, a really good return on investment, too.\n\nThe team has identified clear communication and bad reputation of cryptoeconomy as a whole as their biggest hurdle. They understand the need to frame Cardano as ‘a serious project for serious developers and scientists’.", "q1r": 5, "q2": "The proposal flows really smoothly and it’s easy to understand how it addresses the challenge. The budget is neatly outlined and the costs are reasonable. The planned events form a coherent whole, a funnel-like program really, which ensures that those who remain until the end will in all likelihood become active participants in Project Catalyst and the Cardano ecosystem as a whole.\n\nIt will be easy to measure the results every step of the way: the team will track the number of speakers and attendants at the symposia and at the workshop. The expected reach of 50+50 symposium participants (thirty of them continuing to the workshop stage) is very realistic. However, it would be good to also measure the effort required to reach these numbers, i.e. some leading indicators on top of the lagging ones.\n\nAs said, the budget is realistic and well constructed, definitely good value for money. However, when I tallied the budget line items, I realized that it is, in fact, missing $500 from the total (organization cost of the first workshop was not considered). This is an acceptable human error and most likely shouldn’t endanger the implementation.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7373, "q0": "The idea of ​​this proposal is really very good and perfectly meets the requirements of the challenge. It is about creating a community in Argentina that has scholars, scientists and young people as its target audience, to discuss in a more traditional way (such as through workshops and symposia) non-traditional subjects, such as technologies relevant to the Cardano ecosystem. In my opinion, the idea is correct in several respects. Starting with the fact that the proponent already informs a very specific target audience. I notice that many proposals aim to attract lay people to the cryptographic world, which is certainly necessary for our community to grow, to become more popular. However, it is also necessary to invest in an audience that is already a little more involved with issues of computing, economics, development, etc., and the target audience of this proposal seems to me to be well in this environment. The scientific community needs to wake up to the advantages and differentials of blockchain, especially Cardano, as I believe that our blockchain is very promising but is not yet widely known and adopted. With that, these events would help Cardano to become better known and maybe be used in some projects. Another positive point is that these events would take place in Argentina; We know that in some places, such as Europe and the United States, blockchain technology is already better known and consequently adopted, however in Latin America, Cardano is still in the embryonic process of implementation. In Argente, specifically, taxes and inflation are very high, making it quite expensive to develop research and projects, as the proponent says. This makes me think the following: if the community that produces technology and knowledge there understand the economic advantages of all this, they might be strong candidates to adopt Cardano en masse, since it is quite expensive to develop anything there. During the reading of the impact, I was a little in doubt about the specificity of the project, that is, I was not able to visualize exactly which subjects would be addressed. However, this issue is clarified in the feasibility, it is said that subjects such as “decentralized validation, the mathematics behind a project's tokenomics, smart contract deployment, digital signatures, the PoS protocol and its advantages” will be addressed. Therefore, I totally agree that this proposal aligns with the challenge as it has the potential to popularize the Cardano ecosystem (causing its greater adoption) for a specific community (the Argentine scientific community). \n", "q0r": 5, "q1": "Let's focus on the script: it is very rich in detail, but it lacked a sense of temporality and understanding what is behind the events. The activities to be carried out during the entire process are enumerated and richly detailed, so that we understand quite clearly what would need to be done and how. However, these activities are all related to the moment of the meetings, it is not said what the pre-production would be like. The point is that we don't know when such things would happen, and a script, in my view, should contain this information: what will be done, in what way and when. If the proponent had associated dates with activities, I would say that it is a complete script. For example, the first activity, which would be the first meeting, is explained very well, however, in which month of the year is this symposium scheduled to take place? What would have to be developed beforehand for this meeting to become possible? I believe that we have several things at stake, such as leasing a physical space, hiring people for the production team, hiring speakers, defining which topics would be addressed (this is mentioned), whether there would be a coffee break, a time for conversations and networking... Therefore, I think the script is accurate in terms of making us understand what events would be, but not what would happen behind them or how long each thing would take to be developed. Speaking now of the budget, I believe that the asking amount, approximately 9 thousand dollars, is very fair. Several meetings will be held, and as I said, it's not just the moment of the event, many things would have to be worked on before and some after, this generates a lot of expense. Regarding the explanations of this funding, we have some main points (symposium organization (x2), materials and space rental + workshop organization, materials and space rental + organization of the closing meeting, materials and space rental + social media reach and project management). The first three points are divided into small parts, so we understand very well the reason for the asking price for each. My only observation is regarding the last point, which would be the reach on social media and project management, this part does not contain more specific explanations, I would like to know what the marketing strategy would be adopted here and why. Finally, speaking of the team, this part is excellent, we know who the professionals involved are, what their professional areas are and it is also explained a little about their CVs, in addition to their linkedin profiles being attached, so that we can check all the information that is said. There is a lot of confidence in them, mainly because they are from the scientific community, which indicates that they would have a good idea of ​​how to dialogue with the target audience. That is, I believe that the feasibility is good, with only a few points to improve. \n", "q1r": 4, "q2": "The proponent gives us good indicators on how to audit the proposal, however I think that in the progress measurement part, we could have a little more qualitative data as well, for example: we are told that to measure progress a series of data would be monitored. They would be: number of registrations and participants in the symposia + number of speakers registered and approved in the symposia + number of participants who complete the 5-day Workshop + many other numbers, I will not quote them all because there is no need, just read the proposal. Anyway, knowing such numbers is undoubtedly necessary, but how could we observe the partial results from a more human perspective? I would like the proponent to have also suggested that a short report be made at the end of each event, explaining how the moment was, how the scientific community received the topics addressed, if some participants explicitly showed an interest in adopting Cardano's technologies in their projects, if they interacted well during the lectures, if there was any moment of integration between those involved (networkin), in short, qualitative data. In addition, I would also like to know how the pre-production process for these events took place, that is, if the work to be done to make the idea a reality was developed on time, in the right way and by the expected people. I would like to know if the two professionals mentioned as a team hired more people to form a team, such as designers and advertisers who would help form the visual identity and publicize the events, for example. So, in summary about the process, it would be useful for me to add to this number a more human analysis of the moments of encounter and also to monitor what was behind the events themselves. Regarding the final results, in my view the proponent approaches success in a superficial way, we know that the bigger goals would be “to develop and strengthen the relationship between young STEM-oriented scientists and the Argentine community of Cardano”, it is said how many scientists are expected that actually engage with the Cardano community (30) and how many proposals are expected to be generated from this project (5). However, it would be interesting to closely monitor those involved in the event, to find out how they absorbed the knowledge passed on, what projects would be born from there, if, in addition to the scientists, some students felt motivated to study about the technologies of our blockchain, as for example on Plutus... Finally, to trace a more specific notion of success. All this information (both progress and final results) must be easily accessible to the Cardano community, the proponent must gather them, for example, in online documents that are posted on some open google drive, in short, some way for all of us to verify these instances. Therefore, I will give 3 stars for this auditability, because I think it is ok but still has a lot to improve. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1166, "q0": "This team wants to present Cardano to the scientific community in the STEM areas claiming that there is currently no hub where this group of people can access, although this is a problem that is not exclusive to the scientific community in Argentina, I consider it a problem relevant enough to be addressed, due to the natural affinity that exists between the global scientific community and Cardano. Considering the spirit of Cardano and the type of events that are intended to be held, one way to improve the impact of this is the inclusion of reports or reports of lessons learned from the execution of these symposiums, since I consider that because they are so specific and In a community so in tune with Cardano, it would be nice if the global community could learn from their experience. Considering the amount requested, the events they plan to run, the audience they intend to reach, and the goals of success that the team proposes (30 new participating members of the Cardano community and 5 proposals from Catalyst) seem to me to be enough argument to give a rating. of 5 in the impact section.", "q0r": 5, "q1": "All the members of the team have relevant experiences and skills for the type of proposals, especially the person who is part of the main scientific organization of Argentina, the references to their link profile on linkedin allow me to validate experience, if it would have been interesting to know any paper or relevant investigative work of any of the team members. Regarding the budget requested, the team considered the requirements of the challenge, since it is in compliance with not exceeding 5% of the total budget for this challenge. The requested amount seems appropriate to me, however, I must say that there are a couple of items in it that can be confusing. Specifically those that refer to the rate assigned to \"organization\", exactly what does it refer to? If there is already another item assigned to the coordination.", "q1r": 4, "q2": "The team did a great job on the success metrics, they are concise and clear. These allow the community to know the result and impact at each stage of project implementation. However, when analyzing the presented roadmap I find it unfortunately very generic, it is only said that 4 events will be held in the range of one year. But it is not clear when the community can begin to see the results of this.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2183, "q0": "Cardano's technology has many scientific and technical challenges; We need talented scientists and developers to tackle these challenges. The proposal addresses this challenge by creating a minimum-viable hub to attract scientists to the Cardano ecosystem to research and build a better ecosystem for Cardano. The proposal is presented in a clear, detailed manner, with a very specific target audience: young scientists in Argentina; It matches the requirements of the challenge. This proposal not only adds valuable human resources from LATAM for the development of the Cardano ecosystem but also increases the value and reputation of the ecosystem with the participation of famous scientists.", "q0r": 5, "q1": "The team is a scientists, their information can be easily verified under the LinkedIn they provide; so they understand and know how to effectively approach people from this academic background. The proposal clearly defines the goals to be achieved and provides a complete, detailed plan with 4 major meetings in 12 months. The budget is clearly outlined; the total required budget for the proposal is $9620 divided into identifiable items to accomplish each stated objective. With the information provided in the proposal, I fully agree that this project will be feasible.", "q1r": 5, "q2": "Proposal to provide full information; The key indicators that determine the success of the project are clearly described, easy to understand, and quantified with specific numbers. My advice is that it is recommended to define specific times for milestones and results to be achieved so that it is easier for the community to track progress and more accurately measure project performance.", "q2r": 4, "assessor": "z_assessor_1457", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3519, "q0": "The proposal does seem to address an important gap: the knowledge about Cardano and blockchain in Latin America. More importantly, the teams seems to be aware of its challenge and to understand some of the mismconception regarding cryptocurrency in the region. While the idea is not particularly innovative, I do think it is a region with potential for growth whithin the Cardano ecosystem, and starting on the academic field, one that the team members seem familiar with, so they can easily communicate.", "q0r": 5, "q1": "The events seem well-thought and structured. However, I think the timeline could include marketing/promotion, which would be a big part in the project's success. There could also be some time dedicated to the logistics: finding the space, sleecting and contacting the speaker, etc. \nThe budget seems realistic, although there could be a larger part dedicated to marketing. Considering that it is a challenge to efficiently communicate about blockchain in an evironment where people suspect it, bringing in a significant audience might not be so simple.\nThe team seems very competent and the link allow us to verify their credentials.", "q1r": 3, "q2": "The targets are very aligned with the callenge and I like how it is measureble, therefore it will be easy to understand if the project was successful by the end of it. It considers not only the turnout of the events themselves, but also the impact for Cardano", "q2r": 5, "assessor": "z_assessor_1659", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4882, "q0": "The project of these 3 proposers is to create a scientific hub in Argentina focusing on the young scientist community, especially oriented to STEM oriented scientists.\n\nThis team promises to host scientific symposiums and workshops to address not so \"traditional\" topics: the blockchain revolution; scaling solutions; decentralized validation; PoS advantages; smart contracts in the Cardano blockchain; SPO; dApps development.\nAlso to protect them from Ponzi schemes like Zoe's Ponzi schemes in order to restore faith and calm to their public (according to the proposers in the country there were  several unfortunate events like Ponzi of Zoe, that discredit the blockchain technology). They will show young scientists the possibility of answering technical and scientific questions about Cardano ecosystem in a confident environment.", "q0r": 5, "q1": "The team has clearly detailed the timeline and roadmap of the 4 meetings in one year, in Buenos Aires and Cordoba, targeting young scientists.\nThe members (detailed below) of this team seem to have enough capacity to carry out these events even if it is the first time.\nB Marcolongo: PhD student in physics.\nHéctor Pollastri: PhD in pure Mathematics. Physicist. Professor\nRaúl E. Sendín: Expert in Digital Marketing and Community Management\nHoracio Baca Amenábar: Lawyer, specialized in parliamentary procedure and Cyber Law.\nThe budgets also are well detailed and planned so it seems reasonable to me.", "q1r": 5, "q2": "In this part if they offer the photos or videos or any other information such as meetup registration, as well as presenting at least 5 Catalyst projects in the next challenges, the result of their proposal can be audited without problem.", "q2r": 4, "assessor": "z_assessor_1795", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5516, "q0": "The aim of the proposal is to create a scientific hub in Argentina, with the main purpose of attracting members of the scientific community through a series of symposiums focused on the technical side of Cardano, all taking place in an academic environment. I find the scope of the proposal to be very relevant to the challenge and potentially become a valuable endeavour for the entire eco-system.", "q0r": 5, "q1": "The proposers have described in detail the theme of each of the 4 workshops, providing a clear structure and plan to the entire project. The budget is well adapted to the timeline and is broken-down into the necessary requirements of the 4 symposiums, each with clear, different needs.\nThe provided detailed team members description, all with attached links to prove their skills and previous work are not only complete, but gives a sense of why they would be the appropriate team to complete the project.", "q1r": 5, "q2": "The progress measurement, as well as the project success are very clear and easily verifiable by the community. The team has also taken the time to explain how their previous funded proposal from Fund7, that is not related to this one, but can help in providing a basic foundation for the start of the hub. All the information provided is sufficient and clear, as such, I conclude that the proposal is easy to assess in both its development as well as its potential success.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5705, "q0": "This is an incredible idea. Being part of the LATAM (Brazil), I agree that we need more scientific engagement. I’m engineer and I think that most people who enjoys the crypto world have to walk by themselves, not having much support. Even now we have lots of people who still thinks that this is a fraud, and there are those who use the lack of knowledge of the people to rob them, which makes deteriorates the crypto image.\n\nThe perception that the approach should consider the existing structures of the scientific world is correct, I agree with it. This method will generate credibility, showing them [STEM] that ADA is peer reviewed and assuring that they can go through this path.\n", "q0r": 5, "q1": "I’ve loved this idea, however, in order to be scalable and diminish the need of funding, you might charge something as a ticket. Or, create a platform which would be possible to buy NFTs correlated with ADA world and mixing with the STEM one. It might help to raise some fund and diminish the dependence of this funding. I think that those who are participating of the events will want to starting to navigate in this world and experimenting things, therefore having a platform offering stuffs would be nice.\n\nMoreover, during the brainstorming part would be nice to invite some companies to share their pain. Since the environment there would be pure creativity with lots of capable people willing to solve some problems, nothing better than invite people who have lots of them and want solutions. \n\nIn the scientific world one point that we need to account is the credentials. Any symposium is backed by some (inter)national institute, therefore I think it would be important to, at least, make contact with some universities in Argentina in order to generate these credentials needed.\n\nI’m missing some risk map as well: a) If you don’t get the available dates to the speakers; b) if you don’t have any institution to generate the credentials; etc. These are some of the risks that you should account for.", "q1r": 4, "q2": "The metrics and KPIs are well defined.\n\nOne additional thing that could be added is sharing the symposium content on some platform. This would generate recognition and would allow to those who are from other parts of the world to ‘participate’ in some form. Besides, it would allow us to audit the result.\n", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5893, "q0": "Proposal is valid and well written. Argentinian community is na interesting one as is will allow the grow of Cardano in LATAM in a country that faces serious currency issues since decades (e.g. sistemic inflation). It can help to address challenges kpis as number of developers the community-focused challenge bring into the Cardano ecosystem and # of new users of Cardano were onboarded?. I like the target audience is well set (STEM students in the academy in Argentina) and proposers seems to understand how to operate and engage with them. The content to be discussed in these meetings also seem to make sense to the audience and to Cardano ecossystem.\nAs suggestions, communication plan could be better detailed, some strategy to bring in more low income STEM students (which usually work and study and dont have time for extra activities) could be put in place - though it is very nice participation will be free- and maybe a live/recorded broadcast of these meeting could also be made, though it could increase project budget. It is also imporant to register all lessons learned to replicate the knowledge acquired here to other proposers with similars projects.", "q0r": 5, "q1": "4 people in the team with vast academic experience and tech, crypto, economy and marketing background are enough to hold the 4 mentioned encounters. They provide links to verify the authenticity of the information which is highly appreciated. \nAs to the plan, It is clear what events will be held but more details on the planning could be provided (i.e. when they are to happen, how the hiriging of the necessary people and staff will be made, how the rental of the spaces will be done and so on). It could also be clearer how they will reach the potential speakers and wheter they have already contact with them or not. These extra information are, however, just details/suggestions, and I wouldnt lower the score of the feasbility because of them.\nThe budget breakdown is well done and clear, just would be imporant to add explictly a contigency fee for unexpected incidents. It also corresponds to aprox 2% of challenge total budget and hence is aligned with the challenge guideline of CA to favour \"Proposals that do not exceed 5% of the total Challenge budget.\"", "q1r": 5, "q2": "The kpis proposed make sense and some of them have targets which is good. I'd also include a kpi to measure the number of positive feedbacks after each event. This is imporant to evaluate quality and learn along tthe way to improve until the final encounter. Defition of success is clear and it is much appreciated to have a final goal of \"5 science-related proposals filled and/or funded in the Catalyst project\". It allows the to help bring value back to the community and validate the efficacy of the project.\nThe 4 encounters themselves also help to track project progress as they happen - they can be considered milestones.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8947, "q0": "The idea is interesting, about to create a scientific community hub to attract scientists, science students and developers in Argentina to the Cardano ecosystem. The proposal definitely fits into the challenge as well as adds value to Cardano ecosystem, because it will give scientific people who have academic background in Argentina a chance to connect, to know about Cardano, to share and support each other in Cardano engagement. If it is successful, the proposal will help to increase number of new members onboarding, number of active members (CAs, vCAs, voters, developers, ect) and number of quality proposals and so much more, in other words, the proposal keeps encouraging the local Community Hubs to drive adoption and awareness of Cardano.", "q0r": 5, "q1": "The proposers explain about the plan in details in a timeline 12 months with 4 big encounters, budget breakdown and information of the proposer for us to assess the feasibility of the project: Regarding to the plan, we can see what needs to be done in each of encounters in a period 12 months in a very clear way. The financial amount is broken down in details and explained about cost for each encounter in the plan very reasonable, which allows us to understand what needs to be spend money on, and how much it costs. Regarding to the team’s information, we can see their names, their professional majors, number of experienced years, and their social links where we can know more about them, I believe the project is in the good hands with fulfilling experience and skills relevant to conducting the project. Moreover, the team has a winning proposal in Fund7. That is the strong evidence for the experience and skill of the team . Therefore, I strong agree the proposal is feasible.", "q1r": 5, "q2": "The proposers provide roadmap (in detailed plan), success metrics, milestones and KPIs understandable clearly as well as the section section “What does success for this project look like?”, that allows us easy to understand what need to be measured, which goals the project aims to, what the result would be expected in general, and also give us a vision of the project as a whole. In summary, I strong agree the proposal can be audited.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9011, "q0": "In this proposal, there is congruence between the problem and the challenge. Creating a scientific CCH in Argentina that engages the scientific community with the Cardano ecosystem is a big mark for Cardano and hence the value it will add to the ecosystem in this case is obvious and undoubted. One of the ultimate goals of this proposal is to establish an hub that attracts members of the scientific community, and hence the goals and metrics are in alignment with the challenge setting. The proposal has a potential of scaling in the future, and for me it’s good.", "q0r": 5, "q1": "Given the information about the team and the description of the relevant experience, I am assured that the team is well equipped to execute the project. The budget presented is well prepared and I also believe it’s reasonable to achieve the goal of the project. It’s very good that the proposer has provided a comprehensive plan and a definite timeline for the project. I appreciate the inclusion of the challenges and risks that may arise during the execution of the project. I like all these informations provided because they make the feasibility of the project possible.\nKeep it up even for future proposals.", "q1r": 4, "q2": "The roadmap, milestones and time horizon are well described, that’s brilliant. Strengthening and developing the relationship between STEM-oriented scientists and the Argentinian community is a desired outcome for what success looks like; the metrics/KPIs were excellently chosen as they help in evaluating and achieving the success of the proposal.\nThe targeted problem described here is easy to recognize and I believe that the proposed solution when implemented addresses the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9071, "q0": "The proposal is aligned with challenge with a well defined focus group. The proposal is showing understanding of the the target group and has clearly indicated to narrowly reach out to the STEM members within a larger group of scientists.", "q0r": 5, "q1": "The team is experienced and having funded in fund7, they have understood how to create insightful modules for the scientists in STEM. The budget though looking at more of travel and honorariums, which will consume a chunk of the funds, the budget is showing detailed expenditures.  \n\nThe 4 activities put in place are well coordinated to drive the hub to create for themselves other crop of individuals using mathematics to solve problems in the cardano ecosystem. ", "q1r": 5, "q2": "The roadmap is clear with measurable KPIs that are easier to evaluate for progress and success.\n\nHowever, the proposal has no sustainability plan to keep the project running for years.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10009, "q0": "The proposal aims to generate a scientific Cardano Hub in Argentina. This latin American country is eager to help its population onboard and use banking outside the high inflationary currency they have. \nTherefore the group of professors is willing to prerpare various symposioms and seminars around the cardano ecosystem and benefits/security/growth/community. \nThe group shares their enthusiasm to spread the word and help onboard newcomers and guide them away the ponzi scheme and scams around the crypto world. ", "q0r": 4, "q1": "The professors have listed a very modest budget to cover simple cost of room rental and marketing for various monthly seminars and symposiums. \n\\The team is well versed within the reseach academy in argentina and can amass a group of like minded poeple willing to learn and collaborate into the cardano ecosystem. \nI believe the plan listed is a well discussed plan. However I would like to recomment that many of these symposioms be also availble online. \nIt would be great if the team could increase their fund to allow for an online check-in and attendance as this will not only benefit the local visitors but as well the global comunity as a whole. And in a post-COVID world this should be a second nature to any in-person event. ", "q1r": 5, "q2": "The proposal lists several symposium meetings in various cities and university around Argentina. Most of the funds will go for the space allocation and logisitcs to moving around equipement people and speakers. \nThe proposal has mentioned that attendance sheets will be gathered and topics/minutes will be submitted as part of the closing of the project. \nI would request that the seminars be posted online (either live or post event) to spread the knowledge globally. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We’ll create a scientific CCH in Argentina that hosts symposiums to engage members of the scientific community with the Cardano ecosystem.", "experience": "B. Marcolongo: physicist -high performance computing\nH. Peña: PhD in math -programmer\nR. Sendín: market analyst\nH. Baca: lawyer –cyberlaw\nWe were funded in the Fund7 to create a protocol that provides free processing power to the scientific communities of LATAM."}