{"id": 400117, "author": "furrysparkle", "title": "MADAO New Mexico Ambassador program", "url": "https://cardano.ideascale.com/a/dtd/400117-48088", "category": 26439, "amount": 8000, "description": "MADAO needs to move past a cold-start problem within our eCommerce platform.", "f6_no_assessments": 4, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1960, "q0": "The proposal is for the creation and operation of an e-commerce platform which will become the local hub for growing the Cardano community. The target audience is people within the state of New Mexico in the US which fits in with the challenge's idea of reaching people within their cultural setting and language. The proposal also meets the MVH concept, starting with a group of 6 members of the MADAO community to be onboarded into the Cardano community and who will further attract and onboard businesses and people from New Mexico. The ultimate goal is to onboard 500 members to the Cardano ecosystem which is in line with the growth agenda of this challenge. \n\nThe impact on the Cardano community will be significant and will be even more noticeable if proposers are able to scale to other parts of the country as indicated. They noted that they intend to expand into the tech hub of Albuquerque and Santa Fe.", "q0r": 5, "q1": "Building a hub around an e-commerce platform is an ingenious idea most likely to attract high patronage if properly marketed and implemented. Proposers gave an outline of one key task to be undertaken in each month of funding, for a period of 4 months. Although a  breakdown of the tasks would have given a much better impression, it is still clear what proposers intend to do and within what timeframe. \n\nA more explanatory budget would have helped to gain a better understanding of the factors that determined the number of hours each team member would spend on the project per month but the proposal only states that each member would spend 20hours monthly. The budget covers a team of 3 core people and the anticipated 6 initial ambassadors. Unfortunately, there is very little information on the team except their names and the fact that the team comprises an economist, two community managers, a back-end Haskell coder, and an administrator. Additional information, possibly a link to their profiles will be a great help in verifying team skills. \n\nProposers are aware of the potential challenges and have suggested ways of addressing them.", "q1r": 4, "q2": "To improve auditability of the project, proposers should consider specifying within which timeframe progress can be tracked from their Discord channel and/or the MADAO Freedom Framework and what specific progress they intend to achieve within that period. They mention these 2 channels as sources of feedback however, did not provide specifics. This may affect the possibility of auditing the success of the proposal. ", "q2r": 3, "assessor": "z_assessor_1437", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5825, "q0": "Complementary currencies and mutual credit systems like timebanks and local exchange trading systems have existed for half a century. As the Internet became more widespread, they too grew in popularity. Now, however, in the era of cool Web2 apps most of these early implementations feel archaic and they have had difficulties in gaining mainstream adoption. Web3 could change that and initiatives like MADAO, if approached strategically with a global-local mindset, could pave the way to a new renaissance of mutual aid networks. The idea of coupling ADA based global economy with limited scope local currencies and related mutual aid networks is just brilliant. Unfortunately the proposal lacks vision. It is very local in its approach (which is great when dealing locally) yet therefore a hard sell for the global community. Should this be treated as a \"minimum viable hub\" on the road towards a replicable and scalable model where existing ", "q0r": 2, "q1": "The team is only asking for \"22$/hr for 20 hours per month from 6 people\", plus \"80$ for digital infra/support\". It is in par with the somewhat low ambition level and local focus.\n\nAfter reading the Fund7 proposal, I see the potential but it doesn't come through in this Fund8 proposal. For example, here the team has not been introduced at all but the earlier proposal outlined the team members well: \"An independent economist and trader from Shanghai (Eddie Chu), an electrician and congressional candidate from New Mexico (Sheridan Lund), a recent college graduate from California by way of Arizona (Jenny Press), and a podcast producer from New York by way of Florida (Shael Riley).\" Here, the summary of experience sounds very promising: \"Our team of basic-income advocates and anti-poverty experts includes an economist, two community managers, a back-end Haskell coder, and an administrator. This project is backed by economic and community leaders.\" Now you would just have to show who these people are and what their credentials / profiles are.\n\nIf you continue your efforts and apply for funding in Fund9, please preserve the good bits from the past and add your secret sauce, to make a well-rounded proposal.", "q1r": 3, "q2": "The proposers assume that the voters have become acquainted with their ealier (unfunded) proposal: https://cardano.ideascale.com/c/idea/381251\n\nWithout reading that and watching the video, it would have been hard to grasp what MADAO is about.\n\nThere is a roadmap on the website (https://madao.io) but for some reason it has not been brought here. There are no KPIs or general clarity in the plan and, as such, this proposal is not very auditable.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8987, "q0": "The initiative is good and it provides information from the Cardano ecosystem to the Mexico community. This fits the challenge by providing engagements.", "q0r": 4, "q1": "There is no proof of experience or skill set of the team, making it difficult to know what they are capable of doing. I suggest providing details of the team members with appropriate links proving their qualifications. The budget is just stated. This proposal gives little to no information as to whether the proposal can be implemented.", "q1r": 1, "q2": "The roadmap of the proposal has very little information. With the confusion of the team qualification and no breakdown of the budget into details in mind, I think auditing this proposal or following the progress of this proposal will be difficult for the community.", "q2r": 2, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9084, "q0": "Awareness creation of the cardano ecosystem is important to growth community and onboard others. However, the proposal at the same time is looking at ensuring the legality of cardano for legal tendering. This is not effectively addressing the challenge. The challenge is looking measurable means of increasing participation and sustaining such hubs with understanding of the targeted audience.\n\nThe proposal has so many target audience and would need to focus on what group could be used to grow a hub/community", "q0r": 3, "q1": "The budget is reasonable but team members cannot be verified to understand their expertise for the project implementation. This will make the project implementation unsuccessful. \n\nThe proposals is also not projecting outcomes after each month of the implementation.", "q1r": 2, "q2": "The projection of 500 membership is unique and will guide for auditing. However, there is no sustainability plan for continuation.\n\nThe proposal is also not measuring outcomes and will make auditing quite difficult.\n", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will hire 6 Community Ambassadors from New Mexico to raise awareness of MADAO and bring up the visibility of Cardano in the state.", "experience": "Our team of basic-income advocates and anti-poverty experts includes an economist, two community managers, a back-end Haskell coder, and an administrator. This project is backed by economic and community leaders."}