{"id": 400304, "author": "cardanokombat", "title": "Cardano Kombat Education Alliance", "url": "https://cardano.ideascale.com/a/dtd/400304-48088", "category": 26439, "amount": 100000, "description": "Individuals that are new to cryptocurrency are often misguided, lost and sometimes taken advantage of from bad actors in the ecosystem.", "f6_no_assessments": 9, "f6_rating": 1.740740740740741, "videos": [], "media": [], "f6_assessments": [{"q0": "I’m unsure if this proposal is presented in the right challenge category, here is my reasoning. From my understanding, the proposal aims to act as a welcoming committee, helping and guiding new people in the ecosystem with the onboarding process. Where the overall goal is pretty clear, the explanations on how the proposal aims to do it is not, unfortunately. If I understand the proposal correctly, they do have plans on creating community hubs and spaces within the metaverse, but I would have liked to see more detailed examples of how they want to do it. There is mention of using high quality art and gaming to help people with guiding new people (which makes sense considering their current NFT collection), but not much how this art will explain Cardano. The proposal also states that they will use Social media and twitter spaces but as stated above, not much is explained after that. I’m wondering if this proposal would fit better in the ”New Member Onboarding” category, or possibly ”dApps and Integrations” if the proposal will focus on developing the educational NFT-collection. \n\nIn my experience as a recurring CA (since Fund6) I would suggest to decide on one solution described in detail, and explain that thoroughly in order to make the proposal more clear. For example (if part of a more fitting challenge category), ”We aim to create 3 series of NFT collections that will explain different aspects or functions of the Cardano Ecosystem, each NFT will be accompanied by a short educational video explaining the function represented in the NFT. We plan to collaborate with X team/organization to get in contact with as many newcomers to the Cardano ecosystem as possible, etc.” (not a great description of a project, but hopefully you’ll see my point.)\n\n\n\nCurrently, it is my opinion that the proposal is missing a lot of key metrics and goals aligned with the chosen challenge setting. There is however a lot of great ideas in this proposal, but it would need to be a bit more clear and focused in order to be assessed properly. Due to lack of clarity and information, I disagree that the proposal effectively addresses the challenge.", "q0r": 2, "q1": "The proposal includes a link to the original NFT-project website of the team. Having a successful project completed or in development process speaks well for the commitment of the developing team. At the website we find the (eight) members of the team (this could be included in the proposal to improve clarity), but it would be beneficial to include some verifiable resources that can confirm the skills and experience of each team member (Such as LinkedIn profiles or links to previous projects).  \u2028\u2028Considering that the proposal asks for roughly 20% of the total funds for the challenge setting, it would be nice to see a breakdown of the budget included, along with an estimate of the working hours for each team member involved in developing the project. For example, ”X amount of USD allocated to marketing, split between two people for 40 hours each”. To further increase the feasibility of the proposal, I would suggest to add a timeline. What does the proposal aim to achieve by what time? In its current form, the proposal states under ”budget breakdown” what it means to do with the allocated USD (purchase land within metaverse, create gaming facility, Cardano historical museum etc) but without stating amount of USD, or specifics on each mention. \u2028\u2028The more transparency there is, the more trust and credibility for the development and team will come (Which is identified as a potential challenge in the proposal). \u2028\u2028Due to the reasons stated above, I strongly disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 1, "q2": "There is great vision within the proposal team, which aims to be part of and interacting with the Cardano system for a long period of time. There has been mentions of social media platforms earlier in the proposal, but would be nice to see that included here. If the proposal would include some measurements of success (or KPIs) presented on a roadmap with a chronological timeframe, it would make a huge difference in the auditability of the proposal. How many members do the team aim to grant exposure to their learning platforms or NFT collections, what is measured as success and how (and where) will the community be able to communicate with the team, and follow the development process? It could be as simple as to state ”We plan to host educational guidance on these three platforms, and hopefully get in contact with X amount of people during Y amount of time. We plan to communicate with the community through X platform.”\u2028Currently, there is not much concrete information in the proposal for me to assess the auditability. Therefore, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The team that prepared this proposal raises the problem of the entry barrier to the world of cryptocurrencies and the amount of information that is necessary to access is often intimidating, and there are also a number of bad actors that often take advantage of the lack of knowledge of the newcomers. The team intends to make available all its knowledge through the presentation of the ecosystem in digital spaces. So for me it is clear the value they intend to deliver to the ecosystem, however, I must say that when contrasting this challenge with the challenge settings and considering that the focus will be placed on nurturing newcomers with knowledge, and in fact, I allow myself to quote from the proposal \"Our willing to provide outreach and just getting to know new members of the community will be featured\". I am inclined to the conclusion that this proposal is in the wrong challenge, being the more appropriate \"New Members Onboarding\". However, I also believe that sharing in these spaces will encourage the possible creation of community. So I have decided to award a score of 4.", "q0r": 4, "q1": "The proposing team claims to be \"Cardano Kombat\". Who as an entity are well known in the community. Talk about their history as NFT. However, I would prefer a description of the roles and people that will make up the committee that will implement this proposal. Considering that there is a reason that I do not know why no names are presented and considering the presence of Cardano Kombat in the community it is clear that they have the competences and skills to carry out this proposal. Regarding the budget unfortunately there is no breakdown to understand what is the logic of the team that led them to ask for this amount, this for me is critical. Also when contrasting the amount requested with the challenge settings where we are asked to the community of CAs that the amounts do not exceed 5% of the challenge budget and this represents 20% since the focus of this challenge is the expansion of Hubs in the form of MVH I must say that this represents another concern, which is why I decide to assign the team a score of 2. ", "q1r": 2, "q2": "This proposal unfortunately lacks the minimum information necessary to make a complete assessment in terms of auditability. This is critical for the Catalyst community and therefore my recommendation to the voters is not to approve this proposal. Now as a recommendation for the proposers, for the type of proposal that was presented it is not complicated to propose some metrics, these should be measurable and transparent to the community. As examples I would propose; number of new members attending, number of new wallets, level of participation of new attendees, among others. My score for this section is 1. ", "q2r": 1, "assessor": "z_assessor_130", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Since I am quite new to cryptocurrency, I am able to appreciate the problems that this proposal will provide solutions to and the fact that it will serve as an important source of information to people who are practically meandering in a maze and need guidance. The proposal however is unable to clearly show how this will directly benefit the Cardano ecosystem, aside providing information which may point people to Cardano.  The end result of the proposal does not match with the KPIs of this challenge which is basically to see positive growth in terms of number of hubs created, new developers, new users to Cardano etc. There is also no indication of the ability to scale and extend their reach and no strategy or plan in place to make the hub self reliant with time. ", "q0r": 3, "q1": "Proposers do not provide a plan for implementation of this proposal neither do they provide a budget to justify the $100,000 requested for. They plan to help new users to crypto with user questions, provide informational material and fast track individuals to other established members of the ecosystem. They also intend to build educational spaces within the metaverse such as a Cardano specific historical museum, a gaming facility, stadium seating classrooms etc. however, no roadmap or timetable has been provided on how these will be achieved and within what timeframe. \n\nProposers have identified the key challenge to this project and have suggested ways of addressing the challenge. They did not however provide much information on the team, no names nor individual profiles of team members and it is quite difficult to assess the feasibility of this proposal without adequate information. Proposers will do well to provide detailed information to facilitate the assessment.", "q1r": 2, "q2": "It will certainly be difficult to audit this project because although there is an indication of what the success of the project should look like, there is no provision for how to measure this success. There are no KPIs or metrics to audit progress and there was no mention of how the Community will be updated on progress.  ", "q2r": 2, "assessor": "z_assessor_1437", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal if completed will be very helpful for newbies. Have a leadership team to share knowledge. However, I think there is a big challenge that communities are still facing today, bad members will infiltrate the community, private message scam or lure new people, have you thought about this? Do you have a solution for this problem?", "q0r": 3, "q1": "It seems that you do not know how to write a suitable proposal on the Catalyst fund, it is necessary to have a specific project roadmap and detailed budget for each stage. Teams need to be fully named, with links to the social channels the members are active in.", "q1r": 1, "q2": "You do not specify criteria to quantify the development of the project, for example: number of members, lessons, social channels... The success of the project is hard to think of.", "q2r": 1, "assessor": "z_assessor_1544", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal aims  to create an education space for newbies in the Cardano system by social media. In general, the idea of helping new people is good. The problems for learning new things, especially suspicious one like cryptocurrencies, have been clearly stated. However, the solution is not clearly explained. I neither agree or disagree with the impact of this challenge.", "q0r": 3, "q1": "There is no clear timeline for this proposal. They have applied for a 100,000 USD fund, 20% of the total budget of this challenge. However, there is a proper explanation for the requested expense. We don’t know how the money will be spent, what exactly items will be bought, which metaverse they will use. Why they bought items in metaverse? The information for the team is also not clear. We don’t understand the team, what is the responsibility of each member and do they have relevant experience to fulfill this project. So I strongly disagree that given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 1, "q2": "There are some indicators to measure the success of the project. However they are quite difficult to measure and evaluate. They also don't have any link with the detailed plan. The proposer has also not determined the success of the project clearly. Thus it will be very difficult for the community to audit the progress. So I strongly disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 1, "assessor": "z_assessor_1588", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The team behind this proposal intends on forming a welcoming “committee” open to everyone new to crypto and Cardano, that would guide them and teach them about everything Cardano, and would keep them safe from the possible scams that are popping up in the space.\nThis is a grand task, but there is no one entry into crypto and Cardano, where the welcoming committee can stand to welcome and guide the newcomers. And the number of people joining is getting larger by the day and as such, the idea of a welcoming committee does not fit into the space. \nOn top of this, the proposal is not very in-depth formulated, it does not describe in detail how this committee will function, who the members are exactly, what role their NFT drop has in all of this etc.", "q0r": 2, "q1": "There is no timeline described in this section, and the detailed plan is lacking. There is a repetition of what the proposal is about, but no comprehensive information on how the project will unfold and how long they evaluate the project will take, and what steps are going to be implemented and in which sequence.\nAs for the budget question, they have altogether avoided to answer it, they have provided no context, numbers, details regarding the amount of $100000 they are requesting.\nThe have not provided details regarding the team members, just mentioning that they “are established within the Cardano space” but have given no name, no skills, no social profile links etc that would give trust to the community in their expertise.", "q1r": 1, "q2": "The proposal has no information regarding how the progress of the project will be measured. “We will be held accountable by members and the community within Cardano” is their answer to this question, but that is implied by the receiving of funds, so the answer they should have provided is how they will be held accountable.\nThe success description is highly utopian. Taking all the time in the world for a single individual - “We would then assist them for as long as they need” is not feasible in this context at all, and I would suggest to the team to reconsider this step.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is an interesting idea, but the writer/s \n concept needs some work. Using social media to share facts about Cardano is valuable suggestion, but it's not encouraging locals to get more involved. As well as that, their budget of $100 000 is unreasonable for the job they want to do.", "q0r": 1, "q1": "The proposer/s haven't included a detailed plan of how they will reach their goal. They also haven't explained what each bit of their $100 000 budget is for. Overall more detail is needed into how they will get people involved, planning being able to achieve their goal of assisting people with Cardano.", "q1r": 1, "q2": "It is hard to audit the success of this project because there is no major success point and there is no finish for the project. Since there is no detailed plan, then it will be tough to follow and check the success of their idea to give help to people using or trying to use Cardano.", "q2r": 1, "assessor": "z_assessor_585", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is aligned to the challenge by identifying that surfing for simplified information on blockchain and cryptocurrencies to understand the technology and it product had been difficult. A hub is therefor needed to make it easier to reach many people. \n\nHowever, the solution to the problem is not well captured to understand how the solution is succinctly addressing the problem. ", "q0r": 3, "q1": "There is no single information on the team members and the budget also has no break down on how the funds will be used. \nThe proposal requested amount is huge and exceeds the 5% of the total Challenge budget.\n\nAgain, the proposal did expressly state the activities to be carried to address the problem.\n\nThe proposers should break down the budget in details and have action plans to achieve results. ", "q1r": 1, "q2": "The accountability process is not clear and the information provided have no KPIs to be used to evaluate the proposal. \n\nThere is no sustainability plan of the proposal to continually help build and maintain the hubs or project", "q2r": 1, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer/s have a good vision of what hey would like to accomplish, and it seems they have a passion for educating people against scammers in the crypto currency world. I have seen myself that there is a tremendous need for this, because the moment you use the word crypto, Bitcoin or Blockchain, people think \"scam\". So yes scammers have done tremendous damage to the system, and setting up something where people can be educated correctly about the facts is really necessary.  I believe this is in line with the Challenge Brief and will help grow the Cardano Ecosystem. ", "q0r": 4, "q1": "The proposers do not really give much information around their specific team members and each one's skills or experience. No linked-In profile links are provided, and would have helped to build confidence for the voters in the teams skills and ability. They ask for USD 100 000 which is 20%  of the challenge budget, and is more than the preferred 5%. I would like to suggest breaking the budget down into more specifics, like how much to buy the land in the Metaverse, cost of setting up the virtual Hub etc. Try and stay below 5% of the challenge budget, by breaking the project into smaller versions. Provide your full vision, but have the proposals submitted in stages. Set the stages out, each one with its specific budget breakdown.\n\nMake sure to include a detailed implementation plan, actionable tasks and a realistic time table. Specify the resources that you would need, and set costs out in your budget for these.\nThe vision is good but very broad and to be successful in getting funded should be broken down in smaller projects.", "q1r": 2, "q2": "Unfortunately no roadmap with milestones are provided in this proposal, or KPI's. There is also no way specified how the community would be able to track progress. In your next proposal set out a road map  with milestones. Also break down the project into smaller project proposals, first achieve your step one, and then submit for the next stage, building trust in the community, whereby future proposals might be funded easier. Be clear on how the community will be able to see progress of this project. This is a learning experience. Goodluck, hope you commit and do well.", "q2r": 1, "assessor": "z_assessor_795", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We intend to become a welcoming committee, to guide and fast track people into cryptocurrency in a safe, responsible way.", "experience": "A team of 6 members, with combined tenure in the Cardano ecosystem. Many of us have been involved with crypto for multiple years and have had difficult times within the learning process. We want to share our experience with people so they can avoid some of the mistakes we made."}