{"id": 400530, "author": "defidiscussions", "title": "Networking Events LatAm EXT", "url": "https://cardano.ideascale.com/a/dtd/400530-48088", "category": 26439, "amount": 30000, "description": "Our team wants onboard more countries in LatAm to contribute more skills and diverse ideas to the Project Catalyst community and cardano", "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Local events are always a great opportunity for connection and making the community stronger. Many people still haven´t heard of Cardano and events like this will spread the word out, a huge must for Cardano´s development", "q0r": 5, "q1": "The team is big and knowledgeable, some of which are known and active members of the LATAM Cardano Community, the proposal shows indeed evidence in LinkedIn profiles. The budget asked for seems sufficient to do the events and the timeline is clear. High probability of feasibility\nPD: Waiting for the Buenos Aires events! There are already some going initiatives on BA events in the community, suggest you ask around to co-organize, if its in your interest (B.A Cardano Hub, Cardano Buenos Aires Blockchain, and probably many others)", "q1r": 5, "q2": "I would write on the proposal where some of the evidence will be provided, social medias, Discord group? Where will the community be able to audit the process. You could also add what are your Outcome KPIs, which need to be measurable in Volume and Time\n\"For e.g.: 100 Attendees for events by Month 7th\"", "q2r": 4, "assessor": "z_assessor_1190", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The project is taking steady steps to build the Cardano community in South America, with the advantage of being indigenous, you understand what the community needs. This is a continuation of the projects funded in F5 and F7, please provide the communication channel you are building the community on. The project has challenges that depend on the success of the \"Networking / Education LATAM\" project in F7, I would love to consider and support, please provide the results achieved so far to the community yes for more accurate assessment", "q0r": 4, "q1": "With events, attendees and event content are very important, can you explain more clearly how you find and connect event participants? At the same time, whether the event content is the most interested when the budget for this is only 300$. Project manager Gavin Briggs Perez has a Linkedin media channel with only 10 followers, very little activity. CEO Jose Velazquez has a Linkedin media channel like it was just created. For a team that specializes in organizing events, this does not convince me", "q1r": 2, "q2": "The criteria you give will be listed after the project is completed. Let the community know some quantifiable criteria as the project is in progress, in development. I can suggest such as: email confirmation of location rental, document The criteria you give will be listed after the project is completed. Let the community know some quantifiable criteria while the project is in development. I can suggest such as: email confirmation of rental location, document files, social channels on which the community is active... And please provide documents about funded projects in F5 and F7 , I see you mention this a lot, this is the strongest confirmation of the team's ability to work", "q2r": 3, "assessor": "z_assessor_1544", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Impact / Alignment\nWe have just launched our F7 project “Networking / Education LATAM”, as we received funding last month. We have already had our first networking event in Cuenca, Ecuador ahead of schedule and have planned out our events in Ecuador for the next year. We have partnered with Ayllu who has been producing the course we are advertising in our events.\nFeasibility:\nA very small amount of money goes a long way in the areas of South America in which our operation resides. In regards to our linkedIn accounts, it is true we are young, many of us have finished college in the past couple of years. In that time though, we have accomplished much and expanded our skills quite a lot. We haven’t used our linkedIn accounts much since college because most of us have been working steady jobs since, again, we graduated only a short time ago.\nAuditability:\nWe would like this to be taken down as we agree and will implement these changes to our project. We already take lots of photos of our events for both our website as well as for proof of execution. We will now also record and submit documentation that proves our events are taking place as the commenter suggests."}, {"q0": "I think that this proposal is really interesting and is in line with the spirit of this challenge. The proposers want to expose Latam students to the catalyst program in order to create the ultimate solutions for their countries, by submitting proposals. If they can execute properly, this will add value to the cardano ecosystem. So I can confirm that the goals of this proposal align with the outlined challenges settings. For that reason I can give a good rating on the impact of this proposal.", "q0r": 5, "q1": "I’m not really confident in the feasibility of this proposal. Although the proposer has included some good information, such as the team members linkedin profiles, they didn’t include a timetable to complete the work. Furthermore I’m not really convinced about the budget breakdown. I think that the proposer should improve the budget breakdown by grouping items together to make it more readable. In addition to that, I suggest to the proposer to create a plan that will outline all the steps needed to achieve the goals. As the proposal stays right now there is no detailed plan of execution. Altogether, I think that the proposal can be improved by working on the feasibility.", "q1r": 3, "q2": "This proposal doesn’t include a roadmap, which is huge for the auditability. I suggest to the proposers to add a roadmap with milestones and a time horizon for achievement. This will permit the community to track the progress of the proposal. Furthermore, I suggest to the proposers to add stronger metrics/KPIs that define the success of the proposal. I think that the proposer should set some expectations in regards to the metrics. Altogether, I think that this proposal has the potential to have a good impact, but it needs improvements on the feasibility and auditability departements. All my assessments and judgements on this proposal are based on my digital marketing background which is my area of expertise.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal aims at onboarding more members from Latin American countries by creating educational content and networking events to help connect students and guide them to be active members of the project catalyst platform. This is a great way to onboard new members and share information about the ecosystem with new members. If funded, I think this proposal will have a colossal impact on the Cardano ecosystem. ", "q0r": 5, "q1": "The proposal outlines a detailed budget with realistic and identifiable items that will help the proposal achieve its aim. The team has proof of experience and skills needed to implement this project. I think money won't be wasted if this proposal is funded.", "q1r": 5, "q2": "Even though there is little information on the timeline of the proposal, the defined success and Key metrics are clear and tell us how to measure the project. Marketing educational content and events will help the community to follow the progress of this project, thereby making it easy to audit. ", "q2r": 4, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Students in LATAM who are already being educated on cryptocurrency and blockchain tech should be introduced to this community and guided.", "experience": "Defi Discussions LLC partnership with Techademia, International Logistics expert for Venues rentals, counseled by Business Advisors, Marketing advisors, and Deans of Universities, F4-F7 Project Managers for networking events in PY, EC, ET, AR, and BR, Multilingual Resources"}