{"id": 400521, "author": "ldjatsa", "title": "French West Africa Outreach", "url": "https://cardano.ideascale.com/a/dtd/400521-48088", "category": 26439, "amount": 16000, "description": "There is no Cardano community in the French West Africa. People lack awareness of the blockchain solutions. Cardano could gain more grounds.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is great and the proposers have successfully identified a problem within the challenge that needs to be solved. It’s about filling the gap of the lack of awareness of cardano  in the french speaking west african community. The proposer has made it its mission to educate this community by eliminating the language barrier as well as communicating through different channels. This will certainly add value to the cardano ecosystem by onboarding new members to the community. Furthermore, the goal of this proposal is in line with the challenge settings. In addition to that, this proposal should be able to scale in future challenges. They have also detailed all the steps necessary to successfully achieve their goal. Altogether, I believe in the successful implementation of this proposal.\n", "q0r": 5, "q1": "I have high confidence in the feasibility of this proposal. The principal reason why I think that this proposal can be successfully implemented is that the proposer has already built a youtube channel that provides great educational information on the cardano ecosystem. With a right boost, I think that they can do more, eventually with online and offline meetups. However, I suggest to proposers to make improvements on the redaction of the proposal. The first thing to do is to add linkedin profiles of the team members. Moreover, I suggest breaking down the budget a little more. Other than that, they have provided a timetable of 6 months to complete the work, which is good.", "q1r": 5, "q2": "This proposal is auditable because it includes the information necessary to track its progress. They have included a roadmap with milestones and a time horizon for achievement. They have a window of 6 month to achieve their goal. I advocate for a period of 12 month which to me is a good timeframe to measure progress. Besides that, they have provided some KPIs that, I think, can be also improved. Altogether, I think that this is a good proposal. ", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I think the idea is good and fits very well with the objectives of the challenge, although it could be a little more specific in relation to what subjects will be addressed in the project to bring knowledge about Cardano to the chosen target audience. The purpose here is to translate content relevant to the Cardano ecosystem into French, as according to the proponent most people in Africa think that blockchain is synonymous with betting on cryptocurrencies. I think this reality is quite possible because where I live the situation is similar, so it's really very important that we work to undo this stereotype. However, it gets a little confusing how this process would be done. Face-to-face and online meetings will be held; Catalyst School documents will be translated (which is very positive, as they have a great repertoire so it makes more sense to take advantage of what already exists than to create explanations from scratch; some sort of partnership will be made with the WADA group, which is another well-respected group on Catalyst for having several projects underway in the recurring challenge on Africa, however, it is not explained so exactly how this partnership would be established. provided / Adoption of Cardano apps will be promoted / 24 successful events will be held in 6 months), it also tells us exactly what topics would be covered in those events. However, this is done quickly on the topic of feasibility. Thinking more about Therefore, I believe that at first they would be more general concepts such as, for example, what is blockchain, what is the difference between Cardano and the others s blockchains, how to create a digital wallet and etc; and then there would be more specific topics for the more technological members, say, of the groups that are intended to carry these translations. It would be very positive if the tenderer had attached, for example, some documents that she intends to translate from the Catalyst School. Now, speaking more directly about whether the proposal aligns with the challenge's request, I sincerely believe so, because here the intention is to popularize Cardano among a specific audience and that is precisely what the proposer does. She will work in the target audience's mother tongue, and this will certainly help a lot in the learning process. I think this proposal also speaks to the challenges of Africa and the new members on board. An observation: I would very much like the video that was attached to be subtitled, I would certainly be able to understand in more depth what would be being done here if this had been done. \n", "q0r": 5, "q1": "I believe the script could have been a lot more detailed. Starting with the fact that the bidder divides the period of time into blocks of 3 months, delegating various activities that would be developed in that period of time. I don't think this is the best way to organize the timeline because the intervals chosen are very long, so we don't understand how these activities would be organized within the quarters. I am also in favor of a greater detail regarding the activities presented. For example in the first quarter there would be an “Ada donation”, but to whom and why? Regarding the workshops, the proponent states which subject would be addressed in each, but things could have been informed such as: the duration of the workshops (both online and face-to-face); how would the daily schedules be organized, for example, would it be a lecture followed by a coffee break and networking? Workshop topics should also be better arranged. For example the following topic, present in the second phase of the project: “More details about the Cardano blockchain”. What details? How in-depth will be done? How will people who are involved in the project be captivated to participate? Now let's move on to the next topic of analysis: the budget. A total amount of 16 thousand dollars is requested, this amount, in my opinion, is quite fair for the number of events that will be promoted and also for the time the project will last. I just think the use of this money should be explained more. For example, $10,000 is asked for “salary for local event organizers and workshop donors”. But how many would these organizers be? What would be the salary value of each of them, individually? How many hours would they work? That way we would know the price of their working hour. $5,000 would go towards “Event Logistics, Venue Costs, French Materials, Food etc” – that's a lot, so we'd need to understand how much would go to each part as well. So I think that part of the feasibility really deserved improvement. And finally, speaking of the team, I believe that this part is average because we have more information about Laurentine than about Kodjo, ideally we would have as much information about one as about the other. It would also be important that they made their linkedin profiles available so that we could see their past experiences in practice. However, there is a certain confidence in the duo, since we have some information about their professional areas and a small curriculum of each. I conclude then that the feasibility is, but could be better detailed in general, especially in the part of the script and budget. \n", "q1r": 3, "q2": "I think the auditability of the process is very superficial. The proponent points out that this would be measured by producing an average of “20 active Cardano users every month”. However, in my view, monitoring the progress of the project is more complex than that. Let's see, we have a series of tasks to be carried out each month, so the ideal would be for the Cardano community to be able to audit each one of them. A series of workshops would take place, so another point we need to monitor is how each of these events took place. For this, it would be necessary for some more details to be provided, such as: what activities each month (as I said before my evaluation); the exact schedule of each workshop, in addition to the teachings themselves (as I have already mentioned). It would be important that somehow the translation of Catalyst School documents was also evaluated. So I think it's a good idea that any member of the Cardano community who is interested and willing to audit this proposal do so, preferably speaking English and French to also check the document translations part. This person could monitor the development of activities, both in terms of tasks (what would be done) and goals (what would it be done for, and here comes the metric of 20 new community members per month). Now speaking of the final results, I also think that the proposer's suggestions were superficial, unfortunately. I think that because it is based a lot on numbers: how many workshops took place and how many new active members for the Cardano community were gained. This is important, but it is also necessary to analyze more qualitatively the consequences of this project. How are workshop students engaging with Cardano? Are some working as CAs? Are those more techies delving into how to build smart contracts, create Dapps? What is happening to these people? I think that as this information was collected, automatically the impact of the project on our blockchain would already be perceived. All this information needs to be conveyed in a simple and concise way to the entire Cardano community. Finishing my auditability review, I really think it needs to be improved, more in-depth in several aspects. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1, "reply": "The CA says that we the proposers should provide the community with monthly report and we find this to be irrelevant. He says that the feasibility is very basic. But we gave clear details of our roadmap and clear details were also given as to how the budget would be used. "}, {"q0": "The solution of the proposal is important to the cardano particularities especially ensuring information reaches as many regions, people and places irrespective of the language barriers. This proposal is key to reaching French speaking audience of the Western part of Africa which also has about 8 Francophone countries. This will help expand the cardano ecosystem and value to growth catalyst school", "q0r": 5, "q1": "The team has experience in the WADA community and highly matured in the Cardano ecosystem to grow the the Francophone region. It also seems the team has already started hosting education events on cardano blockchain and an expansion is a great deal to expand the growth and rope in more and new members to join the ADA community.\n\nLooking at achievable detailed activities with a reasonable timeframe, the budget is equally reasonable for the proposal", "q1r": 5, "q2": "The KPIs are clear and the metric to measure success are clearly stated. The information is making good projections of onboarding new members and ensuring accuracy in projecting the reach within time. This makes the evaluation easier. \n\nShould the proposal win funding, a sustainability framework should be put in place to keep the initiative running the live of the project funding ", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Host French language events and provide educational workshops to inform the communities about the Cardano blockchain solutions.", "experience": "hosting multiple in-person and online Cardano Project Catalyst workshops with French audiences\nAssisting new members in joining the catalyst community\nTranslating documents for Catalyst School\nAssisting WADA with simultaneous interpretation during Cardano online workshops"}