{"id": 400955, "author": "dan.mercurius", "title": "🛫 On-Boarding ALL stakeholders", "url": "https://cardano.ideascale.com/a/dtd/400955-48088", "category": 26439, "amount": 22200, "description": "Cardano community sees Catalyst as a separate entity, thus many stakeholders are neither on-boarded nor engaged.", "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 323, "q0": "The proposal would be within the challenge goal, and I think that this proposal probably will increase adoption community ecosystem.\nThe statement of how problem is to be solved is explained with examples and use case.\nHowever the objective of the proposal is interesting, but I think it's important to improve details about the solution for the challenge and I suggest to define other use cases.", "q0r": 4, "q1": "I think that the proposer teams has the necessary experience, because it’s clear the experience in general for the people with description, and there are links to professional skill (eg. Linkedin profile). \nThe solution proposed would be a meshing of communication platforms, and the proposer describe the complete solutions or other milestone within 12 months.\nRoadmap and milestones (incl. time horizon) are described. The budget provided is very general and therefore I cannot say whether it is appropriate or not, but the total budget is inline with the chalange. There are poor details how the budget is going to be spent.", "q1r": 4, "q2": "Only simple KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…)", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6613, "q0": "This proposal sounds like a good idea to me. My only concern is that maybe it may fit better in a business challenge. As far as I can understand, the proposal aims to provide services such as onboarding proposers and helping new proposers to write better proposals etc. I don’t see exactly how this proposal fits into the challenge. However, the idea is good and the proposal is well written. Furthermore, I think that a good execution of this proposal will add value to the cardano ecosystem. It’s true that many members of the community can have a great idea but don’t know how to translate it into a good proposal. For that reason, I can give this proposal a good rating on impact although I believe it should be in a different challenge.", "q0r": 4, "q1": "The proposer has included all the necessary information for a successful implementation of the project. They have provided team members  information such as skills, qualifications and links to their linkedin profiles. However, the budget breakdown should be more detailed. I suggest to the proposers to improve on it. In regards to the execution, they have included a roadmap with milestones of 3 month, 6 months and 12 months. Altogether, I have high confidence in the feasibility of this project based on the information provided by the proposer.", "q1r": 5, "q2": "Since the proposer has provided a roadmap with milestones and time horizon for achievement, auditing this project should be relatively easy. In regards to the metrics that define success, the proposers should make improvements as this is too broad and not precise. Maybe the proposer should measure the number of proposers onboarded in the catalyst program or something related to the end goal of the proposal. There is definitely room for improvement here. Altogether, I think that this proposal has good chances of being funded. The only major risk that I saw is that it may not belong to this challenge. Other than that they only have minor improvements to do\n", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6855, "q0": "The proposal intend to provide an alternative option to people who would like to board, but not necessarily through the Idealscale format. This increases the potential of reaching out to more people who would be willing to join the ecosystem, which has a direct impact to the ecosystem and may scalable since the proposers would like to form hubs with small groups of people.", "q0r": 4, "q1": "The idea is to merge these three platforms and interconnect them: github, discord, and twitter. That procedure would help find the information centralized as than running on multiple one's as it's till currently the case.\nI don't have expertise in devs or programming, but my Project management experience would still help me assess this proposal as it aims in attracting people to the Catalyst ecosystem.\nThe budget of this project is very summary that it doesn't allow assessors to define in details which items would be covered", "q1r": 3, "q2": "Proposal refer the community to audit the progress by visiting the GitHub as work goes on. But I would see the importance of having another option of audit being offered to the community, for example: regular updates through the current existing Catalyst platforms.", "q2r": 3, "assessor": "z_assessor_478", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "On-boarding and launch protocols that make sense and engage in a meaningful & fun way", "experience": "Entrepreneurs with combined 20+ years experience form IT and risk industriesPlutus Pioneer Studentmultiple funded proposals3+ years combined experience in Catalystvery active in twitter spaces"}