{"id": 401122, "author": "afia", "title": "Cardano Information Centre", "url": "https://cardano.ideascale.com/a/dtd/401122-48088", "category": 26439, "amount": 16600, "description": "Cardano/Catalyst related materials are not localized for the African context, access to such materials is not known to majority of Africans", "f6_no_assessments": 20, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal plans to instill knowledge about the capabilities of Blockchain and Cardano in particular to the people of Ghana. There is no doubt that America and Europe make up most of the Cardano Community and Africa is clearly has untapped potential. The proposer briefs the community about how they plan to tackle this hurdle. The plan to set up an information hub, host events and meets, and conduct workshops and exhibitions are proven ways to indulge the people and make them aware of the Cardano ecosystem and its capabilities. However, the team makes note of the possible risks and challenges involved but provides no plausible solution for those. Probably, in my personal opinion, the involvement of trusted entities such as Banks, Government bodies could draw more people cause they bring a sense of trust and dependability along with them. However, the plan, on the whole, looks promising and the funding will be the essential key to drive it in a steady and fruitful manner.", "q0r": 4, "q1": "The team makes a clear plan on how it proposes to achieve its goals. The timeframe of 3-4 months lies well within the expectations of campaigns requirements and has all the traits of reaching people and becoming an \"MVH\" (minimum-viable hub) well before the next funding rounds, in case the team plans to expand its reach. The funds requested are also well within the boundary set by the challenge which is not more than 5% of the total allocation. The team makes sure it provides the community with a detailed plan about what the community can expect on a monthly basis and at the end of 4 months what would be achieved, and as a reader, the plans look reasonable in every way. The team put together to bring this project to life looks promising too. The 5 member team has a variety of people in it and almost covers all fields that a newcomer might need a mentor for. And the involvement of a translator makes the plan more accomplishable. ", "q1r": 5, "q2": "The proposer makes a brief note of all the metrics that can be used during the auditing process. These metrics are very much in line with the challenge's requirements. The successful setup of a self resilient information hub is clearly the biggest metric that can depict the success of the proposal and quite enough to help the community see its success. But the team makes a mention of achieving all these within the time frame of 3-4 months and I personally feel that it would be a little overestimated and the numbers would not be great for such a short span of time considering, the target audience is from Africa, which is still largely under-exploited. Probably the metrics would not sum up to great numbers. Being a new proposal on the catalyst, I feel the proposer should plan to extend their plan to a bigger time frame such as 8-12 months as expected in the campaign brief to make sure quality information is imparted to people and a lot of patrons are retained and trained efficiently to make the metrics more attractive during the audit process.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "This proposal effectively address the challenge of scaling up the Cardano Community in Africa.  This breakdown of how they will execute this project is detailed and beneficial for the African audience it intends to address.  They have addressed the first three months with a progressive narrative of how each month will move the project toward its goal. In addition, the proposal mentions that after the three months, they plan to have volunteers man the center for an inclusive, collaborative community in the centre that can speak to the Cardano blockchain and give education.  It may be helpful to detail the type of education that will be given in the centre.  Will it focus on new-onboarding of members? Will it teach wallet on-boarding and basics on how to set it up?  Will it offer DeFi education to their population?  Will it review the CNFT ecosystem?  It is helpful to know what type of the education will be disseminated and how will the centre give the training to the volunteers to ensure success of this challenge. ", "q0r": 4, "q1": "The proposal does an excellent job to showcase the team members with detailed description of each team members experience, which ensures that this team can accomplish the goals outlined in this proposal.  The foundation of the experience that the team brings to this project gives an aura of trust and credibility to the project and the ability to successfully implement this project.  The proposers. could consider Including a robust curriculum or training program for  volunteers to be able to properly acclimate and educate new comers to Cardano.  This will validate the knowledge that is being shared  by volunteers which includes a  potential written \"educational packet\" so that teaching is consistent and predictable for each new comer.  This proposal has a substantial foundation for implementing success!", "q1r": 4, "q2": "This proposal has a multi-faceted system fr ensuring that they can audit the progress and success of their proposal.  They are proposing metrics from newcomers who use the centre, they number of centre members who will submit Catalyst proposals.  It is recommended to consider using feedback from newcomers as a way to improve educational information that is shared at the inception of the centre.  Progress is ensured with reliable feedback! Good Luck!", "q2r": 4, "assessor": "z_assessor_1185", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "*** Advantages of the project:\n-The project has been implemented and the center has the most basic things such as tables, chairs, wifi, projectors, standees. The office also has a logo and signboard on the outside for everyone can see.\n- The project has specific Offline Marketing solutions such as: organization of mini exhibitions and workshops to showcase the application of blockchain technologies or create flyers, stickers, pull-ups, brochures, key rings, badges, banners etc, will be developed in different languages ​​for ease of understanding\n- The project helps Ghanaians to easily access information and knowledge about Cardano and Blockchain.\n- The project is a channel to help Cardano be promoted to Ghana. Besides helping to train a knowledgeable community to suport Cardano in the future in Ghana.\n- The project also gives Ghanaians who are passionate about Blockchain a place to share knowledge and learn from like-minded people.\n***Projects that need improvement:\n- The project has not specified who is the target customer group? What characteristics should they have? Avoid wasting resources by communicating to those who do not need it\n- Online marketing solutions are still general and not specific. Online marketing solutions need to be more focused with more specific solutions to reach more people with less cost.\n- The approach to removing the fear of Ghanaians about cryptocurrency projects is not really effective enough.\n***Suggestions/Tips:\n- The project needs to identify the target customer portrait:\nWhat kind of people does the project want to communicate to? For example, only communicate to people who love technology, new technology, people aged 18-40. The more specific, the higher the marketing effect will be.\n- There are many effective online marketing solutions such as: Building a knowledge sharing channel on youtube in local languages, building a facebook group to share knowledge, telegram group...\nThis will help the project reach more people at a cheaper cost.\n- The direct approach solution has eliminated the fear of Cryptocurrency projects that will not be effective if they do not have enough information and knowledge about Blockchain. The project needed a tool to provide knowledge on a regular and long-term basis to the client. When customers have enough information and knowledge, they will be easier to accept, even actively contact to ask to participate. The specific tools here are online marketing channels. Online marketing channel helps the project gain the trust of customers and will break their fear about Cryptocurrency projects. From there, it will be easy to build a strong and long-lasting community", "q0r": 4, "q1": "- The project has a clear time allocation plan for each month\n- The work to be completed in each stage has also been specifically listed\n- The project budget has detailed use purposes\n- The project offers specific options to build community such as seminars, workshops, brochures as well as handing out small souvenirs such as stickers, key rings, badges...\n- The proposed team has members with extensive experience in community building, project evaluation, design and translation.\n- The experience and skills of the team are fully capable to execute the project well\n***Projects that need improvement:\n- The project has not stated what knowledge will be trained for different levels of knowledge. Each person will have different understandings, different orientations and will need different training knowledge. If the project can build many modules for different levels of knowledge, the effectiveness of the project will be much higher.\n- The time to allocate the first month just to set up the office is a bit long because now the project has completed the basic setup\n- The project has not yet stated a plan to translate, build a huge library of Cardano documents for the local community to access. This is an extremely important work item that the project needs to perform and details the roadmap.\n- There is no plan for future community care and development\n***Suggestions/Tips: \n- Reduce office setup time in the first month\n- Increase time, budget and people for translation because this work determines the success or failure of the project. Besides, Cardano's amount of knowledge is difficult and a lot of information is constantly updated. The translators must be people with blockchain technical knowledge. Therefore, it takes time to find and train the suitable people.\n- The project needs to have a specific plan for maintaining and taking care of the community in the future: When the community is expanded, the amount of work will be more and there needs to be a care process,\nprotect the community against fraudulent information.\n- Build information packages suitable for each level: Beginners, people with basic knowledge, people with in-depth knowledge...", "q1r": 4, "q2": "- The project has built a website to provide information to the community\n- The project listed 6 indicators to be able to evaluate the success of the project\n- The project has specific images in Offline training sessions\n\n***Projects that need improvement:\n- There is no specific commitment number for each indicator in each period\n- There is no tool to measure the indicators\n***Suggestions/Tips:\n- The project needs to provide specific commitment figures for each indicator\neg: After the first month of operation, how many people will come to the center in 1 day. After 1 month, it will calculate how many % are new customers, how many % are old customers, from which there will be a specific way to develop the project.\n- Online measurement tools can be easily built on the website with the number of visitors and registrations. For Offline, you can take notes and take pictures.", "q2r": 3, "assessor": "z_assessor_1192", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has a good connection with the objectives of the challenge.it is a great idea which seek to build upon a funded idea and has clearly outlined it importance or value addition criteria. Its strategies will seek to bring in new people in cardano and catalyst. In seeking to reach out to the youth in tertiary institutions, it will provide a platform for education, adoption, development which will have a ripple effect on the future of cardano. Great work!", "q0r": 5, "q1": "This proposal has provided evidence of the relevant skills set needed which further demonstrates a good understanding of what is needed to get it done. One other goal thing is that the proposal spells out the clear time line to execute the project. What I don’t understand very well is what will go into translating into French and other language. I think the budget is too small for translation. I hope it will not affect the aspect of translation. I like the detailed of your budget that it gives the resources needed for an information Centre. Good work done.", "q1r": 4, "q2": "There is a great road map provided for the execution of the project which is set for 4months. The proposal has provided key metrics to measure success but I wish that some estimates were provided. It will be great if the proposer provides some estimates based on location he/she is seeking to establish. This proposal has demonstrated a good understanding of the problem of the challenge and solution is equally a great one.", "q2r": 5, "assessor": "z_assessor_728", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is addressing the challenge with much focus on creating a resource hub for locals to familiarize themselves with cardano blockchain/particularities. Resources materials in hard copies are important as that of online. Due to the cost of internet data, many Ghanaian locals may not spend much time to download cardano/blockchain materials.\n\nThis hub seeks to make the hard copies of the soft copies freely available for consumption to trigger interest to build  more conscious Cardano community.", "q0r": 5, "q1": "It looks the team is well experienced and much committed to ensuring locals are not left behind of the Cardano flight. The action plan is clear on what to do and when to do it. It is good to have different languages to avoid the language barrier to access information and this project is addressing that. \n\nThe budget is reasonable and looks the proposer has made available an infrastructure to create the center. Such a cost taken up by the proposer. This is a good contribution to the Cardano community to support the information delivery agenda. ", "q1r": 4, "q2": "There is clear path to guide for auditing. There is also a sustainable plan in place with revenue generation plan through the co-working office space.", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem described in the proposal addresses the challenge. Providing a physical space where people can access Cardano blockchain is not only making impact on the target audience but also to Cardano blockchain as a whole and that for me has so much value to the ecosystem. This already makes it easy to ascertain the alignment of the metrics and goals of this proposal with the challenge (there is an alignment). This proposal also has the tendency of reaching out to many people in the future, and that’s a big plus.", "q0r": 4, "q1": "With the information provided about the team and the relevant experience described, I believe the team possesses the required skills and knowledge to  implement the proposal. I see that the budget is well prepared and broken down into identifiable items and with this clarity I can boldly say the budget is reasonable to achieve the outlined goals. There is also a good plan and definite time table for the execution of the project, I appreciate that provision. It is a good effort for adding the challenges and risks that may arise during the execution of the project.\nKeep up this quality information even in future proposals for easy feasibility assessment.", "q1r": 5, "q2": "The roadmap is comprehensive and well described and also the milestones and time horizon are well presented. Seeing to a fully equipped and vibrant information center with some permanent and volunteering staff that offer blockchain education is a good indicator of the desired outcome. The metrics/KPIs were well chosen so therefore I am sure that they are good indicators for the evaluation of success, as the chosen outputs considers the number of people patronizing the center, however I advise that, you should be able to foresee the total number of people at the end of the time period so that there can be a better appreciation of the metrics.\nAlso the target problem here has been  adequately described and hence I believe the solution proposed is strong enough to address the problem. ", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal raises the issue that the Cardano/Catalyst-related documents are not localized for the African context, with the majority of Africans unaware of being able to access such documents. So the solution for this is to set up a Cardano hub that provides a physical location/space where anyone can access localized Cardano/Blockchain-related information for easy understanding. Propose indicates a legitimate problem and then provides an idea of a valid solution. Proposals fit the challenge.\nThe proposal presents some potential risks, for the extent of this group, I believe they can be overcome.", "q0r": 4, "q1": "It's great that the plan is presented in such detail and easy to understand. This proposal provides a time frame with all the stages and actions to take. The proposed $16,600 budget has been broken down, making it easy for the community to see what the costs are going to be spent on. I like the level of detail mentioned in this proposal, it reassures me that the people behind the proposal know what they are doing.\nWada has consistently successfully provided value to the Catalyst community. Team members are people with many years of experience in the field of information management and development. The team involved in this proposal has 5 members with roles and experiences that I consider appropriate to implement this proposal. We can also easily find out their information through the links that the offer provides. Based on the above information, I am confident that the team will successfully implement this proposal.", "q1r": 5, "q2": "A very detailed plan is presented, the proponents are very transparent about themselves and the amount asked is very low, which clearly shows the honesty and competence of the team. An entire section with easy-to-follow KPIs along with a list of plans after the initial 4-month period increases the transparency of the project. The success of the project is also very well described and most likely goes according to plan. Although this is a new proposal that has never been funded before, I think with a clear plan and solid team, it is very likely that this proposal will receive funding from fund 8.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal adresses the lack of accessibility of the Cardano ecosystem in parts of africa and proposes a solution that will not just adress the challenge, but also adresses the SDGs and the fund goals. Being organized by people versed both in Catalyst, Cardano and blockchain in general it will sure have a mjor impact. Educating people about the matter, it will also have a good scalability impact by potentially bringing on more competent people.", "q0r": 5, "q1": "The proposal seems very well organized. It has a credible timetable, diversified organisational steps and purchase lists, a concrete, fine-grained, realistic budget and a solid contingency plan. the organizers are well-known and active in the community and have already proven in the past that they are able to deliver on their proposals. As a project engineer, I myself know the setup of a good project when I see one, and this one indeed is already well-planned and feasible.", "q1r": 5, "q2": "The project has a clear problem statement and points out a clear, comprehensible and tractable solution to it. The success metrics are well-formulated tangible and make it easy to audit the success of the project. The roadmap will also make the progress quite auditable. Well done, looking forward to see the proposal in action.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Building/enacting a physical space/location where cardano/catalyst related materials can be accessible by all Africans is a very laudable vision which I personally believe will enlighten the cardano ecosystem and reveal more opportunities to every person[s] who encounter such materials.", "q0r": 5, "q1": "A 3-4 months plans indicates that tasks will quickly start and complete, and having gone through the bio of  the team members per their experiences could be able to meet the requirements for execution.The funds requested to build up is also reasonably outlined for the intended purpose.", "q1r": 5, "q2": "The information centre as indicated above in this proposal will be designed to store,retrieve and process informations for dissemination at a regular intervals,on demand and in accordance to the end users for a successful project. Also accessible attachments necessary has been provided to make it simpler to monitor progress stages.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I have always been an avid proponent of WADA and their mission to spread Cardano knowledge in West Africa but in this instance I had to analyse the proposal from a different perspective to better grasp their goals. On first digestion of this proposal my initial question was, doesn't WADA already provide this contact point by the very existence of their office space? Wouldn't the establishment of an information centre away from the office be more in line with the Challenge's goals of, \"to ensure that we can spread as far as possible, as quickly as possible\". However, because this is a specific 'publicly open' space for any newcomers, then I have to agree it effectively addresses the challenge. I am sure enquiries made at the WADA office are not turned away, but having a dedicated space where people can get to know blockchain and Cardano specifically, will certainly add value which can hopefully lead to greater adoption.", "q0r": 5, "q1": "The WADA team have proven time and again that they deliver on proposals which had been  previously funded and I strongly agree this proposal will be no different. Their experiences are well-known and provides great confidence. The plan itself seems realistic notwithstanding any awareness of how the pandemic has impacted daily life in the region, including sourcing of materials needed by the centre. The budget total also seems in line with the expenditure for such a space but I do wonder if the single laptop purchase would be enough resource to showcase a technology such as Cardano and/or if hands-on experience with the blockchain will be possible in the centre. That said, there is enough in this proposal to see it can be delivered successfully.", "q1r": 5, "q2": "Auditability items for this proposal should be easy to measure and knowing WADA, they will likely publish the installation of this information centre on their website for others to see. It would be great if they could also include samples of their brochures and resources materials on the site for people to appreciate West African designs. I also further recommend that should any 'proposal' or meaningful Cardano pursuits arise from this Info Centre, that they themselves credit this Community Hub for giving them the opportunity. This would go along way to see the connection between this proposal and future proposals, and satisfy one of their key metrics in the process.   WADA is already a significant ally in the continent and will grow even bigger in the future that it would be nice to see how one successful proposal has led to the other successful proposals, and see organic growth at work. Good luck team.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge by creating an information hub at a community level in real life. They outlined providing accessible information in the local languages so more people understand the information on their level and give them access to a place to get in person education about Cardano and blockchain.\n\nUnder the heading “What main challenges or risks do you foresee to deliver this project successfully?”\n\nYou said “We proposed to take proactive measures to reach out to prospective participants to alleviate their fears and encourage them to attend educational sessions”\n\nWhat proactive measures do you plan on taking to alleviate some of the fear many people have when it comes to blockchain technology and crypto? \n", "q0r": 4, "q1": "The proposal outlines a realistic simple plan to execute a Learning Hub and produce materials in the languages of the surrounding community to provide quality but accessible information about blockchain, Cardano/Catalyst in Ghana. They put together a well-rounded team with members that are qualified to execute all of the different aspects of their plan. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and success of the proposal. Then only information missing is how/where/when they plan on providing the information outlined in the auditability section.", "q2r": 4, "assessor": "z_assessor_1950", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The Proposal indetify the fact that Cardano/Catalyst related materials are not localized for the African context. Therefore, a Cardano Information Center is necessary and useful for localization. Thanks to Information Center, more and more people can access Cardano/Catalyst related materials. The Information Center is generated in various models and can be widen furthermore. It is established as a place for the public to visit and learn and adopt the blockchain technology. Furthermore, the Center could also serve as a hub for outreach to the youth in tertiary institutions, workers and business owners. It can also be organized in type of mini exhibitions and workshops to showcase the application of blockchain technologies, in various sectors. However, the data and target are proposed in common, not clearly when the writer mentions the problem.", "q0r": 5, "q1": "The Writer proposes key materials to be used for communication including flyers, stickers, pull-ups, brochures, key rings, badges, banners etc. These will be developed in different languages for ease of understanding. The team comprises seasoned persons with years of experience in management of information and development. 5 members of the team are familiar with the Cardano protocol and have participated in all funding rounds. The Budget is drafted for 4 months with detail cost of equipment, information materials, transportation and allowance. It is logical and can be implemented step by step. This proposal considers 2 main challenges the proposal may face when implementing. The fear of schemes that have connections with cryptocurrency could make people reluctant and slow down patronage. Also, the people previously involved in savings and loans schemes that ended as scams could affect people's confidence, thereby affecting patronage. However, the writer also gives out the proactive measures to reach out to prospective participants. ", "q1r": 5, "q2": "The proposal describes 6 metrics to measure the success, including: The number of people patronizing the Center per day; The number and types of educational materials produced; The number of people who have consulted to obtain guidelines; The number of people joining Cardano/Catalyst platforms; The number of people presenting proposals for funding; Revenue generated from coworking space. However, I do not see the specified number of each evaluation item. This Proposal is described clearly and the problem solution method is easy to understand. ", "q2r": 4, "assessor": "z_assessor_1870", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Yes it does. Providing physical space for people  in their local language will help them to learn and understand about cryptos, cardano, blockchain and much more thing and also they can find group of people learning and growing together that will eventually increase and scale community for good.", "q0r": 5, "q1": "Yes they have very experienced team member including wada experts, CAs, vCAs, funded proposers, graphic designers. also they have very clear plan from starting from setuping office to starting the center for public in 3 months. ", "q1r": 5, "q2": "Yes they clearly mentioned their plan and timeline with roadmap how they can bootstrap this. Also mentioned all basic equipment's, development material and volunteers timing which seems very much clear.", "q2r": 5, "assessor": "z_assessor_1792", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This proposal aims directly at the challenge. This proposal identifies some problems in Africa especially in Ghana where there is no organized effort to provide targeted information on blockchain to people. This proposal suits the exact problem because it will be a great opportunity to further technologies and innovative resources that could enhance the engagements and outreaches in view to blockchain in Africa. When the Center is established, the public will be able to come in and learn about and embrace blockchain technology. This is likely to cause a chain reaction, resulting in a cascade of negative consequences.\n", "q0r": 5, "q1": ". With much detailed broken-down budgets, information proposed and with experience and seasoned persons in management of information and development, there is no doubt this proposal will be highly executed", "q1r": 4, "q2": ": With much detailed information from the impact and feasibility in this proposal, as well as the measures that the proposers will use to assess the project's performance, and the knowledge that at the project's conclusion, they seek towards a fully equipped and vibrant information center with permanent and volunteer staff attending to the needs and offering more education on blockchain and also having a repository of public knowledge on blockchain in Ghana hence this proposal can be a success.", "q2r": 5, "assessor": "z_assessor_1621", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "since the center when established will serve as a hub to reach tertiary institutions and businesses in various sectors in Ghana through exhibitions and workshops to offer opportunities for people to visit and learn to get acquainted with blockchain technology the proposal addresses the challenge effectively", "q0r": 4, "q1": "when given the requested materials and support this proposal can be implemented successfully since office space is already available, the installation and setting up of necessary furniture and equipment would not be so much of a struggle in 3 to 4 months ", "q1r": 5, "q2": "very adequate information has been provided on the budget listing every expense and, explaining in detail what will be needed and this information is sufficient to get the proposal to succeed by monitoring the number of people who are going to be reached and the number of educational materials produced it can be audited as well", "q2r": 4, "assessor": "z_assessor_1620", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The problem described in this proposal corresponds to the challenge. This is a niche proposal to expand the \"Planting Roots in Africa\" project, which will serve as a foundation for building on the successes of raising Cardano awareness and expanding Cardano community hubs in Africa. I am confident that, this project will have a positive impact on the Cardano/Catalyst ecosystem. Despite the fact that blockchain technology is rapidly growing and being adopted by many countries to aid in national development, there is still a lack of required knowledge of blockchain technology and Cardano in Ghana due to a lack of means to disseminate information about blockchain technology to the general public. As a result, this project will develop resources and technologies to engage the general public and spread awareness and knowledge about blockchain technology and the entire Cardano ecosystem. It is critical that the Center serve as a nexus for reaching out to youth, particularly students. because students are a great source of knowledge dissemination and can recommend ecosystem activities to colleagues because they are all still in training and are virtually always open to new experiences, looking for ways to advance their careers, ideal conditions for Cardano to thrive.", "q0r": 5, "q1": "Qualifications have been presented, and the proposal team appears to be well-connected in the Cardano community, with a diverse set of skills and knowledge of the Cardano protocol. This indicates that the project will most likely be executed flawlessly. Aside from having the essential experience in establishing Cardano and blockchain technology in Africa, the team is already heavily invested in the Cardano community in a variety of positions. The project's budget is clearly outlined and broken down into specifics on how the funds will be used. Furthermore, the proposer has supplied a detailed plan for how the project will be completed, via a clear roadmap with the necessary resources.. The project's proposer identified some potential risks and proposed ways to manage and reduce those risks. I believe the proposer and team will successfully implement this project to scale up Cardano's community hubs. ", "q1r": 5, "q2": "The project milestone accurately describes the strategy. The information presented, as well as the metrics for a successful project, have been outlined and make the project auditable, which I believe are good indicators for evaluating the success of opening a Cardano information center in Ghana for use by the general public, which will add innovative resources and technologies that could enhance blockchain technology outreach and engagement.", "q2r": 4, "assessor": "z_assessor_1508", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The Cardano information center is a good initiative for information dissemination and making inquiries about the catalyst and Cardano community. This will also give an opportunity to people willing to contribute to the Cardano community. The center will serve as a hub with innovative resources and technology to scale up the catalyst activities by giving out information and introduce newbies to the Cardano technology.", "q0r": 5, "q1": "This proposal is likely to be implemented due to the outlined skills of the team members and the presentation of a detailed plan and timeline deliverables. The budget stated is also reasonable and well allocated.", "q1r": 5, "q2": "The metrics and the key indicators stated are very clear to understand and measurable hence, the success of this proposal is solid and is likely to be implemented. ", "q2r": 5, "assessor": "z_assessor_1505", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The main objective of the proposal is to provide a practical space where anyone can access Cardano/Blockchain-related information localized in Ghana, where anyone can visit, learn and apply the blockchain technology; it fits the goal of the challenge. However, the presentations are very general, not clearly describing how it will add value to the Cardano ecosystem and how the hub can sustain itself and grow after the challenge period in the case of funding. ", "q0r": 3, "q1": "The team consists of Wada, CA, vCA professionals, with experience in management and information technology, community education, and graphic design, the right combination to take on this challenge. The proposal provides a budget that is clear and broken down into identifiable amounts, it is reasonable. The implementation roadmap is broken down into three-month parts, but the key indicators and desired outcomes to be achieved in each phase have not yet been given, such as: how many leaflets are distributed, how many documents are published. whether, how many people use the information facility of the center... ", "q1r": 3, "q2": "The roadmap information provided is not sufficient to assess progress; although the proposal provides some indicators to measure the progress and success of the project, it is not tied to specific metrics; this will make it difficult for the community to audit and evaluate the effectiveness of the project. ", "q2r": 2, "assessor": "z_assessor_1457", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal address the goals very clear, and able to scale up if this proposal is success. Having an information center in a place is definitely a step up for Cardano Ecosystem. Africa is also the target of many Cardano project. However the hub might not sustainable if there aren't people who are willingly to help and maintain the Information center. With the right people this proposal might be very good for brand awareness.", "q0r": 4, "q1": "This proposal budget is good and in the range of total challenge budget. However its not detailed enough, my suggestion is to put numbers of how many flyers, booklets and translation the proposer want to create. Also Video coverage equipment is not detailed, what kind of equiipment should be put in the proposal clearly.", "q1r": 3, "q2": "This proposal setting goals without any roadmap, my suggestion is to give roadmap and numbers to know the proposer target per month. The proposer state that one of the key metrics of success is revenue generated from coworking space. My suggestion is to clear this, since cardano want to scale up community not making any business profit from the project. Free of Charge for an Information Center is a must, it will push people to come and learn about the cardano. ", "q2r": 3, "assessor": "z_assessor_1432", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal's problem solves the issue. Providing a physical location where people can access Cardano blockchain has a significant influence not only on the target audience but also on the Cardano blockchain as a whole, which I believe adds significant value to the ecosystem. This plan has the potential to reach out to a large number of individuals in the future, which is a significant benefit", "q0r": 4, "q1": "I believe the team possesses the necessary skills and knowledge to implement the plan based on the information supplied about the team and the relevant experience indicated. I see that the budget is well-prepared and split down into easily identifiable elements, and because of this clarity, I can confidently claim that the budget is appropriate for achieving the stated objectives. I like that the project has a sound plan and a clear timeline for completion. It's a commendable attempt to include the challenges and hazards that may develop during the project's execution.\n", "q1r": 4, "q2": "The roadmap is detailed and well-written, with clear milestones and time frames. Providing a physical location where people can access Cardano/blockchain related infor. is a good indicator of the desired goal. Because the chosen outputs consider the number of people using the center, I am confident that they are good indicators for evaluating success. However, I recommend that you be able to forecast the total number of people at the end of the time period so that the metrics can be better appreciated.", "q2r": 4, "assessor": "z_assessor_919", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Provide physical location/space where people can access Cardano/Blockchain related information which is localized for ease of understanding", "experience": "Wada experts, CAs, vCAs, funded proposers. Core staff of Wada with experience in information technology and management, community education and graphic designing."}