{"id": 401310, "author": "jaaf", "title": "Cardano Hub-Complex Setup", "url": "https://cardano.ideascale.com/a/dtd/401310-48088", "category": 26439, "amount": 2500, "description": "Lack of exposure leaves young entrepreneurs and students not able to capitalize on their backgrounds to get introduced to Cardano.", "f6_no_assessments": 4, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea behind the proposal is a good one, which is to provide a hub where students get acquainted with blockchain and the Cardano  ecosystem. The proposers therefore intend to create 3 different hubs in 3 universities in Tunisia and through various events and activities, introduce Cardano to the students. This will certainly have a positive impact on the Cardano ecosystem. The proposal meets the MVH principle of the challenge and is easy to scale to other universities and campuses. More information is however required on what strategy will be put in place to make these hubs self sustaining with time.", "q0r": 4, "q1": "A roadmap for implementation is presented for January to early May 2022 but this relates to one hub only and indicates that the hub is already established and has begun its activities since the beginning of the year. A LinkedIn link to the profile of the club is included which shows an event that was held in February 2022. The budget for the proposal also relates to the set up of one hub only however, the KPIs provided, which includes some metrics relates to three hubs. This is quite confusing because it is not clear what the game plan is. Do the proposers intend to start with one hub for which reason the budget relates to the set up of only one hub? If that is the case why do the KPIs relate to 3 hubs?  Some clarity would be appreciated. In any case I think that starting small and scaling to other campuses gives the proposers a better opportunity to succeed at establishing the hubs rather than starting with all three at a go. Metrics for measuring the progress of the proposal also appear quite ambitious ie. 600 event participants, 4,000 LinkedIn subscribers, 6,000 Facebook subscribers will be achieved within a period of less than 5 months.  \nWith respect to the team, more information on the background, experience and number of team members will go a long way to improve the assessment of the feasibility of the proposal. A link to the profile of the team would be a good idea.\nProposers have identified risks and provided mitigation measures to address them\n", "q1r": 2, "q2": "KPIs are provided but these relate to 3 hubs, making it quite difficult to adequately assess the auditability of the proposal. Proposers may need to clarify this as well as scale down the metrics to reasonable figures that are achievable. There are other metrics which the Community may not readily have access to such as number of projects introduced for incubation. Proposers need to provide a way of updating the Community on progress.", "q2r": 3, "assessor": "z_assessor_1437", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is done by a Tunisian company. Tunisia is the northernmost company in Africa. This proposal is in line with the challenge brief as it aims to provide a space for people to learn about Cardano in their own country and language and will be connecting universities,  businesses and organizations with the Cardano Blockchain. This will help grow Cardano by educating more and more people, and bringing in talent into the ecosystem. Also business will get educated in blockchain technology. The Hub seems scalable as long as they are able to grow club members and have quality content. I don't see Key performance indicators, but there is a timeline provided, which started in January and they aslo mention how many seminars etc they want to have.", "q0r": 4, "q1": "The proposer provides a website of Club Dar Blockchain Espit, which I presume is the company submitting the proposal. The Website does not contain too much information, but there are links to Facebook and their Linked-in Profiles. I have had a look at the team members profiles, and do not specifically see that anyone has extensive technical knowledge, but I might be wrong. it does look that they are involved in growing community knowledge around blockchain technologies and Cardano. I would have liked to see who presenters are of the seminars and workshops with their relevant experience and skills.\nThe Proposer gives a basic timeline, no detailed resources are discussed. Maybe Set out also as part of and incorporated into the budget, specifics around the seminars and workshops, like cost of equipment, space, and the speakers.", "q1r": 2, "q2": "The proposal provides for a timeline of the first seminars and workshops. Then they set out how many workshops and seminars, followers etc they would like to have, but I don't see by when they want to achieve this. Maybe link it by saying 3 seminars within 3 months starting April 2022 etc.\nI would also suggest providing more specifics around how community members could track progress of the project. Where, when and how.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The idea to create 3 cardano hubs in 3 universities is very good. Students are a good audience to onboard the cardano ecosystem. The reason is that students can add value to the ecosystem by building in cas of computer science students who can join the army of developers, or by joining Catalyst as CA etc. For this reason, I think that the proposal has identified a problem within the challenge which needs to be solved. In fact the proposal clearly articulated how it adds values to the cardano ecosystem.", "q0r": 4, "q1": "The proposer needs to work on the feasibility of the proposal, to increase its chances of being funded. I suggest to the proposer to start by adding informations on the team and provide links and relevant skills and experience needed to implement this proposal. Furthermore, the budget is not broken down clearly. Also the timetable to complete the work is confusing. I suggest to the proposer to improve those areas of this proposal to increase its funding chances", "q1r": 3, "q2": "The proposal includes strong metrics that define the success of this proposal. These metrics include the number of workshops they deliver, the number of participants, the numbers of linkedin subscribers and more. As a digital marketer myself, I consider these good metrics to measure the success of this proposal. However, the roadmap needs to be improved. Aside from that, I think the proposal has a quite good auditability.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Scaling up community hubs by forming partnerships and onboarding both individuals and organization is important for the blockchain community.\nThe proposal is fully addressing the challenge and seeking to form a triangular partnership with students, entrepreneurs and the public. The proposal has a clearly define audience, targeted to benefit from the hub through learning by practice and being educated on the  ideals and opportunities of the cardano ecosystem.", "q0r": 5, "q1": "The no evidence and information on the team members. This does not show competence to deliver on the proposal with success. The budget is not detailed enough to understand how the funds could be applied to achieve the outcomes of the proposal. The action plans are not realistic deliver on value and could affect the success of the project", "q1r": 2, "q2": "The information provided look too ambitious and quite unrealistic with KPIs that are supposed to be achieved in the medium seemed to be achieved in a year. The proposer should understand that the realization of the success projects are that simplistic.\n\nThere is also no sustainability roadmap to guide the future success of the hub.", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Creation of Hub structure between 3 universities and Cardano, to offer the needed support and allow students to scale & help their community", "experience": "Backgrounds in audit, consulting, business & IT development, and project piloting to assist international as well as national organizations in their digital transformation, innovation, and technical development in favor of decentralization through blockchain technology."}