{"id": 403009, "author": "jdavid", "title": "Cardano Hub in Guam, USA", "url": "https://cardano.ideascale.com/a/dtd/403009-48088", "category": 26439, "amount": 6400, "description": "Guam, USA is where America's day begins. There is little awareness of Cardano in this beautiful island.", "f6_no_assessments": 7, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal provides a good opportunity to spread Cardano and blockchain to the Guam Island. The fact that not many activities happen on the Island is also a plus because people are not too engaged and may have enough time to focus on learning new things.  It is therefore likely to drive-up adoption of Cardano because it will certainly deliver information to people who otherwise will not have access to it. The proposal addresses the challenge in that it ensures information delivery and responds to the minimum viable hub (MVH) concept however, it does not clearly address the issue of sustainability which is an integral part of this challenge. For example, it would be good to see a plan on how the community which is built around the hub will integrate into the main Cardano ecosystem and contribute in the medium to long term to the larger Cardano community. Alternatively, more information on how the activities of the hub will open up various pathways and networks for participants would be helpful. In brief what kind of legacy will the hub leave for the community of participants after all is said and done?", "q0r": 4, "q1": "The plan is fantastic because it is developed around the cultural setting of the Islanders. I love the idea of a Beach BBQ since it provides people with a relaxed and informal atmosphere to network and engage with each other and newcomers as well which demonstrates a good understanding of the target audience. Other aspects of the plan which I think are excellent include the low capital outlay due to the fact that a location is readily available for meet-ups, and the breakdown of tasks per month. It would have been good to know the topics to be discussed at each of the three meetings though. It would have also been helpful to break the budget down into the number of hours to be spent on the project per month and dollar rate per hour in order to justify the $800 and $500 per month for the team lead and Coordinator respectively. Generally, however, the plan is clearly presented. With respect to the team experience, the information appears inadequate, a link to a LinkedIn profile or a little more detailed information on the background of team members would have been helpful to properly assess success of the proposal. ", "q1r": 4, "q2": "There are clear metrics to measure the success of the proposal however, information on how the Catalyst community will be updated on progress is missing. Including weekly or monthly reports to the Community, which will provide information on the number of people who have participated in the hub’s activities among other metrics will be a good way to go. ", "q2r": 3, "assessor": "z_assessor_1437", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about creating a cardano hub in the Guam Island community. This is without a doubt in the scope of the challenge. With these meetups, people can be educated on blockchain technology and be part of the cardano ecosystem. This will eventually add much value to the cardano ecosystem. So the goal of this proposal is to attract people to the cardano ecosystem which align with the outlined challenge. I also think that the proposal should be able to scale in future challenges. Altogether, I think this proposal will have a positive impact on the cardano ecosystem if the proposer manages to implement it properly.", "q0r": 5, "q1": "I don’t have high confidence in the feasibility of this proposal. Sure, the idea is good, but the execution needs some improvements. I suggest to the proposers to add links or references of relevant skills and experience such as links to linkedin profiles. This will help build trust and increase the chances of being funded. There is a roadmap with a timetable that ends in 3 months which is a small window of time. I suggest to the proposer to add a roadmap to 12 months as specified in the challenge setting. Some improvements can also be made on the budget breakdown by being more specific on the budget items. Altogether, the proposal has good potential, but it needs to be improved to increase its chances of being funded.", "q1r": 3, "q2": "The proposal has provided a roadmap with milestones over 3 months. I think that the roadmap can be improved based on my CA experience and reviewing many projects in the past. The metrics/ KPIs that define success are good but can also be improved. For example I would set metrics such as number of attendees, numbers of social media following etc..I think that these metrics should be directly correlated to the end goal of the proposal which is to bring people to the cardano ecosystem. I have experience in the digital marketing space. All my suggestions and judgements are based on that.\n", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Proposal is well written and alignes with challenge. It intends to create a MVH to onboard new members and raise awarenedd on Cardano in Guam (USA), creating a local community. \nIt can potentially adress challenge kpis as \"new Hubs launched in 2022\" and \"new users of Cardano onboarded\".\n\nThere's already a target audicen established and some acitivities proposed (barbeque, sessions with someone from legislature). However, it would be imporant to see more on how to solve the major challenge identified by proposer (\"understanding Blockchain in general\") will be addresed. it will likely require someone with this technical background to teach, give lectures on it, answer questions, discuss in the group. Or a plan for the community to learn by itself (on the internet, for instance), but this plan could be better explained here.  However, some sense on it is written in the feasibility section so this is not affecting my score.\n\nI found particularlly interesting the point the propser made of the Guam island be a small place with not much acitivities. Having an active Cardano hub in such places can really attract and engage people, sometimes much more than in a busy city where people have a lot to do and plenty of places to go.\n\n", "q0r": 5, "q1": "There's clear time-framed plan with good acitivites that help to understand what will be done to create the hub and make it active. \nBudget breakdown is fair, divided by parts of the projects (work packages) and total budget accounts only for 1% of challenge budget, which in line with the suggedted \"upper limit\" of 5% in challenge description.\n\nAs for the team, one person seems enough to lead this hub. Proposer seems to have competencies on communication but does not have knowledge on cardano or blackchain, which would help  a lot on the project. For this reason, an extra person still needs to be hired, as said in the proposal. This is the only reason it is not scoring 5 stars.", "q1r": 4, "q2": "There are good kpis and milestones proposed, that can help track project progress. I liked it will require people to have ADA wallets to signed up, it can increase the number of ADA holders.\n However, I think proposer could inlude also on the metrics the number of people reached and engaged and propose some targer over time for it. \nI also think it is imporant to collect and measure feedback from participants to assess how community is evolving. ", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies a problem, but the problem presented is generic. Cardano's lack of knowledge could be a problem in many parts of the world, why is Guam a differentiator? The proposal does not articulate why it is a problem or provide more information about the context of the problem.\n\nThe solution presented does not clearly articulate how it will impact the challenge or the ecosystem\n\nIn terms of impact, Guam's population is relatively small, so restricting the hub to the local population limits the potential for impact.\n\nThe metrics, defined goals indicate a low impact potential, because if we take into account 4 events with 15 people each (I'm basing myself on the maximum estimates indicated) we would have 60 people participating in events related to Cardano, which is a low number and added up the fact that there is no clarity on the content to be addressed in the events, uncertainty about the potential for impact increases. 60 people onboard could be an extremely relevant KPI depending on the type of participation that could be expected from these people, but as the proposal does not make clear the type of content to be addressed in the events, there is no way to agree that there will be a relevant impact on the challenge or for Cardano .\n\nThe proposer's lack of expertise on blockchain technology raises even more questions about the impact of the events. It is true that there is an intention to bring \"experts\" speakers with more knowledge to participate in the events(online participation), but without knowing what type of content will be covered in the events or the duration of the events, it is difficult to measure the impact of the proposal.\n\nI would recommend that the proposer look for someone with more knowledge in blockchain tech and Cardano to help organize the events and the content, because although the events can have the participation of \"experts\", it is essential that someone can bridge the gap between the experts and the participants of the event. .\n\nI would also recommend establishing goals/metrics and KPIs that can indicate potential impact and feedback from participants. For the proposal to have a positive/relevant impact, the participants of the event need to be onboarded in the Cardano ecosystem (using only a requirement of having a wallet seems to me an objective of little impact in the challenge).", "q0r": 2, "q1": "The proposer reported experiences with organizing workshops, but there are no sources to check his qualifications. It was not clear how knowledgeable the proposer is about Cardano or blockchain in general, but the proposal description indicates that he is a \"newbie\". There is an intention to invite \"experts\" to participate in the events, but this part of the plan needs more detail, since the viability of the project depends on someone who can pass the knowledge on to the participants of the event.\n\nThere is a detailed budget breakdown, but it is not clear which activities/hours will be required from the proposer to organize the events, which brings uncertainty about the $2400 allocated to this part. There is no mention of allocating resources to the \"experts\" who will participate in the events and will actually be responsible for educating the participants, which I consider a flaw in the definition of the budget.\n\nThere is an appropriate and sensible timeline for the events mentioned and due to the low complexity of the proposal I believe it is adequate.\n\nSome relevant risks were considered and appropriate solutions were mentioned.\n\nThe biggest problem I see regarding feasibility in this proposal is the lack of information about who will be responsible for teaching participants about blockchain and Cardano and what kind of content will be addressed. The absence of this information greatly compromises the feasbility.", "q1r": 2, "q2": "There is a lack of clarity in the description of the problem, as the problem presented is generic (could apply to different regions around the world) and there is a lack of information that helps to understand the context of the lack of knowledge about Cardano in Guam. The solution presented is relevant, but needs a more detailed plan.\n\nThere is an appropriate roadmap for the low complexity of the proposal. The main issue related to auditability is the lack of metrics/KPIs that can indicate the outcome of the proposal in relation to the challenge.The metrics referred to in the proposal would only allow identifying whether the events took place and how many people participated, which I consider very little to assess the performance of the proposal. How to quantify the performance of events? How do you know if participants managed to be onboarded in the Cardano ecosystem? Did these participants seem active in the community months after the events?\n\n", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "I believe that this proposal directly addresses the challenge statements. The proposers aim to create a small community hub in Guam (the more western part of the United States). As stated in the challenge setting, the proposers have a clear understanding of the target audience – they plan to start with a smaller 10-15 person group, but then expand as interest builds to form bigger meetups on the beaches of Guam and potentially bring in someone from the legislature. These events could expand the reach of cardano on a more personal, human-to-human level because of the small group size. As the proposer mentioned, the community of Guam is very tight-knit, so starting with these smaller meetups is more in line with the general community atmosphere. This proposal demonstrates a clear creativity to adapt the community hub to the community it comes from. Thus, I believe that it addresses the challenge setting. (score given: 5)\n", "q0r": 5, "q1": "Given the information provided, I think that this proposal can be successfully implemented. The proposer is a business owner and real estate license agent in Guam. While his qualifications don’t initially seem to indicate that he knows much about cardano, the proposer mentioned that this budding knowledge actually allows him to better communicate with the general population who does not understand anything about cardano. I partially agree with this statement, but I also think that it is important to have some deeper understanding of cardano relative to your audience, such that you are able to answer their questions. As a small bit of feedback, I would encourage the proposer to read up on cardano and the ecosystem a little bit more before they lead the first session just so that they are more comfortable and confident talking about these topics to the community. I do have confidence that they will be able to pull off these events.\nThe proposal itself seems very achievable in the timeframe given. There is a good roadmap that provides a solid breakdown of the tasks to be completed. The proposal will run for three months, with at least 4 sessions (one of which being the beach BBQ event). There are some other tasks, such as marketing through teasers and inviting representatives and local reporters as well. I think that all of these tasks can be completed by the proposer and their assistant coordinator. \nWith regards to the budget, the proposers broke down the funds requested into easy-to-read segments. I can clearly tell where the different funds will be going, such as project lead fees, logistics/food/venue fees, and ADA giveaways for the events. I do not personally know how much it costs to run community events, but I think that these funds requested are reasonable given the scope of the proposal. (score given: 5)\n", "q1r": 5, "q2": "Given the information provided, I think that the proposal is mostly auditable. The proposer has the overarching goal of 3 sessions plus 1 BBQ session. These events are easy enough to audit since the community themselves can attend the meetings to verify that they happened. Also, the proposers will have media coverage and get a legislator to attend events, which are other metrics of success that can also result in more awareness of cardano and the community hub. The proposers mentioned that the number of ADA wallets signed up as a metric of success. I think that this metric can lead to good auditability, but I would also encourage the proposer to include some other metrics of success, such as the number of new cardano users on-boarded or even the number of new developers onboarded (if applicable) since these metrics are specifically mentioned in the challenge setting. Also, I do not currently see any way that the proposers will share these metrics of success with the community. They do have the expected media coverage, but is there a website or other method of communication that can be shared with the wider cardano community to audit this proposal? If these questions could be addressed, it would greatly strengthen the proposal, but as it is, I think that it can be mostly audited. (score given: 4)\n", "q2r": 4, "assessor": "z_assessor_310", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Unfortunately the proposal is quite abstract. The proponent intends to hold a series of online meetings and some face-to-face meetings in Guam (USA). The objective would be to present to the local population what blockchain is, what its uses and benefits are, and then go on to explain more explicitly what Cardano is. The proponent claims that experts in the field of blockchain will be hired to participate in the online meetings. He explains well how the settings of these meetings would be - few people, small closed places, then beaches, also whatssap groups, telegram and etc. The problem with all of this is the lack of specificity. We don't know how blockchain would be introduced. Which topics would be taught in which order and why. Who would be the experts hired? How the target audience would be captivated to participate in these meetings. Because they are small groups (10 to 15 people), it is not clear how these will be selected. In general, there is a lack of understanding of the whole. What would be done, how and for what purposes. Therefore, I think that the impression that is given is that the impact would be more downwards, and the specific objectives of the challenge would not be well contemplated.", "q0r": 2, "q1": "The proposal script is great. The proponent does what I normally suggest: divide the timeline into months (a relatively short time span), and in each of them many activities are described. We are able to understand the totality well based on what is passed on to us. The budget division is also quite clear. We know how the total amount would be divided. I think it would be interesting for us to know better the work routine of the professionals involved, in order to assess whether what was asked is fair or not. In terms of logistics, a little more detail would be interesting as well. How much would it go for food? And why would the site be paid for (it is implied that it is the property of the bidder)? Regarding the author, he admits to being a newbie in the technology area, he says that this makes him very aligned with the nature of the proposal (which is true), but still I would find it indispensable that some expert was involved. In my view, projects usually require a team, in this case it would be the proponent + a coordinator + a blockchain specialist, from what I could understand. It would be much more interesting if these were already defined and well presented. Therefore, the feasibility is average, having strengths and parts to improve.", "q1r": 3, "q2": "The proponent talks about end goals in the auditability part of the process, when in fact he should focus on how to follow the project development process and keep the Cardano community up to date. It would be important for him to prepare monthly reports talking about the pre-production process of each meeting (whether in person or online) and also how the meeting itself was, how many people participated and how the debates were (in addition to the small fruits generated by each). Now talking about the final results, again he repeats the same data. What we would need to know here is how these encounters reflected on Cardano. Has the local population really become more involved with our blockchain? Have they become active members of the community? What fruits were generated in the end? Were the specific objectives of the challenge met? I think that, unfortunately, the proponent does not outline adequate auditability, neither in terms of follow-up nor of final results.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The aim of this proposal is to build an enthusiastic Cardano community hub by creating online and in-person events to engage and educate the community to ADA and this is in perfect alignment with the aim and purpose of this challenge. The proposal further explain the challenge that may distract its course and gives a way of solving that challenge.", "q0r": 5, "q1": "The proposal gives a detailed timeline and a well broken down budget. It also gives a good background about the proposer and goes on to further state those who will be assisting with the project. From the solution plan provided and the from the things stated above, this proposal is highly likely to be implemented successfully.", "q1r": 5, "q2": "The proposal gives good measures on what its success will loo like and this information is enough to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Build an enthusiastic Cardano community hub by creating online and in-person events to engage and educate the community to ADA.", "experience": "I conduct workshops on personal development, motivation, health, and wellness. I enjoy talking & interacting thus I'm active in various local organizations that promote community projects. I am also a licensed real estate agent and has developed a huge network in the island."}