{"id": 403271, "author": "xeeban", "title": "SalmonNation Decentralized Alliance", "url": "https://cardano.ideascale.com/a/dtd/403271-48088", "category": 26439, "amount": 21300, "description": "The Salmon Nation bioregion needs a hub to connect people to collaborate on blockchain solutions for challenges in this area of the world.", "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 1966, "q0": "This proposal is a continuation of a previously funded one and clearly provides the relevant background and information required to address this challenge. In the first place it is focused on a specific community and location ie. the Salmon Nation. The attached document on the Salmon Nation provides relevant information to people like me who have no idea of the movement nor where it is actually located on the map. The proposal aims at delivering information which is a key part of the challenge but more importantly provides this information within the cultural context and understanding of the people of the Salmon Nation. The proposal has a low capital outlay given that the team is able to work from anywhere, has a strong emphasis on sustainability through the creation of a paid course, collaborations and by having substantial funds in the SAMON stakepool which is owned by SANADA and providing a roadmap to sustainability. The emphasis on collaboration with other blockchain groups and events is especially cool since it is part of the strategy to integrate them into the Cardano ecosystem. Certainly a great plan which will have a direct impact on the Cardano ecosystem. The proposal also addresses the minimum viable hub concept of the challenge and is clearly able to scale to address similar challenges in other regions. Proposers have definitely earned 5 stars.", "q0r": 5, "q1": "The proposal provides a clear and implementable plan for carrying out the tasks, using a variety of methods including outreach, networking events, one-on-one support, town hall events etc. Key risks and their mitigation plans have been well discussed and the tasks required to implement the proposal have been captured. I would have however, loved to see the tasks assigned to specific months. For example hold 2 networking events in month 1, provided a minimum of 10 one-on-one sessions in month 2 etc. This break down not only facilitates implementation but also ensures that progress is properly monitored.\n\nThe project team comprises highly experienced members of the Cardano ecosystem and Catalyst community with a variety of skills relevant to the success of the proposal ie. catalyst circle team members, funded proposers, challenge setting team members, organizers of Pacific Town Hall with skills in IT, cryptocurrencies among others. There is little doubt that this team is adequately versatile to successfully implement the proposal. In addition, I believe the experience already gained on the ongoing project from fund 7 will provide the relevant motivation to see the project through to a logical conclusion.", "q1r": 5, "q2": "The proposal provides key metrics by which success will be defined and KPI which can be used to track progress. The fact that these KPIs are verifiable through their online events and channels makes it easy for the Community to monitor progress and success. What is however lacking is a clear roadmap of activities to be undertaken on a monthly basis for the duration of the funding period. Such a breakdown will surely enhance the auditability of the proposal.", "q2r": 4, "assessor": "z_assessor_1437", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1885, "q0": "This is a proposal to provide continuing operating funds for SANADA (Salmon Nation Decentralized Alliance) as a Cardano Local Community Center. The project has a plan for self sustainability in 6 months. Both the project idea and the self sustainability commitment align perfectly with the challenge setting. \nThe project Community Hub is in Victoria, BC, Canada.  The goals of the project are to host in person or online Cardano events, onboard new participants in Project Catalyst and connect people to build blockchain solutions to local and global challenges.\nThe proposal covers all of the objectives of the proposal very well. \nKudos to Nori Nishigaya  for the perfect presentation of this proposal.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposal has a monthly schedule that should be repeated every month for 6 months. The action plan and the additional activities of the Hub are explained perfectly. There is no doubt that the proposer knows what he is talking about and the plan is clear.\nThe proposer provides a detailed breakdown of the budget of the project including hourly remuneration by position and task.\nThe proposer outlines risks and provides sound mitigation strategies for them.\nThe team is presented, the team is very visible in the Project Catalyst community. What I see as a mistake is that the team does not provide links to CVs or linkedin accounts. Given that most voters are not very familiar with the active Catalyst community, I believe it is better to present these materials in order for the voter to make a history check if he feels that need. \nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposer gives plenty of measurable parameters for auditing the project, however there are no exact numbers to provide benchmarks against which an auditor could compare the real progress of the project. Please provide numerical expectations for the next project.\nSuccess parameters are immeasurable and the auditor could not conclude if the project is successful or not.\nThe auditing part of the proposal is all about how the auditor should evaluate the progress of the project in order to release the next funding round. There should not be a need for the auditor to make discretionary decisions, because this puts too much power in the hands of one person. Please consider that in your next proposal.\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 3, "assessor": "z_assessor_1417", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2631, "q0": "Biology is a large and important field for real-world blockchain applications. Helps with process management, data storage, and food traceability. This proposal aligns with the challenge that, if developed, would extend to the entire Cardano community and bio groups globally. Can you elaborate on the blockchain application in biology that the team is planning to implement? We were happy to see that it was an idea that was planned on paper. How will the blockchain technology that Cardano currently has in place help the project? SANADA currently has a very good community in the area, which is remarkable, you are also visionary in every aspect, I am completely convinced. Prioritizing the online form in the present time is also the right direction. The risks and solutions are detailed, which is very good", "q0r": 4, "q1": "You should include specific project timelines for the community to follow. In terms of budget, I find it quite suitable. You should add the group's social channels for community reference. And it will be more convincing if you can cite some links showing events that you have organized. Thank you", "q1r": 3, "q2": "The given project indicators are suitable and easy to quantify during the development of the project. The success of the project will have a far-reaching impact on the practical application of blockchain, the Cardano community, and the bio-community around the world. I found the project to be funded at F6 and well implemented, which is a plus", "q2r": 4, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5742, "q0": "The challenge brief has many specifics for CA's to consider.\n------------\n- Focus on 'minimum-viable hubs' (MVHs), the smallest effective unit for a hub\n- Budget requests that allow others to also pursue their goals \n- Deliver information to people who would not otherwise have the access.\n- Ensure self-reliance within that community.\n- Consider why a hub exists, in the context of location, access to infrastructure and community readiness. \n- Traditional brick-and-mortar (CTH) being only one information-delivery system within a local community.\n\n- Proposals that have a budget:cost-to-launch ratio between 1-1.5.\n- Proposals that do not exceed 5% of the total Challenge budget.\n- Proposals that account for local needs and infrastructure concerns.\n- Proposals that show creativity and ingenuity around hub design and information delivery.\n- Proposals that are using local, recyclable materials and have a commitment to sustainability practices.\n------------------------\nThe existing SNDA community hub - serving a geographically very large area with low population density is organized according to the principles stated above. Their reach into areas perhaps not reached by other Cardano resources. As such a citical element of efforts to grow the Cardano Community. Their modest budget request and methods of being financially sustainable through other sources is both clever and perfectly in line with the Challenge.\n\n\"The target audience for SANADA is people in the Salmon Nation bioregion who are looking to use Cardano blockchain technology to solve local and regional problems. We seek to onboard new people to Project Catalyst and to help them become successful community members. A secondary audience is those that are in neighboring regions who find events happening in the Pacific timezones convenient (USA, Canada, New Zealand, Australia, Pacific Islanders, etc.).\n\nTheir work is proven by the activities undertaken in their fund 6 project. \n\n\"we hosted several Pacific Town Halls covering the topics of whether Crypto, NFTs, and DAOs were the technology of the future or just technical sleight of hand, or worse, outright scams. The community stepped up and engaged in thoughtful and insightful discussions.\" \n\nThey were recorded and can be found here: \nPacific Town Hall - A Critical Look at Web 3.0, NFTs, and more\nPacific Town Hall #3 DAOs Hype or the future of collaboration\n\nThey already manage a Discord server: https://discord.gg/JG7N3cV9fw.\nClearly a 5-star rating is appropriate.", "q0r": 5, "q1": "\nThey have a distributed team who can work from anywhere in the region.\nThey use a co-working space to keep costs down. \nThey manage a Discord server: https://discord.gg/JG7N3cV9fw.\nSANADA has a stake pool (SAMON pool) intended to generate a more stable income stream - not dependent upon Catalyst. \nSANADA is also providing “stake pool as a service” to several community project stake pools, which also has the potential for bringing in more revenue to support operations.  \n\nPerhaps the main predictor of success, hence feasibility is the team and the main proposer. Nori is one of the most active members of the catalyst community. A great communicator, organiser and consensus builder. Consistently moderating swarm (group) discussions on a wide range of topics. A strong supporter of diversity and inclusiveness. With Nori at the lead of this proposal - feasibility is assured. 5-stars", "q1r": 5, "q2": "As a broad initiative, there are many goals to monitor. But the online concept, and public nature of their initiatives makes progress towards those goals transparent. As can be seen in the comments of this proposal. The stake pool as a service idea is innovative and also can be easily monitored. All in all the community will have strong visibility of progress and performance.\n", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6618, "q0": "This proposal identifies a problem within the challenge, which is to expose cardano content to the local community of Salmon. I think that educating local communities is really important to accelerate cardano mass adoption. In that regard, the proposal clearly articulates how it adds value to the cardano ecosystem. I have to say though that this is a fund 6 continuation of a funded project. As a previously funded project, I would like to see more progress on the marketing side of things. I see that they have a stake pool with 300k which is quite good, but I did not see a great social media following which should be one of the focuses of this kind of project. That said, I think that the idea is good and they are on the path of being self-sustained eventually by running a stake pool and maybe other businesses. Altogether, the proposal is in line with the spirit of this challenge. My only advice is to focus more on marketing, developing social media and maybe using seo as well.", "q0r": 5, "q1": "Since this is a continuation of a funded project, I would like to assess this proposal based on results they have achieved. I know that the proposers have a stake pool with 300k staked. This is a good result in my opinion as attracting delegators is not an easy task. However, I also wanted to see metrics such as the number of events participants and how this translated in people joining the ecosystem. I would also like to see more followers on social media such as discord members. At the time of this writing, their discord has only 21 members, which can be improved massively. They have also provided the team members skills and experiences but they can improve it by adding linkedin profiles or other resources. The proposers can also make improvements by providing a timetable to complete the work. They have provided a list of activities without precising the times for delivering the work. The budget is broken down but it is not precise in my opinion. They can also improve this area of this proposal. Altogether, I think that the proposers can make some improvements to add more chances of being funded.", "q1r": 4, "q2": "The auditability of this project is not great, but it has a lot of potential. With only a few improvements, they can increase massively their chances of being funded. For example I suggest to the proposers to write a better roadmap with milestones and time horizon for achievement. The metrics to measure success can also be improved by adding expectations. Altogether, I think that the proposal has potential but it needs some improvements. My area of expertise is in digital marketing. So all my rationals and judgements on this proposal are based on that.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9105, "q0": "Creating a center to recruit local community members to learn and appreciate the opportunities is important. However, there seems to be no problem operating online and looks the SalmonNation is becoming well known with online activities. There is no problem identified from the challenge by the proposal.\n\nIt will more appropriate to concentrate on the online events for mass participation as said in the proposal and instead request funding for membership management of your community.\n\n", "q0r": 3, "q1": "In as much as the team have experience in the cardano ecosystem, there are no projections into the future. This is seen in the activity plan of what to do to achieve results. Beside, all the action plan to be executed at the center could be done online and instead build trust online and have one annual face-to-face event. \n\nLooking at the proposal, a membership management toolkit will be needed to help grow your community ", "q1r": 3, "q2": "The information provided are enough for auditing but have no accurate projections of outcomes. The proposal has no sustainable plan of action to grow the SalmNation", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Setting up a local community center in the region will give us the opportunity to recruit local people into the Catalyst ecosystem.", "experience": "The team has deep knowledge and experience with community development and Project Catalyst, having collectively participated as Funded Proposers, CAs, VCAs, community mentors, meet-up organizers, facilitators, stake pool operators, software developers, and community networkers."}