{"id": 403484, "author": "tadatek", "title": "TADATek Insights", "url": "https://cardano.ideascale.com/a/dtd/403484-48088", "category": 26439, "amount": 16619, "description": "Our mission is to bring the most comprehensive knowledge about Cardano to the community in Vietnam.", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is quite interesting and makes a lot of sense to the community. Describing information in the form of infographics will make users grasp information faster.\nKnowledge needs to be updated regularly, especially with the growing technology field. The project is a practical and effective idea right after implementation", "q0r": 5, "q1": "The information provided by the project is quite complete and detailed. It seems that the project has been active for a while and is regularly updated with new information.\nThe implementation plan is clear and has specific metrics, the ability of the project to execute is workable.\nThe budget is relatively small for a project done in 1 year, but the amount of content generated is quite large. Hope the implementation team has enough resources to make a reasonable balance", "q1r": 5, "q2": "The information provided to evaluate the idea is quite complete and realistic. Progress with specific goals can easily assess whether the speed of work is satisfactory or not. I find that the proposed measures have enough criteria to evaluate the effectiveness of the project.", "q2r": 5, "assessor": "z_assessor_1032", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal can solve the problems presented by the challenge. It will help community members get information about the development of Cardano with vivid visual images instead of dry text. This makes it easy for newbies to learn about Cardano.", "q0r": 4, "q1": "I see a lot of feasibility problems in this proposal.\n1. The number of participating members is too small, and there is no plan to add new personnel.\n2. The amount of content implemented with very little time and budget will be difficult to guarantee quality content.", "q1r": 2, "q2": "The section on planning the future implementation of the proposal is very detailed and complete. The indicators on measuring and evaluating the effectiveness of the proposal are detailed and complete. This will help the community easily track the results of the work that the team will perform", "q2r": 4, "assessor": "z_assessor_1253", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "\"The crypto industry is not a new industry to Vietnamese, even the government and public media always talk about it on TV and there is a lot of workshops, forums, conferences were open for talking about it. There are thousands of Vietnamese invested in, and thousands of crypto projects were launched by Vietnamese. But it's lacking quality information about Cardano to help developers, entrepreneurs, and investors invest their time and effort to develop their idea on the Cardano ecosystem. This project will build a content channel to provide blog articles, infographics, and video tutorials to help everyone update information about the Cardano network. This proposer briefly mentions 4 key activities that they will provide to their target users to help them advance their knowledge about Cardano which I believe will help grow the community quality in Vietnam soon. \nLast but not least, for this kind of project, selecting and making quality content among a lot of information is a big challenge that they have to face. The team also mentioned this challenge with a very detailed comment about it, so I think they will find out the better way to mitigate it in the future. \"", "q0r": 5, "q1": "\"The team has made inspired goals for this project with thousands of blog posts, hundreds of infographics, and videos. From their published content in their attached channel links, I think the team can cover that load of work. \nSo that, the budget they required is reasonable and sufficient to acquire the project goals. It's even the minimum cost for the production with Vietnamese resources from my experiences. \nSo, as products & proofs shown in the proposal, I rate them for 5. \"", "q1r": 5, "q2": "There are various key metrics used for tracking this project and all will be public in their channels that the community can check without permission. These key metrics are tied with their implementation plan and support to their goals. This project will lengthen a year of content production, after the success with numbers in the proposal. I believe it will help a lot to Vietnamese communities. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal plans to provide comprehensive information about Cardano to the Vietnamese community. The medium of language is in the local language. \n\nThe information is produced in the form of news blogs, infographics and video tutorials.\n\nThe government supports and believes that technological innovation, scientific progress will \" change the face of the country”. \nIn line with the government's belief, the proposers want \"to bring together individuals with similar passion and interests to develop into project teams that contribute to the Cardano community at large\". \n\nThe proposal looks to assimilate the diverse information about Cardano that requires expertise to interpret objectively. This is the big challenge to divulge the information in the local language to the Vietnamese community. Interpreting the information and putting it in the form of infographics is also a difficult challenge. \n\nThe proposal aims to get 10k members into its social community.\n\nHaving considered the proposal, and the overall budget requested  is lower than 5% of the total allocated for the campaign, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal plans for a year-long project in which the team will produce 3 posts per day; 1 infographic per day; 3 videos per week. \n\nThe main goal is to grow membership to 10,000. The tasks involved are research, creating content and a content contributor contest. The proposers currently have a blog and have already produced 100 posts for public news. Besides the blog, they have other platforms to reach out to the Vietnam community: Telegram, YouTube, Fanpage and Twitter.\n\nThe proposers requested USD 16619 for the whole project, mainly for spending on the time resource. \n\nThe team members have experience in developer, business development, graphic and interior design, community administration and content creation. I have viewed their webpages and other platform content. I consider their experience should be given credits.\n\nTherefore, I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal looks to build a community network, dynamic and active: members ” actively exchange and help each other to improve their professional knowledge and skills in the Blockchain field in general and the entire Cardano ecosystem in particular. \n\nAlthough the proposers have set the KPI metrics, they did not set a goal for each. Nevertheless, they have set an overall goal of 10000 members at the end of one year.\n\nAs such, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_968", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We provide up-to-date information on the Cardano network.Contents are produced in the form of news blogs, infographics, and video tutorials.", "experience": "Our team has experience in\nDevelopers,Stake Pool Operation,Plutus Pioneer,Business Development,Graphic & Interior Design,Content Creation,Community Administration."}