{"id": 404094, "author": "jerrybnj", "title": "Model ICT Hub for Deprived Students", "url": "https://cardano.ideascale.com/a/dtd/404094-48088", "category": 26439, "amount": 24000, "description": "How can we motivate deprived young students in the North East region of Ghana to get educated in the present and coming technologies?", "f6_no_assessments": 7, "f6_rating": 4.428571428571429, "videos": [], "media": [], "f6_assessments": [{"id": 482, "q0": "In our dynamic world, access to ICT networks should be readily available and affordable to all regardless of factors such as age, gender, social views, economic status, location and level of information literacy. \nThis model ICT Hub project for deprived students is a great social developmental idea by the proposer which seeks to provide students with present and coming technologies. This problem statement addresses a problem within the challenge and needs to be solved. The lack of access to basic ICT services retards the development of the community which has an effect on employment especially getting a job in the low-tier service industry.\nA principle of the Scale-Up Cardano community challenge is the delivery of information to people who will not otherwise have access and in line with that, this proposer seeks to come out with a modelled ICT Hub for the deprived students which will serve as a source of information to help ensure self-reliance within the community. Some of the key impacts of the project will address the efficient utilization of Cardano,  blockchain technology and its opportunities, an increase in business development and management skills among the youth.\nThe key performance indicators which ensure the success of the project in the long term can be linked to the indicators the challenge requires. The proposer seems to have a very well understanding of his target audience which refers to the deprived student. The project in adherence to the KPIs also places more emphasis on the minimum-viable hub which looks at the smallest effective unit for a hub.\nIn as much as the project is a very good one, I really expect the proposer to highlight some of the main challenges that are likely to be faced as there seem to be numerous risks associated with such a project.", "q0r": 4, "q1": "A project before implementation needs to go through a series of assessments before implementation and given that, there needs to be an evaluation of the practicality of the project plan to judge whether or not the project can scale into the future. This proposal seems to be well detailed to help ensure that it can be conveniently done, there is a timeline for delivery from 1-2 months that looks into the acquisition of space, furnishing with internet access and other acquisitions and the period 3-6 months looks at the running of the hub. There seems to be a realistic time frame to implement the project and the budget looks reasonable to accomplish the work.\nThe budget of the proposer is very well detailed and seems to give an accurate projection of future cash flow to help the project achieve its target. I will urge the team to be very financially conscious and adhere to the budget since that will help the team gain control over the project's financials. I will also wish to know about the budget versus the cost to launch model which is also a very important thing to talk about, In most cases, the Cardano treasury delays in releasing the funds in batches due to demand pressure and based on that I will wish to know what the team will do if only  1/5 is to be applied as a cost to lunch??\nI am very confident in the team involved in the project, Jeremiah Baani being the team leader of the project and leveraging on the strength and support of the WADA team that has good technical and human resources.", "q1r": 5, "q2": "There need to be an assessment to know the extent to which project management standards are being upheld. The project in my view looks sustainable through the leadership and supervision of the WADA organization. WADA has handled many projects and has secured funding through past funding periods with an exceptional success rate in achievement. I strongly believe in the WADA team to deliver with this project since they have the understanding of their target audience and can accurately provide their reach both physically with various offices opened in more countries across Africa and their online presence across the opened web. There has been a good projection of the number of onboarded members to the hub within the year and I also see the project to be keeping with the minimum viable hub principle.\nThe key performance indicators that serve as a measurement yardstick to help ensure the project's overall long term performance can be identified in the outlined proposal. As the Scale-Up Cardano community hub challenge principle looks at the minimum viable hub in terms of the smallest effective unit for a hub, the project really adheres to this principle with a number of 10-20 deprived young men and women in the northeast region.", "q2r": 5, "assessor": "z_assessor_1170", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 2634, "q0": "The proposal clearly outlines the specific difficulties in an area, if implemented well, it will help the community a lot. The advantage of the project is that it is located in Ghana, which is a developing African country but has a really strong Wada community. I recommend the project to contact the Wada team directly, you will get a lot of support. As for the risk, in addition to members who need to use the internet, how do you promote the center and the benefits it brings? When the majority of young people only use the internet to play games? Or shy when not daring to learn?", "q0r": 3, "q1": "Regarding the project budget and roadmap, I find it suitable, but surprisingly the team has only one member, I think this is very difficult, there is still a lot of work to do, such as infrastructure, maintenance machinery, managing equipment, creating courses… Connect a few more capable members with the same vision, you will go further. Do you have any ideas on how to keep the center running? That's also a big problem", "q1r": 3, "q2": "I know Wada is a big community in Africa, but you should clearly show quantitative indicators for the community to watch more closely, for example, central image, number of computers, equipment, blockchain lectures, the number of members coming to the center… Let's tune in to get the project started, the Cardano community is really happy to be of some help to your hometown.", "q2r": 3, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6931, "q0": "The northern part of Ghana is mostly deprived of proper education since it lacks infrastructure,tools(computers) etc to impact/empower young pupils/students/youths as compared to the southern and other parts of the country, so therefore I totally agree that this proposal/project would help tackle this difficult situation in the north east region(Nalerigu) and future generations to follow. This will put a mark on the cardano ecosystem.", "q0r": 5, "q1": "Feasibility aspect of this proposal is clear such that it takes necessary actions immediately it gets funded from 1-2,3-6 months by putting a physical edifice in the (Nalerigu) north East part of Ghana fully furnished with electricity,computers and other relevant equipments and ensure a competent management handle affairs properly to help train,skill,Empower young men and women in the region and it's environs and also expose them to explore on the cardano ecosystem and every fields of endeavors.", "q1r": 5, "q2": "A leadership and supervision body of reputation(wada) has been clearly stated to monitor and advise during implementation to ensure a successful project.\nTo ensure that every breakdown of funds in the proposal would be used exactly for its intended purpose.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8187, "q0": "The stated problem and proposed solution presented in the proposal match the challenging requirements clearly and logically. The question is how to motivate disadvantaged young students in Northeastern Ghana to be educated about current and upcoming technology. The proponent wants to raise awareness about Blockchain and Cardano by setting up a community center in Nalerigu to provide students with access to basic IT training and services to compete with their peers they are in other regions. If successful, it could inspire other communities or regions to also see their ability to solve problems through Blockchain Technology and Cardano.", "q0r": 4, "q1": "In terms of feasibility, I completely agree that the proposal is very likely to succeed, every detail is explained in great detail and the community is easy to follow. This proposal presented a very detailed 6-month plan with milestones, goals, and estimated timeframes. Each step of the plan is described in great detail, with a clear roadmap, so it is easy to check the progress and success of the project. There is also a very detailed description of the budget items, which covers all aspects of the budget. The team behind this proposal is Jeremiah Baani and members of WADA, who have extensive experience working with the tasks required to complete the project. Not only are they very active in the community, but they also provide other initiatives and projects. Their program is a good mix of skills and knowledge to form a diverse and well-prepared team, up to the challenge. With the above reasons, I would once again say that the feasibility of this project is high.", "q1r": 5, "q2": "The proposal presents a very detailed roadmap with milestones and steps taken each month until final delivery, making it easy to test the proposal and for them to provide the necessary reports to the IOG later. when sponsoring. The success metrics are very well explained and can help measure the impact of the proposal, and the KPIs are easy to track and very relevant to the scope of the proposal and to the objectives. challenge target. . The testability of this proposal is very high, the proposal will be led and supervised by Wada; a reputable organization in the Cardano ecosystem. Although this is a new proposal that has never been funded before, given the experience of the team and what the proposal represents, I am confident that the team will successfully execute the project, providing significant market awareness. Cardano school, adoption and expansion in Northern Ghana.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8994, "q0": "The onboarding of new members and delivery of information are some objectives of this challenge setting and it is exactly what this proposal aims to achieve. This project will empower the people of the northeast part of Ghana and provide them with the physical resources and education required to teach the local community about Cardano and grow awareness about Cardano within a safe and nurturing environment. The project is locally focussed in a deprived community of Ghana, the scalability of this project might be possible through the implementation of similar models and partnerships in other community spaces in slums across the world.", "q0r": 5, "q1": "WADA is well known in the catalyst community because of the great work they have shown across some of the West African countries. The WADA website provides us with information on some of their numerous handy works. The team has developed a long-term vision for how the project could benefit children and young people in this area through education and provide hope for the future. The author has given us a detailed budget breakdown with realistic timelines to implement this project. This is proof that this project will be implemented easily without a hitch.", "q1r": 5, "q2": "Excellent auditability, the team defines in great detail what success would be like, so we have plenty of content to monitor. In addition, we could go further in the monitoring as they also detail what the phases would be like, that is, we know what would be happening and when so that it is possible to check if things are happening as promised. The roadmap is very well designed, there are deliverables/milestones that make the progress of the project easier to track. The metrics and KPIs were well chosen and I believe they are good indicators for evaluating success, as the chosen outputs would clearly indicate the number of users and the progression over time.", "q2r": 5, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9027, "q0": "The description of the problem in this proposal is fitting in the challenge setting. One of the goals of the proposal is to establish an hub that creates the awareness of the people of Nalerigu about Cardano, so I see that Cardano will benefit from this project. Hence, this makes the metrics and goals to be in alignment with the challenge. I believe the proposal has the potential to reach out to many deprived students in the long term.", "q0r": 4, "q1": "Considering information about the team and the description of the relevant experience, I believe the team possess the required skills and knowledge to successfully execute the project. The budget is easy to understand because it is well explained and broken down into identifiable items. The budget is also reasonable and I think it adheres to the Minimum Viable Hub (MVH) principle for this challenge. The plan is well explained and the time table is definite as the period for the execution of the project is started, this makes the execution of the project possible. The proposer has indicated that there are no foreseeable challenges and risks to the implementation of the proposal, well I hope so, yet still it is good that it has be indicated.", "q1r": 5, "q2": "The targeted problem is not vague, it has been clearly described, I believe the solution can tackle the problem. The roadmap, time horizon and milestones are comprehensive and well described. The proposer has indicated the metrics or KPIs that define the success of the proposal and that for me is brilliant. If the solution of the proposal is executed, the problem will be addressed as students who are not aware of Cardano will be educated and recruited into the ecosystem.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9109, "q0": "The proposal accounts for local needs and infrastructure concern. Bridging the ICT and blockchain knowledge gap  is important to leave no one behind. The needs of the poor, when provided becomes a member of the enlightened community. This is important to create awareness and information sharing to be part of the tech ecosystem", "q0r": 4, "q1": "The team lead is experienced in the cardano activities and active member of WADA. It makes him pioneer in the ecosystem and understands the needs and culture of the people of the Northern Ghana. \n\nThe budget is reasonable to fund the ICT hub to train the students and young ambitious tech individuals. However, a permanent training center for the hub is better than renting. This will instead keep the program sustainable. \n\nTraining the first 20 participants is realistic and they could form the first cohort and success stories shared by these trainees to get others onboard", "q1r": 5, "q2": "The information provided is quite broad for auditing. The KPIs are not quantitatively measurable and seems to be a long term outcomes. \n\nThere is no sustainable plan for the ICT hub and the hub could collapse after a while in operation. \n\nA progress report should be accessible to guide the auditing. ", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Set-up a community hub in Nalerigu to offer students access to basic ICT training and services to compete with their peers in other regions.", "experience": "As a skilled IT professional, Lecturer and a blockchain educator over the past years I have educated over 500 young students in the area of cardano blockchain and the opportunities available through the support of Wada."}