{"id": 404660, "author": "npaquoc87", "title": "Cardano Incredible Race - 2022", "url": "https://cardano.ideascale.com/a/dtd/404660-48088", "category": 26439, "amount": 24870, "description": "Cardano Community in Vietnam is lacking of social events. We need to make Cardano community more visible and create impact to new people.", "f6_no_assessments": 8, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is to create a Cardano community with running enthusiasts in Vietnam, running is a sport that requires no skills, anyone can participate, so the community is very large. The Vietnamese Cardano community also has many running enthusiasts; these people often work alone, there is no playground to connect them together. After this proposal is completed, this will be a playground to help connect old members of the Vietnam Cardano community, when this playground works effectively, there will be impacts for newcomers to join, learn about the Cardano blockchain.", "q0r": 5, "q1": "This proposal, if funded, will have the first activity be a virtual running event through the Uprace.org running application, this application has organized many successful virtual running events and has a user community in Vietnam, Creating and organizing virtual running events is a simple task for internet users. The hardest job of this event was how to organize and promote to attract members to participate; the proponent also provided solutions, detailed plans and time to promote and attract members. The members of the proposed team are people with experience in community management, communication and social marketing, so they are fully capable of implementing this proposal successfully. However, this is a virtual running event, there will be risks such as participants cheating in the event, the problem of running application ... currently the proponent does not have a specific solution, they have to depend on the solution from Uprace.", "q1r": 3, "q2": "The proponent has experience in management and organization, so this proposal has a very detailed plan with division of tasks and Kpi for each specific timeline. The budget table is also well allocated for each category such as organization funds, prizes, NFT minting stored on the Cardano blockchain. However, to assess whether this proposal is completely successful or not, there is only one way to wait for the official report from the proponent after completion.", "q2r": 4, "assessor": "z_assessor_1151", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Recently, community events often took place online partly due to the Covid-19 epidemic, the community was not allowed to go out or gather in large numbers. Currently, the global epidemic situation has been partially controlled. Countries are getting ready for the new normal. The organization of Cardano Incredible Race is a very interesting idea that can help the community relieve stress after tiring working hours, thereby also contributing to connecting the Cardano community in general and the community of sports enthusiasts. in particular closer together. This event will help more people know about the Cardano community, thereby more people will join the Cardano community. In addition, running to raise funds for afforestation is a very meaningful thing to do in the context of increasing impacts of climate change on the environment. This will also give the international community a much better view of what the Cardano community has achieved.", "q0r": 5, "q1": "With the experience of organizing successful virtual races of the project director, Mr. Quoc Nguyen, I believe that the team will successfully implement this proposal. I think that you need to come up with a solution for the Uprace application that cannot attract a large number of participants, in addition, in case the number of participants is too large, you also need to come up with a solution so that the community can can understand better because this will greatly affect the success of this project. Another factor that I think will also have a big influence is the current epidemic situation, not excluding that countries will temporarily block back like China in recent days. If this happens, how will you handle this problem? I believe that the more options you offer to address these possible risks, the more the community will appreciate you.", "q1r": 4, "q2": "Being an international auditor is the strength in financial management for this project. I realize that the payments you make in the event of a grant are completely transparent and clear. I greatly appreciate this. The route you gave is also very clear and complete. The KPIs you give to the project are also very easy for the community to measure. I believe you will do a great job on this project.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Cardano seems to lack clarity and impact on the Vietnamese community. Therefore, it is proposed to increase the adoption of social events, establishing the Cardano Runners Community Center in Vietnam and then globally. Propose easy-to-understand description,  clear solution that impacts the challenge. The proposed team recognized the risks and took appropriate measures for the risks they would face. Increase the success power of the project.", "q0r": 5, "q1": "The proposal has a clear plan in each step. Detailed timetable for each work to be done in the project. The budget is allocated transparently in each budget. Besides, the team members can complete the project in a feasible way, they are people with enough skills and experience, have a number of links on social networks. Good understanding of Cardano development as they have worked at fund 7.", "q1r": 5, "q2": "From the experience of the members and the proposed plan, the kPI can determine the successful progress and what needs to be achieved of the project. Proposal a clear, transparent budget boosts the sustainable power of an entirely new proposition.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The idea of the project is very good, promoting people to exercise, and spreading the image of Cardano in a positive way. Agree with you that in Vietnam there are many running groups, each person is also self-conscious about exercising every day, the impact of the project is very high. Regarding the project risk, the runner commits fraud during the event, I would like to contribute the following solution: measure the distance and speed according to GPS, and the athlete must provide additional heart rate measurements, breath, calories consumed... Because of the above assessment, I really want projects like this to be vigorously implemented. Scoring: 5", "q0r": 5, "q1": "The timelines and budget table are very detailed, the roadmap is suitable. If organizing the event in a methodical and transparent way in donation, the feasibility is very high, so I suggest you cooperate with another outdoor event consulting unit, the team currently has only 2 members. pellets, quite thin. If possible, could you please provide a specific disbursement schedule, which will help the project provide a timely budget, the community will appreciate the above. Scoring: 4", "q1r": 4, "q2": "You choose Facebook to communicate and update the results quite suitable for most people. I just have to contribute like this, each participant should be supported by the team to create a Cardano Blockchain wallet (instead of just 2,000 wallets for those who complete it) and everyone can get NFT as a “certificate participates in the event\", will help people get closer to the Cardano community, hope you will respond to a small comment. Scoring: 4", "q2r": 4, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for your feedback, we are missing the explanation that the uprace application is non-for-profit team, they will help all the runing campaign  use their application (techinal, customer services, anti-cheating...). Then we just need only 2 members to manage the project.\n\nAppricate your add-in on the idea to give the NFT to all users, but this is the certification of completion which show that you have put your effort during the race. It will be not attractive if you just only register but don't run then you get the NFT. It's also costly to mint the NFT (about > 1ADA to mint it)^^"}, {"q0": "Running is one of the most popular and easy-to-practice sports in the world, especially during the covid-19 pandemic, more and more people are running to improve their physical and mental health. Meanwhile, the Cardano community in Vietnam is lacking in social events to engage and attract new participants. Thus the proposal gave the idea of creating the Cardano Runners Community Hub in Vietnam and then to the Cardano community globally. The first activity will be a virtual running event through the Uprace application (a famous running application in Vietnam: https://uprace.org/).\nThe proposed team will raise funds to organize a global virtual running event called “Cardano Incredible Race 2022” within 3 weeks. The event documents will list Sponsors (Cardano projects, Pool Operator) as diamond, gold, silver sponsors, thereby impacting the local community (estimated at at least 10,000 runners excluding social reach).\nHolding such an event solves the Key Metrics of the challenge: Increasing the number of local community centers, new developers to the Cardano ecosystem, promoting Cardano and attracting more new users of Cardano; The Cardano Uprace 2022 is also the initial marketing launch for Cardano Runners Community Group in Vietnam and it will reach the Cardano community and new users who are interested in running and jogging.\nThe project also donates to plant trees for Cardano Forest in Vietnam or other Tree Planting Projects/organizations in Vietnam thus reaching outside organizations as well as government agencies.\nFor the above reasons, this proposal is a really great proposal.\n", "q0r": 5, "q1": "The proposal has a very clear and specific roadmap, starting from the date of receipt of money from the fund to 20/9/2022, each stage has clear work to be performed: in the first 10 days, create marketing/ communication documents, next 20 days working with Uprace team to create event on Uprace App and anti-fraud/scale solution, 2 months later doing media, marketing, completing t-shirt design and celebration Medals, online certificate design, 3 weeks event time from 9/7/2022 to 30/7/2022…The organization of the event is also very detailed and easy to understand: registration time, registration method, event time, participation method, result recognition method, and rewards… Therefore, the above project can be completed successfully.\nThe team applied for a budget for this proposal of $24,870, which includes social media costs of $5,120 (with details of costs such as posting, marketing, design, etc.), t-shirt and medal costs $10,000, Certificate of NFT minted on Cardano $2,500, donation to plant trees for Cardano Forest in Vietnam Other tree planting projects/organizations in Vietnam with Certificate of “Cardano Runners Community” $2,000, project management costs $1,800... These costs are reasonable and should not exceed 5% of the total challenge budget.\nThe project implementation staff consists of 2 people, both very active people who are passionate about running and have both knowledge of cardano and experience in social marketing and running tournaments, so the project can be successful.", "q1r": 5, "q2": "The proposal gave criteria to measure the results of the project: number of participants (10,000 people), number of new wallets created (2,000 wallets), number of teams formed (50 teams), how much it raised ($15,000), Cardano Runners Community Hub's facebook has 10,000 members. The numbers above are indeed a great result and easily controllable by the community.", "q2r": 5, "assessor": "z_assessor_1768", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your feedback, you did very good job in sumarising the proposal that will benefit for busy voters. Appreciate it!"}, {"q0": "I think that the idea of creating a cardano hub for runners in Vietnam is great. If well executed, this project can add massive value to the cardano ecosystem. That said, the proposal has successfully identified a problem within the challenge. In fact, this is a great way to attract new people to the cardano community. In effect the goal of this proposal is to bring many profiles such as developers, entrepreneurs ect. to the cardano ecosystem. And this is in perfect alignment with the challenge settings. Regarding the scaling of this proposal in future challenges, there are many ways to achieve it. This proposal can be extended to other areas or just target other sports or activities other than running. Altogether, this is a good idea for me as a digital marketer, and it deserves a high rating for the impact.\n", "q0r": 5, "q1": "This proposal contains a lot of information that can make us confident in its successful implementation. However I think that the proposer can make some improvements by giving more information on the number of team members needed for this operation. I also would suggest to the proposer to add links to linkedin profiles. I fear that a telegram account doesn’t provide enough information. On the other hand, the proposer has provided a detailed budget breakdown. As a digital marketer who has run facebook ads and did other marketing activities online, I think that the budget is reasonable. I also think that the proposers know what they are doing as far as marketing goes. I feel like the proposers have outlined a detailed plan for achieving the goal in the most efficient way. Altogether, I have good confidence in the feasibility of this project. However, some improvements can be made to this proposal such as adding links to linkedin profiles. This will help build trust and increase the chances of being funded.", "q1r": 4, "q2": "The proposal includes enough information to be auditable. The proposers have provided a roadmap with a timetable to complete the work. Furthermore, the KPIs that define the success of this project are strong and meaningful. I like how the proposal combines a healthy activity and the tech to bring new people to the cardano ecosystem. This is a great idea and the proposers have explained very well the problem they are trying to solve and the solution.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Thank for your feedback, the linkedin of project manager is provided in the propsal, the marketing personel don't have linkedin then provide facebook instead."}, {"q0": "The suggested solution is quite great a deal to organize a community of athletics and running to exercise while educating and creating awareness of Cardano particularities. This is closely aligned with the challenge to have a unique hub that run for cardano. The proposers have a identified a good target group  with much creativity and potentials of collaborating with other organizations", "q0r": 4, "q1": "The budget is well detailed to understand the intentions of administering the project. The team is also experienced to organize such hubs and create a niche to run for Cardano in Vietnam. This human collaboration is important to drive the cardano ecosystem.", "q1r": 4, "q2": "The proposal has measurable deliverables making it easier to audit. All the KPIs are aligned and has a fundraising model to support another initiative to conserve the environment. \n\nThe proposal has inherent sustainability plan through making it an annual running for cardano to increase the membership of the hub.\n\nIt is also important to consider the use of progress report and annual reports so that corporate institutions would develop the interest to support this brilliant idea", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "I am an exercise enthusiast, every day I take time to play sports games, such as: soccer, jogging, ... , it brings us a lot of health benefits. . That's what makes this project so appealing to me. This proposal creates a Cardano Runners Community Hub in Vietnam and then for the Cardano community globally, promote a healthy lifestyle, have a meaningful impact on the local community and therefore promote Cardano and attract more new users of Cardano. In addition, it also reaches external organizations as well as government: work with companies, community, stake pool operators to raise funds to donate into Cardano Forest in Vietnam Project or other tree planting organizations to reforestation based on the result of the event.", "q0r": 5, "q1": "Currently, the team you provide has 2 members, 1 Project Manager, 1 Communication Manager. Their contacts, experiences, successes are listed in full. With what is provided, I think this team can carry out the project easily.\nI have known uprace app before, my friends recommended it to me. It brings a lot of positive impacts to the community, brings health, helps support charity works (the run will become cash to support social organizations). Organizing a global virtual running event on this upcare application will attract the attention of a large number of Vietnamese people.\nThe roadmap (from the time of funding to the end of September 2022) is provided in full and in detail. This makes allocating budgets and defining tasks a lot easier. I highly support your donation of $2000 from the budget to plant the trees to Cardano Forest in Vietnam Project/ other tree planting organization in Vietnam with “Cardano Runners Community” Recognition Certificate. This will help bring in external organizations into the Cardano ecosystem. Regarding the \"Audit\" section, you provided specific numbers to measure, which helps us to have a clearer view of the success of this project.", "q1r": 5, "q2": "This project will help connect Cardano communities in Vietnam, promote healthy lifestyle, have great impact on local communities, thereby promoting Cardano, attracting more new users to Cardano, promote ecosystem development. The content is provided fully and transparently, it will be a solid basis for evaluation. Also, I would also like to know more about how you would deal with fraud (you mentioned there would be ways to reduce fraud, but it's not really specific). I'm a genuine online participant myself, so I'm very concerned about these fraud issues.\nAfter reading this proposal, I have full confidence in the success of this project. I will definitely sign up for \"Cardano Incredible Race 2022\". Thank you for a great suggestion!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for feedbacks, you did a very good jobs in sumarising the proposal, it wil benefit for busy voters."}], "solution": "We will create the Cardano Runners Community Hub in Vietnam to connect the community who are interested in running and jogging.", "experience": "The team consists of Active Runners, Community Manager, Project Manager, Finance advisors, Running Event Organizer."}