{"id": 404763, "author": "emerson", "title": "Australian University Cardano Talks", "url": "https://cardano.ideascale.com/a/dtd/404763-48088", "category": 26439, "amount": 19040, "description": "Cryptocurrency and blockchain development is not a common topic in universities, with most having no exposure to Cardano.\n\n", "f6_no_assessments": 7, "f6_rating": 4.095238095238096, "videos": [], "media": [], "f6_assessments": [{"id": 2637, "q0": "The project will create an additional knowledge channel for students, which is very necessary. Blockchain is increasingly seeping into reality, the world of technology is changing very quickly. Before each event, you should take the time to contact the career center at each school for assistance providing information when students need it. At the same time, you should interact with students majoring in computers, software... You will get a fast and strong number of attendees, which will grow from there. A few suggestions for you", "q0r": 4, "q1": "Appropriate time, plan, and budget. However, it was surprising that the team was only 1 person, very fragile. You should incorporate a few more friends or the Cardano community in your media, as there is a lot to do: get permission from schools, convince students, event content, organize events, answer questions, and support after the event…", "q1r": 3, "q2": "The stats you give are appropriate after the event is over. The community needs criteria during the development of the project to be able to monitor and support, for example, activity images, consent emails from the school, event content...", "q2r": 3, "assessor": "z_assessor_1544", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4888, "q0": "This proposal fits the purpose of the challenge very well.  \nThe proposer will hold six face-to-face talks_panels for young students in two Australian universities.  Try to attract young developers and inspire their interest in Cardano and its ecosystem. ", "q0r": 5, "q1": "This project seems highly feasible.  Because the proposer has experience of hosting events.  And also own a pool being the Co- SPO. He works  as a software engineer in a global company.  Besides there is no need to pay registration fee to participe and food will be provided.  It can be expected to attract many participants and can be able to provide them with a lot of information about Cardano.  The goals of the project, the progress. the timeline, and every support are marked out perfectly.  In this way failure will be very hard to happen.", "q1r": 5, "q2": "The proposal's auditability is very likely.  Because the proposer will provide videos and images for review. And will  provide the number of registers and the number of new members who joined to the comunity after the events.", "q2r": 5, "assessor": "z_assessor_1795", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5152, "q0": "This PROPOSAL is fully in line with CHALLENGE, The proposal as co-SPO of DOG POOL wants to attract more university students to know about CARDANO through six live events in two universities, with his past three years of organizing events and participating in 3 different Computing related societies. I believe this kind of event will definitely create an Impact in universities and attract more university students to participate CARDANO in the future.\n\n\n\n", "q0r": 5, "q1": "The feasibility is high. Based on his personal experience, he is closely associated with 3 different computer related societies, has 3 years of experience in organizing university society events, is co-SPO of DOG Pool, and has close relationships with other Cardano industry professionals. He also mentioned that he is currently working in software engineering at a global company.\nI think he is well equipped to organize this event to reach out to college students.", "q1r": 5, "q2": "It is completely autditable, It could be audited through the number of students enrolled and then participating through video and photo shoots, as well as evaluate the activities and content of the lectures through video. ", "q2r": 5, "assessor": "z_assessor_1866", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9031, "q0": "That’s an interesting and good idea. I can see that the problem described here fits into this challenge, and that’s intelligent. The metrics and goals from comparison are in alignment with the challenge ( one goal is to create an organization that can reach out to universities and offer fully paid talks). Cardano will benefit by addition of more members to the ecosystem through this approach. In future terms, I believe this proposal has a strong scalability effect.", "q0r": 5, "q1": "Considering the the relevant experience described and the information about the team, I am confident that the team is well equipped to implement the project. The budget is comprehensive. However, a challenge I can see is that, under phase 1 of the budget, one bulk amount is stated for planning cost which includes finding food vendor, finding event location, planning event logistics etc but what would have been more appropriate is to provide an amount breakdown for each of them just as was done for the rest so that there can be a better assessment of the budget. The budget also adheres to the MVH principle which is one of the critical issues in this challenge. All the same, I still believe the budget is reasonable to achieve the desired outcome. The plan presented here is well described and I like the fact that the proposer has provided a definite timeline. I appreciate the inclusion of the challenges and risks that may arise during the the execution of the project.", "q1r": 4, "q2": "The roadmap provided here is detailed enough. The time horizon and milestones are also well presented, and I love those inclusions because they make auditability assessment easy. Educating university students about blockchain and Cardano is one of the metrics that define success of this proposal, which I believe is a good indicator of the desired outcome.\nThe targeted problem here is well described and hence with the proposed solution given, I believe it’s good or addresses the problem when executed.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9116, "q0": "Campus cardano events are important to reach students who exploring to learn new things and create for themselves value and opportunities. The proposal is using the Student for Liberty approach to help student identify opportunities and skill and knowledge to be relevant in society. The interesting thing is to have the events in face-to-face to practically introduce the ideas and opportunities of the Cardano ecosystem. This makes the proposal aligned to the challenge to reach out a defined community of students.", "q0r": 5, "q1": "The team member has a close relationship with students and looks to have the capacity to organize the 6 events. The budget  is detailed but there exist vagueness on the component of the planning phase. A clarity on the cost of liaising with universities, finding food vendor, event location etc would have helped to justify the cost of $1400.\n\nWith is interesting proposal, a sustainability framework would also be good to keep engaging with the student expand the reach to add value to the cardano ecosystem", "q1r": 4, "q2": "The KPIs are scanty to measure success of the proposal. As the challenge demands more of projection of number of reach, onboarding and sustainability, the information provided cannot be used to measure progress and success because there's no metric to the KPIs after the 6 campus events.", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9844, "q0": "The proposal is about introducing Cardano to University students in Australia. Although it broadly meets the key objective of the challenge, i.e. Local outreach, digging deeper it falls short on effectively addressing the challenge.  For example, there is no indication on how the proposal will ensure resilience and self-reliance within that community post the proposed event-based project.  The voter should consider if the requested funds of $19K+ is a good use of individual capital outlay for what looks like an educated university community. (the challenge brief suggests, delivering information to people who would not otherwise have the access).", "q0r": 3, "q1": "Based on the plans provided it seems that the proposal is likely to be successfully implemented however, the proposers given experience are vague and would be helpful if specifics were provided to enable the voters to access this easily.  The proposer claims to Co-SPO for DOG Pool cannot be verified. ", "q1r": 3, "q2": "Between the Metrics and success defined, it covers information on timeframe for engaging Universities and students.  Mitigations have been provided for the risks of low turn-out and impact of current regulation for large gathering, with online or intimate small gatherings. However, the proposer has not provided information on what happens to the funds of over $17K if they have to revert to online events. The proposer mentions that how the progress will be measured, provide photo evidence and feedback to facilitate transparency and auditability of the project but fails to specify where these could be found by the community. Therefore, score reflects that.", "q2r": 2, "assessor": "z_assessor_774", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10457, "q0": "That's a fascinating and practical suggestion. I can see how the issue mentioned here fits into this task, which is smart. The challenge's metrics and objectives are in line with the comparison's metrics and objectives.  This method will promote Cardano by bringing more people into the ecosystem. This approach, I feel, has a significant scalability influence in the future.", "q0r": 4, "q1": "I am convinced that the team is adequately suited to implement the project based on the relevant experience mentioned and the information about the team. The budget is detailed. However, I see a challenge in that, under the first phase  of the budget, one lump sum amount is stated for planning costs, which includes finding a food vendor, finding an event location, planning event logistics, and so on, but it would have been more appropriate to provide an amount breakdown for each of them, just as it was done for the rest, so that the budget could be better assessed. The budget also follows the MVH concept, which is one of the most important aspects of the challenge.\n", "q1r": 4, "q2": "The road map presented  is sufficiently detailed. The time range and milestones are also well-presented, which I appreciate because they help with auditability assessment. One of the KPIs that defines the success of our project is educating university students about blockchain and Cardano, which I believe is a good sign of the desired goal.\nBecause the specified problem is properly articulated, I feel the proposed solution is good or will solve the problem when implemented", "q2r": 4, "assessor": "z_assessor_919", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We propose holding six face-to-face Cardano talks / panels with catered networking for university students at two different universities.\n", "experience": "Close connections with 3 different Computing related societies.3 years experience organising university society events.Co-SPO for DOG Pool with strong relations with other Cardano industry professionals.Currently working as Software Engineering at global company."}