{"id": 404887, "author": "adamrusch", "title": "IRI: Champaign Cardano Meetups", "url": "https://cardano.ideascale.com/a/dtd/404887-48088", "category": 26439, "amount": 3000, "description": "Cardano needs more community activities that allow users to meet and network.", "funded": 0, "upvotes": 22722199, "downvotes": 13025851, "votes_result": 9696348, "votes_cast": 79, "f6_no_assessments": 6, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 117, "q0": "student meet ups and community development in universities is a great way to help build and on board community members with newly developed skills, who are excited to get involved in some amazing technology", "q0r": 5, "q1": "the proposal iis very simple with monthly meet ups and events, making it easy to implement and enables us to track progress. The team seem capable of implementing and funding is going for very simple things to facilitate the hub ", "q1r": 5, "q2": "Simple auditability process, it would be difficult to fail an audit based on these parameters, but they are very thin and high level, maybe more detail could be included, although I don't think that is any reason to really score them down as the proposal itself is simple.", "q2r": 4, "assessor": "z_assessor_1053", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 1967, "q0": "The main focus of this proposal is to create a hub (based on an existing Blockchain meet-up group) where students, the university community and blockchain industry professionals can meet in a social context, (happy hour), network and discuss Cardano. This is great because it provides a relaxing atmosphere for exchanges to happen however, the ultimate objective of this challenge is to achieve growth for the Cardano ecosystem which is quite absent in the proposal. Much as the proposal will promote information exchange, and proposers seem to have a good understanding of their target audience to package such exchanges around happy hour, the ultimate goal of the proposal does not tie in with that of this challenge. It certainly responds to the MVH principle but does not talk about ability to scale, does not highlight any strategy in place to sustain the hub financially in the long term.\n\nThe proposal may add some value to the Cardano ecosystem because it will certainly contribute to spreading information about Cardano however, the extent to which these activities will positively or directly impact on growth in numbers may be little. Also very little is said about how the hub will onboard members into the Cardano ecosystem.", "q0r": 3, "q1": "The main plan is to have happy hour meet-ups beginning in April for a period of one year at $250 a month which is quite a simple and straightforward plan. Further details which are not provided would however have been useful in enhancing the feasibility and successful outcome of the proposal. Proposers may therefore consider providing information perhaps relating to areas of discussions for monthly meet-ups, actionable tasks to be undertaken within identified time ranges to ensure successful meetings, promotional activities to be undertaken to attract patrons and a host of other relevant information. \n\nProposers indicate that any leftover funds will be used for other activities that promote the Cardano community in Urbana-Champaign in Illinois but did not specify which activities. Key risk identified is the likelihood that people will not hear about the events or will not be interested in Cardano and the proposer is anticipating that Catalyst funding will help with promotion and provision of events. I was however, hoping to see a variety of other ways in which proposers intend to attract the right audience to the meet-ups.\n\nThe proposer is the sole member of the team, is a university lecturer, experienced event organizer, blockchain enthusiast and a core contributor to ADAO which is a DAO operating on the Cardano blockchain. He appears to have the relevant background to implement the proposal.\n\nThe proposal oversimplifies the tasks required to successfully implement the hub and therefore the information given is inadequate to properly evaluate if it can be successfully implemented or not.", "q1r": 3, "q2": "For this project, success is described as \"a vibrant monthly Happy Hour Meetup for students and professionals interested in Cardano and blockchain technologies\" with the key milestone being a meet-up every month. No metrics for growth have been provided however, the Cardano community will be able to verify events taking place through social media posts and organizational updates of the hub. Proposers may want to include a means of providing consistent updates to the Community. ", "q2r": 4, "assessor": "z_assessor_1437", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10768, "q0": "The problem statement did not make it clear what the target problem is. Although it is implicit that the problem is a lack of knowledge about Cardano/blockchain tech, it would be easier to assess the impact of the proposed solution if there was an established target problem.\n\nThe solution presented has the potential to make an impact on the challenge, meetups are a popular way to create connections and teach people in the blockchain space, but due to the lack of detail on what these meetups will look like compromises the impact assessment.\n\nTargets/KPIs that allow understanding the impact of the proposal on the challenge were not established. How many people should we expect to attend these meetups? What kind of topics will be covered at the meetup? What kind of audience is expected in these meetups? People with some prior knowledge of blockchain or not?\n\nWithout this information, there is no way to indicate a relevant impact on the challenge.", "q0r": 2, "q1": "The proposal mentions only one member, Adam Rusch, who describes experiences as an event organizer and educator, but it is unclear what the proposer's knowledge of blockchain technology and Cardano is.\n\nThere are links to Linkedin, Github, Immutable Research Institute website and ADAO website. On Linkedin there is little information about the professional experience of the proposer that can validate his knowledge in blockchain and Cardano. Github was created in 2022 and has some information about the development of ADAO, but nothing robust and that can affirmatively support the proposer's knowledge of blockchain or Cardano.\n\nOn the Immutable Research Institute website, it was possible to verify that some members of the institute have significant experiences about blockchain and Cardano, but apparently only Adam is part of the proposal.\n\nThere is no information on the ADAO website that can assist in assessing the proponent's expertise.\n\nI would like to see more information about the proposer's knowledge of blockchain and Cardano and whether there will be more people to contribute to the meetups.\n\nThe total budget was defined for food (snacks and soft drinks) for meetup participants. I cannot say that it is a reasonable budget to organize the meetups as the costs of organizing and promoting the event would be dependent on some leftover fund from the food budget. It's not up to me to set budget priorities, but what's the argument for prioritizing snacks/soft drinks over event organization and promotion?\n\nThere is no plan for how many meetups will be held, how long the events will be, what kind of topics will be addressed, how the meetups will be promoted, whether there will be a need for external participants with specific knowledge about Cardano.\n\nDue to the lack of information about the plan, I do not believe that this proposal is feasible. I recommend that the proposer provide more details about the organization of the meetups.", "q1r": 2, "q2": "The proposal does not explain the target problem to be solved. The solution is relatively simple, but lacks details about the organization of meetups, number of meetups, dates and a timeline.\n\nThere are no metrics or KPIs for performance evaluation. The proposer indicates that the community will be able to verify through posts on social media, but I don't think this is an effective and appropriate way of evaluating the success of the proposal. The definition of success is extremely subjective.\n\nI would recommend that the proposer establish goals, such as number of participants, and number of meetups held at least.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10782, "q0": "This is kind of a miny proposal. The intention basically is to have monthly meetings for a year with some free food and drinks at a university pub. Not so much else is described around it. Some networking efforts at a university can sure be useful, however this proposal still lacks a more concrete plan of what exactly is planned to be done there in order to assess its exact impact. Since the budget is relatively small however, the ratio between impact and budget is still acceptable, thus I still award 3 stars.", "q0r": 4, "q1": "It can be seen that the proposers are not completely new to the Cardano ecosystem and are already up to some things and have planned some more things for Cardano and the Blockchain environment, so it can be seen that they have some competencies. The budget seems reasonable for some pub meetups. Unfortunately nit much else is planned here a concrete implementation pln of what us being dine and how is still missing and why i appreciate open-ended concepts, at least some rough framework could be done. Since you want this to be an educative measure, you could for example present some \"modules\" in the likes of milestones on which session you want to esucate on what.", "q1r": 3, "q2": "While the rough concept of what is done is explained, as mentioned above some more clear explanation could be done in order to assure better auditability. While social media posts about the monthly meetings are of course proof that they took place, the proposers could additionally describe what precisely will be discussed there and how it could be documented to ensure perfect auditability and add some KPIs and milestones", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10854, "q0": "Cardano awareness among the university students and faculty staff is definitely something that can spawn unexpected ideas and collaborations. Yet, it's questionable how much impact a monthly meet up with nothing but a social agenda can actually have.", "q0r": 3, "q1": "There's no doubt that the IRI team couldn't organize twelve meetups a year. Buying drinks and appetizers, however, might not be the best use of treasury money, even if it's a fairly small sum. Hopefully you will submit again in Fund9 and include a more detailed plan on your activities, specifically linking them to Cardano.", "q1r": 3, "q2": "The plan doesn't tell how many people would be expected per event - or what would they do in between events. As for clarity, in the \"Please describe how your proposed solution will address the challenge?\" section the answer is cut short. These kinds of blunders make the proposal appear unfinished.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10964, "q0": "The idea of ​​the proposal is in line with the objectives of the challenge, but unfortunately it is still a very abstract project. It's about promoting events (I believe all in person), in which the target audience would be students and professionals from the University of Illinois Urbana-Champaign; the subjects debated would, of course, be what Cardano is and its use cases. However, other than that, we don't know more details about the events. We don't know what kind of content will be covered; probably the proponent and its partners started by introducing what is blockchain, cryptocurrencies and so on, to then focus better on what is Cardano and what is the difference between our blockchain and the others. It would be necessary for the proponent to explain which subjects would be addressed, in what order and why. I would also like to know how he intends to attract the attention of the target audience, how long these meetings would last, what his exact location would be (they mention a restaurant, but apparently it is not certain) and so on. That is, several important details to understand the proposal as a whole. The way the idea is presented, we could not predict the impact due to lack of detail.", "q0r": 2, "q1": "There is no roadmap in the proposal. We don't know anything about the pre-production process of the events, about the variables that I mentioned in the impact. Things like: topics addressed, how to draw the attention of the target audience, how to maintain consistency in attending meetings, who would present the knowledge, etc.; should have been informed. How would all this be planned and put into practice? It is not possible to understand the process as the proposer only talks about partial results in this part of the proposal. Talking now about the financial division, it's confusing because it seems that all the money asked for would go towards food and drinks. And the professionals who would organize the events, wouldn't they be paid? Actually, that part left me a little intrigued. Now talking about them, the team involved is actually just one person: Adam Rusch. We know well about who he is and what he has done so far in his professional life; he appears to be someone already involved in blockchain, but it is unclear whether he is knowledgeable about Cardano or just about blockchain in general, which is a little worrying.", "q1r": 2, "q2": "Auditability is not adequate. It is said that progress tracking would be done through social media, but we don't know what will be posted or how often. Probably photos from face-to-face meetings, but how would we know about the pre-production process, all the steps necessary to get there? It is said that all activity accounts will be publicly available, but where? Regarding the final results, the proponent focuses only on his project, promoting a monthly happy hour meetup; but how would the reflexes of these encounters be measured for Cardano? How would we know if the specific objectives of the challenge were met? Unfortunately, this is the part that leaves the most to be desired in the proposal, requiring a good reformulation.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "The Immutable Research Institute will begin holding monthly Cardano Happy Hour Meetups near the University of Illinois Urbana-Champaign", "experience": "Adam Rusch has served as organizer of the Champaign Blockchain meetup group since January 2021 and assisted with event planning before that. As an experienced event organizer he can help interested people at the UI Research Park learn about Cardano in a relaxed atmosphere."}