{"id": 404834, "author": "romanshape", "title": "Marketplace for Artists", "url": "https://cardano.ideascale.com/a/dtd/404834-48088", "category": 26439, "amount": 39840, "description": "It is hard to enter and use the blockchain. The learning curve is not steep, meaning, it takes a lot of time to understand very little", "funded": 1, "upvotes": 22648086, "downvotes": 16059490, "votes_result": 6588596, "votes_cast": 91, "f6_no_assessments": 6, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 1917, "q0": "This proposal didn't address any detailed information about adding value to Cardano Ecosystem", "q0r": 1, "q1": "This proposal is not detailed enough about the budget, the team member and risks of failuer. Most of the budget goes to single developer salary, and none to marketing and having any classess to educate the artist about the website. My suggestion is to break the budget more and give more to marketing as well, a single team developers making website without any marketing would make this proposal to become unrealistic.", "q1r": 1, "q2": "The proposer provides milestone and success for this proposal, but not clearly enough. My suggestion is to put monthly goals for this project, and put numbers to make this as clearly as possible. ", "q2r": 2, "assessor": "z_assessor_1432", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2638, "q0": "The project idea is pretty good, the artist community is a great communication channel, but the proposal needs a lot of work to be completed. You should clearly state the approach, what the building solutions are, how they are content, how the blockchain will interact with the artists. I think the biggest risk is that artists won't listen to academic things much, artists live emotionally, give the benefits they get, practical applications like NFT will how to help them and their work.", "q0r": 2, "q1": "The progress of the project should present the steps in more detail, from which the community will assess whether the project is feasible or not, the budget will also consider whether it is appropriate or not. Currently, the proposal lacks a lot of metrics. Regarding the members of the project, please specify the name and experience of each member, and provide the associated social channels of each member for the community to review.", "q1r": 2, "q2": "The indicators you give are difficult to quantify, the community can't track the development of the project, I suggest you some indicators to help you complete the proposal better, working image, handling documents materials, the number of artists, the number of works... Success is a goal to strive for, so it should be specific and clear. What are the benefits for the artist and the Cardano community, and how sustainable is the plan?", "q2r": 2, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3733, "q0": "The proposer wants to create a new website replacing the already existing cardano website and make it simpler for the common people to understand. The proposer has not explained in detail about how this would work and has not given enough information to understand what they are really trying to achieve in this proposal. The proposer has also not mentioned how it will add value to the existing cardano system. The proposer has not effectively addressed the challenge.", "q0r": 2, "q1": "The proposer's idea is not clear and also not provided any referral links to provide evidence of relevant skills and experience needed to implement the proposal and has not mentioned about the team. The propsoer has not mentioned the resources required to complete the project. The proposer has pointed out the challenges they will be facing and can be scalable.", "q1r": 2, "q2": "The proposer does not have a planned roadmap to achieve the proposal. The proposer has request funds of 39840 USD and also given the breakup cost of all the identifiable items and the developer salary seems to be high for the jobl. Proposer has not explained his idea in detail for us to understand the problem.", "q2r": 2, "assessor": "z_assessor_1668", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7510, "q0": "The proposer/s have done a good job explaining their idea, but what's confusing is how they say its getting artists to use this website to get started with cardano,  but then it just switches to how they can sell their products on it. This needs some work.", "q0r": 3, "q1": "The plan is simple in one way, but is explained badly. They don't say how the buyers and sellers on the websites are in any way using or helping Cardano. Other than this, they have explained the budget uses fairly and showed what success would be for them.", "q1r": 2, "q2": "When the proposer/s state how they would audit success, they are doing 'milestones'. This is a good thing for a proposal to explain and is a good way to give detail to some things, but more specifics are needed to really audit the success properly. One of their milestones being 'pleasing website design' isn't exactly a milestone and also doesn't help whatsoever for checking the success of this proposal.", "q2r": 1, "assessor": "z_assessor_585", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8130, "q0": "The Marketplace for Artists encourages artists entry to the blockchain by using easy to use website like devianart.com  The proposer identifies the target group as artists and the problem as the lack of understanding of artists about the blockchain. However, the suggested solution is unclear. Devianart.com is used as a prime example of the necessity to build a website for artists. The proposal does not go into detail on why the proposal solution provided the unique selling point to the community. The proposal will improve significantly if the proposer explains more about the solution and how to serve to this particular community group to drive the adoption of Cardano.", "q0r": 3, "q1": "The team member profile links are not provided. The budget and timeline detail are provided roughly. The proposal lacks explanation on the technical aspects. The proposal will improve if it can include for example hours and rate per hour of developer working on the project and there should be a link of team working on the project so that the community knows who is behind the scene working on the project.", "q1r": 3, "q2": "The information provided in this proposal are not sufficient to make the marketplace for artists proposition a valid case. Although the proposal provides the milestones. The metrics/KPI that define the success of this project is not provided. The proposer targets the right group but there should be sufficient information for the community to have confidence in the team and the project solution. The proposal only states to build the website, contact the artists and spread the words but that alone might not be sufficient to promote cardano adoption to the artist community. The proposal will improve significantly if the proposer tries to show more detail of skill and experience of team to handle this project and to include more information on KPIs so that the project success can be monitored by the community. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10678, "q0": "The proposal reckons that there is an easy way to quickly learn about Blockchain.  It suggests introducing artists to the Blockchain by creating and maintaining a website that is easy to use like any other well known websites.\n\nThe proposal thinks that this provides accessibility and provides information allowing the visitors to learn and participate in the community's activities. However the proposal also thinks that its challenges  or risks are the mass adoption, scalability and fear of the unknown. \n\nThe proposal depends very much on the developer (36000 USD in the budget proposed) for this project to carry out. By this budget item itself, is already exceeding the 5% of the total campaign allocation.\n\nIt suggests 2 months to complete the work.\n\nWhilst I am of the opinion that this proposal has an impact on the Cardano community, the proposal does not provide an answer to the risks that it has recognised: mass adoption. \n\nFor this reason, I neither agree nor disagree that this proposal effectively addresses the challenge.", "q0r": 3, "q1": "The plan is to complete the project in two months. From the budget itemised, the main emphasis is on the technical input to the project, hence the developer's salary is the main bulk of the costing. What I saw lacking is the marketing or promotion of it, how to get visitors and patronage in an effort to achieve the overall objective of the project. Furthermore, it does not say about the continuing operation and maintenance after the completion. They are yearly running costs.\n\nFor that reason I disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 2, "q2": "The proposal has a milestone of technical activities within the website but it does not provide the goals or analytics that could give an indication of achieving the objectives of the project, getting the artists and visitors.\n\nAs such, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_968", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Introduce artists to the blockchain with easy and as easy as if they were using devianart.com, or any other known art website", "experience": "Creation and automation of E-commerce stores and Mailchimp like services"}