{"id": 404971, "author": "cardano4climate", "title": "C4C Community Hub Operations", "url": "https://cardano.ideascale.com/a/dtd/404971-48088", "category": 26439, "amount": 12050, "description": "Cardano4climate builds and participates since fund 6 in building the Cardano Ecosystem without ensured and sustainable access to resources", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 917, "q0": "This proposal directly addresses the context, scope and relevance of how the authors have already demonstrated more than a proof of concept but an active community by bootstrapping their efforts before even getting funding.", "q0r": 5, "q1": "While I give this 5 stars as the evidence is there for anyone to see, it could be further demonstrated by creating a showcase or focus highlight of the specific connections, people and organization the work already done has empowered. Without such a list it is more unclear why funding the work is important to keep it going.", "q1r": 5, "q2": "While it's a case in point this team has already produced actionable, measurable and substantial results, a spreadsheet of SDG objectives already and yet to be achieved might help make it more clear what work this team does is getting it done and plan to continue to fulfill. ", "q2r": 5, "assessor": "z_assessor_1238", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7474, "q0": "Amazing proposal and vision. This meets all of the requirements to meet the challenge brief with the core underlying mission of \"Making the World Work Better for All People, Animals, & the Planet\" Hopefully you get the feedback desired which will end with a successfully funded campaign. I scored this well as I believe that not only is sustainability a critical initiative for all humanity but also that by incorporating Cardano's vision and capability will enhance the potential for success. I understood your solution to the problem stated and I feel its relevance to nature and ultimately the planet. The benefitting community is self explanatory and you have adequately addressed the education and adoptions aspects of this challenge.\nAmazing proposal and vision. This meets all of the requirements to meet the challenge brief with the core underlying mission of \"Making the World Work Better for All People, Animals, & the Planet\" Hopefully you get the feedback desired which will end with a successfully funded campaign. I scored this well as I believe that not only is sustainability a critical initiative for all humanity but also that by incorporating Cardano's vision and capability will enhance the potential for success. I understood your solution to the problem stated and I feel its relevance to nature and ultimately the planet. The benefitting community is self explanatory and you have adequately addressed the education and adoptions aspects of this challenge.", "q0r": 5, "q1": "Given the detail and depth of the team you have assembled I am confident that with the various skillsets on display that you will find success with this project. Your plan is solid and I feel like this could be a great initiative. I do not have any constructive criticism at this stage as what I am seeing I am loving.", "q1r": 5, "q2": "I value your efforts towards transparency and also your key metrics are solid... dare I say similar metrics to Project catalyst itself so clearly valid. I feel as though you have adequately met all of the requirements to be funded and I wish you the very best in this lofty endeavour.", "q2r": 5, "assessor": "z_assessor_575", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10102, "q0": "The proposal brings together in a problem (Climate Change), the community,  and a support tool (Blockchain) that could help with a solution. The way the C4C hub operates is in line with the challenge requirements to focus in Minimum Viable Hubs, and the funds required is below 5% of the Challenge Budget at 2.4%.\nC4C hosts community events & meetings to connect ideas, initiatives, discuss & solve problems, & initiate collaboration. This is in line with the Challenge brief and will have a positive impact on the Cardano/Catalyst ecosystem.\nThe KPI's match those of the Challenge, to increase the hubs around the world,\n to increase members of the hubs,  and bring more developers to the Cardano Ecosystem.", "q0r": 5, "q1": "The experience and skills of the team is briefly laid out, and their experience fields are wide. Unfortunately there are no Linked-in Profile links, so the information given of each member is very limited. I have watched their Meet-ups on You-Tube and I do believe they have the necessary skillset to make this work. Their budget is clearly outlined and at 2.4% of the Challenge budget leaving enough funds for other proposals. I don't see a detailed implementation plan, but they are already in motion with scheduled and ongoing meetings and discussions. The budget is mostly for paying members for their work and subscriptions and web hosting. ", "q1r": 4, "q2": "The project can easily be tracked because of ongoing meetings, videos and channels like Telegram and Discord. Their goal is to grow membership to over 400, improve event attendance by 50% or more and improved social media navigation, etc. I therefore rate them 5 for auditability.  ", "q2r": 5, "assessor": "z_assessor_795", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10494, "q0": "There has been an increasing activism and consumer consciousness all across the globe with over trillions of dollars are being pledged towards helping bring lasting solutions mitigating and reversing Climate change. It does appear that the  current systems are inefficient and ineffective. There exists a widespread lack of transparency, community trust & impact on a global scale. The proposers have been able to posit that solutions being proposed by world leaders are centralized and do not work for everyone. I therefore see the proposal addressing the challenge that confronts stakeholders in being informed about climate issues across the world.\n\nThe Cardano4Climate seeks to utilize an opportunity for Cardano to combine new blockchain models with ground-up, community-driven challenges and solutions arising from climate change. The proposers have been able to state that they will align with individuals, as well as the conditions necessary for the creation of regenerative systems to create a vibrant environment. This I think will address the challenge effectively. I strongly agree with the proposers and so I score them 5.", "q0r": 5, "q1": "The core team members are very active with the community and in addition to their rules being active as challenge setting members, impact activities, other communities, and in the overall spread of the Catalyst and the Cardano community. This is good since they are well experienced in about the project's activities. It will equally help to execute the project with the quality of results it deserves.\nThere is also a clear plan on how the community hub operations which is within three months. This is worth commending.\n\nThe proposers have since the past 3 months, hosted several Project Catalyst after town hall breakout rooms. This is an indication that they have a wide range of experience with the project at hand.  \n\nThey have also partnered with other Catalyst communities to collaborate such as Climate Neutral Cradano SPO group, DLT360, WADA, SWARM, Catalyst school, SustainableADA, and more. This gives a positive outlook of their past works in the community and will further enhance the smooth execution of the project.\nI therefore strongly agree with the proposers that they will do a great job when funded.\n\n\n\n", "q1r": 5, "q2": "There is a positive plan on monitoring the progress of work from the proposal as they are committed to improving the transparency of the entire process and decisions. There is also an increased accessibility of this information to all of stakeholders from the proposal.  The of a public GitHub repository where all ongoing tasks and actions will be tracked regularly as seen in the proposal is also a very positive sign. It's an indication that auditability of the progress sand success of the proposal is attainable. The Key Performance Indicators outlined I think should have been more specific and include how the proposers could tap the global ideas on the proposal.", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "This proposal aims to enable the required budget to reward Cardano4climate core contributors and services over the next 3 months.", "experience": "Cardano4climate is a community-driven project which emerged itself through engagement in Project Catalyst. We proactively participate in building the Cardano Ecosystem and provide constant services to our Community"}