{"id": 405177, "author": "rivenbark", "title": "Growing Cardano’s Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/405177-48088", "category": 26439, "amount": 30000, "description": "Cardano users and projects need trusted, reliable sources to learn from and connect with other Community Members.", "f6_no_assessments": 8, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an already well established global community hub and I am glad they are trying to take this to the next level. They already have a well established community but improving the reach of any or all of these individual spaces or individuals will help create a stringer and more inclusive community that will help develop a more positive ecosystem for Cardano!", "q0r": 5, "q1": "A huge team all collaborating, with a long proven track record and history of great work, a clear roadmap and budget breakdown give me no doubt that this proposal will enable them to implement this successfully", "q1r": 5, "q2": "Clear metrics, KPIs and a powerful vision for a successful project will make this very easy and even a pleasure to audit and track over time", "q2r": 5, "assessor": "z_assessor_1053", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This Proposal clearly defines an intention to further scale and improve an already proven and established community Hub (ADA Cafe). It not only address the challenge but is strengthened by six months of \"proof of concept\" work that can be fully audited by the community. ", "q0r": 5, "q1": "Experience from the six months of \"proof of concept\" work and research has been clearly leveraged and mapped out in this proposal. Challenges, both current and unforeseen are also acknowledged as well as plans to navigate said challenges. It does seem highly likely this team will be able to implement and continue to build off of the groundwork already laid. ", "q1r": 5, "q2": "Due to the decentralized and open nature of this proposal and the community auditable groundwork that has lead up to it) the success and growth of this proposal should be clearly auditable. Any Cardano community member should be able to audit this proposal by visiting the numerous digital community spaces held everyday on Twitter or in text form via the projects Discord.", "q2r": 5, "assessor": "z_assessor_1221", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposal to provide a digital space for Cardano enthusiasts to learn from and connect with other Community Members is a brilliant one especially since the ADA Cafe has been operating for over 6 months and already has a good number of patrons. Aside supporting media projects, the cafe also hosts several community spaces daily and therefore has a good following around which they can build and engage a community. The proposal delivers relevant Cardano related information to people through a variety of programmes and provides plans of ensuring community self-reliance with time through paid programmes. The proposal also addresses the MVH principle of the challenge, intends to make use of some already existing infrastructure and has shown that there is community readiness for the hub from the cafe's existing patrons. The possibility to scale easily is also an integral part of the proposal. It will certainly add value to the Cardano ecosystem by effectively engaging people through its content and programming and consistently onboarding people into the ecosystem.", "q0r": 5, "q1": "The Ada Cafe has 3 focus areas by which it intends to deliver value, these are : access and information sharing, connecting people and groups and mentoring. An implementation plan outlining specific tasks to be undertaken within 3, 6 and 12 months is  presented in the proposal and well as a budget split into identifiable items and which is coherent with the plan. In view of the background and experience of the team (external links to profiles provided) and the programs the Café is currently delivering to a sizeable audience which keeps growing, it is safe to conclude that the project is feasible. Proposers have identified a number of risk factors which could jeopardize the success of the project and have also identified ways of addressing them. ", "q1r": 5, "q2": "Auditable KPIs have been provided, some with measurable metrics which are easy to verify. Proposers also intend to document work performed on the project via shared document with the Cardano team to facilitate updates to the Cardano community. In addition, the fact that the Cafe's work will largely be done using online spaces makes it easier to audit progress from any part of the world.", "q2r": 5, "assessor": "z_assessor_1437", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is really helpful, as an important bridge for the Cardano community to interact with each other. Helps increase community sustainability and cohesion. It is worth noting that ADA-Café has started and has a certain number of members. I have a small question, besides being a place to help the Cardano community in many areas meet and interact with each other, does ADA-Café provide any other tools? For the community to develop sustainably and transparently, and what role do you play in that process? In addition to the above question, I strongly support this proposal", "q0r": 5, "q1": "The project development roadmap and budget you presented are very detailed, clear, oriented, I am very impressed. Teams have many strengths in different areas, it will be a great combination, however, there will be members who are mainly responsible for implementing the project, you can introduce specifically and provide Provide social channels to help the community transparently review and exchange necessary information about the project. For example: the creator of ADA-Café, who played a key role in the direction and completion of the writing of this project…", "q1r": 4, "q2": "With what you present in this section, all convincing, everything is really clear and easy to quantify. I very much hope that my small contributions will help the project improve further so that the Cardano community has a place of connection and sustainable development.", "q2r": 5, "assessor": "z_assessor_1544", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aims  to develop a B2B service for projects building on Cardano named The ADA Café. They provide quality services and resources to optimize manual and tedious works for all projects. It makes the Cardano ecosystem more and more specialized. Thus it will improve Cardano projects not only in quantity but also in quality. I love the idea of using The ADA Café as a bridge builder to connecting people and groups, sharing information. It strengthens the bond between people in the community. There is a bonus point for this proposal is that the team has launched The ADA Café since 2021 and has done several jobs for the Cardano community.  In summary, the proposal addressed the challenge effectively.", "q0r": 4, "q1": "The project timeline is clearly presented in 12-months plan. They have a very high level of detail on the goals, action plans for each phase. It shows the commitment of the team for the project as well as their experience in this field. The proposal requests 6% of the total challenge budget, not a small number. The expenses are clear and broken down enough to be easily understandable. However, the proposer should mention in more detail the cost for each item. The proposer has indicated quite a lot of information regarding their team member with reference links. However, it would be quite difficult for the community to understand who are the governance team of this project and what the link between the listed projects. The information for the creative & community team is presented very well with a quite long list. So I agree that with the given information, this project is highly likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has mentioned their method of tracking project progress by their documenting work. With their very detailed timeline, it is not hard for their team to track their work and control budget spend. However, it would be better if they could explain how the KPIs are measured and documented, how the community could audit their recorded document to understand the actual progress. The KPIs and success metrics of this proposal are not presented nicely, some of the information is hard to understand. For example: Twitter space increases 10%, ADA café website increases traffic 1000% without appropriate time, such as in a month or a year. I think the KPIs and success metrics should be measurable and easy to check by the community. So I disagree that the provided information is sufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_1588", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I absolutely love and support this proposal. Creating a community hub for the builders of Cardano, and for the community at large to learn what's going on first-hand, is a huge value add. Entrepreneurs just getting into Cardano need support and guidance and this group has been providing that for months already.  This group is a valuable contributing group to Cardano's ecosystem and should be supported. ", "q0r": 5, "q1": "The experience of the team is apparent in every show they've produced, and the consistency at which they've produced them. The lineup of the creative & community team is lengthy and impressive, full of well-known, consistently contributing members of the community. Their budget breakdown is extensive, well-thought out, and reasonable. I'm looking forward to what this group can do, with our ongoing support. ", "q1r": 5, "q2": "The proposal was very well written and clear. Even if I didn't have first-hand knowledge of all of their contributions, this proposal was written in a manner that instills credibility into the words. The timeline was well-broken down, the budget itemized nicely, and the team is full of Cardano all-stars. It's exciting to be able to peak ahead at what's to come with this group via this proposal. ", "q2r": 5, "assessor": "z_assessor_407", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "While this sounds like a great project, I think that maybe it is suitable for the business challenge. One can argue that they provide information through twitter space, but I still would take it to the business challenge. Besides this controversy, I think that it’s clear that this project will add value to the Cardano ecosystem. I have to clarify that the project is running for 6 months now and they have achieved pretty good results. For instance, they have supported the launch of 11 projects on the cardano ecosystem. They operate as a business to business hub which helps the launch of projects like NFTs and so on. However I think that the goal of this proposal does not align with the challenge. Another problem of this proposal is the budget which is more than the max 5% of the total challenge budget recommended in the challenge setting. For all these reasons, I give it a 4 rating. Note that I might give it a 5 rating if it was in a business challenge.", "q0r": 4, "q1": "Since the project is up and running for 6 months, I have high confidence in the successful implementation of this proposal. The proposer has provided links to the twitter profile of all the team members. Furthermore, they have a very detailed roadmap including a timetable for completing the work. The budget is broken down into identifiable items that seem reasonable to achieve the goal. They also have a plan describing what is being built and how they intend to do it. Moreover the proposer hasn’t omitted the technical details such as the website UI and UX design. For all this, I believe highly in the successful implementation of this proposal. ", "q1r": 5, "q2": "The proposal includes a really detailed roadmap which includes a timetable to complete the work. Based on the informations provided by the proposer, It will be very easy to track the progress of this proposal. This proposal also includes metrics and KPIs that define the success of this proposal. Finally, I can say that the proposer has provided a clear understandable description of the target problem and a clear solution as well. For these reasons I have high confidence in the auditability of this project.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "An interesting proposal using data and reliable resources to educate the member of the hub. The solution is highly multifaceted and that many strategic plans are have been put place to address the problem. Though the proposal in some extent meeting challenge's description with target groups, the solutions are capital intensive.  \nconcentrating on one area of focus instead of three would make the hub great and be able to drive the change and impact easily than doing too many things in a limited time. ", "q0r": 2, "q1": "The proposal has interesting programs and activities make the coffee hub a place one cannot ignore but the budget is not detailed and at the same time the requested amount exceeds the 5% of the total Challenge budget.\n\nThere is also a sustainability plan for the project self-funded to run the hub. This is a good initiative and the proposers should try working on it to be the pioneer in this regards.\n\nThe details of the team is quite enough and could be able to implement the project for results. ", "q1r": 2, "q2": "The proposal is having interesting KPIs that could be measured with ease. This will make the evaluation simple since the proposers have instituted metrics that can measure outcome over time and at any given time. However, the budget makes this quite difficult in the process to justify the need to sail through. ", "q2r": 2, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Scale Cafe services, expanding ability of digital hub to support 11 projects connect, onboarding, and educating all Cardano members.", "experience": "ADA Cafe has been operating for 6+ months, supporting 11 media projects, launching 2 new NFT artists, and pioneering a NFT category (Non fungible visualizations). We've grown our Discord to 630+ people, have 93+ Patron Members, and host several community spaces per day."}