{"id": 405299, "author": "harry.hellyer", "title": "Community Hubs Impact Accelerator", "url": "https://cardano.ideascale.com/a/dtd/405299-48088", "category": 26439, "amount": 19800, "description": "Community Hubs are often seen as charitable causes as the Value they deliver: Cultural & Commercial, Short & Long term is hard to quantify", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3736, "q0": "Strong communities are critical because they're often an important source of social connection and a sense of belonging. Participating in a community bonded by attitudes, values, and goals is an essential ingredient to enjoying a fulfilling life. The proposer's idea of producing a blueprint that will integrate the business strategy and operations necessary to empower a Community Hub to become a social impact organization (SIO), delivering both cultural return on intent, and, commercial return on investment is brilliant and will benefit communities a lot in the future. The proposer has uniquely identified a need for making community hubs as social impact organization and they have also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing Community Hubs Impact Accelerator and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 19800 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more buyers which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5832, "q0": "The Edify team/network has identified a problem worth solving: helping local community hubs to become self-sustaining social business entities with both cultural and business impact. Although the challenge was mainly looking for proposals for individual Community Hubs and this is a more “meta” approach that aims to help a multitude of community hubs get started, the problem statement still matches the challenge well.\n\nThis six-week “impact accelerator” is essentially a coaching process for 10-15 selected SPOs who wish to initiate/lead a community hub. This will be first rolled out and tested in Africa. It is an MVP approach that will produce a replicable blueprint to be used in a wider roll out. People who get to go through this accelerator will surely be more ready to drive adoption and awareness of Cardano at the grassroots level. The idea is for the new community hubs to become self-sufficient, revenue generating, Social Impact Organizations that can offer services for SPOs, Accelerator services, Tech Dev support, Local Community Advisor services and solutions for Rapid Product Development.\n\nAs a proponent of agile methodologies and a strong believer in “release early, release often” ideology, I must say this quick implementation and iteration based on feedback is just the right approach to take. Potential recurring impact of the proposed solution is huge, yet I like the team’s down to earth approach to build on what works and test it out before even planning a wider implementation. This makes it possible to adapt the model and to incorporate aspects that were not thought of in the beginning.\n\nThe proposal clearly articulates how it will add value on the individual level, community hub level, country level and from the perspective of Project Catalyst as a whole. This approach is definitely ‘empowering people to change their lives in ways they could have never imagined’.\n\nTo improve the plan you could add the projected reach in 3, 6, 12 months as requested by the challenge team. Also, it is mentioned that this is a continuation for the successfully funded MVP “Impact Innovation Accelerator” (https://cardano.ideascale.com/c/idea/385017). Next time, please provide direct links to related proposals, for easier navigation. All in all, however, the key metrics and goals of the proposal align with those outlined in the challenge setting. Expected impact is high and the approach is definitely scalable.", "q0r": 5, "q1": "This is a strong proposal because it is based on earlier learning points, time-tested frameworks and a high caliber team. To ensure relevance for the target group, it is being developed on the ground, in collaboration with WADA and other experts. Harry and the team have demonstrated capacity for creating such impactful solutions. Individual team members’ credentials are outstanding.\nThe proposers are well aware of what is needed to make this a success. Required capabilities include an ability to organize, advertise and measure the impact of an Accelerator program. Furthermore, it requires an ability to attract participants and to mentor, coach, consult and train them properly. Finally, they need to be able to design the model and report on the successes of the MVP program. The proposing team already has most of the required know-how and they are open to adding new talent and collaborators in the team as well.\n\nRight now the proposal centers largely in Africa and the team relies on WADA to reach out to potential community hubs. That’s perfectly fine because it is a strategic focus area for Cardano. It is mentioned that WADA will apply for funding separately in Fund9. Therefore, costs related to their participation are not considered as part of this proposal. It would have been nice, however, to include a little bit more about WADA participation in the section about involved teams and partners. Now all it says is “WADA brilliance”.\n\nIt is unclear what the plans are after the roll out in Africa. As someone who has been thinking about starting a Community Hub in Europe, a program like this could be a viable channel to be coached for success. Since the focus is not in Europe, it might be a long time, however, before I can participate in this accelerator. As it is mentioned as one of the risks/challenges, I would have appreciated a little bit more details about replicability into different societies and market environments. \n\nThe SPO angle is interesting. The linked Project Roadmap (Miro board) shows that it all starts with selection of suitable SPOs. There could have been more reasoning provided for this choice to direct the coaching for SPOs only. Why can’t they be, for instance, active community members or even curious and competent entrepreneurs coming from outside the Cardano ecosystem?", "q1r": 4, "q2": "Certain measures asked by the challenge team, like the “budget:cost-to-launch ratio between 1-1.5”, are not applicable for this project because it is not a proposal for an individual community hub. It does not exceed the recommended 5% of the total Challenge budget ($25k). The plan definitely accounts for local needs and infrastructure concerns, shows creativity around hub design and has a commitment to people, planet and profits (and performance).\n\nThe budget is outlined clearly. Budget line items are presented on an hourly basis. My only concerns are that a) the extent of work involved might have been estimated too low and b) because it is delivered by a consortium of small businesses, the hourly price is quite high compared to proposals led by individuals that are not associated with a business entity. It is not indicated how big the budget will be for the full-fledged roll out after this MVP but I would imagine the economies of scale will kick in. The model seems replicable and scalable and the cost per cohort will most likely be much less when the blueprint is ready and more facilitators can be brought in.\n\nMost of the budget line items are earmarked for either “Edify R&D management team” or “Edify workshop delivery team”, raising a question about what the role of other companies (Golgafrincham, Slartibartfast etc) is. As these are marked “Member of the Edify Community” one could assume they will be getting part of the budget but it would add clarity if the operations of this collaboration network were opened up a bit more.\n\nFinally, the proposal could have used some polishing. It sounds about 98% done. For example, in the enclosed Miro board (https://miro.com/app/board/uXjVOE42T9c=/) there is an incomplete sentence “Time taken to ensure participants are”. There are not too many of these suggestions for cosmetic changes, however. All in all, the proposal is quite strong—even more so than the team’s earlier proposal that got funded in Fund7.\n\nThis proposal definitely delivers value for money and the asked budget is appropriate in relation to the promised deliverables and potential impact. The metrics are clear and the team is committed to follow through. Communication is well planned. It will be easy to see the progress.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6631, "q0": "This proposal is brilliant. My only concern is that it may be more suitable for the business challenge. Besides this fact, this is a great idea, and it should add massive value to the cardano ecosystem. Basically, the proposal aims to help community hubs to be more efficient. This will be done by providing them tools that will help them be self-sufficient and generate revenues etc. For example they can provide services such as SPO that will help generate revenue for the community hubs. As a matter of fact, the majority of the community hubs will rely on catalyst funding to survive and scale. With the help of this proposal, these community hubs will have other sources of revenues to sustain themselves. Furthermore, this can be used outside of the catalyst ecosystem to reach countries. I think that this proposal can have a high impact on the cardano ecosystem if implemented successfully.", "q0r": 5, "q1": "I have a good amount of confidence in the implementation of this proposal. The fact that they have already funded a project, is a positive sign. The only issue that I have is that the proposer didn’t include links of the team members' linkedin profiles. I suggest to the proposer to add these links in order to increase their chances of being funded. Besides that, the proposal includes the team members and profiles needed to implement the project. The budget is broken down into identifiables items and seems reasonable based on my intuition. Furthermore, the proposer has included a detailed roadmap that included a timetable to complete the work. The proposal has also a detailed plan that shows exactly how the project will be executed. I can honestly say that the proposal has all the information needed to be implemented successfully.", "q1r": 5, "q2": "This project is auditable as it provided all the information required to be tracked by the community. The roadmap provided by the proposal is clear and includes a timetable for the work completion. It also includes strong KPIs that define the success of the project. The problem has been well defined and the solution seems flawless. I think that this proposal is needed to bring the cardano community hubs to the next level.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9126, "q0": "This is a well thought-out proposal, addressing an important gap to enable the community hubs to be self-sustainable. There are more community hubs that do not have sustainability plan in place and there exist no blueprint documents to learn from. To avoid the catalyst community hubs from becoming dormant and inactive, it important to train the leadership of the hubs or to offer them documents for the hubs to demonstrate how they would apply the content to continually stay relevant in the ecosystem. \n\nThe proposal therefore is aligned to the challenge to sustain and improve the hubs relevance for the cardano ecosystem. ", "q0r": 5, "q1": "The proposal has detailed action plan to provide the training and mentorship for the hubs to be self-sustainable with a strong team. However, I am expecting links of the team members to confirm their expertise.\n\nThe proposers did not provide sustainability plan to keep this important project alive. A group seeking to make other groups (hubs) to be self-reliant, in itself do not have a plan to keep their own proposal relevant in a long time. Here, one may not know whether the CHIA will continue to depend on cardano funding or will be funding itself. ", "q1r": 3, "q2": "The proposal has great milestones but do have projected metrics to guide the evaluation process. The proposal should be able to estimate the number of hubs to reach and hubs that could come on board to learn best practices to be sustainable. \nThe information provided may not be enough to measure success", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Impact Accelerator empowering CH’s to become self-sufficient social impact organisations so realising their cultural & commercial potential", "experience": "As Impact focused experts we run high growth coaching & mentoring programmes from tech startups, through to Global businesses & Universities. \n \nThis is a continuation of our funded MVP for the F7 Accelerators and Mentors challenge, in our Impact Innovation Accelerator project. "}