{"id": 405477, "author": "lucyjiang", "title": "Oxford Student Hub", "url": "https://cardano.ideascale.com/a/dtd/405477-48088", "category": 26439, "amount": 4150, "description": "Cardano lacks community awareness and needs more developers. Lack of quality articles explaining Cardano and the ecosystem.", "f6_no_assessments": 9, "f6_rating": 4.518518518518519, "videos": [], "media": [], "f6_assessments": [{"id": 5833, "q0": "This team of five students and researchers from Oxford has taken a very pragmatic approach to creating community awareness and attracting/grooming potential developers before they enter the job market and become prohibitively expensive. They have a step-by-step plan to drive Cardano adoption among students. They are implementing this plan one step at a time. This proposal tackles specifically the lack of quality articles explaining blockchain, Cardano and Catalyst in a way that speaks to busy and smart students, the top talent of tomorrow.\n\nThe proposal is definitely in line with the “minimum viable hub” approach as its goals are almost too humble. Yet this agile implementation/iteration process—and the articles, illustrations and infographics created as part of this proposal—are something that can be later used to create student hubs in universities around the world.\n\nAs a former student activist with years of personal experience from a global student-led organization I salute this kind of student activity in these times that students are increasingly pressed with demands to graduate quickly and get a well paid job. This team clearly understands the target group (because they are part of the target group themselves) and they have managed to create an approach that is easier to sell to the students: this has an immediate impact in their future employability and it can allow them to get Catalyst funding for their projects already while studying. It’s an approach that empowers students to take the lead of their own careers and contribute to Cardano at the same time.\n\nThis proposal builds on a previously funded proposal (https://cardano.ideascale.com/c/idea/381527), from the same team. If this proposal was funded, it would allow the team to offer a scholarship for selected students to learn Plutus/Prism as a “summer job”, as well as to introduce students to Catalyst as CAs and proposers. The proposal surely addresses the challenge well, although the scope is limited to the local reality at Oxford and it only aims to get a specific set of tasks delivered. With an added level of ambition, the impact could be a lot higher.", "q0r": 4, "q1": "This is a strong proposal because it builds on the same strong team’s earlier work. These are not just any odd students and researchers but a high caliber selection of brightest minds in academia. Their listed credentials are so strong that I wouldn’t be surprised if some of these co-proposers would continue to become future Nobel laureates. Yet they are not one-track-minds. This is in fact the first time I get to write an assessment with a soundtrack included. One of the co-proposers, Dr Adaku—a PhD holder with a double MSc—is also a songwriter. This is a good example of a multi-talented team. I am so convinced of the team’s ability to produce quality results that I would almost suggest adding a zero or two after the next proposal sum in Fund9, if there is another follow-up proposal.\n\nThe linked notion page is a great example of the team’s ability to simplify complex matters. The proposal would be even better, however, if it included samples of articles written by the team. Other than that it’s hard to think of anything to improve. A solid and simple plan. A well outlined, reasonable budget. Clear timeline and milestones. A strong team. Top quality.\n\nPotential risks have been well outlined and addressed. It is a great idea to collaborate with the different societies and reach out to students via different channels, using customized messages tailored to a particular target group. So far the team has not thought of any other incentive to lure people in apart from free food and drinks. If that works, fine. But there are so many other instances competing for the limited time of the students that this is probably the aspect to focus on the most. What is the unique factor that speaks to students in Cardano/Catalyst? I’m afraid there’s no simple answer to that question and it will only be revealed through trial and error. Furthermore, what works in Oxford, might not work in Cambridge. What works in the UK, might not work in Sweden or Nigeria. Looking forward to the team sharing their insights as they learn more.", "q1r": 5, "q2": "The plans and budget are clear and the set goals are realistic. Information provided is sufficient, making progress/success auditing easy. Projections for marketing reach / onboarding of hub members is included in 3, 6, and 12 month milestones. The team’s decision to ask for the public address of each member’s ADA wallet is a brilliant way to track the on-chain activity of the members also afterwards.\n\nAll things considered, it’s difficult to poke holes in a proposal so clear and easily auditable. Value for money delivered, once again. My only question is this: Have you thought about how to make the Oxford Student Hub financially self-sustaining? Can you productize and sell your know-how or find ways to get recurring funding from outside of Catalyst?", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1202, "q0": "The Oxford Student Hub address the challenge excellently. They have paid particular notice to the success criteria the challenge sets out such as MVH, cost to challenge ratio and considers the value this hub can bring to Cardano at multiple different levels such as developing with Plutus to Project Catalyst. The value add to Cardano is very evident, particularly as the captive audience such as under and post grads can offer enormous potential for the future. Additionally, whilst their is a clear \"minimum viable hub\" prospect, there is also potential to scale this hub into greater depth at Oxford, but also could be opened to other educational institutions at a later stage ", "q0r": 5, "q1": "The roadmap is concise and realistic enough to deliver value in their suggested timeframe. They also have considered the length of the project to deliver value across 2022. Budgeting is clearly broken down (into granular detail) and is realistic agains the set of tasks detailed with fair value on hourly rates and general admin costs. The team appear to be a strong one with previous experience within Project Catalyst and Cardano. They have also considered risks to the project and have provided solutions where they can to solve.", "q1r": 5, "q2": "With a clear roadmap and deliverables detailed it will be likely that both auditing progress and ultimate success of the proposal will occur. I would have liked to have seen how evidence can be shared on progress such as detailing attendance records, images/video of events and other general \"in-flight\" proof of traction. General metrics/KPIs can be distilled by whether or not the tasks have been completed as detailed, and they have provided two simple KPIs (social media engagement and new wallets registered). The former will be easier to publicly track with the latter a little more challenging. Overall, the problem and solution to the challenge is clear and again likely to lead to success of the proposal. ", "q2r": 4, "assessor": "z_assessor_1304", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5260, "q0": "I got halfway through the impacts section and was immediately sold. For the extraordinarily low price of $4150, we can get direct exposure to Oxford students that can be onboarded as CAs and Plutus Pioneers. I don't mean to overhype Oxford. I know there have been accusations out there about Oxford losing some social credibility, which I feel is a bit harsh and exaggerated but I digress. Oxford is still a world-recognized academic institution that has the potential to add credibility to Cardano! Likely, in a relatively small way. I think the proposers undervalue what they can bring to the Cardano ecosystem as a reputable University receiving sponsorship from the self-proclaimed \"research-first\" blockchain. I realize that I have yet to address the actual proposal impacts up to this point in my review, I just needed to acknowledge the value-cost ratio. I LOVE the documentation created and presented in the impact portion. It's a very well-researched and thorough comparison that should probably be more widely circulated. I really like the idea of onboarding Oxford students as CAs too. I think the resources and information the Oxford Blockchain Society provides to get students involved in Cardano is a strong material. They might just need a bit better on-campus marketing/incentive. The food should help. ", "q0r": 5, "q1": "I've seen $50k+ proposals that had WAY worse roadmaps than this. The amount of work they do to prove that they are deserving of less than $5k is overkill. Of course, the scale at which they are impacting is far less than a lot of these other projects. The 12-month roadmap that they provide is very realistic, yet still challenging in the context of their target audience. In the course of 12 months, they plan to \"convert\" 100 students to Cardano and get 10 students established as Catalyst CAs. In my mind, that's $40 per Cardano participant (10 of which will be heavy contributors to the community in Catalyst) and they establish a much better grounding to continue their work in driving adoption on the Oxford campus. ALSO, the budgeted rate for the production of writing and research is SUPER undervalued. The average wage for Oxford residents is a little more than $50k/year, which translates to approximately $27.50/yr at 35 hours a week (UK full-time). For some impressive quality materials, based on what I've seen so far, that's a deal! If they keep requesting Catalyst funds for such quality levels of production at such a low budget with major potential for impact, I'm glad to vote yes 100% of the time. ", "q1r": 5, "q2": "They listed all the success metrics and KPIs in the previous section. I'm big on thorough KPIs and timeline-based success metrics. I really like it when proposals give quantifiable progress goals because it demonstrates an intention to course correct along the way. With the evidence they provide in this proposal, I entirely expect to continue seeing their hard work on display for public accountability. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5375, "q0": "The problem is clearly identified in this proposal and is closely aligned with the challenge. As blockchain technology and the Cardano ecosystem is still in its early days, it is important that awareness is established to accelerate the growth of Cardano. By increasing the exposure of Cardano to students at Oxford university, an institution where some of the worlds best academics attend, this proposal clearly articulates how it will add value to the Cardano ecosystem in both the short and long term. The project has a very well thought out plan on how it will achieve their goals in relation to their outlined challenge settings. Partnering up with student societies is an effective way of gaining exposure to different social backgrounds. It gives me great confidence in this project as they have recognized their future challenges and how they aim to solve them. Their ability to identify the different levels of blockchain knowledge in their audience portrays that they have recognized a challenge and worked out a solution for their future audience. I would have liked this proposal to explore the use of key metrics to support their challenge i.e. a percentage of Cardano wallet holders in the University or a ratio between people who have beginner and advanced blockchain knowledge.", "q0r": 5, "q1": "It is evident that the proposer is reliable as they are already putting in motion partnerships, events and putting together educational resource to increase the exposure of the Cardano ecosystem. They also have future plans of creating scholarships which indicates that they also want to continue to add value to Cardano. The information presented on the team is detailed and clear. Their linkedin profiles look professional and they appear to be high achievers. I believe that this team have the skills and experience needed to implement the proposal. There is clarity in their roadmap with realistic timelines. I also like how they have key metrics to identify the success of each phase of their roadmap. It gives me the impression that they are productive and hold themselves accountable. The budget that they proposed is very detailed and the amount requested to achieve their goals appears to be reasonable. It was great to see that they were very particular in how they broke down the allocation of funds with every single item. The proposer also describes the resources needed to succeed and is reflected in their proposed budget.", "q1r": 5, "q2": "The description of the problem is clear and concise. Auditing the proposal was a smooth process as the solution is closely aligned with the challenge and is depicted well through the information on their background, previous experience, roadmap/milestones and budget. The metrics and KPI’s used to evaluate success are closely attached to their roadmap which gives me assurance that they will be constantly monitoring their growth. The information provided was sufficient – It was easy to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_1953", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6633, "q0": "This proposer is trying to build a cardano hub in the Oxford university. Targeting students to join the cardano community is a great way to add value to the ecosystem. In that sense, the proposal identifies a problem within the challenge that needs to be solved. Furthermore, the proposal targets students in computer sciences who can possibly be developers in the cardano ecosystem. Students can also be trained to be part of the catalyst ecosystem, which will add value to the cardano ecosystem. Some of them can work as CA while some of them can be proposers or developers. I have to say that the proposer has added clear key metrics that are aligned with the challenge. Regarding scaling in future challenges, the proposer should have mentioned it but, I assume that the proposal should be able to scale in future challenges without much issues. For example, they can increase the number of attendees, or just target other universities, since, at this point, the proposers should have the blueprint.(5 for impact)\n", "q0r": 5, "q1": " I believe highly in the feasibility of this project. In fact the proposer has provided the necessary elements that increase my confidence on the successful implementation of this project. In that regard, the proposal includes links of the linkedin profiles of the team members. The proposer has also identified the team needed to  implement this project successfully. The budget has been broken down into identifiable items. It is reasonable in my opinion. Furthermore, they have provided a timetable to complete the work. The items described in the timetable look achievable. I can say, from the plan layered by the proposer, that they have some experiences on the subject. In fact, this proposal is a continuation of a funded proposal in fund 7. They have identified issues and new ways to do things better. That’s why I have confidence in the proposal and its successful implementation. (5 for feasibility)", "q1r": 5, "q2": "In this section, the proposer asks us to refer to the feasibility section. The roadmap and timetable specified in the feasibility section can be considered as the same thing. I would recommend to the proposer to just add these sections, even if they are the same thing. Or the proposer can add something. Other than that, I think that the proposal is auditable as it included a detailed roadmap and KPIs that define its success. Furthermore, the problem described is clear and understandable, as well as the solution proposed. (4 for feasibility)", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8974, "q0": "The proposal is about to maintain the student hub at University of Oxford which was the winning proposal in Fund7 with link included\nhttps://cardano.ideascale.com/c/idea/381527 \nAs my reading, the winning Fund7 proposal was about to create a scholarship for students to learn Plutus/Prism, promote Cardano and help students to particapate Cardano community as CAs. In Fund8 the team wants to maintain/scaling up that Cardano community Hub by writing articles and creating educational infographics about Cardano to help students in the community have deeper knowledge about Cardano, lead them to the Cardano ecosystem and Catalyst Project. In my opinion, the proposal definitely fits into the challenge as well as adds value to Cardano ecosystem. If it is successful, the proposal will keep helping to increase number of new members onboarding, number of active members, number of quality proposals from Oxford students community and so much more, in other words, the proposal keeps encouraging the local Community Hubs to drive adoption and awareness of Cardano.", "q0r": 5, "q1": "The authors provide a detailed plan in a timeline 12 months with detailed budget breakdown and information of the proposers for us to assess the feasibility of the project: Regarding to the plan, we can see what needs to be done in term of 3, 6 and 12 months. The financial amount is broken down in details and reasonable, which allows us to understand what needs to be spend money on, and how much it costs. About the team who will execute the project, due to the information which is provided fulfilling with skills and experience related to the executing the project, I believe the team is capable to do the project. The risks/challenges that the team has to face when conducting the proposal are also explained, as well as the solutions to sovle those risks. Because of all above, I agree the proposal is feasible.\nHowever, I think it would be benificial if the authors make more clear about this: The detailed plan and timeline of this proposal and of the funded proposal are exactly the same. I understand this is the continuation of the funded one, but it is not clear what activities are in this proposal and what are in the previous proposal, I see some of activities (in term of 3, 6, 12 months) are not belonged to this proposal because we just have 2 events will be held based on the costs in the budget, while we have 4 events will be held in the detailed plan.", "q1r": 4, "q2": "About auditing the proposal, the authors give us the detailed plan with timeline, roadmap, miliestones and KPIs that allows us be able to track the project. However, regarding to the Impact section, in “describe your proposed solution”, we see the solution in this proposal is writing articles and educational infographics about Cardano, but the authors do not provide any information about articles and educational infographics in the list of activities or the number of articles or educational infographics in the detailed plan and timeline. Because the solution and the detailed plan do not match with each other, I neither agree nor disagree that the proposal is auditable. ", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9038, "q0": "The described problem in this proposal falls within the challenge setting. The proposer appreciates the fact that there should be materials or articles that explain Cardano ecosystem and I believe this has a positive impact for Cardano because when people get an explanation or education about the ecosystem it draws them in to it, hence it will add value by increasing membership. The goals and metrics also align with the challenge as it seeks to provide introductory information about the blockchain to students and people.", "q0r": 4, "q1": "The relevant experience described and the information about the team provided gives assurance that the team have the required skills and capacity of executing this task. The budget is well prepared and I believe it’s also reasonable to achieve the desired outcome. The plan presented is concise for the execution of the project, that’s brilliant. I can also see that the time table is actually realistic as it’s seen that the execution of the project is expected to last for 12 months. I appreciate the fact that the proposer has indicated the challenges and risks that may arise during the execution of the project.\n", "q1r": 4, "q2": "The roadmap provided is comprehensive and the milestones and time horizon are also well described. What I am finding weak about this proposal is ascertaining the metrics/KPIs (they might be hidden somewhere). I think it’s good they are stated clearly to fully audit the proposal. Information about how you will measure the progress and development of the project and what success for this project looks like should be stated in their respective sections instead of directing it to other sections. I believe every section has a unique information required and hence must be treated as such. However, the targeted problem is  thoroughly described and I believe that if the project is executed it offers a solution to the identified problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9967, "q0": "As the proposer has mentioned in the proposal, I find this proposal excellently addresses the challenge set by the Fund 7 winning proposal - Student Hub. College students are future employees, and the proposal has pinpointed this group of customers, employees, and developers. However, although the University of Oxford is more than a great place to run this project, I wish the proposal could extend its range of participants, not just at Oxford but maybe also at Cambridge, UCL, or colleges around the UK or around the world.", "q0r": 4, "q1": "I rated this category a perfect score because I have experienced the same process and been successful. In my university, I have introduced my group of friends to Cardano, and a lot of them are interested and currently involved in this community. I believe this proposal has been carefully planned out to introduce Cardano university-wide. However, based on my experience, $2990 for researching, creating infographics, blogs, and writing articles is too high for a student-level organization like Oxford Student Hub. This cost should not exceed the allocation for presentations and recruitment events. The proposal should come up with solutions to reduce this cost so that the project can be more efficient and likely to be successful.", "q1r": 4, "q2": "This proposal is highly informative and in-detailed. I have had experience assessing student organizations' plans, and I find this one does better than most of the proposals I have read. The proposer includes details and evidence for every point, step, and goal for the proposed project. I believe this project is highly potential and likely to achieve success.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10459, "q0": "In this approach, the problem is portrayed as a challenge. The proposer recognizes the importance of having materials or articles that describe the Cardano environment, and I feel this will benefit Cardano because when individuals are educated or informed about the ecosystem, it draws them in, increasing membership. The challenge's aims and measurements also correspond with the goals of the challenge, which is to give students and people with basic information about the blockchain.", "q0r": 4, "q1": "The experience indicated and the team information offered provide evidence that the team has the necessary abilities and ability to do this work. The budget has been carefully prepared, and I feel it is both realistic and sufficient to achieve the desired result. The project execution plan supplied is clear and straightforward, which is fantastic. I can also see that the timeline is detailed and definite. I like how the proposer has mentioned the potential challenges and hazards that may develop throughout the project's execution.\n", "q1r": 5, "q2": "The experience indicated and the team information offered provide evidence that the team has the necessary abilities and ability to do this work. The budget has been carefully prepared, and I feel it is both realistic and sufficient to achieve the desired result. The project execution plan supplied is clear and straightforward, which is fantastic. I can also see that the timeline is reasonable, as the project is scheduled to take 12 months to complete. I like how the proposer has mentioned the potential challenges and hazards that may develop throughout the project's execution.\n", "q2r": 4, "assessor": "z_assessor_919", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Created a student hub based at Oxford to further increase Oxford students’ exposure to Cardano through physical and online events.", "experience": "Undergraduate and postgraduate students at the University of Oxford. Prior experience in running student organizations.\n\nOrganization of successful events including “Introduction to Cardano” where students were informed with detail on how to become a Community Advisor. "}