{"id": 405402, "author": "accelerate2030", "title": "Cardano Community in Geneva", "url": "https://cardano.ideascale.com/a/dtd/405402-48088", "category": 26439, "amount": 25000, "description": "Cardano can greatly benefit from visibility in the Geneva ecosystem, but increased awareness, credibility and enhanced networks are needed.", "f6_no_assessments": 7, "f6_rating": 4.523809523809524, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal to adopt the Geneva International ecosystem, a the world's most impactful financial and development hub, to open up opportunities for networking and a unique vision for Cardano. With 24,000 members in 100 locations, Cardano benefits from visibility within the Geneva ecosystem. Proposals have a big impact on the challenge. At the same time, the proposal team also has a solution for all risks for the proposal when it is implemented. ", "q0r": 5, "q1": "Proposal to provide plan with detailed feasibility roadmap. Clear timelines for each work to be done on the project. The budget is allocated reasonably and transparently in each assigned work. Team members all have good backgrounds and skills from many years of experience. Increase the power of project success.", "q1r": 5, "q2": "Proposal has a clear plan for successful implementation of the project. A detailed step-by-step roadmap and transparent breakdown of budgets make it easy to check your project's successful progress. Although it is a completely new proposal, it has demonstrated the experience and expertise of the team, increasing the sustainable strength of the project.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is in line with the main requirements of the challenge, which is to scale down individual capital outlay and improve capital supply. It also focuses on delivering information to people who would not otherwise have the access and raising awareness of Cardano in Geneva by exploring an innovative collaboration model to set up Cardano community hubs, within an established networks of entrepreneurial hubs through Impact Hub Geneva. Impact Hub Geneva is a part of the Impact Hub network, which is a network of impact-driven entrepreneurial communities, hosting over 24,000 people and organisations driving change and made up of over 100 communities in 60 countries. The proposal is excellent and will have a formidable impact on the Cardano ecosystem given the kind of reach the impact hub network gives to Cardano and blockchain. Moreover, it will provide the opportunity to scale the collaboration between Cardano and the Impact Network hub across the globe, particularly in markets where Cardano is under-represented. Successful implementation could also lead to collaboration with impact finance and UN organisations that could provide resources to support the hub going forward. This proposal is an excellent example of how collaboration can lead to exponential expansion and growth for the Cardano ecosystem while providing the means to fund new ideas and contribute to attaining the SDGs.\n", "q0r": 5, "q1": "This proposal is aimed at obtaining the funding to pilot a wider partnership with Impact Hub Geneva through its program known as Accelerate2030 which supports entrepreneurs from developing and emerging markets to scale their solutions for the SDGs. A concise implementable plan has been provided with a clear roadmap for implementation over a six month period ie. May to October 2022 which covers a number of activities including selection of 5 companies which use blockchain technology in their business to showcase their solutions at an upcoming event among other activities. A detailed budget has also been provided with a breakdown into identifiable budgeted tasks.\n\nProfiles of the 5 member team are provided and though new to the Cardano community, they indicate that they are already in contact with Cardano Foundation and various catalyst communities such as Cardano4Climate, SustainableADA and the Catalyst school. The team has managed the Accelerate2030 since 2016. This is a program hosted by the Geneva Impact Hub and during which Cardano will be showcased to the network of hubs. The team also has experience in impact management and reporting, having managed complex logframes with partners in development agencies. This appears to be a solid team for the job.\nKey risks and challenges to be expected are identified together with mitigation measures that will be put in place.", "q1r": 5, "q2": "Key metrics identified for purposes of auditing success of the proposal include number of companies reached through the sourcing campaign, number of Geneva ecosystem stakeholders participating in the event among others. These are clear and measurable and will be able to determine the success of the pilot stage of this proposal.  Proposers intend to set up a plan to track progress based on the project plan and KPIs however, this information will only be shared with the Community in a final report at the end of the funding. This may not provide the Community with adequate information to be able to measure the activities and success of the project while it is ongoing. Proposers may want to improve on how they intend to communicate with the Cardano community during the lifetime of the project. ", "q2r": 4, "assessor": "z_assessor_1437", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"q0": "Geneva has a strong financial community, access to modern technologies with a high level of knowledge, this is not disputed. The Cardano ecosystem is developed sustainably, methodically, and is academically proven. If the two work together effectively, the community will thrive and grow together. Can the project state which areas Cardano can have practical applications in Geneva? Let's demonstrate this in a specific array. This will also solve the challenge mentioned by the project, Geneva is a traditional corporation, but will always innovate to take the lead. And who knows, the solutions on Cardano will become a traditional partner of Geneva. As for companies, their understanding of blockchain is not much, but if you prove useful value, they are ready to accept, handle small things convincingly, for example: Blockchain application for product supply chain management, NFT in product identification, staff attendance management… I strongly support the project.", "q0r": 5, "q1": "The project has a good plan, the roadmap is quite suitable. In particular, the projects that allocate resources and approach the first companies are very good, I find very positive. However, with KPI as the first 5 companies, whether the project has enough capacity to deploy, to be able to understand how to operate a company and apply new technology to an array will take a lot of time working hard. Team members have a lot of experience, strengths are spread in many areas. Please provide members' social channels for public review and transparency", "q1r": 4, "q2": "The project has a good plan, the roadmap is quite suitable. In particular, the projects that allocate resources and approach the first companies are very good, I find very positive. However, with KPI as the first 5 companies, whether the project has enough capacity to deploy, to be able to understand how to operate a company and apply new technology to an array will take a lot of time working hard. Team members have a lot of experience, strengths are spread in many areas. Please provide members' social channels for public review and transparency", "q2r": 5, "assessor": "z_assessor_1544", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "There is nothing much to say here. Being presented to a huge community and having the opportunity to present solutions to their problem in BB meeting is amazing. Of course, as mentioned in the risk management, we do not know how many of these companies and entrepreneurs are aware of Cardano community and, therefore, we cannot measure how this presentation is going to be new. However, still, there are lots of concerns and miss conceptions around blockchain, since there are lots of schemes flourishing, and that might be a good opportunity to change that image.\n\nMaybe, since you’ve stated that Geneva has a very traditional community, maybe addressing these schemes concerns and pointing out all the solutions and security would allow them to change their view.\n", "q0r": 5, "q1": "The plan is well written and the timetable seems fair. My suggestion here is about the budget – I would appreciate if it is possible to breakdown a little bit, giving more information in these specific points. Another consideration is about the ‘contribution  to travel and accommodation costs’. Since you don’t know how many members the company has and where they live, this cost is unknown, therefore it could elevate a lot this 8K USD (and I have no clue how much you’ve separated to this cost and to the ‘supporting companies […])\n\nIn feasibility part, the first (1) point: You said that you’re going to select a mix of Cardano and Accelerate2030 companies which uses blockchain solutions. In the (a) observation you said ‘Define with Cardano’. What do you mean by it? Are you contacting some Cardano members to help you to select these companies? How is going to be the selection’s criteria (activity, profit, etc.). It would be good to know how the decisions are going to be made\n", "q1r": 4, "q2": "In this part you said ‘we will set up a plan to track the progress based on the project plan and KPIs outlined here.’. I think it should be already thought out and added here.\n\nI think the project would gain, e.g., if you create (or use yours) a platform to share the partial results (companies selection, criteria, etc.).\n", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This is a brilliant idea. The problem described in the proposal is fitting into the challenge. A Cardano community in Geneva is a great move to increase awareness of the blockchain to people who are not aware. This proposal has the potential of bringing benefit to Cardano blockchain as it will introduce and bring more people to the ecosystem through raising awareness. The metrics and goals of the proposal are in alignment with the challenge setting and for me I think this is a good proposal that can make impact.\nThe proposal also has a great scalability potential.", "q0r": 5, "q1": "Given the information about the team and relevant experience described, I believe the team possesses the required skills and knowledge to execute this project. The budget provided is comprehensive and well broken down into identifiable items. The breakdown of the budget makes it easy to know what the funds will actually be usedfor, hence I believe the budget is reasonable for this project. However, for the sake of future proposals, information under budget such as “outreach campaign, application process, screening selection process, engage entrepreneurs” etc should have their specific individual amounts attached to them, I don’t really like the way they have been boxed with one amount. However, I think that the budget is not too much and hence it aligns or adheres to MVH principle of this challenge.\nI like the fact that there is a well described and comprehensible plan for the project’s execution. The time table is clear and one can actually tell when the project is expected to start and end. The proposer has done avoid job by stating the possible challenges and risks for the execution of the project.", "q1r": 4, "q2": "The proposal has a well described roadmap, milestones and time horizon for the execution of the project. The metrics/KPIs one of which is 2 virtual focus group with impact investors and entrepreneurs is a good indicator of the desired outcome of the project. The problem of this proposal is not vague but has is well described, and that for me is good. I believe the proposed solution of this proposal has the potential of addressing the problem if funded.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposer is an Impact hub in Geneva and has a large network of hubs across the world. They are connected to a vast amount of organizations and people and will increase Cardano's total reach. Their aim is to introduce the Cardano Blockchain to companies that could make use of the technology, and to change the traditional Geneva financial system to a more advanced trustworthy system using blockchain Technology. This proposal supports the Challenge, and I have confidence that it will make a positive impact.\n\nThe Proposal addresses the need to scale down individual capital outlay, and work on the capital supply and it will create networking opportunity for Cardano in Geneva, an important impact finance Centre.\n", "q0r": 5, "q1": "The team is experienced in start-up support, social innovation and entrepreneurship, coaching of entrepreneurs and so on. No Linked-In profiles are given, but a brief paragraph outlines each member's experience and education. The budget is 5% of the Challenge's available funds which is in line with total Challenge budget requirements. They have set out a detailed budget, breaking down the main objectives with sub goals, and I believe it to be reasonable, because they are asking the same and less as some of the other proposals that will have less of an impact in my opinion. \n\nThey discuss the risks and how it will be mitigated. I do not immediately see any additional risks not outlined. The Impact Hub is already connected to Cardano through Cardano Foundation, catalyst communities (Cardano4Climate), Sustainable ADA and the Catalyst school.", "q1r": 5, "q2": "They have set out a Road Map over 6 months. and the KPI's they provide can be used to quantify the success of the project. \nMay to July 5 companies will be selected, August to September they explore the potential of Cardano in preparation for the October Building Bridges Week where the insights of the process will be showcased. I believe through this event the Cardano Blockchain technological solutions will be introduced to a vast amount of people, and it will definitely help grow the Cardano Ecosystem.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This is a fantastic idea by the proposer. The proposal's problem corresponds to the challenge's requirements. The establishment of a Cardano community in Geneva is an excellent way to raise blockchain knowledge among those who are unfamiliar with it. This idea has the ability to improve the Cardano blockchain ecosystem by generating awareness and introducing new people to the ecosystem. The proposal's measures and goals are in line with the challenge's objectives, and I believe this is a strong idea with the potential to make a difference.", "q0r": 4, "q1": "The teams background and relevant experience provided, I feel they have the necessary abilities and understanding to complete this project. The budget presented is detailed and well-organized. The budget's breakdown makes it clear what the funds will be used for, so I believe the budget is appropriate for this project. For future proposals, information under budget such as \"outreach campaign, application process, screening selection process, engage entrepreneurs,\" and so on, should have their own unique amounts connected to them; I don't like how they've been packaged with one figure. However, I believe the budget is reasonable and hence aligns to the MVH.\n", "q1r": 4, "q2": "The proposal includes a detailed project roadmap, milestones, and timeline. The metrics/KPIs are a solid indicator of the project's desired outcome, one of which is a virtual focus group with impact investors and entrepreneurs. This proposal's problem isn't unclear; instead, it's well-defined, which I think is a good thing. If this proposal is funded, I believe the proposed solution will be able to solve the problem.", "q2r": 5, "assessor": "z_assessor_919", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Increase Cardano’s visibility in Geneva’s impact finance community and pilot a community expansion collaboration in the Impact Hub network", "experience": "Impact Hub Geneva is a social innovation lab & community for entrepreneurs, part of the global Impact Hub network with 24,000 members in 100 locations. We lead Accelerate2030, a global program supporting entrepreneurs from emerging markets to scale their solutions for the SDGs."}