{"id": 398999, "author": "dimitri777", "title": "Structured Questionnaire for CAs", "url": "https://cardano.ideascale.com/a/dtd/398999-48088", "category": 26453, "amount": 12000, "description": "Having been a CA in two funding rounds I see difficulty in the way CAs are supposed to assess proposals. Lack of structure is a main issue", "f6_no_assessments": 16, "f6_rating": 2.7708333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 447, "q0": "The general idea (a tool to help CAs write assessments that cover all the things they should cover) would address the challenge; however, this proposal is vague, and doesn't specify what form this tool would take (is it simply a guiding document, an interactive online tool, or something else?) and how it would work; so it is hard to assess specifically whether *this* proposed tool would address the challenge aim of improving CAs' work. And, from the limited information given in the proposal, there are elements of this proposal which clearly do *not* align well with the challenge-setting. For instance, the challenge-setting places a high value on co-designed tools and tools designed by teams of CAs; but this proposal doesn't address that, and seems to be looking to codify one proposer's personal approach to assessing proposals. Assessment methodology is very personal, and every competent CA has their own very personal take on it; so it's an area which, perhaps more than any other, should probably align with the challenge setting on co-design and bringing together ideas from across the CA community.  Also, the challenge setting specifically invites proposals that \"Evaluate different models of proposal assessment\" - this does the opposite, by choosing and elevating just one method. On the information we are given, the answer here is either \"inconclusive\" or \"no\"; but I've given the proposer the benefit of the doubt with a score of 3.", "q0r": 3, "q1": "The timeline is vague, and doesn't at any point explain what form the tool would take, and what exactly will need to be built or what technology is going to be used. The tasks need to be broken down far more, so we can assess whether the proposer understands what work needs to be done, and has planned approporiately. The \"proposal team\" field is supposed to list the \"team members required to complete the project\" - but instead, it lists a group of people most of whose skills don't align very closely with the proposal, and then says that a separate developer will be engaged to actually do the work. Engaging staff after funding is fine - but to assess project feasibility, we need to know what skills and experience the proposer will look for in the person they're going to engage, so that we can assess whether the proposer has accurately assessed what skills are needed. The budget is also vague and general - it should be tied a bit more closely to defined tasks or specific costs, and be broken down a bit more, so we can see whether the proposer has costed things fairly, and so we can assess whether any elements are missing that would damage the feasibility of the project. Overall, a proposer who gives so little detail where detail is required is unfortunately something of a red flag in terms of feasibility, since this demonstrates  that they are not keen to pay attention to practicalities or to detail, and have not fully thought the proposal through. So on balance, I would have to say that this proposal as it currently stands is not likely to be implemented successfully. ", "q1r": 2, "q2": "To audit the progress of the tool build, and then the integration, no information is given on what will actually be measured and how \"progress\" will be defined; without any audit metrics, the proposal unfortunately is not auditable. On \"integration\", reports from the original builder of the voter tool are expected - has this been agreed with them? The existing voter tool is open source, so anyone is of course free to build on it; but without some kind of prior agreement, developers can't expect the original builder to engage in reporting on integration for them. There is no information given on how marketing will be audited, beyond saying it will be done by a \"professional team\" - no metrics are suggested for what will be tracked. Given all this, the proposal as it stands is not auditable. Additionally, the \"what would success look like\" description reveals a questionable approach to auditing success - the proposer refers to trying to control things that he cannot control rather than seeking to understand and hear what the community genuinely thinks (for example, \"...educate VCAs that this tool is useful and must be valued and given high scores\"; \"Have proposers demand that CAs and VCAs take the tool seriously...\") The usefulness or otherwise of a tool is something the community must decide, not something that the maker of that tool can demand. Particularly, it would be borderline unethical to suggest, as this proposer appears to be doing here, that VCAs should be \"educated\" to believe that CAs who use this tool (or any particular tool) to write their assessments \"must\" be given high scores.", "q2r": 1, "assessor": "z_assessor_1157", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 662, "q0": "The search for ways to increase the quality of CAs marches on and this proposal has added itself to the line.  The suggestion is a tool which functions like a questionnaire to help CAs identify what are the most likely points about a proposal that need to be covered and detailed.  Leaving aside the fact that in the existing CA tool already has a checklist of questions derived from the requirements outlined in both the proposer and CA guidelines (should we assume this questionnaire has different questions?  How are we to validate their relevance?), let us consider for a moment the role of a CA:  is the job of a CA to offer unique insight into a proposal to both encourage and help improve the proposal and to inform the voter, or is it to grade the completeness of a proposal, by checking its contents against a list and deeming it valuable or not, which means it is actually the list which determines that value?  I say the latter is so far beyond the pale as to be utterly offensive.  I will never subscribe to the idea that unique humans creating unique proposals deserve anything less than unique perspectives from readers, assessors, critics or supporters.  Templates and questionnaires can, AT BEST, structure an approach, can provide support as an assessor comes to grasp and express the integrated totality of THEIR understanding of a proposal.  But these tools cannot be a substitute for that integration, whether someone is rewarded for that behavior or not.  CAs should strive to provide insight to proposers and voters (which results in an inner commandment for the CA to desire to expand their knowledge), and a tool that stresses templates or rigid lists of questions does more harm than good to this directive, unfortunately.  CAs have plenty of existing guidelines and questionnaires that can prompt them as they develop their skills, I do not see any value presented here to justify adding more.\n", "q0r": 2, "q1": "The biggest issue here for me is the that the nature of this questionnaire means everything to this proposal, yet it is taken for granted in the description.  The only clue to its value is the claim by the proposer that they used a version of it to get good grades on their assessments.  What we really need is a way to parse and validate that claim, such as including actual rates of Excellent/Good/filtered outs obtained with the tool (this can be expressed as percentages of a rounded off number to avoid violating the anonymity of the proposer's CA number), and even better to have those rates expressed as a rate of improvement between funds where it was not used and then used.  If this were being built out as a research project (and a much lower budget that reflects the uncertainty of the value added) I would have a completely different opinion of the effort, but as is, we need to see some proof that there is value to this questionnaire beyond what the community already has available.  In addition, to the degree that this needs to be built out as a tool, I would have liked to see a plan for the development, especially for the team member or sourcing responsible for that, as none of the ones listed have experience in that area.  Without that information, I don't see why the development and integration factors are priced where they are, especially the integration, as the existing CA tool from AIM is opensource and could be forked and have their development module added with a few clicks.  If they have a different architecture in mind, that would be good to have seen here.", "q1r": 3, "q2": "The auditing elements included in the proposal commit an error I believe is repeated throughout:  there is no evidence that the proposer considers the value of this to be anything less than certain, and that a failure to realize that (say through a provable metric) is not the fault of the project, but rather a failure of others to see its value.  The inclusion of KPIs to measure the value of a project are important because that is ultimately how we measure the impact that the project had, and thus the expected value of maybe voting for it.  What is included here is closer to milestones (including collaborating with the AIM team, though as I noted above that isn't necessary) and they just assume it was successful.  There might be a suggestion here that the idea is to onboard a cohort and collect data on how it helps them, however that isn't explicit or clear, and adds the problem of needing to present protocols for the preservation of anonymity, which hasn't been calculated here.  As a software deliverable, it would have been nice to see them list any repos or tracking software that could be used for reporting purposes, and of course, it would be nice to know if the result was to be opensource.", "q2r": 2, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 12, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1862, "q0": "This proposal identifies a problem that is well aligned with the challenge. The solution provided is a creation of a tool/questionnaire that will help the CAs work more effectively and provide higher quality assessments. This completely aligns with the challenge metrics and success vision and will definitely bring value to Cardano by improving the quality of the funded proposals trough Project Catalyst.\nHowever, the voter should know that such a tool already exists and could be found here https://cardanocataly.st/ca-tool/#/ .That means, that the proposal is entering in a competition with already existing infrastructure. There is nothing wrong with that, especially if the proposer can deliver a better solution, but the voter should know all the facts.\nThe proposer is aware of some risks that could prevent the implementation of his solution and states them in a clear and understandable way in the proposal. Unfortunately the proposer does not provide a viable or any solution to mitigate the risks and does not provide a backup plan.\nDue to the existence of a similar solution in aid of the CAs and the lack of solution of the discovered risks, I agree that this proposal effectively addresses the challenge.\n", "q0r": 4, "q1": "The proposal has a road map but it is not very detailed. \nThere is no mention for collaboration with AIM team which will be a must in order to achieve the “Integration with existing CA assessments tool”.  \nThe budget is not broken down and therefore the voter could not understand how many hours at what hourly wage are going to be paid to how many people. This brings uncertainty in the viability of the project.\nThe proposer is a visible member of the Catalyst community currently involved with Catalyst Circle V3 and has experience as a CA, vCA etc in previous funds. The team is presented in detail and all the linkedin profiles are active, although some of them are almost empty. The team looks credible and capable of fulfilling the goals. However, there is no mention on who in the team will work for how long on what position. This again brings uncertainty of the existence of a clear and detailed plan for action.\nBecause of the lack of detail and the uncertainty that brings  I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 3, "q2": "If we divide the proposal in three parts, creation, integration, marketing, then:\nThe auditability of the creation is ensured by daily progress reports, although it is not stated where will be these reports be posted. This is excellent auditability, the only thing missing is milestones.\nThe integration is tracked by reports from the developer, but it is not stated at what time intervals these reports would be and again there are no milestones to which to compare the progress of the project.\nThe marketing, has no KPIs, no milestones at all.\nThe success of the project is not measurable therefore the voter/auditor could never know if the project is successful when completed because there is no metric stated to which to compare the success.\nUnfortunately I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nDear proposer, I wish to point out that metrics and milestones are incredibly important for the auditors to follow the progress of the project and relise the stages of funding when a milestone is reached. Please consider reading some highly assessed proposals here https://cardanocataly.st/voter-tool/#/  and  implement the milestones and metrics in your next proposal. Also please consider, that the voter does not know enough to imagine all the things that you know and in order to present your solution comprehensively there is a great need of explicit and detailed explanation of the process that will deliver the solution you envision. \n", "q2r": 2, "assessor": "z_assessor_1417", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 289, "q0": "When we talk about results, we know that when solving problems and achieving great results, it is crucial to standardize processes to guarantee stable and predictable results. This great proposal, in my opinion, gives the possibility to CAs to perform their assessments in a standardized way since they will work according to a common document that will guide them through their tasks. Furthermore, this tool will support the proposer during their preparation for future funding helping him/her what are the gaps of the proposal.\nAs a critic, since risks are something that has a potential impact and probability to happen in different projects, I suggest the proposer include some mitigation actions for the mapped risk. A 6 or 9 box risk matrix where probability and impact will be the variables for other risks that can be mapped during brainstorming sessions with the team members will also support the prediction of potential problems that can show up during projects execution.\n", "q0r": 4, "q1": "I don’t believe that the plan is well detailed, and the timeline was presented by the author but it lacks information. I believe that to guarantee full visibility of what is going to be happening and what are the milestones, the activities should be mapped and presented together with the milestone of that period or “pack of actives”.\nFor the funds, I believe that it should have more levels of breakdown to show how the cost was built and guarantee a full understanding of how the author came up with the final number providing more reliability of what and how it will be achieved.\nThe team members and role is well presented and all LinkedIn are available to connect and interact.\n", "q1r": 3, "q2": "In order to follow-up results and projects, progress has to be measured by KPIs which are measurable values that demonstrates how effectively a company, or a project is achieving their results and, according to my analysis, there are lack of evaluation tools on this proposal. The author provides what are his metrics but do not present parameters that will confirm how efficient his/her project is passing through the proposed steps. I believe that if KPIs are created for those metrics, they are perfect to evaluate the success of the project and be able to be audited.", "q2r": 3, "assessor": "z_assessor_1136", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1068, "q0": "The idea of a tool to help CAs organize their thoughts and conduct their assessments is a solid idea that could prove beneficial to many. One key question lingers in my mind, however. If the proposer has \"used this [questionaire] in Fund 6 and Fund 7\", why not give us a glimpse of how it works. Not the whole thing, obviously, but for a request of $10,000+, for something that has an existing form and, according to the proposer, a track record of success, we should be able to see what he means to some degree. That would give me much more confidence in the potential impact of this proposal.", "q0r": 3, "q1": "There are some peculiarities in this section that would benefit from elaboration or justifiction. \n\nIn the budget: Why does the proposer need $2000 to \"market\" the tool to CAs and prospective CAs? Just post it in the discord or telegram channel, and if people find it useful, they'll use it, and usage will spread, much as it is with the CA tool for suggesting proposals. And if others don't want to use it? That's fine too. But a development/deployment budget should be sufficient for an internal project like this.\n\nThe team looks good but it's a little confusing to see a substantive amount of the detail presented here being about skill in translation of languages, when this is about the development of a questionnaire that, as far as I can tell, will just be in English. \n\nThe development plan looks reasonable but is a little light on detail.\n\nIf this proposal isn't funded this round, I'd recommend the proposer smooth these portions of the proposal out and insert the requisite justifications.", "q1r": 2, "q2": "If the creation of the tool will be complimented by daily updates, then that is an excellent and hopeful means by which the community could audit the progress of the proposal.\n\nIn the \"what does success look like\" section, I will note that the proposer appears quite enthusiastic about this tool, though ultimately its utility would and should be decided by the whole of the CA and vCA community. ", "q2r": 4, "assessor": "z_assessor_1275", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2107, "q0": "The proposal aims to create a structured questionnaire to assist CAs in their assessment process and integrate it within the existing CA assessment tool. The proposer also states that the tool (probably used manually in previous rounds) reduced the time spent on each proposal significantly and helped earn better ratings than without the tool. \n\nI definitely see added value in the process of making CA’s jobs easier and allowing them to be more efficient, so any kind of proposal that is in my view aligned with the challenge and would bring value to the community. ", "q0r": 4, "q1": "The core team is composed of 3 people, and quickly glancing at their description, I have to say that certain doubts spring to mind wondering if there is truly a good fit between the team and the proposal. Call it just a feeling. \n\nProject deployment would take place over 3 months. First month would be developing the tool and integrating it in the existing framework. The second month would be used for testing and deployment. And the third month for marketing the tool to CAs. Even disregarding for a second that the level of detail offered is not impressive, to say the least, many questions arise from my point of view, with the most pressing one being the following: if the tool will be integrated within the existing tool, what need is it to market the tool to CAs if they will have access to it once the assessment phase starts?\n\nThe budget as well leaves a lot to be desired in terms of granularity, and there is little else that I might add at this stage except begging for more details.", "q1r": 2, "q2": "The project does offer very optimistic tracking promises: daily progress reports during the tool creation phase, and general reports by the developer during the integration phase. I take all of these promises with a grain of salt and urge voters to be cautious at least when judging the merits of this proposal, overall. ", "q2r": 3, "assessor": "z_assessor_1454", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2210, "q0": "Proposal identifies a problem that is very aligned with the scope of campaign and provides details how the solution would bring value to the ecosystem in general. However, lack of details about the deliverable prevents proper assessment. Additional information on end product(is it a spreadsheet, an app, an integration to ideascale or other existing tools?) would be a great update.", "q0r": 4, "q1": "Feasibility of this proposal is hard to evaluate due to lack of details. Most of the section is dedicated to the team, which has enough experience for set goals. \nBudget can be anywhere between fine and excessive depending on exact deliverable that is being proposed and technical approach used, but that information is missing. Explanation of projected budget would bring a lot of clarity on feasibility and auditability of the project.", "q1r": 2, "q2": "Auditability of the proposal is hard due to ambiguity of deliverable. Coupled with no specific KPIs or milestones, it would be very hard to judge if iteration of \"tool\" is what was proposed or not, so only very general auditability is possible. Proposal should be updated with details on what and when is going to be accomplished and how could an outside source verify it.", "q2r": 2, "assessor": "z_assessor_1460", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3546, "q0": "The proposal touches on one of the main difficulties facing CAs being able to come up with a solution to the lack of structure on the proposals can encourage more CAs to participate. It can also cut down on the time needed to assess proposals which can lead to higher efficiency per CA. It can also make this community more inviting to individuals looking to participate idea and individuals looking to provide feed back but are scared of taking the first step into a world that is somewhat new to them", "q0r": 4, "q1": "The team working on the project is well rounded covering all aspects of relevance such as previous experience, involvement in the community, using input that they discovered first hand. The goals of the project are attainable and clear. The goals are also very useful in the long run and contribute towards the développement of the catalyst community. ", "q1r": 5, "q2": "It is difficult to measure the success of this project because it is based on the personal experiences of the CAs. How ever there could be a survey or study created on the efficiency increase of CA performance in project proposals that abide by the structures that are newly set as opposed to the performance of the CAs on project proposals that are not following this new structure.", "q2r": 3, "assessor": "z_assessor_1660", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5432, "q0": "I strongly agree with the idea of using a structured questionnaire system to aid (V) CA in performing their work efficiently. The idea is in alignment with the goals of the Community Advisor Improvements as it sets to develop a new tool which, again, is also a new mechanism to be utilized in the assessment of proposals.\nAs a new CA, I’ve also gone through a few proposals which did lack structure of which I believe other CAs have also gathered similar experiences. This proposal is going to help proposers align their ideas with a better structure based on the proposed questionnaires to be developed and leads to CAs assessing and scoring more effectively. This project is also going to help future community advisors like myself assess and score proposals effectively due to a better structure in stated proposals.\nAgain, this proposal helps both proposal writers to reshape their content and community advisors in better assessing proposals. Thus, aiding in the sponsorship of the best projects which consequently lead to the improvements of the Cardano Ecosystem.\nI believe this project is in complete alignment with the challenges of the F8: Community Advisor Improvements.     \n", "q0r": 5, "q1": "I buy the concept of the proposal completely, but as to how the proposal is to be implemented successfully, I do not see. The systems and infrastructures needed for the proposal to function were not elaborated on and as such left us with a faint idea of the entire process. This makes it difficult to assess how effective the stated processes would have been in completing the proposal an example is how the proposer stated that the tool will help the proposer identify what is lacking in his work, but as to how the proposer was to identify what was lacking through the tool was not identified.\nThe budget allocation system is not feasible due to inadequacies in budget allocation.  I believe the budget would have been feasible if Specific processes and their associated cost allocation were identified to give the investors a clear angle to what exactly they are investing into rather than broadly categorizing cost.\nIn terms of the relevancy of skills and experience for the work, I do not foresee how their stated skills will help in the development of questionnaires, as the individuals’ skills were mostly focused on their language translation expertise. I believe since it is going to be utilized by the entire CA community more consideration should have been taken in that light to organize members having more experience in research and the community advisor role.\nBased on these observations, I disagree with the feasibility of this proposal.\n", "q1r": 2, "q2": "I agree on how accountable this proposal is due to its impact on the Cardano Ecosystem. A concise and detailed description was given to the identified problem and the approach to how the problem can be curbed was stated. However, the stated systems and procedures to approach the problem were not understandable.", "q2r": 3, "assessor": "z_assessor_1989", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5511, "q0": "The proposers want to build a questionnaire based on the CA guide, that would assist CAs in their assessment period and as such, help them write better reviews.\nWhile this proposal could have worked in previous rounds, I find that for this round and onward, the assessment process has become a lot easier with the new structuring of the proposals. The proposals structures are now devised in 3 sections: Impact, Feasibility and Auditability, sections that are also the ones a CA must review, and each of those sections have precise questions addressed to the proposers, and by having them answered, greatly helping the CAs writing their reviews.\nAs such, considering the current state of the assessment process, I do not see the need for any additional guides that would help CAs, as the current process is already very easy to follow.", "q0r": 2, "q1": "While the proposers have provided ample descriptions about themselves and links to their social profiles, the detailed plan and timeline are very short, and do not form a complete enough description of the entire process that would help me assess the successful implementation of the project.\nThe budget is loosely divided in 3 sections, without any details on how those numbers have been calculated, making it hard to assess the practicality of the budget.", "q1r": 2, "q2": "Most of the development progress is accurately described, and offers enough details to be easily assessed. However, the success description is vague, idealistic and in some parts even demanding: “Having all CAs use this tool”, “Ability to educate VCAs that this tool is useful and must be valued” or “Have proposers demand that CAs and VCAs take the tool seriously”. \nGiven the lack of information and unrealistic demands of the proposer to the rest of the community, I cannot have the proposal adequately assessed for a positive outcome.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5887, "q0": "Its very useful and simple idea, which is excellent in a sense that is \"easily\" developed and may help a lot CA to guide and improve their assessments, just as the CA/vCA tool. It is aligned with challenge as it improves assessment process (potentially increasing excellent assessments) and adresses kpis as \"Number of new tools developed\" and \"Number of new mechanisms for assessing and scoring proposals\" and goes in the suggested direction of \"Build new tools to improve (v)CA's work\".\nAs suggestions (maybe after first implementation), it will be good to link the proposals to the challenge they belong, and, as CA select the proposals, the guiding questions already come up with challenge kpis in the impact score, , for instance. For example, If I select a proposal from Community Adivors improvements, when I go to the questionaire, it already brings the kpis, the guiding directions and so on, for me to check if proposal is in line with the challenge or not.\nFrom a project management point of view, it is a good point to apply an agile methdology, developing the the tool in sprint and collecting regular feedbacks from stakeholders and selected users. \nThere's one risk mapped but no mitigation plan was ellaborated. However, I wouldnt worry much about this risk specfically because the tool would be integrated with CA tool, which great part of the community already know about it. it would be nice to have this mitigation strategy disclosed though - Maybe advertise/communicate more, include tutorials sessions in TH/Swarms, etc.", "q0r": 5, "q1": "The plan is is well outlined and the project quickly delivers what it promisses, if not delayed.I like there's a dedicated part for marketing the tool, this is essential for large adoption.As suggestions, it could bring more details on how the tool will be tested (and who is going to test it - only proposers? selected users from community?).\nBudget breakdown is ok but it could provide more details, specially on the line about \"Creation of the Tool\", which represnts half of the budget. I mean, this money is for paying developers? how many hours will they spend on it? or is it developers + software/hardware aquisition? The same is valid for second budget line and 3rd budget line.\nProject accounts for 12% of total challenge budget, it is quite some money, but I think the benefit compensates the investment (High ROI).\nLast, regarding the team, I see there are 4 people in the project but none seems to be a developer (or have expertise and developing tools like this). It is not clear if external people will be hired or even the roles of each person listed here. For example, I see there's one person with background in translation/languages and I wonder if this tool will be avaliable in multiple languages, if so, it should be highlighted here (there's nothing about it in the impact session nor in the plan). As suggestions, as the team experience doesnt exactly (at least directly) matched project technical development, the roles of each one should be excplicit. I liked though that there are linkedin links to check the info provided. It is mentioned that  they  will be using their inhouse resources, but not clear what that means (inhouse from where? is it a company?)", "q1r": 3, "q2": "The auditability part is mainly formed in the proposal by milestones. The milestones listed are good and the progress will certainly be easy to track with the daily reports.\nI missed, however, some kpis after tool is implemented. It would be imporant to measure how many people they are reaching in the communication, how many are accessing the tool and how many are really using if, after all, to make the assessment, in order to know if the tool is really a success and is helping people. Another kpi that could be followed up initially is somehow measure positive feedbacks on the tool (via a survey, for instance). ", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7522, "q0": "Useful tools are important to CAs and other support roles within Cardano and Catalyst, more specifically. The value proposition here is difficult.  A desire to provide CAs with a detailed breakdown of the CA Guide while also providing examples appears to be the thrust of the proposal. Regardless of the final product, the continuity and maintenance of a tool is imperative and has not been addressed.  Risks are limited to adoption and nothing else. Other notable risks not listed would be the pause of funding rounds, a more standardized CA process or other process changes. Overall, the impact based on all facets appears to be minimal as presented and incomparable to current tools due to a lack of details.", "q0r": 2, "q1": "There are not many completion barriers but there is also little information as to how the tool will compile and present data, the platform availability and accessibility of the tool. Similarly team experience is difficult to determine. Links are provided and all but one LinkedIn profile offers historical experiences. As such, I will not focus on the links provided but it is recommended that the proposer either update the relevant profiles or do not include them at all. Based on the limited information the timeline appears relevant and feasible.\u2028\nWithout having clarity, as mentioned in Impact and elsewhere, it is again difficult to determine if the budget of 12000 USD is adequate or excess. It is merely a guess and the budget amount does not correlate well to the data provided. Recommend the team take care when clarifying this proposal and consider that readers are not privy to information other than what is presented within the proposal. A detailed budget providing the estimated hours, estimated pay and other budget considerations would be most helpful for assessments and future audits as well.\n", "q1r": 3, "q2": "All areas of typical audit-ability are addressed but there is so much more missing from this proposal. The metrics are irrelevant if the community cannot determine exactly what this proposal is attempting to provide. “Tool” and “questionnaire” are mentioned multiple times with little to no context or representation. The intent is there, as is the goal, but the PROCESS and DESIGN are absent making it difficult to apply guidelines and metric weights. \n\nIt is recommended the proposing team revisit this proposal and provide appropriate clarity and detail necessary to make the categorical assessments. It is important write clearly and definitively in proposals, only you and your team know your intentions, desires and goals. It is up to you to express these thoughts adequately using text, examples and visual aides if necessary.", "q2r": 2, "assessor": "z_assessor_591", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7558, "q0": "This proposal seeks to address the Community Advisor Improvements Challenge by developing a “structured questionnaire”. But very little detail is given on the structure beyond being based on the CA guide. The wording also suggests the questionnaire has already been developed – “I have used this in Fund 6 and Fund 7.” so it is unclear what is being developed in addition to this.", "q0r": 2, "q1": "Professional biographies are given for each human resource, but it is not clear how all the skillsets (apart from the proposer) relate to the design and build of a structured questionnaire for Community Advisors.", "q1r": 3, "q2": "Very little detail is given on the development of the questionnaire (which may also already be developed given the proposers statement in “how your proposed solution will address the challenge”). Also, the budget estimates are excessive for simply creating and marketing a questionnaire and are not broken down to provide a sufficient rationale or justification.", "q2r": 2, "assessor": "z_assessor_597", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7723, "q0": "Proposer wants to build a tool for CAs, so CAs can easily assessing proposals. Structured Questionnaire is the tool proposer wants to develop. For further information, proposer might explain about what kind of tool they want to create. Is it an app, website, or maybe a documents like guideline. Structured Questionnaires may be helpful to some newbie CAs, but because we have other risks such as bot attacks in QA phase that cannot be resolved yet: What if structured questionnaires are used as assessment templates by the \"bots\"?", "q0r": 3, "q1": "The roadmap timeline is too simple, proposer only wrote general activity. Adding some detailed activity would be helping readers understand what proposer want to create. Budgets need to be break down. For example: What would you do with $6000 to make that product? Hire a full stack developer? Hire a consultant? It will be great if the budget can broken down.", "q1r": 2, "q2": "Here in Auditability section, proposer did not provide any links for tracking their progress. Adding links like Git Hub or simple Timetable in Google Spreadsheet would be nice.\nI guess their key metrics are too hard to achieve as proposer wrote that they want all CAs using their tool. Simple key metrics can be like: Number of CAs using the tool in Fund9, Fund10 or later.. If this tool is a web or app, it can be tracked by the views or traffic.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9891, "q0": "This proposal offers to develop a questionnaire-based tool for Community Advisors (CA) to easier the assessment process. This questionnaire would help the CA to narrow the score rating based on some fixed criteria.\nThe proposer does not demonstrate how current process is uneasy for CA. Using the community advisor assessment guide, CAs can have a comprehensive vision of what is expected from their work, the criteria to be used, and also the many shades and nuances that can influence their score decision rating.\nMy experience as a VCa in Fund 7 is that questionnaire-based reviews were more difficult to read, and I needed to read the whole proposal to assess the review. Voters reading this should remind that proposal assessments are made for voters, to avoid them reading the whole proposal. If a questionnaire-based tool is used, it may lower the quality of assessments by forcing ideas to fit into predetermined boxes.\nWhile I agree that the proposal would make the CA work easier, I disagree that it would improve Community Advisor work. Therefore, I strongly disagree that this proposal effectively addresses the challenge, which is not about easing CA Work, but about improving his work.\n", "q0r": 1, "q1": "The project team is identified and show evidence of having experience in Cardano Catalyst Project and of having the skills required to develop this tool. The road map and the budget are not detailed enough (month 1 : development of the tool) and cannot give confidence that the project has been correctly structured. Those two items could check a “roadmap provided” “budget provided” box in a questionnaire, but lacking details they are not relevant.\nThe risk analysis only mentions risks that CA would be too closed minded to use this tool (“unwillingness to (…) try new things”). I recommend enlarging the analysis of risks to include for example: “risk of lowering the quality for assessments”, “risks of needing a too large number of questions to reflects the shades of grey needed for voters”, “risk of making assessments difficult to read by voters”.\nI disagree that this proposal is likely to be implemented successfully.\n", "q1r": 2, "q2": "Defining the success as “having all CAs use this tool” seems a little bit far to me, as the proposer understands some CA will prefer not using it and have already said so in the various collaboration places. I would recommend the proposer to set a more reasonable or intermediate target, that the community would be able to track on a shorter horizon.\nThe proposer offers daily reports to the community to monitor the progress of the project, this is a good point.\nI agree that the community will be able to monitor the progress of the project.\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10173, "q0": "That's a good idea. If there is a questionnaire, it will help CA to evaluate easier and improve the quality of project evaluation. If the questionnaire is really built on the proposer's actual experience as a CA, it will have high accuracy and efficiency. Through that, solve the problem that Challenge requires. \nHowever, I see you mentioned that the main risk to the success of this project is the unwillingness of CAs to adopt and use this tool. What solution did you have for this? I think if possible you should do video tutorials on how to use the tool and showcase it in Catalyst meetings, CA meetings for example. I think the effectiveness and contribution of the tool you create to the Challenge depends a lot on the number of people using the tool and contributing to the tool's development. You should think more about your marketing strategy so that more CAs know and use this tool.", "q0r": 4, "q1": "The implementation plan should be more detailed. Because you deploy in 3 months, if possible, you should make a weekly plan to easily track and manage progress.\nRegarding the budget, you have listed the items to apply for funding but there is no detailed list of work items and expenses. If we only state the total costs for the 3 major categories of tool creation, tool integration, and marketing, Catalyst cannot check the reasonableness of the costs.\nRegarding team members, I see only 1 member has CA, vCA experience in recent funds, while the rest of the members mainly have experience in business, software engineering, interpreting, and translating. How did these experiences contribute to this project? Who creates the questionnaire? How do you plan to make this questionnaire available in more languages? I have looked at the link attached to the team member information, but I can't find any proof of the experience you mentioned.", "q1r": 2, "q2": "Regarding the roadmap, there is no clear implementation roadmap.\nRegarding the indicators/KPIs to measure the progress and development of the project, the proposer has not yet given the parameters to evaluate the progress. Tool creation is tracked by a daily progress report, however, is no mention of where it can be viewed by the community. Same for the marketing category, you state that it's done by a dedicated team. Professional with more than 10 years of experience. This team of yours doesn't seem to appear in team members. And what are the criteria, indicators, and KPIs of marketing campaigns? I would appreciate it if you could give specific indicators and KPIs for each part of the plan.", "q2r": 2, "assessor": "z_assessor_823", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a structured questionnaire to assist CAs in their process. This worked very effectively resulting in Good / Excellent Assessments.", "experience": "Active member of Catalyst Community - General ADA holder in Catalyst Circle V3, Community Advisor in Fund 6 and 7, Veteran Community Advisor in Fund 7, VCA in Flash Assessment in Fund 7, Cardano4Climate, Cardano Creatives, Founder of South Asian Town Hall."}