{"id": 398964, "author": "itra2", "title": "Enable educated CA decisions", "url": "https://cardano.ideascale.com/a/dtd/398964-48088", "category": 26453, "amount": 15000, "description": "How can we ensure that CA will make educated decisions?", "f6_no_assessments": 12, "f6_rating": 2.361111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 445, "q0": "Addresses the challenge well. It identifies accurately that one of the biggest barriers to an effective CA process is the confusion of so many different sources of information; and instead of trying to select just one source, it takes the Catalyst-friendly, decentralising approach of doing a kind of \"literature review\", and mapping, collating, and categorising them so CAs can easily access all of them. By engaging the CA community in this process, the proposal also ticks the box of active co-design. The only thing I would have liked to see is for the proposal team to include someone with some experience of being CAs themselves, to fulfil the challenge-setting's success-definition of \"Community Advisors (CAs) submitting proposals as a Team\". (The team do not mention if they've been CAs, but none of their Ideascale profiles show any activity under \"assess\", so this indicates they have not.)", "q0r": 4, "q1": "The proposal has some good elements on feasibility, but there is an overall lack of clarity. The suggested duration of 26 weeks (amount of time the project managers are engaged for) is good, and not rushed, indicating that the proposer understands that proper community engagement is not a quick task. However, the detailed timeplan is therefore confusing, as it appears only to cover part of the 26 weeks of the project. I like the fact that the proposal addresses the need to \"keep information updated in the context of the current catalyst program\" - but I can't see this accounted for in the timeplan or resourced in the budget, so I don't feel confident it would be realised. The team does seem to have relevant skills, although it would be good to see some links to their previous work; but it's not clear whether one of the team will be the \"content provider\" who will be contracted, or if this will be one of the \"further experts\" who will be engaged. As this content-creation role represents the bulk of the work and the budget, it would be good if this was explained; and, if the content provider is yet to be recruited, some detail should be given about what specific skills will be sought, so we can assess if these are appropriate and sufficient for the task. The budget is also a little thin on detail, and the costings seem off - just over $400 a month ($2,500 for 6 months) for a \"senior consultant\" to manage the project looks very low, so I would value some information on how much work is expected for this. On risk - the risks are not defined well; and the mitigation suggested for the one risk that has been identified is odd (the proposers suggest they will mitigate the risk of difficulty engaging the CA community by enlisting the help of IOG and Cardano - but they haven't elucidated how that would work, nor have they explained why they would not take the more obvious approach of approaching the CA community either directly via its many channels, or via Catalyst Circle). On balance, I regret that I can't feel confident that this proposal will be successfully implemented.", "q1r": 2, "q2": "Auditability information is a little thin. The Agile/Scrum approach *can* be validly used for audit as well as project management - but in order for us to assess the auditability, the proposal needs to define its metrics: i.e. what will the team actually measure, count or assess to determine whether the project is succeeding? What kind of desired outcomes would be in the user stories for this project? etc. It would also be good if the proposal mentioned how the information from sprint reviews will be recorded, and if it will be shared with the community (and ideally, I'd like to see the team use an open-source tool such as GitHub for this, in line with Catalyst's open-source ideals, rather than e.g. a proprietary Kanban tool). And in the \"what does succeess look like\" section, the proposer mentions their ideal of an \"Above 9/10 review score\", but there is no information about this review process so that we can assess how validly it audits the project. For example, will only users be asked, or will there be any attempt to include the perspectives of those who chose not to use the tool? What will be asked - will it be just a blunt-instrument \"how satisfied are you\"? or will any attempt to be made to elicit reasons? And will the review be done only at the end of the project, or will there be any mid-term evaluation while there is time to make adjustments in response? (As an aside, I'd also like to have seen the the review process, and how it is to be resourced, explicitly included in both the timeline and the budget.) But overall - based on the information given here, i can't fully agree or fully disagree that this proposal is auditable by the community.", "q2r": 3, "assessor": "z_assessor_1157", "no_vca": 11, "ne": 6, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 659, "q0": "Perhaps the most common complaint of recently onboarded Community Advisors is the massive amount of information that is available and how difficult it is to get it all into a frame of reference that they have access to.  There have been lists, spreadsheets, living documents...all suffer the same fate:  they lack protocols and enthusiasm to keep up with the constant change that defines the Catalyst process, and they eventually become outdated...and then abandoned.  What the proposer suggests here has perhaps the dynamism to survive this process:  a visual map of the Catalyst ecosystem as it relates to CAs and their work.  They hope to address the need for the map to take on a life of its own by building out the contribution protocols so that new knowledge can easily migrate into the visualization, and also renumerating CA participation in building it out.  It is unclear if the renumeration is meant to extend into a maintenance stipend or how they intend to keep the enthusiasm rolling...the expectation is that it will be effective enough, and easy enough to keep updated, that the community energy around using it provides the incentive to make sure that new knowledge and resources are captured there.  They intend to collaborate closely with the CA community to build it out, which is good.  Often when good lists have gone bad in the past, it has been because they have sprawled and become random repositories of vast reaches of irrelevant, outdated or unrelated knowledge, so keeping this resource map tightly tied to the CA community (with community consensus for changes) may provide the guard rails needed to help prevent this attempt from ending up like many of the others.", "q0r": 4, "q1": "The team has provided minimal information to backup their qualifications, however the qualifications they have listed seem adequate to the needs of the project, which mostly involve collecting and organizing information, and conducting outreach and onboarding for delivering and maintaining the visualization map/tool.  They indicate that there are tools they can use to this end, but the specific tools are not listed here.  The budget is also quite general, not listing specific tools or if they have annual costs.  There does not seem to be any concern that there would be an ongoing budget issue to maintain the tool, and they state clearly that all resources created in the delivery of the project, including the final map, will be handed over in their entirety to the community.  For time, they see the project being delivered in 5-7 months, with a very broad 3-phase set of milestones.  There are no specific development sprints or expected commits for the process, and there is an indication that they will be choosing how to implement the CA Universe based on feedback from the community, so it may be possible that no real timetable for sprints and commits is possible until a particular mode has been chosen.  They correctly identify that community engagement is a key to both creating and maintaining the map, and their solution for the first is to compensate engagement, though they have not included those terms.  As to the second issue, they seem to be relying on the effectiveness of the map to be the source of its own engagement, simply the best place to put new knowledge so that it gets seen, which creates the follow-on problem of everyone treating it like a billboard and overwhelming it.  Only clear protocols will save it at that point, so hopefully they are up to the task of lining that out early.", "q1r": 4, "q2": "There is a clear and simple path laid out for this project, starting with community outreach and collection of info and ending when the map is delivered.  In between are milestones for onboarding users/maintainers and collecting user reviews.  From this process they intend to deliver on a handful of KPIs, one of which is actually not a target they should be aiming for.  The KPIs for number of CAs engaged and updating it, and the positive ratings earned from users are good and will be useful information, but the total number of resources mapped is a two-edged sword:  if the map starts to sprawl, it will fall into disuse because it will be too hard to keep it all within a frame of reference.  It is very important that the team both establish a standard for comprehensiveness, but also standards for inclusion and non-inclusion.  Perhaps a good approach is layers or filters that allow a user to sort the map by classification of the information they seek, for example by \"Beginner: onboarding\" or \"recently submitted\" or \"most referenced\".  The number of quality layers designed is both a source of scalability and a possible metric to track progress.  Because they are relying on community input to create the product, it is expected that the community will have no problem keeping track of the proposal.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 924, "q0": "The proposal centers on building a new tool for CAs, which is covered by the challenge setting and given the time needed to study proposals, check all weblinks, cross-reference other proposals by the same team etc. could be an excellent way of improving the CA process and channeling energy and resources towards more and better assessments by cutting down on prep time. Unfortunately, it is not at all clear how the proposers would achieve this apart from presenting a \"birds eye view\", and the solution does not state whether AI will be used,  if this is open source, improves visualization or simplifies or standardizes anything  - I am completely left in the dark how my experience as a user is going to improve. No attachments or media are provided to give even a glimpse of a prototype or describe the direction of improvement aimed for. While most of this already affects the scoring for Feasibility, I consider the lack of clarity a major obstacle to assessing the impact positively. Thus, I have to disagree that the proposal is likely to improve any of the problems described in the Challenge setting.", "q0r": 2, "q1": "The proposal is very vague about what kind of new tools CAs are supposed to receive and instead resort to slogans like \"bird's eye view\", \"all necessary information\", \"collaboration tool\" without technical details, features or reference to prototypes or even inspiration. The proposers do not provide links for their professional track record or samples of previous successful projects. The timeline does not add up, and various different periods of \"3,5 months\", 2 months and 52 weeks are presented without creating a link or coherence between them or providing milestones or a roadmap that could be understood without precise dates.", "q1r": 2, "q2": "Instead of providing detailed KPIs with matching targets, a quantitative discussion of the timeline from the previous section and specific commentary how to audit and risk manage the proposal, biweekly sprint reviews are provided as the sole audit instrument. This is not backed up by examples of how this could look like or references to the proposer's experience with agile management. This gives me low confidence that the proposal can be audited sufficiently and its progress tracked over the implementation timeline.\nThe proposers aim for a \"9 out of 10\" score for their work without elaborating the process how the entire community of CAs is going to vote on this or whether a sample would be used.", "q2r": 2, "assessor": "z_assessor_1243", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1861, "q0": "At first I thought the problem statement was regarding the issue of CAs assessing proposals that are outside of their expertise, however it turns out that this is a proposal for the creation of a summarized at a glance resource of all resources for the CAs. I would recommend to the proposers to try to explicitly describe their ideas in order to help the voter understand them easily. \n\nThis proposal fits in the challenge objectives. And the solution presented is a creation of a new tool to help the CAs to be informed on what resources are available for her. \n\nThe impact on the CA community is arguable because there already are several projects that are working on this problem, namely Catalyst School. Adagov, AIM, etc. and the success of this project will depend on the team providing a better solution than the groups already working on the problem. \n\nThe solution is not detailed and lacks some logical connections. For example: it is not explained why the IOG will agree to help the proposers in solving the challenge they have identified; why are the CA community and Cardano community a different thing and if they are, how the Cardano community will help solve the organization of resources specifically designed for the CA.\n\nDue to the uncertainties arising from the proposal presentation but the proper alignment of the proposal I neither agree nor disagree that this proposal effectively addresses the challenge.\n", "q0r": 3, "q1": "The proposal states that in 3.5 months a Map of the CA universe will be delivered, however it is not explicitly stated what this time frame is related to. I suspect it is related to the moment of funding, but this is just speculation on my side.\nThe proposal lacks detailed breakdown of the process and any milestones. \nThe budget is not broken down in detail. For example It states 26weeks $2500 but does not show how much per hour, so that the voter could estimate the real time that would be active work hours. Also the majority of the funding goes to “Contract content providers 1 support for delivering CA overview.” which is not explained in detail anywhere in the proposal. \nThe team is well described, but there are no active links to nether linkedin profiles nor projects that the team claims to be actively involved to. \nThis vagueness that underlines the whole proposal erodes the credibility and therefore I disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 2, "q2": "There is no road map, no time horizon with mile stones in this proposal.\nThere are two metrics for success but they are for the period after the project is completed, therefore they couldn’t be used to finance the proposal stage by stage.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n\nDear proposers, I want to spend some extra time to communicate with you. \nThe idea that you are presenting is very good and is of great need for the CA community. As a CA I should differentiate the idea from the proposal and I should evaluate the proposal on the merits of how it is written. The feelings that your proposal rises in me are:\n that you have put it together in a hurry, because it is not detailed;\nthat you don’t have a lot of experience in Catalyst, because you should know how a proposal should look like if you have spend some time around and also because you use terms and ideas that more experienced Catalyst members would consider illogical or wrong.\nMy suggestion to you is to prepare the same idea with a better proposal for the Fund 9. You could use the voter tool https://cardanocataly.st/voter-tool/#/  to check how a well written proposal looks like and you could use the CA tool https://cardanocataly.st/ca-tool/#/  to gain the understanding of how the CAs should evaluate your proposal. \n", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2106, "q0": "It took me a while to really understand what this proposal is all about. At the first glance I was quick to leave it aside for not being intelligible. But then it struck me. This proposal aims at “organizing” existing sources of information relevant for the work of the CAs. A problem most definitely exists through the fact that most useful information for CAs is placed in different websites, using different styles and formats, and it is not very straight-forward to make sense of it. Would such an organization add value to the work of CAs? Most definitely!", "q0r": 4, "q1": "Judging the 4-person team by their backgrounds, they seem to be perfectly positioned to carry on such a job with a nice blend of competencies such as project management, team organization, building of decentralized governance models or corporate transformation which are most definitely in short supply within the Cardano ecosystem. \n\nTime-wise the project is very briefly explained. A one month phase for creation of the CA overview, and another month for delivery. I somehow struggle to understand what kind of details lie under the “delivery” phase and why it takes an entire month, so additional details under that caption would have been very welcome. \n\nBudget-wise is the aspect that worries me the most. 30% of the budget would go towards two consultants for project coordination and scrum master assistant. Okay. However, the other 70% would go towards content creation (sub-contracted to a contract provider). My first worry is that I understand the process to be one in which existing elements are aggregated and put together in a structured approach, but now I read that new content would be created. I’m not so sure I follow. The second worry is the sub-contractor, why is it necessary to externalize the activity and, being the bread and butter of the project, why hasn’t a contractor already been chosen and presented in the proposal in a bit more detail. \n\nOverall a few red flags that make me slightly negative towards this proposal’s chances of success. ", "q1r": 2, "q2": "There is very little to none details provided anywhere in the project that can help me assess the way in which the community can follow up this project if implemented. Perhaps in the next iterations the proposer can spend some time explaining a few things that were not clear to me: \n\n- how does the actual deliverable look like and how do they plan to integrate in with the already existing CA tools in use\n- who within the team would be in charge of communication with the Catalyst team and how do they plan to inform stakeholders throughout and at the end of the project\n- how do they measure success? The project is vague and I can’t really offer any tips, but for them this aspect should be clear. ", "q2r": 1, "assessor": "z_assessor_1454", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2209, "q0": "Proposal seeks to aggregate CA tools and materials into one bundle for better CA performance and onboarding. Such a tool is directly aligned with goals and key metrics of the campaign. Such a tool would bring value to Catalyst CA community, however exact impact is hard to determine due to lack of count and context about current solutions that would be bundled together into proposed tool. A brief overview of relevant material would greatly increase the clarity of projected impact. ", "q0r": 4, "q1": "Accurate evaluation of feasibility is hard due to unclear deliverable of the project. Its not stated whether final product is a website, app or in some other form, only that it is \"overview of CA universe\". Team fields enough experience between its members for proposed tasks.  \nThe budget is not detailed and 2/3rds of it are allocated to unclear provision : \"Contract content providers 1 support for delivering CA overview. 10000 USD\" More detailed explanation and reasoning for budgeting would provide needed clarity. Provided plan is lacking in clarity as well, only a rough timeline for project delivery. \nThere is no information on proposed technical aspects of implementation.", "q1r": 2, "q2": "Project has rough milestones and timeframe for deliverables and is simple enough to audit, although lack of detail might impede proper audit process. KPIs are not set, and success metric is selected as a review score of the tool, however no mention of how the review process is gonna be accomplished. \nI would suggest a set of clear milestones with completion dates and KPIs to assist with auditability.\n", "q2r": 3, "assessor": "z_assessor_1460", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5510, "q0": "The proposal has the aim of developing “an overview of all relevant information sources CA need for their work” and while the word overview is mentioned 12 times across the entire text of the proposal, there is no definition or concise term that would describe what overview means: “CA overview, we will produce several options of a coherent easy to understand overview”, “CA collaboration on such an overview, we will suggest a simple collaborative method to migrate information into CA overview”.\nSince there is no clear presentation of their plan with this proposal, I would suggest to the team to resubmit it to a future fund with a more unambiguous description, that would make it easy to assess.", "q0r": 1, "q1": "The detailed plan and timeline should contain enough information to make it sufficient to understand the steps that will be implemented for the completion of the proposal. For example, what does “Map of the CA universe” exactly mean, or what does “Delivery to the comunity (1 month)” imply?\nThe budget is loosely described, but it should have included a concrete task description with the needed time to accomplish it and an hourly rate for each. As the proposers have described the majority of the funds “ Contract content providers 1 support for delivering CA overview. 10000 USD” is unclear what the task is about and who is needed to complete it and in how much time.\nAs for the team description, they have provided a short description for each member, but they should have also included social profile links for the community to be able to verify.", "q1r": 2, "q2": "Since the project description is not accurate and the end product of the proposal is unclear, the development progress is also vague. The team mentions the delivery of sprint reviews and a project agile board, but the community cannot assess the progress of a project, if the project is not clearly described.\nThe same applies for the success definition, the uncertainty is amplified through phrases like “overview discused in relevant circles and meetings”, whereby the word  “discussed” and “relevant” in this context are very generic.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6195, "q0": "I have read through this proposal three times and I am still not entirely sure what they are proposing to do. Overall it does appear that they are trying to do something to improve the CA process, and because of that I gave them 3 stars as they is related. But other than that I am very lost. They say that they will map the CA process, but that information is already available and I do not think it is preventing anyone from being a good CA. Then when they talk about CA collaboration, I do not know what they are trying to do with it. I would suggest spending a bit more time in the next round and really building the idea out and making it easy to understand. ", "q0r": 3, "q1": "As mentioned, after reading through this proposal several times, I am still unsure of what the plan is or what they are trying to do here. Because I do not even understand what the plan is, it is very difficult to assess if it would be implemented successfully or not. Some additional details about the deliverables of this project would have been helpful in understanding if they would be able to deliver on it. ", "q1r": 2, "q2": "This was the category that needs the most improvement. The team has not provided sufficient information that we can use to audit against them. What are the KPIs that they have proposed? They did provide a timeline which is good, but it is so high level and does not provide much useful information. The budget is also very high level and I cannot see how they arrived at those figures. The information they provided on how to measure the success of the project is so brief and vague that I do not think we could easily audit/track against it. I would suggest working to improve this area in a subsequent round. ", "q2r": 1, "assessor": "z_assessor_347", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7176, "q0": "In general, this proposal attempts to align with the objectives of the challenge.  However, in its approach it does not offer a significant advance over the work that other teams in previous funds have already advanced.  The three components described in the Impact section (mapping, overview, collaboration) promise to be addressed under the methodology already developed by previous proposals.  As is recurrent in most areas of study, consulting previous work by authors recognized for their contributions is part of the process of designing a project whose purpose is to provide progress.  Unfortunately, the proposal shows signs of going around in circles until its budget is exhausted. ", "q0r": 2, "q1": "The activities in the Roadmap and Budget are described in general terms, without details of their rationale or execution.    ", "q1r": 2, "q2": "There are no defined KPIs. This proposal does not present a concrete way to measure its performance. It does not provide quantitative measurement tools whose output is the generation of concrete data.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7722, "q0": "Proposer main idea is to build new tool for helping CAs work. But still no more explanation about the \"tools\". Is it documents / workshops / an app or what? Explaining more about \"the tools\" will encourage community to vote this proposal.", "q0r": 2, "q1": "Team members are wrote in the proposal, CAs have to find it ourselves about their credential. I suggest next time should adding LinkedIn url or Git Hub. Their timetable is too simple and not detailed. For example: 3,5 months to mapping the CA's universe, what will the team do? Any more information would be very helpful for community to reviewing this prosal.", "q1r": 2, "q2": "This proposal hard to audit. Proposer can create Git Hub page / Spreadsheet timetable for community to track your progress. The success indicator the proposer wrote is too hard to track. Since this \"tools\" will help CAs work, proposer can wrote: number of CAs using the tools. So if the tool is an app or website, we can see the traffic as the success indicator.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8500, "q0": "This meaningful proposal seeks to create a birds-eye overview of the needed information. As can be seen, the problem seems to be quite abstract, the proposer started with the right question/demand, making \"educated decisions\" of CA is a really necessary legitimate demand, however, the following contents do not show a clear solution to address this need. I don't think \"Create a birds-eye overview of the needed information\" as you describe is effective for achieving the goal of making CA decisions mỏe educated because the work of gathering the information/tools needed for CA is only part of the problem, you should consider clarifying the 3 aspects/components mentioned [(1) Mapping of the CA process; (2) CA overview; (3) CA collaboration], and explaining why you think implementing/creating it will help solve the problem. As a result, the solution you are aiming for is definitely highly recommended because it will help increase the value of the ecosystem, in certain respects, however, if compared with the goal of forming \" educational decisions\" that the proposer aim, the expected impact is not really clear.\nBased on the given information, I am neutral with this proposal's impact and rate it with a score of 3.", "q0r": 3, "q1": "Basically, the proposal provided much\nAs shown, this team description is adequately provided and mentioned to demonstrate appropriate experience and skill for implementation, but there is no source (documents/links, etc.) for verifying. But there seems to be no info about a demo, pilot, or prototype that implemented by this team/team's member(s). In relation to the goal of this plan, for ensuring that CA will make educated decisions, you should consider clarifying the 3 aspects/components mentioned [(1) Mapping of the CA process; (2) CA overview; (3) CA collaboration]. Besides, this proposal provided definite, realistic, and quantifiable KPIs/metrics, a believable roadmap. However, some cost items need to be clarified in detail, for example: \"Contract content providers\" [$10000]. If all of those issues are clarified, I think, its feasibility is really convincing from this standpoint.\nBased on the given information, I can rate the feasibility of this proposal with a score of 3.", "q1r": 3, "q2": "In general, this proposal has supplied a wealth of important information. To begin with, this team's identification is defined enough for understanding, but without supporting documentation (documents/links, etc.) for confirmation. The detailed plan is thoroughly explained for comprehension, and KPIs are given and quantifiable. The overall budget comprises an item hierarchy but lacks a detailed description of the calculation foundation for some cost items [ex: \"Contract content providers\"- $10000]. In summary, the material offered is quite comprehensive. However, if this team reconsiders the issues I outlined above (in \"impact\" and \"feasibility\"), there will be additional information and issues to clarify in order to reach their ultimate aim - to \"ensure that CA will make educated decisions\".\nAs a consequence, based on the information supplied, I can rate the auditability of this plan. a rating of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9890, "q0": "In order to make sure that Community Advisors make educated decisions, this project offers to deliver an overview of relevant information sources needed for their work. The result will be a tool, gathering and summarizing information considered as relevant.\nThe proposer does not demonstrate how current CA Process is suffering today from non-educated decisions. As a CA and a VCa myself, I am only assessing proposals I understand. Of course, I am educating myself to new knowledges in the process and it is an important part of my journey in project Catalyst. The proposal does not demonstrate how impactful this tool would be to make this education process easier.\nI disagree that this proposal effectively addresses the challenge.\n", "q0r": 2, "q1": "The solution lacks essential details (example of source of information), suggests that the catalyst process is not very well known (mapping of the CA process) and the risk analysis only mentions a possible lack of engagement from CA. Even if I am not an expert, I can see several risks that could be mentioned and that should be mitigated to improve the quality of this proposal: lack of stability and evolution in the sources of information, changes in Project Catalyst process, changes in the tools used by the community, unwillingness from AIM team to partner and include this tool in the CA tool.\nThe road map is lacking details, and the budget breakdown as well.\nI disagree that this proposal is likely to be implemented successfully.\n", "q1r": 2, "q2": "The community will be able to track the progress of this project by monitoring the project agile board with backlogs, and by regulary sprint reviews.\nConsidering that the timeline and budget lacks essential details, I neither agree nor disagree that the community will have the capacity to monitor the progress of this project.\n", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Create a birds eye overview of the needed information.", "experience": "We are a group of 4 covering senior experience in\n- Project management and team organization\n- Consultancy, building of decentralized governance models, corporate transformation\n- Decentralized Organizations,\n- In collaboration tool building and blockchain based solutions"}