{"id": 400153, "author": "fhilip.k", "title": "vCA-tool Dev & Maitain - AIM", "url": "https://cardano.ideascale.com/a/dtd/400153-48088", "category": 26453, "amount": 7500, "description": "The vCA-tool needs to be updated for each fund. Additional features can be added.", "f6_no_assessments": 9, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 451, "q0": "Aligns well with the challenge aim of maintaining vCA resources; particularly as this is a established tool that the community has been using, so its value is already mandated by use. Also, the proposers are incorporating changes requested by the community, (and they are themselves part of the vCA community), so the tool represents an instance of the kind of community-led co-design specified in the challenge setting.", "q0r": 5, "q1": "Since the tool has been maintained and widely used over several funds already, the proposal is clearly very feasible. Also the team are not simply putting in identical continuation proposals fund-after-fund, but have clearly thought about what new needs have emerged in order to make the proposal feasible this time, and are onboarding new developers in response. Their timeline is clear and thought-through, and takes account of possible issues with updating to Vue.js 3 this fund. The proposal budget is modest, but it takes a \"full cost-recovery\" approach and includes all the more hidden/background costs of admin, reporting, meetings etc, demonstrating the team's experience in delivering. The approach of including development costs for AIM itself demonstrates an understanding of the need to make the work more sustainable, which increases its feasibility.", "q1r": 5, "q2": "Very auditable; the proposal uses simple and clear metrics tracked on GitHub and therefore very transparent and open. It's particularly good that the team are tracking feedback received and implemented, which enables audit of how far their work does actually respond to community needs.", "q2r": 5, "assessor": "z_assessor_1157", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 688, "q0": "This is the most critical tool that the vCA community has right now, and its continued iteration and development could be key to several upcoming initatives.  There are proposals for reputation, proposals for improving integrity, but have they thought about the last mile of delivering some of the solutions?  If vCA participation has requirements, for inputting fields or adding grades, where does the actual activity end up?  Of course, not everyone uses the vCA tool, but a case could be made that the only excuse not to is to game the system by working directly in the .csv where everything is a cramped mess of a hundred clicks to get anything done (except random grading, of course...that is easiest in the .csv, where the only limit is the speed of your clicking finger, and almost impossibe in the vCA tool).  Without any changes at all the vCA tool is the best way for a vCA to approach the grading in a thoughtful, qualitative way, and as the vCA process benefits from automation and future improvements to the quality of the assessments and the quality of the vCAs, it is going to be that irreplaceable qualitative aspect of the grading that will take precedence, and this is the tool to serve that future.", "q0r": 5, "q1": "The AIM team is accessible, and they have provided a clear proposal with a budget and timeline that looks adequate to deliver 2 funds worth of iterative improvements.  If I have any concerns, it is that between all three tools (CA, vCA, Proposer) the changes we may see with the emerging reputation system may require more funds to keep up with it than is being requested here and for the CA tool.  Waiting on Catalyst funding in that event will be a cramp, but it is a bridge to be crossed when, and if, we come to it.", "q1r": 5, "q2": "Completely opensource project...check.  Mutliple dedicated public communications channels....check.    History of delivering this exact product...check.  High availability and transparency of team members...check.  Previously funded and up to date proposal team...check.  KPIs that measure and show that this is pretty much the only tool the community has for this job...check.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 1516, "q0": "The vCA tool is widely used and well received by the community, it has become an essential tool for the average vCA to review assessments. In terms of impact, this is probably the most impactful tool available to vCA's. The proposal is well written and the purpose is clearly stated so that anyone can understand the importance of the proposal being funded. It is not possible to give a proposal more than 5 stars but the tool have proved itself very useful in multiple funds, therefore I will give this proposal a 5+ star rating in terms of impact. ", "q0r": 5, "q1": "The milestones are clearly stated with sufficient details, it leaves no room for uncertainty in the development process. Given the authors previous work and delivery of the tool, the plan is credible and feasible. The budget is clear and detailed with realistic compensation given the work ahead. \nThe team have a great track record of developing and adding features to the vCA tool, although the proposal does not mention the actual features that is planned to be implemented. Therefore, saying that the proposal is feasible will always remain true as long as you deliver *something*, it could be a small fix or it could be a huge new feature. Adding more transparency in the proposal as what to expect could increase the credibility since we easier could follow up the development of planned features.\nAlthough more details regarding upcoming or expected features could be added, the team have a history of delivering and are given a score of 5 stars in terms of feasibility.", "q1r": 5, "q2": "The KPI's presented are relevant and sufficient enough in terms of auditability. Although, it is unclear for me as a reader to understand \"Number of feedback received and implemented\". Instinctively the metric could be split up into \"Amount of feedback\" and \"Feedback received and implemented\", this way you could provide an extra metric with strong coupling to the community.\nOverall, the metrics are easy to track and follow up. A rating of 5 stars is given.", "q2r": 5, "assessor": "z_assessor_139", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2138, "q0": "This is a proposal for adding additional features to the tool that Veteran Community Advisors use in order to assess the reviews written by Community advisors - the ones that you, voters, get to read in order to make an informed opinion on whether to fund or not to fund the proposal. \n\nThroughout the previous funding rounds, the tool has been constantly improved. For instance, in Fund8 it was added the ability to use negative filters, not only positive ones. Right now, the proposers wish to add additional features regarding challenges, KPIs and maintenance proposals. \n\nI see a lot of merit in developing the tool that VCAs use - any kind of efficiencies gained there greatly improves veteran members’ capacity of filtering out poor reviews and maintaining a lively reward environment in which valuable CAs can add value to the Cardano community. Hence I find the proposal fully aligned with the challenge and a worthy incremental addition to the fund. ", "q0r": 5, "q1": "The VCA tool is already successfully deployed and in operation, and the 3-person team behind it seems to be fairly competent and technically savvy in order to tackle the tasks. In order to ensure sufficient resources, they had already welcomed two additional developers responsible for maintenance and development activities. In addition, two QA are assisting with quality assessment and backup in case of temporary shortages. \n\nThe proposed budget is fairly modest, with over half of it going towards development and QA, and the rest to be used for admin tasks, project management and one testing round - an absolutely must stage in order to ensure a quality delivery.  ", "q1r": 5, "q2": "The timeline seems feasible, with weekly milestones and overall a 6 weeks delivery time. The proposal aims to be implemented over the next two funding rounds, 9 and 10. Being a rather technical tool aimed at VCAs, I don’t see a very high need of constant communication to the broader Cardano community on this topic - and the main KPI to keep track of will be usability of the new features as judged by VCAs in future funding rounds. Definitely a GO from my side.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3021, "q0": "The problem statement considered here is regarding improving the existing VCA tool \"The vCA-tool needs to be updated for each fund. Additional features can be added.\", the current VCA tool developed and maintained by AIM from a couple or rounds is a great means for Veteran community advisors to assess the reviews for projects on catalyst program and is doing its job efficiently, yet as mentioned in the proposal the interface and platform needs to be refactored and maintained on regular basis for each fund round inorder to improve user experience, Since AIM is responsible for currently creating and maintaining the opensource tool and repository the solution to maintain existing features and digest Fund data to undertake operations effectively addresses the issue.", "q0r": 5, "q1": "As mentioned experience in the detals of this proposal by AIM team which has been providing continuous deliverable for the Crdano community with respect to tools, repo maintainance etc as the describe \"The Cardano AIM (Assembly of Inspired Masses) is a community guild of builders, creators and doers. Their goal is to develop community tools that progress the Catalyst Experiment and add value to the Cardano ecosystem. The Cardano Development fund is an addition to AIM proposals and is designed to assist with the development and management of the Cardano AIM guild.\", I find that they have been constantly working with and for the benifit of the community and definitely have the technical and non etchnical skills to deliver the proposed solution just like their previous deliverables and the tools used by All the vCA community members. Further the members of the proposal team Lucio Baglione, Victor Corcino and Phil Khoo are well known technical members of CA, vCA and cardano community as a whole being associated with this for a long time.", "q1r": 5, "q2": "The proposal according to revised structure of information from previous roud has a very detailed information regarding the development and maintainance phases of the vCA tools and corresponding deliverables, They have well defined audibilty and success KPIs being  \"Number of Github commits\nNumber of Github issues opened/resolved\nNumber of Github PR reviewed / merged / accepted\nNumber of feedback received and implemented\" These can be definitely used to measure the work progress and further they have provided detailed timeframe breakdown and fund break down of the requested fund of $7500 which can be measure of the success and efficient use of the funds.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5531, "q0": "The proposal is asking for funds for the maintenance of the already existing tool for vCAs, that the team members have developed a few funds ago. \nBesides maintenance, the developers will be adding new features, starting with the current fund, and ongoing into Fund9 and Fund10.\nThe tool has proven already to be of good use to vCAs, and on top of that it is open source, allowing thus anyone knowledgeable to build on top of it. \nI find the proposal to be a perfect fit to the current challenge, as it would positively impact the vCAs work and thus the entire Catalyst ecosystem.", "q0r": 5, "q1": "The timeline and plan are comprehensive, separated for each fund, thus offering a clear picture of the work that will be put, in order to have the project finalised.\nThe budget is quite extensively broken down, and looks reasonable and realistic.\nThe proposers have provided sufficient details about their role in the Catalyst community, skills and previous work and have attached 3rd party links for verification.\nI have found no need for any additional information, that would have aided in the assessment.", "q1r": 5, "q2": "The development progress is well described, and offers the opportunity for the community to verify it, through Github commits, issues opened, resolved and so on.\nThe success description is realistic, achievable and easy to verify, since the community tool is open to anyone.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5996, "q0": "I believe that this proposal is definitely in line with the challenge setting and will provide a necessary and very important service that will greatly benefit the vCA community. This tool has been incredibly helpful for vCAs to do their work in an effective manner. Adding the negative search features will allow for more in-depth analysis by vCAs because it allows for a more narrowed search of proposals. When there are thousands and thousands of CA reviews, it can be overwhelming for vCAs to navigate these proposals in an effective manner. Thus, it is of the utmost importance to have tools that make the lives of vCAs easier since, after all, this is a volunteer position, and the vCAs are giving up some of their time to contribute towards improving the cardano ecosystem. As mentioned by the proposers, this proposal is of the maintenance category which is listed under the challenge setting as one of the key goals. (score given: 5)", "q0r": 5, "q1": "Given the information provided in the proposal, I have full confidence in the success of this proposal. The proposing team themselves are all very active members of the cardano catalyst community and have contributed much to the vCA tool already. They have the necessary skills to make this proposal happen, such as the technical background, experience with vCA pain points, and experience with different cardano groups like Swarm. Thus, I believe that the proposers will work tirelessly to make the necessary improvements to the vCA tool and be able to do so. With regards to the timeline, the proposers have listed out a crystal clear roadmap that includes weeks and tasks to be completed. It is very easy for me to see what tasks they intend to complete and by when. I also appreciate that the proposers acknowledged that some tasks (like the update to Vue.js 3) may not be completed on time and could be postponed to the next fund. Being able to acknowledge when things might not be completed fully on time is not only incredibly honest, but it gives me confidence that the proposers are not overpromising to the community – they are being realistic with their expectations for themselves. With regards to the budget, the proposers have laid out a breakdown of the requested funds that is very easy to follow. They have thought of all the costs, such as development, management, administration, and testing/QA. I can easily see what funds will be going where, which is another good sign that the proposers will deliver on their proposal. (score given: 5)", "q1r": 5, "q2": "Given the provided information, I believe that this proposal will be auditable. The proposers listed out some good metrics of success, such as the number of github comments, the number of github comments resolved, and the amount of feedback received. These are all trackable metrics that can help measure the proposal’s success. Additionally, the major metric of success will, of course, be the delivery of two major updates to the vCA tool in funds 9 and 10. The entire cardano community will be able to see the vCA tool in action, which will allow for great auditability. If I had to give any feedback, I would recommend that the proposers also consider including the proportion of vCAs who use this tool as a KPI. If this data is gathered in the survey when vCAs turn in their work (a simple yes/no question), it could be a good metric to see if more and more vCAs are using the tool fund over fund, which would be an indicator of success. (score given: 5)\n", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6433, "q0": "I have just assessed the corresponding proposal for the CA-tool this team is responsible for and have given it a glowing assessment. If I have done that for a tool I hardly use [yes, I prefer my spreadsheets :)] then I can only give as high a mark for the vCA-tool which I heavily rely on. I don't need any credentials besides being a CA/vCA to state my complete agreement that this proposal indeed falls within this Challenge. The vCA tool has helped making a big-volume activity much easier to tackle. And the provision of filters allows a vCA to approach his/her assessment in so many different ways. It allows a vCA to adjust as the work is on-going, react to requests from Catalyst to focus on certain aspects, and personally, permits me to assess CAs in a more objective manner, which eventually is a good thing in activities where subjectivity can quite easily creep in, even unintentionally.", "q0r": 5, "q1": "The bona fides of the team has been proven time and again, although for voters who aren't as familiar, the proposal provides names and experiences of all involved. I didn't shave off any points for the fact that Linkedin urls weren't provided due to my familiarity with the names but voters might appreciate the links' inclusion in future funding rounds. The development plan for both funds 9 and 10 are clearly described and provides confidence the tool is moving with the times, which is more than we can say for ideascale, which seemed not to have improved at all. As a vCA and as a former assessor of tenders for a university, I completely agree this proposal will be implemented successfully and on time.", "q1r": 5, "q2": "Besides being able to use the tool at its final stage and noticing the improvements, this proposal includes quite a number of auditable items which anyone can assess for themselves via the GitHub repository. In fact, the KPIs listed may act as a checklist for its progress even if one is unaware of codes and programming. It is commendable the proposers listed enhancements for the two different funding rounds separately as the use of the tool during Fund 9 would also act as a mid-audit point for this very proposal, when hundreds (hopefully) of vCA utilises it when conducting their part of the process. Good luck.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9896, "q0": "Information to voters who are not familiar with what VCA do:  vCA-Tool is very important for Project Catalyst, as it is a critical part for the efficiency of Veteran Community Advisors (VCA) work. VCA perform the quality insurance phase, between the production of reviews by CA and the voting phase. Entry barrier to become a CA is very open, on purpose to grow the community and to benefits from every good will. The drawback is that there can be low quality reviews and bad behaviors which can be harmful for proposers and for voters. VCA read all reviews and filter out reviews that do not meet minimum quality criteria.\nWhile AIM dev team as in the past requested funding retroactively after having developed the tool, this proposal intends to on board devs in advance to allow tool maintenance, adaptation to future change in Catalyst process, development of new features.\nI strongly agree that this proposal effectively addresses CA improvement the challenge, and this 5-star score should be 6 !\n", "q0r": 5, "q1": "vCA-Tool is up and running, and its development team known as AIM is skilled and has experience in the Catalyst Project. Many details are given about the AIM team members, showing that they gather the skills necessary to keep this project successful.\nThat’s probably why the feasibility part of the proposal is also very well written: milestones, budget breakdown is detailed and relevant.\n", "q1r": 5, "q2": "vCA-Tool is an open source project and has a Github depository. Following the activity on Github (commits, issues opened / resolved etc) offers to the community the ability to monitor the development of the project.\nBesides, the detailed milestone enables to follow that they follow the targeted roadmap.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Provide adequate funding to ensure that the tools is maintained and additional features are added.", "experience": "Developers of the AIM Community Tools. Successfully funded across multiple funds, active community members."}