{"id": 400622, "author": "fractalfuzion", "title": "Community Advisors Marketing Blitz", "url": "https://cardano.ideascale.com/a/dtd/400622-48088", "category": 26453, "amount": 9500, "description": "Many Cardano users are unaware of project catalyst and community advisor role specifically. There is not enough Marketing. Lets fix it!", "f6_no_assessments": 9, "f6_rating": 3.185185185185185, "videos": [], "media": [], "f6_assessments": [{"id": 707, "q0": "I would describe this as the design and implementation of a flash marketing campaign to onboard new CAs for Fund9.  The proposer indicates that the key will be engaging material that is fun and exciting.  I don't disagree, but would suggest that just as important is having a philosophy about the approach that incentivizes these new Catalyst CAs to work on doing really great work, perhaps by creating a Fractal Fuzion cohort that reports back their results from the work to reward cNFT prizes or something like that for highest scores or whatever (among that cohort, not in competition with veteran CAs).  Marketing is not my thing, but this proposer seems ideally suited to this kind of outreach.  Something like this makes the community engagement more sticky, as they wait for vCA results, maybe an event aroud their first \"payday\" when the rewards are paid out, that kind of thing.  My point here is that a well implemented marketing blitz such as the proposer is suggesting has a lot of potential, not just for bringing on board more CAs, but for bringing them and their efforts into alignment with Catalyst values and principles, like Radical Inclusion, deep engagement and connection.  As an active CA, this proposer has the ability to bring the right perspective.", "q0r": 4, "q1": "Looking through this proposer's material I think he has the one thing this proposal really needs:  enthusiasm, and not just for spreading the word about Catalyst, but about the value of the CA work and of the community that arises from interesting people doing interesting and innovative things.  At root, CAs are helpers:  they help proposers, they help voters, and their activity in Catalyst channels means they are often helping anyone who just wants to know a little bit more about the Cardano ecosystem and Catalyst in particular.  The roadmap describes the landscape well enough, but is a bit sparse on details, especially surrounding the development of the marketing campaign itself.  What is clear is that the proposer has done this before in other areas, and is relying on a (very active) community network they have already established to get them the live feedback and material they will need to bring it home.  The delivery of a retrospective is a nice add and could lend itself to possibly scaling the outreach.  As an aside, the original researchers for the Catalyst protocol, in the paper they released on it, described 6 main areas of funding for a treasury like Catalyst. Number one, and by a large margin, was \"Marketing\"...but that hasn't been the way Cardano and Catalyst have traditionally moved (development, education have been the two biggies for Catalyst).  As the Voltaire era is picking up, that is just something to think about while you are looking at this proposal with its emminently reasonable budget...", "q1r": 4, "q2": "Initial acquisition of material needs to be carefully managed, as the reporting protocol may end up blocking this project.  The issue is the initial funding release and how quickly they get to the point of paying artists and contributors, as without specific things to measure, or specific progress to report, they may run into difficulty reporting for that month.  My advice is to use the inital month to get as much material with that budget as possible, and to lock in the partnerships and whatever participation is necessary at that point for cNFTs and drops and faucet development.  The ability to report those partnerships and expected deliverables from them (or whatever equivalent the proposer has in mind) should release that 2nd tranche that will likely pay for the actual development and probably most of the art.  Once they have that, the auditing should be on autopilot,  and the included engagement metrics should suffice.  To bring it home it would be nice if there were some way of grabbing performance metrics from the new CA cohort from this camapign.  Not exactly sure how to do this, but if it can't be figured out with cNFTs, I'll eat my hat.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 455, "q0": "The proposal will encourage more people to become CAs. Although this is not something specifically identified in the challenge setting (the focus of this challenge is not finding new CAs, but improving the CA process) I agree it is definitely needed if the CA process is to be sustainable; so to that extent, the proposal addresses the challenge. However, the proposal *says* that it addresses the challenge by \"develop[ing] tools for the Cardano community advisors program\" - but I cannot see any reference in the proposal to any tool for CAs being created; the proposal is simply a marketing plan. It also says it addresses the challenge by \"delivering massive improvements to community advisors understanding of how the program operates\" - but I cannot see how this proposal would achieve that. The main target audience is clearly identified as people who are not yet even aware that the CA process exists -  it is very unlikely that material targeted at them will deliver any new information to people who are already practising CAs. So while I agree that the proposal does address the challenge to some extent, it doesn't do so in the ways that it says it will, and it does seem to be exaggerating a little how relevant it is to the challenge setting. Overall, I can't fully agree or disagee that it addresses the challenge.", "q0r": 3, "q1": "Yes, the proposal does seem feasible. The timeplan is clear and realistic, and I like how it is linked to the onset of fund 9. The budget is clear, and appropriately broken down. I feel that the work is a little underpaid, but this could be a localisation issue - the proposer does not mention where they are based, but what looks like low wages might be normal in their country. The proposer evidently has the skills and contacts to be able to carry out the work (a quick Google let me find and verify the proposer and their projects on Twitter and Insta) - although it would have been nice to see these links included in the proposal itself, not least because including them would have demonstrated good marketing! My only real issue on feasibility is the poor risk assessment. The proposer has only identified one risk (i.e. the risk that content will be boring and not fun). I can see several other really obvious risks (e.g. what if the content doesn't actually lead to anyone deciding to sign up to be a CA for whatever reason - it hasn't reached the right audience, it didn't give a strong enough call to action, etc? What if the CAs it onboards don't really understand the CA process, because the fun content didn't explain it well and didn't signpost them into the CA community or towards CA learning resources, so they don't do good reviews, don't get paid, and end up disappointed?) I think the proposer could probably think through and address risk a bit better; but apart from that, the proposal is feasible.", "q1r": 4, "q2": "The audit metrics are clearly defined and readily measurable, and there's a nice focus on audit transparency. The only thing missing, is that the suggested metrics do not address the actual purpose of the project - to onboard new CAs. I'd like to see the proposer consider how to track - even just anecdotally - whether any new CAs are onboarded as a result of the work. But apart from this, the project is auditable.", "q2r": 4, "assessor": "z_assessor_1157", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1877, "q0": "The problem that has been stated in this proposal does not align well with the challenge goals, and does not help the key metrics of the challenge. This challenge is focused to improving the performance, existing tools, models and practices used by the CAs rather than expanding the CA count. “Community Advisors (CAs) submitting proposals as a Team to improve the CAs performance, activity and evolution.” As can be seen in the description of the challenge here https://cardano.ideascale.com/c/campaigns/26453/about\nThe challenge alignment is very important for any proposal and should be double checked and if in doubt the proposer could always contact the challenge team to ask for opinion and guidance. \nThe idea is good and could be proposed in Fund 9 if there is a suitable challenge that will align better.\nI strongly disagree that this proposal effectively addresses the challenge.\n", "q0r": 1, "q1": "The action plan is detailed and clearly presented. The division in 3 phases is very helpful in organizing the project and it will facilitate auditing and funds release.\nThe budget is beautifully laid out and it is very clear. I want to give Kudos to the proposer for the good work here. The whole feasibility section is very well made and instills trust in the abilities of the proposer and it makes it obvious that the proposer has a clear and detailed action plan in mind. For the next Fund, could be just polished and reused.\nThe only thing missing are some outlined milestones with exact numbers, how many interviews, how many videos, banners etc.\nAh, there is one more detail, pleas for the next time, provide links to your work and a CV or links to the places where you gained the experience you are stating. This will help the CAs to validate the exp. That you have and will help the voter to dig deeper if he needs to.\nRegardless of the impact rating, the CA should assess all 3 categories independently, and therefore I agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The auditability section of the proposal is poor. It lacks roadmap, milestones and any measurable benchmarks.\nTo achieve a good auditability section put yourself in the shoes of the auditor. If you had to give someone money for the work they should do, what kind of information do you need to take this decision properly? You will need a roadmap with dates and clear milestones, these milestones should be filled with concrete numbers. The project is well structured in phases, put a value on these phases. How much money do you need to accomplish phase1, and then what will constitute a completed phase one? Maybe 3 videos, 5 banners, 1 logo etc. and where are they going to be presented. Then the auditor will have clear guidelines if you have done your job or not and if you have, the auditors will release the next batch of funds for phase 2 and so on.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2143, "q0": "This proposal is a marketing effort aimed at increasing the number of CAs joining the Cardano community, and it rightfully addresses the problem of having a short supply of advisors compared to the ever increasing number of projects from each funding round. I think the proposal also aligns fairly well with the challenge. Will it be successful and scalable? Potentially, if executed correctly. ", "q0r": 4, "q1": "The person behind the proposal is Fractal Fuzion, a CNFT creator, stake pool operator and many other attributes listed, but I am not sure that marketing activities were even listed there, so I dare to flag this apparent discrepancy between the necessary skills for the project. \n\nThe project would be completed over 3 phases. Phase 1 will last one month and set-up the campaign infrastructure (design materials, banners etc.). Phase 2 will strive to on-board community advisors, but it is not very clear for what purposes. I can only imagine that it is for collaborating on active campaigns and active promotions amongst their individual circles.  Phase 3 is also rather unclear for me, which will definitely include documentation of the entire campaign, but also - and this is the unclear part - launching of a CNFT distributed as a record of the campaign. \n\nThe overall budget is charged at a rate of 25 USD/hour, with 160 hours in phase 1, 80 hours in phase 2 and 40 hours in phase 3.  ", "q1r": 3, "q2": "The project proposes to document the number of posts, likes, comments, views and to track engagement throughout media platforms used. All the data will be publicly available, but it is again rather unclear by which means will this public transparency be achieved. \n\nAs with every marketing campaign, it will be of course extremely challenging to split the benefits of the campaign from other CA onboarding efforts, but the industry definitely has the right tools in place in order to achieve this. For the next iterations my sincere advice would be to investigate tools that will make it as clear as possible what kind of success has the campaign achieved, through for instance, reference codes that can be tracked while onboarding new members or other ways of tracking new CAs to the marketing campaign.", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2213, "q0": "This proposal addresses a problem that is important to the ecosystem and how suggested solution would bring benefits to Cardano ecosystem , however it is slightly misaligned with campaign aims. Main goals of current campaign are improvements to existing CA workflow and collaboration while proposal tackles the issue of general CA pool size and marketing of CA activities. ", "q0r": 3, "q1": "Proposer asserts enough relevant experience to successfully complete project tasks and knows what kind of skills will be needed from other team members. \n\nBudget and timeframe are reasonable for the project but lack detail. Plan of execution also only provides rough details and no explanation of technical aspects is given. \n\nIn general, proposal seems to have a high chance of success, but more detailed description of deliverables would ease assessment of feasibility and reduce possible errors.", "q1r": 4, "q2": "Proposal only has rough milestones and lack of KPIs make it harder to properly evaluate progress or success of the project. A quantitative approach to named deliverables (\"Videos, logos, banners, 3d, AR, CNFT content\") and success metrics (\"to have a robust marketing strategy that captivates the audience and increases awareness\") would ease auditability.", "q2r": 3, "assessor": "z_assessor_1460", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5538, "q0": "After reading this proposal the following questions could be raised: are CAs supposed to become superstars in the Catalyst ecosystem, is money the driving force for becoming a CA and is quantity more important than quality?\nThe proposal plans to design “a full marketing blitz aimed at onboarding community advisors and explaining the incentives and strategies for success as an advisor.”\nHowever, the main scope of CAs should not be financial remuneration, described as “incentive” and there should not be a guide to how to extract as many resources as possible, described as “strategies for success”.\nThe main concept behind this challenge is to improve the assessing process, that would consequently improve the Catalyst process.\nHaving more people involved in the Catalyst process, especially if their incentive is of a financial nature, does not necessarily mean that the assessment process will be improved, maybe quite the contrary will happen.\nA lot of people in the Cardano Community are not active in Catalyst, not because they are unaware of it, but because they are unsatisfied with it.", "q0r": 2, "q1": "The detailed plan and timeline are comprehensive, containing sufficient information for assessment. The budget is also thoroughly described, with number of hours needed to complete each task, price per hour plus other fixed expenses.\nRegarding the team description, while the proposer appears to be looking to remain anonymous, he could have included some links to his previous works, to be able to make a better judgement regarding his artistic skills. Otherwise, I found it funny I didn’t know, that being a 2500 club member is worthy for a CV inclusion.", "q1r": 4, "q2": "The proposer has described some KPIs, and has included as method for tracking self reports, which can work to some extent, as they are also visible on the social media channels. However, those are mostly related to the growth of this marketing project, and not related to the growth in CA numbers, that he envisions as the purpose for this entire endeavour. In that regards, he should have included KPIs and methods of tracking for that, as well.\nThe success is loosely described, it should have included some clearly defined metrics, that would have helped the community in assessing the positive outcome of the project. So maybe instead of “that captivates the audience and increases awareness about the community advisor role in project catalyst”, he could have included a specific number of new CAs and a way of tracking their entry into the space via his social media channels.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7270, "q0": "The proposal defines a very real problem but, unfortunately, this problem is only indirectly within the challenge.  The challenge is for improving the CA process. The solution is also only indirectly related to the challenge.  It can be argued that making more people aware of the CA role will improve the process and support CAs, but I disagree.  \n\nThe proposal will create a marketing blitz using quality and interesting artwork specifically to promote the CA role.  Thinking outside the box... perhaps the marketing could be directed toward individuals and groups who are experts in assessment. To market to a professional group of assessors might directly improve the CA process.    As the proposal is written, I can't agree that the proposal effectively addresses the challenge.", "q0r": 2, "q1": "This is a solo team that plans to mobilize a creative community to create an exhaustive list of materials.  Fractal Fusion has an impressive list of credentials.  I believe the proposer, but a link to a portfolio and previous work would be helpful to establish trust and competency. Additionally, a list of the creative artists in their community would inspire the confidence of success.", "q1r": 4, "q2": "There is a detailed roadmap and budget breakdown.  However, the proposal needs clarification to align fully with the challenge. The KPI of a marketing campaign are highlighted, but the proposal does not give specific metrics.  For instance, the proposal says it will document number of posts, but does not say the actual number of posts it will create. ", "q2r": 3, "assessor": "z_assessor_56", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9898, "q0": "This proposal is about making a marketing action to get more community advisors from the Cardano community. While it is a good will initiative, I think that if too many “not so interested” cardano user become CA, it could weaken CA work and make VCA work more difficult. As a Cardano user myself, I know that I heard of /read about Catalyst very quickly on reddit/twitter channel. My personal experience is that project catalyst does not really need marketing within the cardano community. Another question than the one raised by this proposal is does it need marketing outside of the cardano ?  I recommend to extend the problem identification, as it then may requires a different solution, or a larger scale solution.\nI disagree that this proposal effectively addresses the CA Improvement challenge.\n", "q0r": 2, "q1": "The proposer is an experienced cardano user, claim to be a stake pool operato, but show no evidence of marketing skills.\nNaming the pool would have been useful: I would have liked to check for example for how long this activity exists and how many delegators it has. Indeed marketing is a big part of cardano stake pool operator, and his efficiency/marketing skills can therefore be measured. \nI recommend to the proposer to show evidence of marketing skills, by showing his activity as a stake pool operator.\nI neither agree nor disagree that this proposal is likely to be successfuly implemented.\n", "q1r": 3, "q2": "The time line of the marketing blitz is well detailed. Following posts/like/video views is a good way to monitor the progress of a marketing campaign. \nSuccess is not very well defined, and I lack details about what are the project commitments.\nI agree that the community will be able to monitor the progress of this proposal.\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10181, "q0": "I agree with the proposer on this idea. This is a good and necessary idea. It is true that Catalyst is very good, but the meaning of CA, vCA, and Voter in Catalyst is not widely known. Many ADA holders are unaware of Catalyst. I agree on marketing in a fun way to let more people know about Catalyst. I think if the project deploys successfully, the number of CAs will increase significantly. \nHowever, just as the proposal mentioned, the important point of this project is interesting advertising content. Content greatly determines the ability to attract the community. I think the proposed topic should think in advance about how to deal with the case when it is not possible to create interesting content as desired or not attract many viewers when implementing the campaign. The proponent has raised a risk but has not yet provided a solution to that risk. If possible, take advantage of the available resources of Catalyst to create spiritual gifts such as blockchain knowledge documents and give them to viewers.", "q0r": 4, "q1": "You come up with an implementation plan with 3 clear phases. However, I will appreciate it more if you can add specific advertising campaigns to perform, timelines, and KPIs for each ad campaign. Currently, there are no metrics/KPIs to assess the feasibility or expected effectiveness of a marketing campaign.\nIn terms of budget, you can list the items that need to be spent on each stage, but you should be more specific. For example, the budget for freelancers and virtual assistants is 2000 USD, you should specify how many artists you will invite to do the campaign, cost per artist for example...", "q1r": 3, "q2": "The roadmap is clear but lacks timelines, and KPIs to monitor and evaluate progress. Measure the progress and development of the project through indicators such as the number of posts, likes, comments, video views... However, there is no target KPI for each indicator for the community to evaluate. For example, in phase 1, a marketing campaign lasts 4 hours, KPI is to attract 10,000 likes, 500 comments, 20,000 video views, for example... You should write down specific expected numbers. for the community and Catalyst to evaluate the effectiveness of the marketing campaign that you make compared to reality.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A community advisors marketing blitz is nessicary to promote understanding of the roles responsibilities and highlight the incentives.", "experience": "I was a community advisor in F7 and also one for F8. I am a stake pool operator, CNFT artist and active community member. I am familiar with marketing for Cardano projects and would bring an artistic, entertaining, and fun marketing campaign to raise awareness."}