{"id": 400782, "author": "yutazzz", "title": "dRep's Code of Ethics+Bridges Asia", "url": "https://cardano.ideascale.com/a/dtd/400782-48088", "category": 26453, "amount": 3800, "description": "There is no discussion of the rules required for dRep. Japanese mass ADA holders cannot understand English-speaking dRep's talk", "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"id": 456, "q0": "This is tricky to assess. On reading the \"How does your proposal address the challenge\" section, it’s clear the proposer has accidentally referred to the challenge metrics for a completely different challenge - I think a fund 7 one. This is clearly an editing error. From reading the rest of the proposal I believe the proposer actually intended to submit the proposal into this challenge. So operating with the principle of charity in mind, the question for me is whether this proposal addresses the CA challenge or not; and, perhaps controversially, I feel that it does. It’s true that the challenge setting does not refer to d-Reps at all - but of course, it wouldn't, because at the time it was written, d-Reps had not even been suggested yet. Things move quickly in Catalyst, so on principle a challenge should not exclude proposals that respond to relevant new issues that emerge; in fact I think we should applaud a proposer for their responsiveness in doing so. The more complex question is whether something about d-Reps actually belongs in a challenge about the CA process. On the surface, it's not obvious that it does - but delving deeper, the d-Rep role will serve many of the same functions for voters as CA reviews do now (i.e. basically, helping voters to decide how to use their voting power); and the CA and VCA system will have to respond to d-Reps as part of the support system for voting, so it will be important to consider d-Reps in the context of the CA process. As this proposer puts it: “I think dRep is a kind of advisor, increase this number.”  Overall, I feel this proposal actually does address this challenge quite strongly. But as it would be unfair to completely  overlook the proposer’s error in that section of the submission form, I have to rate it 3.", "q0r": 3, "q1": "The proposal is clearly very feasible. The time-plan is good, and allows plenty of time for iteration, revisions and full community engagement; and the budget also gives fair costings for a proper iterative process that engages the community. The proposer clearly has the skills needed to deliver the proposal (although some links to his work would be a useful addition to the \"team members\" field, his Twitter account is referenced later in the proposal, and besides, he is well-known in the Catalyst community.) There is also an astute assessment of risk, and thoughtful mitigations, which demonstrates that the proposer fully understands the Catalyst ecosystem.", "q1r": 5, "q2": "The project is definitely auditable. The KPIs identified are clear and measurable; and there is a good mix of quantitative (numbers of  people giving feedback, numbers of people who delegate without thinking) and qualitative (whether people understand, how clear the rules are, etc). There is also a good focus on sharing the progress of the project with the community via social media, and engaging them with it.", "q2r": 5, "assessor": "z_assessor_1157", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 713, "q0": "The first issue face by this proposal is a conceptual one.  The suggestion here is that the as-yet-not-fully-defined role of dReps in the Catalyst ecosystem are a type of CA, and that doing translation/support for a Japanese dRep community would thus fit under this challenge setting.  Unfortunately, while I understand that dReps will have an aspect of \"informing voters\" to them (thereby having a CA-like quality), because they actually *vote* on proposals as their primary role, I can't agree here that this proposal should be in this challenge setting.  And while I might suggest that the proposer could have chosen Groe East Asia or Misc. for this proposal, the better suggestion would be to actually resubmit in a later fund after we know more about dReps, period.  While translation of what is known (which isn't much) is always a value, and I personally am supporting any projects working towards a more multi-lingual Catalyst, this proposal seems to be about 3 months before its time.  The benefits of this proposal are of course multi-lingual support, but also the ability to onboard a significant number of dReps which, in theory, should lead to a lot more staked ADA and ADA mobilized towards Cardano's self-governance.", "q0r": 3, "q1": "The proposer is well known in the Japanese Cardano community as a data-hound, and what they propose to do here is essentially a survey to draft a charter, so their seems to be alignment there.  Through iterating a draft document in their community, the hope to create an ethics statement, which I take to mean a guide that aligns prospective dReps in their community with the role as it is eventually proscribed by IOG and the Catalyst community.  The timeline, which is a bit difficult to parse, seems to be targeting 3 months to create this guiding document, and then to capture that participation in the form of nascent dReps participating in another questionnaire to establish their expectations going forward.  The budget is small, and basically covers the costs of drafting the document and running the survey, but then it has a weird line-item I couldn't figure out...  there is $10 per dRep assigned here (for a total of $1000 for 500 dReps...yes, the math doesn't add up).  Is the suggestion that the dReps are incentivized for their participation?  Or is this an administrative cost relating to surveying the dReps?  Another question this line item begs, is whether 500 dReps is realistic.  It sounds like a lot to be sourced from a single effort (I would be surprised if there are more than 500dReps total  in the entire first cohort, but, again, there is much we don't know about the parameters of the program).  For an onboarding program like this, I would have liked to have seen more about the logistics of convening the cohort, as well as details around how their participation would be facilitated, the education required to draft the document, whether it would have Japanese-->English (or any other language) support, or even be opensource, etc.", "q1r": 3, "q2": "To the degree that this proposal is worth undertaking, it seems like it might be difficult to track progress over the first two months, when the draft is being developed.  My suggestion would be to create a GitHub repository for the draft, and allow it to be modulated by the entire Catalyst community (which may have been the plan, but it isn't indicated clearly in the proposal), with any translations forked from the original.  The tracking of the iterative surveys in specific communities will be much easier to do, whether in an opensource repository or not (but even easier if it is), so less concern about tracking progress there.  The proposer has included a twitter account to follow any updates.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5802, "q0": "As a CA and vCA and also interested in becoming a DRep, based on the approach and goal of the proposal it is not clear that it is aligned with the Challenge objectives, therefore its impact towards the Challenge goals cannot be assessed. \nEven though the author states that the proposal indirectly impacts the number of CAs and vCAs, as it considers the DRep a sort of advisor, I think this angle is at least controversial.\nI would advise to present this proposal during F9, as the DRep role will be more clear and could be even in place, as I do consider the aim of it of outmost importance to the Catalyst and Cardano ecosystem, and specially with its aim to the Japanese community where many voters reside and with the clear intention to support the DReps roles and opportunity to mobilize all those votes thru this new way. If there's no Specific challenge that addresses this objective, I suggest that the proposal gets presented on the miscellaneous challenge that is properly fit to it.", "q0r": 3, "q1": "Yuta is a very well known and active member of the community and he really understands the Japanese community and culture, so he is totally the proper person to drive this forward, building on top of what he is already doing to bridge the language barrier with that key community of voters and influencers in Cardano.\nThe timeline proposed is very clear and feasible, and also the Plan B presented in case the DRep program gets delayed. With most key risks identified and action provided to mitigate them. Very clear Return on Intention stated.\nThe budget is well explained and assigned to specific activities, with rates that are very competitive  within the Catalyst ecosystem and it is reasonable for the type of activities of the proposal.\n", "q1r": 5, "q2": "Progress KPIs have been clearly stated in detail, aiming to reach a good number of DReps and Voters with a detailed timeline that allows any community member to follow and audit the project.\nSo both project tracking and proposal outcomes are provided with clear measures and times.\nAs a suggestion, producing an Ethics rules creation are not considering IOG, Circle or even the DReps feedback, I would add those inputs as well in order to complement what the community expresses, in order to produce a 360 discovery that can be accepted from all parties.", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9899, "q0": "The problem statement does not seem clear enough to me “There is no discussion of the rules required for dRep”. Drep are not CAs, and while I understand the problem statement, this proposal does not meet the challenge criteria which focuses on CA work.\nBased on my understanding I disagree that this proposal will improve the Community Advisor work, which is the purpose of this challenge.\n", "q0r": 1, "q1": "A detailed plan is given, and a budget breakdown. The proposer has experience in Cardano and claims to be a stake pool operator. Naming the stake pool would provide additional information about Proposer’s influence, looking at the number of delegators for example.\nI neither agree nor disagree that this proposal is likely to be successfully implemented.\n", "q1r": 3, "q2": "Project progress is to be made by regular announcement on a twitter channel. I recommend to the proposer to elaborate the auditability of this project, before submitting in a coming fund. It could be a commitment to regular townhall presentations for example.\nI disagree that the community will be able to monitor effectively the progress of this project.\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10183, "q0": "Proposal to help the Japanese community understand dRep better in Japanese. Thereby increasing the amount of dRep, increasing the number of Japanese CAs and vCAs, increasing the volume and quality of Voter. The proposal highlights the value of contributing to Catalyst in this Challenge.", "q0r": 4, "q1": "About the members, the person who does is the proposer. Since this is a project mainly to help Japanese people better understand dRep in Japanese, and the proposed subject is Japanese, has a lot of experience in Catalyst, and is a very active member, I think the project judgment is possible.\nIn terms of budget, expenses are clearly listed in detailed and reasonable items. The project seems to do more to support the development of dRep in Japan for financial gain.", "q1r": 4, "q2": "The specific route is clear, easy to understand, and easy to follow. The community can track progress and compare with KPIs, the proposed plan through reports, and actual activities of the proposed topic. The proposal also provides specific cases, contingency situations when risks occur, and preventive solutions are stated specifically.", "q2r": 4, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "I propose a draft of the rules required for dRep and introduce all dRep in Japanese.", "experience": "Catalyst proponent from FUND2, SPO, ambassador, community chat moderator"}