{"id": 403745, "author": "nadiahopkins", "title": "CA/VCA Treasury for Rapid Funding", "url": "https://cardano.ideascale.com/a/dtd/403745-48088", "category": 26453, "amount": 30000, "description": "The CA/VCA group has ongoing operational/improvement needs a treasury will sustainably address by enabling the rapid funding of solutions.", "f6_no_assessments": 10, "f6_rating": 4.033333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 740, "q0": "Community Advisors are well aware of how many issues are brought up and how often the energy and enthusiasm around solving them fizzles out.  Before long, the same issue is brought back up again and the cycle repeats.  While the CA community has organized several initiatives to structure this type of problem solving and solution seeking, including communications, education, productivity and governance working groups, what we don't have is a means to incentivize these initiatives, nor to reward bounties for work done in compiling CA/vCA data or visuals.  The role of the Treasury proposal is to secure a 6 month funding cycle, however it is not required to disburse the funds over that 6 months, it is just not allowed to ask for more until that funding cycle is over.  The inclusion of the Treasury Framework document is helpful, as it explains the objective terms and rules for the management of the treasury, which is key for the transparency of the experiment going forward.  In particular it describes all the roles and how they are governed, including the Treasurer who manages the funds, and the Claimants, who make claims against the fund.  It also describes all the processes that these roles may engage in within the scope of the Treasury governance.  Finally it includes a TIPs protocol, Treasury Improvement Proposals, which will allow it to evolve with the needs of the community.  This treasury should ensure an engaged and enthusiatic CA community drawn to positive growth for the ecosystem.  As an engaged CA, I give it the highest marks.\n", "q0r": 5, "q1": "The proposer is the Catalyst Circle Rep for the Community Advisors and as such she serves at the pleasure of the community.  And a pleasure it has been!  She has helped organize and provide the space for many new initiatives within the CA space regarding self-governance, and this proposal figures to enable more of the same.  Sustainability of any effort is critical to the maintenance of the processes and roles that emerge from a networked community like the CAs, and the proposal points out 6 major areas of effort and maintenace that are typical of engaged community members.  It is worth noting that these are the same categories outlined in the larger Catalyst governance scheme, as outlined in the IOG paper \"A Treasury System for Cryptocurrencies:\nEnabling Better Collaborative Intelligence\" and in fact, many of the governance protocols for the governing framework of the treasury have been mirrored from this seed document.  The explanations in the Treasury document are straightfoward, if a little plain, but that is good for a community oversight document like this.  The risks facing an experiment such as this will fall in the areas of credibility and trust.  I feel the first is mitigated by the proposer's current role in the community in that she answers directly to the community and is under the immediate oversight of IOG.  The second is mitigated, in my opinion by the solid foundation of the governance framework and its ability to evolve from community feedback.  \n", "q1r": 5, "q2": "The proposer here has included useful KPIs that measure both the disbursement of funds and the impact those funds are generating.  While it would be nice to already have the Qualitative Audit Standards being designed by the QA-DAO community (see their proposal in F8: Improve and Grow Auditability), we are left to ask ourselves how we measure the impact of a healthier Quality Assessment community in Catalyst.  In looking at what the proposer has suggested, I can distill these ideas even further:  we will see more Self-Organization (shared opportunity), more Promotion of Emergence (learning our way forward), Embracing Change (developing resilient communities) and more cultivating of Dynamic Tensions (finding synthesis and growth in disagreement).  With the governance protocol requiring audit reports with every Treasury action, and with strictly defined processes that are allowed, it should be easy for the proposal to meet reporting requirements to achieve full release of funds.  For anyone worried that the $25K would be at risk in the community, it is worth noting that the auditing protocol means this initial iteration of the Treasury protocol will have to use its auditing reports to release the full funding amount from Catalyst.  This means the community will always be in control.\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 115, "q0": "This is a seemingly obvious need to help build a stronger CA and VCA community, having a small amount of funding would enable creative solutions to onboard and direct new CAs and VCAs and I think this could have a huge impact on the QA stage of each funding round", "q0r": 5, "q1": "You have clearly thought a lot about all of the mechanisms required to implement this solution successfully. I am assuming the treasury will be operational for Fund 9, it would've been nice to have this clarity in the proposal, however that is no reason to mark you down. It is obvious that you and your team are more than competent enough to implement this proposal as you already have a lot of things in place", "q1r": 5, "q2": "Yes clear KPIs have been given and this will make it easy to track progress. The final goal of having a framework that could be implemented across other groups is great, and can pave the way for more treasury management tools for other parts of the ecosystem.", "q2r": 5, "assessor": "z_assessor_1053", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}, {"id": 458, "q0": "This aligns very well with the challenge setting. It presents an inventive approach to engaging CAs with solving their own issues, by seeking to resource this properly and avoiding undue reliance on volunteerism; and it responds to the need for flexibility and rapid responsiveness to issues as they arise (i.e. the \"constant challenges\" faced by CAs that are mentioned in the Challenge setting).", "q0r": 5, "q1": "I like the proposal's clear grasp of the main risks that could potentially damage feasibility (i.e. fast growth of Catalyst, and the treasury being overwhelmed; and the issue of transparency of results) and the effective mitigation of this (a well thought out governance protocol). The funding cycle of 6 months is good for feasibility - I don't think the project could be delivered in 3. The funding categories identified are comprehensive, which shows thoughtful planning; and the proposer and team clearly have the skills and contacts to be able to realise the project well. But there are some questions. On the funding categories - I would really like to see the \"marketing\" category include in its scope the sharing/promotion of this Treasury protocol itself, given that the proposal hopes to see it used and adapted by others within Catalyst. On budget - it is completely reasonable that the budget is flexible, and that it is not yet determined exactly what will be spent on each category; but to assess feasibility, I feel I'd like to see some kind of indicative estimate of the proportions that are expected to be allocated to each category, just to get a sense that the balance is reasonable. I also feel that the admin costs of $500 are too low - this equates to just $17 a month per Admin Team member, which seems low for all the work they will need to do, especially in the initial setup stage. I'd also like to see clarity on the creation of  the 5-person Admin team - who will select the members? And is this intended as a permanent role (assuming that this proposal is resubmitted in a future round, and the Treasury becomes an ongoing thing beyond its first 6 months)? These types of issues often generate debate in Catalyst, so if it's unclear, or hasn't been worked through with the CA community, this could slow down the project or make it less feasible. Also, on the issue of future funding rounds - I'd like to see some money specifically earmarked for the time needed to work on a continuation proposal for fund 10, since for true feasibility, this treasury needs to be sustainable; it can't be just a six-month-long \"one-off\". In many areas of Catalyst there are issues with resourcing the submission of ongoing funding proposals, so it feels important to resource this specifically, rather than just include it under (for example) the Treasury admin heading.  But overall, with those minor reservations, the proposal is clearly feasible.", "q1r": 4, "q2": "The proposal identifies good and effective audit metrics, which will be readily measurable and transparent; and I particularly like the inclusion of a metric on \"Number of other participants who adopt similar Treasury protocols\", as it will be interesting to know whether this approach to managing a Treasury is useful elsewhere in Catalyst. But I would like to see the inclusion of some more qualitative measures around the effectiveness of what the Treasury has funded. The metric \"Amount of specific recurring Community events\" begins to address this - but I feel it would be of value to record and audit more than just the number of events. Who did they reach; how many people attended; and crucially, what did they think? Some kind of simple qualitative assessment from attendees would be a really good addition here. Similarly in other areas: if the ultimate aim of the whole process, and the definition of success, is to improve the capacity to provide high-quality CA work, then it would be great to consider ways to audit whether or not this is happening. Of course, it's not easy to prove a direct causal link on things like this - but finding ways to audit impact and demonstrate value feels very important in a primarily project-based funding mechanism such as Catalyst, because it enables the community to see the point of a treasury, and to understand the need for some funding in the system that is not allocated to a project, but to a team. Having said that, though, this proposal is clearly very auditable; the above points are more general reflections, for the long-term and for all of us in Catalyst.", "q2r": 5, "assessor": "z_assessor_1157", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 932, "q0": "The problem statement of the proposal is poorly worded and already attempts explaining the solution. It is not demonstrated how rapid funding for CAs could be disbursed fairly, or why CAs should be paid apart for the remuneration for good and excellent assessments. No improvements of the assessment process and possible conflicts of interest or inefficiencies are made and no credible examples of rapid funding needs presented. ", "q0r": 2, "q1": "The proposer does not break down the budget of the proposal and does not address how funds are used or how much the proposer would receive (if anything) from the funding requested. The proposer is relatively new to Project Catalyst and as the circle representative of Community Advisors possibly abusing the position elected for by making this request for funds. No LinkedIn Profile is provided and the proposer does not seem to have relevant prior experience with governance or treasury.", "q1r": 1, "q2": "The auditability section of this proposal lists possible directions for metrics that \"can\" be included but does not elaborate which one should be used to assess what success for this proposal looks like. There are is no quantitative attempt at measuring or auditing the proposal's success and no reference to the timeline. The information given is at best incomplete to audit the progress made over the six-month period for the proposal mentioned in the previous section.", "q2r": 1, "assessor": "z_assessor_1243", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 1092, "q0": "The heart of this challenge is certainly addressed by this proposal, as a well-known problem with the Catalyst system as it stands is that there are numerous gaps in services required that are filled by volunteers. Establishing incentives for fulfilling services we all take for granted is a strong, and perhaps the only, way to really address these gaps. The proposers have laid out a plan that is fairly comprehensive. The only flaw I would note is that the proposal doesn't really detail which elements of this plan serve as maintenance of services that are functional (community management) and where this proposal would provide services that are basically new (the auditing report would appear to fall under this). But that doesn't detract from the proposal too deeply. But (speaking as an experienced communicator here...) providing detail, with examples, is good! Meanwhile, ambiguity needs justification.", "q0r": 4, "q1": "The experience is more or less exactly what you'd look for with this sort of proposal. The plan is well-organized and clearly achievable, with respect to its status as a new approach that has experimental elements. ", "q1r": 5, "q2": "This proposal provides a standard auditing report along with a governance procedure that describes the usage of this report in clear, unambiguous terms. This is much more than you see from your typical Catalyst proposal and it's a credit to the proposers that they provided this. ", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 1886, "q0": "This proposal outlines the need of the CA/vCA active community to have some funding, in the hands of the CA/vCA treasury administration group, to actively distribute on micro projects, member contributions or other work that needs to be done in between Catalyst Funds. The need for payment of these services is easy to spot, in the current situation this work has been done in a volunteer manner and this leads to burning out of the active members and this leads to loss off talent and experienced people from the CA ranks.\nThe problem is very well aligned with the challenge objectives, because it addresses the ongoing need for maintenance of the support structure for CA/vCA active community. Maintenance proposals are key metric for this challenge. \nTreasury for rapid funding of the needs of the CA/vCA community is an elegant way of solving the problem. In one hand it allocates a specific sum for the active CA/vCA members to deploy on whatever is urgently needed but on the other hand there is a transparency on where and for what the funds have been spent. This brings a way for the greater community to oversee if the funds are properly allocated. \nThe impact of this proposal will not be immediately seen, but it will bring a strong base for the CA/vCA to step on and therefore improve the performance of this cohort and as a consequence the performance of the whole Project Catalyst.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "It is clearly outlined what categories of needs will be funded by the treasury with a significant reasoning why are they important and should be funded. Honestly, the budget of the treasury looks quite insufficient for all these categories and all the work that needs to be done in the CA/vCA support structure. However this Challenge does not have a lot of funds to distribute and I suspect this is the reason the proposer limited the proposal with less funds for the first round. This could also be a positive thing, since this will be the pilot for the treasury and it will be wise to experiment with lower stakes.\nThe proposal has a roadmap which is mainly derived from the governance framework of the treasury as this is the main document that governs the function of the treasury. Link to the document is provided for everyone to see. The governance framework is a well written document that is still under construction. Clearly the document is a collaboration effort of a group of people which are active and recognizable community members. The document not being completed prior to the submission of the proposal is a little bit worrisome. However given the crazy speed with which the Project Catalyst is moving it is not at all unexpected.\nThe roadmap provides clear actionable points for the creation of the treasury structure and on the mechanism for fund release by the treasury.\nUnfortunately in the roadmap we don’t see any timeline to go parallel with the roadmap. \nThe budget breakdown is well described and very simple. All funds will be distributed in the 7 outlined categories when needed, except $500 that will be used to fund the treasury admin team 5 people $100 each for their service in the 6 months following the funding of the proposal.\nThe team is poorly presented. The leading figure is the CA Circle Representative but there is no CV or link to a place where we could learn more. The voter should know that the current CA Circle v3 Representative is Nadia Hopkins, she is a very, very visible person in the community and could be found on the telegram CA channel and the discord CA/vCA server. Here you could find a presentation for the nominations for Catalyst Circle where you could learn more about the experience Nadia has https://quality-assurance-dao.gitbook.io/catalyst-circle-oversight-v3/governance-day-ccv3-12th-feb-2022/nominations-for-ccv3\nThe proposal is created by multiple people from the active CA/vCA community and this could be a reason why there is no CVs and presentation of the tam.\nI have to remove a point for the lack of team member’s visibility and therefore I agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "\nThe proposer suggests that the auditability of the project could be measured against the work of the treasury, the dispersed funds from the treasury and number of other participants that adopt similar treasury structures. However none of these is substantiated with concrete numbers as benchmarks. This makes the auditing of this project very difficult and discretionary. The auditor should discretionarily decide if the progress of the project is sufficient or not, if an imaginary milestone is reached or not. \nTo avoid discretionary decision making from the auditor, it is very important that a proposal has clearly defined milestones with numbers attached to them. \nThe community needs to know what to expect from the proposer up front.\nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_1417", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2165, "q0": "This is a very interesting proposal. In a nutshell the team behind it are proposing … a sort of layer 2 funding mechanism that is able to quickly react to the CA / VCA community needs in-between funding rounds, more flexible than “traditional” Catalyst funding rounds. \n\nThere are indeed many instances when the right funding at the right time can be instrumental in catalyzing certain projects, and I think it is an experiment worth having. Would it also be scalable if successful? I’m not sure to be honest. If proven successful, could this turn into a common practice to have rapid funding available 24/7/365? Much more likely.    ", "q0r": 4, "q1": "The team behind the proposal includes CA Circle representatives and a few other CA members, 5 in total if I look at the campaign leaders. The proposal would have definitely benefited from describing in a paragraph or two each member’s past activity and involvement in the community, for the extra comfort and convenience of reading it there.  \n\nThe budget is not broken down, and that is the beauty of it. A very small part will go towards actually running the mechanism itself and for admin activities, while the majority will be disbursed to the community across a 6 months period and across multiple categories, in a flexible manner, based on the community needs.\n\nWhat criteria will be used to decide who gets funding? The proposal is accompanied by an Operations Treasury Governance Framework - a simple 4-page document, still live, that sets out the nitty gritty details on how funds will be used and the disbursements documented. Being a very new idea, I try to demonstrate leniency towards the proposers and can only hope that the document will evolve along with the activity once funded. ", "q1r": 4, "q2": "Transparency and auditability will be key for this project. I revert again to the Operations Treasury Governance Framework that also includes key aspects of how disbursements would be handled, processed and documented. \n\nWhat I would have love to see in addition is an effort that at the end of each rapid funding round, the fund administrators would go through a display of public transparency and issue some sort of report detailing where the money went, but a light-weight one that is easy to digest by anybody, so with a very high-level description of the activity. \n\nOf course, the project outlines a few progress measurements that might be used: number of audit reports (whose audit I might ask?), total ADA dispensed, average settled claims, unique community members receiving funding, etc. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2217, "q0": "Proposal is submitted by veteran CA community members who have identified a general problem within CA community. Proposals submitted by participants of v/CA process and directed to improvement of current v/CA system is a major goal of current campaign.\nIf successful, this solution would allow for a more flexible reward structure in an environment of ever increasing complexity, bringing rewards to daily contributors even outside the standard funding structure. ", "q0r": 5, "q1": "Successful implementation of this project depends more on predefined protocols than experience of its team. Since there are no real deliverables in this proposal and its success relies mainly on the ability to distribute funding to the contributors in a more flexible and fair manner, I would prefer to see a more detailed explanation on how the funds will be disbursed, who can be a claimant, how the quorum selection process would work, how conflict of interests will be avoided and  how arbitration will occur? As it currently stands, attached Governance framework only provides rudimentary carcass of the structure and relies heavily on the goodwill of participants. While this might work in the infancy of organization, it sets a weak groundwork for future self-governance of v/CA community. I would suggest exploring possibilities of \"forking\" Catalyst system on paper and applying same principles in v/CA treasury with more rapid iterations.\nAmount of requested funds also need further validation. A very detailed explanation of the need for 500$ is given, yet remaining 29500$ seem arbitrary. Projections loosely based on your experience so far would still bring a lot of clarity to necessary amount of funding.", "q1r": 3, "q2": "Auditability of this project is two fold. On the one hand, there are clear KPIs to follow and audit guidelines for each transaction that will be permanently stored on-chain, so its safe to say that the process of distributing funds and measuring their impact will be easy to audit. On the other hand, lack of clear instructions on the process of selecting decision-makers will prove hard to measure if suggested solution is can effectively distribute funds in a more flexible and fair manner than the current one. More details about the decision making process and its auditability should be provided.", "q2r": 3, "assessor": "z_assessor_1460", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5563, "q0": "I find this proposal goes against two of the core ideas behind CAs and vCAs that have been set up by IOG from the beginning, and that have very important meanings to the assessment procedure of proposals: anonymity and decentralisation of CAs.\nAnonymity is not important just for the hiding of your name in correlation to the assessments you write, but to your being a CA, your identity as a whole. The more you present yourself to the community in regards to your role, the more you start believing that your role is the most important, the more you make it about yourself. “We organize recurring community events to allow our community to put faces to people and to meet and connect with each other.”\nAs for decentralisation, I think that is a core tenet in the Cardano community that does not need a lot of explanation. But, in short, the more CAs contact each other, write resources together, the more of a group think starts developing. “Constant engagement is needed to establish, maintain and deepen connections within the Catalyst Network” or “Convening the People is a longstanding principle of strong communities”.\nHaving said these, I find that, while not ideal, the current model of proposal submission for each project/tool/event that the CAs want to implement is better than having a treasury that is being decided by a small group of people in the CA Catalyst community (in comparison to the entire voter group of the entire Cardano community) and would not lead to, as the challenge brief describes “to improve their performance”.", "q0r": 3, "q1": "The timeline for the entire project is presented as being for 6 months, with no other clearer delimitations described. The plan offers a lot of information in regards to what the proposers want to achieve with the project, and I have found no information lacking in regards to this.\nThe budget, however, is not very clear, and while I understand that most of the funds will be allocated to future endeavours, as it is a treasury, maybe some percentage allocation could have been distributed to each section for a better understanding and preparation of the entire project.\nThe team description could have offered more details, at least regarding to the “multiple long-standing CA community members” and especially to the composition of the “Five members of the CA community will become the CA Admin team supporting the governance of the treasury”.", "q1r": 3, "q2": "The progress measurement is very comprehensive and lacks no information. Regarding the success description, it is hard to assess how general or accurate it is, since the proposal itself is for a treasury that will fund future projects, that are yet to be developed. But perhaps the proposer could have added some clear milestones, that would have better helped the community in assessing the outcome.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6001, "q0": "I think that this proposal is definitely in line with the challenge setting. The proposers have raised the idea of a treasury that can be used to fund events/work that will benefit community advisors. As a community advisor, I completely agree with the proposers that there is a gap between funding and being able to conduct the work that needs to be done. Thus, a well-audited treasury is a great plan. This proposal will address the challenge setting by building a new resource that can power even more community-centered projects. By having this treasury, the proposers can disburse the funds so that they can be used as needed. There is a quickness to this proposal that I think has value for community advisors because, if funded, community advisors don’t have to wait for another catalyst round (about every 3-4 months) to get some funding for a CA/vCA improvement project. Thus, this treasury can influence the future of other projects that will work to help the CA/cCA community. (score given: 5)", "q0r": 5, "q1": "Given the information provided, I think that this proposal is highly achievable and likely to be successful. The proposing team is the elected Catalyst Circle Representative for community advisors, and a treasury admin group will be elected to control the funds. Given that the proposing team has so much experience with cardano, catalyst, and CA/vCA roles, I have high confidence in this proposal. Since they have so much experience with this system, they understand the importance of transparency and hard work, which will reflect in the quality of the product they propose. With regards to what the treasury will fund, I can clearly see the key areas that were set by the proposers. For example, community management and moderation, community events, and tools and services are all some of the key areas that will be funded by this treasury. This proposal’s funding cycle is 6 months, so these funds will work for the CA/vCA community for that period of time. There is a good breakdown of the budget. Majority of the funds will go towards the treasury itself, but a small fraction of the funds are set aside for the individuals working on the treasury admin team. I am unsure as to whether the proposers mentioned this anywhere in the proposal, but I can’t seem to find any potential breakdown of the treasury funds. Would the proposers consider delegating portions of the funds to be reserved for certain purposes. For example, setting aside a certain amount of money for community events or marketing/PR? I’m not sure if this would make the most sense, but it is something to consider to ensure that all different types of projects and jobs can be funded. (score given: 5)", "q1r": 5, "q2": "Based on what I have read, this proposal will be highly auditable. The proposers mentioned throughout the proposal that they will conduct a thorough audit report of each transaction disbursed from the treasury. This way, the cardano community can see into the workings of the treasury and make sure that the funds are going towards worthy causes. There were many good KPIs included in the proposal, such as the number of audit reports (a larger number indicating successful use of the treasury to benefit CA’s), amount of recurring community events, and average value of settled claims. These are all very important metrics to track and can provide more insight into how successful the proposal is. Overall, I think that the cardano community will not have any trouble keeping up with this proposal and making sure that it is meeting its goals. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Fund the CA/VCA community development & operations by establishing a clear purpose & budget for core contributors & services over 6 months.", "experience": "The proposing team is the elected Catalyst Circle Representative of the Community Advisor community. Upon funding, a Treasury Admin group responsible for carrying out the treasury governance framework will be formed from the CA community."}