{"id": 366983, "author": "", "title": "Community Roadmaps for Cardano 2025", "url": "https://cardano.ideascale.com/a/dtd/366983-48088", "category": 26120, "amount": 200000, "description": "How can we encourage development of community-inspired 2025 roadmaps for Cardano to enhance and expand IOG's own roadmap for 2025?", "f6_no_assessments": 1, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "While I feel this challenge could perhaps compliment the ongoing work aimed at achieving Cardano's mission, I do not believe that it is critical. \r\nThe community already plays a key role in the development and roll out of Cardano and has been invited to participate in myriad ways. Given that there is also a significant amount of work to be done just to get the ecosystem up and running with millions of users, I think the focus of challenges should be on the more nascent community requirements, such as onboarding and proposer outreach. \r\nI also fail to see in the challenge proposal how the roadmaps designed in conjunction with/against IOG's roadmap would be integrated into the larger roadmap. Is the expectation that IOG would also need to play a role in ensuring the funded challenge proposals are assessed and in fact align with their roadmap? What happens if there is a disagreement? \r\nGiven these issues and others, I think that this challenge would be better suited maybe after 2025 when the network has grown and more is known about how it needs to adapt. Great idea, just too early. ", "q0r": 3, "q1": "I 100% believe that the Catalyst community has the capacity to address this issue, however, I am giving it a 3/5 because there is not enough information on how it would be done, more details are below. \r\nIt would seem to me that what is being proposed in this challenge setting proposal could be addressed through other challenges within Catalyst. Why would there need to be a special category for roadmaps for IOG projects when that is the basis for Catalyst in itself? \r\nThere is also no consideration in the proposal of the acceptance of IOG to commit to using/permitting these roadmaps once developed. If a team gets funded but then this is in contravention to the wishes of IOG, how would that be resolved? Is the expectation that the community proposal (when funded) could supersede IOG? I think more information could be provided here. ", "q1r": 3, "q2": "I think the challenge proposer's success criteria should be more explicit. How would the roadmaps for 2025 that inspire new teams to build, deliver, expand, and implement projects be different than any other proposal submitted across any other challenge? One can argue that all of the Catalyst challenges have the ability to inspire new teams to build, deliver, expand, and implement projects that all contribute to the Cardano 2025 vision. \r\nI appreciate the effort that the challenge proposer put into the key metrics to measure and am sure that several of these could actually be used, however, there are several assumptions (such as IOG willingness to engage with changes to their roadmap) that are not factored in. This makes any value judgement on the metrics difficult as they may not be tangible/feasible within the IOG context. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "importance": "Developing alternative and complementary community visions of Cardano's future will help expand scope and impact of IOG's roadmap for 2025", "success": "The Cardano community creates novel roadmaps for 2025, inspiring new teams to build, deliver, expand and implement projects"}