{"id": 368902, "author": "", "title": "Grow Social & Environmental Finance", "url": "https://cardano.ideascale.com/a/dtd/368902-48088", "category": 26120, "amount": 250000, "description": "What solutions can we build on Cardano to finance social and environmental innovation?", "f6_no_assessments": 2, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing solutions that have a positive social and environmental impact aligns with the Cardano mission driving adoption of Cardano. There is no overlap with existing challenges although there are competing challenges in this round. Having the ability to accurately measure the social and environmental impact is key to determining if projects are having the intended impact. \r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The community has the technical capability and the challenge addresses issues that are important to a large portion of the community. The fund size is reasonable for the scope and compared to other proposals.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are mostly relevant to the success criteria and mostly measurable.  \r\nI  agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The definition of the challenge is broad as it includes social and environmental challenges. They are indeed related, but I may be difficult to identify DeFi solutions that properly address both. Proposers may be confused when looking if there proposal fits in this challenge or another.", "q0r": 3, "q1": "The proposer indicates he has not been able to gather a challenge team. There is a risk that the challenge cannot be properly stewarded as this is a quite time consuming work to accompany proposers, set up sessions in townhalls.", "q1r": 2, "q2": "Generic DeFi metrics are provided as a guide, and questions that will be asked about the proposals. The proposer does not identify the specific metrics for this challenge, and how they will be computed.\r\nI suggest the proposer to include in a future challenge proposal some details on the challenge team organization, what specific metrics will be followed, what sessions will be set up with proposers.\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 10, "ne": 2, "ng": 4, "nfo": 4, "vca_o": 1, "reply": "The CA is focusing a lot on a challenge team, as if this was a project proposal rather than a Challenge Setting proposal. The assesment seems to view a Challenge team as a requirement for challenge setting proposals, which it is not."}], "importance": "To address the climate emergency and the associated economic challenges, we need to build resilient financial solutions for driving change.", "success": "Impact investors, NGOs, and grassroots communities make Cardano the default choice to help transparently deliver the greatest impact."}