{"id": 368950, "author": "", "title": "Boosting Cardano's DeFi", "url": "https://cardano.ideascale.com/a/dtd/368950-48088", "category": 26120, "amount": 500000, "description": "How can we encourage DeFi teams to build/deploy open finance solutions on Cardano in the next 6 months?", "f6_no_assessments": 1, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "A range of DeFi solutions aligns with the Cardano mission driving adoption of Cardano. This challenge is the successor to the Scale-UP Cardano's DeFi Ecosystem so there is no overlap with an existing challenge other than the challenge specific to Africa. DeFi is a critical feature for many Cardano users.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The technical capability has already been shown in previous funding rounds. As for the community willingness to fund, the proposer makes the strong case, \"When looking at the DeFi-related proposals that have been approved but not funded, we can see that there are 5 (1 funded by left-over funds , 3 in the Dapps & Integration challenge, and the last in the \"Scale Up Cardano's DeFi Ecosystem\" challenge). These 5 proposals added together requested around $260,000USD.\"\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and measurable.  \r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "It's important because Defi dApps provide trustless on-demand access to financial services for global users", "success": "A competitive environment for DeFi on Cardano with an emphasis on cross-collaboration & driving composability across protocols."}