{"id": 369276, "author": "", "title": "Grow Cardano Act Sustainably", "url": "https://cardano.ideascale.com/a/dtd/369276-48088", "category": 26120, "amount": 500000, "description": "How will you drive high impact collaborating in the Cardano + global community to create a more equitable world of shared prosperity?", "f6_no_assessments": 3, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "Forming partnerships with the global community of sustainability stakeholders aligns with the Cardano mission of growing the global Cardano community and facilitating partnerships. The scope of the challenge does not overlap with any of the existing challenge funds although there are competing new environmental challenges in this fund. Cardano has many attributes that make it a more green and sustainable blockchain ecosystem than leading competitors so its a natural partnership. It also has the potential to bring in a lot of new users to the community.\r\nI strongly agree that this challenge is critical to achieve Cardano's mission.\r\n\r\n", "q0r": 5, "q1": "The community certainly has the means to address the challenge. From a budget perspective the request is moderate. Based upon the funding amount the expectation should be that the challenge brings in approximately 100,000 new Cardano users within 12 months of funding projects which seems achievable.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are mostly relevant to the success criteria and are measurable.  Number of proposals and projects should not be key metrics. Number of research papers published seems an oddly specific measurement considering the nature of the challenge.\r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I strongly agree with this proposal because I too find that often projects dont have a consideration for sustainability goals, nor do they have any bearing on improving sustainability. Living in a country which is currently facing economic collapse, exchange rate collapse, and food collapse all at the same time I am well aware of the unfairness of the world. While First world nations cry out for everyone to save the planet , their citizens live their lives with full house airconditioning, fast fashion which consumes and disposes of clothing every 3 months as fashion lines change, drive gas guzzling cars, build nuclear power plants which are a hazard to the environment in terms of disposing of nuclear waste, third world nations have to suffer environmental pollution and other disasters.", "q0r": 5, "q1": "This project would address the problem identified and allow such projects to be considered for funding rather than delay till a time when a suitable challenge was put forward and approved. A reasonable budget has been stated\r\n", "q1r": 5, "q2": "\r\nThe auditability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This challenge about projects focusing on equitable and sustainable development looks promising. This purpose is more needed than ever, as clearly stated by the challenge team (and also by the last 6th IPCC report about human activity impact on climate change). As this topic is more and more a global concern, I'm very confident that it will very much engage voters and bring many proposals serving Cardano's mission.", "q0r": 5, "q1": "The challenge team mentions the blockchain energy consumption challenge, in which we know that Cardano as an important role to play versus Bicoin PoW blockchain. Apart from this statement, proposers are not very much guided by the challenge description. \r\nBased on the current broad description, there could be a high number of low-quality project proposals, not sufficiently concrete or applicable in real life. The challenge team might consider adding directions or guiding questions to the challenge description.\r\n", "q1r": 3, "q2": "The key metrics listed by the challenge team are comprehensive, though some of them may be difficult to measure accurately. I suggest the challenge team to narrow the list of metrics and focus on the most measurable among them.", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "The rationale for giving a '3' for feasability and auditability appears to reflect a lack of understanding of the challenge setting brief, and an absence of a throrough review of the entire proposal and its attached resources. Furthermore, saying that 'proposals are not very much guided by the challenge description' and that low quality proposals will be submitted as a result - there are plenty of resources attached to the proposal that perhaps this CA did not review when assessing. In addition, voters will not vote for so called low quality proposals and an excellent challenge does not prevent low quality proposals submitted into the category. As for audtiability - saying that 'some of them may be difficult to measure' is vague and unclear. All in all a '3' for feasability and auditability appears to be unjustified."}], "importance": "No country is on track to fulfill all 17 SDGs by 2030.The climate clock is ticking.Simple and innovative solutions are urgently needed now.", "success": "Enhanced focus on Sustainability impact progress, bridging global multi-stakeholder projects + collaboration within the Cardano ecosystem."}