{"id": 369366, "author": "", "title": "Mini/Low-Budget Dapps &Integrations", "url": "https://cardano.ideascale.com/a/dtd/369366-48088", "category": 26120, "amount": 200000, "description": "What Low Budget / Mini Decentralized Applications will provide the most value for end users in the next 3 months?", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Building quick low budget Dapps and integrations aligns with the Cardano mission driving adoption of Cardano. There are other Dapps challenges so there is overlap however the challenge makes a good case for focusing on quickly deployed Dapps to drive Cardano adoption quicker as the Dapps that take longer to build will not begin attracting new users for a while.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "Dapps and integrations has the largest number of proposals in Fund 6 so there is plenty of room to grow and split this category of challenges into more focused challenges. There is a very informative budget negotiation in the comments section between Dapps related challenges which is very good. \r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and are measurable.\r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I agree with this proposal because  many Dapps which are smaller in size and low budget, get approved but never funded as larger projects always eat up the allocated funds. These smaller Dapps are often done by smaller companies, startups or solopreneurs who are often the real geniuses behind disruptive technologies and products as they are not constrained by corporate rules and restraints.  Often such small Dapps become the black swans , changing everything in the world.", "q0r": 5, "q1": "The budget for this project is reasonable .", "q1r": 5, "q2": "The Verifiability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\nMetrics include how many new, viable applications built on top of Cardano which cost less than 10k USD to build?\r\nHow many users does each Dapp have within 3 months of deployment and 6 months and 12 months\r\nHow many transactions done on each Dapp  within 3 months of deployment and 6 months and 12 months\r\n\r\n   ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "For Cardano adoption to grow, it will be necessary to have some \"quick wins\", so it's important that smaller projects that can be brought to fruition in the short-term are encouraged.  The problem of larger projects consuming the budget to the exclusion of smaller ones that can provide value sooner is a serious one, so it's a welcome effort to address this issue.", "q0r": 5, "q1": " The community has the capacity to address the challenge and the proposers are well known, active and influential members of the community, which will be helpful in attracting support and participation.", "q1r": 5, "q2": " The proposal establishes concrete and meaningful measures for success, most of which can be evaluated objectively, so I think progress in addressing the challenge can readily be assessed.", "q2r": 5, "assessor": "z_assessor_499", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Nice idea and the proposer might have identified a problem with the allocation of funds, but I have looked through the latest funds' (3,4,5) approval and funding for dApps and integrations. There were some projects which got approved but not funded which would have fit within the $10k limit of this proposal.\r\nIt is not clear that these projects would have been more impactful than the bigger ones which were not funded (i.e. comparing the total funds set aside for dApps and integrations, both big and small, with this proposal which would dedicate some funds to small projects).\r\nAs a Solution Architect I can often see small enablers which make a huge difference to the solution landscape, so the idea is not bad, but at this stage of Cardano's development, the proposer has not made the case clear why small projects should have a dedicated budget.\r\n ", "q0r": 3, "q1": "There is a lot a talented developer with a good idea can do for $10k which would promote the usability of ADA and the spread of Cardano, and keeping projects small will save overhead costs, so I agree that this might be a good approach. Having led both small and big initiatives I know that sometimes having one or two dedicated persons can achieve more than a whole team.\r\nHowever, there are not that many projects proposed and approved with a budget =< $10k. This might change, and might be many more projects proposed if there are dedicated funds, but will they keep the same quality as the bigger projects, if they \"play in their own league\" so to  speak? The proposer does not reason around this point of sub-optimization, which is a risk.", "q1r": 4, "q2": "While the assessment criteria in the proposal reflects the same criteria used for the regular dApps and integrations campaign, this challenge campaign would effectively take funds from the regular dApps and integrations campaign and use them for these small projects. \r\n\r\nThe proposer has made the assumption that the smaller projects are not funded because the bigger projects use all the available funds. That would be a sub-optimization of the Cardano treasury.\r\n If that is the case the projects funded through this challenge should get a lot more use per treasury ada spent.\r\n\r\nThus the evaluation criteria should be something like:\r\nRegular dApps and integration campaign:\r\nTr=transactions/treasury ada spent\r\nVr=volume ada/treasury ada spent\r\n\r\nLow-budget dApps and integrations:\r\nTl=transactions/treasury ada spent\r\nVl=volume ada/treasury ada spent\r\n\r\nWhere Tl>Tr and Vl>Vr after three months or so.", "q2r": 2, "assessor": "z_assessor_533", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}], "importance": "In recent funds many small Dapps haven't been funded (but approved), as proposals with high budgets requests exhausted funds.", "success": "At least 20 novel and viable small decentralized applications get built of top of Cardano in a short time horizon, attracting new users."}