{"id": 369468, "author": "", "title": "Grow with Catalyst", "url": "https://cardano.ideascale.com/a/dtd/369468-48088", "category": 26120, "amount": 1000000, "description": "What will make a person set-up a wallet and buy ADA?\n\nHow do you plan to maximize the potential of your business and attract new people ?", "f6_no_assessments": 1, "f6_rating": 2.0, "videos": ["https://vimeo.com/624780655", "https://www.youtube.com/watch?v=AftfAbJMxQE&start=17428"], "media": [], "f6_assessments": [{"q0": "Proposers are invited to come up with creative ideas to increase ADA adoption in real life, through a product refund process funded by the challenge, enabling a discount for ADA payers. Funding products to help grow a specific business might help growing ADA adoption short term, but thinking long term it is not the most powerful use of Catalysts Funds. ", "q0r": 2, "q1": "The project would be partially funded to ensure that the proposer a a self-accountability for the project. This approach is about of directly funding a product / service has some drawbacks. For how long would incentive be maintained ? what are the risks of this approach ? The challenge team should elaborate what are the beneficials and risks of this approach on the product lifecycle.", "q1r": 2, "q2": "No specific metric is provided to assess long term effects of this approach. Without that, this challenge is only about attracting people by price discount. The challenge team might consider adding kpi / metrics to measure how ADA's adoption is increased on a long term basis through temporary ADA payers incentives. For example, by measuring what happens for the ADA payment ration when ADA payers discount stops.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1, "reply": "The CA described the project as \" product refund process funded by the challenge\" and later \"his approach is about of directly funding a product / service has some drawbacks\". Clearly, the CA did not understand the basics of the challenge : help start-ups by funding their inital set-up and expenditure at 75% of total cost with the binding that they have to allocate a discount for any sales paid in ADA by customers. CA also asks how long the icnentive will be kept, when in fact this is a one time payment at start to be repaid slowly to catalyst. If one cannot understand the proposal, he/she should not assess it and if he/she does, it should be filtered out. In Audtiability the CA states: \"No specific metric is provided to assess long term effects of this approach.\" . This makes me think that he did not read the proposal or skimmed through it. Extract from the proposal:                                                                                                                 \n Key Metrics to measure\n-Proposals put forward by community members who had never posted a proposal before (community engagement)\n-Tracking winning proposals from new challenge and seeinf they are profitable and slowly refunding the grant rewarded\n-Competitor (competitors of actual businesses set-up throigh the challenge) adoption of crypto payment system (when theg see that winning proposals adopt crypto - given also the reduced transaction fees)\n-New community members/entrepreneurs who join Catalyst specifically due to this new challenge"}], "importance": "\\-Inclusion of various inactive members on Catalyst\n\n\\-Huge potential to attract new people to Cardano\n\n\\-A self-sustained challenge\n\n\\-#RealFi", "success": "\\-Engagment of current members\n\n\\-Attracting new people to Cardano\n\n\\-Setting-up of profitable businesses which reach their goals"}