{"id": 370119, "author": "", "title": "Funding for Traditional Businesses", "url": "https://cardano.ideascale.com/a/dtd/370119-48088", "category": 26120, "amount": 5000000, "description": "Are you a non-crypto/blockchain business wanting to apply for funding in cryptocurrency? Would you like to put forward a proposal now?", "f6_no_assessments": 4, "f6_rating": 2.583333333333333, "videos": ["https://youtu.be/O5rMDyCXZsc"], "media": [], "f6_assessments": [{"q0": "Sorry but after reading all your Fund6 proposals this sounds like you are hoping to pave the way for your own Fund7 proposals. Please prove me wrong. Actions speak louder than words.", "q0r": 1, "q1": "Yes, Catalyst Community could welcome \"traditional businesses\" to submit their plans to Project Catalyst and evaluate them. The question is, however: can Catalyst afford funding startups / businesses whose funding rounds are usually counted in millions?", "q1r": 2, "q2": "Some of the questions provided above are really good and those could be used. ", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Attracting traditional businesses  is key to meeting growing the global Cardano community however this challenge overlaps with the existing Proposer Outreach challenge both of which attempt to bring businesses outside the Cardano ecosystem into the challenge proposal system. There is no advantage to having 2 similar challenge funds.\r\nI neither agree nor disagree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 3, "q1": "This challenge requests $5 million of the total $5.4 million challenge fund.\r\nI strongly disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 1, "q2": "The success criteria are relevant to the challenge objectives. The key metrics are relevant to the success criteria. \r\nI agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The challenge is clearly stated and can help to grow cardano in many ways. From bringing new business ideas to the community to helping fund those that are already existent. This is going to pioneer Cardano a path to the next level! Proposers are already thinking of ways to bring the Environmental side to the blockchain. With this together we can fund almost anything! This critical to bringing Cardano to the business world and exploiting its great uses. ", "q0r": 4, "q1": "With the extreme growth  go the Catalyst community this challenge is well within reach of success. More and more proposals are being implemented so there will be a need for this project to ensure business are using the protocol to its full potential!", "q1r": 4, "q2": "Metrics are set with specific criteria that will need to be followed for business to use this project. It is clearly stated within this proposal. Guidlines are written to help the user brainstorm and write their proposal. This will ensure accuracy,relativity and keep unwanted proposals from entering the project. ", "q2r": 4, "assessor": "z_assessor_400", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "General funding of businesses is not the idea of Cardanos mission, which goes far beyond venture capital. The proposed height off the budget is far too high and takes away funds from other important challenges.", "q0r": 1, "q1": "The challenge would not be really adressed to the catalyst community, but rather to businesses.", "q1r": 1, "q2": "The metrics and success criteria are there, but they are so wide that practically (almost) every proposal would be eligible to funding there.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Dear vCA,\nOnly a personal opinion given: The assessor has decided they know the capabilities of the proposer based on a quick scan of social media and a misunderstanding about the status of the company, they have made a blanket judgement of all ten proposals based on incorrect judgements. There is no debt because the company has never traded, all assessments are copied and pasted on each of my proposals showing a general bias against all of my proposals.\nUnconstructive assessment: The UK Companies are all in good order, this assessor does not understand UK company law, the companies have not been dissolved even once, Notices were served to dissolve the company one time, when I thought about discontinuing the project but I decided to continue and filed the necessary document to continue the company. This does not indicate a lack of ability to complete the proposal.\nRegards,\nCarl Henry\n"}], "importance": "Cardano is a 3rd generation Blockchain developed over 7 years and aiming to be the leading cryptocurrency funder of traditional businesses.", "success": "Traditional businesses looking for crypto funding to incorporate cryptocurrencies & blockchain technologies into their business."}