{"id": 370159, "author": "", "title": "Improve and Grow Auditability", "url": "https://cardano.ideascale.com/a/dtd/370159-48088", "category": 26120, "amount": 100000, "description": "How to make the auditing process of funded proposals efficient, distributed and transparent?", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Making the auditing process of funded proposals efficient, distributed and transparent is key to meeting the Cardano mission of ensuring stakeholder accountability.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "Improve and Grow Auditability is new to Fund 6. There are only 11 proposals being assessed for $100K in funds which is very small. Despite the need there does not seem to much desire to solve the issue. Probably because it is not as exciting as other project ideas.\r\nI neither agree nor disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 3, "q2": "The success criteria are relevant to the challenge objectives however they could be improved. A common dashboard that any user could see the audit results of any funded project would be the ideal solution instead of searching in various locations. \r\nThe key metric of number of funded proposals audited is relevant but simple as is the number of reports. The more relevant metric would be the percentage of budgets and success metrics audited or  the percentage of non-compliance findings.\r\nI agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1, "reply": "Proposal should not be penalised because it has a small budgeted amount. This does not effect feasability. In fact, lower budget proposals should be more feasible for challenge setting. This can be increase in the future rather than ditching whole challenge."}, {"q0": "An efficient, transparent and distributed auditing process is key. With monitoring and evaluation reports and metrics of funded projects.", "q0r": 5, "q1": "Podcasts, websites, social media engagement metrics, development metrics will augment the monitoring and evaluation process by the catalyst community and improve capacity to address the challenge.", "q1r": 5, "q2": "The checks and balances proposed are sound. No justification is provided for the budget but this can be developed. ", "q2r": 4, "assessor": "z_assessor_348", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "I agree with this proposal being important   because   the funded proposals need to be properly evaluated to see if they are delivering what was established in their mission. This will raise confidence in the stakeholders of the proposal, the overall community, as well as new proposers who see the effectivness of what has been approved and funded before this. Once good auditing practices are established overall confidence level increases, uptake by users grows, number of proposals will increase, and the overall thinking that goes into them would increase because they know that they would be properly audited and held accountable through the funding process as well as once implementation has taken place.", "q0r": 5, "q1": "\r\n\r\nThe budget for this project is too low.  At least 1,000,000 should be allocated.", "q1r": 5, "q2": "\r\nThe Verifiability of this is clear. Metrics would include\r\nNumber of funded proposals audited\r\nNumber of new audited practices suggested\r\nNumber of new auditing tools created\r\nTraining in audit and quality standards maintainance", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "YES! We need to make sure the proposals we are funding are following through with their commitments and bringing value to Cardano. We must collect data and review proposals to make sure we are governing effectively and making the best use of treasury funds.", "q0r": 5, "q1": "Community advisors along with other cardano ecosystem members have the ability to set up a body or reporting structure that is transparent and addresses the issue it is seeking to solve.", "q1r": 5, "q2": "Th criteria suggested such as performance, financials, and smart contract audits are just a few metrics presented that are key to being able to properly audit projects and if we are able to bring transparency from those funded proposals.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "importance": "It's important that the funded proposals are evaluated to see if they are delivering what was established in their mission..", "success": "Several projects evaluating funded proposals, providing reports, articles and metrics on the development and implementation of the projects."}