{"id": 381582, "author": "abehazbunjr", "title": "Dropnir: Pool-Powered CNFT Markets", "url": "https://cardano.ideascale.com/a/dtd/381582-48088", "category": 26245, "amount": 35380, "description": "Los operadores de piscinas en juego no disponen de suficientes palancas para diferenciarse, captar al público y captar nuevos usuarios.", "funded": 1, "upvotes": 52062860, "downvotes": 12685203, "votes_result": 39377657, "votes_cast": 139, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a creative and useful proposal that would help both SPOs and the Cardano NFT Art market. The challenge brief of improving business opportunities for SPOs is met.", "q0r": 4, "q1": "I am not sure if self-taught programming and currently being in the Plutus Pioneer program will be sufficient to make this proposal a success. In my opinion, not enough budget is reserved for software development.", "q1r": 3, "q2": "The cost breakdown looks a bit funny with the energy drink addiction joke thrown in, but the reader gets a detailed overview of performance metrics, risk factors and milestones. The gantt timeline chart is impressive. In terms of auditability detail, this is as good as it gets.", "q2r": 5, "assessor": "z_assessor_696", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal accurately identifies a area within the challenge of lack of SP differentiation by providing unique outlook on merging NFTs and Stake Pools. There are many NFT projects that are already running their own stake pool but this proposal takes a unique approach it clearly highlights how it will bring value to the ecosystem.", "q0r": 4, "q1": "The 'Team' is an active member of the community and holds the requisite experience. This is an ambitious and experimental undertaking however the proposer has assessed potential risks in a clear and concise way. The funds requested are reasonable and concisely broken down.", "q1r": 4, "q2": "The experimental nature of this project makes it difficult to determine Audibility however a roadmap is provided with deliverables that can be measured against.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Dropnir absolutely addresses the challenge in providing support for new SPO business, as well as their own model for a new SPO business with the art-based concept.\r\nI could see myself using this platform, using a personal perspective to process the proposal. Wife is a wildlife photographer, and I work in the Cardano space. This platform could help new ideas as such.", "q0r": 5, "q1": "Seamoss is an active community member, a plutus pioneer, and also shared experience in e-commerce. Furthermore, there is a full team complimentary to one another in some serious credentials. These are clearly the right credentials to be taking on such a project.\r\nAs for the plan, I am not able to find a clearly defined timeline based on goals and milestones. With that being said and by reading through the entire proposal, you can determine that the main goal of phase 1 is to launch the platform Dropnir and onboard Artist SPOs and delegators. I think the most exciting phase will actually be Phase 2 when the idea of a \"pool-kickstarter\" will be introduced.\r\nThe budget has been thoroughly though out as well as it is apparent that the proposer took feedback into consideration and tuned the budget multiple times.", "q1r": 4, "q2": "While there is not a direct list of key indicators individually defined, it is clear what they should be.\r\n1) Launch of Dropnir\r\n2) Adoption of Dropnir by SPOs.\r\n3) usage statistics by Artists, SPOs and delegators.\r\n4) The start of phase 2 and the pool kickstarter platform as well as the routine metrics of adoption and usage.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Los proyectos de SPO y NFT pueden crecer mezclándolos como \"Art Pools\". El arte en sí mismo es el benefactor del pool, incentivando la tenencia sobre el volteo.", "experience": "Un estudiante de Plutus con 14 años en el comercio electrónico competitivo, a menudo lideraba el desarrollo de estrategias, la automatización y la ejecución para las marcas."}