{"id": 383557, "author": "adarocket", "title": "Monitoring solution for a node", "url": "https://cardano.ideascale.com/a/dtd/383557-48088", "category": 26245, "amount": 23000, "description": "La mayoría de los SPO utilizan gLiveView para seguir el estado de los nodos (requiere acceso a la línea cmd) o prometheus/graphana, donde faltan datos esenciales", "funded": 1, "upvotes": 41567093, "downvotes": 19282748, "votes_result": 22284345, "votes_cast": 136, "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is an important proposal where it is trying to mitigate the problems faced by the existing SPO's to view node data with existing solutions. However, the proposal should have mentioned some points about which data points are missing in gLiveView and how they are important to SPO's. A friendly app proposed would be very handy for the operators to monitor the pool.", "q0r": 4, "q1": "Proposer states there are four developers and has good experience, but I don't find any proof in the proposals, would be good to have more info about the people or team engaging in implementing it. The Github link provided doesn't have much info(at the time of writing this) about the developers, about their work. Technical details provided looks good and as the proposer has mentioned they themselves are pool operator that would be giving some confidence with the capability to deliver this.", "q1r": 3, "q2": "It is mentioned in the proposal that the solution will be forever open source, so that would be easy to track the progress of the implementation. The timeline for the delivery of the proposal is given and looks fair and achievable, the metrics provided in the proposal can be measured by the community.", "q2r": 5, "assessor": "z_assessor_208", "no_vca": 18, "ne": 3, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The solution match with the challenge. It will clearly help SPO  to improve efficiency of the nodes but you have to specify the difference and optimization between your solution and the currents solutions. You have a few lines about the advantage of your tool but I think you should show it in a table to compare it with the other solutions", "q0r": 4, "q1": "The technical development of the solutions seems well describe with the step by step development of the tool, the soft used to develop the tool\r\nI think that you could describe more the experience of the 4 people from your team in order to know you more about you. You don't speak also about how your Dapp (or web app or both?) will work? Do users need to register? Who will you secure it? How do you plan to install on the node and server that will use your solution? Will you do a FAQ to explain how people can use your solution?\r\nHowever you should also had more information about how you will market your solution (advertisement, video etc…) and how you will earn sufficient revenue to operate your solution on the long term\r\n", "q1r": 4, "q2": "This item need to be more developed because you don't really explain witch KPI will permit to follow the good use and operation of your project. For instance you could follow the number of users, the number of alert etc…", "q2r": 3, "assessor": "z_assessor_602", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "Currently there is no way to track node status without the use of a cmd line tool. The porposer suggests developing an app that can be used to monitor the node from a web app or mobile device. This will be a useful tool for SPO's. Although this is a tool for SPO's I dont think this proposal is aligned with the new business models challenge. I would suggest it is better suited in  the Dapps and integrations challenge.", "q0r": 3, "q1": "The proposer is an SPO and is already testing the app the repository can be found on their github link.  The team is made up of 4 experienced developers, from checking their github it looks like they are underway but it would be good to have links to their other development experience . There is a loose plan to finish the development and have published on the google and apple stores within 3 to 6 months. The budget is not broken down into expected work hrs. For a budget of this size I would expect them to go into more detail.", "q1r": 2, "q2": "The community can audit this by following their progress on their github page. Once its developed they hope to have hundreds of SPO's using the tool. A possible delivery date for  an alpha version is sometime in March.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal suggests creation of a new monitoring service to help stake pool operators track they key parameters of their running node. The benefit of this is for the node operator to be able to increase their awareness of potential issues, get remote access to status updates without accessing their local machine and to add custom alerts that may be relevant. The easier that it becomes for people to run their own stake pool the more decentralized the ecosystem can become with higher confidence levels of good node operation. If executed well this proposal could have a high impact for node operators.\r\n\r\nA useful service for SPOs also can turn into a re-occurring business model which aligns well with the challenge brief of creating new opportunities in the space that are economically viable. ", "q0r": 5, "q1": "The proposal team have provided a GitHub repository that showcases the work they have started on the proposal already. No team professional information is given nor and supporting evidence for any claims made. This lack of team information makes it harder to gage on the feasibility of the proposal. The proposal has no budget break down and where the funds are being used, the budget is low however this information would be needed to push the feasibility score up.", "q1r": 3, "q2": "A rough timeline has been added and the clarity of the proposal is easy to follow for understanding what they intend to deliver. No success objectives or KPIs have been added. It would be good to see this information along with any other relevant analytics - what current tools exist and what is their usage? What usage looks likely for your own proposed solution?", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Estamos desarrollando una solución cliente/servidor para hacer un seguimiento de los parámetros clave del nodo/servidor y enviar notificaciones a una aplicación especial de operador de nodo", "experience": "4 personas con fuerte experiencia en desarrollo de software para back/mobile (de 6 a 15 años) e infraestructura, también gestionamos nuestro propio nodo"}