{"id": 384528, "author": "danbonfil", "title": "Cardano DID Community SPO", "url": "https://cardano.ideascale.com/a/dtd/384528-48088", "category": 26245, "amount": 9500, "description": "Las tecnologías SSI/DDI empezarán a ser más relevantes en Cardano, pero no hay un pool de apuestas orientado a este segmento", "funded": 1, "upvotes": 51509812, "downvotes": 4857058, "votes_result": 46652754, "votes_cast": 146, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "El proponente se encuentra en un campo relacionado con la academia en el momento de escribir este artículo. El proyecto solicitó 9500 dólares para crear un SPO auto-operativo, y el propósito inicial es crear algunos ingresos para apoyar su investigación y promover el ecosistema de Cardano. Es una solución práctica para aquellos que necesitan un ingreso estable; sin embargo, el inconveniente del enfoque serían los delegados. Tienes un nuevo bloque que necesita un cierto número de usuarios delegados y ciertas transacciones de entrada y salida cada cinco días o una época. La dirección propuesta ayudaría a los investigadores y al personal académico que deseen dirigir su propio SPO a crear un flujo de ingresos regular y tener más tiempo para promover el ecosistema de Cardano y la blockchain.", "q0r": 5, "q1": "El proponente debe aclarar cómo va a utilizar 5.000 dólares para marketing y publicidad, ya que esto es casi más de la mitad del fondo solicitado. Por lo tanto, creo que debe proporcionar un detalle preciso de cómo hacer que este 50% del fondo, con la información para trabajar con los socios. No hay mucha información sobre cómo va a trabajar con sus socios y cómo el socio va a compartir o recibir el pago o incluso pagar por usted en su plan de trabajo del proyecto en la pista.", "q1r": 3, "q2": "Extraído de la propuesta \"¿Qué aspecto tiene el éxito? Si se nos financia, trabajaremos con nuestros socios para crear un enfoque accesible y estandarizado para que cualquier comunidad pueda utilizar las tecnologías SSI/DID\" y \"Aumentar la concienciación sobre los beneficios\". La intención es clara. Sin embargo, la estructura de desglose del trabajo (EDT) debería ser más precisa para que el equipo de desafío del Fondo 7 pueda seguir fácilmente su camino e informar al Project Catalyst, junto con el detalle de cómo la comunidad verá su trabajo en progreso.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\nYou are right, a further explanation of partnership collaboration and a work breakdown structure will help support the proposal.\nI will work my best to include this points for the better understanding of CAs and voters.\n\nBest,\nDaniel Bonfil"}, {"q0": "This proposal is a great and complex implementation that could improve adoption and usability on cardano blockchain for SPOs and delegators, because SPO business model revenue is a huge pain on Cardano blockchain. The proposal allow to maximize the decentralization and the sustainable commercial success of newly created (late-coming) Cardano stake pools.\nAs a SPO I think that any Cardano SPOs sees value on this proposal.\nAt the same time the statement of how problem is to be solved is well being specified with implementation and with revenue model, definition of success that support economic model.", "q0r": 5, "q1": "The proposer is very well skilled about the whole context (DID and ATALA Prism pioneer) and, knows the Cardano community well because he work in the DID community.\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).\nIn my opinion (I’m 20 years experienced senior information manager on financial sectors) the budget requested is coherent with the elapsed (< 10k$).", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, with  KPI metrics that are shown. It’s good that is that the proposer has briefly mentioned possible difficulties and how to deal with them (e.g. competitors, delay,…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge.\nFurthermore the proposer has very well mentioned possible difficulties and how to deal with them (e.g. difficulties in market adoption, revenue model for cardano ecosystem and SPOs.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 29, "ne": 6, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The proposal would have a huge impact as it would leverage the use of DID's. With it's successful implementation, we could see a ripple effect in its use within the Cardano ecosystem and wider society.", "q0r": 5, "q1": "The proposer has the requisite experience as does his team. This is supported by the fact that they were Atala Prism program pioneers. A budget and a quarterly plan has been provided but a detailed breakdown would help. ", "q1r": 4, "q2": "While KPI's and success indicators are provided, it would be prudent for the proposer to consider any risk factors that may arise and provide the same. ", "q2r": 4, "assessor": "z_assessor_410", "no_vca": 26, "ne": 0, "ng": 17, "nfo": 9, "vca_o": 1}], "solution": "Crear un grupo de interés que permita promover y adoptar las tecnologías SSI/DID además de las implantaciones verticales de las empresas", "experience": "Msc Economics centrado en Finanzas Cuantitativas, Incentivos y Blockchain\nEnero de 2022: Doctorado en Gestión centrado en Política Comunitaria"}