{"id": 398046, "author": "maniakugel", "title": "Carbon ERC-20 Converter to Cardano", "url": "https://cardano.ideascale.com/a/dtd/398046-48088", "category": 26448, "amount": 27000, "description": "Many ERC-20 carbon tokens have been rushed to market, locking real world carbon sequestration projects in protocols that may not last.", "funded": 2, "upvotes": 152988834, "downvotes": 2545273, "votes_result": 150443561, "votes_cast": 1229, "f6_no_assessments": 8, "f6_rating": 4.875, "videos": ["https://youtu.be/MW5KcsXej-8"], "media": [{"title": "ERC-20 Converter Workflow", "url": "https://i.imgur.com/xdbhC01.png"}], "f6_assessments": [{"id": 1394, "q0": "Getting projects to migrate from Ethereum with a significant amount of users may in general be difficult, as developers are more likely to either stick with what they are good at, or migrate to similar, lower cost chains like Polygon. It is therefore refreshing to see a proposal that is thinking outside the box to isolate an area where Cardano is very strong (climate-conscious adopters) and attack a flank of Ethereum where it is very weak (talk of even banning Proof of Work blockchains in Europe and elsewhere). I was not aware that \"carbon tokens\" is such a big market, but after reading about the market cap by the proposers, it is a good area to start doing some \"poaching\".", "q0r": 5, "q1": "The collaboration of a previously funded proposal and highly successful token distribution service Dripdropz to meet the challenge of strengthening Cardano vis-a-vis Ethereum is very promising and should go smoothly due to the vision of the involved parties and them working together creating synergies and \"peer pressure\" to achieve the goal. The proposers have a modest amount of proposals running (compared to other projects that have dozens involving thousands of hours) and it is highly believable that this can be done successfully. The timeline and budget are prudent, if not too much so, and should be sufficient to get the job done on time.", "q1r": 5, "q2": "The auditability part of this proposal is richer than most in terms of the data provided and targets stated. I cannot judge how ambitious this is, as for most things Cardano DeFi vs Ethereum it is a novel frontier, but as far as the auditor is concerned it should be easy to make that assessment early on and communication with other parties involved or concerned about the progress (like community, challenge team and other proposers in climate change technologies) should be able to get a good picture of success from the criteria presented.", "q2r": 5, "assessor": "z_assessor_1357", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1404, "q0": "The Carbon ERC-20 Converter to Cardano proposal makes a strong case of necessity to allow carbon token holders on ERC-20 standard to migrate their ERC-20 tokens to Cardano. They will work with IOHK and dripdropz to complete this project. Dripdropz is a very well known token distributor within Cardano community. The team has attached a detailed diagram which shows project in detail. They have a very clear path how to make this migration project a success. I believe that the Carbon ERC-20 Converter to Cardano will benefit not only the carbon token holders in ERC-20 standards but also DApps and other projects to move from Ethereum to Cardano which is the goal of this Great Migration challenge.", "q0r": 5, "q1": "The team has include a detailed timeline from June to October (6 months). They will onboard ERC-20 token holders and conduct the token conversion on testnet with the assessment in August. The project has reasonable timeline that allows time for evaluation. It has clear budget with rate per hour and one time set up cost. It also has strong development team with Plutus pioneers and full stack developer. The total budget is reasonable with the provided timeline.  It is very likely that the project can achieve what it aims for which is to migrate ERC-20 carbon token holders to Cardano.", "q1r": 5, "q2": "They describe how they measure progress and development of project using key metrics both before the testnet evaluation and after the testnet evaluation. Before the testnet evaluation they use the number of carbon token issuers that pass their standard to be included in the testnet. After their testnet evaluation, they will observe TVL migrating to Cardano and the number of carbon projects that migrate. The community can audit this project conveniently with the detailed key metrics they provide. They will report back to Cardano community via online zoom meeting with challenge team and also increase public awareness of ERC-20 carbon token migration to Cardano across their social media channels. The information provided allows the community to fully audit the progress of project. ", "q2r": 5, "assessor": "z_assessor_1358", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5808, "q0": "According to Reuters (https://reut.rs/3KW0X7t), carbon emission offsetting is a $851,000,000,000 business. Voluntary Carbon Markets (VCM) constitute $1,000,000,000. Compared to these figures the $200,000,000 dollars locked in ERC-20 carbon tokens is not much but migrating even a fraction of that to Cardano would be a great start.\n\nThe BlockCarbon team (https://blockcarbon.io/) is on a mission to make carbon offsetting an investable asset class in Cardano DeFi. They’ve only got started with their Fund7 proposal and now they wish to create a converter to migrate “dirty” ERC-20 carbon tokens to a new home in Cardano.\n\nNeedless to say, potential for financial impact is nearly limitless. The team raises another valid point, however: should they be successful with this, it creates a whole another reason for the ‘Great Migration’, one that is not only tied to a superior technology or lower gas fees but to an environmental cause. The team has truly identified a problem worth solving, one that can supercharge Cardano RealFi.", "q0r": 5, "q1": "This ingenious design is well thought out and it is likely to be implemented successfully due to the multi-disciplinary competence of the team, as well as that of their partners. There are some caveats, however. First of all, it is still unclear whether Cardano is able to scale to truly become the DeFi powerhouse it has been promised to be. Secondly, as the team has pointed out a “transition to Ethereum 2.0 could make migration from ERC-20 less attractive” and therefore it’s a bit of a race against the clock. Another “competitor” is IOG with their ERC-20 converter. Needless to say, the team is ready to collaborate. All in all, a sense of urgency is a good motivator for timely delivery, and whichever team or consortium ends up winning the race doesn’t matter so much as long as the end result is beneficial for the environment. These questions cannot be ignored however, so that naturally casts a slight shadow on the feasibility of the project.\n\nRegardless, with a budget of only $27,000 this is definitely worth a shot. Their main proposal in Fund8 is for a Carbon Marketplace and Exchange: https://cardano.ideascale.com/c/idea/398034", "q1r": 4, "q2": "The BlockCarbon team has made clear projections to reach three issuers and investors after one month, six after two months and 10 after three months. Likewise, unique ERC-20 tokens we can expect to be on-boarded are one after a month, three after two months, and five after three months. For the following months, August-October 2022, they have made similar projections, expecting in the end a $500,000 increase in Total Value Locked and migration of three unique carbon liquidity pools. The roadmap and budget reflect this ambition level and information is provided on a good enough level, although the plans are clearly still quite fresh.\n\nThe team hosts a Telegram group and a Twitter account through which they give regular updates. They have also promised to bring regular news to the Project Catalyst Townhall.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6060, "q0": "This Challenge is about moving projects and ideas from EVM (Ethereum Virtual Machine) based blockchains to the Cardano ecosystem. The proposal is focused on the Carbon Market and it's  ERC-20 converter will move Carbon tokens from Ethereum to Cardano. This is exactly what this challenge is intended to encourage.", "q0r": 5, "q1": "This Team is highly skilled in the right areas. Two members with experience in the Carbon Markets, Two programmers one with Plutus Pioneer training and another with 30 years in programming and lead position. Also the Financial expertise added to this team.  This in addition to the relationship with DripDropz and IOHK. This is definitely a team ready for this type of project. ", "q1r": 5, "q2": "Budget Breakdown is detailed and easily auditable as expenditures are easily understood.  The roadmap starting with June going thru October 2022 is detailed and will be easy to follow, also their 'what does success look like' is very detailed on how many  investors, how many tokens moved the number of whitelisted tokens all with Monthly KPIs.  These measure will be easily tracked and audited.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6247, "q0": "Eth is horrible due to its gas fees...so it does indeed seem incompatible with a sustainability effort. This would be huge, and could be good press after its success for hopefully the press would include how Cardano is a more eco-friendly blockchain, and some of the important factors of its need to migrate from ETH to Ada/Cardano.", "q0r": 5, "q1": "LinkedIn profiles provided, and they seem like an efficient and well rounded team bringing many different backgrounds to the table.", "q1r": 5, "q2": "I would have liked to have seen more github repos, and working examples of past work. However, the links and text provided certainly detail past experience, and should give some confidence of possible success.\nThe flowchart provided gives a basic overview of how the different components can work together. This gives me some confidence they see a possible set of solutions and just need to code it out.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6429, "q0": "I've often wondered if ETH token projects would really move over to Cardano via an ERC-20 Converter in the midst of all the tribalism between the two ecosystems. This proposal is one of the first to really give me hope that there could be a migration (en masse hopefully) because it targets a niche area. By its very nature this project fits into this Challenge perfectly hence my complete agreement and I don't need to rely on my experience as a former assessor of projects for a university to give it my seal of approval. What makes this stand out and even deserving of a 6th star is the targeted approach with the Carbon Offset tokens. It is a pity the proposer didn't include whatever rationales they will use to convince ETH project teams to move over because that would have been compelling reading (and that would have been the 7th star) but it is undeniable that comparatively, Cardano's credentials in the Environmental space sits at a higher level than Ethereum on so many levels, notwithstanding the basic process of achieving consensus. I have great confidence that the KPIs mentioned will be surpassed particularly after AGIX moves across in April when the technology is proven on Mainnet. And I even believe one of the risks mentioned, i.e. of DeFi projects potentially slowing down Cardano to make it unpalatable for ETH projects to move across, will not even be an issue given the Vasil HF planned in June. Good luck team. This is one to look out for.", "q0r": 5, "q1": "The team presented is a good mix with the necessary skillsets to pull this off. They do not only have the valuable experience in the dev space with Cardano-specific language skills but also in risk, derivatives & commodities, which frankly speaking, are at the heart of the carbon offsets. Whilst we are assessing projects' compatibility with Cardano, we  can easily forget that there are real world problems to solve and the ETH-migration is but a process of the whole. There are links provided which further provides info to team members' experiences. Both BlockCarbon and Dripdropz are operational projects in Cardano and this further gives confidence that the ideas presented are very-well thought of.  The idea of using DripDropz as the distribution mechanism is novel and in a way, a smart move given people's growing familiarity with the platform. Its utilization by ADA projects is expanding and the SundaeSwap token distribution is testament to the quality of their work. The plan from June onwards is presented at a high level and I would suggest this be described in a more granular level, should this proposal ever have to be re-submitted. I would have preferred to see a parallel development track of the conversion smart contract/s running alongside the June to Aug 'processes'. That said, I did not deduct any points because as it stands, this proposal is very well-written and presented and gives great confidence that success can be achieved.", "q1r": 5, "q2": "Measures for success of this project are clearly stated so from that point of view, auditability can be easily assessed. In addition, the types of reportable KPIs mentioned; TVL and migrated ETH-carbon tokens, are surely news items or values that people in our community aways seek and report on. So even if this project team does not report on it, I have a feeling there will be others who will report any wins by this project independently. As mentioned, even coinmarketcap and other trackers take note of such numbers so if any projects move from ETH to ADA, they will surely make waves and might even make it in the news. To further improve this proposal, I would suggest adding their socials and the GitHub repo as this would make it easier for readers to do more research and to connect with the team for updates as the project progresses. But I maintain my strong agreement that this project is highly auditable since those channels are available on the BlockCarbon website. On a final note, should this proposal miss out in this fund and will need to be resubmitted, it would be an improvement if the development path was described as they could add to the auditability of the project and justify the budget requested. Good luck. ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7749, "q0": "This proposal talks about bringing ERC-20 based carbon tokens into Cardano blockchain, to make it more sustainable and preserve it in a long time. Their solution is to create a simple to use, trustless, secure conversion of ERC-20 to BlockCarbon tokens on Cardano. Their goal is aligned with the challenge setting, because not only to migrate existing ERC-20 token into Cardano native token, but also to increase the adoption of using Cardano for more sustainable and long preserving ecosystem. Carbon market in itself is already a huge market, and translating it into a sustainable blockchain will grow and scale this market / industry even further. This proposal will chose only a high-quality carbon pools can migrate, so it will maintain its quality. ", "q0r": 5, "q1": "The team consist of experienced developers, and people that fits for the role needed. We can see their previous working history through their LinkedIn profile, from Community Manager at DripDropz, experienced full stack developer, and a Certified Quantitative Finance person that is also a content creator with 50,000 followers on social media. This team composition proves that the team knows what they’re doing and are serious about it. They have their budget broken down into identifiable manner, such as budget for Fungible token Minter with DripDropz, website and UX design cost, etc. They have their roadmaps and plans explained well, from June 2022, to October 2022. They are also looking for collaboration with IOHK and have a development team working on EVM, proves that the team knows what is needed for this project to become a success. This project have a huge chance of success considering from their team experience, and their detailed plan. The proposer also consider the challenges and risk, such as current DeFi landscape in Cardano that couldn’t scale (yet, because Cardano is still rolling out its scaling update throughout 2022). BlockCarbon is already developing the standard for Cardano carbon tokenization. Overall, considering the team experience and their well written proposal with clear plans and roadmap, this proposal have a high chance of success. Hence, I will give it a 5 star", "q1r": 5, "q2": "This proposal explained their roadmap with milestones, such as the number of carbon token issuers and investors target number. Their metrics/KPIs is explained in detail, such as the $-value of converted ERC-20 tokens after one, two, and three months. They are also planning to report back to the community through bi-weekly Zoom meeting with the challenge team. Overall, a clear and understandable description for their solution (implied in their metrics / goals) towards the targeted problem will make it easier to audit and assess their progress. I will give it a 5 star", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7920, "q0": "The conversion of many projects and tokens from ETH to Cardano is now urgent. However, it is not easy because the cardano platform is still in the maturing stage. The technical \"bridges\" that help the conversion are not really complete is the main barrier. The Plutus language, Haskell, and the UTXO mechanism are unfamiliar to many Devs. Therefore, the conversion tools will save a lot of cost and time in this process. Drive more projects to cardano.", "q0r": 5, "q1": "Proposal writer has 25 years of IT experience, attended the Plutus Pioneers course, and has 30 years of experience working with the solidity language. This is a sign that he is ready with his proposal and can go further with cardano.\nI have read about the technology solution they offer, it is still in the research stage, but they have a clear research direction and would like to get help from IOHK. There is also receiving the help of the dripdrop team.\nIn the nearest future they plan to publish a whitepaper that will detail the technology solution they come up with.", "q1r": 5, "q2": "Overall I am satisfied with the proposed plan and budget of this project.\nIn the first 6 months, they focused on researching and perfecting the product, and approached and held regular discussions with partners wishing to convert from ETH to Cardano.\nIn the following months, they will announce to the public all the results and the number of successful conversion projects.\nProject progress is re-audited against KPIs. The statistics will be: the number of issuers, investors and token developers participating in this process, the number of tokens converted..\nBasically the direction and the solution are clear. The project lead has full relevant experience. Hope the project will be successful.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Simple to use, trustless, secure conversion of ERC-20 to BlockCarbon tokens on Cardano. Liquidity boost for developing carbon market.", "experience": "25 Year IT veteran with CTO level experience, Plutus Pioneers 2nd Cohort graduate working with Solidity developer with over 30 years of full stack experience building business applications at institutional level. Supported by entire BlockCarbon team and DripDropz colleagues."}