{"id": 399093, "author": "newmindflow", "title": "Attract ETH NFT Projects & Talent", "url": "https://cardano.ideascale.com/a/dtd/399093-48088", "category": 26448, "amount": 35337, "description": "How do we get the interest of artists & developers planning to release NFT projects on ETH and onboard them smoothly to Cardano?", "funded": 1, "upvotes": 60435187, "downvotes": 14711680, "votes_result": 45723507, "votes_cast": 411, "f6_no_assessments": 7, "f6_rating": 4.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 1406, "q0": "Attract ETH NFT Projects & Talent proposal tries to get the interest of artists in ETH and board them smoothly on Cardano. This is done by series of guides and consultancy session. The Great Migration challenge goal is to make it easy for DApps to move from Ethereum to Cardano. While the proposal consultancy service and guides aims to on board these projects both inside and outside Cardano, the 20-25 projects throughout the project is limited impact compared to the scope of this challenge. Also the proposal falls short on explaining how they could identify the unreleased and under development projects in ETH. This segment is their focus market but they offer very limited information on how to locate these projects and convince them. The information offered in the guide is a general information that is available online and I couldn't see how they can deliver these guides project by project. ", "q0r": 3, "q1": "The project implementation plan has listed down what they will do but not explain more. Also there is no period that project reserves for identifying unreleased projects in ETH and it is not listed as part of their implementation plan. This is despite the importance for project success that the proposer knows which unreleased ETH projects to approach. The budget breakdown is clear with personnel budget and fixed cost. The team is well experienced in Cardano NFT market from their past projects. The project could improve in feasibility part by mention the customer acquisition information. Without this information, it will be difficult to tell if the proposer will complete the project as planned.", "q1r": 4, "q2": "They listed down the metrics to measure project performance like number of visit to the online guide, number of 1-to-1 consultancy service, and number of onboarded projects. The project period they mention in the feasibility section (2-3 months) does not match with the period in the auditability section (6 months). Also It is not logical that success after 3 months and 6 months contain the same number of audience reached by the guides ( audience of thousands). By the conclusion of project, they expect 20-25 projects will book their free consultancy service with 5-10 onboarded by migrating to Cardano. This signifies that the project impact is limited and the project lacks in scalability. The proposal will improve if it could provide consistent information and can include more concrete auditability like feedback gathering from migrating projects so it could make a case that their consultancy project can have positively and meaningful impact. ", "q2r": 3, "assessor": "z_assessor_1358", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "The impact rating is based on the assumption that the Great Migration challenge is only about making it easy for “DApps to move from Ethereum to Cardano”, but the challenge brief clearly states “dApps and other projects”. The assessment also claims that “information offered in the guide is a general information that is available online”, however we have clearly stated in the proposal that we will be adapting and evolving them according to the needs of each project.\n\nThe Auditability section of our proposal doesn’t seem to have been carefully read. The definition of success after 3 months clearly states “guides reach an audience of a couple of thousand” while after 6 months “an audience of thousands”. But the assessment states they are the same. They are not, “a couple of thousand” = 2K-3K; “thousands” = 4K-9K."}, {"id": 2699, "q0": "IMPACT:\nCardano is a layer 2 blockchain, which provides a solution for faster and cheaper transaction speed based on the PoS consensus mechanism. However, from an artist or NFT creator perspective, how can these characteristics be easy to understand? This is one of the aspects that this challenge addresses and this project describes. The main problem to solve is how to generate interest of artists and developers planning to release NFT projects on Ethereum to have the migration to Cardano. The way this proposal communicates the solution in two parts: 1. By delivering a series of guides based on interactive infographics and text content. 2. One-on-one consultancy sessions with NFT creators and developers. The sessions provided will cover topics according to the inquiries and needs of each project or situation. This means, that the members who will be assessing the sessions have to demonstrate adequate experience and knowledge according to the need of the requesters. The team also provides a list of several potential topics and subjects to be implemented or assessed during the sessions, as a guidance for project content. I personally consider that the metrics and goals of this proposal is aligned with the purpose of this challenge. The focus will be attracting the unreleased, in development project from ETH to Cardano. In addition, they are planning on offering free consultation and information about the advantages of Cardano over Ethereum to already existing projects that are created on the ETH chain, which allow to scale future challenges for crypto bridging experiences. \nScore given: 5 \n", "q0r": 5, "q1": "FEASIBILITY:\nAt this phase, the proposers offer plenty of evidence, experience and references based on the professional skills that are needed to demonstrate the correct implementation of the proposal in evaluation. All the LinkedIn and Twitter links are verifiable, describe the team professional abilities, and have online public access. In my opinion, the team possess vast experience related to the NFT ecosystem and interaction with Cardano and involvement with Project Catalyst. Also, they have previously assessed consultation and shared their experience with different NFT projects, to assist on the improvement and success of the NFT community in Cardano. In addition, they offer an implementation plan with different areas that will be addressed in the process (such as: market research, guides, marketing, consultancy sessions, presentation, and marketing results). On the other hand, the budget is outlined and broken down into identifiable elements. They specify the activities, topics, and rate costs according to the hours invested. I believe that the budget required is reasonable to achieve the goals in an adequate manner. In addition, they have provided previous proposals the team have been part of. I can observe that the proposers have been progressing in the way they describe the information and how they organize the content and links. This demonstrates the willingness for improvement and the sense of collaborating with the Catalyst ecosystem. Finally, the proposers clearly explain into detail all the technical aspects, language and technological to take into consideration when implementing the process. They offer topics that can be discussed and addresses when providing consultation, the time and aspects that will be considered when creating the content for the website and guidance for NFT projects, available links and references from their experience as professionals and previous projects and collaborations that have taken place. This presents a clear idea of how involved the team is and the time, they have invested in helping for the Cardano ecosystem growth. \nScore given: 5\n", "q1r": 5, "q2": "AUDITIBILITY:\nThe way they will assess the progress and provide evidence will be through a public GitHub site that will show the latest standards of the project implementation. As well as the NFT Guild compensation and assessment will be viewable for verification on this site. In addition, the NFT project assessments will be tracked, according to the weekly progress. The community members and public in general could corroborate the project process on the discord account linked to this proposal. The roadmap has a time horizon, with specifics explained in the feasibility phase (based on the information of gathering phase and specification phase). These metrics also identify the potential success of the proposal, as well as, all the links provided from the team professional skills, previous works, consultations and NFT experience within the Cardano ecosystem and Catalyst project involvement. Moreover, the discord account (which hosts 176 members), offers diverse information about the NFT Guild project, and community interaction the team has created throughout the process. Finally, this proposal is a vehicle for “NFT Verification Tool”, which offers more validity to the solution that addresses this proposal. I believe that the team delivers sufficient ways to measure the progress of the implementation process from the website update, Git Hub public site, discord channel, links and references attached. It does successfully address the challenge of providing tools for educational content, advantages, and easy ways to understand why Cardano is a great technological blockchain for NFT project creation and crypto interaction. \nScore given: 5\n\n", "q2r": 5, "assessor": "z_assessor_1557", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4085, "q0": "This proposal idea is providing 1 on 1 consultancy & onboarding sessions for in-development ETH NFT projects supported by a series of comprehensive & appealing guides and through that getting the interest of artists & developers planning to release NFT projects on ETH and onboard them smoothly to Cardano. The proposal has given a very detailed descriptions of the project. The proposer has guided us through from the root of the idea to how it’s going to be operated and the expected outcomes. I can see that the team has had the idea running in a smaller scale and there’s some success has been made. That totally give out a strong potential of this project. Not only delivering the idea, the team has also presented a strong point of why and how this proposed solution will address the challenge when they aim to get projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem. However, the team is not over confident at all. A lack of interest from projects to engage in exploring and considering Cardano as a viable blockchain to launch on is going to be a real challenge for this project and I’m glad to see they at least have an idea of a solution for it. That said I totally strongly agree that this challenge 100% aligns with this challenge. ", "q0r": 5, "q1": "Firstly, the proposers have provided linked in profiles and they have proved that they all have the necessary experience to cover what’s necessary for this implementation and more. The team has done so much but still there is room to grow and scale. It definitely brings credibility to the project. Secondly, the budget is outlined clearly and be broken down in to reliable item to be executed. However, I wish that there is a more specific roadmap for the implementation plan as each task should have come with an est. time-related item so that we can see if the timeframe is reasonable. I believe that the team can easily work on it, so it’s totally not a big cons here. Most importantly, the team has done some research and actually had some real work being done, that makes this proposal highly feasible .", "q1r": 4, "q2": "In term of auditbility, it’s completely possible covered. The team has promised a monthly report so that the community can actually audit the project and anyone can follow along easily enough. Key metrics and KPIs are relevant, described in details with time-related item and most importantly present. I don’t find an actual effective KPIs in a lot of other proposals when they are in integral part of a project. With a clear metrics, we can optimize the process and know that if you are doing the best. The problem here is clear, the solution is clear and very easy to understand for either technical or non-technical people alike. I would strongly recommend people to vote for this project as I believe it will benefit the whole community. Best of luck!", "q2r": 5, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6040, "q0": "Proponents identify a problem that corresponds to the challenge. Next, they make an extensive proposal as a solution.\n \nIf this idea comes to fruition, it could bring major creatives and artists from the Ethereum community into the Cardano ecosystem, thereby adding value in the form of attention, publicity, and growth in Cardano adoption among artists with considerable crypto knowledge.\n \nI think the proposal is able to scale to address future challenges because they have a very detailed plan to run their business.\nThey are very clear about the topics of conversation for on-demand conversations and for the development of general guides.\nThe consultations will be free for the client, so I see many possibilities for the project to have a concrete impact.\nAnd the risks they pose are resolved in a personalized way and tailored to the specific needs of each artist.\n", "q0r": 5, "q1": "The proposers provide evidence of their vast experience in the matter. They attach links and show themselves as the ideal candidates to carry out this project: they have direct and historical experience in the matter, they have the necessary knowledge to successfully onboard artists from the ethereum community. And they already have previous experience in consultancy sessions to artists and projects.\n \nIn this way, the proposers make a very detailed and broken down reasonable budget that shows that they know for sure the team members they need for the development of their company.\n \nThe timetable is realistic, but it needs a bit more work. They need to detail it a little more since they list the activities they must complete, but do not assign a time to each of them, but this is not significant enough to lower them a point in feasibility, because it is an area where this proposal shines.", "q1r": 5, "q2": "This project, due to its style, is also easy to audit. It has its well detailed kpis that can be easily controlled by the community.\n \nThe project sets realistic goals for success and is clear both in the statement of the problem and in the solution.\n \nBy taking photos of the meetings with the artists and by showing the NFTs of the artists deployed in the Cardano ecosystem, they will be able to demonstrate the success or not of their work.\n", "q2r": 5, "assessor": "z_assessor_32", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6940, "q0": "The F8 challenge seems to prioritize a variety of creative ways to ease the onboarding of new ETH users, and I think a subsidized 1-1 approach is a great way approach. \nSpecifically, you mention a lack of interest from projects to engage Cardano as a viable blockchain. I also see this as a roadblock, and while anyone who knows Cardano well understands this is not the case, the general public doesn't seem to. Any proposal that can help improve Caranos brand awareness while also helping with on-boarding is a win in my books.\n\nAnother strength of this proposal is the commitment to an authentic, honest approach. While this seems obvious as something important, I think it can be forgotten or not prioritized enough. Making integrity AND simplicity as key pillars is a great way to signal to your team what this is all about!", "q0r": 5, "q1": "The importance of building out the Cardano ecosystem in order to attract the much needed \"sea\" of new and skilled technical personnel is captured in this proposal by showcasing a relevant set of experience with its NFT guild. Great to see quality proposals being submitted by involved community members, who also show a network of like minded people (who have also submitted proposals. I think this sort of collaboration among our community is exactly what is needed and will provide an underestimated amount of synergies, especially overtime as Cardano scales up!!\n\nAdding to the synergy (and feasibility) the of this proposal is the balanced mix of both technical and artistic experience (see below).\n\nAn NFT from the collection was the first one to be sold through a smart contract, minutes after the Alonzo HFC. It also was the first sale through a smart contract on Cardano to pay residuals (i.e. royalties) to artists on resales of their works.\n\nAward-winning filmmakers, film and animation directors, app and game developers. In 2021 they moved into the web3 economy granting new life to one of their projects in the form of an NFT collection on Cardano.", "q1r": 5, "q2": "This proposal did a good job at measuring both on the subjective return on intent (# of visits, # of consultant sessions), while also considering the more objective and measurable result (# of projects onboarded). Also thought it had aggressive, but attainable goals.\n\nThe reason I did not give a 5 for audibility was that while it did cover the goals and metrics for the short and medium term (3 months, after 6 months), it would be good to have a better idea of what long term success looks like. I understand this space moves lighting fast and it is hard to predict long term goals, but would be helpful to at-least show a few thoughts.\n\nExcellent proposal! Something i am very interested in myself! Well done.", "q2r": 4, "assessor": "z_assessor_503", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7931, "q0": "As we all know, cardano developed after ETH so in terms of technology is more complete. Currently, the transaction cost on Cardano is much cheaper than ETH. Cardano already has cNFT but ETH doesn't. So in the long run it is clear that developing NFT on cardano is definitely more profitable than on ETH in the long run.\nHowever, the awareness of the majority of the community is not aware of this.\nA lot of inconvenience when converting from ETH to cardano does not seem really familiar to developers.\nTherefore, documents and manuals that are designed to be intuitive and easy to understand will help speed up this process.", "q0r": 5, "q1": "This project will create a series of detailed, graphical instructions that will help guide the conversion from ETH to cardano in an easier way.\nThe development team includes many artists and entrepreneurs who have successfully developed NFT Trybbles & Icons Cardano. They also joined from Fund 3. So I think they have the relevant skills and knowledge, enough enthusiasm for the project.\nThey will also host 2 hour training sessions and seminars on the topic, helping to accelerate the transition and better market awareness of NFT on cardano compared to other platforms.\nThey clearly understand the advantage of cardano over ETH is that transactions on cardano have no failed transactions, so the cost is much cheaper.", "q1r": 5, "q2": "Currently the new group is at the research and planning stage of work. However, I have not seen the details in the plans, they do not have a quarterly or monthly timeline.\nThe project will report according to KPIs on the number of visits, the number of training sessions, discussions, consultations, the number of NFT projects converting from ETH to cardano...\nCurrently, they have not developed their own website or official communication channel.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10709, "q0": "Attracting NFTs artist and developers with better platform and support and making them attractive cardano and  absorbing them from ETH is great idea, Onboarding them to Cardano by providing better stage through cardaon wil also increase the value of cardano eco system, NFTs growing by each day supporting them by providing One-on-one consultancy & onboarding sessions for in-development ETH NFT projects is great idea, Artists and entrepreneurs and creators of  NFTs providing them guidance will enable new NFTs creating possible, \nThe proposer idea of onboarding artists & developers planning to release NFT projects on ETH and onboard them smoothly to Cardano is effectively addresses the challenge.   ", "q0r": 5, "q1": "The proposer being artist and entrepreneur in the CNFT space since day 1, and  creating Trybbles & Icons Cardano NFT projects, and being catalyst member from F3 has relevant experience in the field, By creating rich interactive infographics and attracting new people to make one is good idea, and having one on one interaction with  NFT project creators and developers is most best way as mentioned in description,  Cardano NFTs are actual native tokens, which live on the blockchain at the same level as ADA, so creating Better platform than ETH is possible and it will benefit Ada eco system, with increase in NFTs in ADA community  huge potential for growth of the entire Cardano ecosystem, when compared to ETH is possible, spirit of innovation and pioneering of the entire Cardano ecosystem reaches new level, proposer idea is fantastic, as I had tough time in NFTs and understanding but having in ADA only will be big boost, as they plan to start work on the project shortly after successful funding and information provided and there implementation plan Market Research\nGuides Drafting\nGuides Design\nGuides Publishing\nMarketing\nConsultancy Sessions\nis remarkable ,\nwith all the given experience and plan proposed it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As proposer provided detailed budget includes Guides Writing, Guides Design for better infographics,  Consultancy and marketing etc have provided fixed cost, \nas they include many award winning film makers and many graphic designers , animation directors, app and game developers is great, Number of visits to the online guides.\nNumber of 1 to 1, in person consultancy/mentoring sessions held.\nNumber of projects onboarded to Cardano that migrated from EVM based blockchains providing all the data for auditing after 3 months and expecting full success in 6 months is nice, The information provided is  sufficient to audit the progress and the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "One-on-one consultancy & onboarding sessions for in-development ETH NFT projects supported by a series of comprehensive & appealing guides.", "experience": "Artists and entrepreneurs, in the CNFT space since day 1, creators of the Trybbles & Icons Cardano NFT projects. Members of various Cardano initiatives & communities. Involved in Project Catalyst since F3. Active members of the Cardano NFT-Guild."}