{"id": 385107, "author": "ravetrade", "title": "Affiliate e-Comm Plugin", "url": "https://cardano.ideascale.com/a/dtd/385107-48088", "category": 26256, "amount": 25000, "description": "アフィリエイターのコスト削減、ペイアウトの遅延。高額なフィアット送金手数料、ペイアウト遅延によるコストは年間5億ドル。", "funded": 1, "upvotes": 58152577, "downvotes": 17768437, "votes_result": 40384140, "votes_cast": 451, "f6_no_assessments": 8, "f6_rating": 3.375, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal identifies the problem of delayed  payouts to affiliate marketers with high transfer fees. They didn't explain how it will ad value to Cardano, but it is quite obvious that it will drive more users and transactions. The metrics align with the challenge setting's and they plan to scale the project to other platforms if this first  one is implemented successfully.", "q0r": 4, "q1": "Relevant experience and team is presented with proof of owned projects. They know what is needed to build this project and breaks it all down in their budget which is also reasonable. They didn't explain in detail what languages are being used to  build what. Providing more info on that will give the user an even clearer picture on how you want to solve this. Completion time of the project seems reasonable. They also didn't consider any potential risks. I can think of one risk. If someone uses one platform to get all their payouts from and you only support a small part of that users portfolio. They won't be likely to move over to your solution. ", "q1r": 3, "q2": "Roadmap with milestones is provided, but the milestones could have been broken down into smaller pieces, like what part of the mvp gets built at what time. KPIs are present in proposal but it would have been nice to have them all in one place and I feel you could ad more KPIs to make it easier for the  community to track your projects success. They went into great detail explaining the problem that is targeted but their solution is described in one line. If you put the same amount of effort describing the problem into describing the solution it would have made it much clearer. The solution as it is now I am not sure on what platform its getting built and how other platforms can connect to it.", "q2r": 3, "assessor": "z_assessor_140", "no_vca": 22, "ne": 5, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "In current times, when more and more people turn into e-commerce with their work, affiliate marketing is a big branch of the market. Introducing Cardano-based payments with COTI could be a big step forward in cryptocurrency adoption - hence I like that idea very much. Plug-in should be simple enough to be available also to crypto-newbies. ", "q0r": 5, "q1": "The team seems capable. Software developer with a dedicated software company should be enough to deliver the code. However, it will require a lot of effort to encourage partners to participate in that project so that it gets widespread. I would love to see some marketing plan here, not only development. And even though I am pretty sure the product will defend itself, let's remember that a lot of great ideas got burried under the influence of mediocre, but well promoted ones. This is something the team should focus on, too. ", "q1r": 4, "q2": "Roadmap and definition of success clearly provide a solution for auditability. Well done.", "q2r": 5, "assessor": "z_assessor_324", "no_vca": 20, "ne": 2, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "I  disagree that whether this proposal effectively addresses the challenge setting effectively. \r\n\r\nAlthough, the proposal provides a detailed outline of the problem statement, and its solution to that by providing smart contract, a dapp connector and a wordpress plugin, that could be integrated into ecommerce websites. \r\n\r\nHowever, for me what is missing link is where are the details of integration with AdaPay solution ?? I can see there is a smart contract and dapp connector, a word press plugin, but no where it is mentioned how all this fits into together with AdaPay solution as is given in the challenge settings. May be the proposer has some ideas about it, but i can not find any details whatsoever in this proposal. \r\n\r\nTherefore for me i disagree, not that the proposal is badly written but that this proposal does not seems to be the right fit for this challenge.\r\n", "q0r": 2, "q1": "The team that represents this proposal has great development/programming experience   and has provided good links to one the lead developer's past work/participations in different conferences. \r\n\r\nThe developer has also good functional programming experience and being a developer myself i know that the learning curve is much steeper for someone who goes from oops languages to functional rather than the other way around. So there is a +1 from my side for the team here :)\r\n\r\nThe smart contract and plugin development seems to be therefore a doable tasks within the given timelines and likelihood of successful implementation, in my opinion, therefore,  is quite high.\r\n\r\nTherefore, i strongly agree that this proposal is highly likely to be implemented successfully.", "q1r": 5, "q2": "I agree that information provided here is in alignment to track the progress and success of this proposal. \r\n\r\nHowever, it would be nice to give more detailed information on budget requirements as i think the total budget for this challenge is 100k and this proposal asks for 1/4th of the total budget.\r\n\r\nAn example would be detailed justification of  why there will be 10k $ needed for Wordpress plugin. In general wordpress plugins (another proposal here for joomla plugin asks for like 3.6k$) are quite simple to implement but I am assuming in this case there is some sort of communication needed via smart contract. ? the justification for this budget is left to reader/voter assumption.\r\n\r\nAnother example is for better audit-ability sake is that proposer had given more details about Smart contract development. A 10k $ to implement a SC could have been split further (instead of 5k of two parts) into man hours and presented here. Questions such as How many hours a developer will work?, what is the rate per hour expected for developer. I believe if it is going to be a SC on coti, then it will be a solidity smart contract. The developer has significant work experience with Haskell, so I am assuming the learning curve with solidity is much easier and faster. \r\n\r\nEither way a more detailed information on budget would have been great, therefore I am not in full agreement with the auditing part of this proposal. Hence 4 stars from me.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal fits within the challenge settings. By providing a real-time commission payment you would create a boost in affiliated marketing. Only got one issue with real-time, a single transaction on the blockchain still needs to be verified how do you plan on doing this in real-time? or is that what you mean by real-time and not waiting until the end of a month to get paid. But the main issue I see in the proposal is how are you integrating the ADA Pay into this. You talk about direct payment for affiliated marketing and deployment of smart contracts but we lack the detail of using ADA Pay plug-in for this?", "q0r": 2, "q1": "The duo proposing the project gives some basic information on themselves but does not provide any reference to the relevant experience they have for this project. What I find missing in this proposal is a clear workflow or roadmap. They state the current challenges but don't provide a step-by-step guide where they explain what they plan on doing to solve this.", "q1r": 3, "q2": "Since no actual roadmap is provided following this proposal after it gets funded becomes hard. We have no guidelines to follow and we only get a glimpse of the proposal on where the funding is requested for. We see they plan on releasing a plugin for Wordpress, but in the plan there is no word of this. What is your workflow to develop this?", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 21, "ne": 1, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The general them is appropriate for the challenge, but integration with ADApay is not discussed in any detail and in fact appears to be optional: \"Facilitate real time commission payment to wallet in ADAPay plugin or develop separate plugin.\" The proposal seems to be about creating a totally new payment gateway rather than leveraging the ADApay API. No specific technical discussion is given to discuss the specific technical talking points given in the challenge: \"\r\n    How will you test the plug-in's quality, and how easy is it to implement it into the software platforms?\r\n    Is the plug-in able to process big amounts of transactions per second from different websites without problems?\r\n    How do you intend to design for the user's needs and incorporate Merchant's feedback regarding the plug-in performance?\"", "q0r": 2, "q1": "While the proposer appears to have technical expertise relevant to Cardano, they do not seem to have given much though to the specific technical requirements of integration with ADApay which is central to this challenge. The example UI given is unrelated to payments,  not very attractive, and does not inspire confidence in the proposer's ability to execute. ", "q1r": 3, "q2": "the deliverables given seem unrelated to integration with the ADApay API, so \"success\" is hard to define in this case", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This project offer to facilitate the payment of commissions in the frame of affiliate programs, through a dedicated plugin. The problem is clearly stated and the added value to ADA Pay environment. The proposal includes long term goals, outside of the scope of this initial funding, showing a great ability for this project to scale up. I strongly agree that this proposal addresses the \"Pay with ADA challenge\". ", "q0r": 5, "q1": "The proposer is a software developer with experience in functional programming, and Haskell in particular. Evidence of these skills are provided, under the form of a public conference and open-source developments. \r\nThe proposal includes a budget breakdown, but I would recommend elaborating on how this is allocated. I understand that this budget is 100% salary for the proposer development time.\r\n4 deliverables are identified and articulated with the problem statement.\r\nConsidering the proposer computing science experience, I consider this proposal is likely to be implemented successfully.\r\n", "q1r": 4, "q2": "A realistic timetable is provided, though not very detailed (3-6-12 months milestones). I would recommend this proposer to include intermediate milestones to enable a better monitoring of the progress.\r\nNo Github repository is mentioned. The proposer does not explain much how the community will be able to monitor the progress of his project and does not offer metrics / means dedicated to ensure a good auditability.\r\nBased on this project description, I neither agree nor disagree that the community will be able to monitor the progress of this project.\r\n", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This proposal has the potential for tremendous impact for Cardano blockchain adoption, as the problem area noted -affiliate marketing payout fees, lag and fraud- is desperate for the security and scalability (Hail Hydra) of Cardano.  Affiliate marketing, and its needs, grows more and more sophisticated by the month, and the proposals included metrics of this are insightful:  as network marketing suffers from the bloat and ennui of legacy systems (high fees, slow), affiliate marketers making meaningful, community based ingress are dependent on these network marketers and their established legacy tx.  The targeting of a wordpress plugin makes sense (better development environment, substantial userbase), and if successful, further scaling could be addressed, at low cost, in further funding rounds.  Overall, AdaPay for affiliate marketers would be a tremendous coup for Cardano, and a very creative inroad for 'Ada in the background'.", "q0r": 5, "q1": "The proposal team shows examples of previous development work and suggests familiarity with Haskell, though evidence of Haskell skill wasn't specifically listed.  They also indicate affiliate frontend experience and insight, though no references were included.  While the impact of the proposal was well stated, the clarity of how the solution would be implemented was less clear.  The best clues were found in the budget which was  broken down by the concept of deliverables, rather than cost of resources.  No roadmap was included, but one can be inferred from the deliverables list combined with 'definitions of success', where milestones are noted at 3-months, 6-months and 12-months.  The actionable events are organized, but very general and lacking in detail to evaluate any specific implementable qualities.  A detailed roadmap would be very useful, including breakdowns for the use of the web server which accounts for 60% of the proposed budget.  It also seems like the smart contract development is an important start point for this proposal, but there is no information to assess how that will be approached, or what it seeks to achieve within AdaPay.  Can we assume it is the unique affiliate requirements for commissions, membership, etc.?  I believe so.", "q1r": 3, "q2": "Without a detailed road map, it was difficult to establish exactly how to monitor this project, especially over the first 3 months.  It would be helpful to know what the deployment of the smart contract and dapp integration would look like over that 3 month period, are there any natural check-in points like commits or code audits?  In terms of what will be delivered over those 3 months, the proposal is quite clear:  smart contract, affiliate API, plugin MVP launch.  But we really need to know what steps get us there, and how to know if the project is staying on track and funded.  A proposal that designed some KPI to match up with COTI's proposed KPI (effectiveness of payment flow, scalability of plugin (I suspect this is the intent of \"server monitoring\" in the proposal, but again this is not made clear), merchant pools being tapped) would offer a lot more clarity.", "q2r": 3, "assessor": "z_assessor_811", "no_vca": 15, "ne": 7, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This is a laudable project however it does not effectively solve or have an impact of the goals of the campaign. The proposal is actually targeting a payment solution for a particular segment of online marketing that is online affiliate marketing and it's commission payout issues and not e-commerce website ADA payment Plug in integrations.", "q0r": 3, "q1": "The proposal team members' essential skill and experience seem vague and lacking details. There has to be some level of cogent experience in the field or potential technical collaboration. It seems that information presented here lacks evidence of necessary competence to deliver this project. In addition, there is no mention of any potential risk of adoption of the MVP across various e-commerce platform and the solution to such risks.\r\n", "q1r": 3, "q2": "There proposal is evidently lacking in sufficient key performance indicators and the roadmaps indicated in the proposal can not be used to assess performance of the project if eventually funded.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "ADAPayプラグインまたは別のプラグインを開発することで、ウォレットへのリアルタイムのコミッション支払いを容易にします。", "experience": "Michał J Gajda - ソフトウェア開発者\nEmil Trautman - フロントエンドウェブ開発者"}