{"id": 384529, "author": "bryan77", "title": "Stake Pool Key Documentation", "url": "https://cardano.ideascale.com/a/dtd/384529-48088", "category": 26246, "amount": 1000, "description": "Stake Pool cryptographic key creation and rotation procedures are difficult to understand, even for technically-adept operators.", "funded": 2, "upvotes": 48103194, "downvotes": 15855455, "votes_result": 32247739, "votes_cast": 171, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The stake pool key decomentation will help onboarding the new SPOs into Cardano ecosystem and it fits very well with the challenge objective for global sustainable SPOs as there are some potential risks and loopholes  that need to be documented and forewarned for SPOs in order to run their stake pools successfully.", "q0r": 5, "q1": "The proposer is a SPO himself and this will be a solo work. The budget and timeline look reasonable provided that the documentation will be done in detail with full fisclosure so the new SPOs could evaluate if running the pool is an ideal operation for them. The delivery format is preferably github compared to miro as it is more widely used.", "q1r": 4, "q2": "The success of this proposal depends on the proposer ability to capture full  detail on running a SPOs. The proposal looks more likely to take 30 hours of working hour and for the total budget of 1k, this project will be beneficial to the community if the proposer carries out the tasks right.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This initially sounds like an insignificant idea, but to make it up it's really practical and the fund needed is set humbled too. A clear diagram would help people to be more confident in their way becoming a SPO. Perhaps the proposer should consider going beyond a diagram/scripts and create other forms of content as well, tutorial videos for example.", "q0r": 4, "q1": "The proposal has stated pretty obviously that the proposer is capable of creating the diagram. However, when it comes to visual content, it also requires designing/editing skill to get the information across effectively, so you should probably consider that. ", "q1r": 4, "q2": "It would be great to see a kind of standards set for the diagram/scripts so that we could determine whether the quality of your work is worth the fund given.", "q2r": 3, "assessor": "z_assessor_936", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "It is a short proposal but to the point. It is fully aligned with the challenge objectives to create tools for SPOs. The problem and solution are well defined in a simple way. It would have been helpful to have some estimation of the impact such as solution could bring - i.e. how many new SPOs will be developed or how much time new SPO will save? Considering the budget requested is 1% of the challenge budget, I believe it will make a valéuable impact. ", "q0r": 5, "q1": "The proposer has the right experience as well as managing SPO. It could have been helpful if you mention some other community members you are collaborating with on your SPO or the SALMON pool. More information about you will be helpful as well. The roadmap and deliverable is straightforward and clear as well as the budget is reasonable for the task. One key risk is how to make it available for the community so the resource created will make the required impact. I.e. add it to SPO guide\nresources.", "q1r": 5, "q2": "Also here it is straightforward as the deliverable is clear and the proposer will publish the diagram and scripts in a public forum, such as github or a Miro board. Mentioning a few specific locations where it will be published will make auditability easier and give a better audit re how the solution will be promoted to make an impact. ", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 24, "ne": 1, "ng": 23, "nfo": 0, "vca_o": 1}], "solution": "Based on the CoinCashew SPO guilde, I intend to publish a diagram to visually document the SPO key creation process to aid understanding.", "experience": "SPO operator (ticker: SAMON). I have struggled through the SPO key creation process. 30 years software dev."}