{"id": 384782, "author": "xeeban", "title": "SPOs Supporting Community Projects", "url": "https://cardano.ideascale.com/a/dtd/384782-48088", "category": 26246, "amount": 6650, "description": "Small SPOs struggle to get delegation. Community projects and groups don't know how to run a stake pool. Let's bring these two together!", "funded": 2, "upvotes": 54649460, "downvotes": 5651752, "votes_result": 48997708, "votes_cast": 241, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to enable synergetic matching of small single pool operators who are struggling to a community project that has demonstrated its \"proof of community\". The ultimate goal is to create a Community Pool Network out of these projects and stake pools to combine delegation marketing, coordination, and ultimately to form a holocratic treasury to help support climate and SDG-related initiatives and projects. A curation process is also envisioned by establishing a peer-review mechanisms to ensure both sides are entering into high-quality partnerships that are safe and mutually beneficial", "q0r": 5, "q1": "The team is experienced and dedicated to the goal achievement. The plan is straightforward and well matched to the resources/funds requested.", "q1r": 5, "q2": "At least a few auditability criteria for such an evaluation would have been good to mention, instead of \"Suitability of participation for SPOs and projects will be audited for fairness by peers through well-documented criteria and procedures\"...", "q2r": 4, "assessor": "z_assessor_721", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem is very well-defined into 2 sub-parts with the small SPO struggle and MDP impact. The solution is really also bridged the 2 identified sub-problems into one. Thus, this is a very interesting proposal to be considered", "q0r": 5, "q1": "The CORE team is very published in LinkedIN and well experienced aggregated in the industry. They themself also are SPOs. It is interesting to notice that they were also got funded from Fund6. ", "q1r": 5, "q2": "The roadmap is clearly defined on a monthly basic and very transparent. Both OKRs and KPIs are really well-defined. Budget wise, it is appropriated with the justifcation.", "q2r": 5, "assessor": "z_assessor_782", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This sounds potential and would help SPOs so much if it can really attract delegators. Though I still have some stuff uncleared which will be stated in the next category.", "q0r": 4, "q1": "As I understand, this project will act like a trusted 3rd party to bring SPOs and NGOs together. If so, the proposers need to make sure they have the competence to resolve conflicts in case something doesn't go well between parties. \r\nI would also like to know more about the positions/duties of each team member and how you reduce the risk of appointed peer-viewers being corrupted. Another curiosity of mine is where the registry will be (in a separate place like a website room/social media or it will be integrated in the Staking Pool system so that whenever a SPO creates a pool, they'll see a choice of registry). So hopefully the proposers would dig more deeply on that.", "q1r": 4, "q2": "Roadmap and KPIs are transparent. The set of criteria and documented procedures seems like the soul of the project to me so it would be a huge milestone itself.", "q2r": 4, "assessor": "z_assessor_936", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Create a registry of interested SPOs, match them to community projects, and set up standards for reward allocation, security, and reporting.", "experience": "SPOs, Bridge Builders. We work with many community projects and know well the struggle of smaller SPOs looking for a way to thrive."}