{"id": 385189, "author": "jadjei", "title": "Mission driven and Accountable!", "url": "https://cardano.ideascale.com/a/dtd/385189-48088", "category": 26246, "amount": 15000, "description": "How can we verify mission-driven stake pools are delivering on their promises?", "funded": 1, "upvotes": 37683213, "downvotes": 11146508, "votes_result": 26536705, "votes_cast": 151, "f6_no_assessments": 13, "f6_rating": 4.282051282051282, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=4380"], "media": [], "f6_assessments": [{"q0": "I think the proposal overall meets the challenge, and I personally love the idea. I know many will point out that the donations deal in fiat and the B1G1 platform is centralized. My response to that is \"how would current mission driven stake pools fund the charities they work with currently\"? I assume they donate in fiat. Also, we in crypto love decentralization but obviously the world has a long way to go before we get there in an impactful way, and choosing a trusted third party is at least a good start. The only feedback I would add is, please include how you would provide data on total Ada staked to NGO/SDG based pools to dial in the specific challenge setting goal sited. For example, would you provide a website or other tracking implementation?", "q0r": 5, "q1": "For the amount of Ada requested, and the early goals mentioned in the road map, I believe that the project proof of concept can succeed as outlined. I would suggest that you make it more clear that this is a multiphase project, and that to completely fulfill the challenge setting goals, future proposals would need to be produced and elected. ", "q1r": 5, "q2": "I feel that more could be elaborated on for project KPI communication. For example, provide details on how catalyst voters and community members at large can keep track of development progress. Make it apparent how data and tracking will be collected and communicated about the amount of Ada staked to verified charity based pools. I think if you add a short paragraph below each bullet point in your road map it might be better understood. ", "q2r": 3, "assessor": "z_assessor_1003", "no_vca": 37, "ne": 19, "ng": 16, "nfo": 2, "vca_o": 2}, {"q0": "Author(s) have demonstrated clearly their intent to \"help ADA holders to make the right decisions when choosing a stakepool\" by providing a mechanism and \"proof the legitimacy\" and accuracy of their mission driven goal and activities. Their problem statement and propose solution is clear and concise and their execution plan detailed with well defined KPIs.", "q0r": 5, "q1": "The team already runs a stake pool and have software development skills to intergrate BIG1's api. I see a small risk factor about the robustness of BIG1's api to allow the team to fully realize their vision. Perhaps that's where zappier is meant to help but I don't see a line item for zappier subscription, will the free tier cover a meaningful pilot? The devil is in the details and I'm seeing some brittle points but given the team's three Software and systems member, I'm confident they at least achieve a viable proof of concept and intuit a more robust solution in the process. ", "q1r": 4, "q2": "KPIs via both metrics as well as time to deliver are clear and organized. The community should have no issue verifying that for example 5 mission driven SPOs has join the trial, or the number of giving impacts flowing through the system, especially with the intention to having a lot of these metric items have on-chain events and records.", "q2r": 5, "assessor": "z_assessor_336", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This project represents a terrific opportunity to grow and support mission driven SPO's that deliver what they say. The sustainable development goals are valid and the project can help achieve these goals. The team has identified a suitable path forward and overall provided an excellent proposal. ", "q0r": 5, "q1": "The team appear to have the necessary experience to implement the proposal successfully. As current SPO operator this team will have much of the required insight to confirm the target audience (mission driven SPO's) are legitimate. The plan is still unfolding but appears well thought through, may have been good to provide further examples of potential missions.  ", "q1r": 4, "q2": "Generally, I found the information provided to be excellent and allowed good understanding of what the team are trying to achieve. The KPI's are solid and achievable within the timeline provided. I would have liked to somehow 'meet' the team but have little doubt they are legit (linkedin profiles?). I agree this proposal has the information required to audit, the budget is not unreasonable and contains sufficient breakdown.    ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "In the proposal, the team lists the problem to be solved and also offers a solution. Which is great! This idea has a positive impact on the Cardano ecosystem and it is clearly explained how it will add value to the Cardano ecosystem. KPIs have been developed and presented in the proposal and match the ones indicated in the challenge. The proposal is able to scale and address future challenges without a problem.", "q0r": 4, "q1": "Proposer add links from which we can see that the company behind this idea exists but we do not have a clear insight into whether this company has the experience to deliver on the proposal. The proposal lists the number of people on the team but it might be a good idea to set up links via LinkedIn as proof of existence and to gain a more transparent insight into whether this team has the relevant skills and experience needed to implement the proposal. The budget is presented, but it would be good to specify working hours and fees in order to have a clear insight into the working hours required for the realization of this idea. If the budget were worked out more deeply, it would be clearer whether it is reasonable. Proposer elaborated the goals very well but we are lacking detailed explanation of the implementable plan, details of actionable tasks and order of execution, resources needed for implementation and technical aspects like architecture, language and technologies needed to realize this idea. The time frames within the work will be done are presented. It would be good to cover the possible risks that may arise during the implementation of this project.", "q1r": 2, "q2": "Proposer excellently presented the roadmap with milestones with clear time frames needed for the success of this project. KPIs are also super presented and make sense. The KPIs provided can be used to quantify the success of the project. The community can track the progress of the proposal without any problems.", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Accountability among mission-driven pools is very much needed! I think partnering with a specific platform such as B1G1 is a practical way to go about this. The whole phenomenon of mission driven pools will become much more powerful with automated, verifiable donations. ", "q0r": 5, "q1": "The team includes SPOs and developers already involved in other Catalyst projects.  The budget and roadmap are well described and realistic. ", "q1r": 5, "q2": "The budget is brokend down and the roadmap for this proposal ends in a closed trial with several SPOs after 2 months. The given KPIs are clearly defined and easy to measure.  ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "This proposal aims at enabling  impacts made by direct donation to projects meeting the SDGs via a seamless accountability system implemented on the Cardano blockchain. Given their collaboration with B1G1 they are implicitly targeting several UN SDGs. ", "q0r": 5, "q1": "The project is driven by veterans in the impact world which are leading the Fluid SPO and have a track record of collaboration with NGOs supporting the SDGs. The proponents have also significant and appropriate technical expertise necessary to undertake the implementation of the proposed accountability system.", "q1r": 5, "q2": "Yes - there are clear measures in place to report on the deliverables.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The project simply lays out the problem of Mission Driven SPO and how to hold them accountable and tracable the impact that the Pool Operators claimed. This not really a burning issue of the SPO instead more a purpose-driven mission and the right of the delegators to trust and see the SPO deliver promise that they stated", "q0r": 4, "q1": "The 3rd parties were just on the idea phase and dont have clear flow how to choose these parties and how to combine the on-chain when the Pool got rewards. The team FLUID7 team is very briefly shared with and teh team members are not full time. Also we dont see the team member roles clearly in the project implementation plan.", "q1r": 3, "q2": "?The key KPI and key milestones are very briefly described and the team always put under the conditon of the project got funded. One more thing, it already highlighted future funds with NFTs related stuffs, not really related to the original problem statements. Team working hours and also more team member/hiring plan are not showed here. The KPI is just non-trackable with just trial phase with 5 SPOs after receiving the funds", "q2r": 2, "assessor": "z_assessor_782", "no_vca": 14, "ne": 0, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "Although the idea is well described and the ultimate goal is clear. There seems to be a missing process description on how the accountability and on chain information will be verified. \r\n", "q0r": 3, "q1": "The timeline and plan moving forward is listed. The goals can be easily reviewed for completion. \r\nThere needs to be more indepth description on how the verification process of payment is made to registered charity and NPO ", "q1r": 3, "q2": "Given that the timeline is clear, within a 1-3 month range. And that the goals can be well tracked and verified on social media or onchain (cardano). It will be simple to audit the progress of this project. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal does indeed identify a problem within the challenge which needs to be solved. The problem and solution are both very clear and well stated. The solution of partnering with B1G1 in order to keep track of the impacts made by direct donation would surely have a positive impact on the Cardano ecosystem, helping the delegators to select the most favorable SPO for their needs. One thing that could be helpful is to explain a bit what the B1G1 is and what its mission is. Also the proposer could refer a bit more to the interaction of SPOs and the project to make it more clear to the voter. ", "q0r": 5, "q1": "The proposal seems to have great chances of being implemented successfully as the proposer gives clear view of what the budget should be and breaks down the cost into indentifiable items (software development, project management etc). When it comes to the members being a part of this project, this team has been participating in the Cardano community for a long time (with provided evidence) and seems to have the experience to make the whole idea successful. Would the proposer have referred to the risks that could appear in the meantime and how they would have dealt with them, the proposal would be more integrated. ", "q1r": 4, "q2": "The proposer gives a clear roadmap of the proposal and of the future phases that will apply, would the proposal be funded. It is not clear if the community members will be able to track the progress of the proposal. If yes, via which network? Also, the proposer may have to give more clear metrics to measure the results of the proposal. When referring to 10 SDGs represented in recipient charitable projects, be more specific as to what those 10 SDGs will actually be. Nevertheless, the solution given is understandable and it addresses the problem. ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This project would benefit the whole ecosystem. Having a way to verify that SPOs are in fact donating the money they claim to charitable organizations is good for transparency within the Cardano community *and* for charitable causes.", "q0r": 5, "q1": "Team includes detailed roadmap, team section, project plan, and website. It is also clear based upon their experience as stakepool operators that they have a clear understanding of how this process will work in practice. ", "q1r": 5, "q2": "This project outlines their project plan and their KPIs. It will be easy for the community to verify whether this team was delivered these promises.", "q2r": 5, "assessor": "z_assessor_892", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This proposal's objectives align with the challenges' well as it helps ADA holders to assure that they have chosen the right mission-driven stakepool. The transparency of charity activities will gain the trust of holders in the stakepools, and therefore, trust in the whole ecosystem. ", "q0r": 4, "q1": "Since most of the verification will be done by the trusted third party, the project seems strongly likely to be implemented. However, there is a lack of information on how the verifiable records would look like, so the proposer should provide things like examples of the records to that it would be easier for the reader to imagine the outcome (what ADA holders would see). Additionally, challenges/risks of the project haven't been seen in this proposal. That is why I would like to give this a 3 on feasibility.", "q1r": 3, "q2": "The given information on roadmap, KPIs, etc. seems like enough to be audited. There is just one part where it says \" the goal of seeing 5 mission-driven SPOs trial our solution at the beginning of April 2020.\", so did the writer happen to mistype 2020 and 2022? If so, it would be great for them to correct that.", "q2r": 4, "assessor": "z_assessor_936", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion the proposal has effectively address the SPO challenge, and address well its impact for both the SDGs and the Cardano community. Even better, the proposal approached this holistically in a simple way by creating an ecosystem linking all in one mechanism, which promises many future possibilities for a meaningful and impactful Cardano community. It also potentially drive our SPOs mechanism deeper into the impact sphere. ", "q0r": 5, "q1": "Reading through the proposal's clear & tactful problem statement, roadmap and KPIs, Fluid7's case study & testimonials, with B1G1 (very well-known in the SDG community), I trust in the team to deliver its promise in terms of technical delivery. \r\n\r\nHowever, since B1G1's presence is critical in delivering this project and its KPIs, I wish the proposer had introduced more about B1G1 and its commitment to deliver the KPIs together with the Fluid7 team. For this reason, I rate its feasibility 4. ", "q1r": 4, "q2": "The proposal has clear roadmaps and KPIs that should be sufficient for auditing its progress and success. However, as discussed, it should have been better if the commitment of B1G1 become known for assessor and voter to decide. ", "q2r": 4, "assessor": "z_assessor_953", "no_vca": 24, "ne": 5, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This project will allow mission driven SPO's globally to have more visibility to stakers from the proof of their impact through auditability.", "q0r": 5, "q1": "Detailed plan and has a clear understanding of the issues. Detailed planning shows experience and a gauge of how they likely execute this plan.", "q1r": 5, "q2": "Deliverables are well articulated and easily achievable. Has plausible roadmap but equally ambitious.", "q2r": 5, "assessor": "z_assessor_996", "no_vca": 34, "ne": 2, "ng": 16, "nfo": 16, "vca_o": 1}], "solution": "Make use of the B1G1 donation platform to tie promises to charitable projects.", "experience": "We run FLUID stake pool and by using B1G1, we have a verifiable record of impacts made by direct donation to projects meeting the SDGs"}