{"id": 381136, "author": "mark", "title": "Trust Funds by Ada", "url": "https://cardano.ideascale.com/a/dtd/381136-48088", "category": 26250, "amount": 10000, "description": "La creación de un fideicomiso es costosa y complicada. A medida que se cree riqueza en el ecosistema de la cadena de bloques, la gente necesitará formas de compartirla y gestionarla.", "funded": 0, "upvotes": 15393595, "downvotes": 20882981, "votes_result": 5489386, "votes_cast": 92, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "La creación de un fideicomiso dirigido por la comunidad a través de un contrato inteligente parece ser una muy buena aplicación de los recursos para este desafío y encaja muy bien, sobre todo porque es un contrato inteligente (mini propuesta) construido en la parte superior de la blockchain de Cardano con un presupuesto global que se ajusta al desafío. El proponente afirma que quiere perseguir el desarrollo de bloques de construcción de contratos inteligentes reutilizables - que es una gran visión para la construcción de valor y para escalar. Me gustaría elogiar al proponente por su visión de proporcionar un contrato inteligente de confianza más amplio que puede ser parametrizado por cualquier usuario de antemano, además de que pensó en la gran inclusión de permitir que los fondos en la confianza sean estacados. Además, la idea de hacerlo de código abierto es una adición aún más valiosa para el ecosistema de Cardano. Esta no es sólo una propuesta para un contrato inteligente, ya que nuestro proponente pionero de Plutus también quiere incluir una faceta educativa mediante la inclusión de sesiones de codificación transmitidas en vivo al construirlo en público. Felicito al proponente por incluir una visión de futuro en forma de trabajo futuro - que indica que la propuesta actual podría evolucionar en una contribución mucho mayor - especialmente con el apoyo propuesto para otros tokens además de Ada y la utilización de oráculos.", "q0r": 5, "q1": "Un punto débil de esta propuesta en términos de viabilidad -en general- es que la propuesta, tal y como está ahora, parece estar situada en tierra de nadie entre un borrador avanzado para una propuesta de implementación y un plan de implementación real. La propuesta, tal y como está, carece de plazos, de un desglose presupuestario con partidas claras y de enlaces específicos verificables que demuestren las afirmaciones del proponente sobre sus conocimientos de software. El proponente afirma que participó (¿qué hay de completado?) en la primera cohorte de pioneros de Plutus. Digo eso - ya que fui aceptado en la cohorte pionera Plutus 1 (pero no tuve tiempo de terminarla). Una cosa que me llamó la atención es que esta propuesta parece haber sido presentada previamente en fondos anteriores (https://cardano.ideascale.com/a/dtd/Trust-Funds-by-Ada/366848-48088) como esencialmente la misma propuesta, pero entonces tenía un arco de desarrollo de 6 meses y un presupuesto de 25000 dólares. La propuesta anterior (que probablemente no fue aprobada para su financiación) tenía un desglose del presupuesto y un calendario. Sin embargo, esta propuesta del Fondo 7 que ahora se somete a votación carece del desglose presupuestario y del calendario del proyecto. Por lo tanto, esto podría mejorarse fácilmente en un futuro fondo. No estoy seguro de que el proponente haya abordado suficientemente los retos y los riesgos, especialmente porque esta propuesta no parece haber mejorado (incluido más detalles o más explicaciones - o en general progresado hacia un plan de ejecución más específico) desde el fondo anterior, cuando no se aprobó su financiación. El proponente pidió una suma global de 10.000 dólares, pero en la partida presupuestaria de la propuesta no se ha proporcionado un desglose. Simplemente dice: \"Presupuesto tbd\" [por determinar].", "q1r": 3, "q2": "Habría sido bueno incluir un calendario, sobre todo porque se supone que estas propuestas en el reto deben realizarse en un plazo de tres meses. La inclusión de algunos hitos y un plan de implementación habría permitido la fácil auditabilidad de esta propuesta. La propuesta anterior, casi idéntica (aunque con más contenido) de agosto de 2021, tuvo mucha interacción y comentarios en Ideascale. Si esta propuesta no se aprueba esta vez, aconsejaría al proponente que incluya un anexo en el próximo fondo que incluya las preguntas de los asesores comunitarios y sus respuestas. De hecho, lo mejor sería hacer un plan de trabajo semanal o quincenal para una propuesta de esta envergadura, de modo que se puedan verificar los avances. Incluso una presentación en vídeo podría ayudar a dar vida a su visión. Por ejemplo, la idea de construir el contrato inteligente en público, incluyendo sesiones de codificación en directo y horas de oficina para discutir la dirección, será mucho más efectiva si se concreta. ¿En qué plataformas se transmitirá? ¿Con qué frecuencia? Algunos KPIs serían más que útiles. ¿Número de fondos fiduciarios creados con el contrato inteligente en los primeros 3, 6 y 12 meses? ¿Número de espectadores de las sesiones online en directo? U otros KPIs que el proponente considere relevantes. Por último, una palabra de ánimo: esta propuesta parece estar al borde del éxito con los votantes, sólo necesita varias horas más de refinamiento en un plan de acción preciso con una línea de tiempo, métricas y KPIs. Añada la experiencia verificable, añada el desglose del presupuesto y vuelva a presentarla si no tiene éxito en el Fondo 7.\n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 28, "ne": 20, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Trust funds for ADA is a great idea, however, in my opinion, the proposal does not address the challenge because the proposal does not clearly show a path to an end product useable by end users with in 90days. I would advise the team to create a detailed roadmap to show path to success in 90 days\r\n", "q0r": 1, "q1": "The leader of the team describes a good work experience but I would like to see links to LinkedIn or a github repository for validation. I would like to see the plan to success be expanded by building a detailed roadmap with milestones.", "q1r": 2, "q2": "I would like to see the team develop a simple 3month roadmap with milestones to connect the funds expenditure with the goals of the proposal. Furthermore, the I would like to see the budget broken down beyond a single line entry. I would like the team to develop KPI's to help track performance, example execute 10 test contracts by week 8", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "A template for a smart contract enforced Trust fund with mission is a novel idea. The idea needs review and a better execution plan. There is a substantial use case for this kind of model to enable contribution to the Trust which behaves in a codified manner. ", "q0r": 4, "q1": "The proposer claims sufficient experience as a Software developer and has taken on a full-time role in the Cardano ecosystem. References to his past work would have added value to the proposal. Moreover, there are critical details that are yet to be decided by the proposer. This casts some doubt on the implementability of the proposal. ", "q1r": 3, "q2": "The code is to be in an open domain however what to be built has not been laid down except the guidance to build a Trust powered by a smart contract. The requested fund can be assumed to be the compensation for the developer's time. Any clarity on these items would have made the proposal auditable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Sound like a great begining of an idea and very important area. Missing some more detailed explanations about the problem and the solution. The proposal is not detailed enough to be fully evaluated - please check the CA guide to see based on what CAs are evaluating the rporposals. https://cardanocataly.st/en/community-advisor/guide.html\n", "q0r": 2, "q1": "The Proposer seems to have the right profile and experience for the project, however more information about projects or Linkedin profile will be important. It will be great to have such a proposer be part of the community and succeed but again more info is needed in the proposal re the roadmap, deliverables KPI and budget. One suggestion is to connect with other catalyst community members and work together for next fund. ", "q1r": 3, "q2": "With missing information re deliverables and KPI and timeline it will be difficult to audit the proposal. There are good success list factors as well as having it in open source will help auditability. ", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Un contrato inteligente que implementa un Fideicomiso financiero en la Red Cardano que delega y distribuye sus tokens como usted describe.", "experience": "Participante en la cohorte 1 de Plutus. Ingeniero de software durante 8 años."}