{"id": 382830, "author": "dowdcspark", "title": "Raspberry /SPO Project", "url": "https://cardano.ideascale.com/a/dtd/382830-48088", "category": 26245, "amount": 100000, "description": "La mémoire de RaspberryPi4 est de 8 Go et une spécification d'environ 16 Go est nécessaire. Il contient des fonctionnalités inutiles et doit être optimisé davantage.", "funded": 2, "upvotes": 107774849, "downvotes": 17473912, "votes_result": 90300937, "votes_cast": 263, "f6_no_assessments": 6, "f6_rating": 3.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement is very concise and would be a very effective proposal addressing the challenge. Having a dedicated hardware piece to run a stake pool would be very useful for existing SPO's and also it might make it easy for the community to onboard new SPO's. Also, this would bring together the community to bring improvement to a dedicated piece of hardware, and build specific tools integrating to this hardware, thus creating much more business opportunities for SPO's. Would suggest to the proposer adding KPI's in the proposal.", "q0r": 4, "q1": "Proposer presents himself as an SPO and hardware engineer, which is impressive and shows enough experience and skillsets in implementing the proposal. Would have been better to add some links to the proposal showing relevant experience. The proposal has mentioned in detail the research and development process while implementing the proposal. Some points about the challenges faced in the future are missing in the proposal such as how about handling the growing size of nodes in future, or what of node's requirements goes up, then what can be done to existing hardware, will it be flexible enough? Also, the budget breakdown should have been more clearer in the proposal, since the budget is $ 100k almost about ˜45% of the challenge fund, would have been good to know the fund breakdown strategy in the proposal and it would be easy to understand for the community, how spending such amount on building a prototype is gonna be. ", "q1r": 3, "q2": "The proposal has a clear roadmap mentioned, so the final prototype would be ready by Jan 2023. The proposal could have included the KPI's so that community can understand the importance of the success of this proposal. And also would suggest adding how do you define the success of this proposal, is it by the number of new SPO's that will be attracted by this technology, or will it bring down the cost of running a pool or will it reduce the number of SPO using the cloud providers and increase decentralization in Cardano. ", "q2r": 4, "assessor": "z_assessor_208", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses SPO needs in a very significant way. The only way the ecosystem will grow is through low cost, low energy computing. \r\n\r\nIOHK and the Foundation should be contributing on this!!!", "q0r": 5, "q1": "More detail on the individual team members would be helpful. \r\n\r\n It sounds like they are off to a good start but the funds requested do not sound like enough. It is understandable that hardware development is a long and tedious process, but Rpi stakepools are already in trouble. Cardano needs this ASAP.", "q1r": 4, "q2": "It feels as though there should be more technical information in this proposal. \r\n\r\nThis may be due to a language barrier but some preliminary ideas, designs would be helpful. More KPI's or detailed information that can be expected at each stage of the roadmap would also improve auditability. \r\n\r\nThe community can be a big help for this proposal. More awareness will help push this project to where it needs to go. ", "q2r": 4, "assessor": "z_assessor_252", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This proposal's background is very great. Adjusting the current hardware specification needed for everyone who wants to be an SPO to achieve more decentralization. The impact is very positive for the overall ecosystem.", "q0r": 5, "q1": "The proposer doesn't include members' detailed information such as LinkedIn profile, website, etc. It's an important piece of information to assess the team's capability. The budget plan and time frame also need more detailed information on the development cost and monthly progress. Lastly, who will be holding this product patent later on? Or will it belong to the Cardano community for free?", "q1r": 3, "q2": "From the audit perspective, this proposal doesn't mention any communication channels. Except, one or two of the proposers will keep updating the community regularly in order to make sure the milestones are achieved and the deliveries are on time.", "q2r": 3, "assessor": "z_assessor_647", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Modifying or replicating the raspberry pi to have 16GB ram would make pool operation more affordable. However intel based SBCs (for example AAEON) already exist which are more future proof and comparably efficient (but at a higher price point). Im curious if the cost of a reengineered Pi would still be affordable? There are many other impediments to the viability of SPO businesses besides hardware cost and power. Considering the funds requested are very large,  I do not think this would be a wise use of funds.", "q0r": 2, "q1": "Even though the proposal says the project is already in progress, there is a lack of technical details to support this. It is also unclear if the specialized Pi hardware would be affordable relative to existing intel single board computers (for example AAEON SBCs)", "q1r": 2, "q2": "The roadmap includes some very broad goals but no technical discussion. no KPIs or metrics for success are provided. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The project proposes the idea to optimise the raspberry pi hardware  device specifically to run a Cardano stake pool. This is a new business model built around the design of custom hardware for SPO's.  i could see this scaling as SPO needs change.", "q0r": 5, "q1": "Some small SPO's are retiring because they are not able to cover the costs of running a pool. If they can make this custom hardware a SPO would be able to cover costs just from producing one block a year.  The team is made up of the DCsparks community manager in Japan, an SPO and  hardware software engineers. The team plans to have the board complete by Jan 23. the budget is to pay 4 deveopers for one years work to complete this. It would be good if look at some risks involved. Especially with a project of this size.", "q1r": 4, "q2": "It is unclear if there is a way the community could audit this project.  A blog or website documenting your the would help with this. There are no KPIs mapped out and quite a loose roadmap. Although i think the outcome is pretty clear. \r\nIt would be good to expand on the path of development to make sure you can reach your targets.", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The project aims to overcome the current hardware expenditure on SPO with a cheaper solution using a small box of hardware cool Raspberry wish to accommodate with, with Linux as a primary operating system to run on it. Suppose the project is run after one year as the prototype and requested $100,000. I believe it would deliver an enormous positive impact on the SPO community. This can see the solution as an alternative to current dominated Google, AWS or AZURE clouds.", "q0r": 4, "q1": "There are three significant obstacle risks that I believe the team should work on these risks. First, in your case in Japan, I believe the Internet connection to the Raspberry boxes is at high bandwidth. The second is the local power supply would be reliable enough. However, the team should consider that all the developing countries with the power infrastructure are not as reliable as Japan. This brings to the Internet infrastructure also not being reliable. Therefore, if the system is not connected to the blockchain network for too long, would this be brought to issue with each epoch block issue. And the final risk that is the total challenge allocation is $250,000, and the team request 40% of the total fund. 30 proposals are competing in this challenge alone. I suggest the team subdivided the total fund since the entire fund was asking for $100,000 and run for one year. The team may have asked for $25,000 for the first three months and detail of action in 3 months and can be applied for the race or even 50,000 for the next coming fund rounds, and I believe that would be more feasible.", "q1r": 3, "q2": "A very brief for the first three months and entirely one year of deliverable work breakdown structure provided. Thus, this would give the current Fund 7 challenge team difficulty to audit and monitor, and the community follow your work in progress.", "q2r": 2, "assessor": "z_assessor_726", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Nous développerons du matériel dédié aux exploitants de piscines à piquage qui peut être alimenté par une petite puissance écologique telle qu'un RaspberryPi4 amélioré.", "experience": "・dcSpark Japan community manager\n・SPO\n・Ingénieur matériel : Développeur de cartes uniques embarquées\n・Ingénieur logiciel : Développeur Blockchain"}