{"id": 383488, "author": "dcspark", "title": "Milkomeda SPO validator training", "url": "https://cardano.ideascale.com/a/dtd/383488-48088", "category": 26245, "amount": 10000, "description": "Milkomeda nécessite un ensemble distribué de validateurs pour obtenir une décentralisation suffisante.", "funded": 2, "upvotes": 90159196, "downvotes": 22154368, "votes_result": 68004828, "votes_cast": 310, "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Stakepool est probablement le cœur de Cardano. C'est aussi l'une des principales parties prenantes de l'écosystème, si ce n'est la plus importante.  Plus ils auront de moyens de subsistance, mieux ce sera pour la communauté Cardano dans son ensemble. La sidechain de Cardano doit idéalement être aussi décentralisée que la chaîne principale. Avec toutes les nouvelles incitations au jalonnement (token, NFTs airdrop, etc.) que nous avons eues ces derniers mois sous la forme d'ISPO, de nombreux pools plus petits et moins populaires luttent pour maintenir leurs ADAs délégués. Prendre part à la gestion de la sidechain de Cardano sera probablement la réponse dont ils ont besoin pour conserver leur loyauté envers notre blockchain tout en remplissant les objectifs de toutes les parties impliquées avec des incitations. Par conséquent, je suis d'accord que nous devons mettre plus de ressources dans ce sujet en général et cette proposition sera un excellent début.", "q0r": 5, "q1": "Les connaissances, les compétences et l'expérience combinées de l'équipe dcSpark parleront probablement d'elles-mêmes. Cependant, je ne peux nier que certains détails manquent encore. Peut-être que nous pouvons commencer par savoir plus de choses telles que l'évaluation du nombre de SPOs intéressés par la perspective, les qualifications des SPOs, les paramètres de pool requis, etc.  Avec la sortie imminente de la version bêta du réseau principal de Milkomeda, on peut dire que la proposition sera livrée rapidement et en accord avec le calendrier de développement de la blockchain.", "q1r": 4, "q2": "Bien qu'il manque toujours la mention de paramètres pour mesurer avec précision le résultat de la mise en œuvre de cette proposition, je pense que cela peut être compris et facilement prouvé plus tard lorsque les choses mentionnées dans la section Faisabilité sont mises en œuvre. Cependant, il serait plus agréable d'avoir un résumé de la proposition. Le Github de Milkomeda lui-même est assez cool pour indiquer la qualité du travail que l'équipe produira. Espérons que dans les semaines à venir, nous pourrons voir plus d'annonces positives sous forme de bêta en direct.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Connecting Cardano to EVM is a great solution to scale and connect Cardano with other blockchain platforms, especially Ethereum. But I really haven't seen a specific plan, roadmap or a specific description of the product of the proposal, so I still don't really know how the product will be implemented and what the specific solution is. . Although the proposal wants to be funded to audit the project, the proposer also needs to be more specific about the product", "q0r": 2, "q1": "\"Proposer said their Team is composed of well known ex-Emurgo and ex-IOHK employees who have been building the Cardano ecosystem for the past several years but no evidence provided of team's experience and size of the team. Providing profile links, github pages or links to past projects your team worked on will boost voter confidence in your capabilities in making this project a reality. \r\nIn addition, a specific description of the project's product and roadmap is indispensable to know the feasibility of the proposal.\"", "q1r": 1, "q2": "\"There is no specific product description, no roadmap, No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project.\r\n\r\nProposer said they plan to start the audit as soon as possible. They will release the final audit report to the community once we have addressed any issues found. But we don't even know what their product is\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposer is clear with their objectives to support their current running project. Above all, this training is for stake pool operators, an important role in the Cardano ecosystem. With decentralization in mind, this proposal will have a positive impact that supports the Cardano development.  ", "q0r": 5, "q1": "Success likelihood is very high considering the proposer is also the developer behind the Milkomeda. But, the proposal doesn't mention the training schedules, modules, and the detailed budget plan breakdown. How many stake pool operators are eligible for the subsequent training sessions? If the stake pool operators are not selected for the validation process, are they still considered members of Milkomeda DAO? Otherwise, it will have risks of becoming a centralized sidechain. ", "q1r": 3, "q2": "Although the proposal has its official website, it should have other social media channels to update the training progress or documentation. It should be announced as well in the dcSpark social media channels. And, of course, training milestones and amount of stake pool operators joined should be announced too. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposer outlines the task of providing documentation and training to stake pool operators to make it easier for them to learn about and run a Milkomeda validator. The Milkomedia sidechain brings EVM support to the Cardano blockchain. As the ROI of ADA decreases for staking rewards over time as less inflation is offered by the protocol SPOs will need to have more income from other sources such as transaction fees or other validators and nodes. The Milkomeda validator node provides on of these business opportunities for SPOs and making it easy to learn and start using those validators presents an impactful opportunity and business model that can help the ecosystem.", "q0r": 5, "q1": "The proposal team have a history working within IOG and Emurgo. The team now operators their own company dcSpark and have completed a number of Catalyst proposal that have shown they can execute the proposals they get funded for. The proposal team created the Milkomeda sidechain so are naturally also the right people to train others to start running the validator nodes required by the sidechain to operate.\r\n\r\nIdeally the proposal team would have broken down the budget more and given a better itemised list of exactly what the documentation would include and how they are training the SPOs in december.", "q1r": 4, "q2": "The proposal team gave an outline of starting work in December training the validators. No success objectives or KPIs were provided. It would have been good to understand what a successfully trained validator would look like. Perhaps they have covered some specific amount of content or have demonstrated a certain understanding. Or potentially it could be looking at the metrics for their validator and that they meet the thresholds for what would be considered a node that is being run correctly. The plan has clarity however some more information here would have made it easier for advisors to know how this will be audited when providing evidence of the impact the proposal has had.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 8, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Nous prévoyons d'écrire de la documentation pour aider tout groupement d'intérêt qui souhaite devenir un validateur de Milkomeda et également aider les validateurs à répondre à leurs questions.", "experience": "Notre équipe est composée d'anciens employés d'Emurgo et d'IHK bien connus qui ont construit l'écosystème Cardano au cours des dernières années."}