{"id": 383848, "author": "everstake", "title": "Cardanomonitor", "url": "https://cardano.ideascale.com/a/dtd/383848-48088", "category": 26245, "amount": 25880, "description": "Au fur et à mesure que l'écosystème Cardano et le rôle du SPO se développent, il est nécessaire de mettre en place de nouvelles infrastructures et de nouveaux services.", "funded": 1, "upvotes": 49200123, "downvotes": 19852143, "votes_result": 29347980, "votes_cast": 129, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal mentions providin a open-source analytics platform for Cardano blockchain targeting the problem statement to have a provision for new infrastructure and services in correspondence with rapidly growing ecosystem and SPO roles. The proposal contains details about the milestones and plans to create an open source analytics platfor similar to the cosmoscan mentioned in the proposal, which would effectively address the issue", "q0r": 4, "q1": "The team \"Everstake\" has mentioned in possession of a team of experienced developers, financial experts and people interested in blockchain domain with multiple projects running successfully running on multiple blockchains and have successfully onboarded customers for the same, so with the relevant prior experience on a similar work the proposal is likely to be implemented successfully", "q1r": 4, "q2": "There a details provided regarding well segregated phases and milestones includign the developer teams for the same. There is detailed timeline and also details on fund breakdown for the func amount requested, they have also mentioned the success metrics which will be sufficient for auditing the progress of the project ", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 18, "ne": 6, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The proposal's problem statement states there's a need for new infrastructure and services, but the problem statement could have been more precise and could have included more description of what exactly is missing for the SPO's in the current ecosystem and how the existing systems will not be sufficient as SPO role grows? Or is this an alternate solution with the existing solutions? And more importantly, the proposal should have included how this will help the existing SPO's or attract new SPO's to Cardano so that it would be shown the relevance of the proposal with the goals of the current challenge. Would suggest emphasizing how the problem belongs to the current challenge and how the proposal aligns with the goals of the current challenge in future proposals.", "q0r": 1, "q1": "The proposal shows the relevant experience of developing such solutions in other blockchains which is great to have in Cardano. But the proposal could have also mentioned what would be planned to develop this solution in Cardano, a few technical details, architecture diagrams. Some technicalities missing in the proposal such as from where the data will obtain, will it use services such as Blockfrost, or develop its own backend? if so then which languages will be used, including all these details would have made the proposal look much stronger. Since its an analytics platform, once the user traffic grows, what is the plan to cover the infrastructure costs? Looking forward for future proposals with all these details.", "q1r": 2, "q2": "The proposal has clear timelines, deliverables are divided into milestones. And time horizon provided in the proposal is realistic and achievable. However, the KPI's provided in the proposal doesn't mention how the successful implementation of the solution can attract more SPO's or benefit the existing operators.", "q2r": 3, "assessor": "z_assessor_208", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "It would be nice to see what a user can actually do with those metrics. But overall, it is a good idea to have these metrics somewhere :)\r\n\r\nBut assuming that the cardanomonitor will provide data analysis, it can serve as a source for business intelligence. The more is data presented clearly, the better we can work with them. Visting proposers webpages, I find these data well organized and readable.\r\n\r\nI find this proposal in accordance with the challenge fund.\r\n\r\nRating given 4.", "q0r": 4, "q1": "Based on the information in the proposal, and visting working products (websites where are displayed metrics for other currencies), I am strongly convinced that they can deliver and implement the final product.\r\n\r\nAt the same time, the experience and skill described is relevant and suitable in regard to the proposal. \r\n\r\nAlso, the roadmap is posted in close detail in indicating that they know what they are doing, along with the working websites where we can check stats regarding other projects - Rating given 5.", "q1r": 5, "q2": "Audit of the proposal can be performed based on the stated KPIs which will be accessible from google analytics. I find these suitable.\r\n\r\nAuditing the progress can be performed based on the stated roadmap, but I am missing a timeline when they plan to finish individual subtasks, so we could check how it is progressing. The total hours and budget are nice, but it does not provide information on when the subtask is supposed to be done.\r\n\r\nRating given 4.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}], "solution": "Cardanomonitor sera une plateforme d'analyse open-source pour la blockchain Cardano, axée sur le commerce et dotée de nouvelles fonctionnalités.", "experience": "Everstake est une équipe de développeurs expérimentés, d'experts financiers et de passionnés de blockchain, avec une présence active dans plus de 50 blockchains."}