{"id": 384528, "author": "danbonfil", "title": "Cardano DID Community SPO", "url": "https://cardano.ideascale.com/a/dtd/384528-48088", "category": 26245, "amount": 9500, "description": "Les technologies SSI/DDI vont commencer à devenir plus pertinentes dans Cardano, mais il n'y a pas de pool d'enjeux orienté vers ce segment.", "funded": 1, "upvotes": 51509812, "downvotes": 4857058, "votes_result": 46652754, "votes_cast": 146, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Le proposant est dans un domaine lié à l'université au moment de la rédaction du présent document. Il a demandé 9500 $ pour mettre en place un SPO autonome, et l'objectif initial est de créer un revenu pour soutenir ses recherches et promouvoir l'écosystème Cardano. Il s'agit d'une solution pratique pour ceux qui ont besoin d'un revenu stable ; cependant, l'inconvénient de cette approche serait les délégataires. Vous avez un nouveau bloc qui nécessite un certain nombre d'utilisateurs délégués et certaines transactions entrantes et sortantes tous les cinq jours ou une époque. L'orientation proposée aiderait davantage les chercheurs et le personnel universitaire qui souhaitent gérer leur propre SPO à créer un flux de revenus réguliers et à avoir plus de temps pour promouvoir l'écosystème Cardano et la blockchain.", "q0r": 5, "q1": "Le proposant devrait préciser comment vous allez utiliser 5000 $ pour le marketing et la publicité, car cela représente presque plus de la moitié du fonds demandé. Je pense donc que vous devriez fournir des détails précis sur la manière dont vous allez utiliser ces 50 % du fonds, en précisant que vous allez travailler avec des partenaires. Il n'y a pas beaucoup d'informations sur la façon dont vous allez travailler avec vos partenaires et comment le partenaire va partager ou être payé ou même payer pour vous dans votre plan de travail du projet à long terme.", "q1r": 3, "q2": "Extrait de la proposition \"A quoi ressemble le succès ? Si nous sommes financés, nous travaillerons avec nos partenaires pour créer une approche accessible et standardisée permettant à toute communauté d'utiliser les technologies SSI/DID\" et \"Sensibiliser aux avantages\". L'intention est claire. Cependant, la structure de répartition du travail (SRT) devrait être plus précise afin que l'équipe du Fonds 7 puisse facilement suivre votre parcours et faire un rapport au Project Catalyst, ainsi que le détail de la façon dont la communauté verra votre travail en cours.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\nYou are right, a further explanation of partnership collaboration and a work breakdown structure will help support the proposal.\nI will work my best to include this points for the better understanding of CAs and voters.\n\nBest,\nDaniel Bonfil"}, {"q0": "This proposal is a great and complex implementation that could improve adoption and usability on cardano blockchain for SPOs and delegators, because SPO business model revenue is a huge pain on Cardano blockchain. The proposal allow to maximize the decentralization and the sustainable commercial success of newly created (late-coming) Cardano stake pools.\nAs a SPO I think that any Cardano SPOs sees value on this proposal.\nAt the same time the statement of how problem is to be solved is well being specified with implementation and with revenue model, definition of success that support economic model.", "q0r": 5, "q1": "The proposer is very well skilled about the whole context (DID and ATALA Prism pioneer) and, knows the Cardano community well because he work in the DID community.\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).\nIn my opinion (I’m 20 years experienced senior information manager on financial sectors) the budget requested is coherent with the elapsed (< 10k$).", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, with  KPI metrics that are shown. It’s good that is that the proposer has briefly mentioned possible difficulties and how to deal with them (e.g. competitors, delay,…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge.\nFurthermore the proposer has very well mentioned possible difficulties and how to deal with them (e.g. difficulties in market adoption, revenue model for cardano ecosystem and SPOs.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 29, "ne": 6, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The proposal would have a huge impact as it would leverage the use of DID's. With it's successful implementation, we could see a ripple effect in its use within the Cardano ecosystem and wider society.", "q0r": 5, "q1": "The proposer has the requisite experience as does his team. This is supported by the fact that they were Atala Prism program pioneers. A budget and a quarterly plan has been provided but a detailed breakdown would help. ", "q1r": 4, "q2": "While KPI's and success indicators are provided, it would be prudent for the proposer to consider any risk factors that may arise and provide the same. ", "q2r": 4, "assessor": "z_assessor_410", "no_vca": 26, "ne": 0, "ng": 17, "nfo": 9, "vca_o": 1}], "solution": "Créer un pool d'acteurs permettant la promotion et l'adoption des technologies SSI/DID en plus des implémentations verticales des entreprises.", "experience": "Msc Economics axé sur la finance quantitative, les incitations et la blockchain.\nJanvier 2022 : doctorat en gestion axé sur la politique communautaire."}