{"id": 384860, "author": "ampercy", "title": "SPO Training Lab in Uganda", "url": "https://cardano.ideascale.com/a/dtd/384860-48088", "category": 26245, "amount": 10700, "description": "Le manque de fiabilité de l'infrastructure et le coût élevé de la mise en place d'un réseau de test Cardano robuste dans les pays en développement pour les aspirants OSP et les développeurs.", "funded": 1, "upvotes": 57701432, "downvotes": 5258985, "votes_result": 52442447, "votes_cast": 175, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Their proposal to provide educational and hands-on experience for potential stake pool operators creates a business in itsels, but also helps gives to tools necessary for new SPOs to create businesses as well.", "q0r": 5, "q1": "They have a team with technical experience, teaching experience, as well as a member rooted in Africa to help target their specific market. The plan goes into detail with their KPI's as well as a roadmap that is thought out. The time put into the proposal gives confidence in this proposal being successfully implemented.", "q1r": 5, "q2": "They provide detailed KPI's, a roadmap, and metrics to measure success giving us proper details to audit the progress and success of this proposal. We have a budget and a timeline to reference when auditing the progress and success.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "In Cardano, SPOs (Stake Pool Operator) is a crucial part to ensure decentralization of the network. However, there's a relatively high cost to become a stake pool operator in developing country, and this proposal starts with helping the aspiring SPOs and developer in Uganda. This proposal can articulate how their solution will add value to the Cardano ecosystem, which is to train more aspiring SPOs to join the Cardano network. By creating this training and workshop, it also create a new SPOs business model and add value to the SPO ecosystem. ", "q0r": 5, "q1": "This proposal provide linkedin profile, and have proven their team have the experience needed in their respective field (The IT admin system administrator, and the technical software engineering experience). The budgets are laid out clearly and in detail, from the rent cost (since this is a computer lab in Uganda), ISP cost, the furniture and computer, salary for the staff, etc. This shows their seriousness for this project, and proven their capability to identify what resource needed to make this project a success. This proposal also provides a sensible and conductible plan, and explained in details how to realize that plan. This proposal also manage to identify the problem and risks regarding this plan, such as internet interruptions, more than expected interest from people, and reaching out people. Overall, this proposal have a chance of success considering the team experience, budgeting details, roadmaps and plans. ", "q1r": 5, "q2": "There are clear roadmap for the next 12 months, although not in monthly basis, but managed to explain it in understandable manner. Since this is in Uganda (the computer lab), it will be rather difficult to audit the progress perfectly, so expect some inconvenience within the audit process. Overall, all of auditability from metrics and KPIs are well explained. A shy away from 5 stars because it could be better in term of roadmaps details, that it would be better if they have a clear details for the 1-3 months, separate it from the 3-6 months target.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I read the challenge brief as improving the economic incentives for SPOs more than training new SPOs. The SPO space is already rather crowded and difficult to compete in. Training new SPOs will have limited impact if those SPOs lack the pledge or delegation to mint blocks. Running a pool IS a good way to teach linux and system administration skills but I don't think this fits the brief. If 5 out of 10 learners start stake pools, how many will be economically sustainable?", "q0r": 3, "q1": "With the budget of the proposal and experience of the team, I believe a workshop could be established and run for a few months, but I'm not sure the ROI would justify the investment. Rasperry Pis will work on testnet but are not future-proof due to insufficient RAM. ", "q1r": 3, "q2": "The proposers do address auditability and define some clear goals. Some of these goals, such as promotion of ATALA prism, are not mentioned in the rest of the proposal and not related to stake pool operation. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Création d'un espace de laboratoire informatique permettant d'acquérir des connaissances pratiques sur la manière de mettre en place, de gérer et d'entretenir un pool de pieux Cardano.", "experience": "Professionnels de l'informatique et des logiciels basés en Ouganda et au Canada, ayant l'expérience de la gestion d'entreprises et de la facilitation de la formation technique en Ouganda."}