{"id": 414045, "author": "lpmaho", "title": "CDA DeFi Education", "url": "https://cardano.ideascale.com/a/dtd/414045-48088", "category": 26593, "amount": 50000, "description": "Cardano's eUTXO ledger is robust but its unique architecture implies a steep learning curve. DeFi participants require educational resources to see how Cardano can work for them over other chains.", "f6_no_assessments": 30, "f6_rating": 4.300000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 11747, "q0": "The idea of CDA DeFi Education aligns with the goal of the challenge “The Great Migration (from Ethereum)”. The authors propose the establishment of an easily accessible document repository operated by the Cardano DeFi Alliance (CDA). Cardano DeFi Alliance (CDA) was founded in 2021, by a consortium of DeFi developers, infrastructure providers, and software development organizations Plutus CDA. Memberships are open and currently include: Ardana, Charli3, Coti ErgoDex, Genius Yield, GeroWallet, Indigo, Liqwid, MetaDex, Minswap, MLabs, Muesliswap Optim, Sundaeswap and VyFinance. The purpose of CDA is to communicate, educate and innovate, leveraging the strengths of the Cardano blockchain to create a dynamic DeFi ecosystem. So who can access CDA DeFi Education resources under this proposal? The team argues, dApp builders and users on the Ethereum/Etheruem Virtual Machine (EVM) blockchain, as well as those in the Cardano ecosystem. They can use “technical tutorials, how-to videos, educational articles, and how-tos that will ensure that new entrants fully understand the benefits, use cases, and even the basics Cardano's oddities\". This resource will include 4 media types: videos, articles, simple explanatory animations, and Twitter Spaces. The idea of building CDA DeFi Education is to make it easier for new developers to access Cardano when moving from Ethereum. For me personally, this is an interesting idea. However, there are some points that I suggest the authors need to clarify. For example, how will they attract members to contribute knowledge to CDA DeFi Education, and how often will their knowledge be updated? Similarly, how is the operation of the CDA Alliance's resource pool? Is there a decentralized access to this resource? The aim is to ensure that best practices are maintained across the Cardano ecosystem as new participants migrate from the EVM chain. However, I wonder, at the beginning stage, will the resource pool only be contributed by the author group, or will it be shared by other DeFi leaders, who are experienced Plutus/Haskell developers building products on Cardano. This greatly affects the quantity and quality of resources, also related to the level of resolution required of the challenge. Of course, I personally believe that, if this idea is approved by the community, building Cardano's resource pool is a legitimate and welcome endeavor. This is exactly what the community wants for our Cardano ecosystem to constantly grow. I rate the impact of the proposal 4 points, however I have deducted -1 point due to some of the things that have not been clarified above.", "q0r": 4, "q1": "Regarding the project progress, the information provided is concise and clear. The team is expected to complete in 12 months, including 3 phases (3/6/12 months): to prepare, document and complete the documents in the data warehouse. The budget of the proposal was calculated by the authors based on a total of 625 hours, broken down by categories (writing articles, editing videos, etc.). However, there is no hourly unit price for each different work item. For example, how much is the unit price of a professional article writing service $/hour, what is the unit price of professional video editing, etc. This is difficult for the community to assess the reasonableness of the budget. The team also did not mention, for the community's contributions to the CDA Alliance's resources, are paid or non-profit. Although here, I see there is a category that pays for the development of documents. Regarding the team, I went to the team website that provides https://cardanodefilliance.org. According to the website's link to medium @cardano_defi_alliance, and CDA's twitter, the Alliance has also been up and running since December 2021. Information about individuals in the team, qualification records and capacity experience is complete and clear. My rating on the feasibility of the proposal is 4 points, minus -1 point because the budget is not clear.", "q1r": 4, "q2": "Regarding auditability, I found the proposal lacking specific metrics by which the community could measure the success. Although, the community can update videos, knowledge sharing articles posted on the CDA website and Twitter Spaces. However, each stage (3/6/12 months), the group should have specific achievement targets. For example, after 3 months of how many videos, the article shares knowledge about smart contract design on Cardano, protocol security, and off-chain infrastructure. How many views and followers of these articles and videos? How does the index measured month-by-month/quarterly grow? I suggest the authors should have a shared demo for the community to evaluate before deciding to vote for this proposal or not. Therefore, I see that the proposal is auditable but needs to add the specific metrics mentioned above. My score in this section is 4 points. I deducted -1 point for missing KPIs as mentioned.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 203, "q0": "Yes, definitely. It squarely tackles the challenge, and does so in a very effective manner. \nOne of the things that gives legitimacy to this proposal is the amount of work already done in this avenue, like the Plutonomicon which is extremely useful, and further their explanation on how they intend to fulfill the role as DeFi educators. \nThe fact is that the growth of the ecosystem, and of crypto in general, is thinly balanced at this point, and it runs the risk of dying of success: i.e. if not enough devs are trained properly, with good methodology and security practices in mind, we could face a scarcity of professionals that could render the space slow to deliver. The proposer senses this and advocates for a well rounded education towards a healthy grow of the ecosystem.", "q0r": 5, "q1": "Yes. The Cadrano DeFi Alliance is a collective of individuals and organizations that aspire to effectively divulge best practices and methods throughout the ecosystem. It is a much needed endevor, and the DeFi meeting in Barcelona proved that there is a lot of appetite for a structured approach to DeFi within Cardano.\nThe reality is that the ecosystem is quite complicated as it is now, and it is only going to get more so. The proposers address an effective way to improve training for devs on highly technical aspects; a much needed solution if Cardano wants to keep growing.", "q1r": 5, "q2": "Yes. They propose a series of educational material that complements the Plutus Pioneers program. \nFor those who have not been through it, it is a very demanding course, and additional material is required even for the most motivated of developers. Hence, the need to complement the material, and that is easily auditable.\nOn top of posting new materials, the proposers will conduct q&a sessions, re-post material and, indeed, are reliant on the community providing feedback in order to provide whatever content is asked for within the scope of their project.\nIt is easily auditable, and it basis its evolution and the ever improving quantity and quality of their content on being audited.", "q2r": 4, "assessor": "z_assessor_2060", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"id": 11471, "q0": "Many recent incidents have raised concerns about the security of EVM blockchains, as well as high transaction fees and conflicts of interest on the Ethereum blockchain.The developers have a better understanding of the Cardano blockchain, but they don't know where to begin and how to proceed.\nIf this proposal is implemented, it will be a necessary addition to the Plutus Pioneer Program to provide accurate information, clear direction, and answers to questions for developers of other blockchains as well as new users. Make the blockchain easy to use and move.\nBecause the risk from external factors is very low, and the solution is appropriate for the challenge, I award this section 5 points.", "q0r": 5, "q1": "The team includes members with many years of experience developing large Defi projects, as well as two well-defined core people who have made numerous contributions to the Cardano block chain, which aid in improving the training quality and reliability of this proposal. Along with focusing the budget on professionally edited articles and videos, I believe this creates a clear framework of knowledge that other blockchain developers can easily adopt.\nHowever, it would be preferable if the team established clear timelines for marketing and advertising.The team should specify how many articles and videos will be published and for how long. This is to create community commitment to ensure the quality and sustainability of the proposal, as well as to provide the community with an additional indicator that can track the proposal's success.\nGiven the team's experience, I have no doubt about the proposal's success, but I wanted a little more clarity, so I rate this section 4 points.", "q1r": 4, "q2": "According to the plan, I can understand the group's activities and easily verify these activities on Twitter cyberspace. With the team's Plutus/Haskell developers' experience and credibility, I believe post-implementation metrics will provide a good indication of the proposal's success.\nBut I'm curious about a specific number in the measures, particularly the index of developing member projects; this number aids in determining the proposal's minimum effectiveness. What is the percentage of responses to community questions?. This will increase the team's work accountability in putting this proposal into action.\nIt is possible that the team is unaware of the results they are receiving. But, in terms of transparency, I need more specific numbers. So I give this section 4 points.", "q2r": 4, "assessor": "z_assessor_3250", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11431, "q0": "The proposer has the idea of establishing an educational campaign - The Cardano DeFi Alliance (CDA), led by top-tier DeFi teams, for guiding and educating onboarding developers and users to understand, develop and migrate from Ethereum to the Cardano space and more. I think, this is not very new but practical idea in the field of Cardano education which could bring positive impact for community. The team will give technical guidelines, video tutorials, educational articles, how-tos which will ensure that neww participants fully understand the benefits, use-cases and finally accelerate \"The Great Migration\". However, My concern is that how the team could ensure the quality and regular release of the educational content, and I would like them to give more detail about strategy for increasing the community engagement. ", "q0r": 4, "q1": "I think this feasiablity part is rather superficial. I know very little about their roadmap, budget and the team members. Regarding the plan, some activitites are listed for 3 months, 6 months and 12 months but it is hard for me to understand their overal goals in each period and follow their roadmap as each step is very confusing and not clearly explain. Therefore, I can not imagine what will they do first and next for carrying out this project. For example, in the first 3 months, they will: organize content schedule via input from CDA members. Delegate writing responsibilities and begin publishing. Source a video editor. However, I'm not sure who in CDA will be in charge of writing content? Which exactly content will they focus on first? Where will they publish their content? which makes me confused about provide information. In term of the budget, it has the basic information about how much per hours, and the total hours for each task and total required budget. However, I want the proposer to explain a little more about marketing's expense, how much will be spent for each dissemination strategy? Finally, when it comes to the team, the same thing happens, lack of details. Who is the main content writer? who will be in charge of video production? and more. I would like to know a little about their name, education background, previous experience, and most importantly how they relates to the Cardano ecosystem and if possible, their Linkedin and proof of work. This will help community to evaluate the feasiablity of this project. After all, there are basic information but it is not detailed enough for me. ", "q1r": 3, "q2": "Well, I agree with the proposer about some basic ways of tracking the progress of the project: the number of views, comments, growth in Twitter engagement, users, and projects,..However these indicators are not convincing enough as I expect them to have targeted goals about the number of qualified content or articles published? the exact number of how often will they publish a new content? (daily, weekly or monthly). Because to attract and retain community interest in the first place, the quality of content need to be good and useful for new developers or members who want to find out about Cardano. After all, I support their idea but a better preparation and effort are need from the team.  ", "q2r": 3, "assessor": "z_assessor_3246", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11229, "q0": "The proposal indeed effectively addresses the challenges. As the primary focus is to educate the general public about the Cardano ecosystem and onboarding people from other blockchains through the means of articles complimented with infographics, professional videos, consistent Twitter Spaces, and some simple explainer animations. They provide a large and vast form of educational contents, which should be adequate for the individuals that want to be educated. In addition, the team is very knowledgable in regards to the Cardano Ecosystem thus the meat of the content should not be an issue.  \n\nThe one difficulty would be their outreach. Will they be able to reach people outside of the Cardano Ecosystem? If so how many of them can the team reach. With the expertise of the team, it is likely they would produce great content for the viewers. However, it is crucial for them to reach a large audience, or else the onboarding would be more challenging. Having a discord channel with regular updates will help and the aid of having Q&As with some well know individuals in the crypto space will help them sufficiently. ", "q0r": 5, "q1": "The team consists of project leaders that are well-known in the Cardano Ecosystem. They have people from; Ardana, Charli3, Coti ErgoDex, Genius Yield, GeroWallet, Indigo, Liqwid, MetaDex, Minswap, MLabs, Muesliswap, Optim, Sundaeswap, and VyFinance. The core team consists of Hari Amoor and Ben Hart, these two are very capable individuals who are part of the MLabs team. This is one formidable team with a lot of experience, knowledge, and understanding of the Cardano Blockchain. What they are doing is something they are well equipped with and their team and insights truly give out confidence. \n\n", "q1r": 5, "q2": "The team has listed various means to audit the progress of the proposal. One of which is the \"The Great Migration (From Ethereum)\". If their goal is reached there will be an influx of proposals for the aforementioned category. Furthermore, the team listed community engagements, which is indeed a useful means to assess the progress. From views, likes, and comments on their articles, growth on Twitter, growth in new users in Cardano, and the influx of new projects in the space, the number of people tuning in for the Twitter Space and Q,&As and last but not least the community feedback for their content. \n\nAs for the success, the team listed seeing their content being part of the evergreen onboarding documents for developers and general users of the Cardano Ecosystem. In addition, having their channel easily discovered by new users. I believe these are adequate to assess the success of the proposal. However, I would add a Discord platform where the team can chat directly and post regularly too. A good amount of crypto enthuses utilize Discord. Seeing the number of individuals and the interaction there, would also be a useful means to assess the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_3233", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 10872, "q0": "Cardano despite having better features and technology than many of its EVM competitors has a higher learning curve. For now there are few resources to help fill this gap. The CDA is proposing an educational campaign to help developers and users understand the benefits and quirks of Cardano. The campaign will include articles, videos, and Twitter Spaces broadcasts.\n\nThe purpose of the proposal is not fully aligned with the campaign guidelines: \"Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily.\" However, it can help many projects to make this transition.", "q0r": 4, "q1": "The team behind this proposal is highly qualified to carry it out and it is possible to check their contributions on github. In addition, CDA has the support of many of the big defi projects in cardano.\n\nThe proposal presents a one-year action plan. This plan is rather simplified, and a more detailed explanation of the plan is missing.\n\nThe total budget for the proposal is $50,000. The breakdown of the project is done on an hourly basis, I understand that the hourly cost is split equally. I would like to see a better explanation of this. It would also be good to consider what happens if the proposal development time is extended in some areas.", "q1r": 4, "q2": "The proposal proposes to use metrics based on the engagement of publications and social networks to follow the development of the project. Some of these metrics are easily accessible but others are complicated and there is no explanation of how they will be taken. It would be good to explain how the number of active users will be measured in Cardano.", "q2r": 4, "assessor": "z_assessor_3205", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 10466, "q0": "   - \"It can be said that at present, Cardano technology is developing very strongly in all different fields and industries. However, many people still do not know its development potential, so DeFi participants are required to need it. upgrade Cardano's educational resources With the idea of ​​CDA DeFi Education proposed by the team I think it's a good idea.\n\n   - Here the issue raised specifically identified that Cardano's eUTXO main drive is powerful but its unique architecture implies a steep learning curve. DeFi participants requested educational resources to see how Cardano might work for them on other chains. I find the problem raised by the group to be reasonable, solving the problem of the future challenge.\n\n    - With the description of solutions, the group came up with some specific solutions presented in the project that will propose an educational campaign focusing on key concepts and development issues that Cardano faced. I see the solution is researched, argued specifically. The risks the team may face while doing so is very low because CDA participants have extensive experience in delivering educational content. However, the team also stated that the only challenge that would be easy to overcome is establishing a regular release cadence to ensure maximum community participation. I found the solutions the team outlined to be suitable for solving the problems in the challenge.\n    - Besides that, the risks have also been raised. is to establish a regular release cadence to ensure maximum community participation. Besides, the group also gave a very reasonable way to reduce the risk as stated in the proposal.", "q0r": 4, "q1": "   - \"With the detailed plan provided, including the progress and milestones. The team has outlined a specific timeline to complete the set tasks with a period of 12 months and divided. 3 specific timelines I find such timelines quite reasonable to complete the set tasks. The team has also identified specific goals for each month that are 3 months. will arrange a content schedule, 6 months of professionally written reports and 12 an impressive list of publications, videos, and several cross-chain projects. co-monitoring and checking..\n\n   - Via the budget table provided, with a total budget of $50,000 and broken down for each item. I found the budget to be divided like that to be reasonable, but the group has not yet outlined a contingency plan in case of lack of additional budget.\n\n   - About providing information about members. I saw the team mentioned 14 CDA members made up of project leaders from the top level DeFi dApps. The main mission of CDA members consists of 3 main tasks: Provide a channel of communication and transparency for the Cardano DeFi community, shape best practices on smart contract design patterns, and provide Plutus developers details from CDA members. However, the identities of the members are not verified and there are no accompanying documents for the community to follow.", "q1r": 3, "q2": "    - \"With the description of the measurement to monitor the progress of the project. The team has come up with 7 measurement indicators that are specifically presented in the project. I find such indicators to be reasonable. The results of this proposal will be of interest to community members.All content will be publicly available, open source and marketed through social channels.\n\n   - Here the success of the project is clearly described by the team as the result achieved that is their content essentially becomes an evergreen showcase for developers and users to join the space, channel of they are easily discovered by newcomers. However, the project is still stopping at the idea, not running the actual test.\n\n  - Since this is a new proposal, it has not been funded yet, but I think this project is very necessary for the current industrial age. I hope this project will be approved and put into practice soon.\"", "q2r": 4, "assessor": "z_assessor_3188", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 10356, "q0": "The proposal suggests an educational campaign focusing on key concepts, documents (about smart contract, protocol security, off-chain infrastructure, Plutus developers insights,...), and development issues facing Cardano. Dapp builders and users on Ethereum and other blockchains will be provided an easier way to access Cardano eco-system. The more people recognise Cardano's advantages and Cardano's exclusive features, the more projects will be built on Cardano. This educational campaign is very essential for the development of Cardano. If this campaign is successful, it will become a way to advertise for Cardano.", "q0r": 5, "q1": "The proposal is suggested by The Cardano DeFi Alliance (CDA). They are Defi leaders and builders of the popular projects on Cardano such as Ardana, Charli3, Coti ErgoDex, Genius Yield, GeroWallet, Indigo, Liqwid, MetaDex, Minswap, MLabs, Muesliswap, Optim, Sundaeswap, and VyFinance. They are having important contributions to Cardano's growth. They are a strong league so they can totally finish this project. \nThey also have roadpmap with milestones 3 months, 6 months, 9 months. And, I also agree with the budget $ 50000 they recommend. I understand their vision so i think this proposal is a potential project.", "q1r": 5, "q2": "They bring up problems and offer solutions to those problems. They have criteria to measure the effectiveness of their projects. They also have their website for the community to track such as https://cardanodefialliance.org, https://medium.com/@cardano_defi_alliance, and https://twitter.com/CardanoDeFiCDA. But, they also need to show their achievements in each milestone.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 10316, "q0": "This is a great idea, they clearly pointed out the problem that the challenge raised. This proponent I see enthusiasm for this project because it is related to Education. The combination of the Cardano ecosystem in CDA DeFi education is nothing better, with a large-scale ecosystem that is always geared for growth, prestige and promises to be a rich educational resource. rich for developers and users. Will create an acceleration of the ''Great Migration''. I believe the Cardano ecosystem and DeFi leaders, well-known builders are best positioned to help us understand and apply the Teachings well. The proponent is very careful and meticulous from the beginning with technical tutorials, videos, educational articles, and how-to details to ensure that even starting with the application will be easy for beginners. understand, but also create a very good cross effect, which will help the communication between people who know this application more and more crowded.", "q0r": 5, "q1": "The proponent gave detailed schedule and timelines indicating that within the first 3 months demoed a work breakdown plan for each person starting the publication. Over the next six months, everything gradually improved and became more professional, the time for publication was determined. The way to make video content I find that the image needs to focus on aesthetics, eye-catching, sharp images accompanying the content, Twitter space gradually users are being known to promote communication through this is very good. You also know that group activities are always very effective at work, right? He's also done a great job this time around creating a community for accessing rich ideas and connecting cross-chain projects. Next I have to give him a compliment, he did a good job, didn't he. Twelve months in which he has brought very high work results, giving a series of valuable methods and video content that he has assigned to each person to do, helping them confidently work as a professional. is a member of the CDA. The budget he gives is quite clear for each implementation. I only have a small suggestion about which pieces of content are well done, so optimize the budget as much as possible when possible. Their team is very strong including Cardano DeFi Alliance which is a large corporation which includes: Ardana, Charli3, Coti ErgoDex, Genius Yield, GeroWallet, Indigo, Liqwid, MetaDex, Minswap, MLabs, Muesliswap, Optim, Sundaeswap and VyFinance. The working team will lead the project to a bright future.", "q1r": 4, "q2": "True to the name of transparency is transparency, the project is very clear and detailed by him. As you can see, the community use effect leads to quick success and he was very smart to do this successfully they focused on one energy without much effort. is Community. Will make it easy for DeFi and Plutus Leaders to come up with and disseminate the best, best for dApp development in the community. Making users trust the Cardano ecosystem, although the ecosystem is not necessarily perfect, but will help those who are so-called happy with their own destiny can overcome and use it proficiently in space. . I feel very fortunate that I had the grace to read this project, just like me and the project's topic, so I work decisively and transparently in all my decisions. You all want to work too, right? All public content, the measurement indicators have already been pointed out by him, I also agree, with such an organization-scale work, the number of users participating will be so much that everyone are easily accepted and used. We hope that you are interested in this project and the leaders and proponents of building and developing this ecosystem to all users.", "q2r": 5, "assessor": "z_assessor_3175", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10120, "q0": " Nice to read your suggestions, on the topic of the great migration you have come up with a good solution to restructure and test cda on other platforms to help with trading. fast\n  \n      This project solved well and perfected the integration experience for both developers and users. The proponent gave specific examples to demonstrate your solution. Example: about development DeFi dApps (and later NFT use cases) are credited with driving Ethereum's market cap from a relative low of ~$9 billion to a peak of ~$550 billion in three years, as well as having arguments related to reality closely and transparently. For the experience of the team of protocol developers, they are fully capable of completing this proposal.\n     \n     The team seems to be doing a great job in offloading the risks of this idea, as well as taking very professional steps to deal with it. I think a successful proposal will give the community a separate access to educational resources to see how Cardano can work for them on other chains, and show the strengths and weaknesses of the ecosystem. clearly. I'm very excited to read the team's documents.", "q0r": 5, "q1": "The team has a clearly segmented budget to spend, which helps everyone understand what's in each category. I'm very pleased with the way the team's budget is presented in such a transparent manner. But requests up to $50,000, the team needs to clarify how much will be spent on claim items with a clear statement to support their claim, such as the amount due for an hour of advertising, and part 1 for more detailed items please note the team for more clarification on this matter.\n\n  I am confident with the quality team from the proposed team, as well as the experience of the team, this proposal will be implemented well. The team has published each team member, the group's personal links to prove it. justify the claims of their experience.\n\n   However, I have a small finding that the team needs to add to make the proposal perfect. It is to provide more specific timelines than the suggested start and finish route. Hope the team can take note of this small issue. And thanks to the team for bringing such a great idea to the Cardano community.", "q1r": 3, "q2": "The proposal has provided KPIs to measure how much work will be completed divided into 4 large indicators. And clearly shows the approach to the implementation progress of the proposal. it's good to help the proposal increase transparency. The project owner has outlined the successful milestones of the proposal when it was launched in quite detail as well as attached proofs to help the community visualize clearly I think you guys are doing a great job on the core issues of the Challenge.In a future when the activity proposal will become a showcase for developers, and attract users/builders. from other blockchains approach cardano more.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 8818, "q0": "As we know there is great demand for developers in cardano ecosystem, but there isn't enough developers to cope up with projects, the main reason is learners find difficult in learning Haskell and Plutus programming language and people can't understand the architecture of wallets where number of transactions are calculated via UTXO, Hence to overcome such scenario , the proposer wants to create campaign videos where people can understand Cardano Decentralized Finance system, so that learners can understand the finance system first them improve the code skillsets while developing Wallets, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task doesn't involve any risk where the proposer's team wants to develop educational videos over Decentralized Finance and add them in social media, later publish notes over it, Hence to complete these projects 1 or 2 excellent advisors are needed who have worked on Decentralized Finance using Plutus or Haskell languages, Since the team has already made alliance i.e  (CDA) where they already have DeFi leaders and prominent builders ,to explain Cardano's exclusive features, how they can be improved, and requirement of its adoption, Hence with experts already provided the task is achievable and the idea of publishing notes can also be achieved, Hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly mentioned on how they are going to create campaigns about DeFi and  later publish videos and notes via twitter space , so that people can make use of it, audit even contains the professional members working on Cardano DeFi Alliance and their experience in development field.\nThe audit has described proposed solution in very much detailed manner , it even contains well structured budget breaking idea to make the project still more efficient, with key indicators involving Best Practices, User Orientation, Community Engagement to measure the success rate of the project, with minimal risk involved ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7963, "q0": "In this proposal, they want to provide DeFi participants with learning resources that explain to them how Cardano can operate over other chains. The aim is to have the CDA made up of Defi leaders and prominent builders explain cardano's exclusive features and how they can be leveraged for adoption. It's good to have an educational campaign that focuses on the key concepts and development issues Cardano faces. It is good to focus on the four included media types such as simple explainer animations, Twitter spaces, how-to videos and how-to articles. It clearly states what the requested funding will be used for. ( content research, professional video editing services, Twitter Spaces) Through this proposal, the educational items will ensure that best practices are maintained across the ecosystem. This will ensure that new users will be informed about the potential pitfalls or mistakes that can then be avoided become. The future challenges of this proposal are very low because the CDA participants have a lot of experience in providing the educational content. The biggest pitfall is to ensure maximum community involvement. They will solve this by organizing release cadence. This proposal can certainly add value. It might be useful to offer the educational content in different languages ​​to appeal to a wider audience.", "q0r": 4, "q1": "The team that will realize the proposal is the CDA. (Cardano DeFI Alliance) This team consists of project leaders from top-tier DeFi dApps. The team members are clearly defined in the proposal. This team also has its own website where you can find the team members with their relevant experience. A plan has been written outlining what the funding will be spent on. It will take a total of 625 working hours. This works out to an average of $80 an hour. A realistic timetable has been included to complete the project. There is also a clear implementation plan that states what needs to be done. The proposal contains everything necessary to implement the proposal. If a project is successful, an application will be submitted for further funding. A good breakdown is foreseen to bring this proposal to a successful conclusion. The main challenge is to ensure maximum community involvement.", "q1r": 4, "q2": "A roadmap is available that states what the objectives are. (3 months, 6 months, 12 months) I think the roadmap could be more detailed. They could do this by, for example, working per month or per 2 months. the makers of the proposal could also write down in more detail what the objectives are. they could include a sample content schedule in the proposal. The proposal contains a clear description of the problem and the makers offer a clear solution. It has only been taken into account that people must remain sufficiently involved in the project. The intention is to keep the community sufficiently informed. The challenges and risks should, in my opinion, be spelled out in more detail. The language barrier should also be included in the proposal.", "q2r": 3, "assessor": "z_assessor_2940", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 7317, "q0": "In the blockchain platform, Ethereum and EVM blockchains (Binance Smart Chain, Polygon, Avalanche, etc) account for a disproportionately vast share of the smart contract blockchain market. This situation means developers and users naturally flock to EVM chains despite the oft-cited limitations stemming from the global state, non-deterministic gas fees, and so on.\nCardano's design aims to address these limitations. Although it trails the development of its competitors, numerous Cardano dApps are here with others just around the corner, and EVM bridging solutions like Milkomeda are already experiencing strong demand.\nThe idea was to build an educational campaign, led by senior DeFi teams, to introduce developers and users into the Cardano space.\nThe proposal that identifies the problem is that Cardano's eUTXO ledger is robust but its unique architecture implies a steep learning curve. DeFi participants require educational resources to see how Cardano can work for them over other chains.\nThe proposed solution is The Cardano DeFi Alliance (CDA) consisting of DeFi leaders and prominent builders well-positioned to explain Cardano's exclusive features, how they can be leveraged, and what they mean for adoption.\nThe target audience is dApp builders and users on Ethereum/Ethereum Virtual Machine (EVM) blockchains as well as laypeople in the Cardano ecosystem.\nThis proposal is up to the challenge, it directly answers the question that is How can we help dApps and other projects scale or move completely from Ethereum to Cardano easily and quickly.\nThe proposal solved the problems of the challenge. As proof, members of the CDA represent an integrated and profound DeFi experience that stands to bring significant attention to the ecosystem. They also wrote some detailed articles we can refer to on Medium.\n\nThe proposal also anticipates risks and has specific solutions. However, they say the risk is low. The only challenge, which will be easy to overcome, is to establish a regular release cadence to ensure maximum community engagement.\n\nThis proposal is a good idea, with these educational items will ensure that best practices are maintained across the ecosystem while actively attracting new participants from EVM and other chains. I completely agree with this suggestion.", "q0r": 5, "q1": "In the explanation of the Process and the plan\nIt is proposed to identify 3 milestones:\n+ 3 Months: Organize content schedule via input from CDA members\n+ 6 Months: Professionally written, high-impact articles published following a determined timeline.\n+ 12 Months: Released an impressive list of products and related issues.\nThis timeline is reasonable for getting the job done, in line with the goal.\nThe project content is easily checked and monitored by the community. In this section, the proponent should add a video source on Twitter Spaces.\n\nThe total budget for this proposal is $50,000\nHours of participation: 625\nThere is a given period for each activity item. Need to explain more about this activity such as contingency plans, or other costs incurred.\n\nThe Cardano DeFi Alliance (CDA) is a consortium consisting of project leaders from top-tier DeFi dApps. Membership is open and currently includes Ardana, Charli3, Coti ErgoDex, Genius Yield, GeroWallet, Indigo, Liqwid, MetaDex, Minswap, MLabs, Muesliswap, Optim, Sundaeswap, and VyFinance.\nIn which Core Team:\n+ Amoor Day: Hari is a software engineer at MLabs\n+ Ben Hart: Ben heads the majority of MLabs’ Cardano-based projects.\nWith a team with many years of experience, there are specific tasks assigned. Reputation is easy to verify, there is a link to a personal page on Github. Trust that they will complete the proposal.", "q1r": 4, "q2": "The proposal has specific measurement content.\nThe results are easy to check. Content is publicly available, open source, and marketed through social channels.\nThe proponent should add an affiliate channel for us to follow.\n\nThe success of the proposal is clearly described, relative to the challenge that is being used by developers and users. Broadcast channels will be discovered by new users.\n\nThis is a new proposal for F9. In Fund 8 the group also succeeded with 2 proposals that were highly appreciated by the community.\n+ MLabs - Spec DSL for dApp Security - $72,000: https://cardano.ideascale.com/c/idea/396541\n+ MLabs - Cardano-Tx-Lib for web3 - $71,000: https://cardano.ideascale.com/c/idea/396607\n\nI am confident that this proposal will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_2887", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6945, "q0": "   -   It can be said that Cardano is developing very strongly, the community is more and more people know about Cardano. However, in order to properly understand Cardano standards, it is necessary to have educational courses for the community to properly understand Cardano. with the idea of ​​creating CDA DeFi Education. (meaning educational campaign) is a very good idea.\n\n    -  Here the group has raised the issue that is. The Cardano DeFi Alliance (CDA), consisting of DeFi leaders and renowned builders well positioned to explain Cardano's exclusive features, will create an Education campaign led by senior DeFi teams lead, to introduce developers and users into the Cardano space, these resources are needed to guide the journey of newcomers. The solution raised by the team also identified problems which are, Explained articles complete with infographics, Professionally edited and quickly edited how-to/how-to videos, Spatial Regular Twitter, Simple Explained Animations. This educational item will ensure that best practices are maintained across the ecosystem. I found the solutions the team outlined to be very relevant and able to address the issues in this Challenge.\n\n   -    Besides, the group also talked about the risks that the project may face. as project topic said this proposal has very low risk. because CDA participants have a lot of experience in providing educational content. and I agree with this.", "q0r": 4, "q1": "    -  Section provides a blueprint, including progress and milestones. I see the team has identified the milestones that are. The work will be completed within 12 months and divided into 3 specific phases. I think the above timeline is reasonable to complete the set tasks. There were specific goals for each stage such as. Organize content schedules through input from CDA members. Professionally written, high-impact articles published by a defined timeline. Several cross-chain projects enter the space independently or as new members of the CDA. I find the stated goals to be very complete. However, the progress of the project is not easy for the community to follow\n   -  With the presentation of the budget with a total budget of $50,000 and broken down into 12 different items as outlined in the scheme I find the divisions above to be perfectly reasonable. I have no further comments on this.\n    -  In the section that provides details about who will work on the project. I see the group has listed 13 members. However, the group has not talked about the work and duties of each member. I also don't know if the members have the right experience. The identities of the members are also not published for the community to track. I hope the group will have a more detailed report on the members working in the group.", "q1r": 3, "q2": "   -  In the description of what you will measure to track your project progress. I see the team has also listed a few indicators. in which there are 3 main indexes such as . The best methods. User oriented. Community participation: However, the indicators are not easy for the community to track.\n\n    -  In the Project Success presentation. I see the group has also raised some of the successes such as . Our channel is easily discovered by newcomers. The content will become documentation for developers and users participating in the space. I find the successes outlined to be very relevant to the campaign challenges. However, the project so far is still at the idea section, but has not been tested.\n\n    -  In the funding section. This is a new project. therefore not funded. however I think this project is also quite interesting and new. I hope this project will receive a lot of support from the community.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 6926, "q0": "Education of developers that has more media and interaction is always good and desired. I am not sure about projects switching to Cardano because of lower gas fees because of lower gas fees is the switching motivator then probably Solana will always be the winner. Thankfully Cardano offers a wide variety of reasons why projects should come and built or migrate to Cardano. The current infrastructure is not enough for teams and projects to do so easily and that's why investing in educational resources that highlight the last on Cardano including dev tooling is important. I beliebe this will strongly and positively impact the development ecosystem and probably entice some devs to come over. The tools however are no there yet to really appeal to the masses. Things like JavaScript or Python Cardano SDK would have 1000% return on investment while education on existing cutting edge tooling may have 100-300% positive impact which is still good. The one additional feedback I have is any content that is created on tools and for devs will become eventually outdated and will need to be updated which will require maintenance forever if it's to be really effective. For the cost, this proposal is not a bad bet though.", "q0r": 4, "q1": "The team quotes partnerships with \"Ardana, Charli3, Coti ErgoDex, Genius Yield, GeroWallet, Indigo, Liqwid, MetaDex, Minswap, MLabs, Muesliswap, Optim, Sundaeswap, and VyFinance\" which are one of the most reputable projects on Cardano. I believe with the current strong team that has been proven the feasibility of this project is solid and the successful delivery of the project is almost guaranteed. Sometimes however when a project and team is too successful I wonder if they would have enough time and resources to dedicate to this project. CDA seems to be a strong alliance that can produce strong educational material because most of these companies already have to do it for their own hiring needs to acclamate senior developers from other chains to Cardano's terms and way of building on the chain including the eUTXO models. I wish the team best of luck and hope that all their wishes come true to benefit the whole ecosystem. The timeline, planned action steps are very clear as well.", "q1r": 5, "q2": "Auditability is strong in this proposal because of community engagement and transparency. Community Engagement: \"Community engagement is a necessary component of a successful project--this is why Charles Hoskinson is so active on social media. This proposal will help the CDA focus a greater amount of energy on community engagement where it is poised to deliver outsized benefits to ecosystem participants. These efforts will also extend to promoting Cardano and its benefits to other blockchain communities.\" I wholeheartedly agree with this statement that no matter how big a company or successful a project gets they need to continually serve the needs of their user and the community. The community are the CDAs customers and users so it pays to be obsessed with getting the community involved and in touch with this proposals progress. They also have clear examples of KPIs such as:\n\n\"-views, likes, comments, etc. on our article posts\n-growth in social metrics including engagement on Twitter\n-growth in active users on Cardano\n-growing number of member projects\n-reposting of our content\n-engagement and turn-out for Twitter Spaces and Q&As\n-general community feedback and reception of our content campaign\"\n\nWhich are clearly laid out and also easily trackable using social listening tools and other marketing automation tools. The good thing is that these numbers are often also reported by IOHK themselves which makes auditability easy.\n\n\"The deliverables of this proposal will be easily audited by interested community members. All content will be publicly available, open-source, and marketed through our social channels.\"\n\nThis should also improve SEO for Cardano and the different players involved as a whole but it really depends on the quality of the content. I wish the team best of luck and go make some killer content!", "q2r": 5, "assessor": "z_assessor_2855", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6749, "q0": "I believe the goals outlined in this proposal clearly align with the goals of the challenge.  The proposal mentions that much of the groundwork is already laid out for the “The Great Migration” of people from Ethereum to Cardano and the last step needed is smoothing the onboarding experience for developers and users. \n\nThe proposed solution is to make an educational campaign that focuses on key concepts like orientation, onboarding, and setting expectations which they plan to do through articles with complete infographics, professionally edited how-to videos and regular twitter spaces where members of the Cardano Defi Alliance (CDA) can be available for Q&A sessions.  The proposal states that all of these educational items should help new developers and users entering the Cardano ecosystem from feeling lost and ensure that they use best practices when developing in the ecosystem as well.", "q0r": 5, "q1": "The proposal states that the risk of not delivering is very low because the people involved in the CDA already have a lot of experience and knowledge of the Cardano ecosystem and share similar educational items internally already.  They state that the only hurdle really needed to be overcome is establishing a release schedule that allows for the most community engagement. \n\nThe CDA consists of project leaders from many of the top tier dApps on Cardano so it would seem they are in a good position of teaching others about developing on Cardano. They have as a collective already published a few articles on Medium for the purpose of educating people on Cardano (like explaining how tokens can be verified using policy id and various token registries) so I think it’s likely they'll deliver more educational content like they promise.\n\nThe proposal provides a detailed breakdown of how they plan to spend their time to reach their goals, which is good, but what I find missing is a breakdown of how the $50,000 budget is planned to be spent. It would be good to know what expenses the team plans there to be so as a community we can determine if $50,000 dollars seems sufficient.  Other than that, the goals of this proposal seem very feasible.", "q1r": 4, "q2": "There’s two questions to consider when looking at auditability for this proposal.  The first is do they deliver the educational items they say they are going to deliver, and the second is how successful are those items at onboarding users and developers to Cardano.\n\nThe first question is easily answerable because the proposal provides many different public channels like their medium page, twitter, or website, where they can announce when new educational items are released. In this respect, the proposal can be audited fairly easily, as long as updates are provided on those public channels.\n\nThe second question is much harder to answer because there are no clear indicators provided for tracking how many users are onboarded by their content specifically.  There also aren’t any indicators provided that would allow us to determine if new users are joining the Cardano ecosystem regardless of if it was because of the CDA’s content or not. This makes it difficult to measure how successful the proposal is at achieving its goals of onboarding and educating new users and developers.", "q2r": 3, "assessor": "z_assessor_2826", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5556, "q0": "The idea is good but I think it does not fully meet the requirements of this challenge. The main goal of this challenge is to bring planned or launched projects on EVM-based blockchain implementation into the Cardano ecosystem easily. I understand this proposal runs an educational campaign focusing on the key concepts and development issues facing Cardano such as (directing, introducing, and setting expectations, as well as highlighting areas of concern). areas in need of research, development, and cooperation). The proposal states 4 means of content transmission (articles, videos, Twitter, and animations) but it is not clear which channels will be released? and exactly what topics or subjects will be included in the program. Engaging developers and users on other platforms not yet covered in the proposal, it is advisable to find out which projects or groups are targeted by the campaign. The proponent said to highlight groundbreaking development tools built outside of IOG, which represent exciting new possibilities for blockchain DApps and promote them to developers in ecosystems. Other than that, what are these specific tools? What areas does it cover? (besides Defi)", "q0r": 3, "q1": "The proponent provides a roadmap (3 months, 6 months, and 12 months). The details of the work done are not precise, it took the first 3 months to arrange the content schedule / assign responsibility for writing and start publishing, so more details or topics are built, and the next 6 months by (Professional, high-impact articles published by a defined timeline) how many articles are published by day, week or month?. The cost of the proposed grant is $ 50000 and I understand it is calculated as $ 80 for an hour of work (625 hours in total), the details of the hours for each job are detailed but I am not clear with the number of hours So how many (articles/videos/advertisements) are built and published?. Some tasks are timed but not sure what to do? how ? and how many people? (eg: Community Involvement 55 / General Outreach and Education 50 ). The core team has 2 personnel who are software engineers who have an excellent reputation in the Cardano community, in addition, the other members are unknown, and the members' duties have not been stated, I understand the problems. Jobs like building and editing videos are going to hire services, so how will this affect the progress and quality of the content?\n", "q1r": 3, "q2": "The proposal team states that the results of this proposal's distribution will be easily checked by interested community members, and all content will be publicly available, open-source, and marketed through various channels. society. However, the testability of the project is not enough, what is stated in the proposal is that success is measured based on (views, likes, comments, etc. on posts / Twitter interactions/user growth). active on Cardano / number of projects in development / etc...) but lacks a specific number target, it would be more appropriate if the team set a more specific and objective goal that is easier to verify. Specific task milestones should be added to better see the project process and results.\n", "q2r": 3, "assessor": "z_assessor_2714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5118, "q0": "Blockchain has exponential growth over the years, however, many users still don’t understand the technical side. Add on top of that Cardano does not use EVM which the majority of educational content is based on. The proposal wants to solve the issues by creating educational content for Cardano through various forms and media. With the experience the CDA teams have and the project's low-risk nature, I have huge confidence they can implement the plan successfully and add value to the Cardano ecosystem.", "q0r": 5, "q1": "Proposers give specific milestones that will be completed on a 3, 6, and 12 months timeline. The proposal outlined the breakdown of the proposed budget, such as screencast video production, video editing, or marketing and promotion. However, some items like community engagement or marketing can be written in more detail. The proposal gives information to the members of CDA consortium through an external link to CDA website. They also give a concise background of what is the CDA mission.", "q1r": 5, "q2": "The proposal outlined clearly what metrics will be used to track project progress, especially on community engagement, such as Views on article posts and engagement on Twitter. However, it can be better if the proposal provides an exact number that can be used to evaluate if the project is a success, for example, more than 500 engagements for each tweet, at least 100 listeners on twitter spaces, or more than 300 views on each article posted.", "q2r": 4, "assessor": "z_assessor_2675", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 4910, "q0": "DeFi is currently the main attraction for blockchain use cases, even if others such as registry NFTs and SSI may have broader real-use case applications which will eventually become mainstream. In this line of reasoning, current yields and developer comps are driven mainly by DeFi projects, and as such a specific campaign by Cardano's main DeFi proponents, gathered in the Cardano DeFi Alliance (CDA), to educate and bring developers from Ethereum and EVM-compatible chains will exponentially grow the developer ecosystem and contribute to strentghtening the great migration.", "q0r": 5, "q1": "The team at CDA brings together the top players in the Cardano DeFi landscape, and as such they are the most qualified in the ecosystem to lay out the advantages for developers to switch over from EVM to Cardano, with all its implications in terms of programming languages, expanded DeFi possibilities and potential obstacles in the learning curve and how to overcome them. As essentially and educational campaign, the timeline and budget allocations will be mainly content creation, audio/video editing, community engagement, marketing, promotion and such. The compounded experience of the team members ensures that the proposal will be implemented successfully, helping accelerate the great migration of developers in the DeFi space from EVM chains to Cardano.", "q1r": 5, "q2": "Although the KPIs proposed (views, likes, comments, on article posts; growth in social metrics including engagement on Twitter; growth in active users on Cardano; growing number of member projects; reposting of content; engagement and turn-out for Twitter Spaces and Q&As; general community feedback and reception of the content campaign) are a bit lax, and future iterations might benefit from specifying minimum success thresholds (ie specific number of projects onboarded from Ethereum and/or other EVM-compatible chains, specific number of developers onboarded, etc), due to the public nature of the KPIs, reports and community engagement metrics, the favorable evolution of the proposal should be adequately auditable throughout its progress.", "q2r": 4, "assessor": "z_assessor_2636", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4768, "q0": "In this proposal, the team identifies a relevant problem and presents elaborated solutions. The solution to how this project will add value to the Cardano ecosystem is clearly presented. This proposal represents the education that is needed to meet the challenge settings, so we can say that this proposal aligns with the outlined challenge settings. My opinion is that the Impact proposal is elaborated and therefore I strongly agree.", "q0r": 5, "q1": "In the proposal, we find links that transparently represent the core team of two people who have all the necessary skills, knowledge and experience for the realization of this project. The budget breakdown is clearly presented, reasonable and we can easily see on what and how the money will be spent. Although a realistic timetable to complete the work was presented, I would like to see when the implementation of the project would begin (eg. We start in December 2022). The plan for the realization of the project was well developed and presented. The team is aware of possible risks and it gives me the additional impression that the team knows what is doing. ", "q1r": 5, "q2": "In the proposal, the team presents what success looks like. A roadmap with milestones has been developed, but as I already mentioned, I would like to see a more precise start and end time of the project, ( eg. We start in Dec 2022, we finish in Dec 2023). In the proposal, clearly elaborated KPIs are listed and channels are presented through which the community can follow the development and progress of the project. ", "q2r": 5, "assessor": "z_assessor_2616", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 4175, "q0": "The CDA DeFi Education proposal addresses the Great Migration (from Ethereum) challenge by setting up an educational campaign for onboarding developers and users to Cardano. Ethereum and EVM blockchains has big market share for smart contracts making it a natural choice for developers and users. This proposal aims to help the users with the smooth onboarding experience, promote best practices for developers and relevant information for consumers. The CDA team will also run Q&A sessions. The program doesn't replace Plutus Pioneer Program but rather complementing with content for development tools built outside IOG that represent new capabilities for blockchain dApp. This will be delivered in infographic, how-to video, twitter space and explainer animations, etc. The content will promote the adoption of Cardano to other blockchain community. CDA is very experienced in educational content as shown in medium so the technical complexity is not the issue in delivery but they will have to ensure the consistency in delivery and engage more with the community. Also the CDA team has to consider how to scale their project and includes a variety of protocols not only to gear their content to promote the member protocols too much as doing so would be biased and alienate its image as being fair establishment among DeFi protocols. ", "q0r": 5, "q1": "The project duration is 12 months. The first 3 months they will delegate writing responsibilities and publishing and source a video editor. Reading through the team comment section, the team will engage with multi-chain influencers (e.g. Hashoshi) to make it possible that their content will deliver across the chains. In 6 months, they will feature high-impact articles, video content and twitter space in their platform and outreach to cross-chain project. In 12 months, the publication will list evergreen content aimed at best practices and series of video content. Several cross-chain projects will become new members of CDA. The total project will take 625 hours with the pay rate of $80 per hour. The pay rate looks quite high in term of producing content as it is almost the same rate as developers and blankets all kind of activities with varying degree of effort. The CDA core team members who will work on this project and are mostly from MLab. This helps to relay technical content from other chains into Cardano into easily understanding format. They may apply to future funding round to continue the effort. A little suggestion is that the team would have to be more straightforward with the compensation for tasks (not blanket rate of $80/hour across all tasks and also address when they would seek another funding (the end of 12 months or else). The proposal will get the benefit of the doubt as the DeFi community is very well aware of DeFi alliance as a consortium of DeFi protocols but that also comes with the high expectation for the delivery along with transparency of this proposal.", "q1r": 5, "q2": "The community can easily keep track of project progress on their channels. The proposal will help to highlight and disseminate best practices for secure dApp development. They will measure community engagement via view, likes, comment on their article post twitter and the growth in active users on Cardano along with growing number of member projects. Also for their twitter space, they will check the turnout and community feedback and reception on content campaign. All contents are available on social channels for public audits. The team has bridged the knowledge gap between other chains and Cardano with this CDA DeFi education proposal effectively. DeFi community will surely look forward to the successful delivery of this proposal and not missing in the action to become more involved.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3602, "q0": "The proposal under construction is a bridge, a broker for developers and users to the Cardano space, promoting Cardano on the developer communities, people of other blockchains. This increases the value and popularity of Cardano in the Blockchain community. What the proposal is referring to is that comparing Cardano's gas cap to users when Ethereum gas fees spike could lead to a massive exodus (from Ethereum). If this proposal is developed, it will be a guide for new Startups, who are or want to move in- to the Cadarno network. As a newcomer and Blockchain network community I agree and welcome this proposal", "q0r": 4, "q1": "The proposal has given a very clear timeline, content 3 months, 6 months, 12 months. The budget is also clearly defined for each stage, but I think that the proposed timeline is not feasible and the goals are not specific and detailed, it can be said that it is very general and does not follow closely with the goals. The original goal was to create a great exodus (from Ethereum). In order to do this, I think this small grant is not enough to build and develop the project. At first I thought the proposal was a bridge for startups, but after reading the detailed plan, I saw that the proposal was just for marketing purposes. Construction team to operate the project\n there are 02 main members who seem to have the necessary skills and experience to implement the proposal.According to the proposed budget allocation and time frame, I don't think it's feasible", "q1r": 2, "q2": "The measurement and evaluation of the proposed effectiveness by the interaction of the online community: viewing, liking, commenting, increasing interaction, increasing users on Twitten channels, I think has not yet assessed the development of the project, it is difficult. project results can be assessed. The budget is allocated specifically for each item, but I haven't seen the details of how it works so I can't see the transparency of the project", "q2r": 2, "assessor": "z_assessor_2464", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2738, "q0": "\"The concept for this challenge is completely relevant, and provides insights into how eUTXO works for the community of novices and developers focused on the EVM side for the purpose of The goal is to help them better understand the operating mechanism, the general conditions that need to be noted, so this proposal has the right impact to the requirements of the challenge.\n  by solutions ; gather together all the experienced and knowledgeable organizations and individuals who have been building and developing on the Cardano platform, mainly Defi, gathering them into an alliance, then summarizing the development experience. develop the difficulties or features and conditions necessary to build a financial Dapp on the Cardano platform,\n  * the goal of this proposal is to summarize the main knowledge that is focused on cross-chain bridging so that other platform developers can safely and appropriately migrate across their platforms best.\n The proposed way of publishing the knowledge material will be primarily on four social platforms, with instructional videos, illustrations, and more to ensure that they are easily absorbed by the public.\n The proposal also states that the risk for this proposal is very low because strong human resources with an abundant knowledge resource will optimize the possible risks for the project and the migrant communities. \"", "q0r": 5, "q1": "\"the implementation schedule is also clearly stated and suitable for implementation, but it is difficult to determine exactly how much is paid for an hour because I have calculated, minus the number of hours for the failover is less than $100/hour, if the team could provide more specifics on this that would be great.\n   The team involved includes pioneering organizations in the Defi ecosystem such as Minswap, this is a project with a young team and has experienced transaction latency errors and ledgers they have experience in solutions. migration method, in addition there are many other organizations with a reputation and technical team in the ecosystem, so I evaluate this proposal with maximum feasibility. \"", "q1r": 5, "q2": "\" great, proposal committed to having live Q&A sessions with the community and updating progress and new and best practices for the community migrating from Ethereum to Cardano. *will be available. many people reading and viewing the proposal's documents actively contribute to the development of the ecosystem not only that developers on other platforms are the main target, but even the developers who are just starting out or are operating on the Cardano platform can also refer to it and apply it.\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"id": 2655, "q0": "After about a year of fairly extensive and full time use of the Cardano blockchain I am still struggling to really understand the eUTXO model, so this type of education proposal resonates with me and likely the extended community as well.\n\nGood to see the inclusion of several community leaders and builders, this will be important for early credibility.\n\nLeaders/developers/finance team seems like a good tri-fecta for a foundation to build on.\n\n50,000 seems a bit steep for the budget based off my (limited) experience in assessing proposals. At 25,000-35,000 this would have seemed to have a bigger impact pound for pound and would have gotten a 5 instead of a 4 for my eval. However that being said, the breakdown of hours does look reasonable, so maybe there is an opportunity to partner with another team/proposal to combine budgets and make for some synergy to increase the impact?", "q0r": 4, "q1": "Team provided an extensive list of reconcilable and credible partners in their planned alliance. Good sign.\n\nGood to see a \"group charter\" for the team to sign. This should help with accountability big time. I will personalty look to recommend this in other proposals moving forward. Great idea here.\n\nYou said that you would \"probably\" return to catalyst for further funding, do you have any plans or are you willing to partner up as mentioned above, whether or not you are approved. Might be worth starting to think about and look for other teams and similar proposals as Catalyst seems very competitive for funds.", "q1r": 5, "q2": "Team provided a solid list of metrics to help track the success of the project. IMO this project aligns very well with the challenge goals, and specifically making the Cardano developer ecosystem a better experience for ETH developers looking to find a new home.\n\nPlenty of documentation provided that can be reviewed if there are any questions or more detail is desired.\n\nOnly thing that may be helpful here is to provide some maybe baseline social metrics that other successful projects have shown as \"successful\". Would help with the overall transparency and accountability.", "q2r": 5, "assessor": "z_assessor_2329", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2497, "q0": "Both Cardano and Ethereum have completely different underlying technology architecture. Cardano uses Haskell programming language for coding whereas Ethereum dApps are build using Solidity. Ethereum uses account based model to process and record transaction whereas Cardano uses extended UTXO model. Due to the differences in both of these networks, they require totally different kind of technical skill to develop dApps on top of them. Similarly having a different kind of architect used by Cardano makes it difficult for users migrating from Ethereum to understand the workings of Cardano and transaction structures. Many users get overwhelmed by the eUTXO model itself especially if they have never used an eUTXO based Blockchain like Bitcoin before.\nEthereum and EVM enabled blockchains (Binance Smart Chain, Polygon, Avalanche, etc) account for a disproportionately vast share of the smart contract blockchain market. This is due to the fact that they find it easy to build dApps on top of these chains due to the ease of building and most often ignores the downsides like unpredictable gas fees, and scalability problems. To attract these users and developers to Cardano, we need educational resources that can not only educate common people inside Cardano but also these Developes and users from other chains, especially Ethereum to help them migrate easily.***\n\nThe team is proposing an educational campaign centered on key concepts and development issues facing Cardano. This content will be aimed at developers and users and will include technical guidelines, video tutorials, educational articles, and how-tos. The proposal will also include regular Twitter Spaces and active community engagement including outreach to cross-chain projects. These resources will ensure applications bridging cross-chain, alongside their users, can easily migrate into the ecosystem and not get tuned off due to the complexities involved.***\nThis perfectly aligns with the objectives of the challenge catagory of Great Migration from Ethereum. The one problem, I see though, is that there has been many such proposal in this and previous funds concerning creation of educational content. I think we really need coordination among all these proposals and create a one hub for all such content where all the content is available at one place and is also easy to market. This way, people especially from the outside of the Cardano community  can easily find the required guidance at one place. Although I think being an alliance of some of the most prominent projects building on Cardano, the Cardano DeFI Alliance is well poised to take this lead in this regard and can start with integrating all the educational content from their members at one place.***", "q0r": 4, "q1": "The proposal has a roadmap for 1 year to create high quality educational content. All the DeFI Alliance members will provide inputs for creating such content and the second stage will result in professionally written, high-impact articles published following a determined timeline.\nRegualr videos, Twitter spaces and community engagement will be conducted to ensure the project is fulfilling its objectives. The core team involves 2 members from Mlabs who have the required skills to conduct this proposal in efficient manner. In addition to this all the DeFI Alliance members will be actively participating in this project and will help in content creation.  This will ensure that a wide variety of skills and experience will be available to the proposal to provide high quality content.\nOn the budget front, the team has asked for $50000 and the details of the funds requested show that Amount requested is reasonable and will be enough to complete the project. Also given the the prominent DeFI projects involved with it, they will be able to mobilize more funds in case the need arises. The experience of the team and the enough funds support from the Catalyst shows that the project will be feasible to complete and achieve its objectives if it is funded by the Catalyst.", "q1r": 5, "q2": "The progress of the project can be monitored by way of new content, like articles, videos, tutorials etc being created by the project. All this content will be uploaded/published on their social channels and hence will be verifiable easily. The success of the project can be measured from the interactions received on the content created which includes likes, comments, etc., growth in social metrics, growth in active users, engagement in Twitter Spaces  etc.\nThe deliverables of this proposal will be easily audited by interested community members. All content will be publicly available and open-source. This will make the Auditability of the project easy and transparent. *****\nTraining the developers and educating the users from outside the Cardano community will help in greate migration towards Cardano. I wish the team best of luck.*****", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1968, "q0": "The proposal aims to provide, as a service, a well documented roadmaps and robust educational hub for users and developers alike through concerted campaign efforts and continuous input of Cardano Defi Alliance. The essence is to educate new and existing users and developers on the distinctions of Cardano Ecosystem and potentially increase the adoption especially from the Ethereum Community and other platforms. The proponents have declared the proposal as slow risk project as the CDA participants are highly skilled and competent to provide needed educational content and possibly on a consistent basis.\nThe proposal is definitely within the tenets of the challenge settings", "q0r": 5, "q1": "The proponents of the proposal are well experienced and highly skilled, and active members of the community notably, the Cardano Defi Alliance (CDA) and in addition, the core team members has the requisite competence, experience and capacity to deliver the project.\nThe Budget Estimates were well elucidated with reasonable basis of arriving at its cost. The proposal has also provided plan of implementation with detailed milestones within the timeframe specified. From the information provided, the proposal will be effectively implemented.", "q1r": 5, "q2": "The proposal has provided adequate and reliable information on how assess and monitor the project. However, the basis are not measurable and verifiable for the community to effectively confirm the development and progress of the proposal if eventually funded.", "q2r": 3, "assessor": "z_assessor_2292", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 1281, "q0": "The proposal aims to deliver an educational campaign with the purpose to onboard developers and users. The idea is based on the fact, that EVM chains are having different specifications and processes than Cardano, thus having educational sources in this area is required. The proposal states, that education will be provided by DeFi leaders from Cardano space, and it will be posted in four forms: – articles, how-to videos, twitter spaces and explainer animations. The education sources can have a beneficial impact on the amount of new users/developers but also the same time to provide another education channel for the current community members. When implemented, we can also expect the growth of projects which will result with another influx of new users, so this is another added value. I strongly agree that this proposal can have a great impact, is aligned with the challenge goal, and via educational content which will result in lowering entry barriers can increase the overall knowledge of the community. ", "q0r": 5, "q1": "The proposer has provided the plan for the next year, divided into 3/6 and 12 months. Since the it is not really reasonable to have a detailed plan for one year, I am still convinced that having a more detailed plan for the first 3 months, divided by weeks, would be a great start how to provide more information to the community, and to prove that it was already planned and considered. Right now, it is quite vague and lacks the detail required for a better evaluation. The budget is set to 50k dollars, based on the estimate of 625 hours of work. Even tough it might appear detailed, information such as – expected time frame? Is this the budget for the whole year? Or just the three months? 625 hours is just approx. 80 days, so I assume it is only for the first 3 months for one person, but this information is missing. Another missing information is expected people to be paid – as mentioned above, the budget appears to fit for one person for three months, which lacks the reasoning and explanation (how many people will be involved? How often? For how long?). Regarding the team, the proposal contains information that it consists of many DeFi projects, and I find all of these highly competent as a source of information. Nevertheless, it would be suitable to select at least one-two person from each DeFi as representative, to actually assess their competence. ", "q1r": 3, "q2": "The proposed problem (EVM devs/Cardano specifics) is clear and the solution is to provide information required to understand cardano better – both problem and solution are clear. Regarding KPIs, the proposer will measure engagement (likes, views, comments), increase of followers on twitter, (increase of users on cardano – how?), reposting of content, engagement within twitter spaces – I find almost all of them suitable, except growth of cardano users. Unless there is some tracking implemented, it will not be possible to monitor them. Nevertheless, from my perspective - audit can be successfully performed. \nThe proposed problem (EVM devs/Cardano specifics) is clear and the solution is to provide information required to understand cardano better – both problem and solution are clear. Regarding KPIs, the proposer will measure engagement (likes, views, comments), increase of followers on twitter, (increase of users on cardano – how?), reposting of content, engagement within twitter spaces – I find almost all of them suitable, except growth of cardano users. Unless there is some tracking implemented, it will not be possible to monitor them. Nevertheless, from my perspective - audit can be successfully performed. \n", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 591, "q0": "This proposals has the goal of creating educational content for already experienced developers that are used to Ethereum/EVM, to make it easier for them to learn how Cardano works and avoid common mistakes. The content would be explainer articles with infographics, how-to videos, regular twitter spaces, simple explainer animations. As mentioned in the proposal, one of the reasons some other blockchains are more easily adopted instead of Cardano is because their code is more similar to Ethereum, but at the same time they all have the same issues as Ethereum does. And this is also a reason why there are so few Cardano developers in the world, compared to Ethereum, because since they were stablished first, there is much more information avialable out there, more open source projects that someone could use to create their own projects. The impact of this proposal can be very high if properly executed. The proposal is also aligned with the Challenge. Even though it is not that easy to directly measure the number of project that will migrate to Cardano because of this proposal, it’s clearly going to be a very useful resource to the community. One things that makes it more difficult to evalute it’s impact, although, is the lack of quantity of content created. It’s not clear in the proposal the number of videos, articles, twitter spaces, etc, that will be created/will take place. If that was included, it would be a 5 for me.", "q0r": 4, "q1": "The team behind this proposal is made up of several well known and already working projects on the Cardano blockchain. They already provide some content about Cardano as a whole, and in my opinion they are capable of delivering what is promised in this proposal. The background of these projects can be seen in the links provided. They have already planned the required budget for each aspect of the project and summed them up to create a general budget that’s appropriate to what’s being proposed and will probably be enough to execute it. There’s a ‘change budget’ that’s not clearly addressed, but might be some spare funds in case something exceeds the expected budget, althought it’s almost 15% of original ask without it, which is quite considerable. The roadmap presented has some milestones for 3, 6 and 12 months, but it is not very detailed. It is not specific about the number of content materials that would be created, only about the time that will be spent, which is essential for budgeting but not to know how much content will be created.", "q1r": 4, "q2": "The proposer includes some other information that is not relevant to auditability in the auditability sections, but that’s not a big issue. Although, some os the KPIs presented are not so appropriate, in mmy opiniton. For example “growth in active users on Cardano”, “growing number of member projects”. These number are very little correlated to the success of this proposal. Also, since there is not roadmap with detailed dates when the articles and videos will be launched, and when twitter spaces will take place, it’s even more difficult to know if the project is on track or not, and if it has achieved its goals. There is no KPI related to deliveries on time and number of these content materials created, which could be directly related to the proposals and more powerful when combined with other KPIs relates to community engagement.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 12460, "q0": "The proposal perfectly addresses the challenge. Convincing people to move from Ethereum to Cardano is freaking hard but that doesn't mean it's impossible. The proposer came up with an approach that is very consistent with today's reality the crypto market is just in extraordinary fall down. To make “The Great Migration” happen,  we have to help people change their way of thinking and thinking so that they can understand why Cardano can outperform ETH and its huge benefits in the future. To guild, the jouney for new people who want to move from ETH to ADA, the education campaign with in-depth document comparing ADA to ETH can show clearly ETH disadvantages such as:\n\n+ ETH is very difficult to update because there is a ton of projects already running on top of ETH and we have seen ETH’s staking upgrade has been postponed many times.\n\n+ ETH is shifting its consensus mechanism from proof-of-stake (PoS) to proof-of-stake (PoS). That is a huge decision and can cause many issues.\n\n+ Staking requires so much money around  32 ETH. If ETH back to its previous all-time high, getting enough ETH to stake would cost about $40,000 and that is hard for people to afford.\n\nAnd I do believe the project will dig deep into the issues I have listed above and show how Cardano can solve all the ETH’s problems. Currently, there are many people investing in ETH without understanding its nature and advantages and disadvantages. the act of measuring is like gambling or throwing money through a window. They did it just because of the huge buzz in the price of ETH last year without knowing that another coin with an extremely healthy ecosystem was about to wake up. It is ADA that will go beyond ETH and towards community and energy.\n\n\nThe scope of this proposal extends beyond just developers. Creating an educational resource about Cardano Defi with materials, and in-depth research by leading experts is essential to convince all people to switch to Cardano instead of ETH. This project will help people understand the real technology and huge growth potential of Cardano instead of rushing to ETH.\n\nIn short, this is a very ambitious and challenging idea but I believe that if it succeeds it will have a huge positive impact on the Cardano community and make the “Great Migration” happen.", "q0r": 5, "q1": "The solution declared in the proposal is a feasible and very smart approach. The proposal is very detailed. They have their own website and it looks cool, some research, documents, and sharing are uploaded on social media like Media, youtube, Twitter, and Github. The project team is experienced and clearly with information, being in membership with many institutions. Good budget breakdown. I think there’s a very important point of this project marketing would be more feasible if the team can plan and add to the proposal", "q1r": 5, "q2": "The project is easily examined by the indicators showing community members' excitement. All content will be publicly available, open-source, and marketed through our social channels which are very good for voters and the community can see the impact of the project through the community feedback. The roadmap is planned for the whole year with content goals. However, that would be more specific if the proposer can estimate who exactly will be taking this on and how many.\n\nI do hope the project will be successful. This is a great proposal\n", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13337, "q0": "The Cardano ecosystem is written in the Haskell language and has always planned to provide a path for projects deployed on the EVM-based blockchain to migrate to the Cardano ecosystem, and your proposed campaign is a good one. educational service led by high-level DeFi teams to introduce developers and users into the Cardano space, so it is also a suitable proposition for this challenge.\nYour education campaign will help popularize and shorten the gap between Cardano and developers, thereby attracting more programmers and making positive contributions to the Cardano ecosystem, ultimately people Users are still the ultimate beneficiaries of the good values that Cardano brings.\nBut your education campaign is in English, do you plan to translate it into other languages, like Chinese, Japanese or Vietnamese for example because the East Asian community is also very large while only a few know Cardano, if the project is successful then You can expand your educational project by translating into many different languages, thank you very much, I strongly support your suggestion", "q0r": 5, "q1": "Your action plan lasts up to 12 months and is divided into three phases but that is not detailed enough, You need to clearly state in each month what work items need to be done, it will be clear. clearer and more professional.\nThe budget section is broken down but there is something about your presentation that confuses the reader, actually I was quite confused when looking at your budget breakdown. It would be clearer to write the following, for example:\n  - Content research, organization and fact-checking: $100\n  - Professional writing service: $85, 10 articles = 10x$85 = $850\n  ...\n  Total: ...\nSuch a presentation will be clearer for the reader.\nI only have a few small suggestions in this Feasibility section.", "q1r": 4, "q2": "In general, metrics to measure the success of the project such as: views, likes, comments,,, on your posts, growth in social metrics, growth of active users on Cardano, the number of members is growing, is quite enough to evaluate your project.\nYou said that all of the above content will be publicly available, so where will it be public, you should leave a public link like Google Sheet for example for the community to easily track your KPIs.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "The Cardano DeFi Alliance (CDA) consists of DeFi leaders and prominent builders well-positioned to explain Cardano's exclusive features, how they can be leveraged, and what they mean for adoption.", "experience": "Project leaders of major DeFi dApps, experienced Plutus/Haskell developers, and finance professionals actively building top-tier products on Cardano."}