{"id": 414384, "author": "fractalfuzion", "title": "Eth Rehab - Recovery with Cardano!", "url": "https://cardano.ideascale.com/a/dtd/414384-48088", "category": 26593, "amount": 14000, "description": "Ethereum users may not understand they need to be rehabilitated. Eth Rehab is needed to serve as an educational resource for a smooth transition to Cardano from eth, because eth users deserve better.", "f6_no_assessments": 18, "f6_rating": 3.9259259259259256, "videos": [], "media": [], "f6_assessments": [{"id": 605, "q0": "This proposal aims at creating a rehab process for Ethereum user to migrate to Cardano. As described, the rehab process would be something fun that would make people interested to participate and therefore to learn how the issues that they don’t know they have in Ethereum and present the solutions that Cardano already has. I believe this is a very interesting concept and might work well. Cardano is currently known for being a difficult language, without many resources, and if the proposing team can create a fun way for people get into the Cardano ecosystem, for sure this proposal would bring value to the community. The goal of the proposal is very well aligned with the challenge. Even though the focus of the proposal is on Ethereum developers and not projects or their public specifically, by bringing the developers to Cardano, projects will naturally migrate, and their public as well. Some more details about the implementation of the proposal are missing, in my opinion, since it gives some examples of what the 12 steps would look like, but without knowing exactly what’s going to be included there, it’s not easy to evaluate if the content provided is going to be enough to convince Ethereum developers to migrate do Cardano. Some more information about it would be desarible. Also, I’m not sure if the proposal is going to do an individual guidance with Ethereum developers, or if it’s going to broader and aim at a higher participation. If the latter is the choice, then how would they interact between themselves, are they going to have tasks to do, or is it just a passive course? The KPIs included in the proposal are number of posts, likes, comments and video views, which are ok to help understanding the impact, but it would be good to know how many people went through all the process and how many people actually migrate to Cardano because of this proposal, since this is the final goal.", "q0r": 3, "q1": "The proposing team is itself migrating from Ethereum to Cardano, so they have experience with this process. They are the Fractual Fuzion team, which is not personally known to me, but they provide some links to projects and other media where they are present. They have a page selling fractal NFTs and it looks like they have the technical knowledge necessary to execute this proposal, even though individuals are not mentioned here. They don’t describe specifically how many people would be involved in the execution of the proposal, but they added the hours related to each task and the associated budget. The budget breakdown is good, but for me it missed one the most important things, which is written content creation. To convince an Ethereum developer to migrate to Cardano, it’d be necessary to provide a lot of information and to explain them, and I believe written content, or even just scripts for the videos will be very important. Overall, the budget seems to be a bit optimistic in my opinion, $14k to create all of this might not be enough, at least with the expected impact, and there’s no mention to extra funding besides this proposal. The plan is proposed only in a high level. There is some guidance regarding what would be done in the first 3 months, but the detailed steps of each part of the proposal are not present there, only general statements. It would be better to have included more details on this roadmap, and specially about the 12 steps mentioned in the proposal, since only 4 were mentioned, and this way it’s not possible to really evaluate the feasibility of the proposal because of missing details about its execution. After the 3 months of execution of the proposal, it should be clear what the continuation plan is, if after all is done and executed the proposal would be closed out, or if there’s a follow-up plan or tracking how many developers get converted to Cardano during the process. The only challenge that’s described in the proposal is creating high quality content, although I believe the main challenge is actually the budget, which might now be enough to deliver the proposal’s goal.", "q1r": 3, "q2": "Since the roadmap and milestones are not very well detailed, it is not so easy to keep track of what’s is being develop and to compare it with the proposal. The KPIs provided are mostly related to the last stage of execution of the proposal and are related to the number of views of the content created, mainly, which are probably not going to be tracked because it seems that the proposal is going to be closed-out after 90 days, i.e., after the proposal is executed. There are no KPIs to keep track of the progress of the execution in the previous steps of the proposal. To improve the proposal’s auditability, it would be necessary to provide more details in the roadmap, clearer tasks and KPIs that are also relevant for execution. Currently, the only way to check progress is to, every month, make a qualitative evaluation of the tasks that are described as milestones for 30, 60 and 90 days, which is ok but not ideal, especially with the higher standards expected from Catalyst proposals lately.", "q2r": 3, "assessor": "z_assessor_2110", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13356, "q0": "Introducing new users to Cardano from Ethereum is a pretty cool and refreshing idea with 12 steps you haven't revealed yet, and funding a recovering Ethereum user is good for me.\nYou probably already know that Ethereum is gradually transitioning to Proof of Stake form instead of Proof of Work like they used to do, and miners probably won't like this, Do you have any idea how to fix it? With these people, I think in the context that ETH is transitioning to ETH 2.0, miners are worth our attention.\nThe proposal is up to the challenge and I'm looking forward to seeing how your action plan is and how successful it is, I endorse your suggestion, and hope that you will have many interesting ideas. for the project so it doesn't get boring and promotes more community engagement.", "q0r": 4, "q1": "As far as I understand the detailed plan you have presented, your plan lasts for 90 days and is divided into 3 phases.\nBut there is the ambiguity that I can't grasp all your 12 steps, is this a secret? :), at the stages you have outlined the tasks to do but have not clearly allocated time for each task, so it will be more difficult to manage the plan, you should give each work item certain timelines to avoid overlap.\nA detailed analysis budget table has been allocated by you to each small item, the cost for each job has been calculated specifically and can be measured.", "q1r": 4, "q2": "\"The project will record the number of posts, likes, comments, and video views, to track engagement and will make all data available to the public with full transparency\", very well, this information is useful and you can upload these parameters to a tool like Google Sheet, Google Doc for easier monitoring by the community.\nThe information to measure is very clear, but the targets and KPIs are not clear, the community needs a number for each goal, such as after a period of 2 months there are 20 posts, 1000 likes, 1000 video views... and other numbers to achieve and achieve your goals, thus increasing the credibility of your project.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 11900, "q0": "The  proposal is about solving inefficient crypto practices of Ethereum using Cardano block chain. To do so the proposer will create Ethereum Rehab which will serve as an educational resource for users for a smooth transition to cardano from ETH and thus the proposed solution is aligned to the challenge statement.\n\nAs mentioned the proposer is likely to create a 12 steps program that will focus on finding active Ethereum community members in their respective online ecosystems. All the key metrics and goals that the proposal has seem to be very solid and objective.\n\nThis proposal will definitely will have a great impact on cardano ecosystem if executed well because it is highly likely that Ethereum users may opt cardano successfully because the proposer aims to do so in a very convenient manner.\n\nThis proposal is trying to create not just awareness about cardano blockchain worldwide but also this will bridge chains, cultures and countries together in common spirit and thus this proposal will have an immense global impact as well.\n\nHence I strongly agree that this proposed solution effectively addresses the challenge .", "q0r": 5, "q1": "The proposer has clearly mentioned about the team members. There is only one member currently working on this proposal. He is Fractal Fuzion. All the crucial details regarding experience and expertise is not outlined in more detail. I believe there should have been LinkedIn profiles or some other proofs so that we could know how well qualified and experienced the proposer is .\n\nThe plan and time frame are stated. All the work will be done in 3 phases. All the important tasks which will be undertaken in each phase has been clearly outlined. All the tasks look solid and achievable. It will carry all its activities for a period of 90 days from the funding.\n\nThe budget breakdown has been mentioned. It has been clearly divided into subcategories of tasks to be undertaken. It looks reasonable and sustainable budget. The proposer will not require additional funding and will not return to the catalyst for further funding.\n\n\nI believe the proposer should have considered few more vital risks that would affect the project development like what if ehereum users don’t want to move to cardano.\n\nHowever I agree that this proposal is highly likely to be completed.\n", "q1r": 4, "q2": "The proposer has outlined important key metrics that one could use to audit.\nAll the key metrics look objective and measurable.\n\nHowever I would say it would have been better if the proposer provided a clear road map for auditing along with time horizon.\n\nAll the deliverables are declared clearly and as stated the project will document number of posts, likes, comments, videos, to track engagement and will make all data available to the public with full transparency and this will help in auditing and monitoring the  progress and success of the project.\n\nThere is clear statement of problem and solution and they are well aligned to the challenge statement.\nHence I strongly agree that this proposal provides me sufficient information to audit progress and success of the project.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10878, "q0": "This proposal aims to build a 12 step program to help Ethereum users understand the inefficient crypto practices of Ethereum and provide solutions using the Cardano blockchain. This program will be aimed at onboarding and educating rehabilitated Ethereum users. This is a fun way to attract ethereum users to cardano. It has the potential to resonate with a certain subset of the ethereum community and make the migration fun and educational.\n\nThis is not a project to be launched in EVM so it does not fit perfectly with the campaign guidelines: \"Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily.\" However, I believe it can help to attract new users to Cardano.", "q0r": 4, "q1": "\"Fractal Fuzion\" has experience in both social media and the cardano network as a CNFT creator. He is also part of several cardano communities, which allows him to have a wide network of contacts. More information about his work can be found here: https://linktr.ee/fractalfuzion\n\nThe proposal contains a 3-phase action plan. Each of them is explained superficially, enough to have a general overview of how to proceed. However, I would like to see a more detailed explanation.\n\nThe budget is outlined clearly and broken down into identifiable items. A total of $14,000.", "q1r": 4, "q2": "The project is based on 2 metrics to track its progress. On the one hand, each participant will receive an NFT at the end of the programme, this measure is easily verifiable and allows to know in a transparent way how many users have completed the programme. On the other hand, it is intended to use the metrics in social networks in a public way to measure the interaction of the publications. I think these metrics are sufficient to track the progress of the project in a transparent way. ", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10317, "q0": "The proponent has solutions that gradually solve the problem of the challenge of bringing out the negative side of users when using Ethereum. But will it be difficult to improve the familiar users of Ethereum? When they can still afford the risks that they can still afford. However, the topic of the project is also prepared with questions from those who do not want to change and even do not care much. They also gave an example but only an important example how to help users understand that they need to move to a safe ecosystem, optimizing their spending. The project theme is also trying to expand to help Ethereum users have new experiences, connect to the community, connect cultural domains between countries on a common goal this is also their desire, will bring a high value in terms of the amount of education that will rapidly increase user confidence in Cardano. In terms of risk, there will still be you. But I think everything takes time to upgrade, restore and change, right? Please give them more suggestions so that they can accept and develop more.", "q0r": 4, "q1": "The timelines are very closely linked. From phase 1 they have detailed version, they prepare equipment, materials such as: comprehensive video, logo, music, banner, 3d content, AR, CNFT. They create interviews, discussions on a large scale so that they can have the most sources of access. Following phase 2, I also saw their active work to help members of the Ethereum community reach their full potential. It will take a long time for the reset and recovery of Ethereum users, but you should also understand because it is difficult and difficult to interview and discuss to make users understand. After so many processes, stage 3 shows that the work of this project is quite methodical and careful, they have to work hard to record and receive information so that no one is left behind. The proposed project budget is also reasonable, but I have a small suggestion, if this is redundant, please ignore it. I find the budget to pay for logo design, or promotional video... Why not find Ethereum users they do this also help them better understand the transition to the cardano ecosystem it's interesting and much better than they're using Ethereum? They are also a source of inherent potential, making them think they are the right person to create the most complete Cardano community. I think Ethereum users will soon realize they need to change their mind immediately and forever.", "q1r": 4, "q2": "In order to recover ETH users must complete 12 steps of ETH Rehab after which they will be awarded CNFT, and issue a certificate of completion and the Cardano ecosystem launched. The project has with complete transparency and carefully records the number, likes, comments, video views, engagement and will make all the data available to the public. The project theme also established many community groups to be ready to answer any questions or concerns. The successful idea proposed by the project helps to show Ethereum users clearly where it will not work for users, giving Ethereum users solutions using the Cardano blockchain. The desire and aspiration towards the success of the project theme will help Ethereum users to recover and grow in a great ecosystem of Cardano. However, I think this is also a new project, but it is a combination of experienced people in the Cardano ecosystem and members of the community, you should also give them the opportunity to promote their ideas and ideas. is giving you new opportunities and challenges.", "q2r": 4, "assessor": "z_assessor_3175", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10287, "q0": "The challenge encourages proposals in the following scalability topic areas:\nEthereum users may not understand they need to be reinstated. Eth Rehab is needed to serve as an educational resource for a smooth transition to Cardano from eth, because eth users deserve better.\nThe\n+ Add tags...\naccess\nadoption\nautomation\nblockchain\nbusiness\ncooperation\ndevelopers\neducation\nthe infrastructure\nLocalization\nnft\nscale up\nThe proposal seeking to develop will aim to introduce and educate recovered Ethereum users. effectively tackle the challenge of focusing on finding active Ethereum community members in their respective online ecosystems.", "q0r": 4, "q1": "The proponent covers the background from development introducing new users to Cardano from Ethereum in a fun and educational way\nin one of the comments for the proposal, but did not provide evidence such as links or references. The proponent knows the type and number of team members needed to implement the proposal. The user list contains for most traditional game development roles, but I'd like to see a few with blockchain experience. Blockchain research is mentioned in the plan, but there is no mention of who will do the research and who will develop blockchain integration. This group is not an existing team, but the proponent is planning to partner with a development company12 development steps. Including Videos, logos, banners, 3D content, AR, CNFT. We will also set up interviews, discussions, appearances on as many platforms and community groups as possible.\n Which company is not mentioned in the proposal. More details on the team will be proposed in a future proposal.\nI think tweaking the proposal, and taking into account the feedback I've provided, will result in this proposal receiving a higher Viability rating than is currently possible. I disagree that it is very likely that this proposal will be implemented as successfully as the current plan.", "q1r": 4, "q2": "\"The proposal clearly defines the progress for the project, and having these projects feature a complete 12-step program that will identify Ethereum's inefficient crypto operations and provide solutions using Using the Cardano blockchain, a successful project should be easy to use, have a professional design, include a great NFT when completed, also need to be easy to listen to, fun and educational. User satisfaction and providing them with a quality education that promotes lifelong learning opportunities for all concerned will provide the community with insight into progress and implementation Proposal is successful. Proposal clearly defines what will be done and how, happy with the auditability of this proposal. This proposal has not been funded in any previous funds. in Catalyst. It's a new recommendation from an experienced Cardano user and community member", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10128, "q0": "The proposal team came up with an interesting idea when creating '' 12-Step Program will comprehensively include Video, logo, banner, 3D content, AR, CNFT. Also will set up interviews, discussions, appearing on as many platforms and community groups as possible.'' To help ETH users make the transition to the Cardano blockchain, this is in line with the proposed challenge as well. like setting a good future, and helping people from ETH to convert to Cardano more clearly can't be boring, it has to be really interesting to drive community engagement. your creation.\n\n  The team of authors has presented a good idea to the community. As well as they have considered the risks carefully and anticipated the risks that the idea has encountered. This idea has a powerful impact to help transitioners from the ETH ecosystem and educate them to be aware of the outstanding aspects of Cardano. When this idea is successful, it will bring new members from the ETH ecosystem to our community. This helps to develop and expand the community more. I look forward to seeing this proposal go live. and best wishes to the subject matter.", "q0r": 5, "q1": "The proposal team has provided a full roadmap to help the proposal work properly. Comes with definite timelines to complete the proposal mentioned in the 3 roadmap phases of the proposal. the proposal also provided a clear and transparent budget breakdown and matched the requested amount of $14,000, the amounts to be used were fully mentioned and clearly explained the budget allocation items, to be able to execute the idea really well.\n \n  However, the authors seem to have forgotten to mention the social spirits of the group members, and I have a suggestion for you. That can add to the team's work breakdown table, to help everyone complete the assigned work better. This is also a good idea from the team that has provided and brought a new experience of ways to extend the Cardano ecosystem, to users converting from ETH to.", "q1r": 3, "q2": " During the implementation of the idea, the author team provided KPIs to consider the success of the project at launch. But the team can add some ideas to the index such as the number of participants. The number of people using the successful conversion document, or the number of people who have access to these 12 programs, helps the project to accurately measure the success of this idea.\n\n   The project theme clearly describes the success, and the benefits brought from this 12-step educational idea are clear, to be able to provide solutions to switch between ecosystems, as well as create new information. transparent news to help people interested in Cardano join the roots. And I'm pretty excited to test it out once it's up and running.", "q2r": 4, "assessor": "z_assessor_3160", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9798, "q0": "The proposal addresses the challange of migration from ethereum to onboard to Cardano. The proposer suggest a \"12 step recovery program\" to incentivise new users to the ecosystem . The proposer suggest community collaboration such a sponsors for ethereum users willing to participate in the experiment. The proposer could have potential global impact because of visibility of social media. The proposal suggests to spread awareness about cardano blockchain worldwide. This proposal seems like a fun and engaging way to onboard new users whom have a bit of humor to past experiance using ethereum.  \n", "q0r": 4, "q1": "The ETH REHAB proposal suggest a timeline into 3 phases starting with the development of the program. The team will use incentives to celebrate users in the program with tokens and Custom NFT.  The proposers suggests that it will bridge established users in the community to help establish great connections and useful information . in the 3rd phase of documentation the proposal suggest that all sessions will be recorded for educational purpose and to be used for future sessions. ", "q1r": 4, "q2": "The proposal for developing and implementing ETH REHAB is sufficiant to audit the progress and success of the proposal.  The proposers are requesting funds of $14000 that includes writing and editing , logo design, cardano artist , marketing budget, promotional media, and giveaways. The proposers suggest auditbility here, \"The CNFT's will be minted under a dedicated policy ID that will allow the community to see how many completion certificate CNFT's have been minted under the policy at Cardanoscan.io.\nThe project will document number of posts, likes, comments, video views, to track engagement and will make all data available to the public with full transparency.\"", "q2r": 4, "assessor": "z_assessor_3098", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8660, "q0": "The main body of this proposal is a campaign to introduce Ethereum users to Ethereum limitations that Cardano can limit and overcome to promote user conversion from ETH to Cardano. With this core idea in mind, the project fits perfectly with this Challenge's goal of educating Eth users to give them different reasons to convert from ETH to Cardano. The author also gave an overview of the content of their 12-step campaign, the organization, and the user conversion rate commitments for Cardano.", "q0r": 4, "q1": "I have seen your efforts in presenting the core ideas and developing a roadmap to develop the plan full of the necessary information including key tasks/goals and deadlines for completing them. The proponent also applies the formula to estimate the number of working hours x the corresponding remuneration for each job and employee. Budget allocation is fully linked to the project development plan that has been laid out. For the member presentation, I'd encourage the author to be able to provide any verifiable resume like Linkedin, CV, certificate of achievement, etc that might reinforce what you're talking about members of this project. I saw you mentioned “Cardano Stonerz club OG, 2500 club members”, you can describe more clearly the role of the project member in this club to show that the members have a certain understanding of Cardano and are active on Cardano.", "q1r": 4, "q2": "In this section, you have done a great job of committing to public reporting for audits and as a tool for those interested in the project to track the progress of the project. However, the indicators that the author gives to measure the success of the project such as the number of users converting from ETH to Cardano, the number of CNFT certificates completed, and the satisfied response rate of the users should be more specific, including a definition of KPIs, predicted numbers for those KPIs, timelines to conduct a successful assessment. ", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6966, "q0": "   -  I agree Ethereum is currently developing very fast its technology. However, myself and probably many others have not seen the problems that Ethereum is facing. with the idea of ​​bringing Eth Rehab - Recovery with Cardano! is a very good idea.\n\n    -   Here I see the team that raised issues like Eth Rehab will serve as an information hub to help smooth the transition to Cardano. and identify inefficient Ethereum crypto operations and provide solutions using the Cardano blockchain. The team reported the issues very fully and specifically.\n\n    -  The solution that the group raised identified problems such as. it's a great way to introduce new users to Cardano from Ethereum in a fun way. This will increase the amount of education about Cardano for Ethereum users. Spreading awareness about the Cardano blockchain. also very important. that will connect chains, cultures and countries together. I found the solutions the team came up with to be up to the challenge.\n\n   -   Besides, the group also raised the risks that the project may face such as. does not create interesting High Quality content to attract followers. and the group has not yet outlined how to minimize those risks.", "q0r": 3, "q1": "   -  A section that provides a blueprint, including progress and milestones to deliver your proposal. I see the team has identified major milestones. The project will be completed in a period of 6 months. and has been divided into 3 specific phases. I think the above timeline is completely reasonable to carry out the proposed work. Specific objectives have been set out as outlined in the three phases. However, the progress of the project is not easy for the community to follow.\n\n   - With detailed budget analysis. With a budget of $ 14,000 and has been divided into many different parts to cost, for example, the cost of writing the story, the promotion, the cost of distribution, the cost of advertising, the cost of making promotional videos. I find the above cost and broken down as in the proposed proposal to be reasonable. However, it is not known if the group needs more backup plans in case ADA slips.\n\n  - In the section provide detailed information about the people who will work on the project. I see the group has mentioned a key member, and it is said that they can ask friends in the group for additional help. Through research, I found that 1 member's working experience is quite good.", "q1r": 4, "q2": "   -   Regarding the description of measuring and tracking the progress of the project, I see the team has listed several indicators such as. Eth Rehab 12-Step Recovery Program for Eth User Recovery. The project will record the number of posts, likes, comments, video views, to track engagement and will make all data available to the public with full transparency. Fractal Fuzion is always at the service of the community if you have any questions.\n\n    -  When it comes to project success. I see that the group has also mentioned certain successes such as. A complete 12-step program that will identify Ethereum's inefficient crypto activities. has a professional design, includes an NFT that is fun to complete, easy to listen to, fun and educational for the built-in user. I find the success of the project very much related to the issues in the challenge. However, the project is still at the model, not tested yet.\n\n  -   On funding. This is a new project so it has never been funded. I hope that the proposed topic will have success in this FUND.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 5558, "q0": "This is a good idea to get users and projects on Ethereum to see the problems they are facing and understand the solutions to the problems through the 12 steps outlined by the proponent. However, this proposal does not specify which areas will focus on specific or cover all areas? because in addition to the general problems, there are also specific problems in each field and need experts or complex solutions to prove it solves that problem. The target audience of the proposal is developers, users, investors, or miners who have not been mentioned in the proposal. The proponent gives an example of 5 steps in 12 steps that will be built, but it is not clear to highlight the solution that is focusing on attracting users (eg Step 5 - We will provide issue (30, 60, 90) day tokens in the form of NFT, to celebrate the recovery). I understand these will build (Videos, logos, banners, 3D assets, AR, CNFT) and use social media channels to deliver the content.", "q0r": 3, "q1": "Proponents also clearly see the risk, the main challenge for this initiative is not creating interesting high-quality content. I can suggest solving this problem that the proponent can add in a certain step a discussion or meeting with experts who have been successful in that field on the Cardano platform, then the solutions or the quality is gradually perfected. The proponent stated that the roadmap is divided into 3 phases (30, 60, and 90 days), and the implementation content in each stage is general (The first phase will last approx. 1 month and will set up the infrastructure. tier of the campaign the first thing will be to make sure the talented artists contribute to the project) who are the project contributors, what are the criteria to choose from and how to ensure they will join the project ?. (Phase 2 will aim to introduce and educate recovered Ethereum users. The 12-step program will focus on finding active Ethereum community members in their respective online ecosystems. them) the proposed team should add the work items to see how to do it and its success. Proposed costs are detailed and heavily focused on promotional communications for example (Marketing budget $2000 / Paid promotions, distribution = $800/Twitter Space-Specific Ads $300 / Promotional video - $1500 / Gift + CNFT budget = $780) represents ~50% of the proposed budget. The proponent can supplement the cost of the conference discussions or invite experts in many fields to participate instead of just one person. The proposer identity is provided clearly and with social networking sites, it would be great to provide more information about who will be invited or hired to collaborate on the project", "q1r": 3, "q2": "The audit content provided by the proponent is also general and incomplete. The information to be able to track the development of this project is scant and difficult to quantify. This tracking can indeed be done through the information provided in the project phases, but the details in this section are not enough. It will be interesting for them to prepare tracking material that will be disseminated on many channels, not only on social networks. Proposers can add the number of people or projects participating in the discussion, the number of solutions built, the number of videos, and the number of likes, or they can do more surveys and publicize the information. This is for the community.", "q2r": 2, "assessor": "z_assessor_2714", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3604, "q0": "The problem of analyzing gas waste for old technology centralized miners to show Ethereum users the problem they are facing. In parallel with this, it is proposed to present the advantages of using Cardano.\nThe specific solution is to use Cadano blockchain, 12 steps are suggested to solve the above problem but I just saw you build to step 5.\nThe proposed goal is to spread awareness about the Cardano blockchain around the world..\nProject risks are stated very precisely for the purpose of communicating, if your content is not creative and unique, it will not attract viewers. So, creating quality content that is easy to understand by readers will definitely help Cardano become more known in the blockchain community.\nI agree with this suggestion", "q0r": 5, "q1": "The detailed plan given includes 3 phases\n- Phase 1 establishes the infrastructure, focuses on marketing: interviews, discussions on the platform, and is expected to take 30 days to work.\n- Phase 2: looking for Ethereum community members to introduce with videos built in phase 1, done within 60 days\n- Phase 3: record the progress of the entire expected campaign within 90 days.\n Recording the progress in stage 3 I find a bit redundant as this will be recorded throughout the entire process from start to finish, no need to separate as a separate stage. If stage 3 is that it makes more sense to complete comprehensive educational videos and release them for the community to view, evaluate, and provide feedback on.\nProposal to provide detailed budget table for related works\nThe question I would like to propose to clarify is how the 12 steps of the program are allocated in the 3 phases mentioned above, the detailed budget I do not know how to divide at each step.\n As the information provided, the team consists of many components, but there is no detailed table of each employee, their identity for the community to confirm.\nTeam quota and budget I think the proposal should be made more detailed associated with the 12-step program so that the community can see the feasibility of the project.", "q1r": 3, "q2": "For those who specialize in blockchain technology, they will check the first metric: the number of CNFT completion certificates that have been minted according to the policy at Cardanoscan.io.\n2nd metric: posts, likes, comments, video views, these metrics will be checked from the community of non-technical people.\nI haven't seen the complete 12 steps, which are the steps and details of each step, so I see the solution clearly. This is a minus point for the transparency of the project\nThe point I agree with the proposal is that the community's satisfaction when having access to quality documents that are easy to understand, listen to, and use will be the greatest success of this project.", "q2r": 3, "assessor": "z_assessor_2464", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3111, "q0": "Besides an ingenious project name, the proposal aims to create a 12-step program to help Ethereum users onboard by learning the inefficiencies of Ethereum and the solutions provided by Cardano. This interesting approach tailored to projects/people from Etherum will definitely simplify the migration process that is the ultimate goal of the challenge. With a low budget and a clear non ambitious scope,  the proposer will make a significant contribution to promote Cardano into others communities by providing an interactive fun experience. Can’t wait to see it (that’s why the 5-star score).", "q0r": 5, "q1": "The proposal includes several links to the content produced by Fractal Fuzion, a digital artist since 1998 that specialize in graphics and video content production, CNFT creator, and many other Catalyst/Cardano community roles. The evidence shows the capability as a creator of content, that is the main deliverable of the project. Furthermore, the plan is clearly organized in a professional way, from storyline, hiring, design, promoting and even music. At least from my knowledge, I couldn’t find gaps that may compromise the feasibility. The proposer has connections with other artists from our community that may help to the outcome.", "q1r": 5, "q2": "The project does not finish only with the creation of the program. It also includes the promotion to attract people to go through the program and giving a CNFT at the end as a proof of attendance. Not only the project can be audited, but also its success after launch can be tracked by the minted NFT and by post and references provided by the audience.", "q2r": 5, "assessor": "z_assessor_2402", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 2771, "q0": "“The problem the team came up with to provide a solution is this: there are a lot of developers on Ethereum who haven't discovered great features that surpass Cardano's Ethereum platform such as transaction fees, security, and ways of doing things. eUTXO's ledger entry is different from AccounTing and its quirks, that's what this challenge is all about *the solution the proposal offers will be mainly Marketing-oriented how the solution works is finding find active members in the Ethereum ecosystem calling and explaining to them why it is important to switch to Cardano, with 12 steps in action I am most impressed this propaganda step sounds fun but can be effective : Instead of \"\"Friend of Bill\" it could be \"\"Friend of Hosk\"\" which has a lot of content in 12 steps of offer proposal but all focus on content marketing, very cool this can also be a good way, because most human behavior will focus on what's fun and beneficial, so i'm up for it This solution. *This project is mainly developed for the community, so it will also minimize risks. \"", "q0r": 5, "q1": "\"i agree with the three phases of implementation of this proposal as it's primarily community development so it doesn't have much to do with engineering so there won't be a story of difficulty and delay here it's just effective or ineffective?\n   the budget sheet has a small issue that could be a display error or the proposal has other purposes but hasn't stated that the requested amount is more than the cost calculation amount below. hope the proposed thread can explain more about this issue.\n    The team can easily verify the experience at the link I visited and there is a funny saying for you that is beating marketing\"\". \"\"\"", "q1r": 4, "q2": "“this is a project that will develop videos and comparative analyzes between Ethereum and Cardano. So this one-time grant can be used to spread the basic explanation to new generations to come. .* all work on this proposal is located on the proposal's website so the release of videos or posts are seen on it, and the success is the interactions of the student community. ethereum states and then their movements,\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 2, "ng": 6, "nfo": 6, "vca_o": 1}, {"id": 1283, "q0": "The aim of the proposal is to develop a 12 step recovery program aimed directly to Ethereum community members, with the goal to point out inefficiencies of Ethereum and to display solutions of Cardano. The program will have onboarding function whilst the proposer claims that it will be done in a fun and entertaining way. Although the idea seems fine, it is important to note, that it seems that the proposal is taking its basics from the actual recovery program for addicts, and from my perspective there are the following drawbacks: some people might get offended by it, and its popularity can just explode to 0. As we all know, being marked as an “addict”, or actually going through a rehab is not very flattering (that is why we have Anonymous group sessions), I could not find a reasoning why this proposal would gain traction, rather I assume the opposite. The goal of Cardano is to create a movement from other blockchains (in this case ETH) to Cardano blockchain, by simply providing a better environment. By displaying the negative aspects of other blockchains might be considered as an assault (we already see twitter communities arguing over way smaller topics). Also, the goal is cross chain collaboration, and being “recovered” actually means that ETH = bad, ADA = good, thus you are cured. Regarding the risks – I think the highest risk will be to gain traction, and actually re-define the perception of the word “rehab” in peoples minds. I think you will have a hard time to actually connect “fun” and “rehab”.  Based on these points, even if executed correctly, I am afraid that the overall impact on the migration from ETH to ADA will be still very low. ", "q0r": 2, "q1": "The proposal contains a time schedule – 3 phases, each one month long. The first phase/month is devoted to actually developing the 12 step program and to prepare marketing material. It would be nice to see the estimated time and the proportion of these days e.g. 2 weeks 12 step program and 2 weeks marketing material? Or simultaneously? Or another ratio is expected? What will take more time? At least the first month could have been more detailed. Now it appears that it will be finalized during the process, and that it is not clear yet. The second phase is focused on “finding Ethereum community members in their respective online ecosystems”…well, makes me wonder, what does it mean? Jumping to discords and twitter groups to promote ETH rehabilitation? This part is not quite clear. Given the budget, it seems to be well thought, but when calculating the hours, it gives 234 hours which is 30 working days, thus one month and half (calculated only those where hours estimate was provided) and it makes me wonder, how many people will be actually working on these, how many of these tasks are already having some partnerships, or nothing is pre-agreed as for now? What would be the actual tasks performed by the proposer, and what will be outsourced? Is the song for eth rehab actually beneficial for the whole project? I think the budget is containing items that are not quite relevant for the online marketing and the online content. Regarding the team, it appears that there is only one proposer who claims to be the project manager and other members are not disclosed, or are not agreed as for now. Based on the experience stated by the proposer, it does not appear that he possesses the relevant skill or experience. Neither a history of being a project manager in past is disclosed, and there is no linked in profile to provide another level of verification. ", "q1r": 2, "q2": "The problem is defined as eth people not being aware they need to be rehabilitated, and the solution is to offer them the rehabilitation program for the recovery. Although it might sound logical, I did not find any proof other than the proposer claims to support the problem statement. Given the KPIs, people who undergo such a program will receive a Cardano NFT badge so we can track the numbers. Also, the engagement (number of likes, comments, video views, posts) of the community can be tracker, and I find these suitable. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1158, "q0": "The proposal addresses the challenge as it aims to bring current users operating on Ethereum to the Cardano ecosystem.\nIn particular, the proposal goal is to create a 12 steps program to educate and convince Ethereum users to leave their blockchain and joining Cardano, not only highlighting the defects of Ethereum (e.g. high gas fees), but also assigning them a Cardano sponsor to guide them thorught the 12 step program.\nI like the idea of setting objectives at 30, 60 and 90 days for whoever joins the project, marked and tokenized in an NFT form, minted on CNFT.", "q0r": 5, "q1": "The proposer, Fractal, is already experienced Caradno community memeber and he's a CNFT artist.\nThe proposer provided a main page containing all the artist references on several social media (e.g. Telegram, Instagram), so it's possible to verify that he's indeed engaged within Cardano ecosystem, \nand he's capable to potentially bring this proposal to completion.\nIt's also possible to see that the proposer was taking part in another proposal on a previous fund, related to marketing.\nIt's not clear how many 'cycles' of 90 days will be covered with new batches of users before declaring the proposal succesful. \nIt would also be nice to have a user who already migrated from Ethereum to Cardano, as a sponsor/guide.", "q1r": 4, "q2": "The proposer asks for 14000 USD, which are equally distributed between the different items, such as marketing, storyline creation, NFT creation, programming budget, final editing and execution.\nIt's not clear which programming is needed, I would like to see more about that item. Is it about the website that you will use to illustrate and follow the user across the 12 steps?", "q2r": 5, "assessor": "z_assessor_2215", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 13763, "q0": "The project properly addresses the challenge since it directly focuses on the problem which is that, there are improper practices being used in the etherium market which has caused several users a problem in the funding, usage and study of the currency, thus also leading to a dissatisfaction from several users . This rehabilitation is a head-on approach to the eth market and promises to entice as many users as possible to accept being rehabilitated with ada coin knowledge and CNFT trails to be able to transition into the usage of cardano technologies. With the previously stated reasons for entrusting the project with the funds requested, it would be more inviting if the proposer was to reveal more information and be a little bit more generalised as many products and services stated will be understandable only by people(PAs, vPAs & voters) who have a clear understanding of cryto technologies.", "q0r": 4, "q1": "The plan will be implemented successfully for the period and steps that are written in the plan, this becomes a view that still stands that the plan is a plan that is steered directly at the plan but is released as pending further development(strategies or planned action). The budget of 14000 USD is a good value to start on but the plan may in future require extra funding as plans and requirements for the etherium community are not listed the plan or the budget. Fractal Fuzion is a name that have some cryto coverage and is acceptable to be a person of interest when looking into the people who will be working on this project but his/her name being everywhere and not showing anyone else as brings a threat to the understanding of project roles and also auditability. If the above arguments about community funds being needed are null and voided then the project becomes more viable as it is stated that the funds will be required in a turnkey method(one-time). Another supporting revelation to the possible success of the project lies in previous experience working with the Cardano funding system, but the age of the experience would be more eye-opening to understand how clearly the team can engage with the new methodologies implemented for fund 9. ", "q1r": 4, "q2": "The auditability of the project is of a upper level as the steps listed to allow for auditability are not too complicated. The 12 step even though not fully revealed as to what is features will be the first step in auditability as users will follow this process to allow for rehabilitation and upon completion they will receive ID code minted NFT(Non-fundable tocken) which the minting will be placed according to the Cardano.io system for scanning and verification. The social interactions stated in the impact declaration will be analysed and results posted for the public eye to peruse. This project is a new project into Cardano.io but is presented by experienced members in the cardano community. The important factor for auditing will be that the system proposed once to is live and running and if there are events the cardano community must see early rapid growth within the system as poaching unsatisfied ETH members for rehabilitation is a great first step that will if successful make for a very serious amount of traffic, so being strait to the point if the first 90 days ends and there is a small growth in rehabilitation members then the project will have not satisfied it's aims for the time-frame that is released in the plan.", "q2r": 4, "assessor": "z_assessor_3784", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14550, "q0": "The proposer aims to build a 12-step program to help Ethereum users understand the inefficient crypto practices of Ethereum, and provide solutions using the Cardano blockchain. I strongly agree with the proposer that this is “a great way to onboard new users to Cardano from Ethereum in a fun, educational way.” This will increase the amount of education about Cardano to Ethereum users, and bring more former Ethereum users to the Cardano ecosystem. So, the proposal is pretty well aligned with the challenge. However, some KPIs to measure the impacts of the proposal are missing. I suppose they could be the number of former Ethereum users registering to use Eth Rehab, the number of program finishers, the number of former Ethereum users successfully onboarding to the Cardano ecosystem, etc.\nThe proposal presents one foreseen risk during its implementation. It would be great if it came with a solution. My recommendation is to carry out 3 tasks simultaneously: (1) building an open community/ or a public sharing circle of former Ethereum users in need of rehabilitation where they feel free to raise their voice and share their stories (2) investing in researching and building high-quality content that works and (3) promoting the community and the Eth Rehab program to boost its coverage", "q0r": 4, "q1": "The proposer presents a detailed roadmap to conduct the proposal with estimated duration of time spent on each. Unfortunately, it isn’t accompanied by the expected result of each phase. For example, the second phase is aimed at “finding active Ethereum community members in their respective online ecosystems.” I wonder how many members are anticipated to be found to join the Eth Rehab program. Regarding the requested budget, it’s broken down into 12 smaller parts which cover the proposal finance comprehensively. About the team members of this project, there is insufficient information. The proposal provides some information about the project manager (his background and related experience), but without a means or reference to verify it. Other team members haven’t been specified yet. We have no idea who is going to take charge of the storyline (Writing and editing), logo designing, marketing, etc. as stated in the budget breakdown. The proposer has “many talented artist friends in the Cardano community” to rely on for help and creative input, but the feasibility of the proposal requires fixed core team members with a high level of commitment, instead of a source of “help” during the implementation of the project. So, I believe more information on the personnel of the team should be elaborated on.", "q1r": 4, "q2": "The project is going to document the number of posts, likes, comments, video views, to track engagement and will make all data available to the public with full transparency. This is a reasonable way to measure the project progress and development. This is clear but isn’t sufficient enough. I guess it’s also necessary and possibly more important to track the number of former Ethereum users taking part in the program and winning its completion certificates. Specific KPIs as such should be worked out to better audit the project.", "q2r": 3, "assessor": "z_assessor_4072", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Develop a 12 step program that will identify inefficient crypto practices of Ethereum and provide solutions using the Cardano blockchain. The first step to recovery is admitting you have a problem!", "experience": "I myself am a recovering Ethereum user and understand inside the mind of a ETH user. Ethereum users may not understand they have a problem. Ex. gas fee's wasted on centralized miners using antiquated tech. Eth and Cardano community member, NFT artist, SPO, Shill-a-mania Champion."}