{"id": 414614, "author": "matt.artano", "title": "Creatives Migrating Campaign", "url": "https://cardano.ideascale.com/a/dtd/414614-48088", "category": 26593, "amount": 73300, "description": "Many creatives, galleries and museums haven't had the chance to explore the Cardano blockchain. There is no unified marketing effort to try to onboard them, and messaging hasn't scaled yet.", "f6_no_assessments": 16, "f6_rating": 4.145833333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1284, "q0": "The aim of the proposal is to unify the marketing effort by community to onboard new artists, promote Cardano as a suitable place for galleries, museums or another institutions. The content of the campaign would be comparing the features of Cardano vs Ethereum, whilst using a data driven source. It is true that the reason why Ethereum is a leader on the market both by volume and new project launched is due to the fact, that it has the biggest appearance. To catch up, or even exceed it, the proposers wants to create a communication platform #CardanoCreators, and it will end up as a hub for everyone that is interested in NFTs. It will be focused on current ETH projects, as well as new projects to be launched. The current ETH projects migration to Cardano will be performed by customized case-by-case approach, and since there is no other information mentioned, I assume it will be some consultations in the form “how to”. Overall I agree, that marketing, appearance and visibility of Cardano is something that can increase migration from Ethereum (or other chains, or even other fields, not strictly NFTs), and can benefit the blockchain as a whole. ", "q0r": 5, "q1": "The list of activities is provided, and just to name a few, there will be a new site on artano website, new Instagram or discord  channel dedicated for these purposes and podcast and youtube content. These activities will be developed over the course of six month, whereas months 1-3 are containing a weekly detail of tasks to be performed and months 4-6 are having high level tasks outlined. This level of detail is providing a clear picture how they plan to proceed.  The budget is 73 300 USD in total, and it is stated that it is consisting from 2 budgets. The first budget is “marketing budget” and its amount is 14 500 USD and its purpose is solely for advertisements and marketing on the media Reddit, Instagram/Facebook, Twitter and some unnamed Advertisement agency. The proposers claim that they already reached to these listed mediums, so we can assume that the budget is already pre-determined. The second budget is “Team budget” and is divided by 4 members – Marketing lead, Community manager and Project manager for 6 months, and designer for 3 months, whereas the hourly wage is ranging from 20-50 USD, which I find reasonable. The team mentioned is currently consisting from 8 members and 2 advisors, but as it is stated, the new people would have to be hired for the listed positions. Inspecting their website brings confidence that they are skilled at what they do, so they should be able to hire people meeting the requirements. Nevertheless, linked in profiles could have been posted for the current team members, just for display. ", "q1r": 5, "q2": "The problem (lack of visibility) and the solution (marketing campaign by community) is clear, and logical. Regarding the KPIs, the plan is to monitor the number of users on their NFT marketplace Artano, and maintain the communication with other marketplaces, whether a trend could be observed. Although, not every newcomer will be result of the proposal, thus I do not consider these metrics very reliable. Another metric that they will measure will be the number of posts and trend in hashtags related to the proposal such as “Cardano ART” “Cardano collection” etc, which is way better metric to observe. The next metrics are of course engagements with podcasts and youtube content such as likes, shares, subscribers etc, and a very interesting metric would be 1/1 NFTs volume posted to marketplaces, which could signal an inflow of such artists. The success is described as increased proportion of NFT volume (ADA vs ETH) which I am not really sure how it will be done, and also, it is unclear how they will monitor ETH migration to ADA. Maybe add another hashtag “CardanoNFTMigration”? or smthg similar, so it provides some idea.  Another source for audit can be also any medium /twitter, reddit, instragram, discord/ and overall I find this proposal audit able. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 2059, "q0": "The point of this challenge is how to make dApps and other projects scale or move completely from Ethereum to Cardano easily and quickly? This proposal is addressing the challenge of creating a community-sponsored marketing campaign that focuses on advertising, artists, galleries, museums, and institutions, to make Cardano your go-to place for artists and creators. In other words, doing a marketing campaign that will promote Cardano, and showcase Cardano as an industry leader in NFTs, using a data-driven approach, will show why Cardano is A better, more sustainable place than Ethereum for artists, creators, galleries, museums, universities, and other institutions. Through this proposed marketing campaign we want to bring as many Ethereum artists, collectors, and projects as possible to Cardano. By advising artists to create a communication platform called #CardanoCreators where the stories of Cardano artists and digital influencers can be told and spread for other artists to find and the platform will highlight all the benefits and strengths of competing blockchains. The problem and the solution are reasonable and within the scope of the challenge", "q0r": 5, "q1": "The author provides a good explanation of what his project is exactly and how it will go. We are provided with a 6-month roadmap and provide very detailed activities that will take place each month, even by the week. So we have a very precise view of what will happen. Regarding the budget, it is also explained in great detail. The budget will be divided into 2 parts: 1 for marketing and 1 for team budgets. In each section, the cost is also listed very specifically, in the marketing section we know what activities it will be used for, similarly, in the budget section for the group, we also understand how much money will be paid. who pays their hourly rate, as well as the number of hours dedicated. And finally about the project team, this part I think is not satisfactory. It is proposed to provide some information about their names as well as their professional roles, besides the project has the presence of 2 advisors. In addition to the above information I think we need to know more information such as the roles of the members in this project, their resume, to understand more about their career and previous experience, also like if they have any kind of relationship with the Cardano ecosystem or a link to each member's profile, it can help us understand more about them and give us an idea of ​​the team's capabilities this.", "q1r": 4, "q2": "Regarding the auditability to check the progress of the project, I think it is not very good. The author provides several ways to be able to track the progress of a project such as:\n-\"We have provided a fully functioning NFT marketplace, so we will be able to measure the number of new users on Artano. We will be communicating with other marketplaces to measure their success based on the number of users who have joined.\"\n-\"We will measure our video views, our podcast subscribers, and the number of visitors to the Cardano Creators page.\"...\nIt can be seen that this is a way to track progress internally by the team, not a way the community can participate. I think the proposed team needs to prepare reports, at least monthly, with updates on project progress and also to be shared simply and directly with the community of people who are interested in the project this is yours (on some social networking sites, for example).\nThe success of the project is also the success that the campaign is aiming to attract thousands of new users from Ethereum to Cardano and has increased the proportion of NFT trading volume on Cardano compared to Ethereum in favor of Cardano.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 3605, "q0": "The issue of bringing and applying blockchain to galleries and museums is like drawing a path or renewing the old and new path for the traditional art industry, instead of having to go directly to the gallery to see. looking at the works, now we can sit at home and watch.\nThe proposed solution that \"wanted to create and execute a marketing campaign that would promote Cardano\" was also a challenge. It is true that Ethereum is very popular and most of the artists using NFT are here. Changing the old traditional habits of both creators and users will require a lot of time and perseverance, and this will also be a big risk, difficulty and challenge proposed to be solved. But nothing is impossible if we don't go, how will we come? I support this proposal", "q0r": 4, "q1": "The booming NFT has brought attention not only to the blockchain community but also to artists and celebrities. Until now, everyone is familiar with the traditional channel, the step of including this channel has helped the community to see this proposal more feasible. The promotion process on the traditional channel: small web, instagram, youtube will attract attention. However, it will be difficult to implement and meet legal barriers because currently blockchain has not been officially recognized, this is the point that reduces the feasibility of the project.\nThe budget is mainly allocated to personnel costs, but the new work plan has initially basically built the web and connection, I have not seen any progress to achieve the original goal.\nThe project team listed shows all positions from advisor to manager, member but I don't know the specific work each person is allocated to each stage position.\nVery vague so the community can check the project progress.\nAs such, I find the proposal unworkable", "q1r": 2, "q2": "The project measurement plan outlined is just recording interactions on the traditional channel, there is no specific score for any indicator/KPI.\nThe blueprint of the proposal is very simple but it built to be a huge success like it made a huge migration \" we have attracted thousands of new users from Ethereum to Cardano and have increased the share of trading volume. translate NFT...\".\nAs mentioned in the beginning, to do this, there are still many barriers and time.\nThe budget allocation is not reasonable, the implementation plan is still just a basic thing, but the success is huge, the steps are in conflict with each other.\nI find it not transparent", "q2r": 2, "assessor": "z_assessor_2464", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 5559, "q0": "The proposed community-sponsored marketing campaign, focusing on advertising, artists, galleries, museums, and institutions, places Cardano as a hangout for artists and creators. The idea is good but I think it does not fully meet the requirements of this challenge of getting planned or launched projects on EVM-based blockchain implementation in the Cardano ecosystem easily. The solution proposed by the proponent to attract artists to migrate to Cardano is to create a communication platform called #CardanoCreators, which will bring these stories to the world, it also has all the important information important on how to get started on this blockchain and it will highlight all the benefits and strengths compared to competing blockchains. However, the proposed team has had some success in the past (Cardano Surrealist Collective: already) created the first collective for artists in surrealism where 75% of them are NOT Cardano natives / Referred over 50 artists to Artane). It is proposed that this approach can be extended to many other fields. And the content strategy focus group will include outreach campaigns targeting artists interested in digital wallets and coins with campaigns retargeting people interested in the topic, and creating a channel to eventually attract new users to Cardano.", "q0r": 4, "q1": "The group has 10 people including 2 advisors, each person's expertise is suitable for the proposed content, but there is no information to confirm the identity of each person through social networking sites and It will be difficult to find out and verify the information. The budget is stated in 2 marketing sections and for the team, the marketing part (Reddit / Instagram / Facebook /Twitter / Ad Agency) totals $14500 which is ~20% of the total proposed budget and unit price for each. The channel is different and the proposed team has not provided any further information as to why. With a team budget for 4 positions priced at hourly rates, only a full-time marketing lead, and the other three part-time, the budget is reasonable to hit the target. Proposal to provide a reasonable plan and resources to be completed in 5 months and 6 months of implementation (Summary of campaign, evaluation, and results, sharing of existing strategies and results with Cardano community to everyone can benefit from the campaign). The proposal team also anticipated the risks (artists not ready to switch to Cardano / established artists and projects, who have their audience on Ethereum) it would be great when the team comes up with a proposal. solutions to reduce this risk.", "q1r": 4, "q2": "The project roadmap is done in 6 months and is broken down into weekly tasks to complete the work, it shows all the work controlled and verified, I appreciate this. Regarding the end product which is a fully functioning NFT marketplace, I believe complete and satisfactory information has been established. We know what to expect, in terms of project development, partnerships, the public response through interaction (number of new users on Artano / measurement of video views/number of subscribers) podcasts/visitor counts) These are obvious ways to see if a team's social media growth is successful, but I think there should be other ways to better understand the impact of the project, in addition to knowing how many more people are on social media, it will be interesting if we know how they will relate to the Cardano ecosystem, join entrusting them with some pools in our community? They have become active participants", "q2r": 4, "assessor": "z_assessor_2714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7768, "q0": "The proposal is effectively in objectives of challenge, it contributes to onboarding new people and specially (artists, galleries, and institutions) those who don’t explore the cardano blockchain dueto lack of a marketing space and level of messaging. Onboarding this new minds, new experiences will have a large impact on the cardano ecosystem. The approach choosen by the team is to make cardano more visible for artists who are actually ambracing the NFTs for selling their work, and show them more reason to come on cardano from Etherum. The project is scalable and will need to comeback in further funds to influence more artist and collectors. ", "q0r": 4, "q1": "The proposer has presented a detailed profile of people that will work on the project and we can discover each one’s abilities and role in the success of the proposal, a previous and current experience of work has been shared (onbording new people, creating NFTs, promoting cardano,…) the team has knowledge about our blockchain. \nThe plan is given and detailed in six mouths then in weeks, consistent informations are available of activities and according to the work team it’s feasible (team is made of people from both sides, Etherum and Cardano). The budget is given with relevent details and explanations, duration, work and amount for marketing and team. Risks have been quoted but there’s no mean of mitigating them, it would be better to let us know how the team mitigates them for the success of the proposal. ", "q1r": 4, "q2": "Key performance indicators (KPIs) are not clearly explained  there should be more explanations to help us understand how the community will evaluate the progress of the proposal, some informations, relevent links and social medias have been given, but according to me the author is lacking informations to allow a clear tracking of delivering the solution, more details about expected numbers could facilitate this. ", "q2r": 2, "assessor": "z_assessor_2918", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8835, "q0": "As demand for the NFT's has been increasing the current world where most of the NFT's are developed by artists which can be of music, painting, unique coins or any other old form of materials. and many people buy these NFT's through Ethereum , Hence to develop an idea where proposer wants to reach museums , art galleries and onboard them to their website and later conduct online marketing and help in buying and selling goods through Cardano is a great idea, where with this project all the museum owners can create a wallet of cardano and conduct transaction through cardano in the future, Hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task mentioned is never a easy one to achieve , the biggest challenge the proposer's team could face here is onboarding those artist who already have audience over Ethereum platform, and convincing other art gallaries and museum to user cardano wallet, However the proposer's team has already Onboarded hundreds of artists to Artano, specifically from Tezos, Ethereum and other chains which shows the proposer's team efforts onboarding, building website can also be achieved as team consist of backend , design, and full-stack developer. the team has also managed to market via podcast , Hence with the team already organized with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has well presented plan to migrate artists from Ethereum which will have huge positive impact in cardano ecosystem, The audit has mentioned how they are continuously trying to onboard artists from other blockchain and have succeeded in onboarding more than 100 artists, audit contains roles of each members of who are going to participate in the project, the proposed plan consist of detailed budget breaking idea where they separated budget for both Marketing budget and Team budget, audit even contains well structured timeline to complete the project, Hence with the great plan widen cardano ecosystem the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 10130, "q0": "  This proposal is targeting a marketing campaign promoting Cardano, similar to those created by Tezos, Ethereum, and other chains. To attract more NFT artists to cardano. First of all, this fits perfectly with the challenge the team is aiming for.\n\n   The solution of the proposal was well and clearly presented by the team to accomplish the cardano marketing objective. At the same time, the group announced the following things they are doing ''Creating NFT drops with non-native artists.\nConnect existing artists with industry experts, help them join Cardano\nCardano's ads for Metaverse Fashion Council and NFT Factory Paris (both popular Ethereum) '', helped create milestones that helped bring more marketing to cardano advertising and marketing. The idea is being handled well by the team to attract interested NFT artists and join this ecosystem. This is really good in the context of artists who don't really know Cardano.\n\n  Regarding the risk of the proposal, there are two major problems that the team addresses. It is the artists who are not willing to convert to cardano, and the audience problem of the NFT artists. These are 2 really serious reasons that the team is having. However, the team suggested a wise approach as the team focused on targeting collectors and clearly explaining to them why cardano was needed. The solution to the problem you mentioned is quite interesting. But I think you need to mention more about the advantages that the Cardano ecosystem has and the weaknesses that Ethereum is facing, to help artists and content creators compare the good and the bad of the two ecosystems. to increase persuasion for NFT artists.", "q0r": 4, "q1": "  The proposal team provided a detailed plan , including 6-month completion timelines . Above all, the workload is broken down by the team week by week to help achieve high efficiency. As well as they provide advertising channels to Cardano. With the aim of reaching more interested artists.\n\n  The budget of the proposal is divided into two major categories : marketing budget , project team operating budget . This explains well why the proposal asks for 73300usd , but is this really suitable for the challenge of allocating a budget with a total of 500,000 usd . Can you consider dividing the funding into two stages in the next round , to unload the budget , with the aim of distributing the budget evenly to other ideas . Hope the team considers this .\n\n   The proposed team consists of 8 main members and two advisors. Is what you mentioned really correct?. Is there any way to verify the team. I look forward to the answer of the team leader, to confirm the correct information of each member by providing links, contact methods, and personal pages to help the advisor verify your members. With this we are not able to verify the experience statements that you have stated. Please provide more evidence to help verify the identity of the group.", "q1r": 3, "q2": "This idea, if successful, will help attract thousands of new Ethereum users to Cardano and help increase the ratio of NFT trading volume on Cardano to Ethereum in favor of Cardano. As well as helping the cardano ecosystem to become number one in the creative and artistic industries of NFT . This benefits the ecosystem well with the positive impact of the proposal I appreciate your contribution project for the effort to promote cardano, out to the market.\n\n     About the KPIs to measure the proposal is divided into 4 indicators. Measure new users on Cardano to measure the success of the number of users who have joined. You also regularly take snapshots of trends to post on regular media sites to help stay on top of trends. There's also a recommended video viewership dashboard, which tracks daily video volume. NFT Collection. This helps voters evaluate the development of the best proposal.But there are some points where the proposed team is not really transparent about the information that the group needs to provide more. To help the community verify the best group transparency.     ", "q2r": 3, "assessor": "z_assessor_3160", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10367, "q0": "Cardano currently does not have many marketing and advertising campaigns about the advantages of the ecosystem. Although Cardano is doing a good job in growing and expanding the ecosystem, Cardano needs more marketings. The aim of the project is to attract artists and creatives from other blockchains. In addition, when more artists join Cardano, many gallaries and museums will also know Cardano. This is a necessary project for Cardano at the moment because it provides a solution to partially solve the problem of promoting Cardano to the community around the world. ", "q0r": 5, "q1": "The proposal’s team consists of the members with experience in art, Nft, marketing. However, they should publish members' information on LinkedIn or their website for the community to easily check. Furthermore, the campaign which they’re doing must also be comprehensive and quality to attract many artists and creatives. As well as marketing, the team should establish a group consulting artists and creatives so that they can easily access the Cardano ecosystem. They divide money into 2 budgets: marketing budget and team budget. The way the use the budget is very smart and transparent. Marketing budget is an essential part for their project.", "q1r": 5, "q2": "It is very easy for everyone to track the project through the website: https://artano.io. The team lists key metrics such as number of new users on Artano, number of views on their videos, number of subscribers... and these metrics are very transparent. For  This project will help Cardano attract more artists and creatives. But, the team should focus on marketing and advertising campaigns for their project.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10805, "q0": "This is a project that addresses the migration of the creative industry from Ethereum to Cardano. This fits the challenge perfectly. They pose a problem and show how to solve it. Cardano Creators will bring the stories of successful Cardano artists to other artists. Along with that is a guide on how they get started with this blockchain. The proponent gave specific examples of success and what they have been doing to implement this project. This is indeed a promising proposition. ", "q0r": 5, "q1": "The content of this project is very good. A detailed weekly/monthly roadmap is provided. The proponent has a plan not only for the development of the platform but also for the communication of the project. I think this is very important, a good platform, but without good marketing, it is difficult to succeed. The budget is divided into 2 needs: Marketing Budget and Team Budget. Overall, this part is very good. However, it lacks the balance of detail for these two items. Specifically in Team Budget is very clear (Marketing Lead: 6 months (full-time) - $30/hr x 40 hrs/w x 4w x 6 mo = $28800). On the other hand at Marketing Budget, we know the cost for Instagram / Facebook marketing is $2000. But how many ads will be posted, and how long will it take?. A section that needs to be added in this section is detailed information about the members. We only know their names and duties in the proposal. ", "q1r": 4, "q2": "The success of this project will make a strong contribution to the goal of the challenge. I am satisfied with the content used to measure the progress and success of the project. But to be able to visualize and evaluate the completion of the project requires specific numbers. And it would be great if a weekly/monthly report is provided to the Cardano community. ", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11044, "q0": "Currently, many advertisers, galleries and museums have not had the opportunity to explore the Cardano blockchain so they cannot get the most benefit from their own creation. Faced with that situation, you made a proposal: \"Create a community-sponsored marketing campaign, focusing on advertising, artists, galleries, museums and organizations, to place Cardano as the place to go. frequented by artists and creators\". I see this as a very good proposition to attract new users from Ethereum to Cardano and contribute to increasing the share of NFT trading volume on Cardano compared to Ethereum in favor of Cardano. It is correct that you have identified a possible risk that artists are not willing to switch to Cardano when they do not understand Cardano well, but your explanation for minimizing the risk is not very convincing.", "q0r": 4, "q1": "I strongly agree with your solution because you have a very creative way of doing it: Firstly, you do good marketing communication, but your marketing is very gentle through building a communication platform. continue #CardanoCreators to spread the power of Blookchain Cardano to artists, which is a sustainable, comprehensive blockchain for both collectors (buyers) and creators/artists (sellers), resulting connect them with leading experts in cardano technology so that they can receive advice when migrating to the Cardano blockchain; second takes small steps towards the complete transition of individual projects to the Cardano chain and will tailor the approach to each specific case with absolutely no rush; 3rd chooses Cardano ads for Metaverse Fashion Council and NFT Factory Paris (both heavy Ethereum). In my opinion, you can be willing to advertise for free for these two fashion brands to draw them to Cardano more easily. You have provided a detailed breakdown of the project's budget, but in my opinion, the marketing budget should be more specific: how many hours to spend on video production to convert into money, the same goes for spend on Instagram Twitter... what is the total budget for the proposal for voters to evaluate the effectiveness of the use of the budget. You need to provide more detailed information about the capabilities of the team members.", "q1r": 4, "q2": "You have provided information to measure the results of the project, and if to measure the progress of the project you should provide a measure associated with the milestones included in the plan. Describe the success of your project in general, it is unclear how long it will take the product to achieve the same. Although it is a new project, but I find it very feasible, I support you.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 11901, "q0": "The proposal is about making unified marketing effort to onboard all the creative galleries and museums to explore the cardano blockchain and make it a go to place for them. \nAs it is trying to create a communication platform called cardano creators as a hub for everyone to migrate or start of their NFTs journey clearly articulates how it will add value to the cardano ecosystem.\nThe proposed solution focuses on few marketing vital keymetrics like bringing existing Ethereum projects, an undecided project to cardano, in addition to this, promoting values of cardano. Thus it dialogues very well and aligned to the challenge statement. \nThe proposal very precisely outlined possible risks involved in the project like artists resistance and fear of losing own audience and outcome of negative reactions, but we can already see them promoting some solutions which can be identified through the details of previous success and current details that emphasizes the ability to scale to address future challenges. The suggested communication platform helps all the cardano artists to influence everyone around the world with not just their art or stories but also with all the crucial information regarding blockchains and starting of NFT journey ,and thus tends to have a global impact. I would strongly agree that this proposal effectively addresses the challenge and a score 5 justifies it.", "q0r": 5, "q1": "\nThe proposer has put up a detailed plan of what and how they plan to get this project done and the milestones look doable. The plan and time frames are stated for 6 months with the tasks to be completed in each month on weekly basis which is realistic to accomplish .\nDetails regarding the team members are provided along with their responsibilities. However, it would have been better if they provided a small individual description of who they are, their contacts on social networks, that would make real the possibility of making direct contact and getting to know them better. There is lack of necessary proof of both expertise and experience in detail. Moreover they are yet to onboard new team members such as marketing expert and community manager .\nThe mention budget looks reasonable which is of two types and divided into identifiable sub categories of tasks to be under taken.They may come again for additional funding in future to build an analysis tool to monitor success rate of marketing efforts on cardano. They are also working on other proposals from fund8.\nThe proposal is clearly considered and is aware of risks and challenges posed by this proposal which they will require to look into for the subsequent phase after this proposal.\nThe chances of the proposal being a success are quite high despite a few areas where more information is required to draw accurate conclusive decisions. Hence a I agree and justify the feasibility with the score of 4.\n", "q1r": 4, "q2": "The team mentions all the key milestones one could use to track its progress. There is clear information regarding the objectives of each phase which are broad and much detailed about how each phase would take place .\nAuthor interestingly clarified things like where the disclosure would be seen, how everyone including cardano community would be aware of the project. It has been clearly mentioned that regular snapshots of Twitter accounts, trends hashtags and mentions will be taken, in addition they will also measure number of views, number of subscribers, number of unique visitors to the creators page. Thus it will clearly provide us with the information and helps in auditing the project and all the deliverables of this proposal are declared clearly along with the delivery time.\n As this is the feasibility study, the milestones of this proposal are the final report of the study. Subsequently, it will be used for developing and promoting the communication platform cardano creators. I would suggest there should be meetings between team and cardano community during the execution of the project as it is huge and involves several aspects which are not constant and keeps changing with social influence, but that's like a bonus suggestion. I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining it’s stated goals and I justify auditability with the score of 5 of 5.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11980, "q0": "I find this proposal suitable for the challenge proposed with the arguments given exactly with the requirements of the challenge, however after I finished reading the proposal I see that you have not highlighted the advantages of the challenge. Ecosystem such as:+Cheap transaction fees,fast transaction processing speed,if you like please add these highlights to the proposal.This helps to highlight the Cardano ecosystem that helps everyone artists are more interested in the community. The solution proposed by the team was to create a community-sponsored marketing campaign that focused on advertising, artists, galleries, museums, and organizations. , to make Cardano a hangout for NFT artists and creators. The author also highlights the risks to established artists and projects, who have their own audience on Ethereum, whose communities may react negatively to the proposal to migrate to Cardano of the ecosystem that's why the author had to also target collectors and explain to them why they need Cardano too, with the risks presented being justified. And I wish you to complete the proposal soon.", "q0r": 4, "q1": "I think your project is quite good, but if you want to develop, you should clearly state the purpose and promotion of cardano. If this project is successful, I think it will be a very good project for the future. , so try and develop to the best of your ability . And the author is also providing a complete roadmap including the tasks to be done with the implementation timeline. This is a fully informed and transparent road map to the community. The team's budget is clearly divided into two main types of needs. The author is also fully explaining the expenditure items along with an explanation of the full proposal's spending. With such a complete and high-quality team budget, I agree with you on the capital plan.", "q1r": 4, "q2": "For information about the people who will work on the project, the group is fully mentioning the social links of each team member proposed. This can verify the identity , as well as the experience of the team that recommends rooting clearly . And the author team is also providing a full range of KPIs to help us measure the success of a clear proposal, these indicators are mentioned frequently by the author, with this showing that The proposal has good transparency. I believe that the information you provide can attract thousands of people to approach cardano and register new members. And wish the proposal soon completed .", "q2r": 5, "assessor": "z_assessor_3322", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12090, "q0": "Hello friends . First of all , I wish you all the best . I was noticed by the title of this project which is related to the artist world . Today's artist world has made great strides in their career by using 4.0 technologies , artists who are not able or slow to change will be left behind . this project can help artists have a different view and actively change the way their art works can reach the audience as much as possible . while increasing their reputation as well as their income . I found that this project identified exactly the challenges and made very reasonable proposals to address those challenges .\n\n", "q0r": 5, "q1": "As I see it , the plan is presented in a very detailed way . plans according to reasonable timelines to handle the proposed work . Such a budget breakdown is clear and complete with regard to spending . I see your enthusiasm for this project . Small details are taken care of by you . I believe that once approved , this project can thrive . With the experience and plan presented , it is very likely that this proposal will be successfully implemented .", "q1r": 5, "q2": "The information provided is sufficient to assess the progress and success of the proposal . Overall , it's good to see that the data given is quite detailed to complete a good project . however , as for the members involved in the project , I find this section quite sketchy . Project participants should be able to describe each person's expertise and experience in their field . It is best to add a link to each member's personal page so that the review team can more easily research . The KPIs you track are reasonable to be able to track the project progress of the right direction . I wish you luck .", "q2r": 5, "assessor": "z_assessor_3357", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12694, "q0": "The proposal fits the challenge setting because it focuses on migrating artists and creatives into the Cardano community. The proposal seeks to do this migration by creating an integrated marketing effort to onboard artists, creatives and museums. Many projects are stuck on EVM-based blockchains and this proposal will serve as an escape route for these projects. The migration of creatives from Ethereum and other famous blockchains will be done by creating a communication platform called #CardanoCreators for Cardano artists for stories and information on how to get started on blockchain.", "q0r": 5, "q1": "The given plan for this campaign is well detailed hence the proposal is likely to be implemented. Specific plans like communication channels  such as new microsite Atarno, a new instagram page and a discord channel to address the questions of new artists. Each  of these channels has a timeline for implementing them. Also a timeline for the campaign is given with detailed breakdown of months and weeks. The campaign has a timeline of 6 months and the activities to be implemented is further broken down into weeks. The first month mainly outlines the early planning phase by creating a marketing strategy and opening communication channels to reach out to knew artists. And this follows through till the sixth month where there will be wrap up, assessment and results.", "q1r": 5, "q2": "The progress of this proposal is going to be measured on the NFT marketplace and social media platforms used the process. This means that the proposal is going to be tracked closely from different platforms. The progress will be tracked on NFT marketplace by measuring the number of new users on Artano. Also the success of this project will be measured based on the number of onboarded users as well.\nIt will also be measured on social media by monitoring and taking regular snapshots of the following on major twitter accounts as well as the trends in the number of hashtags and mentions of the Cardano blockchain in correlation with words related to the creative industry. Another way this proposal will be audited is measuring the number of views on our videos, number of subscribers to our podcast and the number of unique visitors to the Cardano Creators page.\n", "q2r": 5, "assessor": "z_assessor_3452", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 13359, "q0": "Your proposal to create a marketing campaign for the sponsored community, focusing on advertising, artists, galleries, museums and institutions, where to place Cardano as a niche for artists and creators.\nYour proposal also doesn't have the technical elements to port dApps and other projects that scale or move entirely from Ethereum to Cardano, so I'm not sure if your project is up to the challenge. suggest.\nYour project is only for marketing, not solving the problem of finding a way out for many projects that are stuck on EVM-based blockchains like Ethereum, to please reconsider your proposal. right in the challenge or not.", "q0r": 2, "q1": "As for the detailed plan, you have launched many advertising channels for Cardano such as on the web, on Instagram, Podcasts, Youtube and for a total of 6 months, in each month there are specific jobs that prove you carefully prepared for this project carefully.\nExpenses have been broken down by the team into categories with a marketing budget and a team budget, temporarily accepting this budget allocation as reasonable.\nHowever, your team members have not been clearly described by you about their work, their experience, what they contribute and what responsibilities they have in each part of the project, and best of all. Provide links to their profiles so the community can better understand your team members.", "q1r": 4, "q2": "You already have a website to provide an NFT marketplace that works and pays in ADA, so any user data and metrics like you presented will be auditable with internal data. You just need to provide a public URL so the community can click on it and track the metrics and KPIs.\nThe information about indicators and KPIs for project evaluation is clearly stated, but I have not seen clear milestones, specific goals have not been seen, such as after 1 month, how many will be there. new users, how many Podcast subscribers, ... And is this information enough to gauge the progress and success of the proposal?", "q2r": 3, "assessor": "z_assessor_3616", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 14377, "q0": "This proposal reveals the challenge because the project comes to solve a problem mentioned in this challenge. \nIt is a reality that many creatives, galleries and museums have not had the chance to explore the CARDANO blockchain, this being due to the lack of unified marketing to try to insert them into the CARDANO blockchain. Creating a community-driven and effective marketing campaign on creatives, key artists, galleries, my museums as well as institutions, could make CARDANO a go-to place for them.\nAccording to the description of the solution described by the Artano team, this proposal will contribute to a migration from ethereum to CARDANO. Once the team manages to create and execute a marketing campaign that will promote CARDANO similar to those created by Tezos, Ethereum and other chains, there will obviously be some migrations from these systems to CARDANO.", "q0r": 4, "q1": "Firstly, making a migration campaign to CARDANO, is a production that is very important referring to the objectives of the challenge. Proponents have clearly indicated the links and Sites that reveal the implementation of the proposal. The activity plan is well done in that it details the key activities of the project. \nThe strategy targeted by proposers for the feasibility of the project, that of making reach campaigns targeting tools interested in digital wallets and coins with recycling campaigns to those interested in the subject, creating a funnel to bring new users to cardano. \nThe activities are well specified in time (6 months of project execution) and this proves the feasibility of the project from the timing point of view. \nA lack of clarification is noticed at the level of project budgeting, the details provided here are not very satisfactory, the team will have to deal with a clear detail on the allocation of money to the different activities. \nThe people who will work in this project are qualified in the execution of the project, but they are numerous compared to the required number of people required. It would take a maximum of 7 people, despite this I hope that this will not affect the feasibility of the project too much.", "q1r": 4, "q2": "Metrics and KPIs have been well chosen and I think they will be the right indicators to assess the time and success of the project. The team's description of the problem is very clear, and the solution and proposal detail reflects that the project can be audited. The roadmap mentioned in the proposal is well designed and there are milestones that facilitate the audit of the proposal.", "q2r": 4, "assessor": "z_assessor_4010", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Creating a marketing campaign funded by the community, focused on creatives, artists, galleries, museums and institutions, to place Cardano as a go-to place for artists and creatives.", "experience": "Onboarded hundreds of artists to Artano, specifically from Tezos, Ethereum and other chains.\nCreated the first 1/1 NFT marketplace that focuses on bringing more galleries, museums and creatives to the space. \nMade important strategic partnerships with key advertising agencies."}