{"id": 414957, "author": "cryptoloops", "title": "Ethereum's NFT Gateway to Cardano!", "url": "https://cardano.ideascale.com/a/dtd/414957-48088", "category": 26593, "amount": 40000, "description": "The current problem is that there aren't any great methods or groups facilitating of interoperability of NFT ecosystems between the Cardano and Ethereum blockchains!", "f6_no_assessments": 15, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 613, "q0": "This proposal aims to provide individual support to projects that are willing to migrate from Ethereum to Cardano. The final goal is to have 8 projects migrate, or at least created the ETH-ADA interoperability, by Q1 2024. If this really happens, it would be a great achievement for this proposal. Even though the proposers don’t set any kind of requirements for these projects, for e.g. monthly revenue, so we could measure the impact of this migration, it is still valuable. The description of the solution is good and clear, although I’d like to see more details there, but at the same time I can see this working as a taylor made solution to each one of the selected projects, so a high-level explanation is good enough. The proposal is very well aligned with the challenge since it’s goal is just what the challenge asks for: migrate projects from Ethereum to Cardano. If properly executed and good projects accept to participate on it, then it will bring a lot of value to the Cardano ecosystem. The KPIs provided to measure the success of the project are good and appropriate, since they are not only going to measure the amount of project but also the value related to the FTs and NFTs included in this process. I don’t see this proposal as easily scalable, since the solution depends on the CNFT Alliance team and this is not their main commitment, what could be solved with the creation of a specific group focused on this. Overall, I believe that this proposal can have a very good impact on the Cardano blockchain.", "q0r": 4, "q1": "The proposing team is made up of CNFT Alliance members, which is composed by some projects that are building on Cardano. These projects are gaming projects that have previously proposed in project Catalyst to build their products, and all of them have at least partially delivered their projects. They have the technical capacity to provide support and to guide the conversion of smart contracts from Ethereum to Cardano. Even though only names are provided in the proposal itself, in the CNFT Alliance website it is possible to find the LinkedIn of all members. The proposal doesn’t state clearly who is going to work on this proposal but is quantifies the time required by each task. The budget description is good enough, because it would be very difficult to come up with a very detailed budget in this case where the implementation will depend a lot on which projects participated on this proposal. They added 400 hours of programming hours, and if they want to migrate 8 projects, that’s 50h per project, which is approximately one week of work fulltime. From my perspective, that might not be enough to migrate some projects depending on their complexity but might work for most of them. There’s no detailed roadmap, just milestones for the next quarters, which is ok, but it would be even better to have some more details about the tasks they want to execute with every project, some kind of template or blueprint. Based on the time they intend to spend with which project, the timetable is realistic, but I have the same concern I mentioned before about the overall time commitment per project. The main risks are mapped and well described.", "q1r": 3, "q2": "The proposal presents a high-level roadmap with milestones for each quarter. As mentioned in the feasibility criteria assessment, this is not ideal, but since the execution of this project is going to depend a lot on which projects are select, I’m not sure if it would be possible to come up with a much more detailed plan that’s also realistic. The KPIs for the success of the proposals are clear, and they might be a good way to measure to progress of the execution of the proposal itself as well if they approach one project at a time. But if projects are running in parallel, they won’t be very valuable for tracking. It would be good to communicate to the community the steps taking also when approaching different projects, and, for example, in cases where the project declines participating on this, what are the reasons that provide. Depending on the answer, this could be used to improve a possible next iteration of this initiative. Also, it could be added to have a way to test that the project is actually running on Cardano, after the work is finished.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 17, "ne": 3, "ng": 7, "nfo": 7, "vca_o": 1, "reply": "\"They added 400 hours of programming hours, and if they want to migrate 8 projects, that’s 50h per project, which is approximately one week of work fulltime. From my perspective, that might not be enough to migrate some projects depending on their complexity but might work for most of them.\" Yes, but we have stated that we would be seeking further funding down the road, and this is what would provide more time to get the projects migrated. We didn't ask for the whole amount in this proposal. We asked for a portion."}, {"id": 3443, "q0": "Very valid and straighfoward idea that adresses the challenge as it can help to increase challenge kpi as \"Number of projects that migrate\" and is aligned with its definition of sucess. In a summary, proposers basically want to find ETH projects that are willing to migrate and use their expertise to this, focusing on interoperability. Having said that, a risk well identified anbd mitigate is a possible lack of willingness for migrating. What would be nice to be reinforced in the proposal is how the marketing strategy to outreach ETH projects (present in project plan) will happen exactly. I liked though of the approach to present this initative as an alliance (or group), it may help to increase engagement and attract people and projects.", "q0r": 5, "q1": "There is a fair time-frame plan in place with good milestones (how many projects they want to have migrated by period). Budget breakdown is well done, splited into main activites/work packages and matches plan and scope. Nice to see it is already brokendown by hours also, which helps to give transparency. \nThere's a team of 10 committed people with diverse compentencies essential to this project as software development, programming/coding, marketing, business development and management. Their roles are already clearly stated and there are linkedin links to verify the information provided. The brief description provided for each person is also very informative.", "q1r": 5, "q2": "There are good kpis proposed and they are time-framed (actually included inside project plan as milestones) and target, related to the number of projects migrated. It's also good they will measure the value that migrates through them and these metrics can be tracked in real time. Its imporant they provide this follow up in a open to public website or repository or online dashboard. One extra thing that would be nice to see in the end is a report explaining the challenges (not necessairly the technical ones)and what was done to overcome them, in order to make it easy for future teams to replicate this.\nAll in all, project is compltely auditable, specially considering its nature of having a final goal to migrate projects/assets from one blockchain to another", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 3606, "q0": "The Cardano community understands that low transaction fees are a great advantage that attracts and attracts NFT project developers from Ethereum to Cardano. So what is the best way to do this? This is the subject of the proposal.\nThe solution provided provides the knowledge, work and methodology for their project migration.\nThat is, projects will be driven by Fluxus.\nBasically, the proposal gives a suitable topic.\nThe experiences of Ethereum projects will be applied to projects on Ethereum moving through Cardano.\nProposals are available at all resources: knowledge, ability and time, the big risk of the project is to perfect the proposal to get funding and convincing advice how the above projects Ethereum ready to move\nI find this risk reasonable.\nFrom my evaluation experience, I found that only a few proposals that they already have the financial resources to develop, most have to wait for funding from Catalyst. If you fail to raise capital in this round, it will be completed again to raise capital in the following rounds.\nI hope the proposal will successfully raise capital", "q0r": 5, "q1": "The proposed timeline is specified in 3 quarters: the last 2 quarters of 2022 and 1st quarter of 2023.\nThe blueprint shows that reaching and marketing projects on Ethereum is very important and appears in all 3 quarters:\nFinding project access on Ethereum is very necessary and must be maintained continuously for a long time to be effective.\nTarget Q4/22 will migrate at least 02 projects.\nQ1/2023 target has at least 8 projects move to Cardano.\nAt the same time the project will standardize compatibility with EVM which will make migration easier and more cost-effective.\nThe specific budget allocation table for each stage and the largest percentage is the encoding of more than 70% of the total proposed budget. This detailed allocation is consistent with the blueprint table. This project is feasible.\nThe team of the proposal is assigned specific work of each person, their identity is also made public for the community to learn and verify", "q1r": 5, "q2": "3 indicators to measure project progress:\n- Number of Ethereum NFT Projects migrated to Cardano Blockchain via Fluxus.\n- Total number of Ethereum-based or EVM-based Projects moving to the Cardano Blockchain through Fluxus.\n- Amount of value (ADA, ETH or USD) transferred to Cardano Blockchain through Fluxus.\nThe community will check these metrics when proposing descriptive reports at specific timelines\nAchieving the target of 2 conversion projects in the fourth quarter of 2022 and eight conversion projects in the first quarter of 2023. This is indeed the success of the project.\nEverything is public and the project will be transparent\nGood luck with the project,", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6973, "q0": "    -  It can be said that currently NFT, Ethereum, and Cardano technologies. They are all improving themselves and growing stronger. but almost each technology is developing in its own way and has little interaction with each other. with an idea to bring Ethereum's NFT Gateway to Cardano! is a very good idea.\n\n     - Here I see the proposed thread raised the issues that there is currently no method or group to facilitate the interoperability of the NFT ecosystem between the Cardano blockchain and Ethereum! I think the problem raised by the topic of the project is very reasonable. we should find ways to solve the above problems to be able to optimize the link, Alliance between Cardano and Ethereum developers!.\n    The solutions outlined by the team are also very complete and detailed that Fluxus will be the gateway through which other projects can migrate to Cardano. I find solutions like the ones mentioned above to be suitable for solving the problems in this challenge.\n\n  -   As for the main risks that the project may face, I see the team citing a few risks such as lack of budget, and the readiness of the Ethereum Project to migrate. However, I see that the group has not yet outlined a plan to reduce those risks in a specific way.\n", "q0r": 4, "q1": "  -  When asked about providing a detailed plan, including progress and milestones. I found the team identified very specific timelines that are. will complete all work within 9 months. from the third quarter of 2022 to the first quarter of 2023. I think the above timeline is completely reasonable to complete the proposed work. Targets have also been identified specifically for each quarter. for example in Q4 2022 will move at least 2 projects to Cardano. By the first quarter of 2023 will move at least 8 projects to Cardano.\n\n  -  About the budget presentation with a total budget of $40,000 and has been broken down into 3 different categories. I find the above division to be completely reasonable. However, it would be good if the group had a budget backup plan in case of shortage, it would be better.\n\n   - The section provides detailed information about who will work on the project. I see the group has listed 9 members. The group has assigned specific tasks and tasks for each member. The role and experience of the members is very good. members have many years of experience in many fields. Members' identities are easy to authenticate. Attached is a link for the community to easily follow.", "q1r": 4, "q2": "   -  About the description of measuring and tracking project progress. I see the group has given a lot of indicators in which there are 3 main indicators. Number of Ethereum NFT Projects Migrating to Cardano Blockchain via Fluxus. Total number of Ethereum or EVM-based Projects moving to the Cardano Blockchain through Fluxus. and Amount of Value (ADA, ETH or USD) transferred to Cardano Blockchain through Fluxus.\n\n    - In the success section of the project I see the team cite a few successes of which the most notable is the . will achieve their goals of 2 and 8 projects moving all over to Cardano, respectively, by Q4 2022 and Q1 of 2023. I see the successes as outlined above are related to the challenges, however However, the project is still in the research process and has not yet been tested.\n\n   -  This is a brand new project so it has not been funded yet. However, I personally think this project is very good and I support the project.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"id": 7887, "q0": "I strongly believe this proposal does address the challenge and will effectively assist in the facilitation of the great migration from Ethereum to Cardano. The Ethereum NFT Gateway to Cardano provides a direct path for NFT Projects that wish to Migrate from Ethereum to Cardano in an easy way that will attract projects who want to do so. This will have a tremendous impact on the Migration effect and add to the Cardano ecosystem as there is a lot of great art on Ethereum. This proposal would have a tremendous effect not only on the amount of NFT projects available on Cardano but also will bring many Ethereum users who were priced out due to high gas fees on Ethereum, to the Cardano blockchain to mint their favorite collections. I find the proposal effectively addresses the challenge to a very high degree. ", "q0r": 5, "q1": "Given the abundant amount of experience this team has in relevant fields, as well as the clear plan provided in the proposal it does look like the proposal has a very high chance that it will be implemented successfully. The team presenting the proposal has a vast amount of experience and has held positions at high-level jobs in relevant fields. The skill level of team members also leads me to believe the necessary skills for building this Ethereum NFT Gateway to aid in the MIgration from the Ethereum Blockchain based on the technicality of the protocol they are wanting to build. The plan presented by the team is organized and has clear milestones for what the project is trying to achieve in this challenge. The goals set in this proposal do have realistic timelines based on the relevant skills that the team possesses, and these milestones do seem very achievable. The proposal lays out what needs to be achieved and what actions need to be carried out to achieve those goals. I find this proposal will be particularly effective in bringing more fungible tokens from Ethereum (ERC-20) Over a handful of projects that did use the bridge already required assistance and support from other projects in doing so. The team's expertise would provide the technical level that protects lacking this would need to bridge their tokens and mint on the Cardano side, as well as register their tokens; as token registration can be a challenge as well, not just the migration of the token over the ERC-20 Converter bridge.   The team also does not mention if the budget accounts for any possible future inflation as this would be very important in the current economic climate; if the team runs out of money due to underestimating inflation this could have a serious impact on being able to successfully implement the proposal should there be funding issues, this would be my suggestion to the proposers.", "q1r": 5, "q2": "I believe with the information provided in the proposal the progress, as well as the success of the proposal, can be accurately measured and accounted for. There are clear milestones for the team to achieve, as well as metrics that can be used to audit the progress of the impact this project will have - The dollar figure amount as well as several tokens/ nft projects that migrate through the service will be an easy metric for anyone to understand and track as it does not require technical expertise. The team lays out a budget; however, the improvement I would suggest to the team is being a bit more specific with the budget details. The proposal states $4,000 will be used on marketing, but does not give any specifics or details about what marketing mediums this would be used on, there is also no breakdown on the cost per month for the marketing portion of the budget. ", "q2r": 4, "assessor": "z_assessor_2933", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8000, "q0": "The problem is that there are no methods or groups that would enable the interoperability of NFT ecosystems between the Cardano and Etherium blockchains. The proposer wants to use Fluxus to solve this problem. This could become a gateway for other projects to migrate to Cardano. Fluxus can have a positive impact on the Cardano ecosystem by making it easier for people working with Ethereum to migrate to Cardano. Its main goals correspond to the outlined challenges setting. The lack of funding and willingness of Ethereum projects to migrate are the biggest risks. The importance of finding projects interested in the Cardano migration will be very important.", "q0r": 5, "q1": "The proposer provides evidence of relevant experience and skills required to carry out this project. The submitter has included the people in the proposal with their Linkedin. You can trace their experience through this. The team members will certainly be able to implement this proposal down to the last detail. A breakdown of the budget is available. It's good that working hours are included in this breakdown. The budget seems sufficient to me to achieve the set goals. Further funding will likely be requested in future rounds. A realistic timetable has been included to complete the work. (3 quarters) The goals included here are well chosen. It will be possible to work in a qualitative way. With the road map it is written what will happen. How is not always specified. There are some technical aspects in the proposal that are important for the implementation of the project. There are 2 risks included in the project. (financing and willingness of ethereum projects to migrate to Cardano. The project can certainly succeed if sufficient marketing has been carried out in advance and sufficient partners have been found.", "q1r": 5, "q2": "A road map with associated milestones is available. The chosen milestones per quarter are certainly achievable. For some quarters, it may be possible to aim slightly higher in terms of integration projects. Several KPIs are included in the proposal. The biggest measure will be the progress of project migration to Cardano. The amount of assets that these projects will deliver or the value in ADA, ETH or USD of these assets. The petitioner has a clear description that there is currently no gateway to migrate Ethereum Projects to Cardano. Fluxus offers a solution to this problem because it can ensure that Ethereum projects can migrate to Cardano.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9852, "q0": "The proposers has described their main issues and challenges upcoming, mainly on funding for growth and ethereum-project's willingness for the migration. However, the team can be considered very well prepared with their now-ready migration tool, Fluxus to execute the their solution as provided. Nevertheless, presented the information given, it is unclear how the team anticipates that their project will be able to scale up to the present and future needs of Project Catalyst. ", "q0r": 4, "q1": "Given the roadmap to deliver their proposed solution, this team seems quick in trying to achieve their target, as they target to already migrating projects by Q3 of 2022. From their well-prepared gateway tools, its quite convincing that they want to start migration that fast. Considering if they can successfully migrating 8 projects as targeted by Q1 of 2023 would be excellent for ADA. I have trust in the team's ability to succeed because they seem knowledgeable, skilled, motivated, and committed to the project.", "q1r": 4, "q2": "The information offered by the team is adequate to audit the performance and success of the proposal's early phase. In short, the team will be measuring, the amount of Ethereum NFT Projects, the overall amount of Ethereum or EVM-Based Projects, and amount of Value (ADA, ETH, or USD) that migrates onto the Cardano Blockchain through Fluxus. The team asserts that these results might be easily measured using the ERC-20 converter or by brand-new Cardano-based projects that are based on Ethereum.", "q2r": 4, "assessor": "z_assessor_3112", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9923, "q0": "This proposal is part of the construction of Fluxus NFT and Gaming Alliance. There are other proposals in this Fund9 regarding this. More specifically the goal is to facilitate easy interoperability for NFT projects between Cardano and Ethereum. Easy switching between multiple chains is very important for several reasons. Being able to go multi-chain enables criteria-based utilization of different chains. Users will benefit from the most affordable transaction fees, highest speed, highest security at each moment of time. Also, different functionalities may be available (more efficient) on different chains. \n\nThe alliance with standards, experience and common resources let the projects themselves to focus more on their core services and less on designing the interoperability processes which are often similar for many other projects as well. Based on these merits I find it obvious that with a successful delivery this proposal will increase the number of potential projects migrating from Ethereum to Cardano. \n", "q0r": 4, "q1": "The roadmap is straightforward and clear but could go a bit more into details in what kind of service will actually be provided. The budget breakdown fits well to the roadmap and the amount asked is within a reasonable frame. The proposers are behind the CNFT Alliance. Information on team members is available comprehensively. They certainly have capabilities to implement the plan. \n", "q1r": 4, "q2": "There are natural quantitative KPIs for both short and long term success of the endeavor. The number of projects, tokens and financial value migrating and growing over time, give a solid view of the impact on the ecosystem. The team has also defined several goals for these metrics to be pursued. Small updates about the coding work might be beneficial.\n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 10133, "q0": "After reading the proposal, I realized that the proposed team achieved the goal of the challenge. The author is aiming for an accessible model to make it easier for everyone to participate in the community. This has an impact. I am very interested in how they are working to solve the problem of facilitating the interoperability of the NFT ecosystem between the Cardano blockchain and Ethereum. necessary to be able to help CARDANO's ecosystem reach new members and thrive in terms of NFT.\n\n  I trust with the author's in-depth experience in the field of coding and project management as well as related experience. They have the best ability to implement this recommendation and the team has provided enough links to demonstrate the experience of each specific team member and they have presented a clear, circuit and complete information about team.\n\n  The proposed author has detailed the risks the team will face, which is helpful for our community advisors to clearly capture content and deliver positive impact. Good impact on the community. When this idea is successful, it can expand to more members as well as help the ecosystem develop more sustainably.", "q0r": 5, "q1": "The proposed topic did a good job of clearly informing the group members, with social links to each member's profile in a specific and complete way. Comment on how to verify that the information you provide is accessible and complete.\n \n  The proposed topic provided a complete step-by-step roadmap for project implementation. They also include accompanying real-time roadmap milestones starting in the third quarter of this year and ending in the first quarter of 2023. The team has also clearly divided the tasks that each team member must complete, as well as clear the specific amount of work to be done on the proposal. , must be achieved for the proposal to be a resounding success.\n\n   However, there is one thing about the $40000 group funding section, which I think could provide an explanation of the proposed budget analysis and be a bit more specific. .Help people review and comment on budgets correctly. But anyway I look forward to seeing and using the benefits that the proposal brings.", "q1r": 4, "q2": "During the implementation of the proposal, the team fully met the success metrics that \"\"challenge\"\" required. The proposed topic was clear and highly constructive for how possible The interoperability of the NFT ecosystem is clear, as well as having a fair and transparent presentation of content, there are 3 main indicators that the team announced including: Number of Ethereum NFT Projects migrated to Cardano Blockchain via Cardano Blockchain. via Fluxus.\nTotal number of Ethereum or EVM-based Projects moving to the Cardano Blockchain through Fluxus.\nAmount of value (ADA, ETH or USD) transferred into Cardano Blockchain through Fluxus. Proposed by the team to periodically publish in real-time updates, to keep everyone on track.\nAnd if the project is successful, it will help in the transition of NFT and highly interactive projects to the Cardano ecosystem. This has a positive impact on the ecosystem, and I hope the team completes the proposal soon so that we can increase the competitiveness of the ever-growing Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10319, "q0": "This proposal has the potential to create an interoperability of the NFT ecosystem with the Cardano ecosystem with Ethereum. I find this proposal interesting because it has a combination of moderate and sufficient. The project theme also clearly states the goal, clearly indicates the profit for the conversion, towards giving everyone a comfortable spirit at work. The centralization uses the cardano Blockchain engine to bridge the interoperability of the NFT ecosystem. In addition, ETH with its experience has been successful in many projects with good teams, I believe that the combination of interaction will bring benefits to everyone. I believe that you are ready to complete this task with good and experienced human resources, clearly showing Cardano - Ethereum interoperability. Let's show the solution that we see is what you say. The risk in the proposal is said to be funding problems, but here the topic of the project is not so difficult for them because they have confidence that they will succeed because behind them is a team that is always ready to work. , and complete all of these quests.", "q0r": 5, "q1": "In the proposal, the timelines are given in quite detail, specifying that each step is implemented and completed. From Q3 to Q4 of 2022 they have made great progress towards the common goal of migrating projects to Cardano, and they have done at least 2 projects already. The timelines are set up seamlessly and the smooth working management follows clearly the efficiency in work. By Q1 of 2023, the approach of Blockchain projects moving to be compatible with EVM as the project's theme did in Q3 and they have achieved results showing that they say it and they do. The results show that in the proposal they have successfully migrated about 8 more projects to Cardano. Their success is always behind the team who always support, come up with creative ideas for the project. With the participation of Game Designers bring gaming experiences to users, marketers, coders, game programmers, project coordinators, assistant coordinators, developers. Narrative designer, sound designer, artist, producer. I found that the project team has a very good relationship and recruits talents for each of their development areas, everyone in the group is also experienced, good at business, it is important that they all succeed. Fluxus skillset to bring Cardano interoperability to the forefront of 3rd generation crypto.", "q1r": 4, "q2": "It is suggested that the number of projects in the process of migrating or successfully migrating to Cardano is the biggest measure of progress, I agree with this point of the project theme. They want you to see that you can measure the amount of assets that those projects bring or convert to the value of ADA, ETH, USD to be able to quantify to see that the success of the project. The tool they use is an ERC-20 converter or through new project development projects on Ethereum on Cardano . The project theme specifies that the outcome can be measured in terms of the quantity that the message is replaceable (FT) and non-replaceable (NFT). They measure very specifically and clearly, this will lead to the success of the project. They have achieved their goal of 2 and 8 projects have successfully migrated to Cardano and Q4 2022 and Q1 2023 respectively as far as feasibility I said. It's great because this is also a great motivation for them to have standardized methods and easily develop new projects on Cardano. I see that their future success will go even further.", "q2r": 4, "assessor": "z_assessor_3175", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10373, "q0": "About market capitalization, Ethereum is the second-largest cryptocurrency token. Therefore, creating a method to link Cardano and Ethereum is a fantastic opportunity for Cardano. The team will build a Nft gateway (Fluxus) that will enable the migration of other Ethereum-based projects to Cardano. Cardano has more potential to develop and prosper the more projects that can use it. Cardano still has significant restrictions, despite the fact that many Ethereum projects are switching to it at the moment. More approaches will increase the opportunities for many projects to use Cardano.", "q0r": 5, "q1": "There are 10 people on the team. They offer very detailed information about each person in the group. Each member of the team has experience relating to the project. They suggest a budget of about $40000 however they should list all of their expenses in detail. Their road map will last from Q3/2022 to Q1/2023. This project focuses mainly on programming so the team needs a lot of technical knowledge and skills.", "q1r": 4, "q2": "The team has metrics for the community to evaluate the project. The best way we can measure the effectiveness of Fluxus by looking at the number of projects migrating or successfully migrated to Cardano. To help the project reach everyone, the team needs to focus on the promotion process. They also need to create social media channels for project updates.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11234, "q0": "This proposal focuses on the challenge that is to migrate projects from other chains to Cardano. Some of those challenges can be regarding both coding and management. The team stated that they (Fluxus) would be a gateway that guides and assists projects for said migration. Fluxus is set to provide the specialized attention and resources to enable projects and facilitate migration. The team stated that it has the knowledge, time, and capability. However, some other challenges they foresee are funds and willingness to migrate from ETH to Cardano. For the Fund aspect, the Catalyst can assist them whereas for the willingness aspect the team would need to reach out and find or interest other projects to migrate. The team has spotted the challenges and in their timeline, they have addressed how they would onboard projects from not just ETH but other EVM-compatible blockchains.  ", "q0r": 4, "q1": "The team consists of 11 individuals, each of whom is an expert in their own field. There is Alex, the head of Game Design and co-founder of CNFT Alliance, Conward  who is the lead of marketing and co-founder of CNFT Alliance, Drik who worked for Ubisoft and founded two gaming studious and is presently working as a Technical Architect, Simon Latusek who is a videogame programmer for 5 years and is experienced C#, C++, Lua, and CIL as well as the videogame engines Unity and Unreal, Samantha who has numerous years of experiences in managing various projects, Jue Tran who has a decent amount of experience as Assistant of Sales, Christopher Smith is a highly experienced writer, Rudi Veighinha a well-achieved musician with more than a decade of experience in advertising for entertainers, Dilara Bozkurt who has years of experiences as a contract artist and last but not least Christian Zehetmeier who is the Head of Production of #D animation Studio Woodblock, which works with Netflix, Riot Games, Universal and 343 industries. Accumulatively the team has decades of experience in project management, coding, and various business experiences. The team alone is significantly capable based on their experience and their collaboration with one another boosts confidence. Their experience compliments each other immensely pleasingly in regards to their goal. \n\nTheir team plans to migrate other projects from ETH to Cardano through 3 phases, these phases are time-oriented; Q3 of 2022, Q4 of 2022, and Q1 of 2023. In the first phase the team plans to complete the onboarding of the team, start their marketing to Ethereum projects, and initiate migration through ERC-20 converters or other means. As for their second phase, the team hopes that they would have successfully migrated 2 projects to Cardano at the very least, persist with their marketing, and initiate marketing to other EVM-compatible Blockchains. Finally, in phase 3, the team plans to continue with their marketing to EVM-compatible blockchain projects, standardized methodologies for migration, and have 8 projects migrated to Cardano. The team has a decent plan for marketing and as stated they have a strong team that can assist with the onboarding and migration. The main concern would be their marketing strength, all will be futile if they fail to attract new projects to the Cardano ecosystem. It is suggested they put a heavy emphasis on marketing and have various times of marketing, social media, AMAs, education videos, and many more. ", "q1r": 4, "q2": "In regards to the audit of the progress, the team has provided that the main mean of progress would be the number of projects that they have in process of migration or that have successfully migrated and the amount of value (ADA, ETH, or USD) that has been migrated onto the Cardano chain. All these are decent means to audit the progress, however, the team can also have a signup sheet given to the community that illustrates the number of projects that are interested in the migration. \n\nIn regards to the audit of the success of said proposal, the team stated that this can be audited though their timeline milestone. As the team expected 2 and 8 fully migrated projects over to Cardano by Q4 of 2022 and Q1 of 2023, respectively. This approach includes assessing the success of the proposal as those are the target set by the team and if said targets are reached then the team would have succeeded in their proposal. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11311, "q0": "Fluxus, the company that this proposal is based on most certainly would effectively address the challenge of migration from Ethereum or other blockchains to Cardano. They have the skill, and the know how to help transfer existing projects or up and coming projects over to the Cardano blockchain. \n\nOn the other hand, this will also be a challenging goal of the project. Funding will help tremendously in their efforts, but reaching out to projects on Ethereum and other blockchains may present a serious obstacle in getting people to migrate over. \n\nIn the end, I believe, based on this proposal, that they can be very successful in addressing migration in due time, but that it will indeed take time.", "q0r": 5, "q1": "The proposer has laid out an outstanding roadmap (milestones) in this proposal. The proposer has also laid out who is on the team (with plans to onboard more team members) and provided linkedin links to every current member of the team and there is some great information on each one of the team members letting us all know that they have the knowledge base and education to make this proposal successful. \n\nThe only issue I see in this proposal is how challenging it will be to get current projects on other chains to make the decision to move over to our Cardano blockchain. I do see in their milestones where they do plan to do marketing and outreach, and I do believe they will be successful in time, but I would like to have seen a bit more information around marketing and reaching out to other projects on other blockchains.\n\nFinally, I think it would be fairly easy and straightforward to get projects that are just getting started in the planning stages to easily consider swapping to Cardano before they every get started on another blockchain. This is one area I would like the team in this proposal to consider heavily. \n\nHow might you go about locating, finding, and contacting projects that are up and coming and get in touch with them before they get going on a blockchain regardless of what chain they are thinking about using.", "q1r": 5, "q2": "The easiest way to track the progress of this proposal will be by how many projects they actually get to migrate over! This would be very simple and easy to track.\n\nHowever, the proposer has mentioned that they will be using highly quantifiable metrics to measure the level of success of the project. I would have liked for the proposer to have a least mentioned how they plan to present these metrics to the public, or if these would be privately held by Fluxus. My assumption is the would make these available to the public, and if that is the case, it would have been wonderful for the proposer to list where and how they would make these metrics available.\n\nNevertheless, the information provided is sufficient to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_3237", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 11765, "q0": "Ethereum's NFT Gateway to Cardano by the Pluxus NFT team is a good idea to meet the challenge \"The Great Migration (from Ethereum)\". The Pluxus NFT team is committed to using “knowledge, time, and ability” to provide specialized attention and resources” to facilitate the smooth migration of NFT projects from the Ethereum blockchain to Cardano through via their Plusus NFT gateway. I agree with the author's argument. Currently, our Cardano ecosystem lacks a dedicated team that is willing to provide specific methodology, technical resources, and support tools to promote the interoperability of the NFT ecosystem between the Cardano blockchain and Ethereum. This not only helps to remove specific transition barriers in terms of resources, costs, technology, etc., but also helps project owners increase their motivation and feel more comfortable when making the decision to move change. Here, the authors also foresee some risks associated with the success of the proposal. That is, the funding source and readiness of the Ethereum project to migrate. Personally, I think, the real bottleneck of this problem lies in reducing the psychological barriers of NFT project owners when making the decision to move, rather than technical difficulties, finance of the migration process. We have Catalyst to provide capital funding for projects wishing to migrate to Cardano, partially solving the financial barrier. However, we really need an in-depth support team, searching for potential NFT transformation projects, comprehensive support throughout the decision-making process of the project owner, until the actual conversion. successful happening. Of course, this is not easy. Therefore, the community expects people with enthusiasm, experience, method and ability, ready to take on the task. I appreciate the value and impact of the solution. My score is 5.", "q0r": 5, "q1": "Regarding the feasibility assessment, the proposal's author provided a fairly detailed plan, with specific progress and milestones to be achieved. Specifically, there are 3 important milestones of the proposal, briefly: 3rd quarter of 2022 to establish a team and to market and approach NFT projects on Etherum, 4th quarter of 2022 to migrate at least 2 projects to Cardano, In the first quarter of 2023, there were 8 projects moving from Etherum. I like clear target numbers like this. This is what we the Cardano community expect when a proposal is put up for a funding vote. However, I would expect the author to be able to add data on the migration value in USD, the number of users transferred into the Cardano ecosystem through Pluxus over the above quarterly timeline. The budget of the proposal is divided into 3 categories: coding, marketing/outreach, project management. The unit price is divided by the hour. Particularly for the marketing section, the approach lacks the unit price * the quantity included. Also, I wonder if the authors have really taken into account the slide in ADA's price due to bear market volatility, when Catalyst-issued capital is allocated using ADA. Not to mention, the authors did not mention clearly, how many employees are needed for each item? What is the average allocation cost for each calculated migration project? These parameters will help the community better assess whether the budget is reasonable and adequate. Regarding the team, I consulted the link that team provided (https://cnftalliance.org/) and linked to 9 personnel profiles in the team. The team has launched game products in the Cardano space such as: PlayerMint, AdaQuest, Flooftopia… I think the team has enough skilled and experienced personnel in the field of NFT and Gaming to complete the tasks of the team well offer. My score is 4 points. I subtract -1 point because the budget needs more clarification.", "q1r": 4, "q2": "Regarding auditability, I assess that the project is completely auditable through the number of target projects migrating to Cardano in each quarter, the team mentioned above. Here, I only suggest that the authors add metrics on some items that can help the community audit the success of the project. For example, number of Ethereum or EVM based projects migrating to Cardano, number of users migrating, number of active users by day/week/month/quarter on post-migration projects, value in USD of projects migrating to Cardano through Pluxus.... I rate 4 points on the auditability of the proposal, after deducting -1 point due to the need for additional data mentioned above.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13988, "q0": "The challeng mentioned is definitely existing today as cross chain move over is the most specified and sought after solution as new and new chains come into the market with better promises on the transaction speed and costs. \n\nHowever there is no robust infra that can help tp migrate a projrct easily from a well established chain to a budding chain on a totally different ecosystem. \n\nIf the team were to provide a quick solution for migration rather than a generic proposal talking about migrating few projects to Cardano , it should be a great proposal. \n\n", "q0r": 4, "q1": "The reason behind this assement rating would be because of the fact that even though there are some details on the team  and plan , there seems to be some technical details missing on how the migration from Ethereum to Cardano will happen . Just a couple of random projects on ethereum to cardano ?\n\nIs there going to be any specific set of projects that you would be focussing on ?\n\nLike for example I noticed that there are people with a lot of gaming experience on board. \n\nAre you going to migrate games from eth to cardano ? Even though ethereum transaction fee may be costly the general usage on the eth is more what ways would you think the move would benefit the users on Cardano?\n\nIt would be great if you could point out to a specific project that you are willing to move", "q1r": 3, "q2": "Like mentioned earlier in the success measure of the project , the information about the team is avaiable and the team seems to be quite a strong one. However, there are no tech specs realted to what kind of projects and how the migration will happen ?\n\nIs it going to be just a copy of a project on eth built on cardano or you are gonna change the whole project re written on cardano?\n\nIf so is there s mechanism for that you follow where the migration happens ?\n", "q2r": 2, "assessor": "z_assessor_3869", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "A lot of these asks are too much at this point. We are working on onboarding our team to begin development. As soon as we get the technology together, then we'll be able to start bringing on projects from Ethereum. Therefore, asking for details of the specific projects doesn't seem to really make sense for the assessment. That would be much later on when we develop the ERC-721 converter and similar functions."}], "solution": "While Cardano has many features, such as low transaction costs, that can attract NFT developers/projects from ETH, there needs to be a group or Alliance that can provide those resources.", "experience": "Co-founder (CF)/Game Design: Alex\nCF/Marketing: Conward\nSr Programmer: Dirk\nProjects Coordinator: Sam\nAssistant PC: Jye\nNarrative Design: Chris\nGame Programmer: Simon\nArtist: Dilara\nIllustrator: Ann-Kathrin\nProducer: Christian\nSFX: Rudi\n(More Details Below)"}