{"id": 419644, "author": "ben.goldie", "title": "Ethereum and Cardano Web3 Wallet", "url": "https://cardano.ideascale.com/a/dtd/419644-48088", "category": 26593, "amount": 97600, "description": "The ‘Ethereum x Cardano’ cross-chain user experience (especially asset migration) is complicated due to the fact that users need to use at least 2 wallets and several different tools.", "f6_no_assessments": 21, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 207, "q0": "Yes. It is perfectly in line with the objectives. The proposal presents a single bridge to a multi blockchain wallet, including ETH, which makes the transit of assets automatic.\nThis will not only build a bridge for migration, but also lay the foundation to further interoperability.\nI think funding this project goes deeper than just funding the wallet the proposers want to build, it creates an infrastructure and a blueprint for others to use and follow.", "q0r": 5, "q1": "Yes, the team is already well established in the ecosystem, having delivered in every aspect of Cardano´s development. The team is behind some of the most useful and successful implementations in the ecosystem, such as the Trezor and Ledger integration, Wingriders, Yoroi, AdaLite and some others.\nI cannot see this team not pulling it off, given their trajectory. \nThe science behind the project is well understood, the proposers do not need to invent anything, just put in the work and get it done. \nThis is a well formed team that delivers. I am confident of their success, given their past accomplishments.", "q1r": 5, "q2": "Totally. They give a three stage development blueprint, with clear milestones and in a four month development timeline. \nBecause the core of the proposal is the Nufi wallet, it is easy to verify the development of the same, and once finished and active, the number of users, amount of assets and other relevant metrics are readily available.\nThis is a very doable project by this team, and would benefit the ecosystem greatly.", "q2r": 5, "assessor": "z_assessor_2060", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 12963, "q0": "The proposer have mentioned that proposal focuses on a project's existing user base who, in order to engage with the project after it migrates to Cardano, must first migrate their assets then manage assets on multiple chains afterward.The previous or many other migration proposal focuses on the Ethereum based projects to migrate to cardano and if this happens their will be considerable drop-off along the way which makes switching to \ncardano less desirable. The proposal identifies a challenge-related issue that needed to be fixed. The proposer have clearly mentioned that how this proposal clearly adds value to the cardano ecosystem . The proposal is able to scale to address the future challenges, By assessing the proposal I agree that the proposal effectively addresses the challenge ", "q0r": 4, "q1": "A thorough strategy, including a schedule and significant checkpoints, has been submitted by the proposal's proposer. For the project to be implemented successfully, the project's proposer has taken into account risks and challenges.\n‌The skills and experience required to accomplish the project have been specifically indicated by the proposer. The budget is somewhat high and the proposer needs to work on that, but other than that, it is very clear how the proposal is managed within the timeline. The timeline and the budget are both explained in a very descriptive way. The team/proposer appears to be very experienced, and they have included all of the links to their previous works in the description. They have also mentioned the resources required for implementation.", "q1r": 4, "q2": "The following data can be gathered and reported on a quarterly basis via the social media to track the proposal's improvements: the comments gathered on the NuFi customer care website, the feedback forum, the Discord, Twitter, and Reddit channels, as well as on influencers' and partners' social media pages during the marketing campaign. We can gauge the success of a proposal by counting the number of users who conduct transactions using both a Cardano and an EVM chain account. The proposer has also provided a clear, understandable description of the targeted issue and a clear, understandable resolution. The metrics and kpi's describe the proposal's success. By evaluating the request, I concur that the data presented by the proposer is accurate.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11959, "q0": "The proposal addresses the challenge, not just by migrating users' assets to Cardano but allow users to interact and manage with multiple chains in one wallet. The team have also provided three user journey(s) that are very clear and detailed. This shows that they have are aiming to solve problems in the consumer ends and not building just another wallet. Right now, Flow, Solana, and Cardano are available in the NuFi wallet which I think it has proven that the team have already delivered a solid project so far. What needs to be noted is by using a single brige for the single multi-chain wallet would be the risk of assets being compromised. As we have heard many times that bridges have been hacked throughout the crypto timeline. This will be a challenge for the team. They have also provided that they will be adding additional EVM chains in the future. This will be a game changer and also provide an easy access for new users to adopt Web3 without having to connect RPC(s) for blockchains, or having multiple wallets at the same time.  ", "q0r": 5, "q1": "NuFi wallet is already a project that has been developed with many features available and the information about the team members is detailed, and do have relevant experience to what they want to achieve in the project. The work done on NuFi has already proven that the project can be delivered based on the roadmap, and they are fully capable in doing so. To add this, the roadmap is well prepared on what they want progress on, but there seems to be a lack of information in their budget breakdown whereby they want to improve their UI/UX with a more iterative and user-centric approach. This seems indeterminate, and suggest that they could provide a budget breakdown for this - such as hiring UI/UX designers, outsourcing budget, and so on. Despite that, I think the budget required for the project is reasonable given the compensation of few software developers, project lead and other aspects of the deliverables. The team have also provided social links which is great for background check and direct contact. Overall, the plan presented are easy to understand and have so many great features in terms of cross-chain applications in the wallet. \n", "q1r": 4, "q2": "The metrics and KPIs were well chosen and I believe they are good indicators for evaluating success of the project. The team members have also claim that they will be sharing reports of their progress via social media channels. What I would like to recommend is to also track and measure the number of bugs/errors that have occured in the project. The team have also provided what success would look like for the project, which is very clear and possible to achieve based on what they have been delivering. In general, the whole proposal is solid to me, full of important infos on how they are solving cross-chain problems, providing an all-in-one solution, and have a very detailed description on their risks needed to be addressed. ", "q2r": 4, "assessor": "z_assessor_3320", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11672, "q0": "Waaw such a brilliant work.  The proposer has done well outlining this key issues that effectively addresses the challenge.  Creating a web 3 where migrations can  be done easily is a plus to ethereum.  Furthermore, the proposer outlined the following; 1. Import existing ethereum wallets, 2.connect to dApps on ethereum milk omega and cardano from one wallet  and 3. Connect to dApps from accounts simultaneously which are enormous values this project will bring to ethereum  if funded and implemented successfully.  Moreover, future problems have been scaled and addressed by the proposer for a successful execution of the proposal. ", "q0r": 5, "q1": "The proposer has done a great work by outlining a plan for implementing this project and attaching a clear time line of 4months to the completion of project . Resources needed for the project have been outlined too in the plan. A budget has been given by the proposer of which a great work has been done by breaking it down into identifiable items reasonable for achieving the goals of the proposal. The proposer has also carefully selected team members well resourced for the achievement of this proposal. The Nufi team members were chosen who have gained a wealth of experience from several blockchain and web3 wallets.  Nufi team members have also managed and developed or consulted for several crypto wallets such as Adalite and Yoroi wallets.  With this experiences and skills presented,  I believe if funded, this proposal would be implemented successfully. ", "q1r": 5, "q2": "I agree that the information provided is sufficient to audit this project.  The proposer has stated that reports would be displayed on quarterly basis on their social media channels based on certain key metrics to measure which are provided. And with this, progress of the proposal can be audited.  Also certain standards to measure success of the proposal have been outlined under how success for this project will look like and by them we can tell if objectives have been met for the proposal. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 11477, "q0": "I attempted cross-chain transactions from MetaMask wallet to Cardano wallet and encountered a few difficulties. As a result, I believe that integrating to form a common wallet is critical to allowing ETH blockchain users to easily perform transactions on the Cardano blockchain. Along with that comes the option of remaining on the currently unstable ETH blockchain or migrating to a more stable blockchain like Cardano, which has resulted in a large number of developers wanting to migrate from ETH to Cardano.\nThis proposal, in my opinion, is primarily aimed at non-technical users. For them, the demand for this wallet is currently low. However, I believe that with the influence of Cardano and the good development of Milkomeda in the future, this demand will be increased, and that at this time, the proposal will be considered the top idea and the necessary choice of people who use the ETH blockchain and want to transact on the Cardano blockchain.\nWith this proposal, increasing the number of non-technical users migrating to the Cardano blockchain encourages developers from other blockchains to migrate to the Cardano ecosystem to develop dApps, so I give this section 5 points.", "q0r": 5, "q1": "The team has clearly verified members on Linkedin and has many years of experience in other projects, as well as enough members for each segment, which guarantees the proposal's success.\nHowever, I believe that 4 months is insufficient time for successful implementation. Because there may be issues such as testnet errors during the implementation process.Furthermore, I think it's necessary to include hedging costs in the budget section, such as price slippage, inflation, or other arising costs.\nI appreciate the team's determination to use their own revenue to keep this proposal running, as well as clearly identifying potential risks that increase the project's likelihood of success. I'd like to emphasize the risk of proposal delay when it is dependent on the success of other projects such as the Iagon Bridge, so I'll give this section 4 points.", "q1r": 4, "q2": "I really liked how the team presented this proposal. Create clear content, emphasize key points, identify risks both internally and externally, and have a convincing resolution. The measurement indicators outlined are very reasonable, and each indicator has a clear explanation. Setting out feedback and customer support metrics, in particular, is something that other projects overlook. This assists in resolving user issues as well as absorbing user feedback in order to improve the wallet. \nIn implementing this proposal, I believe the team has a strong sense of responsibility and determination. As a commitment made by the team, success metrics have clear numbers and reasonable timelines so that the community can track these metrics. I am extremely pleased with this section and will award it 5 points.", "q2r": 5, "assessor": "z_assessor_3250", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10462, "q0": "The problem defined in this proposal is that the existing user base who want to migrate from the Ethereum ecosystem to Cardano have to go through the configuration of several helper applications and then go through several multiplechains, with no user support. The process involves creating several wallets, creating wallet connections using bridges, and a certain degree of technical know-how. The project wants to address this problem by slimming down the process to one multi-chain wallet and one connecting bridge. This will make the process of transferring assets from Ethereum to Cardano much more user-friendly and simple. NuFi wants to automate the whole process, the user enters an existing Ethereum wallet into NuFi and right after that the Milkomeda and Cardano wallets are automatically created, along with a bridge that connects the whole process. The value for the user is that they have the history of all transactions in one place, they have an overview, and the process is not difficult for them, so even a less tech-savvy user can work in this environment. The user also saves a lot of time and energy by having the processes do the steps automatically for him. The added value for the Cardano ecosystem is that the transfer from Ethereum will be easier, more secure and faster. The proponent also states that this process can be applied to other blockchains and thus this project is scalable.  The proponent recognizes that unless the processes are easy and intuitive, there is a risk of user churn and based on this argument, this proposal is built. The team realizes that this is a big project and could go over budget but at the same time honestly adds that NuFi has its own resources and is willing to provide funding for this project in order to make it successful even. Alongside this, it is implicit in the design that customer support is always available should a problem arise. My overall impression of this project is that Cardano can benefit greatly.", "q0r": 5, "q1": "The plan is spread over 4 months of support, with the first month addressing the ERC-20 converter, the second month the Ethereum dapp connectors and Metamask, the third month Milkomeda relative to the previous ones, and the fourth month UX and support for assets other than ERC-20. The budget is very detailed and comprehensive, it makes it clear how much an hour of time of a certain activity costs, how much time is needed to implement a specific function of a specific process. Although the project asks for $97,600 but the value Cardano will receive is in my opinion greater than this amount. The team is made up of people who have successfully completed projects related to AdaLite, Yoroi, Ledger, Vault and others within Cardano development. From this it is obvious that this is a reliable and experienced team. The proposal contains enough information about the work history of the team members which we can see on Linked-in. Although it is not explicitly clear in the proposal who will be working on what activity, but we can assume that they will be solving problems together. For the future, this project does not plan on further funding under this proposal but may apply to implement the Catalyst voting system into the NuFi wallet. Overall, this proposal strikes me as carefully thought out, spelled out in detail, taking into account the risks but also addressing them, and, given past experience, substantially feasible.", "q1r": 5, "q2": "The proponent states that the following KPIs will be tracked - number of connections, number of transactions, number of users for different forms such as Ethereum and Milkomeda, Milkomeda and Cardano, dApps. Furthermore, the number of projects publicly recommending the NuFi wallet and the feedback collected from NuFi customers. These metrics will all be published quarterly on NuFi's social media channels. Success is defined as users being able to do an entire migration with Ethereum in under 1 minute and connect all accounts across a single bridge, NuFi conducting roughly 20,000 transactions per year, 15,000 users using the platform at least once per year, and the NuFi wallet being recommended by at least 200 projects per year. Based on the above, I believe the KPIs are well set and overall well thought out.", "q2r": 5, "assessor": "z_assessor_3187", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7820, "q0": "The proposal has painstakingly addressed this challenge. The team behind this proposal has an in-depth knowledge of the challenge and as a result have developed an  appropriate tool to tackle the problem. The Nufi cross chain wallet that this proposal is intending to deploy will do a good job at ensuring that more people migrate from Etherium to Cardano sweatlessly. For this reason I gave the proposal a 5 star rating. ", "q0r": 5, "q1": "The elaborate plan presented in this proposal is very assuring. Also going through the experience and skills of the team as well as the videos and links of the Nufi cross chain wallet and it’s functionalities it is of no doubt that this proposal will be implemented successfully when funded. I therefore give it a 5 star rating.", "q1r": 5, "q2": "The proposal contains a clear breakdown of activities that will be completed in 4 months as well as the key metrics to measure progress and success for each stage.  The proposal has also cleared defined what success looks like and the means to measure it. The budget provided is also reasonable and realistic. The links provided to check progress of work is also easily accessible. For these reasons I give this proposal a 5 star rating.", "q2r": 5, "assessor": "z_assessor_2924", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 7661, "q0": "The team references the challenge objectives of making it easy and fast for projects and users to migrate to Cardano.  This proposal aims to create a user friendly wallet experience that would allow for usage of Ethereum, Milkomeda and Cardano blockchains in a seamless manner.  By simplifying the experience for the user, this team aims to help projects migrate to Cardano while not losing users due to the difficulty of adopting a new blockchain.\nProjects will be hesitant to migrate to Cardano if they believe it will significantly affect their current users.  This proposal, successfully implemented, would provide a solution to one of the greatest barriers to migration from Ethereum.  It would allow users to set up one wallet and easily manage funds for multiple blockchains.\nThe team has also budgeted a portion of the funds for education and marketing of the product which I believe is essential to it's successful implementation and shows good insight by the team.\nThis proposal effectively addresses this challenge and has the potential to make a large contribution to the migration from Eth to Cardano.", "q0r": 5, "q1": "The team has extensive experience developing on the Cardano blockchain and has been part of many projects that are already widely adopted by the community.\nThe total time given for the project is 4 months which is broken down into understandable categories by month. The budget provided gives details on how the funds will be spent and on which phase of the project. The proposal is written in non technical terms which makes it very easy to understand.  While the team did reference the risk of the dApp not being widely integrated, I think the proposal could be strengthened with a short description of any technical or coding challenges the team is anticipating.\nThe team is planning to track their progress on social media channels and will collect multiple data points that will monitor the usage of the product including connections and transactions.\nThe team has ambitious goals for the success of the project including wallet setup in a minute or less, 20k transactions in 12 months, 15k user transacting on Cardano and Ethereum, 20k connections to Eth/Milkomeda.\nIf the team is able to deliver on these goals, this project would have a profound, positive impact on Cardano and the migration of users from Eth compatible blockchains.", "q1r": 5, "q2": "The team has laid out an understandable timeline with specific tasks to complete each month. They plan to provide updates on their social media channels and have clear deliverables based on the monthly goals they have set.  I think the proposal could be strengthened with a public facing dashboard or location where progress could be checked in real-time, but this is not critical in my opinion.  The team will also track usage of the wallet to better show adoption/migration.\nThe members of this team have delivered an many projects related to Catalyst and self funded projects.  They have built some essential infrastructure that is being used currently and it seems likely the team will deliver on this proposal as well should it get funded.\n", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6905, "q0": "If I see the problem from technical POV, It's real problem we are facing when wanted to use Ethereum Wallet with Cardano Wallet. The solutions are pretty simple, But I bet the execution from those solution not simple as we've imagined. As my background is the on Tech (14 years experience in Web Development). This need more effort executing this Proposal, so the challenges are huge here to make this solutions implemented. Please bear in mind, if you want to integrate something with this project, it could have more challenges. Because Integration is the biggest challenge in the technical side. It's because you are dealing with uncontrollable things from the Third Party (Third Party Library / Third Party Tools Required).", "q0r": 5, "q1": "Based on the planning on this proposal, It's well said, from the journey of the development, Development Phase in the timeline, and Budget Break down. But I have some suggestion, As this might use some Integration with 3rd Party, this would be good if you also put the architecture in your planning, and also put the SIT and UAT part on your timeline and plans. this gives us more visibility on how wide this proposal is. Can't wait to see this proposal execution running.", "q1r": 4, "q2": "I can see the bigger plans on this project proposal. It consists of Business Side, Technical Side, and Marketing side. My Suggestion is to put Github Link / Trello / similar tools that given more information regarding Business Progress, Tech Progress and Marketing Progress. This is really helpful for us to get more information and visibility what's the progress. and Just in case you have some issues during development process, this could be easier to get more help.", "q2r": 4, "assessor": "z_assessor_2847", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14374, "q0": "This proposal would help Cardano accomplish its mission as NuFi improves the cross-chain Ethereum and Cardano experience for non-technical users by providing a single, non-custodial Web3 wallet that:\nsupports Ethereum, Milkomeda and Cardano accounts needed for asset migration; connects all accounts to a bridge where assets can be migrated; and enables multi-chain asset management and multi-chain dApp connectivity.", "q0r": 5, "q1": "The NuFi team has a wealth of experience acquired during many and varied blockchain and web3 projects; as they demonstrate in their proposal, NuFi team members have managed, developed or consulted on crypto projects including AdaLite, Yoroi Mobile Wallet, Ledger and Trezor Cardano Integration, WingRiders Cardano DEX, Jamonbread Marketplace CNFT, Brud, Seiza blockchain explorer, decentralized storage, etc.", "q1r": 5, "q2": "this proposal would be well measured to follow the progress of this project, because the proponents had provided resources that can help cadano to follow the progress of this project;\nA self-custodied multi-chain crypto wallet to securely store, stake and trade $ADA, $SOL and $FLOW, manage NFTs and connect to dApps.\nNuFi\nhttps://www.youtube.com/watch?v=6_oCOKgl7Gw\nIconYouTube\nNuFi: Ethereum and Cardano Web3 Wallet\nNuFi: Ethereum and Cardano Web3 Wallet", "q2r": 5, "assessor": "z_assessor_4009", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5565, "q0": "This is a great idea that fits the goal of the challenge. This proposal focuses on the project's existing user base, who join the project after migrating to Cardano, must first migrate their assets, and then manage assets across multiple chains afterward. . If the process is not straightforward, a project can expect a significant drop in users throughout the process, making migration to Cardano less appealing. The team's solution is to build NuFi that improves the cross-chain experience from Ethereum to Cardano for non-technical users by providing a single unattended Web3 wallet (supports Ethereum, Milkomeda, and Cardano accounts as needed. needed to move assets / connect all accounts with a bridge where assets can be moved/enable multi-chain asset management and multi-chain dApp connectivity). The proposed implementation will benefit non-technical users who need to migrate content, and projects moving from Ethereum to Cardano. In addition, the proposal focuses on the user experience, compared to the current steps that users are having to take, which are complicated for non-technical people. This proposal refers to Iagon Bridge (bridge.iagon.com) as a service that NuFi wallets can integrate to achieve the goals outlined here. The Wagon AS team has agreed to this integration if NuFi's proposal is funded.", "q0r": 5, "q1": "The proposed budget is $97,600 broken down into 6 pieces (Support for Ethereum blockchain, ERC-20 assets and dApp connectors / Support for Milkomeda sidechains, ERC-20 assets / Integration with bridges connect common assets / Create support articles and train support staff / Marketing / Project & Product Management) and follows an identifiable route, budgeted by hours work and unit price for each position ($80 or $40). The team has 10 people and detailed information about each person with specialized skills is provided on Linkedin and the role of each person in the project is also provided. The proposal provides a reasonable plan and explained what activities will be developed each month, so we have a solid view of what is to come, fully understanding the process. The team also plans to further develop in the future to integrate Catalyst voting registration in the NuFi wallet to add value to the ecosystem. The team also identified 4 main risks and provided reasonable solutions to minimize this risk, this information helps us to have confidence that the project will execute as planned.", "q1r": 5, "q2": "Progress information and milestones will be provided by the team for 4 months with each month having a clear goal (January: Supports Ethereum and ERC-20 assets in wallet / February: Ethereum Support in the dApp connector - MetaMask override function /March: Support for Milkomeda and Milkomeda ERC-20 assets in the wallet - Milkomeda support in the dApp connection /April: Achieve desired cross-chain UX level - Support for non-ERC-20 content (ERC-721 and ERC-1155)). I understand that the team works full time to be able to do a large amount of work completed in 4 months. The team also has an information channel to provide project progress to the community. 5 metrics are clearly defined by the team to evaluate the success of the project, there are 4 that are easy to measure, in addition, I highly recommend the 5th (Feedback is collected through the support portal. NuFi customer support)", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4792, "q0": "The proposer points to the problem that users have, problem by using of two Ethereum x Cardano wallets, especially asset migration, and claims that it is complicated. This proposal offers a solution for users to use one wallet instead of two Etherium and Cardano wallets. Through the proposed solution section, “who benefits from this proposed solution?”, the proposer explains in detail how this project will add value to the Cardano ecosystem and how this project will help users! The proposer lists key metrics and goals that match the highlighted challenge settings.", "q0r": 5, "q1": "Vacuumlabs is behind this project and Vacuumlabs is the company behind AdaLite, Wingriders Cardano DEX, and Jam on Bread CNFT marketplace, and the developers of the Cardano apps for Ledger and Trezor hardware wallets, as well as Yoroi wallet's mobile app. So we know for sure that this team has a lot of experience, skills, knowledge and abilities. The team is transparently presented via LinkedIn and has 10 people. A detailed budget was presented. A work plan was created with clear time frames within the project will be realized. The team presented internal risks and external risks and offered adequate solutions if risks arise.", "q1r": 5, "q2": "A detailed roadmap with milestones has been created and we can see how the entire project will be completed by the end of 2022. The proposer explains in detail what the success of this project looks like and how he will measure and track this project's progress. Due to the very high professionalism of this team and the way the proposal was written, the community will have absolutely no problems in monitoring this project.", "q2r": 5, "assessor": "z_assessor_2616", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4653, "q0": "The proposal is all about creating a unified wallet that has support for both EVM and Cardano based blockchains. The proposal discusses established ideas like interacting with bridges and the dapp connector to make transactions possible. The proposal definitely does make the experience for the user, particularly the no so techie user a much easier experience to wrk between both blockchains. The question i have is, even with a unified bridge/wallet, does this address migration entirely? for example - can the wallet wrap EVM based NFTs and put them onto the Cardano blockchain.. a genuine migration. The wallet addresses user experience more in my opinion. Which in its own right is great. But I would like to see more advanced methods of functionality in this product overall with time.", "q0r": 4, "q1": "The team at NuFI, Vacumlabs etc is established and looks to have the knowledge and skills to get the project done. The budget is roughly broken down into 10 weeks, 5 weeks, 1 week between implementation processes at an average price of $80/hr, which is reasonable. It would have been nice to show a bit more of the timeline and project progression, with the project broken down into submodules . The NuFI/Vacuum team are their own team, do they need funding for such a product that will be (as far as i can see) profit driven? will they \"give back\" to the community in anyway -- this question comes in the form of overall adoption, will the community adopt it?", "q1r": 4, "q2": "Unlocking all the stats on the number of processed transactions, assets wrapped etc is a must here, these sorts of stats need to be made available publicly to the Cardano community to gauge auditability of the product that they funded. \n\nHow does the Cardano community gauge the progress of the product in the build phase? I realise that a closed source software project, that will be kept in house is a hard thing to convey to the public, but i have no seen an audit-able ways of making the build state known. I would suggest, update videos, social media regular updates etc. Not just auitability of the product at the end.", "q2r": 3, "assessor": "z_assessor_2580", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3620, "q0": "\"The Great Migration\" proposes solving the challenge requirement. Currently, the blockchain community has a large number of non-technical users, including me.\nWhen participating in blockchain, the basic operations I understand are opening an account, linking an account, attaching a coin wallet, money to transfer / withdraw and every time I am afraid and confused with my assets. With such a mentality, I sympathize with the elderly about the fact that they go directly to the bank or post office to receive pensions and money transfers.\nTo be honest, I still don't understand blockchain technical terms like block chain, cross chain.\nSo if the transfer of assets from Ethereum to Cardano is too complicated and difficult, the ability to create \"great migration\" is very unlikely.\nI read the solution you wrote with the 3 steps envisioned is not too complicated and your suggestion is the Ethereum->Milkomeda> Cardano intermediate bridge.\nThe proposed internal and external risks are a huge minus point of the project\n- NuFi dApp connector will not be integrated with Ethereum and other dApps of the EVM chain =>\n- Another multi-chain dApp wallet that will integrate Cardano and make this project redundant\nSo the question is which solution is proposed to be optimal.\nI look forward to the project to complete and develop", "q0r": 5, "q1": "The proposed support budget calculates the average in the industry and can be consulted with the price set by the same industry, within only 4 months, your proposal is expected to be completed, which proves that our team You are fast and full of enthusiasm.\nBecause the team has a lot of experience from blockchain and web3 projects, experience in managing, developing and consulting many large projects such as Yoroi mobile wallet, which is currently being used to receive ADA rewards from Catalyst, the level The time given will be reasonable.\nHuman resources + time plan is the decisive point for the feasibility of the project.\nThời gian phát triển dự án ngắn cũng giống như mục tiêu mong muốn chỉ tỏng vòng 1 phút với các bước đơn giản và tối ưu việc chuyển tài sản từ Ethereum sang Cardano sẽ hoàn thành\nGo fast + go ahead + overcome obstacles => reach the finish line first.\nIf you are the pioneer to guide those who do not know the way (non-technical people) to the finish line, you will receive their trust and gratitude.", "q1r": 4, "q2": "The number of people using the Nufi wallet will measure the success of the project.\nMeasure success over a specific 12-month period:\n- 20,000 transactions using Nufi . wallet\n- 15.00 transactions using both Cardano account and EVM chain account\n- At least 200 user projects for cross-chain activity\n- 20,000 connections to Ethereum or Milkomeda dApps using NuFi wallet\nThese are the standards set out for the community to easily monitor and audit.\nThe detailed budget framework of the proposal demonstrates transparency.\n  Do you believe that moving assets from Ethereum to Cardano in less than 1 minute with simple operations, not only in the industry can you believe it, Nufi will reply to you", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 2512, "q0": "The project is trying to solve a very relevant problem which is also perfectly encapsulates the objectives of the challenge. Both Cardano and Ethereum have completely different underlying technology architect. Cardano uses Haskell programming language for coding whereas Ethereum code is build using Solidity. Ethereum uses account based model to process and record transaction whereas Cardano on the other hand uses extended UTXO model. Due to the differences in the underlying architect used by both of these networks, they require totally different kind of technical skill to develop dApps or supporting infrastructure like wallets for these two networks. If an Ethereum based project migrates to Cardano, it becomes difficult for its user to also migrate to Cardano due to the complexity involved in migrating assets from Ethereum to Cardano blockchain. Not only that, they also have to install multiple wallets as no single wallet supports both these chains. \n\nTo address this challenge, the proposal is trying to develop a multichain wallet called NuFI which can be used to access all 3 blockchains viz Ethereum, Milkomeda and Cardano. Using this wallet, users can easily transfer their assets from Ethereum to Cardano in just 2 clicks. They are also planning to reduce this to just one click once the advanced features for cross chain compatibility being developed by Lagon bridge are complete. Moreover the wallet will allow users to access dApps on both Cardano and Ethereum so they don’t have to switch between different wallets.\n\nThis wallet can be game changer in respect of attracting new users from Ethereum to Cardano. With the plans of the team to extend this support to other EVM compatible chains in the coming future, it might be able to migrate users from other EVM compatible as well as Ethereum L2 chains to our ecosystem. In my opinion this will help immensely in the adoption of Cardano and this proposal very well addresses the objectives of this challenge.\n", "q0r": 5, "q1": "The company behind the proposal Vacuumlabs already has the experience of developing many projects like, wingeriders DEX, Adalite wallet, and Jamonbread NFT Marketplace. The team members listed in the proposal are very competent and have the skills required for the project. The Roadmap for this particular proposal is divided into 4 months and they include adding support for Ethereum and Milkomeda assets and  then dApp connector support.  The NuFI wallet is already developed as browser extension and team possess the required skills to create cross chain features for seamless experience for users migrating from Ethereum to Cardano. Given these facts, the proposal is very feasible to implement.\n\nOn the Budget front, the proposer is requesting for funds of $97600 which is a reasonable amount. The full breakup of the funds required for each step is provided in full detail and it will be adequate to complete the proposal. In case more funds are required, given the fact that the company behind the project is already well established, they can easily secure the funds to complete it. \nI am confident that the project is feasible and team will be able to deliver it as per the schedule. \n", "q1r": 5, "q2": "NuFI is an existing wallet and new features are added to it regularly. The progress of the project can be monitored from the new functions being added to the wallet every month. Team also publishes regular updates regarding new developments through their social media platforms. So the development of the proposal can be easily monitored and audited through these milestones and the success can be measured from the number of user using the wallet and new users being migrated from Ethereum to Cardano.\n\nIn the end I like to add that this is one of the very important proposals for the growth and adoption of the Cardano ecosystem and bring new people from other blockchains to Cardano. I am hopeful that they will be able to secure the funding from Catalyst. I wish them all the best.\n", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1981, "q0": "The proposal is all about providing a great user experience for the migration of asset fro essentially Ethereum to Cardano vis a vis Milkomeda (an existing Cardano layer 2 Side chain) providing a great user experience, easy and efficient asset migration, convenient and accessible platform to engage in various Defi activities within and amongst Ethereum, Cardano and its side chain; Milkomeda, a single, non- custodial and multichain wallet is a welcomed idea and should be supported.\nThe risk factor were adequately elaborate and mostly in the area of redundancy and credible remedies of being constantly innovative, proactive were envisaged. \n The proposal clearly defined its problem statement and the solution proffered is definitely within the tenets of a challenge settings.", "q0r": 5, "q1": "The proposal has provided adequate information on its mission/goals and how it intends to achieve them. It is evident that the team is well experienced and competent to deliver the project. Sufficient information were given about their milestones and timelines to be achieved in conjunction with the detailed and measurable budget estimates. Am confident that the proposal is in good hands for an effective implementation. ", "q1r": 5, "q2": "The proposal has conveniently provided more than enough success metrics which are quantifiable and measurable. The information provided for the community is adequate to monitor and assess the extent of the progress and performance of the project if eventually funded.", "q2r": 5, "assessor": "z_assessor_2292", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 1523, "q0": "The Challenge-Great Migration (from Ethereum) is very much addressed by NuFi's proposal. Simplifying the process for non-tech folks to migrate Ethereum based tokens/coins in a two step process without the use of Metamask will make the switch less scary for many users. Having the capability to continue to use the Ethereum blockchain within the Cardano ecosystem is an absolute plus.                                                            The integration of Milkomeda (and Iagon) will make the bridge between the two worlds seamless and secure. Future aspirations include the addition of other blockchain, such as BSC and Algorand.", "q0r": 5, "q1": "The NuFi team created Adalite, one of the first Cardano web wallets. They also assisted with many other well-known blockchains and web3 projects; Wingriders, Ledger and Trezor Cardano intergration, Yoroi mobile wallet, Jamonbread CNFT Market place, decentralized storage, Seiza blockchain explorer, to name a few.", "q1r": 5, "q2": "By monitoring the adoption and use of the Chrome ext + dApps connectors, Nufi has established parameters of success including but not limited to:\nquick connectivity and migration (under one minute).                                                                      \"NuFi wallet is used to execute 20,000 transactions on Ethereum to Cardano asset bridges over a 12-month period\"\n\n\n\"15,000 users transact with both a Cardano and an EVM chain account at least once over a 12-month period\"                                                                   \"There are 20,000 connections to Ethereum or Milkomeda dApps using the NuFi wallet over a 12-month period.\"                                                Report will be done via social media outlets, such as, Reddit, Twitter etc.\n\n", "q2r": 5, "assessor": "z_assessor_2256", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 1295, "q0": "Yes, yes and yes! Now we are talking about migration. The problem described in the proposal, that first we need to make migration for ETH users to ADA easy, and that currently it is technically demanding (more wallets to be created, and some technical knowledge), which can result in a situation, where a user is willing to migrate, but due to this issue he might give up eventually. The solution proposed in this proposal is focusing on creating a new wallet where a user can import Ethereum wallet, and Milkomeda + Cardano accounts are automatically created, and then he is able to transfer his assets from one chain to another – WITHIN – THE – SAME - WALLET. Side by SIDE. The same process applies for assets (NFTs) using the chrome extension. Another very positive outcome is, that whilst using the NuFi (that is the name of the wallet), he a user can operate at both chains simultaneously, some assets on Cardano – possible to do transactions, another assets on ETH – possible to do transactions again! This solution can overcome so many barriers that (I am strongly convinced) are actually stopping people to migrate. The icing on the cake is of course the possible future integrations of another chains. With such wallet implemented, users will eventually can stop creating wallets on different platforms (or well, they will create them, but will end up using this one)….why would they use 5 wallets for 5 blockchains, when they can have 1 wallet for all of it? The inflow of users can be…phew!  Regarding risks, the team identified 4 of them, and I personally have enjoyed the second one – and love the solution – metamask override mode in case that NuFi will not be integrated to EVM chains. Also, the last risk – what if someone comes up with the same solution sooner – lets hope it will not happen, and the proposers wants to support as much features as reasonable to be the No. 1 on the market. ", "q0r": 5, "q1": "The roadmap is set to 4 months, whereas each month is having a milestone/s to be met. At least the first month could have been outlined better to have a more detailed overview that proposers actually know how to proceed. The budget in total is 97 600 USD, and is divided to 4 main categories related to Support to eth and milkomed achain, integration of bridges and dapp connector. The budget in these 4 categories is calculated as 80 USD hourly rate times expected hours spend on tasks, and it seems well prepared. The other two categories that are not related to development are marketing and project and product management, whereas the same approach was taken. Regarding the team, they are creators of wingriders DEX,  AdaLite and many more, which is providing a sufficient level of confidence, because I have already used these products. Also, the team is consisting from 10 members with provided linked in profiles, where I was able to track their bios, and find them competent and skilled enough. ", "q1r": 5, "q2": "The problem (entry barriers for ETH users to migrate to Cardano) and solution (wallet with automatically set up Cardano and Milkomeda accounts) is clear and reasonable. Regarding to the monitoring of the progress, the team plans to measure the number of connections within the NuFi wallet, the number of users who performed a transaction between EVM and ADA, the number of dApp connections as well as number of transactions via these dApps, and few other. The metrics of success is described in another 5 points, whereas I find very interesting the goal of the team, that user is able to set up this wallet within one minute, then there are KPIs regarding transactions (20k during 12 months), and the team would like to reach 15k users who performed at least one transaction within one year, and two more. What I am missing, is the information how often and where will the team report their progress – will it be on discord, telegram, twitter or another medium will be used? Or will it be directly on their website via some blog posts? Even tough I found links to these channels on your website, it would have been better to have it explicitly stated in the proposal. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 1025, "q0": "As we try to implement blockchain technology into everyday lives, we need to think about how the everyday user interacts with the blockchain. To a regular person, they might not be interested in how Cardano performs against Ethereum. They just want it to work. And having their assets in one place is paramount to having complete control over your assets.\n\n NuFi wallet addresses this problem of friction when it comes to interacting with assets on the blockchain. As the Cardano blockchain begins to bridge to EVM chains, it will be a very important feature to have a wallet that simplifies the process of bridging these chains without causing pain to the user. ", "q0r": 5, "q1": "Given the track record of the team, they are highly likely to deliver on their promise. Wing Riders has become one of the most innovative DEXes on the Cardano blockchain. \n\nThe team has also displayed their exprience with the bridges like Milkomeda on Wing Riders DEX by implementing swaps for Wrapped Eth and USDT. \n\nThe team also helped in pointing out a vulnerability in another DEX's design that would have caused users to lose a lot of their funds. Their heart is in the right place when it comes to the growth of the Cardano community. ", "q1r": 5, "q2": "The user journeys that were provided give a tangible view of what can be used to assess the milestones of the project. \n\nWe are also provided with key milestones that are divided into 4 months that point out proposed progress for the project. \n\nHowever we aren't given a look into how the community can follow up with the project through townhalls or Telegram/Discord updates. ", "q2r": 3, "assessor": "z_assessor_2186", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5544, "q0": "A proposal of this nature that has identified a complication in the Ethereum and Cardano cross-chain user experience because that users should have at least two wallet and several tools before assets can be migrated, it’s one that touches on the pain points of the challenge. The problem described aligns with the challenge. Seeing that Cardano ecosystem is growing rapidly, and having a project that seeks to to create a Web3 wallet where users can import their existing Ethereum based wallets and connect DAPPs to Cardano amongst others would go a long way to secure user assets and integrate new innovations to the ecosystem. That would be a big plus to cardano. The key metrics and goals of the project are in alignment with the challenge setting. The project is viable considering all that have been captured in it, and I believe in the long run when the goals are achieved other ideas can be incorporated into to allow for other projectS to migrate to Cardano. The project is very scalable. From what has been stated in the proposal, the team intends to make this project a self-financing, hence they wouldn’t consider coming back to catalyst for funding. That for is good to know that it’s geared towards generating revenue to sustain its self.\nThe proposal is impactful.", "q0r": 4, "q1": "The team is capable of executing the project considering the information about their relevant experience. The team is called NuFi. NuFi is linked with Vacuumlabs, the brain behind the Cardano apps, ADA lite and several other projects, hence I am confident that they are up to the task. Also the information about each team member is clear and they all appear to be qualified considering their relevant links and references to execute the project. \n\nThe budget is very detailed hence it’s understandable on how the funds would be used and for what. Though the $97,600 looks huge but however, I believe for this kind of a heavy project, the cost is sensible to achieve the desired outcome. The timeline is realistic and also it’s clear that the project would take 4 months to be executed. Also the plan is clear and comprehensive because it’s describing how the Web3 wallet connections within the Ethereum and Cardano cross-chain would carried out. I must say it’s a good effort that the proposer has factored in the risks/challenges that may arise during the implementation of the project.\nI will conclude by remarking that the project is feasible.", "q1r": 4, "q2": "The roadmap has clear milestones as it’s clears what is intended to be achieved in the first month up to the fourth month. The time horizon stated here is very clear and understandable. \nThe metrics or KPIs were wisely picked and I think that they are good measures or indicators for assessing success: this is because they indicate users that are able to setup the accounts needed for Ethereum to Cardano asset migration and others. \n\nThe  problem described here is clear and I believe that the proposed solution is effective enough to address the problem.\nThe proposer has also stated that monthly reports of the project would be communicated on their social media channels, however I would still find it beneficial if the proposer stated those social media channels they would communicate through since there are so many of them.\nThis project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14865, "q0": "We need to compliment the team for a clear explanation of their solution with problems with the existing solution, their vision of the user journey and who this new solution will help. The foreseeable risks are also specific. They do provide briefly some ways to overcome those risks. For instance, with the external threat of competitors with the same solution, they intend to support a wide range of functionality of Cardano which is complicated for the competitor to follow. ", "q0r": 5, "q1": "The provide plan wasn’t specific enough for me to determine whether it is executable or not. The timeline shouldn’t be only about works that need to be done but also how they intend to do them. My suggestion is that the team includes some technical aspects of the project so that voters have more insights into what they are going to do. Plus, the timeline only has the key milestones and in my opinion, these milestones are pretty dense. I wonder if the team has any backup plan when they fail to meet the deadline of the project somehow. In the detailed budget section, they mention the cost of marketing which they don’t include in the timeline. This is another thing to adjust.\nThe budget breakdown is reasonable and detailed, I have nothing to add up to this part.\nThe fact that this is the same team that delivered/consulted for projects like Yoroi wallet and Adalite really increases their credibility. Every single member was listed out with their LinkedIn profile makes it easy to reach them about project-related questions.", "q1r": 3, "q2": "They write that information and report will be published on a quarterly basis via their social media channels but they don’t provide links to their channels.  For that reason, I only give this part a 4. Other than that, this part is detailed, the team do have a vision of how they track their project and what its success looks like which seems decent to me.", "q2r": 4, "assessor": "z_assessor_4106", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "NuFi Web3 wallet will allow users to:\n1) Import existing Ethereum wallet\n2) Connect to dApps on Ethereum, Milkomeda & Cardano from one wallet\n3) Connect to dApps from different accounts simultaneously", "experience": "NuFi (a non-custodial multi-chain wallet) is powered by Vacuumlabs, the company behind AdaLite, Wingriders Cardano DEX, and Jam on Bread CNFT marketplace, and the developers of the Cardano apps for Ledger and Trezor hardware wallets, as well as Yoroi wallet’s mobile app."}