{"id": 420887, "author": "darenft", "title": "Game Play and Earn from EVM Network", "url": "https://cardano.ideascale.com/a/dtd/420887-48088", "category": 26593, "amount": 80000, "description": "NFT game is one of the Dapps with the largest number of transactions on blockchains today. Most NFT games and gamers are now on EVM platforms such as Binance Smart Chain or Ethereum.", "f6_no_assessments": 11, "f6_rating": 4.8181818181818175, "videos": [], "media": [], "f6_assessments": [{"id": 1302, "q0": "The aim of the proposal is to migrate an NFT game “Metarrior” from BSC chain to Cardano and migrating other users/members along. In the proposal, there is a trailer provided, where we can see the mechanics of the game, such as match-3, deck building, boss fights, crafting or different challenges. The game itself is trying to distinguish from the model “Play to Earn” and defines itself as “Play and Earn” whilst claiming that P2E is not sustainable due to inflated supply, and they plan to solve this issue by rewarding only the top players of the game. At the same time, the number of telegram users for their international channel is approx. 14k people, which is not a small audience. Another statement in the proposal is that once Metarrior migrate to Cardano, the number of gamers and games will increase. I can relate to the number of gamers, but it is not explained how the number of games will be affected by this transition. At the same time, NFT gaming is in a downtrend for approximately 6 months, thus it would be nice to have some supporting data about their users/members, whether the impact will be as expected. Regarding the risks, the proposers state that the main risk will be to teach community to adapt to cardano fees instead of BNB fees, which I dare to disagree, and I do not really consider that as a risk. The risk will be whether they will maintain or increase the traction and inflow of users, to meet the challenge goal – migrate users. Right now, only the design of the game and its mechanics is posted, but the traction is not explained very well, therefore the impact is questionable. ", "q0r": 4, "q1": "The proposed roadmap is set to 4 months, and for each month, there is a list of deliverables/key activities to be met. I am lacking an explanation on how they actually plan to migrate from BSC to Cardano, since the game is already being developed, how much time consuming it will be, what tools, features, bridges or compilers will be used. (basically any technical specification). During the first month, it is planned that test-web-browser and test-desktop version will be released, which I find very time consuming, but what is also unclear-  is the current state – how much is already developed? What is left to be done? Next, there is a number of pictures displaying game features, NFTs, MEWA token distribution and tokenomics, how to earn, game eco system or marketing strategy – so from these points, it is obvious that the team spent a lot of time designing the game itself, and it is feasible to  develop the game. Regarding the last picture, which is displaying the flow between metarrior and gaming center – it is not clear what is meant by the gamin center, as well as DreambitCity. Although it displays nice figures, and promises a lot of traction, this could have been elaborated better. Regarding the budget, the requested amount is 80 000 USD, and this amount is divided between Community manager + marketer, Game designers, Game developers, Blockchain developers, and Web developers. For all of these, there is also a job description provided, the number of people on each job and the expected time spend. I find the detail of the budget description reasonable and it provides a good overview of where the funds go.  The proposers are actually composed from 4 companies, and as they state, they have approx. 200 developers,  so they have the manpower to deliver the task. ", "q1r": 4, "q2": "The problem is defined as that most NFT games are launching on EVMs, and that it will be solved by their project launching on Cardano, and then migrate some amount of users to Cardano. To audit the process, the number of alpha participants and the number of wallets connected will be measured, and the telegram channels will be used a source of updates. Regarding the KPIs, the successful launch of Metarrior is definitely a characteristic to audit the success, and their aim is to bring 3000 users to Cardano. Another metrics that are stated e.g. more people from Cardano playing Metawarrior, or successful IDO/INO are related to the success of the game itself, but the aim of the proposal is to migrate people to cardano, and these are not really auditing whether this goal was met. But overall metrics are stated + public channel is there to track the process, I believe it can be audited. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1412, "q0": "The proposers wants to move the METARRIOR game from BSC (Binance Smart Chain) to Cardano. The use of BNB for in-game trading will exchange into ADA. This needs to be carefully prepared and especially training for users to avoid a bad user experience.\nAs far as I know, moving a system from one platform to another will take long time and lot of technical challenges. In addition, switching to Cardano will also face problems relating to Cardano's smart contract because it is written in Haskell - Plutus which is completely different from the language that Ethereum uses to write smart contracts. Although I don't see any details in this proposal, I think this team will be able to do it.\nMaking this transition will result in a large number of Metarrior game players migrating to the new platform. This is very good for Cardano recognition because the Metarrior gaming community in Vietnam and internationally is over 20,000 people.\n", "q0r": 5, "q1": "When migrating the community of gamers from the old platform to Cardano, it will help a large number of people who are playing the game to know the Cardano Platform. In addition, the proposal team also issued a public offering of 15% Meta Token (750 million) to the market which will also help the crypto investment community to know more about Cardano. With the game’s successful migration, it will become case-study for many other game publishers to learn and migrate over to Cardano. This is great for Cardano.\nThis team is very potential. Their information is fully provided with huge profiles and working experience. They are experts in the field in charge of.\nBudget of the proposal clearly describes what to do, how much time, how many people and how much money, etc., which is very detailed and transparent.\nThe proposal’s implementation plan is about 4 months, divided into different phases of each month that specialized teams will perform, this arrangement shows that this team does it regularly and professional.\n", "q1r": 5, "q2": "The proposal’s implementation time is provided in details, roadmap is clear and logically and professionally arranged.\nThere are KPIs with a lot of detailed information and clear results such as mainnet launchdate, INO, IDO deployment, increasing number of players, etc.\nThis proposal also provides a Telegram channel with more than 8500 members, regularly updated information for the audit being carried out easier and more transparent.\n", "q2r": 5, "assessor": "z_assessor_2237", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1983, "q0": "The proposal aims to replicate an existing Game project from Binance Smart Chain (an EVM based Blockchain) to Cardano. The proponents boast of a robust community and the potential of migrating this gaming community the Cardano Blockchain to assess, play and earn from similar game in Cardano. The proposal is definitely in conformity with the goals and objectives of the challenge and am convinced of its success.", "q0r": 5, "q1": "The proponents of this proposal has provided relevant information and links to confirm and verify their competence and requisite experience to deliver this proposal. In addition and considering, the fact that they managers of a similar project in another Blockchain shows that they have have an existing MVP to build upon and the capacity to perform. The budget estimates and the key milestones were adequately elaborate and reasonable within the specified timeframe. Am delighted that the proposal has a robust marketing and tokenomics activities which buttress the point that the proponents are well experienced and competent. \nThe risk factor about the fear of change to a new platform by the Binance community was acknowledged with explicit and effective means to alleviate this drawback. ", "q1r": 5, "q2": "The proposal has provided adequate information on how to monitor and assess the performance of the project. The success metrics and the basis of verification were elaborated and sufficient. Am of the opinion, that the community has all the information to conveniently track and confirm the development and success of the project if eventually funded.", "q2r": 5, "assessor": "z_assessor_2292", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3621, "q0": "The development of the NFT game on Cardano will bring a large number of players from Binance Smart Chain to Cardano. The game \"play and earn\" is currently hot and very accepted in the blockchain community, everyone wants to be entertained and earn money.\nThe problem for Metarrior is that the player who plays this game is still a gamer not an investor, controlling for NFT inflation.\nThe plan to launch an EVM-based blockchain implementation in the Cardano ecosystem if successful, the number of projects and users migrating to the Cardano ecosystem will not be far away. When habits want to change, it takes time and attractive incentives for gamers to accept changing habits, this risk that if a solution is found, the proposal will certainly develop. I look forward to the day when the project is born and works on Cardano", "q0r": 5, "q1": "With more than 200 developers in 4 companies building detailed plans for each specific milestone:\n- With the 2nd month of alpha testing, the trial game will experience some of the main gameplay of the game\n- With 3rd month, 4 games officially stopped offering NFT, original Dex on Cardano.\nIt is interesting that there are 4 proposals for this fund:\n- Game play and earn money from EVN network\n- NFT Game Market from EVM Chain\n- Next Generation NFT Platform\n- DAO for multi-asset NFT.\nwill promise an explosion in the number of users and players in the Cardano ecosystem.\nThe budget is allocated in detail for each stage, each person is in charge: management, marketing, design, game development, blockchain development, development, I see no problem in budget allocation. this.\nStrong team the project is attractive and awaited and very feasible.", "q1r": 5, "q2": "With 4 projects with 4 companies and more than 200 developers, the KPI construction will be gradually completed, the budget will be closely monitored and transparent.\nEach specific goal is given:\n- Successfully launched mainet\n- Deploy 1,000 NFT items to be sold\n- Target 5,000 players in the first month\n- Attract 3,000 players from the community\n- Attract 2,000 Cardano players to join Metarrior.\nSuccessful monitoring and measurement will be assessed and documented by the community. I trust this project", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5566, "q0": "The proposal meets the requirements of this challenge very well because it will bring a large number of NFT players from Binance Smart Chain (an EVM-powered blockchain with a large number of games and market players) to Cardano using the game METARRIOR. These are the proposals the challenge is looking for (Metarrior is the first true Web3 game that integrates traditional gameplay and NFT 2.0 technology to provide countless opportunities for gamers to engage in immersive gameplay), experience real ownership of game assets, while players have endless opportunities to earn exciting in-game tokens and valuable rewards. intends to launch the Metarrior game on Cardano to increase the number of games and players on Cardano. The proponent also stated they have a community of NFT gamers in Vietnam of nearly 10,000 people on telegram: https://t .me/MetarriorVN and the international community of NFT gamers of more than 10,000 people: https://t.me/metarrior_official_group In addition, the proposal also links to 3 other proposals in this fund9 (NFT Game Market from EVM Chain: https://cardano.ideascale.com/c/idea/420897 - Dynamic NFT Platform (next-generation NFT): https://cardano.ideascale.com/c/idea/420904 - DAO for multi-asset NFT: https://cardano.ideascale.com/c/idea/420910)", "q0r": 5, "q1": "The team gives a 4-month to monthly roadmap to make up the game development, it's very helpful to understand how the project creation should look like. I rate it as positive in the first month, the launch of the beta versions will be done to let the public understand how the game works, in my opinion, this is a great strategy to attract attention and encourage everyone to play. It is proposed to release Tokenomics but it is not clear when?. The core team and advisors are very strong, introduced on the website (https://metarrior.io/), each member's professional position is clearly stated, but each member's experience, skills, and LinkedIn link are not fully provided. The proposed budget is $ 80000, detailed information describes what work is done, how many people do it for how long, and from there calculate the cost to finance, there are 2 job positions (Game developer) / Blockchain developers) has a unit price of $2000/person/month, the rest of the positions are $1000 this is reasonable, but it is not clear whether the contribution time is full-time or working with a certain number of hours?. The team also identified risk and came up with a mitigation solution (Community gamers are used to using BNB as a transaction fee. It will be a bit difficult for them to get used to Cardano. I will make a tutorial video and mini-game (the reward is our in-game token) to encourage people to join the game on Cardano))", "q1r": 4, "q2": "The implementation roadmap is in 4 months and there are specific goals for each month, the Tokenomics release schedule is not yet specific. The proposal team also provides progress metrics (Number of alpha test participants/number of test net wallets participating / Community feedback on errors in alpha testing / Project progress updates and project information on ANN channels: Global: https://t.me/Metarrior_official - Vietnam: https://t.me/metarriorANNVietnam/ We will publish web link, the download link for PC and the mobile version of the alpha test and the main net version. These metrics are easy to measure, track and evaluate whether the project's progress is completed as planned. metric to determine project success (Successful launch of Metarrior game on Cardano (magnet) / 1,000 NFT items to be sold / 5,000 players in the first month after magnet launch / 3,000 players from the community our community will join Metarrior on Cardano / More gamers from Cardano will play Metarrior (drawing 2,000 players from Cardano to join Metarrior)). a supplemented ecosystem documentation and a clear, understandable description of the targeted issue.", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6133, "q0": "The problem that the author poses here is, the NFT game is one of the Dapps with the largest number of transactions on the blockchain today. Most of the NFT games and gamers are currently using EVM platforms like Binance Smart Chain or Ethereum. Very good proposal and perfectly suited to the challenge posed. Here the author is aiming to fund game projects using Blockchain technology. There's no denying that the way the game technology industry is extremely relevant and profitable in today's tech sector. The idea here is, The Team will bring a large number of NFT players from Binance Smart Chain, to Cardano using the METARRIOR game. The author has described it very specifically and richly. Metarrior is a Web3 game: integrating traditional games and NFT 2.0 technology, providing many opportunities for gamers. At the same time, players have the opportunity to earn in-game tokens and valuable rewards. I think this is in line with what is being worked on, because it will help the game in Cardano expand, expand the community, know about the NFT, especially the Cardano ecosystem. The author applies the Play and Earn model in the game, this model focuses on the player's experience while still earning money, helping to control the NFT token and inflation. Metarrior is a game under construction on BSC and will launch on Cardano to increase the number of games and players on Cardano. At the same time, migrated a lot of gamers from BSC to Cardano. Besides, the author realizes that the main risk in the project is that gamers have difficulty getting used to Cardano. With the challenge posed. The author provides the solution by creating many instructional videos and mini-games, making it easy for gamers to accept and join.", "q0r": 5, "q1": "The project team outlined a very clear and detailed plan for the project. Important milestones are set over 4 months. The group also provides specific and coherent assignments for the month, and is well explained. With the plan sheet provided, we know all that will be done and in what time period. Next is the budget. The proposal requires a budget of $80,000. This is a required budget range that is quite suitable for the time job, the schedule of the work has been set (accounting for nearly 20% of the total challenge budget). In addition, the funds allocated for each job are clearly explained, specifically: Game designer; Blockchain developers; Web developers, etc. (divided by money, person, month). Finally, the team of members of the group. First, the author introduced us to who they were. Next is an introduction to each member, and finally to the mentor members. We know about the identity, skills, experience of each member, suitable to perform the work in the project. At the same time, the author also provides attached links for us to understand more about: Using TrustKey, FIDO L2 biometric security key: this is a type of security key, protecting and avoiding many risks; and PadiTech and DareNFT. The overall plan shows the team's expertise, detailed roadmap, and transparent budget. In my opinion, the proposal is very feasible.", "q1r": 5, "q2": "The author of the proposal provides us with indicators to measure the progress and success of the project. Number of alpha test participants, and quantity: net wallet, number of newly connected wallets, community feedback, via mini game, telegram community. At the same time, progress will be updated on ANN channels: Global and Vietnam. etc. Because we have many ways to measure progress, we know what to expect, and how successful. , and the benefits it will bring to the community and the ecosystem. The project plan is clear, the budget is transparent and the team members are qualified and experienced to execute the project well and complete it on schedule. And regarding the end result, here the success indicators are established. Successfully launched Metarrior game on Cardano. INO and IDO Deployment Successfully; the BSC community will join Cardano through Metarrior.v.v. Overall, in my opinion, everything fits here. The team set up very well what we needed to achieve. Widespread Cardano adoption and Blockchain diffusion, fully meeting what is required in the challenge.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 2, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 6760, "q0": "This proposal is for a gaming project that originally was going to launch the Binance Smart Chain (BSC) but will instead launch on Cardano if they receive funding through Catalyst.  They claim they would help bring users to Cardano by launching on Cardano’s EVM, instead of BSC. Even though the goal of this challenge is to bring users and developers from Ethereum to Cardano, I think the goals of this proposal align with the challenge well enough considering BSC is a very popular EVM chain.  Based on the size of their telegram, the team seems to already have a decent following for the game, so it could bring many people that planned to play the game on BSC over to Cardano.\n\nAlso, the KPI’s provided in the proposal are relevant to the challenge's objective, like the number of unique players of this game that would’ve been on BSC but instead is on Cardano.", "q0r": 5, "q1": "There are many details provided about the 4 different companies that will be involved in the success of this proposal, with the main one being Bamisu Studio I believe.  The team claims to want to build on “Cardano’s EVM” but it is unclear what EVM they’re talking about.  The two possible chains they could be referring to are Milkomeda by dcSpark and sidechain Alpha by IOHK.  Then later in the proposal when answering “what success looks like for this project,” they answer that successfully launching on Cardano (mainnet) would be a success.  This is a bit conflicting and makes it difficult to judge the feasibility. However, it’s possible they just mean the mainnet version of whatever Cardano EVM sidechain they plan to launch on.\n\nIf the team is launching on a Cardano EVM sidechain, then it appears the team has a lot of experience developing on EVM chains and I believe it would be highly likely that they would be able to launch successfully.  However, if they are planning to launch on mainnet Cardano, I don’t see any evidence that the team has people who are experienced in developing on Cardano, which would make success a bit less likely I think.\n\nRegardless of all that, the proposal contains a very detailed breakdown of not only where the budget is planned to be spent, but also detailed information about each job within their studio, and what tasks they are in charge of.\n\nThere also is a clear 4 month roadmap with well defined milestones for each month.", "q1r": 4, "q2": "The 4 month roadmap containing well defined milestones helps the community know what to look for when tracking the progress of this proposal. Updates will be provided in their official telegram group that anyone is free to join.  I feel the KPI’s provided are a good measure of success as well.  These are metrics like the amount of people participating in the alpha test on their test server.", "q2r": 5, "assessor": "z_assessor_2826", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8916, "q0": "As gaming world is increasing day by day, kids these days love to play online games more than outdoor games , and most of the gamers have a better knowledge of crypto and catalyst projects , hence to bring the gamers from binance smart chain to cardano smart project is definitely a great idea to achieve, we can use these gamers to exchange coins using ADA where this will definitely boost increase usage of ADA hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer's team consist of people where they have developed games for nearly 15 years, and team also consist of nearly 20 members which is great, with this team provided creating game can be achieved without much difficulty provided.\nThe challenging task here is to attract the gamers to play \" METARRIOR\" because gamers won't change the game unless they find it interesting , the marketing strategy here plays a big role hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposer has provided us a demo video ,where we can check the team has built a game which has very good animations, and the game provided is of war game where it can attract most of the gamers.\nThe proposal even contains good scheme like \"Play and earn \" where it will attract most gamers to score more and play more, the presented plan has excellent timeline idea to complete the project,it has even excellent idea of introducing tokenomics to increase the ADA users hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 9353, "q0": "I see that your project is also not a new idea. The difference is that you build a \"Play and Earn\" game, not a \"Play to Earn\" game. With this idea, I think you will have to compete with the type of play to make money. Because many people like money and Because I see NFT games are getting more and more popular in today's market. Your model of playing and making money has the advantage that in addition to playing games for fun, you can also make money based on those blockchain games, but the quality is more focused on playing. Your IMPACT section has a video describing the game that I find quite attractive, the music and images in the game are also attractive. And the game uses Match-3 gameplay like Candy Crush Saga combined with strategic deck-building mechanics like AFK Arena, Idle Heroes, which I find quite interesting, causing an impression to video viewers like me.", "q0r": 5, "q1": "With this FEASIBILITY part of your group, I see that you have prepared very well. The plan gives details, including illustrations. The budget table is also complete, but the total amount should be included. About the members of your group, you should leave the information outside instead of aggregating many people into one photo. It's hard to follow because it's small. I see you have a large and experienced team. Hope this project will go well as planned.", "q1r": 4, "q2": "In my opinion, I find your proposal convincing because the progress of measuring and developing the project is still complete. You update the project progress and project information on ANN channels:\nGlobal: https://t.me/Metarrior_official\nVietnam: https://t.me/metarriorANNVietnam. In this section, I wanted to see how proponents would collect data on these metrics. What goals they intend to achieve and how they communicate that progress back to the Cardano community. Need specific numbers to prove. And you have met my thoughts and given specific goals in this section. (5,000 players in the first month after mainnet launch; 3,000 players from the community will join Metarrior on Cardano; attract 2,000 players from Cardano to join Metarrior). Having specific numbers like these will make it easier for everyone to track progress. I would like to believe that creating a game market not only comes to Cardano using METARRIOR games but also creates a good source of income for the players as well as the benefits of developing a better Cardano system.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14791, "q0": "What makes me feel most impressed and interesting about this proposal is the Play and Earn concept of the game Metarrior. Currently, most of the gamefi on the market usually only focus on the economic model in the game like Play to Earn. Just like the proposal's team mentioned in the proposal, Play to Earn only attracts people who want to make money in Gamefi, not those who want to experience the game.\nGamefi features in-game asset and trading improvements. But gamefi is still a game. The most important thing of a game is the game experience, not the money.\nThe concept of Play and Earn in this Metarrior game both showcases blockchain-based in-game finance but still focuses on real gamers. Game tokens will become rewards for those with good skills in the game. The rest of the players who do not have too good skills will experience the game as usual. This makes it possible for the game to develop long into the future without fear of token inflation and NFT inflation. I think today's gamefi should learn from this concept so as not to turn gamefi into a game just to make money\nOn blockchain platforms, NFT games are the dapps with the most participants. Not only that, transactions on NFT are also the most.\nTherefore, I think Metarrior migrate to Cardano is a great thing to increase the number of people from BSC to Cardano and the transactions on Cardano will also increase significantly.", "q0r": 5, "q1": "The number of developers of companies implementing this proposal is very large (more than 200 people). These are also companies that have had successful blockchain projects on other blockchain platforms (DareNFT, Trustkey). The game development team also has 15 years of experience in game development and publishing.\nBesides, the project also has experienced members in the core team and the project's advisors also have a lot of experience in the blockchain field.\nProposal also has very specific product development and marketing plans. I see that the proposal's team has prepared very carefully for the team's proposal implementation plans.\nProposal has also laid out the project's tokemnomic in a detailed and reasonable manner. The implementation of the game ecosystem of the project is also very clear.\nPartnering with gaming centers is also a very effective marketing method to reach out to traditional gamers to participate in NFT on Cardano.\nThe budget breakdown of the proposal is also very specific with the workload of each person in the team.", "q1r": 5, "q2": "The process of implementing this proposal month by month can be measured through alpha tests, mainnet game versions.\nThe marketing process of the project can also be measured through the posts on ANN and the project's community group (I checked through the project's communities and ANN channels. The ANN channel is updated daily. Community groups have a very good amount of interaction, it seems to be real people, not bots)\nThe team also implements INO and IDO with very clear goals, so the results of the proposal can be completely measured.\nBesides, measuring the number of new wallets created and participating in the game Metarrior is not difficult.\nTherefore, in my opinion, this proposal is completely auditable", "q2r": 5, "assessor": "z_assessor_4100", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14799, "q0": "- There are many NFT projects on EVM platforms on the market. NFT game is a project that best demonstrates NFT's applicability to real-life applications. So NFT projects often have a huge volume of NFT transactions on the marketplace. So an NFT game project from the EVM network like this when migrating to Cardano will bring a lot of users as well as NFT transaction volume to Cardano.\n- Proposal also offers a very sustainable economic model in the NFT game. NFT game is a traditional game that trades in-game items using blockchain. So the most important thing of the NFT game is still the player's experience, not \"Earn money\". If a game is too focused on helping gamers \"Earn\" too much, that game's tokens and NFTs are very susceptible to inflation. Game Metarrior has an economic model in the game \"Play and Earn\" that focuses on the player experience but still rewards good players which is a great model. It can still apply blockchain to the game but still ensure the user experience. With the economic model in this game Metarrior will not have problems with token inflation and NFT.\n- With the number of members in the project's communities around 20,000 members, the number of people participating in Cardano will be significantly increased when this project is migrated to Cardano. Cardano's NFT games, NFT items, and trading volume will also be increased.", "q0r": 5, "q1": "- The team has built a very complete and detailed graphic for the game (shown in the trailer). This proves that the team has done a part of the game, not in the research period.\n- The detailed plan of the proposal also showed a lot of information about the game such as NFT types of the game, the purpose of the MEWA coin, how to \"earn\" in the game, game ecosystem, marketing plan,.... The team has built very complete systems and economy models for the game. This greatly increases the probability of the proposal's success.\n- The project also has a very detailed token allocation plan in each phase and each part is very suitable\n- Budget breakdown of the proposal is also calculated in great detail. The job descriptions of each team member are listed in detail along with the costs for those jobs.\n- The team implementing this project is a combination of 4 companies, so it can guarantee the success of the project with a large number of experienced developers.\n- Information of core team members and advisors is also detailed in the proposal.", "q1r": 5, "q2": "- The test versions of the proposal are completely measurable by downloading the tests to your computer or phone to experience.\n- The updated information about the project implementation process is shared on the project's ANN channel (on the project's ANN channel there is always updated information daily) so we can completely measure the progress of the project. implementation and results of the proposal\n- Being able to measure community sentiment and feedback through minigames and survey forms is also a great way to know the success of a proposal.\n- Proposal also provides specific goals that the proposal can bring to Cardano such as the number of players from BSC joining Cardano through Metarrior, the number of people joining the game from Cardano,....", "q2r": 5, "assessor": "z_assessor_4101", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "We will bring a large number of NFT gamers from Binance Smart Chain (an EVM-powered blockchain with the large number of games and gamers on the market) to Cardano using game METARRIOR", "experience": "Bamisu Studio: 20 developers from a game studio with 15 years of experience in game making and game publishing\nDareNFT: NFT game marketplace for nearly 50 games on BSC\nTrustkey: Provide Blockchain Super Application, Blockchain Social Network, Secure Wallet, Crypto Asset Exchange"}