{"id": 420911, "author": "benzvibenjamin", "title": "Caricatures for Migration", "url": "https://cardano.ideascale.com/a/dtd/420911-48088", "category": 26593, "amount": 10500, "description": "We are missing some creative ways to reach out to the Ethereum community and onboard them to Cardano", "f6_no_assessments": 8, "f6_rating": 3.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 2940, "q0": "This is a great idea to connect  the community of EVM-based blockchain and Cardano community, a soft way to bridge Ethereum community. Caricatures are straightforward and funny, would be the best way to reach out a broader range of audience, therefore it has a huge potential to reach out people with  interesting stories, and education people why one should consider migrate to Cardano ecosystem. If we want to migrate more projects to Cardano, this should be the first step, always educate people and keep them informed. However, so many new born blockchain related terms are alien to everyday people, Caricatures would be a good direction to get it started.", "q0r": 4, "q1": "The team for this proposal already has cardano related art works presented on their website, and  it's legit enough to show that once they got the right ideas from community, they have the ability to make them real caricatures. Also the main team member Shlomo Cohen has great cartoons already public on the cartoonmovement website, therefore one should be confident about their delivery.", "q1r": 5, "q2": "In their proposal, the team listed few items like medium engagement(like, repost, etc.), weekly report, and 12 caricatures for each week, and townhall recording about the team reaching out Cardano community for pros of migration. I believe that these are solid points and straightforward items to asses and audit the proposal progress. Also the number of people engaged with their media channel would be a good point of view to see the success of the proposal.\n\nOne minor thing lacking in the proposal is that, I don't see how the team reaching out Ethereum community, as one needs to understand the drawbacks of EVM-based blockchain to make valid and precise caricatures, therefore both side of the community, EVM-based and Cardano should be reached out, and survey their own members' opinions.", "q2r": 4, "assessor": "z_assessor_2362", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4928, "q0": "This proposal is a creative, out-of-the-box approach to onboarding developers, building on past work already developed in the Cardano cartoon sphere. Although cartoons in and of themselves will not very likely sway developers with vested interests in other chains, they might well be an incentive for newly arrived developers in the blockchain sphere, piquing their curiosity and interest for Cardano and operating as a initial hook for them to engage with the Cardano community and eventually become part of the ecosystem.", "q0r": 4, "q1": "The proposers include hoskintoons.com main artist and co-founders of numerous Cardano projects such as Cardojo and Sustainable ADA, indicating a vested interest and proven track record within the Cardano community, with previously funded proposals also in Catalyst. As far as timeline and budget, the payment for a weekly cartoon during a 12-week period plus marketing and communication costs is easily verifiable and, coupled with past experience and work, gives certainty that the proposal will be implemented successfully.", "q1r": 5, "q2": "As the proposers explain, as a weekly cartoon delivery, this proposal is highly auditable for deliverables and KPIs. Such indicators include views on social media (likes, RT, impressions, engagements, profile visits), posts using the hashtag connected to the collection, the weekly cartoon shared in media, participation in after townhall sessions that are going to be recorded, and a final report and ppt that will provided to the community. For future iterations, perhaps a minimum threshold of quantifiable success metrics (ie aiming for minimum 500 retweets of each cartoon, 100 engagements, 1000 likes, etc., aiming specifically for twitter profiles of the Ethereum/EVM-compatible chain communities) would be interesting to compare success against.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5093, "q0": "This is a $10,500 proposal to design Caricatures in part brainstormed from After Town Hall meetings and publicize them for three months in an effort to draw folks from other EVM chains to Cardano. The concept is to put out weekly drawings  to reach out to the community to show the differences between Cardano and the others. The artist Shlomo is not just addressing the individuals but also the projects. His Success Statement demonstrates he is focusing on projects (one of the key targets of the Challenge) with- What does success look like? \"Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily\".\n------------------------------------------------\nAt first my impression was that the use of his Caricatures and public relations thrust would only reach out to individuals which is not what the Challenge is asking for. Doing some research and reading on the use of Caricatures in political campaigns and during wars (when typically, there are great migrations) I was impressed by how powerful a properly constructed public relation campaign can be. \n--------------------------------------------------\nAfter assessing this proposal for the potential Impact and whether it effectively addresses the challenge I rate this a 4 (agree) star for doing so.\n\n ", "q0r": 4, "q1": "The feasibility assessment for the quality of Shlomos art and the examples of his Caricatures was an easy proposition. Active in the Cardano Community with Cardano4Climate and Littlefish his NFT art and other Caricature examples in the proposal are well done.\n-------------------------------------------------\nThe budget is straightforward and well explained. $500 a week to design the proper Caricature for greatest effect, after a 40 year career as a political cartoonist in Israel seems to be a reasonable ask. The timetable is understandable and reasonable, Implementation plan and Public relations scope is reasonable.\n---------------------------------------------------My Assessment for the Feasibility of this proposal is a 5 (strongly agree it will be successfully implemented) star. ", "q1r": 5, "q2": "There are two metrics written in the Challenge brief: 1. Number of projects that migrate and, 2. Number of users of these smart contracts once migrated to the Cardano ecosystem. The proposal does have metrics such as impressions and social media stats, but does not address the two specific metrics in the Challenge. I do agree with the metrics listed but my assessment for the Auditability section is a 3 (I am neutral - neither agree or disagree with its milestones for identifiable measurements of success per the Challenge) star. ", "q2r": 3, "assessor": "z_assessor_2671", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5569, "q0": "The impact of this project is unclear, so I am not certain that it will align with the goals of this challenge. It is proposed to do a weekly caricature showing the advantages and relevance of Cardano over Ethereum, to reach the Ethereum community interestingly and creatively. Cardano already has a very strong content base and community that is constantly updating and sharing new content. To convey information through caricatures will not be easy for those who are not familiar with blockchain that will not attract many people, but the Ethereum community will need more information to highlight the advantages of Cardano. . what concepts, topics, or areas (basic, complex) will be featured in the cartoon other than the information provided by the proponent (topics may include gas fees, carbon emissions, the community has purpose and unit). I have not seen a proposal to provide script information to create 12 caricatures, this information is quite important to ensure that the issue to be conveyed is provided sequentially and coherently with the community, especially How creativity will be expressed (tools, images, or content).", "q0r": 2, "q1": "The roadmap is sketchy, the proposal heavily mentions collaborating with (Raz and Cole, two members of the Challenge team from the Film and Media Challenge (Fund 8) and part of ADA Sustainability, who will help We are in all areas of our proposed marketing and advertising.) but the work details do not specify how the partner will perform the work, I think you have had discussions. before submitting a proposal and great for adding an overall workflow. The content should fully express what will be done, and how to achieve the goals of the challenge. The script is an integral part of understanding the whole thing because through it the idea is to visualize the process, the filming plan includes what will be filmed, the shots, the locations, and the actors. , audiovisual experts, etc...). The proposed budget is broken down by the tasks to be done in 3 months, and some expenses need to be more detailed because I think it is not enough to do it (ex: Weekly Cartoon x 12 weeks x x) 500 USD = 6000 USD) as I mentioned above, when there is a clear script, it will know the tasks and human time needed to perform, then calculate the reasonable cost to create a quality cartoon. Costs (media communication, meetings, email, website) are general, but do not have complete information on how to organize, how many meetings, or how many documents are communicated ?. The highlight of the proposal is the information of 5 members with full information about the position of experience and expertise, with a link to an easily identifiable social networking site (Shlomo will be responsible for designing all the Razali caricatures. and Cole is responsible for marketing and advertising, Benjamin is in charge of the administrative work that needs to be done).", "q1r": 3, "q2": "Weekly publication of caricatures will be easy to check and review and the proponent provides metrics (social media views/posts/Weekly Cartoons will be shared) in the media / A final report and ppt will be provided to the community). Proposing it would be a lot easier to follow the project if it had a detailed schedule, the project's successful expectation is that outreach to the global Ethereum community will result in 10 seconds of interaction with associations and the Cardano community.", "q2r": 3, "assessor": "z_assessor_2714", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7498, "q0": "It is not the first time that I read and think about the projects of these proponents. My reviews are generally positive as I admire Shlomo Cohen's work.\n \nIn this particular case, I believe that the proposer finds a problem within our community in general: the lack of quality material that summarizes in an image important concepts of Cardano and its advantages over Ethereum. And finds a possible solution, or help: renting Shlomo Cohen's work with these topics in mind.\n \nAlthough I believe that the spirit of the text that sets out the requirements of the challenge seems to favor proposals oriented towards technical aspects over marketing, at no time is it explicit that this is the case. So the proposal seems to respond to the frameworks of the challenge.\n", "q0r": 4, "q1": "Again, this is the strongest category of these proposers. I believe without a doubt that they are a good team, capable of carrying out the tasks they set for themselves. This conclusion comes for the following reasons:\n \n-They make a clear time table in which you can see in a methodical and orderly way the steps to follow to start and finish the task.\n-They make a very detailed and quite reasonable budget for the realization of their project.\n-They present themselves as the ideal candidates for the development of the illustrations and attach links that prove it.\n \nI insist on a critique that I have already made before and that fits again in this proposal: It would be much more convincing for this type of project to present some scripts and not just general ideas for the illustrations.\n \nHowever, this particular critique is not enough to change my maximum score for this category.\n", "q1r": 5, "q2": "I think that the problem of not adjusting perfectly to the requirements of this challenge ends up harming the auditability of this project.\n \nBecause although materially it is easy to audit this project since the KPIs and milestones are clear: make one cartoon per week that the entire community can see shared on social networks...\n \nIt is not so easy to audit the success of this campaign. How would we truly know how many developers decided to transition from chains thanks to the reflections generated by the illustrations?\n \nThat is why I insist, since this is a challenge that seems more focused on the technical and not on marketing, it has additional problems that this proposal cannot answer.\n", "q2r": 3, "assessor": "z_assessor_2899", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10849, "q0": "Accessing and communicating the advantages of the Cardano blockchain to the Ethereum community is crucial to solving the challenge. Most people prefer to look at pictures over text. In addition to the media, caricature is one of the effective means of communication. A caricature is a specific form of information, expressing messages in the language of pictures. The graphic language shown in the caricature is crystallized into a symbol, making it easy for viewers to understand, remember and follow. I believe this proposal will be very interesting and bring a lot of value. ", "q0r": 5, "q1": "The information provided about the members is enough for us to know who they are, what their jobs are, and the experiences they have, especially the experience related to the Cardano ecosystem. Unfortunately, in the planning and budgeting section, it does not achieve that. All information is given in a basic way. We need to know the small activities to do in each plan content. As well as knowing the details of cost allocation. 1500 USD is used for Marketing & PR. So what marketing methods will be implemented? This section has many questions to answer. ", "q1r": 4, "q2": "The \"Auditability\" of the project is doable. I believe a project's progress be better measured if specific goals are set. The author will have a report and ppt will be made available to the community. It would be great if they provide a place where we can watch it. The success of the project should also be more visible. How many people in the Ethereum community will accept and want to participate in Cardano. ", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11519, "q0": "Proposal addresses main challenge problem by delivering caricatures comparing Cardano and Ethereum, focusing on Cardano superiority like fees, speed, and carbon emissions. The proposal doesn’t specify why there is need for additional caricatures, but since there are none on web for this topic, there is clearly need for artistic content like this supporting the great migration. Consulting ideas with community as described in proposal is good way how to handle caricatures content to become supporting for migration and not creating rivalry between blockchains. Tackling scalability and future sustainability via NFT is appropriate and might help so there is lower future funding demand.", "q0r": 5, "q1": "Proposal team is skilled and well fit for the work, as they already made some good caricatures for several Cardano topics, tasks are clearly defined and split among team members. Budget is broken into several items on week basis, detailed budget information is missing. Dividing some items to smaller parts would benefit budget evaluation, marketing and communication part is unclear how much is spent for human work and how much technical stuff like website build etc. Proposal doesn’t provide information on what media it will publish content. Challenges for proposal are considered and detailed information how to resolve them is provided.", "q1r": 4, "q2": "The proposal has set detailed roadmap and milestones and will be easily auditable by community. Main KPI is set to view on social media with estimated reach of 1 million impressions with using hashtag like #caricatorada is smartly chosen and nicely auditable, overview of this should be delivered in final report to community as proposed. This indirectly translates to new projects that migrate from Ethereum to Cardano and helps fulfill challenge goal.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14044, "q0": "Cardano has an academic approach which is a part of its documentation/marketing, this makes it difficult for people to understand the underlying tech. This has allowed malicious actors to spread misinformation creating a negative image of Cardano. Marketing should be simple and anyone should be able to understand the merits of Cardano which is inline with the vision by the proposer of creating content that can be easily digested and understood by end users. \n\nHowever, the current focus for the great migration would be on the developer and builders. Builders have a different appetite and consume more in-depth long form content. In order to convert them we would require more in-depth content - research pieces, analytics and code documentation. Caricature type content format would be more meaningful towards a general audience instead of projects and developers\n\nPolitical caricatures are entertaining and informative, and have been a part of print media for decades. Yet, they aren’t as popular in mainstream Social Media and there is not enough evidence presented to show that Caricatures will enjoy a strong response from the audience.\n\nThe proposal is built on the correct idea but to create more impact, it has two major things to reconsider:\n\n1. Target Audience\n2. Presenting evidence of popularity of Caricatures", "q0r": 3, "q1": "The artist has been creating caricatures for decades and have been a long time participant of the cardano community, their work on Cardano ecosystem has been ingenious. He has shown strong demonstrable skills as an artist and educator. \n\nHowever, creating content is one half, the second half is marketing and content distribution but not as a marketer. They have outlined working with other marketers but there isn’t a strong marketing plan that has been presented yet. The audience is the ethereum community, how does the team plan to specifically capture them is unclear\n\nThe budget has been split between artist payment, marketing and operations. The marketing budget of $125 per post seems to be on the lower end, which is inline with less focus on marketing. The sustainability of the project is also questionable, old content that hits the market will lose popularity and will no longer be useful, we would need to keep presenting new content for it to make an impact. This would require additional funding and their doesn’t seem a detailed plan to monetise", "q1r": 3, "q2": "I am confused on the goals of the campaign, it has to be either - Reach or Engagement. Reach is reaching out to users and spreading awareness, while engagement is reaching relevant users and getting them onboarded. The success of the project has been considered as individuals and projects migrating to Cardano, making engagement as the goal but the type of content and KPI (Post Views) are focusing on reaching the maximum users.\n\nFor social media content, you can track post views, likes or website visits but this doesn’t meaningfully tell you how many people converted to Cardano. The second big obstacle would be tracking if the audience is Ethereum based or cardano, it is highly possible to reach 1M views but it remains in the cardano community primarily instead of Ethereum.\n\nThe goal of the campaign has to be more clearly defined as spreading awareness or onboarding users to Cardano. If it’s the latter, we would need to track engagement based KPIs such as Likes, RT, website visits etc. The best course of action would to market it as reach based campaign and maximise reach, however that would not be in the scope of the Great Migration grant.\n\nThe project can be easily audited with key KPI numbers taken from twitter analytics or google analytics on a weekly basis, this can be presented with Benchmark numbers from other Cardano based projects.", "q2r": 2, "assessor": "z_assessor_3875", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A weekly caricature showing the advantages & relevancy of Cardano over Ethereum, to reach out the Ethereum community in a fun & creative way", "experience": "40 years of experience making daily political cartoons for newspapers, in the largest/most read newspaper in Israel (Israel Hayom) , won multiple awards, NFT designer\nFunded proposer for Fund 8 on similar proposals :\nCARICATOR ADA \nUnited Caricature"}