{"id": 422502, "author": "brittanneica", "title": "EVM DAO Integration", "url": "https://cardano.ideascale.com/a/dtd/422502-48088", "category": 26593, "amount": 95320, "description": "DAOs operating on the dozens of existing Ethereum Virtual Machine based networks, using Ethereum based tools, have no on ramp for their DAO to shift to the Cardano ecosystem.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1320, "q0": "The aim of the proposal is to develop a set of smart contracts focused on the governance need for DAOs. As right now, if a DAO would like to migrate from EVM to Cardano, they would need to develop their own smart contracts for activities and processes within dao – which are in general – proposing (working grups, norms and standards within DAO, projects), voting or staking. It is important to state, that the proposal is going to be open-sourced, which is increasing the outreach of its audience. In short, the aim is to develop set of tools which are currently not existing, do it open-sourced, and therefore induce the migration of EVM DAOs to Cardano, by offering these solutions. The catch phrase supporting the impact of this proposal could be “We are expanding the information architecture of DAOs beyond what is typical and ordinary.”, which I find very attractive. Regarding risks, the proposer state that the most anticipated risks will be the ones of technical character, and to tackle them they will be having a support of DoneCollectively technical staff. Nevertheless, DAOs are experiencing the downtrend (according to googletrends), thus additional risk might actually be the interest of these features.  ", "q0r": 5, "q1": "The roadmap is set till the end of January 2023, whilst milestones are as follows: end of July, end of October, end of December and the end of January. Each of these period are having the details of tasks and action items to be performed, and also the time dotation with the respective position (there are three positions – full stack blockchain engineer, advisors and project manager). The roadmap with the time schedule and budget preparation appears to be well thought and prepared in a detail, containing all the necessary information. The total budget requested is 95 320 USD, and the calculations are provided. I would say that the amounts are slightly stretched, and the source of the hourly wages was not disclosed, but it is not affecting the feasibility assessment. Regarding the team, we have the list of team members (5), with provided github profile and keybase profile. To evaluate developer skills, github are sufficient, but in respect to project manager or advisor, additional information would increase the confidence, where some previous jobs, or previous projects would be displayed.", "q1r": 5, "q2": "The problem of lacking governance smart contracts for EVM DAOs, and to implement them on Cardano is logical and clear. At the same time, the code will be open source, thus we can monitor and track the process of the development. The proposer also state, that it will be possible to track the process on the Done Collectively discord server, because they plan to post there reports. Regarding the success of the proposal, the proposer state that it will be able to verify via DAOs from other chains have on boarded done collectively and bridged/transferred their tokens into Milkomeda smart contracts. I think it requires more information how exactly we will be able to track and monitor these data e.g. number of discord members raised, or if we are able to see how many of these smart contracts were executed (so it means they are being used), volume of transacions etc. I am taking one star down because from the proposal it was not apparent how we will measure the success of the proposal. (how many users did you managed to migrate? How many DAOs migrated?)", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "thank you for taking the time to thoughtfully review"}, {"id": 5571, "q0": "The problem raised with this proposal is that DAOs that operate on dozens of existing Ethereum Virtual Machine-based networks, using Ethereum-based tools, have no ramp for their DAOs to migrate to the Cardano ecosystem. And the team proposes a solution to support DAOs on other EVM chains converting to Cardano and running on the Done Collectively platform, DAOs through our EVM-based DAO Management Contract on Milkomeda in Done Collectively will be able to use on-chain mechanisms along with in-app workflows for collaboration. This is a great idea and solution that fits this challenge, it provides a clear path for people to get comfortable with EVM blockchains working on Milkomeda, move their ETH/native currency into Milkomeda, and use them in the Done Collectively DAO management ecosystem. I believe it will attract the community of users and projects on Ethereum interested in joining the Cardano ecosystem.", "q0r": 5, "q1": "The proposed team provided a detailed plan, including progress and milestones, each of 2 months starting from June 2022 and ending in January 2023. Although the team just started fund 9 in June, the team has already done the first work on the project's plan (OpenZeppelin contracts are working on the Milkomeda testnet). The work contents of each milestone are very clear with detailed calculations of resources and construction time, which helps us to believe that the project will be implemented on schedule until 1-2023 (Contract contract). deployed on the Milkomeda manner). In terms of the suggested budget that provides hourly unit pricing information ($150 per hour for a full blockchain engineer / $120 per hour for a project manager), this cost is high compared to an average of $80/hour. $40k for smart contract testing (based on ~800 lines of code to test), this budget would be clearer if broken down and detailed. The group provides detailed information about the team members such as (identity, skills, expertise, and social networking links). The team also plans to continue participating in the fund later, if it is provided with some more information about the plan for the following fund, it will be great. The team also identifies the risk challenge and offers solutions to minimize the risk.", "q1r": 5, "q2": "As outlined in the previous section, the proposal provided a roadmap with clear milestones and 7-month timelines for achievement. Metrics are hard to measure but verifiable and controllable (progress reporting in public channels in the Complete Discord/measurement server sets an admin token to support recommendations of the Project and the Done Collectively/Workgroup/Done Collectively dashboard, showing the aggregate level of activities). The success of the project is very well defined (The Milkomeda-based DAO is running on EVM contracts, but value transactions using the wrapped ADA.)", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "thank you for your well-reasoned assessment and suggestions. "}, {"id": 6906, "q0": "I can feel this challenge is really interesting from me personally. As I'm technical guy with coding Hobby everyday. I can say this challenge is the most difficult part in technical side. WHY? because Integration part could create huge efforts to do. BUT proposer seems describing the solution is in a good way. I can say the research to get Integration working smoothly is the key to answer the challenge. And I see that the proposer and team doing it well. I hope this could be done smoothly with all supports proposer can get from this Project Catalysts. Please do remember Integration is the most difficult part in the technical side, because It's like marriage, you have to make agree and win in both side. Good Luck!", "q0r": 5, "q1": "As I mentioned in the assessment note for Addressing Solution for Challenge. I said the Integration is the most difficult part in the technical POV. This means that it's supposed to be doing some testing. So I can give you some suggestions here. please also considering SIT (System Integration Testing) intensively with whatever third parties you connected to. And there must be UAT (User Accepted Testing) after that to ensure that all data Mapping in both side can be synced and working correctly. Besides that SIT and UAT, I think the milestone of the plans are good to go. But since you'll bring Integration part, please consider SIT and UAT on your timeline / milestone. This could be helpful for the dev team before doing Production release. Again I'll say Good Luck with Integration guys!", "q1r": 4, "q2": "From the Auditability perspective, I could see some progress on Github. But again I'll raise what's important in the Integration side. you guys might be providing Sandbox account to do Integration with other parties. This could be very helpful when you have client / another party using your product. Besides when you have Sandbox and providing Sandbox account, 50% of work visibility revealed and some work progress can be simulated in the Sandbox. This would be promising for both Investor POV and Client POV. Hopefully this can improve this proposal into the next level.", "q2r": 4, "assessor": "z_assessor_2847", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "the suggestions are appreciated.  They are constructive in intent, and they at least sort-of provide rationale for deducting from full-ratings.  \n\nThe assessment can be improved by putting aside operational recommendations and focusing on presentation of the proposal.  "}, {"id": 7478, "q0": "This is an absolutely brilliant idea!! I love what you guys are setting out to do for the Cardano ecosystem. I think one of the biggest disconnects for most other blockchains onboarding to cardano is the fact that our code and smart contracts are so far off of what they are used to building in. That being said, we need projects like this to help bridge that gap. I would like to see those people you incentivize to migrate over to milkomedia eventually bridge the chain to Cardano main net dapps.", "q0r": 5, "q1": "Your team is absolutely impressive in scope and skills. I would like to see more people bridging from other EVM chains to cardano, and I feel like this would be a great approach to achieving that. DAO's seem to be an attractor for most hardcore enthusiasts, so I believe we can help facilitate adoption simply by creating a platform that helps streamline the onboarding process. I am a little worried that this will take a bit longer than estimated, but that seems to be the deal with almost anything on Cardano. I wish your team the best and hope you get the funding you deserve!", "q1r": 5, "q2": "It seems you have the technical side of this project proposal down to a T. I would like to see more social media engagement to help bring a wider awareness to the rest of the Cardano ecosystem. Twitter comes to mind when keeping people updated on your progress, and doing a youtube video of your team introducing themselves may make voters more comfortable giving you the thumbs up for funding. Having social media to engage the people that are not as tech savvy as the programmers will greatly help your auditability. I can foresee this project being extremely successful, but that won't matter very much if you can't get the exposure you need to have people use it! Bridges are one of the best points for attack in the blockchain space as a whole, so I would like to see your smart contracts audited and displayed for people to see in order to make sure that there is no way that user funds will get lost. Since bridges are so dangerous, it may drive people away from using this project altogether. So, having that transparency may help ease fears of any issues arising from using your bridge. Great job to your team!", "q2r": 4, "assessor": "z_assessor_2895", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for the effusive positive rating.\n\nAssessment can be improved in Auditability section by focusing on ack'ing that we have our proposed ways of sufficient transparency, and separating marketing suggestions (Twitter/Youtube - and thanks, by the way) to be constructive suggestions in Feasibility, instead. \n\nDitto security & smart-contract-auditing (check the proposal text; we include these considerations there).  It's easily to conflate project auditability (did the team do what was proposed) with the code being auditED.  Comes with the territory I guess : )\n\n"}, {"id": 7682, "q0": "This proposal effectively addresses this challenge by addressing a large sector of crypto users.  There are an estimated 4,200 DAOs on Ethereum and it's compatible blockchains consisting of tens of thousands of users.  \nThis team is proposing a comprehensive solution for migrating these DAOs to Cardano. This challenge references making it \"easy and fast\" to migrate from Ethereum to Cardano.  If implemented as described by the team, this project would accomplish both.  This proposal, successfully executed, would create a turn key solution for migrating DAOs to Cardano.\nWhile the impact of this proposal is implied, the team may be underselling the potential impact a platform like this may have on the Cardano ecosystem.  Cardano is positioned to be an industry leader in DAO adoption due to the tools that can be built and the low costs of using the blockchain.", "q0r": 5, "q1": "I acknowledge up front that I can not assess the technical portions of this proposal or forecast the difficulty of the coding. I did review the links provided to ensure the content is present, but am unable to speak for it's correctness. This team does have a track record of delivering on other projects and certainly have the resumes to suggest they are capable of accomplishing what they have described.  I appreciate that the team is well balanced in developers and experts in DAO construction.  I did review the bios of the team which demonstrated competence in software development and blockchain tech.  Considering the above information, I rated implementation as 5 stars.\nI also appreciated the detailed breakdown of the budget including the estimated number of hours required at every milestone.  The team, transparently, admitted that future funds may be required to refine this project.", "q1r": 5, "q2": "The open source nature of the project is a significant benefit to the Cardano community.  The team plans to post the code in their github repo and has clear timelines attached to each milestone. They will also post updates in their public Discord server.\nThe team also plans to create a dashboard to monitor the usage of the platform.  In this way, the team can objectively show some of the impact from this project.", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to evaluate this proposal. "}], "solution": "We are creating a set of governance smart contracts fitting Done Collectively's advanced organizational-manageability framework.", "experience": "Our team at Kodex Data Systems has over 25 years software development experience, original Cardano community members, and Ethereum developers."}