{"id": 422691, "author": "fakaza2018", "title": "Nodesound - Music On The Blockchain", "url": "https://cardano.ideascale.com/a/dtd/422691-48088", "category": 26593, "amount": 37600, "description": "Most songs go entirely unheard and sadly over 90% of music streams going to the top 1% of music creators who earn very little value from their creative work.", "f6_no_assessments": 6, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 521, "q0": "Love the idea! Catalyst and the Cardano community love the concept of using the blockchain bring innovation to the music industry. I know this because 141 music proposals have come through catalyst, including 51 in the current fund (according to lidonation catalyst research tool). 21 of these proposals have been funded! \n\nWhy 1 star? This proposal does nothing to speak toward the specific ask of the challenge and the impact funding will have on ethereum users. Some questions I would have love to see the proposal answer:\nIs Nodesound porting and EVM Dapp and token to Cardano? \nAre they bringing their users over? \nAre they migrating existing artist over? \nWhy is it better than soundcloud?\nHow will it impact the Ethereum community?", "q0r": 1, "q1": "The proposal description of the Nodesound Protocol is evident that the team have not consulted a Cardano developer or research the cardano architecture. \"Metadata: We will initially serve NFT metadata from our own API, as opposed to putting it on a permanent decentralized storage...\" this is NOT how metadata works on Cardano. They live on the cardano blockchain with the NFT. This is the only way \"Nodesound will be recognized on all open Cardano NFT marketplaces.\"   \n\nI am a developer in the Cardano ecosystem with two smart contracts and four fungible and non-fungible minting projects under my belt.... this proposal detailed plan read like something for another blockchain, not cardano.   \n\n\nThe proposal outlines no timeline or key milestone for delivery.\n\nI am 99.999% sure this proposal will not be deliverable as proposed--it is not feasible.", "q1r": 1, "q2": "Team plans to make \"weekly commits\" to their github repo to facilitate auditing but also states they plan to open source the project once it's completed. Does this mean the github repo will not be publicly accessible to start? How will the general cardano community be able to track work (including ones that are not developers and in with the github)? ", "q2r": 1, "assessor": "z_assessor_2098", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1880, "q0": "The proposer wants to solve the problem of musicians not getting their music to their listeners and not getting compensated fairly. They claim to have built something similar on Ethereum, and that the master contracts will be deployable on Cardano sidechain. No evidence of this product or these master contracts are provided. There are some good ideas here and it could have a good impact on Cardano if it is well received and adopted. There are a lot of musicians out there looking for a blockchain solution, so whoever creates a successful working platform for these musician will bring the masses, but they will have to know and trust this platform first. Which will not happen overnight and will need lots of marketing. So if successful this could bring many new users to Cardano, but this is no easy task. The KPIs of this project are more in line with a stand alone product than it is with the challenge's KPIs of migrating Eth projects to Cardano. If they showed their working Eth music platform and explained how they will integrate Cardano into this then it would have been better aligned with the challenge. They mention how artist's nfts won't get lost in a sea of nfts because it will be displayed as a distinct collection, but don't mention exactly how that will counter the problem of thousands of distinct collections, which makes their solution still not very scalable. Sure this can be solved later on, but it feels like this should be a priority and there should be mechanisms for connecting the right listeners to the right music.", "q0r": 3, "q1": "They provide a website mockup that resembles a standard NFT marketplace with the exception of a play button to listen to the music. The frontend skills used to develop this website is somewhat on par with the other Web 3.0 websites out there. Everything looks good except for the fonts. The fonts need some work. Just some advice from a fellow graphic designer/frontend developer. You need more than great frontend skills for a project like this though. They are only 2 people and only one of them is a full stack developer. There are no evidence provided of this full stack experience except the website. But this website is only a static website, so still no evidence of backend or Plutus skills. Or even Solidity skills as they have claimed to already have built that. It is important to provide evidence of the previous project they worked on or any evidence of the skills they need to complete this project in order to gain voter confidence. They have broken up the budget into three sections and provided the hours needed to complete each section. The sections are Frontend, Backend and Smart contracts. The rates and hours seem reasonable, they do mention that further funding will be required to bring Nodesound to market. They have one good idea that will drive user engagement with the songs. Basically owners of the NFTs can comment on timestamps and if they comment on the exact random generated timestamp the NFT will be minted as a 1/1 with the owner's details and some art chosen by the artist. They mention how the smart contracts will run on their own server and are linked to by the metadata on the NFTs, and that the creators of the NFTs will be the owners of these contracts. They also mention that all this could be improved in the future. Looking at the code for this website mockup, they used Swiperjs. I am not familiar with this framework, but it looks to be mobile friendly. They mention interoperability, but don't provide any information on how they want to achieve that. The only actionable tasks they mention is the same items as the budget breakdown items. Frontend, Backend and Smart contracts. This is a huge product and I think they will need more than one fullstack dev to bring this product to where they want it to be.", "q1r": 3, "q2": "There is no mention of a completion date, they just mention the total hours it will take to complete each task. It would show commitment and pre planning if they provided a roadmap of when they intend to complete certain tasks and a completion date of the whole project. There are 2 KPIs. The successful release of a proof of concept for the Nodesound NFT music protocol and onboarding 100 artists in a year. This seems achievable and reasonable. A project like this can have more KPIs to track success. They could have mentioned more user engagement metrics and sales numbers. The progress can be tracked by looking at the weekly commits they will make in GitHub when developing this project. It would have been great to already have a link to this GitHub repo and see some form of planning and dedication to this project.", "q2r": 3, "assessor": "z_assessor_2284", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3630, "q0": "\"Music on the blockchain\" just reading the topic is already exciting. The Cardano community will see an exodus of music lovers from around the world.\nProposal is a great idea for a challenge.\nAs far as I understand the proposed solution, the project \"allows creators to cast high-quality original song NFTs while retaining the real ownership and origin of their work\".\nThe project solution offers music development on the blockchain that will prevent music copying and plagiarism. Since each NFT is assigned a unique number, legal ownership is guaranteed\nIn my opinion, those who buy Song NFT are like us buying original music from the producer\nI think the potential risk is not being funded. Currently, the development of music on blockchain is still very new and needs to be tried by all communities.\nAbove all, I find this proposal ideal", "q0r": 5, "q1": "The suggested price is in the detailed hourly project budget, maybe because I'm not in the music world I haven't figured out the budget allocation details yet. Is the budget allocation for Song NFT minting and smart contract, about the backend I don't understand what it is.\nAs far as the blueprint is concerned, this is like an explanatory notepad for the creator, each song created, minted is a smart contract deployed.\nThe main team member mentioned as the author of the proposal is a technical person, music lover, development team and other members are not available.\nWith what you show in your proposal demonstrating an understanding of blockchain development on Cardano along with a passion for music I believe you will develop this project well.", "q1r": 5, "q2": "Open source projects are all public for the community to monitor and evaluate, and so is this project. Transparency will be verified by the figures explained in the weekly and monthly report.\nThere will be many artists participating and releasing their songs as NFT is the success of the project.\nI think this project opens up another way for artists to have an additional source of income as well as a source of creative inspiration that is not real.", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4809, "q0": "This is a great idea! The proposer points to the problem that most songs go entirely unheard and sadly over 90% of music streams going to the top 1% of music creators who earn very little value from their creative work and the proposer claims that Nodesound will usher in a new way of rewarding music creators for their work as we will give fans the ability to decide on what music is worth to them, in a fair, open and decentralized market. When reviewing this proposal, it is evident that this project is not on any blockchain platform, so it is not in align with challenge settings. It would be good if the proposer presented this project in Dapps, Product & Integrations. It would be great if the proposer presented how this project will add value to the Cadrano ecosystem. Unfortunately, KPIs were not presented and elaborated, so this project is not aligned with the outlined challenge settings and it is not able to scale to address future challenges.", "q0r": 3, "q1": "Links are presented from the website where we can view this project in progress, but we lack information about the team and the site itself does not work properly. There is also a link from LinkedIn through which the proposer introduces himself, but we cannot find information on whether the proposer has all the necessary knowledge and skills for the implementation and realization of this project. The budget is realistic and presented, but I would like to see who will work on this project. Unfortunately, no realistic time frame was specified within this project will come to life. It would be great to make a detailed work plan from which we would have clear information about what will be done and how. The proposer  states that the biggest challenge is raising funds to be able to develop a proof of concept of Cardano NFT music protocol. ", "q1r": 2, "q2": "For such an excellent project, I would like to see a super elaborated roadmap with milestones together with KPIs through which the community can follow the development of this project. And it would not be bad if the proposer connects with the Cardano community, where he will certainly get all the necessary information on how to raise funds for this project. ", "q2r": 2, "assessor": "z_assessor_2616", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5988, "q0": "I could not find any information on how the project was already developed or partly developed on the Ethereum blockchain if the project is a new project, I would advise writing the proposal in F9: Dapps, Products & Integrations. \n\nThere are millions of people that are users of music streaming platforms. The market is hard to enter, especially if there are no significant benefits in the new streaming service. The proposal aims to make it possible for music professionals to sell NFTs to loyal fans. This feature is not new anymore but adding the rights for commenting on the songs owned is an innovation (like, for example, on SoundCloud). \n \nAdding the feature to \"Featured Time\" an upgrade if the user comments on the song in a specific time frame will give the users more incentive to participate on the platform actively. \n\nIn the proposal, I'm missing information on how to attract artists to the platform and how you would reach out to them.", "q0r": 2, "q1": "The team is small (2 persons) and is maybe just enough to release a proof-of-concept successfully. Unfortunately, the resume of the second team member Joshua Nwankwo (full stack developer), is not linked. I would advise adding more information about this team member, like his Github profile. There is also a mention that this team member has written some Dapps in the past on Polygon. You could state the name of the Dapps as a reference to his work. \n\nYou must attract artists to your service for a project like this. Unfortunately, in the budget breakdown, no fund is reserved for marketing. Therefore, advertising will be crucial for promoting the platform in a competitive market. ", "q1r": 2, "q2": "Unfortunately, this will need more clarity. There is no deadline stated when describing the first of the project. I would advise making a roadmap for the project with sub-goals. The second goal, \"Onboarding Over 100 Artistes within first year of launch and also helping them release their songs as NFTs\", can be measured and is a good goal. \nThere could be more KPIs added, like the number of songs available or the number of users on the platform.\n\nThe commitment to provide weekly updates on the Github repo is adequate and would be a good way for the community to audit the project. ", "q2r": 2, "assessor": "z_assessor_2767", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12729, "q0": "Nodesound's stated problem and solutions are relevant to the Challenge Topic of \"The Greate Migration (from Ethereum). By facilitating a specific group of users (in this case: music creators and consumers), the Team can attract these users to the Cardano Eco-system and Community and persuade them to leave Ethereum for Cardano.\nI find Nodesound is both inspiring to the music-consuming community and beneficial to Cardano Eco-system. If the Team's solutions can be implemented successfully, music creators will be paid with the monetary reward that they deserve, and music consumers will be exposed to greater musical availabilities and be able to reward the right music creators for their works.\nThese happenings would lead to an increase in usage of the Cardano Eco-system, increased number of users, and increased number of transactions, hence bringing a better reputation and benefits to Cardano.\n\nSince music is a product that is easily transferred and enjoyed by everyone with the internet, the scalability of this solution is endless. This solution, when it is implemented on Cardano Eco-system, can be expanded to so many countries without facing physical boundaries.\nFor the above-mentioned reasons, I give the Proposal a 4/5 score for Impact.", "q0r": 4, "q1": "The Team has presented their proposed solutions in good detail in terms of needed items and budgets. The way they carefully structured their points and explained devotedly their solutions makes me believe in the possibility of success for this Project.\nWhile the Team has provided a very inspiring solution to the problem, I find the solution lacks concrete sources of quoted numbers and materials. How do they know that \"over 90% of music streams going to the top 1% of music creators\"?\nIt also lacks measurable KPI items or a detailed timeline with important milestones to keep track of progress. Yes, we are aware of \"must-do\" items, but when will each phase/stage/part of the products will be completed? In addition, it would be better if the Team can present their Budget in a more professional, following better accounting standards with sums of each part and the total sum for readers to follow more easily.\n\nThe team is experienced in developing similar products (which is shown on their website), and their expertise is showcased via this Proposal. The exact names of Team members are given with the LinkedIn account, even though not complete, which gives the Project more creditability. However, it would be more assuring to Cardano investors to trust in the possibility of success for this Project if there are a few more experienced members to be included in the Team.\nAll in all, I believe in the Team's ability to complete this Project successfully. However, they could have put more effort into their Proposal with better explanations and details on the Team, their Budget, and timelines. For these reasons, I give this Proposal a 3/5 score for Feasibility.", "q1r": 3, "q2": "Project workload is provided into hourly units, which shows the Team's thorough understanding of their work. However, a general road map/timeline with detailed milestones is not provided, which makes it hard for the audience to assess the feasibility of this Project.\n\nWhile the requested fund is substantial at USD 37,600, the Team only provides one means of reporting which is \"a weekly commit on GitHub\", and no additional information on any potential auditing party.  This information is needed for investors to control Project's costs in certain ways and have more confidence in funding the Project.\nI however compliment the Team on the detailed proposed solutions and trust in Team members' expertise to execute this Project.\nFor the above-mentioned reasons, I give the Team a 3/5 for Auditability.", "q2r": 3, "assessor": "z_assessor_3470", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Nodesound will usher in a new way of rewarding music creators for their work as we will give fans the ability to decide on what music is worth to them, in a fair, open and decentralized market.", "experience": "Our Development team has built similar platform on an EVM blockchain, the founding team also has years of experience in the creative music industry."}