{"id": 398460, "author": "cdfarcas", "title": "Cardano Blockchain Insights update", "url": "https://cardano.ideascale.com/a/dtd/398460-48088", "category": 26441, "amount": 80000, "description": "The Cardano blockchain raw data is not suited to be directly consumed/understood by its users (ex: developers, investors).", "funded": 1, "upvotes": 31978182, "downvotes": 17391796, "votes_result": 14586386, "votes_cast": 119, "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 975, "q0": "The proposal clearly identifies a problem to be solved (that Cardano blockchain raw data is not user-friendly to the layman), and not only proposes a way to address this, but has already built a large amount of it.  A hub for information and graphs for investors, monitoring the blockchain, and making educational content for the community is welcome and has already been providing great value.  Multiple articles have already referenced the Cardano Blockchain Insights, but the team wishes to continue updating the provided information as Cardano is growing so quickly with recent updates.  KPIs for the proposal are unclear as they are not clearly labeled as such, though KPIs are mentioned in the website goals.  It appears the \"3 Main Values\" may represent the KPIs?  Maybe the \"what does success for this project look like\"?  Either way, this proposal's generalized goals show proof that updating Cardano Blockchain Insights will bring even more value to the Cardano ecosystem.  4 out of 5.", "q0r": 4, "q1": "The team of 2 has already built the foundation and a functional informative tool, and their qualifications are aligned with the skills necessary to continue and advance this work.  They have a history of meeting challenges in programming and data engineering and have preemptive plans to scale this tool to cover the projected advancements that will be made in the ecosystem.  Team has provided a roadmap on a monthly basis with a reasonable timetable and lays out the required resources, but the budget is brief and not entirely clear.  The 1104 hours is being asked for to compensate hours that have already been completed, but where did the 378 hours come from?  I would like to see a further breakdown.  As for scalability problems, the team states they are researching solutions, but solutions are vague.  Rated 4 out of 5.", "q1r": 4, "q2": "Roadmap is presented on a monthly basis, includes adding new metrics through which to improve monitoring of the blockchain.  KPIs are not clearly named, but the \"3 Main Values\" give information about goals of the project and there are specific, measurable outcomes listed in the \"What does success for this project look like?\" portion.  Given that most of the project is already complete and available for use currently, rated 4 out of 5.", "q2r": 4, "assessor": "z_assessor_1250", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1017, "q0": "The proposal helps solve a new problem in the challenge. It is to provide more information to help investors and programmers track the development of Cardano on-chain. This helps quite a bit in strengthening the confidence of investors and programmers who are new to Cardano. It will help Cardano get more users and new developers", "q0r": 4, "q1": "They have made a specific and valuable product. Now they just need to upgrade it to be better. I evaluate with the expertise they have presented such as: data engineering, data retrieval. I believe their proposed implementation of this is feasible. I am only concerned about their content creation. It will be challenging to produce a quality innovative product because they are professionals with no experience in the content creation industry.", "q1r": 4, "q2": "The budget analysis lacks details about the expenses to be performed. For example, the development fund includes what to develop, how long, how long to create content on what topic. Everything lacks clarity. Maybe they don't have a specific and detailed plan, so they just outlined a general number.", "q2r": 3, "assessor": "z_assessor_1253", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2682, "q0": "The proposal aims to build a platform to provide decision-making tools for research/investor analysis, monitor the state of the blockchain, and create educational content for the community. For this purpose, I find the proposal more suitable for Dapp and Integration challenge.\n\nThere's no doubt that Cardano Blockchain Insights will make a huge impact on the community with its information organized and easy to understand for users. Moreover, it also helps users see useful and meaningful information. From this information, users from the community will make the right decisions.\n\nwith the advice of moving the project to the right challenge, I give it 4 stars for impact.", "q0r": 4, "q1": "The proposal lasted for 6 months, divided into 3 phases: the first 2 months they focused on collecting and ensuring the accuracy of data, as well as scalability when the number of users increases. Committed features will be implemented in the 3rd to 6th month. I think 06 months is enough to complete the project. However, I hope the team should have more clearly described the \"Data for research/investor analysis\" content at this stage, but it is not. Only \"Monitor the state of the blockchain\" and \"Creating educational content for the community\" information are mentioned in \"Month 3 to 6\".\n\nThe team has 2 people: Mateusz and Andre. The information from the proposal mentions that they started the Cardano Fans Stake Pool (CRFA). Proposer does not provide additional evidence (website, linkedin, ref....) for the community to check.\n\nThe project proposes to fund $80,000 for 02 items:\n- 54 USD * 1104 hours : to create content and make it visible on the site\n- 54 USD * 378 hours represent future tasks\nThis number of hours needs to be broken down to make it more convincing and transparent for the community to do the assessment later. I believe the proposer will provide detailed explanations in the next round.\n\nWith the above arguments, I give 4 stars about the feasibility of the proposal\n", "q1r": 4, "q2": "Proposer mentioned they will monitor the daily site visits by setting a target of 450 visits/day and release\na monthly evaluation of the number of times Cardano Insights data is referenced without mentioning a specific roadmap or time horizon for achievement. I think the proposer does not provide enough information to test the success of the proposal or the community doesn't know what to expect from the proposer upfront.\nI would like to see the KPIs/Metrics related to the 03 main values that the project has committed to be reported according to the specific roadmap.\nI give 2 stars", "q2r": 2, "assessor": "z_assessor_1549", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6511, "q0": "The problem statement and solution described make sense. Blockchain analytics data at first does not seem to be a flashy topic, but it is important information that helps the community as a whole to understand the performance of a blockchain in a digestible way by collecting and filtering data from the blockchain and presenting that data in charts, numbers and intuitive information. This proposal has a very specific concept and it doesn't seem to me that it would fit into any other challenge, so this challenge is appropriate.\n\nThis is a proposal that addresses an ongoing project that has already shown positive and relevant results for the community. The data presented through charts allow the community to have insights related to investment, security and governance, topics that end up being interconnected. e.g. The Nakamoto Coefficient shows us the level of centralization in the production of blocks by indicating the market share of SPOs (stake pool operators), this type of information brings insights into security (indicates the risk of an attack 51%) and also helps the community to make governance decisions to solve possible problems observed. The market value of a cryptocurrency also depends on its security and ability to promote critical updates, so these insights turn out to be extremely useful.\n\nBitcoin for example has several companies and individuals working on creating analytics, such as Messari, Glassnode, Arcane Research, among others. I believe that with the arrival of smart contracts and dapps on Cardano, the consumption of analytics should increase and Cardano blockchain insights is already helping to fill this space.\n\nI would like to see more metrics/KPIs that allow more tangible evaluation of the proposal's impact potential. The only data established as a tangible KPI was the daily site visits target of 450 visits/day, which seems to me a reasonable number, but could easily be gamified (I believe in the good reputation of the team and the diverse works and services presented by the team of CRFA in the community is a result of this, but establishing only one KPI that can be gamified is a negative point).\n\nDespite the problem mentioned above it is clear that the team has delivered results and demonstrated relevant impact, in addition the team plans to deliver new metrics and documentation to Cardano Blockchain Insights.", "q0r": 4, "q1": "The team described relevant and appropriate experiences to implement the proposal. Cardano Blockchain Insights has been creating analytics for several months now and sharing this data publicly with the community. The data/insights/analytics created by the team has already been used by companies and the community, so this is a good indication that the team and the proposal are viable.\nA link to the repository (Github) was added, where it is possible to verify part of the work developed and a link to the Cardano Blockchain Insights website, where it is possible to check various charts and data about the Cardano blockchain.\n\nI would only recommend including more data about team members (link to check expertise/repos/Linkedin) in order to increase transparency, but I consider the information presented to be satisfactory.\n\nThe budget presented was established based on 1482 hours of work, but as there is no good description of the sprints/stages of the roadmap by hours, it is difficult to assess the reasonableness of the budget in relation to the work performed, I would recommend going into more detail on this aspect.\n\nIt is also important to indicate that this proposal is asking for a retroactive budget (about 75% of the total budget), there is no information that limits this practice in the Catalyst guidelines and this information has no weight in this evaluation, but I believe it is important that voters are aware.\n\nThe hourly work rate ($54/h) established is reasonable.\n\nThere is a reasonable and realistic timeline for the development of the proposal presented. The roadmap presents the objectives/deliverables to be developed. Risks related to data storage/scalability were considered, but the team has already mentioned potential solutions.", "q1r": 4, "q2": "There is clarity in the description of the problem and the solution presented.\n\nThere is a roadmap with deliverables/goals, but I believe it could be better detailed and with clearer milestones.\n\nThe fact that Cardano Blockchain Insights is an open project and regularly shares data with the community facilitates assessment/audit, but there are few metrics/KPIs with targets for auditability assessment, I would recommend including more items in this regard.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A tool to help users understand the blockchain by exposing its network effects, feeding investor analysis, and serving educational content.", "experience": "Our team is deeply involved in the daily “life” of Cardano, long time SPO’s with CRFA pool and with strong experience in Backend Development and Data Engineering."}