{"id": 399279, "author": "milan", "title": "Project Management - Cardano Cube", "url": "https://cardano.ideascale.com/a/dtd/399279-48088", "category": 26441, "amount": 9200, "description": "Projects can currently list their project, but can't use Cardano Cube as a medium to communicate events, project updates, development phase.", "funded": 1, "upvotes": 28413014, "downvotes": 15899086, "votes_result": 12513928, "votes_cast": 83, "f6_no_assessments": 7, "f6_rating": 2.9047619047619047, "videos": [], "media": [], "f6_assessments": [{"id": 290, "q0": "I agree that this proposal effectively addresses the challenge. Like with all types of information, Cardano Cube projects should and have to have the possibility of updating their titles, their explanations, their schedule, their team members, every information concerning the project so they will be able to attract more attention of people interested in the subject. \nAlthough I agree with this proposal, the author did not mention any mitigation action to the mapped risk. Therefore, I strongly recommend him/her to meet with the project group and do some brainstorming sessions to find strong actions to mitigate or eliminate this risk.", "q0r": 4, "q1": "Time feasibility: The author does not present any detailed plan or a timeline for this proposal. He only focuses on when he believes that it will be concluded. Therefore I recommend revising the time feasibility part of the proposal including the timeline and detailed plan.\n\nCost feasibility: the cost should have one more level of structure and references of how he came up with the prices.\n\nTeam: the author does not provide proper information of the team members just mention someone's name but it is not clear who he is and how he/she can contribute to the project.", "q1r": 1, "q2": "In my opinion, for every project, there is a way of measuring progress even using just milestones achievement. The author does not provide information on how he would be able to be audited.  Therefore, I recommend him/her to receive this session of the proposal trying to align it with the timeline that he may present on the previous session. ", "q2r": 1, "assessor": "z_assessor_1136", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 436, "q0": "Cardanocube.io is already a directory of projects of the Cardano ecosystem with many users accessing and I am one of them. Over time many projects have had new updates, but on Cardanocube.io is still the same old content. Projects that have been posted here, if you want to modify and update the content, you must contact the admin, so it is very difficult. This proposal is to extend the functionality to an active website. When this feature is implemented, the project owner can actively update the content, thereby helping users quickly see the latest information of the project. In my opinion, this proposal is essential for the overall development of the Cardano ecosystem.", "q0r": 5, "q1": "To export this to add new features to an active website, I think there are mainly 2 issues that are technical and connected with the project owner that need to be discussed:\nTechnically: Cardano Cube is built with Webflow, this is an online toolkit for building websites, this tool has built-in user management CMS, powerful content management and many of the latest technologies available today. . When opening the Project Management feature, the proponent only needs to integrate the 'Membership and user login' utility (Ex: Magic, Pico, MemberStack…) which are available on Webflow marketplace at the following link: https://university.webflow.com/integrations-type/memberships. With the experience of this project proponent, within 24h, he can open this feature. I find this proposal technically feasible.\nAbout connecting with the project owner: I find this to be the hardest part that the proponent will face, he does it all alone, it will be challenging to connect with the project owner, which requires It takes a lot of time, requires patience, dedication. Objectively, not all project owners are willing to take the time to update projects on Cardanocube.io; not all project owners can connect... the proponent does not have a solution to the problem.", "q1r": 4, "q2": "As mentioned above, Cardano Cube is a project directory website built on Webflow, so the feature expansion will be done quickly, but the new features of the website can still run on the existing infrastructure. The proponent stated the cost of the account management infrastructure: $4,800, which is an unreasonable budget proposal. Regarding the cost of designing an account management environment: $2,400, this is also an unreasonable proposal. This feature just needs to integrate the extension from Webflow's available resources at a much cheaper price. The progress of the project according to the proponent will be difficult to track, this is a preparation that is not really thorough, because the website is always online, users accessing the website must know which projects have been updated, which projects not updated", "q2r": 2, "assessor": "z_assessor_1151", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 832, "q0": "I strongly support new ideas aimed at providing tools to explore and discover elements of the Cardano ecosystem.  While I think this proposal may be appropriate in different challenges for F8, I don't disagree that Miscellaneous is appropriate, so I didn't downgrade my support for the project location.", "q0r": 5, "q1": "While the proposal timeline and budget details are quite limited, the targets are clear as they relate to the progress which has been made to date, and is transparently available on the existing website provided.  My personal experiences developing the features mentioned in this proposal also indicate that the budget vs impact is right on target, and I have a developed understanding of the complexity to implement those features.", "q1r": 5, "q2": "The author is correct that it will be difficult to audit this project, other than usability and content related tracking.  I agree with that difficulty and therefore did not strongly support the metric of auditability for this proposal, but I do positively support that both quantitative and quanlitative metrics will exist.", "q2r": 4, "assessor": "z_assessor_1224", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1869, "q0": "This is a proposal regarding the expansion of functionality of the https://www.cardanocube.io website. The proposer wants to provide to the projects presented in the site the ability to change the project information when they see fit. For this extended functionality the proposer seeks funding.\nThe website in question is one of the popular places where one can find information about the projects developing on the Cardano blockchain. \nI strongly agree that in fund 8 there is no better challenge to host this proposal than the miscellaneous challenge.\n", "q0r": 5, "q1": "There is no plan, roadmap or timeline presented. The project just states that the functionality will be finished in Q2 2022.\nThe project has a detailed budget breakdown. The hourly rate is $50. Most of the work is software development.\nThe proposer outlines a risk but does not provide a solution that will mitigate the risk.\nThe proposer does not present himself. Just says his name is Milan and he is going to develop the project. I personally don’t know if Milan is the owner or creator of the cardano cube website, I went to the website to look for proof, the owners of the website are not presented. \nSo in conclusion I could not pure heartedly say this project is going to be implemented, not because I don’t believe in the project, it makes all the sense in the world for cardano cube to want to make this, but I could not prove the connection between the cardanocube and the proposer. \nI strongly disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 1, "q2": "The proposer states that “The progress of this project development will be hard to track.” And that is all he has to say about auditability. The success is measured by increased relevance of content on the site and project owners ease for making changes to their projects. \nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2027, "q0": "I am a regular user of Cardano Cube to find new projects building on Cardano and I would love to see some upgrades to the platform. I think that this proposal has a lot of potential given the amount of people that like to research more about the defi industry by using Cardano Cube. I think that allowing the teams to update information on their page on Cardano Cube could help get the community involved and allow more projects to have a fair chance in getting the publicity they may need to be a successful project.", "q0r": 4, "q1": "I'm not going to say I disagree with this. However, there are a lot of information that the writer of this proposal could include. In order to gain a higher rating and recognition in the funding process, you should give more information about the team that will be working on this and focus on the experience. There was a brief description of the experience that Milan has, but the fund would like to see more information to provide validity to this proposal.", "q1r": 3, "q2": "Similar to the last section, there is not enough information about the roadmap/process of developing this upgrade on Cardano Cube. I am also unaware if Milan works for the Cardano Cube team or not. If not, he would have to reach out to them and get the \"green light.\" I would be more descriptive of the roadmap and what challenges you face. Also, you could try and include more information where it asks for measuring the progress. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5891, "q0": "Personalizing projects information is very imporant to better communicate developments and to have a consolidated view on the portfolio. Therefore, I agree that adding this features are important. I also think it makes sense to be inside miscellaneous challenge, as it doesnt fit any other.  Furthermore, it does solve a problem in Cardano cube so it's ok to be placed here.\n\nAs suggestions, it would be imporant to bring here the source from the information \"Cardano Cube is currently the most used Ecosystem Directory in the Cardano space\" and some numbers on the website (as for instance, number of accesesses). This would help to better evaluate the impact of this iniative on the community (the more people who use it, the greater the impact).\n\n\nRegarding the risk strategy, one was identified but no mitigation strategy was provided. it should say here how prosposer intend to overcome this challenge.", "q0r": 4, "q1": "There's no roadmap, it just says when the project will be concluded. It would be very imporant to see the steps for it to be concluded, in a time-framed manner, with the acitivties of each period of time. Without this, it is hard to know how the solution will be developed.\n\nBudget breakdown is better done, broken down by type of acitivites with the number of hours listed (and the hour cost). It helps to give transparency and the roadmap should follow similar approach.\n\nAs for the team, no qualification, experience, competency or background of proposer is provided, it just says that everything will be done by him. Without know this information, its hard to say if this project will be feasible or not. At least a linkedin link could be provided.", "q1r": 2, "q2": "There's no kpi or milestone that allows to audit project progress or success. it just says \"The progress of this project development will be hard to track.\" which lacks of complete transparency.\nSome milestones throughout development should be provided, as for instance, when propsoer intends to finish the development the account management infrastructure.\nKPIs could also be provided to evaluate if the implementation was well done. Some examples would be the number of projects that had their owners migrated, the feedback from the users (could use a NPS to measure satisfaction). \n\nDefinition of success is also a bit subvective when it says \"We will see an increase in relevance of the content that's living on Cardano Cube\". How to measure relevance here? ", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8151, "q0": "At first glance, this proposal and issue statement seems a bit fuzzy in its information, the problem is that existing projects can list their projects, but can't use the Cardano Cube as a vehicle to communicate events, project updates, development stages. The solution was to make Cardano Cube projects editable in their project details. This way, the information on the project page is more relevant. Fortunately, the website https://www.cardanocube.io/ is recommended so that we can better understand how it works and better understand your solution. I think the author's idea is good, but it doesn't fit the content of this challenge. Perhaps the \"DApps and Integrations\" challenge would be a better fit for this recommendation.\nThe proposal also outlines the biggest challenges and risks involved in implementing the project, however, I have not seen his solutions to these challenges. The presentation of risks and solutions will provide the community with a multi-dimensional view of the impact of the proposal on the challenge, as well as the author's problem-solving ability to determine success. of project. I'm sorry to say that while this is a good idea, I don't think it's a good proposition that can address this challenge.", "q0r": 2, "q1": "This proposal looks more like a blueprint than a complete proposal, so it is difficult to track the progress of the project. The proposal does not provide a clear plan and timeline for a solution. The only thing that has been promised is that these features will be available in Q2 2022, with no timeline tied to specific goals. The required budget is $9,200 to pay for: Designing the account management environment, developing the account management infrastructure, connecting existing projects to their owners. I agree the requested budget is reasonable, the author has explained exactly what the requested amount will be used for.\nRegarding the project team, all that is provided about the implementation team is \"Design, development and everything else done by Milan\" and you say you are a professional UX/UI designer with 10+ years of experience and more than 5 years of experience in the crypto space but do not attach any documents to verify your competence and experience. I think it is necessary to provide references or links because it will help the community better understand you as well as have a basis to believe that you are qualified to do the project or not.", "q1r": 2, "q2": "No information has been released to confirm the author's ability to execute the project or the timeframe required to implement the proposal, but I agree that the budget is reasonable to achieve the stated goal. The proposal lacks a roadmap, any mention of milestones, metrics or KPIs. To improve listening, proponents should include a roadmap, milestones, development roadmap, key dates, metrics, and KPIs. The proposal describes the successful outcome of the project, however, as mentioned, due to the lack of information, it will be difficult for the community to assess the progress and success of this proposal.\nPlease provide information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new project? This is a new proposal.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Make it possible for projects on Cardano Cube to edit their own project details. This way info on the project page gets more relevant.", "experience": "A professional UX/UI designer with over 10 years of experience and 5+ years of experience in Cryptocurrency."}