{"id": 399258, "author": "milan", "title": "Educational Platform - Cardano Cube", "url": "https://cardano.ideascale.com/a/dtd/399258-48088", "category": 26441, "amount": 5200, "description": "Many people are still unfamiliar with Cardano. We want to use the reach of Cardano Cube to educate people and increase mainstream adoption.", "funded": 2, "upvotes": 26296678, "downvotes": 12287768, "votes_result": 14008910, "votes_cast": 83, "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 434, "q0": "The number of development projects on the Cardano blockchain is increasing; there are currently hundreds of dApps running on the main chain, which contributes to Cardano becoming one of the most active blockchains today. As the number of users increases, it is necessary to educate users about Cardano knowledge. Cardanocube.io is a project directory of the Cardano ecosystem, it has a large number of visitors, but not everyone understands Cardano deeply. Therefore, when this proposal is completed, it will be an educational channel for a large number of users to properly understand and deeply understand Cardano in a mainstream way. The recommender's ability to optimize SEO will attract more new users to Cardano, as evidenced by the nearly 800,000 monthly Cardanocube.io visitors and growing numbers. Therefore, it is absolutely necessary to have an additional Cardano blockchain knowledge education platform.  I give 5 points.", "q0r": 5, "q1": "The proponent has many years of experience in building professional UX/UI websites, the ability is proven by the Cardanocube.io website platform being used by many people, I am also one of these people who often visit to find information. This proposal is to expand Cardanocube.io to include more categories for content, knowledge videos about Cardano. Technically I see the Educational Platform as a news website, so it can be done quickly and best by proponents. Cardano's educational content will be a challenge, but the proponent has over 5 years of experience in the crypto space, I believe he can write educational content based on his self-taught knowledge. In addition, the proponent also has a plan to get information from other sources, by cooperating with many partners and content providers. However, I have not been able to check which partners or content providers he cooperates with; this is a minus point. I give 4 points.", "q1r": 4, "q2": "If this proposal is completed, Cardanocube.io will be a library of Cardano blockchain knowledge, which will help educate the large number of users who are accessing this website. Not only that, the educational content here with good SEO will pull new users to the website, which can be verified by a number of traffic measurement tools available on the market such as: Ahrefs.com; Semrush.com; Similarweb.com… Regarding the budget of this proposal, the proponent has also clearly divided each item, in which the budget allocation for the 2 parts of feature development and content writing is the highest. These are the 2 most important components of this proposal, I think the budget proposal is perfectly reasonable. I give 5 points.", "q2r": 5, "assessor": "z_assessor_1151", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1867, "q0": "This is a proposal aims to extend the Cardano Cube website with an additional educational section. https://www.cardanocube.io is a very popular site in the community and has a very good UX and designs. One could imagine that an educational platform for cardano build by the same people/person will be with the same UX and clear and understandable structure as the website. Well organized educational system and materials for the newcomers to Cardano is extremely important for attracting new users. \nThe proposal could have been placed in the new members on boarding challenge if it is more focused to the Project Catalyst new members, but the proposer does not state that, and that implies more broad educational material. Therefore I strongly agree that this proposal effectively addresses the challenge and there is no other challenge in this fund that can host this challenge better.\n", "q0r": 5, "q1": "The proposer does not provide any details on the project and has only 2 points. Q2 deliver technical implementation on the site, that includes the educational layer and Q4 scale up with more content.\nUnfortunately this lack of detail does not sit well in any proposal because it conveys lack of detailed plan for the work that needs to be done.\nThe budget on the other side is very well written and detailed with number of hours and remuneration per hour for the different positions. \nThe proposer does not present himself at all. Just says his name is Milan and he is going to develop the project. I personally don’t know if Milan is the owner or creator of the cardano cube website, I went to the website to look for proof, but no such luck, the owners of the website are not presented. \nSo in conclusion I could not pure heartedly say this project is going to be implemented, not because I don’t believe in the project, it makes all the sense in the world for cardano cube to want to make this, but I could not proof the connection between the cardanocube and the proposer. \nI strongly disagree that it is highly likely that this proposal will be implemented successfully.\t\n", "q1r": 1, "q2": "As the proposer states, “The only way to measure the development of the project is by finishing the project.” With which I agree and that also means that funding should be released after the project is completed.\nSuccess will be measured by increased traffic to the cardanocube site, that is reasonable but there is no exact number stated. How many new visits do we expect in order to say the project is successful?\nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4565, "q0": "As there is more requirement for people to educate on cardano related projects , which will not only help people in investing cardano, but  can also decrease the misconception spreading across the society related to cardano.\nThe proposer himself is UI/UX designer where he can create some cartoons of fun learning aspects which will attract more users to watch the presented education videos,hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "Since the proposal is of risk free it has very less chances of getting failed , as content creation on social media platform is not very challenging task in current standards .\nThe proposer himself has an experience as designer for 10 years and has experience in cardano of 5 years , so designs such a model isn't a challenging one hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The presentation of the proposal could have been more elaborate, so that more clarity on all aspects could be achieved.\nThe proposal is missing specific key indicators to measure the success of the project  and should have provided the timeline of the project , saying what are targets to achieved for each month/quarter , since some of the main aspects are missing in the proposal, the information provided is not sufficient to audit the progress and the success of the proposal. ", "q2r": 3, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4830, "q0": "This proposal is a way to make people, regardless new and current people in the space to be more familiar with cardano and will definitely acts an added value to cardano ecosystem.\n\nAs a blockchain that supports changemakers, it is important that we can attract more pool of individuals, innovators and researchers to put their ideas here and use cardano as a platform for them. More reach, means more ideas will come. \n\nJust one thing, the most crucial thing is the educational content that presented. This is because, to attract more mainstream people, you need a good interactive content to make them stay and learn to the end (taking myself as an adult that wants to learn something new, im more attracted to content that have progression and make we feel good innit.) \n\nI hope proper people are to be chosen to do the content so that it will give full impact rather than just another reading material in the internet", "q0r": 4, "q1": "Since it will start in Q2 and fully implemented in Q4 this year, I think it is enough time to prepare all educational content with improvements from time to time.\n\nI believe the requested amount is reasonable given the detail of the manhours and development of content. But the actual planning of the content is still vague and don't have any prove that it will be effective as expected.\n\nThe content itself doesn't reflect how people will accept and will stay till the end to learn. Again, interactive and good content will play a crucial role in order to make it really effective. ", "q1r": 3, "q2": "The idea to expand the reach of cardano ecosystem is there. The roadmap is there but the content is not very clear.\n\nHowever the KPIs were acceptable with the amount of money requested. ", "q2r": 4, "assessor": "z_assessor_1783", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4976, "q0": "The proposal is a close fit for the Miscellaneous challenge. The proposal described that “We will extend the Cardano Cube platform with an educational section. This section contains different sections”, but this is confusing the reader because we do not know what information will be provided to educate people. Therefore, I believe explain in detail these questions such as what specific contents will contain in these educational sections? How does the project custom the content to help the learner understand and get to use the Cardana ecosystem? Moreover, the language barrier should be considered, for those who do not know English and translation is needed for them to understand the provided content, so will these educational contents be provided with translation for the non-English speaker? ", "q0r": 3, "q1": "Regarding the team, Milan will be the one who develops and write the educational content. However, given a brief of his experience, he did not have any experience related to the educational industry. Also, the educational content will be written by gathering information from partnerships. The proposal should give further information such as Who are the partnerships? And do they have enough experience to write educational content for the Cardano ecosystem? so I suggest providing their name or link to their work would significantly improve your feasibility. The timeline in the proposal needs to add more detail to give the reader vision to follow up your project. For example, Q2 has 3 months, in 1st month the content will be written, then 2nd month the written content is delivered through Cardano Cube and get feedback to improve, the 3rd month is increasing the learner on Cardano Cube. With the detailed timeline, I believe the feasibility could have more impact. ", "q1r": 2, "q2": "The provided information did not fulfil the auditability. The proposal stated that “The only way to measure the development of the project is by finishing the project.” I believe instead of saying that the proposal could describe the method used to manage the project, in case anyone who joins the team can follow the progress. The proposal is invested in educational content but the answer to the question “what does success for this project look like?” is not have any connection to the main idea of this proposal. Thus, I give this auditability 2 out of 5.", "q2r": 2, "assessor": "z_assessor_1815", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6198, "q0": "Since this is somewhat of a re-application of, or an add-on of a previous proposal, I would say that this proposal fits the challenge category well. From my understanding after reading through the proposal, it aims to add an educational platform to the already existing (and well known) Cardano Cube. Having been through several funds as a CA, adding this to Cardano Cube will bring further value to the ecosystem as a whole. The need for educating people in Blockchain technology, crypto and especially Cardano will never grow obsolete. Adding different levels of complexity for both new and intermediate users (as stated in the proposal) seems like a good choice for addressing more people in the ecosystem. \n\nThere is an argument to be made that this proposal would be better off in the Onboarding new members-challenge, but as the proposer states in the comments section it is aimed more towards general Cardano members rather than introducing people to Catalyst directly (even though lots of people may end up there eventually). All in all, I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "There is no doubt that the developing team is highly competent and have been incredibly successful in its previous implementation of Cardano Cube. They have a growing follower-base on social media, along with an active platform that is growing rapidly. As hinted in the proposal, the biggest potential challenge might be the assurance of quality in regards to the actual educational content. Which the team (of one person) seems to be aware of. The budget breakdown is pretty simple and realistic, suited for a smaller project with few team members. Despite Cardano Cube being a well known platform in the Cardano Ecosystem, it would highly benefit the proposal if it had included some verifiable information of the developer. (linkedIn profile, projects that this specific developer has been responsible of before, etc). My purpose as a CA is to assess the proposal in its presented form, despite what I know outside of it. From my experience as a teacher, I would have loved to see maybe an example of a curriculum for the educational content. That would further increase my trust in the project, and believe more in the credibility of the team.\n\nWe are presented with some development milestones (that seems feasible) on a realistic timeframe. I agree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 4, "q2": "The proposal presents us with a clear and simple roadmap (as mentioned under ”feasibility”). The developers of Cardano Cube are active on social media, so I would assume that the community can follow the development of the educational platform easily (although I would have liked for this to be more clearly presented in the proposal). The only way of measuring the development of the project is NOT only finishing the project, but can also be to communicate with people who are interested on social media. Providing updates of the progress, etc. \u2028I would have liked to see some measurements of success/KPIs describing how much traffic the educational platform is expected to see for the project to be deemed as successful. Also, how many different collaborators are planned?  These are the types of questions I would have liked to see being answered. Even though there are some information/details missing for the auditability being assessed properly, the proposal DOES include relevant information that is needed according to the criteria. I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We will create an educational environment, where people can learn everything they need to know to get started in the Cardano Ecosystem.", "experience": "A professional UX/UI designer with over 10 years of experience and 5+ years of experience in Cryptocurrency."}