{"id": 399228, "author": "otaviolima", "title": "Courses & Education Crypto MKTPLACE", "url": "https://cardano.ideascale.com/a/dtd/399228-48088", "category": 26441, "amount": 33500, "description": "Find all courses and training related to the crypto ecosystem such as: Blockchain, Crypto, Programming, DeFi, NFT, Pools, Linux, and etc.", "funded": 1, "upvotes": 23147963, "downvotes": 18387811, "votes_result": 4760152, "votes_cast": 84, "f6_no_assessments": 5, "f6_rating": 3.4, "videos": [], "media": [], "f6_assessments": [{"id": 6197, "q0": "From my understanding, this proposal aims to create a marketplace for E-learning related to everything Crypto. By gathering a lot of learning resources related to the ecosystem in one place, it will promote more people educating themselves coming in to the space, and create a healthier environment for people with limited knowledge about Crypto or blockchain technology. And if there are many credible learning resources gather in one place, it will in turn attract more users to the ecosystem. It all comes down to if the project has the means to scale properly, advertise and grow a good reputation. More on that under ’Feasibility’. \nIt would have been less impactful if the platform only would feature paid courses, so the inclusion of free courses on the marketplace is a welcomed one. \n\nThere is a discussion to be made wether or not this would fit in the dApps and Integrations-challenge (as mentioned in the comments section), but it seems that the intent of the proposer is leaning more to the side of a web-based E-learning platform. The line between the two is thin, but overall my opinion is that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team covers a wide area of expertise needed for the completion and success of this project. Relevant links (LinkedIn, etc) are provided for each of the core team members, and the credibility of the team is further strengthened by the fact that they are already running a very successful media coverage platform focused on the Cardano Ecosystem. From my opinion and experience as a teacher/researcher, I would have liked to see more emphasis on teacher experience represented in the core team (even though this is represented in the team) but after reading the proposal it is my understanding that the specifics of the courses will be left to the hired teachers themselves. \n\nBudget of the proposal is broken down in a clear and understandable way, and we are provided with a clear timeframe spanning over 3 months, with included milestones. I am by no means a developer, but in comparison with other successful projects in the past (This is my 3rd fund as a CA) the calculated resources and timeline for completing the project seems likely to be implemented. \u2028\u2028I agree with the teams mention of the potential risks/challenge of the need of the onboarded teachers to market the platform, along with the ”threat” of competition from other E-learning platforms. The decision on making the focus of this platform crypto is a good one, in my opinion. In my opinion as a teacher, a potential risk/challenge in regards to the actual content being provided on the platform could be that the courses differ a lot in quality and content between each other. It would be nice to see if there is a list of standards, example of curriculum etc to see if the proposers want each teacher to construct everything completely independent from each other, or if they aim to have a ”red thread” between the content provided. I agree it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "We are provided with a clear roadmap with milestones set on a 3 month time frame (as mentioned before). Considering that the core team already has a strong and active user base from their other platform (CardanoFeed), it seems highly likely that the process of development will be easy to follow for the community. \nThe proposal includes a list of KPIs and measurements of success, but it would further strengthen the proposal if it had included some target numbers in relation to stated KPIs. \nFor example: ”By this point in time, our aim is to have X amount of registered users, and X number of free courses and Y number of courses for sale available on the platform.”\nEven though it would just be a target number, it would grant further insight in the development and process of the project. \u2028Overall, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2, "reply": "We are very excited about your comments and ratings, almost full marks in all topics, especially coming from a teacher. \nThank you very much for your feedback, we would like to count on your support in approving this proposal and that we can bring quality knowledge and training to users."}, {"id": 1866, "q0": "The proposer has the idea to create a marketplace for marketing and conducting online courses (e-learning) in the area of blockchain technology. The proposer does not state if the project will be open source or privately own enterprise. The proposer states that the courses will be multi language and there will be two categories, paid and free.\nThe interesting part is that the proposer envisions a course completion certificates issued on the Cardano blockchain.\nMarketing will be trough CardanoFeed.com to attract customers.\nGiven that there is a challenge Developer Ecosystem with a outlined direction Knowledge base & Documentation, I would argue that this proposal has another challenge where it could fit. \nI neither agree nor disagree that this proposal effectively addresses the challenge.\n", "q0r": 3, "q1": "The proposal has a very well outlined roadmap with monthly time intervals with a number of tasks per month. We see that the launch of the platform is expected to be in 4 months.\nThe proposer does not show a strategy for attracting teachers and learners to this new platform from the already established ones. \nThe budget is beautifully broken down except in the final stage of remuneration/hour.\nThe team is well presented and all team members have linkedin links for further history check.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposer suggests that the auditing of this project could be done by following 3 measurable parameters. Number of hits on the site, number of registered users, number of courses available. However the proposer does not want to engage with any numbers. That means, the auditor should make a discretionary call if the project is going well or not. Even more than that, all these parameters could be followed only after the site and the project is up and running, that means that the auditor could not measure the progress of the project until reaching that stage of development. The question then is how the auditor will assess the progress of development in order to fund the proposal?\nWhat I want to suggest for the next proposal of this team is to make clear milestones, monthly let’s say and bind them with numbers and dates, this way the work of the auditor is already clear and will not be discretionary.\nSuccess is of course missing the same concrete numbers that we already talked about.\nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. \n", "q2r": 2, "assessor": "z_assessor_1417", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the comments and feedbacks received, they were very deep and we believe that we were able to work to improve the project even more. \nIn terms of auditability, we will already implement an open and public framework of JIRA, thus bringing transparency in all tasks to be developed, roadmaps and deliveries, we will also have periodic releases with the progress of the programming and also. dissemination of deliveries and conclusions in our networks social. \nIf possible, we would like to count on your support in approving this proposal and also a possible reassessment in the project notes."}, {"id": 4637, "q0": "Plan to develop a platform to buy or sell courses on blockchain products and use cryptocurrency as mode of payments. Although a good initiative, the differentiating factor (apart from the payment mode) is not well defined. Since it is only a platform, the usability of it depends on the quality/expertise of sellers(teachers). Also there are well established sources on different platforms, which may hinder the progress of the platform usability. ", "q0r": 3, "q1": "The expertise is well demonstrated, as per the LinkedIn profiles of the members. However the prices in the market place will be decided by the sellers which may be a major hurdle when the buyer is from a developing nation(which may be more as developed nations already have good resources), and the seller is from a developed nation. The disparity between affordability and expectation. Thus model may not be self sustainable. The courses will only be on blockchain products which may be another limiting factor. The proposer will have to generate plans to effectively counter both the afore mentioned factors, apart from developing a platform.", "q1r": 3, "q2": "The budget break-up and product delivery timeline has been well described in the feasibility section. They can be taken as marker of the development process and hence enable auditability. Post Launch metrics to measure the success are mentioned in the auditability section. However no parameter as be assigned an target/specific number essential to measure the success of the project.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "We appreciate your comments, feedbacks and ratings, we really believe that we can deliver a great teaching and training tool for the Cardano community. \nWe trust our community and we know the power it has, we count on your support in approving this project and we can bring knowledge to users."}, {"id": 8099, "q0": "The courses & education crypto Marketplace sits within Miscellaneous Challenge despite the fact that the proposal could be under Business solutions (B2B & B2C) challenge. Even though the proposal is related to Education but they are education \"marketplace\"  (close peer for comparison is udemy) and part of business is run like a profitable business operation (paid courses). The plan of this project is to bring cryptocurrency courses to the market. There would be teachers and content creators who will be rewarded. The attendee will be issued with course completion certification. They specify the risk of locating the teacher to market the course on their platform. ", "q0r": 3, "q1": "The timeline to complete their app is in 4 months (possible despite time constraint). The team has the right skillset and experience to bring this project to live. The budget will be mostly spent on their app (design, front end-back end developer). Instead of indicating roughly as how many months in the budget, it would be good to know the cost (rate/hour) so it would be clearer to observe the budget estimate (under-estimated, over-estimated or in line with scope size)                                                                                                                                 ", "q1r": 4, "q2": "The list of KPIs provided by the team are mostly about app usage. The proposer team has not mentioned how they plan to report project progress. They also have not provided the benchmark figures that would be a good indicator of how successful is the project and whether it is on track.  Although the proposer understand the project goal of making the education marketplace available on the blockchain, it needs a lot of information (milestone, deliverables information) in order for the community to audit the project.", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "We really appreciate your comments and feedback, we will work to deliver the best experience for users. \nWe will try to be more specific in detailing effort x hours worked x values, as well as presenting the project's technology stack in an open way. \nWe would like to count on your support in approving the project :)"}, {"id": 9010, "q0": "The described problem in the proposal is clear and easy to understand. I believe that the most effective way to get people to adopt an idea is providing them with enlightenment platforms so that they can best understand the idea and possibly accept. Creating a market place is the need of every blockchain. \n\nHowever, I see that the approach is more of creating a generalized market place for blockchain, that is good however I will advise that next time a specific market approach will benefit if a market place for Cardano is created because it’s the heart beat for project catalyst. ", "q0r": 4, "q1": "There are so much details about the team and believe per their experience and expertise provided, they possess the required skills and knowledge to execute the project. The budget is well described. However, the statement “more complete details can be provided if and when we are selected by catalyst” gets me confused, as I am beginning to think that there is the possibility that the amount stated is not the true reflection of the project cost or something can spring up that will curtail the execution of the project. That makes it difficult for me to say that the budget is feasible. I will expect a better explanation to that statement. The plan and timeline stated are clear and detailed.\nIt’s good effort that the challenge or risk have been foreseen and indicated, however the mitigation measure is not clear.", "q1r": 3, "q2": "The roadmap, milestones and time horizon are well explained. The targeted problem is clear together with a proposed solution that has the potential of addressing the problem.\nThe proposer has missed out on the statement of what does success for this project look like. What is provided there are more of metrics/KPIs that define the success of the proposal. I advise that this is clarified in future proposals.\nThis makes it difficult to assess the proposal’s auditability.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for your time and comments on our proposal. \nWe really believe that we can deliver an excellent e-learning tool to users. \nWe are able to deliver the project on time and with the tools / bugdet presented, without major difficulties. \nWe count on your support for project approval and we will bring more crypto knowledge to people."}], "solution": "Marketplace for marketing and conducting online courses (e-learning) in blockchain, crypto and programming. Payments with Fiat and Crypto.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}