{"id": 399491, "author": "jeffghome2020", "title": "University/College Outreach ", "url": "https://cardano.ideascale.com/a/dtd/399491-48088", "category": 26441, "amount": 22480, "description": "We need to reach out to university and college students and graduates to raise awareness of Cardano and the opportunities that exist.", "funded": 1, "upvotes": 27555360, "downvotes": 20459469, "votes_result": 7095891, "votes_cast": 112, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1870, "q0": "The proposer suggests there is a need to spread the word of Cardano and the opportunities it arises amongst university and college students. This is an important target group for the development of cardano due to the high potential and early age of the people of that group. \nThe proposer suggests working on that issue by providing daily zoom calls and assistance in proposal development. This has already been funded in funds 4,6 and 7 and now it is suggested for fund 8. The proposer states that they have reached 3400 students on zoom, but does not provide evidence for that. The total funding for the past 3 times this proposal was funded is $19800.\n The proposer states that they will be applying for additional funding in the next funds, (despite that the F7 funding should have been the last) until they gather enough students that make proposals, that the referral fees could fund the project.\nI strongly agree there is no other challenge that will host this proposal.\n", "q0r": 5, "q1": "The proposer explains in an free language what is the routine of the team, calls to university, zoom meeting, slides, presentation. However the proposer does not provide neither links to the slides nor a recording of the meetings.\nThe proposer explains that this funding request is for 3 months salaries of the team. \nThe budget is broken down, and that is why we see that except salaries there are expenses for hardware, a laptop for $1800.\nThe proposer presents the team and the tasks are delegated, however there is only one link to the proposer’s CV.\n\nI neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 3, "q2": "The proposer does not provide any milestones, timeline, or any reasonable benchmark to be audited by. The proposer states that there will be a separate wallet for the funding to enable tracing of payments. How is this relevant at all?!\nThe proposer states that they have a target of 50 students by presentation, but since the proposer does not provide the recordings of these meetings, the auditor cannot know that. \nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5003, "q0": "This project successfully addresses a topic that is not covered in any other category. The proposal also aims to further the reach of Cardano by teaching others about it. By doing so, it furthers the expansion of Cardano, which is a success for all of us. ", "q0r": 5, "q1": "Since this is a proposal for a continuation of a project that has already been funded, multiple times, it is clear that it has already been successful. As the proposal plans to spend their earnings, it is clear that their goal is to expand their audience and teach more students. They already have successful methods for accomplishing this. ", "q1r": 4, "q2": "The propsal clearly states a method of tracking success for their zoom sessions. This is not something that is done easily, but they clearly state how they have and will continue to do so. Tracking growth in these sessions is also something that can be done to understand growth, which is another method of auditing success. The idea of a separate wallet to audit the use of the funds is very smart. ", "q2r": 5, "assessor": "z_assessor_1819", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7935, "q0": "A proposal on fostering student interest in the blockchain field. Currently, formal education in the field of blockchain is not really popular in most universities around the world. Especially countries that are developing or have underdeveloped economies/technologies.\nSo I would love to encourage projects like this one.\nDoes the proponent have a goal: number of attendees, number of interactions, number of followers on social networking sites or online discussions they organize.", "q0r": 5, "q1": "In previous rounds, the proponent reached over 3400 students to share blockchain related topics. This is a commendable effort, showing that they are serious about this proposal.\nHe also collaborates with many technical experts, some of them university professors, to improve the quality of the discussions, and to make it easier for students to engage.\nYou should be more specific about what you're going to share. Don't just stop at discussions. If it is accompanied by promoting blockchain formal training at universities and taking cardano as a blockchain model for future students, then your proposal is very valuable.", "q1r": 4, "q2": "In this section you need to present ways you can show your work progress and results through your work plan and specific target numbers.\nFor example your youtube channel will have how many videos/discussions/how many attendees are uploaded.\nWhich universities will you partner with to support the promotion of student clubs to learn blockchain research here..\nThose are realistic goals, and it takes a self-reported reporting tool to demonstrate to the community your integrity, hard work, transparency, and dedication.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8694, "q0": "The focus of this proposal is about reaching out to University and college students, teaching them about Cardano and the existing opportunities in Cardano through daily zoom sessions. They also aim to assist them in writing good proposals. Proposal objective is to reach out to as many students and graduates as possible to raise awareness of Cardano and its opportunities for both developers, professionals, and business owners. \nTalking about addressing the challenge, this proposal in my opinion could have rather fit the New Member Onboarding Challenge. Hence my 3-star rating. The main risks are that students are busy and also the public perception about blockchain and Cardano itself. ", "q0r": 3, "q1": "The proposer will initiate contacts with the University professor or student association or key person; Zoom meeting interactions, 3 months duration of the project, but the proposer didn't indicate the exact date of start and finish. Powerpoint presentation on Cardano , Project Catalyst, etc. Add more community members. I recommend that the proposer would ad a clearer plan in their next proposal. \nThe budget is well broken down into smaller costs of activities like social media cost, incentive program, hardware, and software acquisition. Total budget request of USD 22240 is reasonable. \nThe team is made up of 3 core and two students . The three members are Jeff (Idea proposer, project lead), Steve (Retired Manager of IT, 20year + in IT Space), and Mathew(Community Advisor). The information provided  in this section is likely the proposal will be implemented successfully.", "q1r": 4, "q2": "Their goal is to measure the number of students engaged; number of referrals to catalyst; create new feedback loops; introduce innovative communication channels such as Tiktok; average students engaged per session . They have already delivered sessions to 3400 students. \nSuccess can be seen as the delivery of quality educational zoom sessions to the target audience; the number of follow-ups for referrals; development of ongoing follow-up with the students, etc. \nThis project is a continuing funding request, originally funded in Fund4, 6 and 7. \nThe proposers may look for a few more experts in outreach program to coach them to deliver and become a sustained project to get more people onboarded onto the ecosystem. My rating is 4.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9675, "q0": "This proposal targets awareness and community input into a potentially young user base. I think that this proposal and team have a solid idea and would like to see an outreach program for universities or defi awareness overall for people in highschool to tertiary education.", "q0r": 5, "q1": "From their pilot program i believe the team proven an example of what could be possible. They have some good evidence and have a good amount of experience amongst themselves. I would like to see some more information presented in a user friendly way about the amount of people they reach and for what amount of time. What they are presenting etc", "q1r": 4, "q2": "The team has presented a few different social media platforms that they could use to gauge following. They have mentioned a feedback loop, what this means i think i need some clarity on. They have recognised a need for good measuring tools. How do they plan to present this information so the Cardano community can gauge their success?", "q2r": 4, "assessor": "z_assessor_750", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We intend to incubate interest in the blockchain by educating them with daily zooms and assisting in proposal development with the targets.", "experience": "Founder of CardanoOutreach, fund4/6/7 winner, we have reached 3400 students on zoom and twitch! A former manager and unversity grad. Managed a team of 5 people for this project, delivered an MVP and now we are evolving the project to get better expsoure and better results."}