{"id": 400119, "author": "cardano420", "title": "Carbon Neutral Hemp Supply-Chain", "url": "https://cardano.ideascale.com/a/dtd/400119-48088", "category": 26441, "amount": 5000, "description": "We face an often overlooked but very consequential problem - soil contamination. Removing contaminants safely is difficult and expensive.", "funded": 1, "upvotes": 23074112, "downvotes": 16229212, "votes_result": 6844900, "votes_cast": 78, "f6_no_assessments": 8, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 1872, "q0": "From the get go I want to point out to the voter, that the proposer will give the funds from the budget of the proposal to the community as rewards for solving real world problems regarding the use of hemp plants for cleaning the soil from contaminants. There are 5 outlined problems to be solved and the rewards will be appointed by the community involved, defacto it is a challenge for best solution.\nThe problem is that a lot of soils are polluted with heavy metals. The fact is, that hemp plants absorb heavy metals. I was surprised and skeptical despite the attached paper by the proposer, so I made some research, it is true.(https://www.mdpi.com/2073-4395/10/6/907/htm) The solution is to use hemp for extraction of HM from the soil.\nThe proposal is a first step in building an incentivized framework for landowners to grow hemp on contaminated land. \nThe project does not envision a big impact for the Cardano block chain, but if all incentives are made in ADA, there case could be made, that the project drives adoption.\nI strongly agree that there is no better challenge to host this proposal than the miscellaneous challenge.\n", "q0r": 5, "q1": "The proposer present a very hard to find plan for action but, but he makes for it by huge enthusiasm and pure volunteerism for the organization of the proposal and the challenge. Unfortunately there is no timeline either. \nThe budget is clear, 5 rewards $1000 each for the best solution of 5 problems.\nAfter the discovery, the solution will be assembled in a litepaper.\nThe proposer does not provide a CV, and presents himself as Van Michael - Cardano420 [WEED] Stakepool.\nI neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 3, "q2": "The progress of the paper is suggested to be measured in solution proposals, voter turnout and litepaper, but for neither category the proposer does not point out specific numbers or times. \nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7535, "q0": "Great project solution and networking opportunities to produce a multi level approach to multiple issues affecting conservation and sustainability efforts. I like the notion that it is a open decision-making  and solution driven reward system as a way to resolve the idea presented.  This would bring a case study on later funds for research purposes and which data can help multiple experts and open the door to renewable energies while carbon capturing and cleaning the soils.", "q0r": 5, "q1": "The experience is adequately enough to achieve the proposed tasks in regards of networking, raising the funds to foster innovation and future funds reasearch. The team is working on forming a team of experts that can deliver perhaps a case study in which future supply chain innovation can be expanded to other effected areas with high mineral deposits and soil pollution. The proposer has extensive knowledge to bring a very interesting solution to a number of the issues raised and opportunities available.", "q1r": 4, "q2": "The plan is transparent and the end goal seams fitting to start a solid team of expert in each area that may require expertise on each category of the reward topic in future fundraising. Perhaps some resource like link to the discord channel and some key performance indicators as how many individuals joining or are interested and how many proposals are submitted per item would be a good progress tracker. With a detail timeline of the progress along the way. Fund use is a great incentive to onboard a passionate group of members.", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10746, "q0": "This is a general proposal outside of the Cardano ecosystem that will look to recycle previously unusable land for the growth of industrial hemp.  Although no tangible benefits to Cardano are given, there are environmental and industrial benefits of this project.", "q0r": 4, "q1": "This proposal is seeking funds to do a feasibility study of how to execute the farming of hemp and are all highly doable given the proposers experience and background.", "q1r": 5, "q2": "Little metrics are given, although deliverance of a whitepaper and measuring interest by the number of voters are leading indicators to how the project could potentially grow.  There will be the deliverables of the feasibility study that can be measured as they are completed.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10781, "q0": "A unique proposal that fits this challenge and great objective to reduce soil contamination impact. However, for this proposal the connection to blockchain and Cardano is limited. The proposal focuses on “generate the framework for a sustainable and scalable carbon neutral hemp supply-chain” - I do not see how it will impact Cardano (sorry if I missed anything, but I red the proposal several times). The supply chain current status should have been a base for the proposal which could have focused on analyzing how Cardano & Blockchain could support this supply chain. The problem of soil contamination and solution are well explained but not how is relevant for Cardano. \n", "q0r": 3, "q1": "The proposer is managing a stake pool but seems involved and passionate about Cardano. More information about his supply chain knowledge and connection ot other relevant expertise are missing from the proposal as well as links to validate it. \nThe budget is outlined clearly and broken down into identifiable items. \nThe budget is mentioned in a general way and it is difficult to evaluate if it is reasonable or not. For example: “incentivizing the gathering of soil and air quality data $1000” - who we to incentive? How many data points? How many farmers? Overall, the budget requested is not high but it is no clear the impact of it. No clear timeline was provided and the plan is missing milestones.  ", "q1r": 3, "q2": "It would have been good to have more specific KPIs about how many ideas you expect to have and how many voters you would like to reach. The numbers than could be measured. The lite paper is auditable. The roadmap is missing as well as clear milestones. Clear understandable description of the targeted problem but the solution is not very clear how it will lead to a  *blockchain-based carbon neutral hemp supply-chain project in the United States”", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10785, "q0": "The proposal asks for 5k fund to incentivize the \"Hemp\" production - which is a cannabis type of a plant, which is apparently having a unique properties when removing contaminants from the soil and the air. Unfortunately, even that proposer states that it will be related using Cardano, there is no detail mention about it - except that the aim is to build a community which will propose new solutions - in Cardano. The overlap and the final impact seems very low. And to be honest, if the only overlap with Cardano is to build a community who will potentially contribute to catalyst, question raises, whether it should be a better fit for new members onboarding. ", "q0r": 1, "q1": "The feasibility of the proposal as it is, I would say it simple, if we start at the point that 5 groups on discord will be created and the budget of 5k will be divided into these 5 group - 1k each, as incentives to propose solutions in respective groups. Also, the proposer claims to be a stakepool operator, and using his words \"passionate proponent of Canabis plant\". \n\n\nTo improve the proposal and to increase its feasibility, the following information should be added:\n\n1. more information about the proposer, possible linked in profile, or any other profile increasing the credibility of him/her as a person, along with some relevant experience, education, skills or results. \n2. the budget 1k/challenge - it is unclear what time frame will be used to determine WHEN these rewards will be spent, it is unclear if 1k goes to the \"best\" proposal, or it will be split e.g. among top 3?\n3. slightly off - but - if the proposer aims to be active in this area, creating a discord -the information about the current numbers of community would increase feasibility - if there would be information, that the community is already 2k,3k people, and he plans to incentivize this community, or it is going to be built from scratch. \n4. the budget 1k/challenge - more information on HOW winners will be selected - anon votes on discord? or different way? More details would be required. ", "q1r": 2, "q2": "The auditability of the proposal is to be performed by the number of proposals, number of voter participation, and the final \"litepaper\". \nIf the goal of the proposal is to create a discord and community, these KPIs would be sufficient to measure the success. What I am missing is the timeline. How long is it estimated to launch discord? What is the estimated deadline for proposals? Why number of active members is not used as KPI? Monitoring possible trend in number of participants? (increase/decrease) Star down because the timeline is not clear. Suggested KPIs can be implemented easily. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10799, "q0": "The idea is to encourage the cultivation of the hemp plant, which can help clean up land contaminated by toxic waste and heavy metal pollution, according to the author. I found it very interesting how he attached the speech of an expert to the proposal, reinforcing the argument that hemp really is significant in this matter of soil improvement. However, I didn't think that the proposal is in line with the challenge for the simple fact that it is not certain if Cardano will benefit from it. The author states that a decentralized network would be created for landowners and future plant growers to organize themselves; some Cardano technologies would be used, and according to the author they would fit in various challenges like open source development, dApps and integrations, business solutions (B2B and B2C), new member Integration and improve and increase auditability. But it is not made explicit which technologies these are. Therefore, the impact seems low to me, due to a lack of understanding.\n", "q0r": 1, "q1": "In terms of script, the explanation is very superficial. We know that the project would be divided into 5 phases, but it is not detailed what exactly would happen in each. They are only mentioned, not explained. How would focus regions be decided? Who would decide this and by what criteria? I do not agree that we have a good understanding of the process based on the information given to us. Next to each of these 5 phases, it is also told how much it would cost. The author says that a kind of competition would be made, in which developers would propose solutions for each of the phases, and the winners would be paid in the amount of one thousand dollars. I think it's a little tricky to establish this, as different professionals might cover different values, but it can be a good idea. The budget division here is really quite different from most proposals. Finally, analyzing the team, it is just the author. He is a person involved with the community, but does not exemplify previous work well. It's also worrying that he doesn't have a team in place; with this, the necessary trust is not passed, which would be installed if we had a multidisciplinary team with presented curricula.\n", "q1r": 2, "q2": "The measurement of progress would be based on 3 indicators. I think they are sufficient and adequate for us to monitor the progress of activities, but I would like the proponent to make it clearer how such information would reach the members of the Cardano community. Would he organize them himself, compose reports and forward them through the telegram, discord, etc groups? I think that if this point were clarified, I would say that everything is ok with the auditability of the progress. Regarding the final results, it is difficult to define the overall success since the proposal corresponds only to the initial phase of this idea, from what I understand. But in general, it is defined that when the litepaper was made with the proposed solutions and when the Cardano community gets involved with the cause, success would be considered achieved. So, it's a simple, but somehow efficient way to measure whether the project worked. It just needed more specificity. How would the involvement of the Cardano community be measured?\n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10804, "q0": "Obviously this proposal to that can only fit into campaign category. Though, a laudable project aimed at promoting the use cases of Cannabis (hemp) so much so that it has decriminalized in the US, it is just an idea at this stage with finding to incentivize and gather like minded persons in interested in this field to fashion a direction and participations that lead to future ideas and projects aiming the use of Cannabis as a soil and environmental detoxication agent. However, I can not seem to understand how the Cardano ecosystem will benefit from this project except to act as a medium to record, analyse, collaborate and coordinate the promotion of it's Cannabis usefully as regards, it's detoxication properties. How does the proposal encourage or ensure adoption of Cardano and its ecosystem, that is the question, am not able to answer .", "q0r": 3, "q1": "Considering that this proposal is all about funding of a project towards ensuring participation of the community members in the discourse, the project is just at the research stage and puts a doubt at the Feasibility of this project. The sole proposer, being the operator of a stakepool without any other details except for his passion for the subject is sufficient to confirm that the proposal will bear fruit. There is no timeline or stages of how to monitor this potential collaborations in arriving at the specified goals for the earmarked rewards. The whole process is left to the whims and caprices of the participants towards arriving at stated stated litepaper being the result of the whole process. There is no budget breakdown and analysis, no timelines to monitor the process and the development of the project. The proposal need to be more detailed as regards how to effectively nagivate the process.", "q1r": 2, "q2": "The proposal has not really provide enough information to effectively monitor and assess the proposal. There is no quantifiable metrics to verify the progress except for notion of turnover of participants and voting and eventual voting to arrive at it's main goal which is the litepaper for future iterations. All these seem vague and not reliable enough to assess the progress and success of the project.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10841, "q0": "This proposal aims to use the requested funding as a reward for anyone who can create a framework for a sustainable and scalable carbon neutral hemp supply-chain. The proposal in my opinion is not solving any problems rather it is just a way to outsource the problem solving to another 3rd party. It is better for the proposing team to bring their own solutions to the table on how to link their hemp carbon neutral supply chain project that uses the cardano blockchain technology. Without any concrete and concise solution proposed, this proposal doesnt bring any impact to the community or society. Therefore I disagree with this proposal giving any impact and given it a rating of 2 stars.", "q0r": 2, "q1": "The successful implementation of this proposal highly depends on the participation of a 3rd party entity. Without anyone contributing to it, the proposal could not be implemented. The budget presented is a reward for the contribution of the participants therefore relying heavily on 3rd party for this proposal to be successfully implemented. With regards to their plan, they are trying to create a framework for a sustainable and scalable carbon neutral hemp supply-chain but could not figure out own their own therefore offering it to 3rd party to solve it. As mentioned previously on the impact section, it is better for the proposer to provide their own viable plan rather than outsourcing the solution development to a 3rd party. If the 3rd party could provide a solution, they could just propose themselves to catalyst rather than going through another organization. If the goal of this proposal is to reach out to other people to onboard them to Cardano, I suggest that the proposer to place this proposal in the new member onboarding or scale up Cardano community hubs challenge.  Therefore, I rate the feasibility of this proposal with 2 stars.", "q1r": 2, "q2": "The success metrics provided are measured in the participation of the community. There isnt any definite amount, does 3 proposal submission and 6 voters considered as success? In your next proposal, include a quantifiable figure for ease of auditing. The proposer did not provide any platform for the voters to keep track of their project progress. In your next proposal, provide information on where the voters and community can receive updates on your progress. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Hemp (non-psychoactive Cannabis) has unique properties that make it excellent at removing contaminants safely from the soil and the air.", "experience": "Hello, I'm Van, from Cardano420 [WEED] Stakepool. I'm a passionate proponent of the Cannabis plant and very committed to leveraging the power of Cardano to distribute its benefits to as many people as possible!"}