{"id": 404028, "author": "dntvu2312", "title": "Format Of Evaluated Project Process", "url": "https://cardano.ideascale.com/a/dtd/404028-48088", "category": 26441, "amount": 13700, "description": "Every methods almost evaluate Crypto projects subjectively. Therefore, investors will get confusion when they make financial decisions.", "funded": 2, "upvotes": 49028172, "downvotes": 10199752, "votes_result": 38828420, "votes_cast": 114, "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 177, "q0": "The proposal aims to create a platform that evaluates quality of project on Cardano based on a preset criteria. The objective is to evaluate 50% of the projects on Cardano. This aligns with the Challenge setting \"Successfully fund proposals, approved by the community, that don't fit well any other challenges.\". The proposal is a form of a public quality control and certification scheme performed initially by team member and later by the community, the project can scale though attracting community members. The project adds value by passing projects on Cardano through a classification filter and attributing a rating, this simplifies the view for community members who do not have the time to understand what each project is, but want to know what is in the ecosystem", "q0r": 5, "q1": "The team member disclose their linkedin profiles although one of them has 26 and the other one 97 followers, which suggests they are not very active on linkedin. One of the members reports to be an Admin in a facebook group with over 40k followers, the group is closed so I could not verify the claim, but the said group does have 46k members and is based in Vietnam. The proposer have an active site operating which has an evaluation of crypto projects, not just on Cardano, and their objective is to create a website like that just for Cardano. A delivery schedule is provided which details the deliverables by month . In the first month they will review 30 projects (1 per day) and in the second month they will identify reviewers too evaluate 30 more projects and in the third month and onward they will encourage community to join to support  more reviews. Total budget it 13k which is a low price to pay for a review of 50% of projects on Cardano. The main question then becomes the quality of these reviews. At 1 per day it looks very aggressive to maintain a high quality after allowing for quality controls and revisions. ", "q1r": 4, "q2": "The project has an objective deliverable and a monthly schedule has been provided, therefore there is sufficient information to audit the project. What success looks like has been articulated and is objective and KPI metrics have not been defined, but they monthly plan is detailed enough to serve as KPI", "q2r": 5, "assessor": "z_assessor_1076", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 275, "q0": "This project will help Cardano move forward by helping users get hold of objectively evaluated solutions. From the risks it is clear that getting people on board has been and will be difficult. But they have plans in place.\nThis is a Cardano based project that does not fit into any other current challenge. \nThis project could help all kinds of crypto projects.\nThere is scope to scale this solution\n", "q0r": 4, "q1": "This project has a clear goal and strategy. It helps that they have been funded before. \nThey have the skills to develop the solution and now need the community to be built.\nThere is a clear timeline for this project.\nThe risks are well understood.\nThe budget is well explained.\n", "q1r": 4, "q2": "There is clear auditability with set goals over a 3 month period with a clear idea of what success looks like. \nThe problem is clearly explained\nThe solution is also clearly explained.\n\nFor next time it would be nice to see a list or illustration of what was done in the previous round.\n", "q2r": 4, "assessor": "z_assessor_1130", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 1352, "q0": "The proposal tries to create a group of expert reviewers in order to help the community to gain more knowledge and confidence in the projects and the content will be posted on the vcoincheck website. The proposal has proposed a simple yet useful solution to the problem that many new investors face. The team has a solid plan and consisted of an experienced team, If the proposal is executed successfully it will add value to the Cardano ecosystem. The team give the main challenge of recruiting expert to unify a standard format objectively, however, the team has provided a plausible solution to overcome them.", "q0r": 5, "q1": "The proposal has clear and comprehensive milestones, a roadmap, and a timeframe to work on the stated milestones. The roadmap is stated in the first month, second months, third months, 4th months and so forth. The team provides a detailed and reasonable breakdown of how they will use the proposed budget, they will give an incentive to the community member and will get paid per projects evaluated, other use of budget also outlined clearly. The team give concise information of the background and experience of each people on the team and provide a LinkedIn profile and telegram account for all member, thus making the community easily verify the experience the team has.", "q1r": 5, "q2": "This part of the proposal is very complete, the proposal provides clearly defined KPIs on 1st, 2nd, and 3rd month, each with objective and measurable goals. The proposal also clearly explained the indicators of success by 4 points, from the number of evaluations, number of reviewers, and number of users, also all of them are measurable.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 1638, "q0": "The idea of ​​this proposal is to build an verifiable set of project evaluation criteria based on life experience as well as in-depth knowledge of blockchain. I quite like this idea.\nCurrently, information technology is developing more and more, people can easily find news through websites easily. This is an advantage as well as a disadvantage. Because it is too easy to access information without being selective, groups of people or organizations with bad intentions will take advantage to spread false news or news to promote FOMO psychology of the crowd to serve their own personal interests. This will gradually reduce the community's trust in the crypto market, making it worse in the eyes of everyone. Therefore, having a place where standards can be set for a project, which can direct people to interact with each other to exchange experiences in filtering information based on standards will help the community to improve awareness. Help community avoid marketing tricks.\nIn addition, the website can be regularly updated news for investors, 2-way interaction to minimize subjectivity. I think this idea is really needed in the Blockchain space", "q0r": 4, "q1": "With the in-depth knowledge from the team members, I am confident that the proposal will be successfully implemented.\n\nAnother aspect is that the proposed roadmap clearly states each work will be done at what time, there is a specific plan. This shows that the proposed team is knowing what to do to achieve the end goal.\n\nReasonable budget breakdown, more than half of which is used as an incentive for the community to contribute to the set of criteria, with the incentive of $ 125 / contribution is a reasonable amount to promote the community (price based on cost in Vietnam)", "q1r": 4, "q2": "I agree with each of the criteria the team has set here to measure the success of the proposal.\nThe community and voters can easily follow and check the information through the links that the proposer has attached.\n\nI have a small suggestion for the proposed team that rearrange the layout of the project evaluation website more friendly for the convenience of viewers.", "q2r": 4, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5372, "q0": "The problem described in this proposal is clearly identified and it is clear how the project intends so solve this. The project intends to evaluate 50% of their overall projects built on the Cardano ecosystem it is aligned with the challenge. It is a valuable project for different experience level investors. The proposal presents sufficient goals which support their outlined challenge settings. The also measure their success through encouraging community involvement which fits within miscellaneous challenge out line as it is a project that is valuable to the community. The proposal has addressed the foreseeable risk and challenges of the project although it was unclear on their plan to alleviate them.", "q0r": 4, "q1": "The proposer provides a detailed information of the team and provides links for reference. It appears that each member of the team is competent in implementing the project. Their individual skills and experience are adequate and the variety of specializations give clarity on their ability to accomplish the tasks outlined. The roadmap is clear, concise and each phase have realistic timeframes to complete the work. The challenges and risks of the project have been sufficiently been addressed and adequate solutions have been devised to help alleviate them. The budget of the proposal was confusing. There was a section in the budget where funds were allocated to a ‘community incentive reward’ scheme. It was vague on how the project described the information on incentivizing project assessors on the quality of their work. It is important that they add more details on this as it accounts for 54% of the overall requested budget. This also raises concern on the sustainability of the project and if they are able to scale in the future. Other items of the budget included an allocation towards a research team, the requested amount seems unreasonable as it was unclear on how the total amount was calculated. The proposer also included funds for risk management. Although this also appeared to be vague, it shows that the project has considered the challenges and risks relevant to a successful implementation.", "q1r": 4, "q2": "The proposal clearly identified problem and provided detailed solution. The roadmap presented was clear, concise and had realistic timeframes. It was also evident that that the proposer understands how to monitor their progress in each phase as there was adequate use of KPI’s and key metrics to define their success. The information provided was sufficient, clear and was easy to audit.", "q2r": 4, "assessor": "z_assessor_1953", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Our solution make Crypto projects' review and create groups of basic/advance/expert questions, according to vcoincheck's a standard format.", "experience": "Our team members joined and invested Crypto market in 2017. We have experience in research and study Cardano blockchain and other blockchain platforms.\nAccording to our experience, we have made a lot of webinars to share our knowledge to community."}