{"id": 404917, "author": "dao.coders", "title": "DAO-NET & A2T Marketing", "url": "https://cardano.ideascale.com/a/dtd/404917-48088", "category": 26441, "amount": 33000, "description": "Attracting new members to the Cardano community requires additional approaches to just Community Hubs.", "funded": 1, "upvotes": 27435887, "downvotes": 16825186, "votes_result": 10610701, "votes_cast": 94, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 258, "q0": "Exploring alternative challenge categories is a core focus, and this presents a well thought out case for marketing needs beyond existing challenges. As this proposal focuses directly on the marketing for the proposers organization, the impact to the broader community is likely minimized over a marketing toolkit for others. There are far more risks than outlined and I would look for more insight from the proposer on these risks. Items like leadership succession planning, ROA, marketing message feedback loops are all large risks to account and plan for. ", "q0r": 3, "q1": "The feasibility in execution for this proposal seems quite solid if funded, as there shouldn’t be any problem hiring a marketing professional and letting them try some different marketing messages. I was surprised to not see a request for ad spend, but it would make sense that early marketing would be organic and more direct than targeted ads. My concerns lie mostly in tracking the progress and seeing the feasibility yield impact for the community.", "q1r": 5, "q2": "There has been a good deal of thought put into creating a transparent system for data. Marketing data is complex and hard to analyze with subjective “narratives” and I am glad to see clear KPI’s here. $5 is a good starting point for “CAC” into the ecosystem with an unknown campaign. The main piece of transparency would be around what defines a Cardano Ecosystem member, is it ADA in a new wallet? Catalyst Participant? Social media follower? This seems lacking and is the crux on their reporting numbers. ", "q2r": 4, "assessor": "z_assessor_1122", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3471, "q0": "Proposer has stated quite clearly the details related to the problem so that the voters can clearly see the problem and then offer the team's solution. The information related to the proposer such as the project's features are 12 related marketing proposals, how the project works on Cardano or how this proposal will solve the problem is also given quite good information. Besides, the proposer has also given the risk for this proposal and has a way to minimize this risk.", "q0r": 5, "q1": "Proposer provided a general roadmap but not a detailed one, more information such as activities in Develop marketing campaign should be provided to make this proposal be clearer. Similarity, the information about the budget breakdown is too sketchy. The proposer must clarify the expenses in each item and state the amount to be paid for each of them. Providing a detailed budget breakdown will help voters see whether the spending is reasonable or not as well as the direction of the cash flow. Profiles of key team members have been provided quite well, however, Marketing Professional information should be provided more.", "q1r": 3, "q2": "The goal of the project is not clear when it is expected to have 6,600 members for the first 3 months, even the proposer provides a larger dream number. This helps voters to clearly see the purpose that this project is aiming for. However, the proposer can provide additional quantitative indicators to measure the development or progress of the project.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6709, "q0": "This proposal essentially targets the marketing campaign to promote their DAO-NET & A2T (Alternative to Tyranny) product suites and hence targets to onboard more non blockchain space users to Cardano. Therefore, it will both have an impact on Cardano and help the team to find users/contributors for their suite of proposals. The proposal team has a bunch of other proposals in this challenge and already got a funded DAO proposal in F7.\n\nIn my opinion the team has done a good job in splitting their proposals into multiple tiny ones, and this proposal specifically wants to use a marketing professional to fulfill this proposal's scope. Hence this proposal funding request. \n\nI agree that for any new set of products/services one of the biggest challenges is to have significant efforts/funding in marketing and sales. Therefore, this team has targeted this specific proposal to catalyze promotion of their other projects (developed software will be open source) and the ones that potentially could get funded in this round. \n\nThe proposal has done a good job explaining why this is NOT a good fit for other settings such as B2B/C OR  scale-up cardano community hubs, and that miscellaneous challenge settings is the only place where it fits perfectly. Therefore, I strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer has provided the budget breakdown and majority of the asked funding is for a marketing professional, whom they plan to hire if this project gets funded. Nevertheless, unlike technical implementation projects, I do not see this necessarily a setback or an area of concern because whoever they hire needs to be a professional and have good understanding of blockchain space (even better if cardano). Additionally, the product manager public Linked in profile is provided and has a good experience with IT and product management, as well as has been vCA in Project catalyst. \n\nThe timeline for the marketing proposal has been provided on a monthly basis and October 2022 is expected to be the time when the community can evaluate results of the marketing campaign. Also a town hall will be organized to present these findings and identify improvement areas. \n\nMoreover, the risk/challenges section mentions that this is a very low risk proposal, however, as since this is heavily dependent upon the marketing professional, I see the hired person skills (when he gets hired, how much experience he has, relevant experience w.r.t Cardano) as a risk area as well. Nevertheless, overall a really well written proposal and I therefore, agree that this proposal is likely to succeed.\n", "q1r": 4, "q2": "The success criteria of this project will be measured against how many users are eventually onboarded to DAO NET products suite and hence to Cardano. The quantifiable number of 33k users is targeted, which essentially puts the ROI to $1 per user, as the total fund asked is $33k. \n\nMoreover, The proposer has  mentioned that the campaign development, from the beginning until the evaluation results, will be done in an Agile manner, therefore, a weekly or biweekly progress will be reported to the community. The deliverables will be clearly mentioned in a quantifiable manner, and since the community has a good understanding of the entire timeline of this proposal (monthly deliverables/milestones), I strongly agree that this project is highly auditable. \n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Expedite the growth of the Cardano community by developing a marketing campaign for the DAO-NET & A2T suites targeting non-blockchain users.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals."}