{"id": 405071, "author": "victorcorcino", "title": "Loxe Inc. Web HR Internship", "url": "https://cardano.ideascale.com/a/dtd/405071-48088", "category": 26441, "amount": 9000, "description": "Catalyst and the inner workings of Cardano-focused companies are alien to HR professionals.", "funded": 1, "upvotes": 34949180, "downvotes": 13415869, "votes_result": 21533311, "votes_cast": 144, "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 7465, "q0": "This proposal is very interesting and totally fits the challenge to which it was submitted. In this challenge, we seek to finance projects that do not fit into any other challenge of the fund, but that are still of high value to Cardano, helping, in some way, our blockchain to grow, become popular and be adopted by different initiatives/people/ companies and etc. The idea here is to provide a paid internship in the area of ​​human resources, in which the intern would work at the company Loxe Inc., which is a remote company that uses Cardano’s blockchain to develop its projects. I see many positive points for which we should finance this proposal. 1) Indeed, as the proponents say, Cardano and blockchain in general still offer few opportunities for professionals who are not in the fields of technology (programming, design, etc.), law or business. Human resources students are certainly a key part of our ecosystem, as they can become professionals who help the company in non-technical issues when it comes to technology, but in relation to the behavior, satisfaction and performance of the professionals employed. I think that as important as having professionals trained in a technical way, is that we also have people with the appropriate psychological profile for the position in which they work; people who are satisfied with their work, so that they do their tasks willingly and carefully; people who get along well with their bosses and co-workers. It is also essential that these people can be selected in the most humane and fair way possible, that is, I truly believe that professionals in this area are fundamental to the success of any company, this also includes those who work with Cardano. 2) The second positive point I identified here is the company itself (Loxe Inc.). I believe that this company is of high value to our ecosystem, since it is made up of competent professionals who have already shown service through tools for their own community or projects that were financed through Catalyst and are currently in operation, such as the Win platform. win. I think this team will probably make a great introduction to their interns about what blockchain is and what are the differences and advantages of Cardano over other blockchains. This will certainly generate future professionals who will remain in the community, contributing to the realization of projects that will make Cardano widely adopted in the near future, if all goes well. Anyway, I think that the proposal will have a very positive and considerable impact for Cardano, really deserving the maximum score in this regard. \n", "q0r": 5, "q1": "The roadmap for this project is very simple, but as it is not such a complex proposal, it is possible to fully understand what will happen based on the information given. The months of August and September would be destined for the dissemination of the internship. One suggestion I can make to the proponents is that they specify where this disclosure would take place. Would it be through sites like linkedin, communication channels in our community, like Discord and Telegram? Afterwards, the months from October to December would correspond to the stages themselves. I think it would also be nice if the proponents explained which projects they intend to involve their interns in. In other words, the script is good, but in my opinion it could have given a little more detail, so that we had a deeper understanding of what is to come. Still, as I said, it is very clear what activities will be developed and when, due to the simple nature of the proposal. In terms of funding, USD 9,000 is requested, which, in my opinion, is quite consistent with the magnitude and benefits that this proposal will generate for Cardano. We know very well how this money would be used: for interns' grants, payment for training provided by Loxe Inc.'s professionals, equipment (computers) given to university students, etc. About this part, I think the presentation of the information was adequate, I don't think it would be necessary to go into more detail. Finally, speaking of the team, it is the team of Loxe Inc: Matthias Sieber, Ganesh N, Victor Corcino and Eli Selkin. Total trust is passed on in this team, since we have a good level of detail about their careers, we know in which area they work as well as what jobs they have developed previously. As I said about the impact, because it is a company that already executes projects that involve Cardano's technologies, a lot of confidence is automatically passed on in its ability to carry out the project successfully. They are experienced and highly qualified. Therefore, I think the feasibility of the project is great, my only suggestion would be to delve a little deeper into the script, but there is no lack of information so that we can solidly understand what will be done, nor by whom or for how much money, so I will give it a note. maximum once again. \n", "q1r": 5, "q2": "Regarding the process, the proponents explain very well how the small advances of this project will be audited. They state that “we will use the Agile methodology to manage and track our progress in the development of this project”. That is, they have already defined a way of organizing, planning and auditing the small steps that they will need to follow so that the desired partial results are obtained. My suggestion here would be that they explain a little about the Agile methodology, which I believe, like me, most readers of the proposal are unaware of. It is very clear how they will make the Cardano community and the IOG coordinators aware of the small progress: through reports and monthly meetings, which I believe will contain updates both on the tasks that would be being done in that period of time and the partial results obtained. . Now, talking about the final results, I think the proponents also give enough information about how this could be measured by the Cardano community. We know what the main goal is: that two interns from the human resources area are working and learning about Cardano in practice, and with that they become active members of the community and contribute to the development of future projects. We also know specific KPIs that make this objective measurable, such as “Number of applicants per vacancy: > 10 + Number of interns selected: 2”. My suggestion here is this: it would be very positive if the team at Loxe Inc. (it wouldn't have to be all of them, just a few professionals or even just one) make an overview after the internship period, reporting how the experience was and how the interns showed interest in Cardano and how they will act for the community from now on . I think that autability here is very safe, even because it is a simpler proposal, so it is also simpler to monitor it, and I also think that the proponents make it very clear how the bridge between them and our community will be; that is, everything is in order. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1101, "q0": "It is reasonable to use the miscellaneous challenge to propose funding for an internship. None of the other challenges in Fund 8 arguably fit this request, though it is conceivable that funding for internships could fall under education/training themed challenges in the future.", "q0r": 4, "q1": "The team presented has experience and familiarity with blockchain technology, some success implimenting projects on Cardano, and could doubtless provide two interns with some useful training, expanding familiarity with Cardano among future professionals. This is basic capacity building, and it is promising to see a proposal for it.\n\nIn fact, I could see a strong justification for a higher level of funding for a proposal like this. Low-paid internships tend to exclude candidates who lack alternative financial resources. And a few thousand over three months is not much, and compensating interns well would fit Cardano's greater mission as it relates to providing opportunities for everyone. It's also reasonable to want Cardano internships to be appealing so as to attract top-shelf young talent.", "q1r": 5, "q2": "The question of auditing this proposal should be simple: Was there a healthy number of candidates, were the two interns hired, and what did they accomplish while employed? The proposers describe exactly this duty and it should be simple for auditors to check on later.", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1268, "q0": "This proposal does fit into the challenge category and it addresses the challenge. This is a low risk, low impact proposal in my opinion. The amount of marketing that goes into spreading the word about the internship creates the most obvious impact. The next factor is the funnelling procedure of the unselected candidates into the catalyst ecosystem. And lastly the selected interns could possibly become integrated members of the Cardano community. I believe that the exposure created for Cardano in the process would be in the range of 2-150 members.\n", "q0r": 3, "q1": "Yes, the team is already building on Cardano and is extremely well experienced to implement the proposal.\nI also believe that working with the team will provide the selected interns the right kind of tools and education to take their careers forward in the field of blockchain tech or cardano in particular.", "q1r": 5, "q2": "The audibility is clear and sufficient to measure the success of the proposal.\nOne question I have is about directing the unselected candidates to catalyst. Is project catalyst just mentioned to them or is there a process involved ?", "q2r": 4, "assessor": "z_assessor_1330", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1463, "q0": "The proposal effectively addresses the need for students with an interest in cryptocurrencies and the blockchain who are going into HR to have exposure to real world professional experience working for a company on the Cardano blockchain.", "q0r": 4, "q1": "I believe that given the parameters of how their plan will be implemented coupled with the background and experience of the leadership submitting the proposal, that they will be successful in executing the plan in this proposal. ", "q1r": 4, "q2": "Given that this is not a highly complicated proposal and seems pretty straight forward in their plans to implement this, I would say the metrics that they have put in place to measure their success seems to be sufficient in being able to audit their progress and merits advancing. ", "q2r": 4, "assessor": "z_assessor_1369", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4608, "q0": "As Requirement of HR professionals is needed in all categories of companies, since there is no connection for HR's with related to block chain is a tragic one ,So the idea of providing paid internship will be definitely boost to Cardano ideas, where these intern HR's can be recruited later , and there won't be difficultly in making them understand their role towards cardano, with the gained experience they can even promote the cardano related projects which will be beneficiary for future cardano's project , hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Since the presented idea doesn't have much of challenging aspects where many students would love to have a paid internship where they can get beneficiary of both learning and paid.\nLoxe Inc. team has great experience and have won many design hackathons previously so conducted HR internship is not a big challenge for such a team, The team members have worked in Gimbalabs PPBL where they can share their experience to young people which will be  beneficiary to Interns, hence with given experience and plan presented it is highly likely this proposal will be implemented successfully\n", "q1r": 5, "q2": "The proposer has mentioned why there is requirement of HR's in the block chain, and how these internships will be useful in future aspects of block chain, the proposal contains all the important team members of the project with their experiences.\nThe proposal even contains simple timeline and break down of budget clearly , the proposal even contains good key indicators to measure the success of the business ,hence \nthe information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9955, "q0": "I agree that the problem that this proposal is presenting do not fit into any challenges set by this Fund 8. I do believe this proposal will somehow solve the problem that the presenter is suggesting. However, the solution to the problem focuses on a very small scale, and I do not think that this is a sustainable measurement for the lack of awareness about Cardano in the HR professionals community. They might addresses the challenge they presented in the proposal better if they thought of some ways to implement mass adoption for this solution. Ten candidates and two selected interns are not an exciting number of young HR professionals.", "q0r": 3, "q1": "The company suggesting this problem has experience in developing Cardano sollutions as they have been funded during Fund 6 and Fund 7. The proposal presents a simple and applicable method. I agree that the company will not find any hardships to obtain candidates for this intership, and the problem comes with this solution is not a massive one. I think they will be able to implement this proposal successfully.", "q1r": 5, "q2": "Everything I need to know is informed in this proposal. Moreover, more information is provided on the company's website, so I am pleased with what I have learned about this project. One additional suggestion is that instead of putting more information on the company's website, the presenter should include them in the proposal so that the proposal could be more informative and in-length.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Provide HR students the opportunity to explore a modern remote-only, highly distributed, multi-cultural company to co-create processes.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer."}