{"id": 380930, "author": "torben", "title": "Trustful Global Projects", "url": "https://cardano.ideascale.com/a/dtd/380930-48088", "category": 26240, "amount": 80100, "description": "Desenvolvedores e clientes querem trabalhar juntos com sucesso, mas fazer acordos ou pagamentos internacionais é complicado.", "funded": 1, "upvotes": 26222273, "downvotes": 19472003, "votes_result": 6750270, "votes_cast": 157, "f6_no_assessments": 7, "f6_rating": 3.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"q0": "Gostaria de parabenizar o autor por esta proposta, além de ser uma ótima adequação ao objetivo do desafio, está muito bem escrita, a informação é dada da maneira que deveria ser: de forma direta, sucinta e clara. A proposta é perfeita para o desafio porque procura criar uma plataforma que registre uma série de informações sobre a execução de um projeto na cadeia de bloqueio Cardano, como o autor cita: \"especificação do software, escopo do projeto, cronograma do projeto\" e etc. Isto atende muito bem ao desafio que certamente aumentará a confiabilidade das transações para aqueles que não podem contratar um intermediário externo para trabalhar em seus projetos, e o autor argumenta muito bem a importância da criação de tal produto. Muitas vezes, aqueles que querem executar o projeto não o fazem por falta de confiança no que é apresentado, enquanto os desenvolvedores também podem se sentir inseguros sobre o pagamento que é prometido. Estes e muitos outros detalhes estão realmente impedindo o sucesso de alguns projetos, portanto, preencher estas lacunas não só agregará valor à nossa cadeia de bloqueio, mas também aumentará o número de projetos envolvendo as várias instâncias do universo Cardano. O autor deixa muito claro quais são seus objetivos com o desenvolvimento desta plataforma através de tópicos, a fim de sintetizar e reforçar o que é explicado ao longo da primeira parte da proposta e perfeitamente alinhado com o que é pedido no desafio. Além de tudo isso, ao final dos processos, o NFT ainda seria gerado, agregando ainda mais valor à proposta.", "q0r": 5, "q1": "Certamente este projeto está em boas mãos, até porque ele foi perfeitamente apresentado e descrito aqui. Conhecemos as áreas de especialização do autor principal e também os outros componentes que compõem a equipe, no entanto, seria benéfico se fossemos mais detalhados sobre cada um deles, pois o que temos é apenas o que temos e seus nomes e funções. É sempre interessante saber quais são suas experiências anteriores, exemplos de projetos que já fizeram, há quanto tempo estão na área, etc., e isto poderia ser contado por um pequeno texto para cada membro da equipe ou mesmo anexando seus perfis vinculados. Quanto ao que será feito, por quanto tempo e em que ordem, nos é dada uma discriminação em meses e as principais tarefas que serão realizadas nesses períodos de tempo, mas como se trata de um projeto muito extenso e complexo, seria importante que estas etapas fossem ainda mais detalhadas. Por exemplo, penso em como seria a comercialização deste projeto, é um produto muito bom e cheio de potencial, mas como ele chegaria ao conhecimento dos desenvolvedores? E como seriam apresentadas as vantagens de seu uso? A parte da divulgação não foi explicada aqui, eu perdi isso, além de detalhar as tarefas mencionadas. Da mesma forma, também seria positivo se fosse mais detalhado como o dinheiro do financiamento seria utilizado, temos uma discriminação do dinheiro para determinados fins, mas o autor poderia esclarecer mais como cada um deles aconteceria. Citarei novamente a parte de marketing, como seriam aplicados os US$ 4.300? O salário de alguém que iria trabalhar com ele, mais a publicidade paga em qualquer canal, se for o caso, qual deles?", "q1r": 3, "q2": "Para mim, esta era a parte que mais se desejava na proposta. O projeto é muito grande e complexo, exigindo, portanto, um acompanhamento contínuo e próximo. Há muitas atividades acontecendo e um longo período de tempo, e já sabemos, de forma aproximada, quais são as intenções de cada coisa a acontecer a cada mês. Assim, por exemplo, poderia ser determinado realizar reuniões periódicas com alguns membros da comunidade tecnicamente capazes de monitorar o progresso do projeto, a fim de verificar se tudo está sendo feito como prometido e dentro dos prazos previstos. E se não, detectar as falhas e, coletivamente, conceber formas de resolvê-las. Além disso, seria benéfico para a equipe apresentar os resultados progressivamente, ou seja, se ao longo dos meses os dados fossem mostrados e o status atual exato do projeto fosse explicado. É positivo que o autor determine sua intenção de usuário, de 9 a 12 meses 200 desenvolvedores fixos usando a ferramenta e 1000 quando o projeto já está bem encaminhado, esta é uma forma de medir o sucesso. Outra forma que pensei seria perceber quantas associações com ID Atala Prism seriam feitas por conta deste projeto, de modo que seria possível monitorar de outra perspectiva o sucesso da ferramenta.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Excellent proposal regarding a much-needed application.  Blockchain technology holds much promise but proper interfacing with existing legal and contractual frameworks is an important infrastructural need.  The proposes describe a system that would allow developers and entrepreneurs to find matches and complete contracts in a seamless manner.  Successful execution would strengthen the Cardano ecosystem development environment.", "q0r": 5, "q1": "This is a challenging proposal with many difficult components.  The proposers have clearly described how they will approach the development of the project but even if well executed there may be challenges which are difficult to overcome in the first year.  Nevertheless, this is a worthwhile endeavor to support.", "q1r": 4, "q2": "The team has articulated specific goals for 6, 9, 12 months and beyond.  The team and budget are well described so there is a clear expectation of who will be working on the project and what their responsibilities are for succcess.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": " The idea is not specific for Cardano and can be generalized for any decentralized activity. the software proposed to be built will enable developers and proposers to work in a trust-less environment. The dispute resolution mechanism needs more clarity. If there is a dispute regarding the completion of work. How will the system handles the issue will determine the success of the system. However, the proposal is addressing an important challenge in this ecosystem. ", "q0r": 4, "q1": "The team claims more than ten years of software and blockchain development experience. The idea has been clearly articulated and feasible. There will be a  requirement for a set of smart contracts for performing the role of intermediaries. The requirement of oracles authenticating status update and compliance to specification to work do need clarification. However, the team seems to have enough capability in overcoming the problem. References to past work would have added immense help for evaluating the proposal. decentralized environment. ", "q1r": 5, "q2": "The proposal includes detailed timelines and budget breakup. The work to be done is clear and can be measured in a quantitative manner. The end state is also clear. The project can be audited and successes can be easily measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "This is one of the necessary ideas to help develop the Cardano ecosystem. It will protect the benefit of both developers and product owners to the successful product that both want to get. This idea will not just be for Cardano ecosystem only but also worldwide because of its crises that happens every day on traditional platforms. Hence, this idea will drive a lot of user to join and bring a big effect on Cardano ecosystem. Their goals also can promise about that impact. ", "q0r": 5, "q1": "The team has a very detailed roadmap that divides into 2 phases of implementing their plan, and all the detailed broken-down budget is reasonable for that plan. We can visualize their roadmap through \"Goals\" session in the proposal, and all are clear with the activities and numbers. \r\nHence, the budget they require is fitted with that timeline and be detailed in the field of activities. \r\nThe only thing I advise them is that they should give more info about the team members and some risks that they are aware to control. It will help Catalyst make a high assessment of their plan. ", "q1r": 4, "q2": "The team has enough roadmap detail and key metrics that help to audit this project easily. \r\nThey also have a well aware about the problem context and make a better solution by time to help improve Catalyst development. And that is very easy to understand what they gonna do. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal to help create an environment that connects dapp developers with their customers is an encouraging idea. This helps to accelerate the application of dapps by customers, reduce the cost of advertising projects to customers, and this communication skill is not good for every project or has a professional team. .", "q0r": 4, "q1": "A good idea needs a detailed plan and strategy to make it work, which is what complements your proposal. Having a more detailed plan, a strategy to attract the free community as well as organizations in need should be done properly from the beginning. In addition, you need to have clearer KPIs for each stage that show the feasibility and persuasiveness of the project.", "q1r": 3, "q2": "I see a good profile of the team member, however it is recommended to add the member's public information through the profile: Github, Linkedin or related certificates. In addition, you should officially announce the youtube channel or website so that the community can comment, as well as check the project progress.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a good idea that could add value and positive impact to the Cardano ecosystem if it comes to life. It's good to have a platform that will connect customers and developers. The plan is described in detail and could have a global impact because that was the idea from the beginning, connecting clients and developers around the world. Again it can operate at the local level ass well, there is no concept.", "q0r": 3, "q1": "The plan is well made, described, but it is not clear when the whole idea will start with realization and when it will be finished in terms of Q1 2022 or Q2 2022 and so on. The plan is divided by months but in my opinion does not give 100% certainty that it will be executed. Although it was suggested in the comments to provide information about the team for some reason that did not happen which further raises my suspicions. It is not clear that the team really exists because they didn't provide any links of LinkedIn or Github page.", "q1r": 1, "q2": "Due to the poorly set roadmap with dates, my opinion it is very difficult to follow the progress of this idea. The amount of money required given that we have no real insight into the team behind this idea i think is exaggerated. If we consider that the budget for this Catayst F7 is $250,000. The suggestion in the comments was that the funds should be brake up and that funds should be reqested in the upcoming Catalysts, but for some reason the suggestion was not taken in consediration. KPIs are missing in this proposal!", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has great idea about connecting the customers and developers. It helps developers having job and customer find what they need and save time. I would like to see more attractive ideas to attract more users in the first stage of the project. ", "q0r": 3, "q1": "In my opinion, the proposal mentions about ways to increase users, but not give a detailed marketing plan to attract freelance developers in the first stage. Therefore, some clear system or procedures should be considered to make this proposal effective and raise prestige. ", "q1r": 3, "q2": "The proposal gives a clear roadmap and goals. However, it should list out the number of developers and customers participating in the platform which makes it easier for auditing. Also, the proposal should give a more detailed background of the core team by putting Linkedin, Github or any related sources for gaining trust. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Fornecer uma plataforma para a execução de contratos automatizados, invioláveis e verificados (pagamentos, marcos, legais). Construir confiança entre as partes", "experience": "10+ anos de desenvolvimento de software, 5+ anos empresário, Plutus & Atala Pioneer, desenvolvedor de blocos"}