{"id": 380940, "author": "wvalthar", "title": "@chain-lib bundle selling component", "url": "https://cardano.ideascale.com/a/dtd/380940-48088", "category": 26240, "amount": 15439, "description": "Deve ser fácil vender fichas e pacotes de fichas em seu site sem ser um especialista técnico.", "funded": 0, "upvotes": 14586436, "downvotes": 17202888, "votes_result": 2616452, "votes_cast": 143, "f6_no_assessments": 6, "f6_rating": 1.5555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The same with other proposal of this team, the problem that the team proposes is within this challenge. But there is no info in the proposal that shows their project will add more value to the Cardano ecosystem, even they don't have any key metrics. \r\nFor this idea, my recommendation about key metrics they can choose is about the number of project will launch to sell token, total value in the market by time, active wallet... that all will show how this project aligns with the challenge. ", "q0r": 2, "q1": "Can't score the feasibility of this project. The team provides a GitHub but I don't know what it will be used for. \r\nMoreover, they don't have a roadmap and KPI to show their detailed step-to-step of developing this project. So, it is hard to assess that their budget is reasonable. ", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 0, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Proposer provides a clear description of an issue in their Problem Statement? The problem statement defines a problem within the challenge which needs to be solved in a clear way and the whole idea is great. The idea/project is great and definitely has a positive impact and could add value on the Cardano / Catalyst ecosystem. It would be good to have KPIs, so that we can compare KPIs with challenge setting. ", "q0r": 3, "q1": "The proposition lists the required experience / skil and that is very good and a link from Github is posted. It would also be good to set up links that provided evidence of relevant skills and experience needed to implement the proposal like LinkedIn. Budget is outlined clearly, understandable but it would be good to have more information about the team and how the whole project will be performed. Considering the budget it is reasonable to achieve the set goals. There is no mention of additional funding in this proposal and there is no detailed implementation plan. Details of actionable tasks and order of execution are not given which does not instill confidence. This proposal offers a realistic timetable to complete the work, but the question arises as to how the project will be implemented if we take into account that the same person writes 6 proposals and the required datas are missing. It would be good to list the necessary resources for implementation in the project, although it mentions what the budget would be allocated to. We do not have a clear explanation for technical aspects such as architecture, language and technologies for implementation. There is no mention of risks and how to approach the risks if they arise.", "q1r": 1, "q2": "It would be good to have a roadmap with milestones so we can follow the project. The timeframes in which the project will be completed are given, but it would be much better if the dates were given also. It is better to have KPIs as well, because that would give us security and realization, monitoring of the project.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has a problem that within the challenge but has nothing in detail. It doesn't have info about how it will impact on Cardano ecosystem. \r\nIt also doesn't have any key metrics or plans to measure whether what this idea brings is meet the challenge or not. ", "q0r": 2, "q1": "This proposal lack all basic info for assessing the feasibility. The short brief is not enough for assessing. They should inclcude: \r\n- Detailed implementation plan for knowing what they will do with their solution to address the problem. Not just about the features, but also includes use cases, technology explanation, marketing, activities... the more detail is great\r\n- Detailed roadmap and budget to assess that are they reasonable with plan or not \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. \r\n", "q1r": 1, "q2": "Cannot scoring the auditability of this proposal because it lacks everything for that. For auditing the progress and success of the proposal, it must have: \r\n- A roadmap with milestones and a time horizon for achievement. And metrics/KPIs that define the success of the proposal. Those 2 will help Catalyst track and audit in periods. \r\n- Clear understandable description of the targeted problem. And the clear understandable solution that addresses the problem. These 2 will help to know what is this proposal expects up front. \r\nThis proposal have none of them. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "The proposer only shows problem, solution that can help to solve and few words to over what they want to to that hard to well understand to assessing what he want. Also, he doesn't provide any key metric or info to prove that this solution will help the Cardano ecosystem. This proposal failed to impact. ", "q0r": 1, "q1": "There is only a short over about the solution this proposal wants to show and an introduction about already-made open-source of the team that can't understand how it can help this project. My advice for this team is to have a good proposal and enough materials for assessing the feasibility they must give info about a detailed plan they will do, roadmap that with a clear timeline of activities will get instead of just 2 milestone of 6 months and 12 months, clarify team member info for more trust, the budget that is reasonable with the plan and roadmap, risk-relevant that team will face off. Technically, this idea of the project will have a lot of technical stuff but they don't describe any of them, including smart contract, protocol... even more in the user point of view including UX/UI, user cases... ", "q1r": 1, "q2": "The proposer provide nothing in this proposal to audit it. \r\nNo plan, no roadmap, no key metrics in this proposal.\r\nThere is also no info about the problem explanation and no info to say how the solution can help to solve the problem.", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about creating a web component that allows you to put items inside a bundle and set a price to sell it for via smart contract. The problem is not clearly described, and explained in detail [why is this problem is worth solving?]. The solution is defined, with potential impact in short term and long term. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "Team [Chain-lib] profile is provided and described enough for understanding with suitable skill and experiences for implementation. However, it is hard to verify the ability and experiences of each member. There is no information on demo/pilot/similar works done by this team. The budget is provided with items structure and explanations of calculation base. KPIs and Risk (and mitigation) were not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lack of information: (1) Team member's profile and external links for verification; (2) KPIs, (3) Risk (and mitigation). Besides, there is no information on demo/pilot/similar works done by this team. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This proposal deals with Creating a web component that allows you to place items inside a bundle and set a price to sell it through a smart coin. This proposal raises an interesting problem but is not made legally valid, only the problem is raised. it would be great if there is a solution tool and schedule constraint.", "q0r": 2, "q1": "The team says they have experience involving Novella / Cardano Keys Developer, SPO, Alanzo Purple tester, Plutus Pioneer 1 and have built some components inside the github repo. but apart from the gifhub link that was last active 2 weeks ago, there is no update, no identification information or member count. Funding is divided into 3 parts but there is no specific use plan and these issues cannot be verified", "q1r": 1, "q2": "The proposal has not provided any key metrics/KPIs or solutions to determine if the proposal is successful", "q2r": 1, "assessor": "z_assessor_706", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Criar um componente web que permita colocar itens dentro de um pacote e estabelecer um preço para vendê-lo através de um contrato inteligente.", "experience": "Novella / Cardano Keys Developer, SPO, Alanzo Purple tester, Plutus Pioneer 1, e já construiu vários componentes dentro do repo github."}