{"id": 380937, "author": "wvalthar", "title": "@chain-lib Token mint/sell any site", "url": "https://cardano.ideascale.com/a/dtd/380937-48088", "category": 26240, "amount": 14907, "description": "A cunhagem e a venda de NFTs deve ser um processo contínuo do qual todos possam fazer parte.", "funded": 0, "upvotes": 14567617, "downvotes": 18167915, "votes_result": 3600298, "votes_cast": 135, "f6_no_assessments": 3, "f6_rating": 1.8888888888888886, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem that the team proposes is within this challenge. But there is no info in the proposal that shows their project will add more value to the Cardano ecosystem, even they don't have any key metrics. \r\nFor this idea, my recommendation about key metrics they can choose is about the number of NFTs or set of NFTs be mint, how many assets be traded on market, how many active wallets to the system, total value in the market by time... that all will show how this project aligns with the challenge. ", "q0r": 2, "q1": "Can't score the feasibility of this project. The team provides a GitHub but I don't know what it will be used for. \r\nMoreover, they don't have a roadmap and KPI to show their detailed step-to-step of developing this project. So, it is hard to assess that their budget is reasonable. ", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 0, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal clearly points out the problem and offers an excellent solution to that problem. Very nice idea. Minting and selling NFTs is certainly a very important so that the Cardano ecosystem must have it in order to keep up with the new technologies. The proposal clearly articulates and explains how it will add value to the Cardano ecosystem and that is awesome. In proposal we can't find KPIs, so it's hard to compare KPIs with challenge setting,", "q0r": 3, "q1": "The required experience and skills for this proposal are listed and whoever has them could complete this project. A Github link has been set up but we do not have a link about the team that will work on this project so we do not know who is behind this idea. Proposer does not name a team of people so it is not clear whether he will work on this project alone or will subsequently look for a team. Considering the budget, everything is clearly shown. It is still unknown whether a team of people will work on this project. It would be good to have some information about the team. As shown in the proposal, the budget seems acceptable and the goal could be achieved. The proposal does not require additional funding for this project. The feasible plan exists but is not detailed and it would be good if there was more information on the feasibility of the plan. In this way, they would have more certainty in the feasibility of the project itself. It would be good to have details of actionable tasks and order of execution so we would get extra confidence in the project. The proposal offers a realistic timetable to complete the work but I am not sure how the project will be financed and finished because they lack data. The plan describes the resources for the implementation of the proposal and the proposal clearly explains the technical aspects required for realization. It would be good to add potential risks to the Definition of Success and how to deal with those risks.", "q1r": 1, "q2": "Proposal has a roadmap with a time frame of 6 months and 12 months but has no idea how the project will unfold. What will happen within those time frames. It would be good to make a detailed roadmap with milestones and KPIs so that the community has a better insight into the project and so that the success of the project can be monitored.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about creating a web component that anyone can use to mint nfts / sets of nfts, and immediately put them in a smart contract to display & sell. The problem is not clearly described, and explained in detail. The solution is defined, with potential impact in short term and long term. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "Team [Chain lib] profile is provided and described enough for understanding with suitable skill and experiences for implementation. There is no information on demo/pilot. The budget is provided with items structure and explanations of calculation base. Roadmap (and KPIs), Risk (and mitigation) were not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lack of information: (1) Team member's profile; (2) Roadmap (and KPIs), (3) Risk (and mitigation). Besides, there is no information on demo/pilot/similar works done by this team. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Criar um componente web que qualquer pessoa pode usar para cunhar nfts / conjuntos de nfts, e imediatamente colocá-los em um contrato inteligente para exibir e vender.", "experience": "Novella / Cardano Keys Developer, SPO, Alanzo Purple tester, Plutus Pioneer 1, e já construiu vários componentes dentro do repo github."}