{"id": 382035, "author": "jcaso", "title": "C64 Extension Wallet", "url": "https://cardano.ideascale.com/a/dtd/382035-48088", "category": 26240, "amount": 19660, "description": "Extensão de carteira que proporciona uma experiência soberana e personalizada para os usuários e devs, apoiando P2P, NFT, Identidade, Votação como plugins.", "funded": 1, "upvotes": 77413110, "downvotes": 12201552, "votes_result": 65211558, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Sou conselheiro comunitário desde o Fundo 2 e um vCA desde que me lembro (OK, não realmente, do Fundo 3, para ser mais preciso). Também tenho atuado como proponente em alguns fundos de Challenge Setting (tenho idade suficiente para me lembrar quando foram chamados de Community Choice - sim, o nome não prestava). Mas, estou me deixando levar. Esta proposta é prática para o usuário final. Ela visa desenvolver uma carteira de luz cross-browser comunitária com um formato popup que suporta redes de comutação (Testnet - Mainnet - Yeah!!!) e unificar todas elas dentro da mesma ferramenta a partir da mesma conta. O que torna ainda melhor é que os usuários serão capazes de escolher seus próprios pontos finais confiáveis. A carteira de luz cross-browser pode ter um grande impacto se for bem sucedida - especialmente porque os usuários Cardano estão cada vez mais frustrados com o uso de uma carteira de nós completa (sim, estamos olhando para você Daedalus!). A idéia de usar uma carteira de extensão modular progressiva que facilita a adição de novos casos de uso na forma de plugins (alguém disse P2P, NFT, Identidade, votação etc...?) é grande e muito impactante. Se você é eleitor e ainda não verificou https://c64.app/ (o site da carteira C64), faça-o. Eu nem sabia que ela existia. Isto é descentralização. Mais carteiras, mais abordagens, mais resiliência. Todos os interessados se beneficiam.", "q0r": 5, "q1": "O projeto tem uma equipe muito competente por trás dele. Ele inclui um ex-Emurgo DevOps líder. Co-fundador da Gimbalabs, um desenvolvedor de palcos completos, embaixador Cardano, SPO, e um ex-Emurgo Yoroi-móvel, engenheiro de P&D... A equipe é composta por três membros que claramente têm o conhecimento técnico para entregar o resultado. Muitas vezes me preocupo com algumas propostas - que podem morrer lentamente (ou rapidamente) após a entrega, mas o que é realmente encorajador sobre a viabilidade e o crescimento duradouro deste projeto é que a equipe já desenvolveu características futuras que eles pretendem construir e acrescentar com financiamento futuro do Catalyst (em rodadas futuras). A carteira C64 parece ser uma idéia com grande potencial de crescimento - como reconhecido pela equipe proponente. Eles incluíram uma linha de tempo realista dividida em três etapas-chave para a conclusão, enquanto que o orçamento foi dividido em componentes - o que permite um exame mais detalhado do trabalho. Os proponentes incluíram e explicaram os componentes técnicos chave com os quais se apoiarão - e eu adoro o fato de que será crossbrowser Chrome, Brave, Edge e Firefox (provisório). A idéia de incluir demos na proposta foi excelente, além de agradecimentos por incluir perfis Linkedin.\r\n\r\n\r\n", "q1r": 5, "q2": "A equipe proponente tem uma visão clara do que deseja entregar e um caminho claro para entregá-lo. Eles incluíram uma clara e compreensível explicação do que desejam alcançar e a solução proposta é racional e faz muito sentido. A equipe incluiu um cronograma de 6 meses com 14 KPIs que eles querem usar para auditoria e desenvolvimento. O desenvolvimento foi dividido em três grandes fases e com a discriminação detalhada do orçamento - será fácil de auditar. Este é um exemplo de uma proposta clara e bem apresentada.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "O proponente quer construir uma carteira de extensão e sua funcionalidade deve ser expandida com plugins. Assim, dependendo do que você precisa, você pode ampliar sua carteira com. É uma proposta muito interessante e intuitiva, que se enquadra no contexto do desafio. Também gosto que o proponente tenha feito esforços para reduzir o custo desta proposta por meio da combinação de esforços entre a proposta do fundo 5 e a atual. Há um valor implícito trazido ao ecossistema se esta proposta for financiada e implementada, mas a julgar pelo registro anterior deste proponente, não estou preocupado. Serão relatados KPIs a cada duas semanas, como tem sido feito até este momento. O impacto está sempre ligado à escalada de uma solução, e para esta não tenho nenhuma preocupação de que a equipe seja capaz de enfrentar os desafios descritos. Há muitos esforços para a solução deste projeto e isso mostra como não há nenhum atacado na proposta. Este projeto beneficiaria significativamente a comunidade e o ecossistema se implementado conforme descrito, mas acredito que será ainda mais benéfico se for uma colaboração entre alguns poucos projetos com as mesmas idéias. Como dev, não tenho nenhuma preocupação com a implementação da proposta.", "q0r": 5, "q1": "O proponente acrescentou os perfis vinculados dos membros da equipe, o que diz duas coisas. 1. Os proponentes estão prontos para apoiar seu projeto com seus nomes. 2. Isto permite a verificação das habilidades indicadas na proposta. 3. (bônus) traz credibilidade ao projeto. O número de membros do tipo de equipe foi obviamente discutido e está presente na proposta. O orçamento é bem administrado, há uma opção apresentada pelos proponentes, para utilizar os fundos do financiamento anterior de forma mais otimizada, a proposta é financiada também, e estou surpreso com a clareza com que as tarefas do projeto são agrupadas se isso acontecer. Há um cronograma realista para fazer todo o trabalho necessário declarado. O projeto define como será executado e que implementação será utilizada.  Há uma grande descrição dos itens futuros que precisam ser apoiados e que fazem sentido como (suporte de trezor, piquetagem e outros). Há alguns desafios e riscos considerados na proposta. Outra coisa que realmente gostei é a lista de demonstrações, mas vou tocar nisso na seção de auditabilidade. Não tenho certeza se o projeto está em sincronia com outras propostas similares que querem construir plugins separados pelo standad apresentado e ser capazes de implementar uns com os outros em um nível modular, e minha sugestão como desenvolvedor seria dar uma olhada em torno de propostas similares e ver se eles não podem colaborar em algumas características e plugins. De modo geral, uma grande proposta com muito potencial.\r\n", "q1r": 5, "q2": "Não se preocupa com a rastreabilidade do projeto, uma vez que o proponente se comprometeu a dar atualizações de 2 semanas sobre o progresso da solução. O que eu recomendaria é ter um canal de discórdia ou telegrama para obter feedback diretamente da comunidade, se necessário, mas isso não é de forma alguma obrigatório. Eu realmente gosto da longa lista de KPIs mencionada no texto da proposta. Eles trazem validade ao esforço que está sendo feito porque são tão relevantes para o sucesso dos projetos. O roteiro e os marcos também estão presentes e serão visíveis para a comunidade que quiser seguir em frente. Vejo uma definição clara de um problema e uma compreensão realmente técnica e profunda da solução proposta.   Desejo boa sorte ao autor na fase de votação. É uma boa proposta!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "There is a need for lite wallets to provide more options to end users and developers for experimentation. The proposal will also provide Cardano Backend tools for the community to use and will decrease the dependency on a single entity for providing backend for lite wallets. ", "q0r": 4, "q1": "The team C64 which is proposing this project was funded for a desktop wallet which can mint NFTs. The same team is proposing to create a cross browser wallet in Typescript which is considered better for security than the javascript. The team also proposes hosting of Cardano Backend suites for the lite wallets. Based on the experience and the demonstrated capability it is likely that the team will be able to complete the project successfully. ", "q1r": 5, "q2": "The proposal is detailed with clear risk analysis. The dcSparks connector has been released and is successful therefore the proposal should not be facing any technical blocks. The proposal has a clear roadmap and it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This is one of the Cardano wallets that was funded in fund 5 and they still keep developing that proposal. This proposal is an additional part that I think they need to do for more convenience to end-users, increase the user experience is what can increase the results of their KPIs that include both in the old one and this proposal. Therefore, this small project will help the whole bigger project better impact on Cardano ecosystem ", "q0r": 5, "q1": "As I mention, this proposal is an expanding fund for developing their browser extensions, which means that they're running this project and have some results on it. We can check the product through the main website of the project. \r\nAnd the team filled this proposal with the whole project implementation plan that all is clear. Therefore, I absolutely believe that they're doing well and will make this proposal good as they did with the other parts of the project. ", "q1r": 5, "q2": "Info in the proposal is completely enough to help auditing works in this scope of the proposal. They pointed the specific outline in the general roadmap that relates to this proposal clearly and all make sense. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It's great idea to build an extension wallet by adopting the Connector standard from dcSpark for interaction with dapps and Defi services which increases users and devs' experience and the Cardano applicability. Also, this dapps helps Cardano to communicate with other blockchains. The proposer shows a clear roadmap and solutions to build the wallet. This project will definitely help the growth of Cardano community. ", "q0r": 4, "q1": "The proposal has qualified team with experience in developing Cardano, Ermugo and Ardana project which make me believe in the success of implementing this project. The team has a deep understanding of Cardano and their project. They give a clear road map and detailed KPI. Also, I find the requested fund is suitable for their proposal at this stage. ", "q1r": 4, "q2": "It's easy to audit this project as every information related to the implementation of the proposal is clearly stated. They give a detailed timeline for the roadmap,KPI which can be checked on their website and github source. The proposal also gives evidence behind the team backgroud as they are well-known in Cardano community which make this proposal gain more trust. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Projetar e implementar uma carteira de extensão modular progressiva que facilite a adição de novos casos de uso na forma de plugins.", "experience": "A equipe tem ampla experiência profissional como desenvolvedor de pilha completa, processamento em tempo real, aplicações móveis, administração de sistemas, devOps e SPOs."}