{"id": 382294, "author": "torres", "title": "Vertra: tokenized properties market", "url": "https://cardano.ideascale.com/a/dtd/382294-48088", "category": 26240, "amount": 60000, "description": "Como aumentar a liquidez do mercado imobiliário através da tokenization e criar uma nova forma de financiamento através da blockchain.", "funded": 0, "upvotes": 15812993, "downvotes": 16038537, "votes_result": 225544, "votes_cast": 147, "f6_no_assessments": 4, "f6_rating": 2.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta está enfrentando o desafio de quais aplicações serão mais valiosas para os usuários finais em 2022. Ela aborda este assunto, analisando como aumentar a liquidez do mercado imobiliário através da tokenização. Esta declaração de problema pode começar a se tornar pertinente dentro de 2022, pois há uma enorme necessidade de moradia e necessidade de financiá-la, permitindo a tokenização que a torna mais acessível a um público mais amplo.  Exemplos desta solução foram descritos como portadores de token têm acesso a dividendos e inquilinos a um modelo de aluguel para possuir, estes exemplos fornecem clareza sobre como o proponente irá superar a declaração do problema.\r\n\r\nA solução prática proposta pelo Ventra, implementada em Cardano, beneficiaria o ecossistema e a comunidade Cardano e Catalyst, tornando-a mais atraente para os novos participantes e para os portadores de fichas existentes. Seu white-paper afirma que não existe um mercado público para a venda e compra de imóveis apenas privados, tornando um mercado público e seguro a proposta de fato democratizando o financiamento do varejo e eliminando os intermediários que muitas vezes criam uma barreira para a entrada de um recém-chegado em um mercado imobiliário. Ao contrário, o investidor em imóveis terá acesso a um mercado imobiliário mais amplo, que não os limitará a mercados dentro de sua própria localidade geográfica.\r\n\r\nEles mediram um resultado bem sucedido marcando etapas concluídas em seu roteiro, atualmente eles estão na etapa 2 e esboçam o início da etapa 3 no segundo trimestre de 2022. Aí o propsal poderia beneficiar de mais indicadores do que é o sucesso, tais como o número de usuários embarcados, tokens adquiridos, marcos de desenvolvimento mais granulares alcançados e volume de Ada transacionado.\r\n\r\nParece que houve alguma consideração em dimensionar a plataforma que foi delineada no livro branco. O uso de infraestrutura de nuvem na AWS significa que, do ponto de vista técnico, a infraestrutura e o uso do servidor podem ser facilmente escalados. Combinando o front end com o NextJS, a experiência do usuário do front end deve ser rápida. Entretanto, o white paper também menciona que o Elasticsearch será usado como um banco de dados, o padrão usual é ter um banco de dados dedicado e simplesmente usar o Elastic como um índice de busca e ter um banco de dados NoSQL dedicado, como o MongoDB. Seria bom se esta escolha tivesse uma justificativa adicional por trás das tecnologias, é bom que estas tenham sido consideradas escolhas tecnológicas, mas se beneficiariam de uma justificativa adicional. A escala também tem sido considerada em termos de economia do token, um bom exemplo disso é a fracionalização, que permite a participação de investidores de menor escala, permitindo que eles possuam partes marginais de ativos. Se a plataforma desejar escalar para uma base de usuários maior, então permitir participantes menores com fracionamento é essencial.\r\n\r\n", "q0r": 4, "q1": "A Vertra tem muita experiência no mercado varejista e está bem posicionada para entender como este mercado imobiliário tokenizado funcionará. No entanto, parece haver uma falta de conhecimento técnico exibido na proposta e quem podem ser os membros da equipe que têm a habilidade de engenharia para fazer esta proposta.\r\n\r\nUm post linkedIn parece que a Vertra está fazendo parceria com outros agentes imobiliários para desenvolver suas presenças na web, demonstrando alguma boa capacidade de desenvolver websites, porém o conjunto de habilidades necessárias vai além disso e para criar uma habilidade simbólica como Plutus, Marlow e Haskell seria necessária. Em outro post do LinkedIn, eles não tiveram nenhum conhecimento técnico e desde então adquiriram essa experiência dentro da empresa, o que é um bom sinal de que eles têm a capacidade de aprender.  Em geral, a proposta se beneficiaria da demonstração dessas habilidades técnicas, acrescentando links aos perfis do Github ou do LinkedIn de funcionários técnicos, ou daqueles que estariam liderando o projeto a partir desse ponto de vista. Não está claro se o proponente sabe quais membros da equipe são necessários para cumprir a proposta, uma vez que isto não está delineado no plano. Se eles fossem terceirizar o conhecimento técnico, a proposta deveria delinear como isto será alcançado.\r\n\r\nOs fundos propostos foram alocados para o desenvolvimento de contratos inteligentes do roteiro da Vertra. Isso gera confiança para ver isso alinhado no quadro mais amplo e que as etapas 0-2 já foram concluídas. Cada item identificável como tal foi alocado uma discriminação do total dos fundos solicitados, tal desenvolvimento de contratos inteligentes foi alocado $12.000 que parece ser uma quantia justa. No entanto, uma justificativa para que o desenvolvimento de contratos inteligentes custe $12.000 deve ser dada, por exemplo $12.000 é um período de tempo de desenvolvimento de Plutus por mais de 4 meses.\r\n\r\nO whitepaper fornece um\r\n\r\n\r\n\r\n", "q1r": 3, "q2": "A proposta apresenta uma quantidade razoável de audibilidade que o público pode medir o desempenho contra. Por exemplo, como a Vertra está lançando um contrato inteligente e uma propriedade simbólica, coisas como a Ada transacionada através da cadeia podem ser analisadas externamente. Entretanto, a própria proposta não identifica isto como uma medida de sucesso.\r\n\r\nCada etapa do programa é marcada contra um item do roteiro que tem uma data. Esta parte do projeto marcou um prazo para cada marco do roteiro permitindo verificar se o projeto cumpriu seus prazos a tempo. A proposta não define explicitamente como a comunidade pode se manter atualizada com o projeto, seja na mídia social, e-mail ou outros canais de comunicação. Presumir-se-ia que eles seriam atualizados se fossem um usuário existente do site vertraimoveis.com, e a proposta deveria identificar como isso é feito.", "q2r": 4, "assessor": "z_assessor_332", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies a real problem which is the lack of liquidity of real estate. The idea of tokenizing real estate through integration with blockchain would be revolutionary and would off course add immense value to Cardano. There is off course many challenges with this idea which are not fully explored in the proposal.", "q0r": 4, "q1": "I'm Portuguese and i read through the vertraimoveis.com website as well as their Facebook page and found no reference to this proposal, the whitepaper or anything to do with tokens. There's also no information on the identity of the team or their experience. These facts by themselves already cast immense doubt on the proposal. A number of concepts are introduced throughout the proposal such as the \"Rent to own\" and others which represent the \"What\" you would like to achieve but not much information on the \"How\" to achieve it. This proposal presents some considerable technical and legal challenges but these are not explored in the proposal. In essence this still reads more like a concept then a executable proposal. Integrating the blockchain with your platform and developing the required smart contracts by Q2 of 2022 seems very optimistic. There's a simple budget breakdown presented, but it requires more detail i.e. what will the 12k for \"Smart contracts development\" be used for ? how many hours of development are required ? And for \"Marketing for the marketplace\", where will be marketing be done ? and will this be for your whole platform or just the tokenized properties ? ", "q1r": 1, "q2": "A roadmap is presented, but it includes stages prior to this proposal that are not relevant (stage 0 to 2). The milestones are also very broad e.g. the development of smart contracts and integration with your platform could be broken down into more tangible milestones as this is the critical step of the proposal. There also no KPI's presented. A simple KPI could be increase in user base 3 months after launch of token or amount of capital locked in tokens 3 months from launch.", "q2r": 2, "assessor": "z_assessor_125", "no_vca": 27, "ne": 10, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "There will be a lot more advantages when bringing real estate to the blockchain network as the team is aware of in the proposal. And I think that's the reason why they list out some important points that their idea can deeply solve the problem in real estate. But I think the team should provide some goals, key metrics to their proposal to help assess whether their ways of development suit or not with this challenge. For this project, it can be the numbers of properties listed in their platform, total value in the market, or can be the number of active users of both buyer and seller... \r\nBesides the key metrics, they should prove that their idea will bring some value to Cardano ecosystem.", "q0r": 2, "q1": "It's great when the team has a good acknowledgment about this market and their solution idea of the platform can address current problems a lot. \r\nIt's great when they're in the way of developing their platform and we can see it on their website, now they're on bringing it to network. But I hope that the team can give more detail about their roadmap and timeline. Because there's no detailed implementation plan in the proposal, so it is hard to say whether their roadmap is realistic or not with their plan. It also means that can't assess the required budget is reasonable or not. \r\nLast but not least, seem that they will still keep developing the project without fund, but funding will help accelerate their plan. Hence, my advice is that the team should give some risk and how they control when getting the fund", "q1r": 3, "q2": "Without considering about the detailed implementation plan, their roadmap is enough for tracking and auditing the progress.\r\nBut the team lacks key metrics, this help Catalyst community knowing what the success of the idea will look like. \r\nOne last good thing is they have a good awareness about the problem as I said before, which helps them form the features of the platform that can address the problem very well.", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is based on a well-known use case for blockchain: use tokenization to increase liquidity in a market, real estate in this case. It takes the form of a dedicated marketplace and the corresponding token.\r\nIt's easy to see the benefit of this proposal for the company real estate financial market, however the proposal fails to clearly explain what the success will be like and how large will be the added value for Cardano Ecosystem. Key metrics are not well aligned with the challenge setting, except from the part where a token is created. I would recommend this team to partner with another project to further detail technical aspects of the Dapps. \r\nI disagree that this proposal effectively addresses the Dapps and integration challenge.\r\n", "q0r": 2, "q1": "The company claims a 1-year existence, which I was not able to confirm from the website. I would recommend to the proposer to translate the website in English, this would probably facilitate people assessing, and decide for vote.\r\nThe global company roadmap is given, but the part dedicated to smartcontract development is not detailed.  Without more details, my understanding is that the proposer does not know well Cardano Blockchain. It defines the main token as \"digital tokens to be issued as Cardano-based smart contracts on the Cardano Blockchain\". On cardano, to create custom tokens does not require smart contracts.\r\nThe budget allocation is broadly described. The team is not identified, so I was not able to confirm that it gathers computer science and blockchain skills required for this development.\r\nI strongly disagree that this proposal is likely to be implemented successfully.\r\n", "q1r": 1, "q2": "This proposal does not offer project Kpi, or a detailed development roadmap. It does not explain if the smartcontract development will be open source and published on Github for example.\r\nI cannot consider that this proposal offers the community a way to effectively monitor the progress of the development.\r\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "A Vertra é um mercado imobiliário global de proprietários de token de imóveis com acesso a dividendos e locatários a um modelo próprio de aluguel.", "experience": "Desenvolvemos a plataforma disponível no site vertraimoveis.com e temos mais de 20 anos de experiência no mercado financeiro imobiliário em equipe."}