{"id": 382488, "author": "michiel", "title": "Anonymity & data control online ZKT", "url": "https://cardano.ideascale.com/a/dtd/382488-48088", "category": 26240, "amount": 25050, "description": "Hoje, as empresas rastreiam você, coletam seus dados e os utilizam (mal)comercialmente. Você não tem controle/benefício sobre os mesmos, embora seja proprietário de seus dados.", "funded": 2, "upvotes": 167266392, "downvotes": 4282581, "votes_result": 162983811, "votes_cast": 620, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Até onde eu entendo o plano dos proponentes é reimaginar a experiência da marca para as pessoas. Trazer as marcas e os usuários em uma plataforma as marcas pagam por informações que você optou por fornecer com base no conhecimento zero. Isso significa que você compartilha apenas as informações relevantes. Idéia legal! Este problema resolvido aqui se encaixa perfeitamente no desafio e também em alguns outros desafios, bom trabalho na proposta. É bastante detalhada. O proponente explica mais claramente e em grande detalhe o valor já trazido, bem como o valor que trará sobre o curso de implementação bem sucedido desta proposta. Há muitas métricas-chave todas relevantes para o desafio que esta proposta se encaixa em todos os aspectos relacionados ao impacto para a comunidade. Na maioria das vezes que faço uma revisão, eu realmente luto para ver como os proponentes irão escalar, se necessário. Nesta, não preciso me preocupar com isso, uma vez que eles não só têm um plano de escalonamento, mas também estão executando sobre ele. Eles já estão trabalhando com algumas marcas e comunidades e não estão evoluindo tão bem. Eu literalmente não consigo ver ou encontrar nada que esteja faltando nesta proposta. É muito difícil fazer isso, pois é tão longo e concreto, o que é ótimo! Mais propostas devem ser assim.  Como desenvolvedor, eu não tenho absolutamente nenhuma preocupação com esta proposta! Ótimo trabalho!", "q0r": 5, "q1": "Há referências mais do que suficientes listadas na proposta. Foram necessários cerca de 20 minutest para verificar a maioria delas, mas elas são bem verificadas. As pessoas por trás da proposta são profissionais e isto é o que parece um plano de negócios se você ainda não viu um antes. Tratar a comunidade como futuros interessados é uma maneira muito legal de fazer as coisas. Mais poder para você. O orçamento é delineado de uma maneira clara e sensata. Há uma seção concreta discutindo em termos específicos o tempo e os custos da quebra do orçamento. Como um desenvolvedor não é tão experiente quanto as pessoas que vão trabalhar nisto, o cronograma parece razoável e definitivamente exequível. O plano de imaplementação não é nada simples e está entrelaçado com propostas anteriores já financiadas que são parte de um ecossistema próprio. Desde que você esteja disposto a ler tanto, você descobrirá a relação exata entre cada proposta e como ela é apenas uma peça de quebra-cabeça de todo o quadro. Os recursos necessários para implementar a proposta, bem como para as propostas já implementadas, estão listados e eu recomendo a leitura através deles. O que eu realmente gosto são duas coisas: O open-sourcing já faz parte de sua implementação e o planejamento para o open-source ainda mais código. Como desenvolvedor, minha boca está lacrimejando. A segunda coisa que não vejo muitas propostas fazendo é planejar financiar as coisas para si mesmas e perguntar apenas o que é necessário ou o mínimo que é corajoso para a KUDOS para isso.  O projeto está em absoluta sintonia com o que já foi feito e como esta proposta vai melhorar ainda mais.", "q1r": 5, "q2": "Para qualquer pessoa interessada na auditabilidade e traçabilidade do projeto, eles têm você coberto. Canais de discussão, canais de telegramas, mídia social, artigos de mídia... eles têm tudo isso. Você pode fazer parte do progresso, se desejar, mas também pode acompanhar com facilidade. As métricas e os KPIs são relevantes, descritos em detalhes e, o mais importante, presentes. Muitas propostas não levam muito tempo pensando nos KPIs, mas eles são parte integrante de qualquer projeto em evolução. E sem métricas você não pode otimizar o processo, porque não saberia se está fazendo melhor ou não. O roteiro e os marcos são claros e sensatos para a implementação, espalhados por um horizonte de tempo confortável.  O problema é claro, a solução é clara e legível tanto para pessoas técnicas como para pessoas não técnicas. Quero apenas encorajar as pessoas que lerem esta revisão a votar a favor deste projeto, pois ele é muito importante e benéfico para toda a comunidade, mas também para as marcas e empresas que aderem. Boa sorte para vocês!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The crypto and Cardano aim to empower the end-user in all respects. This proposal to aims to empower the end-users to manage the distribution of personal preferences for targeted advertising in a safe manner. The business model makes sense and is achievable. Thus the project is highly in alignment with the challenge. ", "q0r": 5, "q1": "The team is delivering value to the Cardano ecosystem and therefore it is likely to complete the proposal in a good manner. The team has members with more than 10 years of experience and impressive track records in project implementation. The task to be carried out in this phase is reasonable and therefore very likely to be successful. ", "q1r": 5, "q2": "The proposal has many common aims with Brave however with identity and user willingness to share details it may lead to better earning potential for the user and for the company. On the face, the business looks promising. The company has a detailed road map and a viable business model. With AralaPrism in advanced stages, it is highly likely that the project will be successful. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Being very much in line with the crypto folklore of privacy, anonymity and sovereignty, Profila will attract a lot of users from the wider crypto community if they fulfill their goals successfully.", "q0r": 5, "q1": "Team is highly experienced and transparent - all the profiles are publicly visible. The proposal is written with a lot of attention to detail and shows deep understanding of the matter at hand. Also, team was funded in Funds 5 and 6 which shows the trust the community has already given them.", "q1r": 5, "q2": "The budget is broken down clearly, but the success metrics seem vague and not detailed enoguh. It would be great to see month-to-month an operational plan and measures of success on a monthly basis just to track progress. It would be helpful for auditing as well as for the team themselves.", "q2r": 3, "assessor": "z_assessor_65", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Protecting personal data in this digital era is the thing that everyone nowadays cares about. In the open world that every app, the website always want to take our information then use it for commercial purpose, this idea of proposing a team will help to protect us from that problem. It will help us manage our digital life in one location via an app that shows which organizations have access to (certain parts of) our personal data. I believe that the success of this app will drive a lot of adoption to Cardano ecosystem because it's necessary for everyone.", "q0r": 5, "q1": "This proposal is a part of their big vision that has many proposals were funded in fund 5 and 6. Moreover, that bigger project is running and we can check their info in the website and social links. \r\nMoreover, the team showed a very detailed implementation plan and explanation about what has in their (D)app. We can understand how this app work, which part of the problem that the feature is solving... \r\nThey also show a reasonable budget breakdown of the plan. \r\nSo I think I can believe this team 100%", "q1r": 5, "q2": "The team has a great detailed roadmap and promising key metrics, some of these steps were finished and some ongoing.\r\nThey also have very detailed info about the problem to show how much they get it, that's the reason why they have a great solution explanation that easy to understand. It's appreciated when they include a lot of case studies to explain how a feature will work and help users. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "Tmr, use nosso aplicativo de dados baseados no consentimento (D)app, controle quem pode acessar seus dados e ser compensado por sua atenção em ficha de conhecimento zero (ZKT)", "experience": "Privacy/Tech lawyer en entrepreneur - 10Y XP em questões legais (relevantes) - privacidade; marketing digital; direitos de dados & moedas virtuais."}