{"id": 382508, "author": "lloydduhon", "title": "Urban Farmer dApp", "url": "https://cardano.ideascale.com/a/dtd/382508-48088", "category": 26240, "amount": 5000, "description": "A insegurança alimentar é uma crise global. Os problemas da cadeia de abastecimento estão tornando o problema mais agudo.", "funded": 1, "upvotes": 59049776, "downvotes": 10917224, "votes_result": 48132552, "votes_cast": 214, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Achei esta idéia muito atual e relevante, de acordo com os objetivos do desafio. É um fato que a indústria alimentícia é uma das maiores e mais lucrativas do mundo, o que não torna o acesso à feira de alimentos acessível a todos. A população é definida pelos preços e disponibilidade escolhidos por uma cadeia multinacional de supermercados, muitas vezes, e também pelo consumo de alimentos nauseantes com conservantes e fertilizantes (no caso de vegetais e frutas). Isto torna necessário diversificar o acesso aos alimentos e uma maneira de fazer isto é através de pequenos produtores. Estas iniciativas já são uma realidade, por exemplo, através da promoção de feiras orgânicas com produtores locais, perfis Instagram focados em Food Design, por exemplo, projetos como as feiras de rua que acontecem semanalmente em locais, etc. Ter uma Dapp que faça a ponte entre produtores e consumidores é uma boa idéia para envolver as tecnologias de cadeia de bloqueio da Cardano em tal indústria e incentivá-la. É positivo que o autor detalhe quais atividades seriam encontradas no Dapp, dando-nos uma visão mais precisa de como funcionaria e como o projeto poderia beneficiar o ecossistema Cardano: como eu entendo, alguns pagamentos seriam feitos com o ADA no futuro e a cadeia de bloqueio seria usada para realizar as atividades, no entanto, esta ponte ainda era um pouco abstrata para mim. Não creio que houvesse uma explicação muito clara de como a Dapp beneficiaria a cadeia de bloqueio. Portanto, acho que é uma excelente idéia, mas seu relacionamento com Cardano poderia ter sido ainda mais quebrado para promover uma compreensão mais profunda de como o projeto iria atender aos objetivos do desafio.", "q0r": 1, "q1": "Os autores estão preocupados em criar um bom roteiro, ou seja, temos muitos detalhes sobre o que seria e então temos uma noção estabelecida de tempo para isso: na parte do \"plano de ação\", entendemos com mais profundidade as atividades a serem desenvolvidas, eles explicam bem cada coisa que seria feita e determinam a ordem. E na parte \"roteiro e marcos\", estas ações são sintetizadas e relacionadas à noção temporal, tornando as informações compreendidas mais precisas e monitoráveis (como comentarei no próximo tópico). Em relação à equipe, é um par; não são estabelecidos bons detalhes sobre quem são. Conhecemos suas principais áreas de especialização e que um deles é especialista no que faz, com 25 anos de experiência. Mas seria melhor se soubéssemos quem fez o quê e se houvesse uma seção da proposta dedicada a explicar suas carreiras com mais profundidade e, mais importante ainda, como essas pessoas se reportam à cadeia de bloqueio Cardano? Então seria importante e esta idéia foi esclarecida aqui, por exemplo, se os autores explicassem como eles se encontraram e agiram na comunidade. E quanto ao dinheiro que foi pedido, é realmente uma quantia pequena em comparação com as outras propostas e que é justificada pelo projeto, mas seriam necessários mais detalhes, por exemplo, na parte do projeto, diz-se que alguns estudantes universitários trabalhariam com ele, mas quantos? Qual seria o valor pretendido para cada um? As informações fornecidas proporcionam um entendimento, mas não muito profundo.", "q1r": 4, "q2": "Aqui temos duas maneiras de exercer a auditabilidade. Uma é através dos detalhes presentes no plano de ação, onde o autor apresenta quais seriam as atividades de forma muito detalhada, dando-nos a possibilidade de monitorar se o que foi prometido será realmente feito de forma adequada. Alguns resultados também são indicados na parte \"indicadores-chave de desempenho\"; entretanto, estes indicadores cobrem um período muito longo: resultados esperados até julho de 2022, final de 2022 e final de 2023! Metas mais curtas deveriam ser estabelecidas para que seja mais possível auditar, por exemplo, se metas mensais ou mesmo bimestrais fossem fornecidas, seria mais possível para nós monitorarmos as atividades. Seis meses é um longo tempo sem um monitoramento preciso. Portanto, acredito que é mais fácil promover a auditabilidade pelo meio indireto que o autor fornecido no plano de ação, os indicadores-chave poderiam ser melhor detalhados. Também acredito que a audibilidade deste projeto poderia ser feita através do fornecimento constante de informações do autor à comunidade, o que poderia ser feito durante alguma sala no After Townhall, que são promovidos pelo grupo Catalyst Swarm.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This dApp addresses challenge objects directly because it will provide high value for small farmers and consumers.  In the growing market of micro urban farms, this app, once completely developed, could attract new cardano users and increase transactions on the network.  Success looks like small farms using the Cardano Blockchain, tokens, and DAOs to manage farm operations such as initial set up (system construction, specific crop instructions), collection of environmental data and IOT sensors - I feel this will be a common app in the near future because of the issues noted in the proposal and in the \"Sustainable agriculture - EMURGO Trace\"  program.\r\n\r\nAs a microgreen farmer myself, I understand the problem for small farms to access markets and get started.  Additionally, small, urban farmers are (in my opinion) likely to be tech savvy, early adopters, highly connected to multiple networks.  The consumers / buyers are likely to be influencers and trend-setters, as well.  The proposed application will satisfy the challenge by attracting new users to the platform.  ", "q0r": 5, "q1": "This proposal is likely to be a success because the Wife and Husband team are an established small farm (see the website), have technical skills (see the linkedIn profile), have a collaborative mindset (see comments section and work with local university students).  Because they have a real need, have the skills and are willing to collaborate and learn, this app can be built.  I have no doubt it an app like this will be built soon.   \r\n\r\nMy concern is that the plan is too wide or unfocused and that  risks and potential problems are not addressed.  It is an early stage plan and I expect it will be iterated and revised.  It's not immediately clear from the plan what deliverables will be during this round and what are future intentions.  For instance, the last Key Performance Indicator concerning a DAO is not within the scope of this proposal (It's awesome, but not appropriate in this section).  And the budget breakdown could be more detailed. More details and clarity in the roadmap and milestones would build trust in successful completion.   ", "q1r": 4, "q2": "At this stage, the plan is barely sufficient concerning auditability.  The roadmap and milestones are in place, but could be more clear and focused.  More details about Hydra, Machine Learning (ML) and centralized AWS (Amazon Web Services) would improve this plan.  It does meet the challenge very well, but risks are not specifically mentioned.  The risks include lack of awareness and adoption:  How do people discover the app?  How and why do they stop what they are doing now and do something new?  Will getting 10 new farms onboarded next summer be difficult?  and then 30 new farms (5 per month for 6 months)?  It seems a monumental and audacious task for the funds requested. \r\n\r\nI love audacious tasks - that's what our community is about.  Proposers, please be encouraged and, and voters, please consider this impactful and fledgling proposal carefully.   ", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "A very well presented proposal with a great idea. If this app works it could also get a lot of people to start an urban farm as a means to  provide for their families alleviating unemployment, while providing fresh produce to clients. This Dapp will increase adoption of Cardano, and will have a positive impact on the Cardano Ecosystem. The KpI's are in line with that of the Challenge.", "q0r": 5, "q1": "The proposers have the necessary skills and a LinkedIn profile is given that shows their experience, skills and education. The budget is outlined and very reasonable. A detailed action plan sets out how they plan to roll out the project. They will make use of a local design college's students to help implement the UX/UI. KPI's are laid out well, as well as a road map with milestones. I do not see Risks discussed in the proposal. All the skills required is also listed.", "q1r": 4, "q2": "This proposal does include a road map with mile stones and KPI's, that can be used to quantify the success of the proposal. The proposer does not indicate how the community can follow progress of the project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Desenvolver um dApp que ajude as micro fazendas urbanas a operar e expandir, ao mesmo tempo em que facilite aos membros da comunidade a encomenda de produtos a partir delas.", "experience": "Proprietário/Operador da Fazenda Urbana Living Greens.  \n25 anos de experiência em TI, nível CTO.  \nCardano Plutus Pioneer 2nd Cohort."}