{"id": 382821, "author": "i3dangels", "title": "i3D Mass Adoption Protocol", "url": "https://cardano.ideascale.com/a/dtd/382821-48088", "category": 26240, "amount": 42700, "description": "A adoção em massa para investimentos iniciais é um ambiente de dados ilíquido, de alto risco e pobre em dados, com baixa liquidez para fundadores e investidores.", "funded": 1, "upvotes": 74449304, "downvotes": 11485856, "votes_result": 62963448, "votes_cast": 351, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=27675"], "media": [], "f6_assessments": [{"q0": "Visar uma base de usuários como startups poderia fazer muito bem para a comunidade Cardano. A proposta se concentra em fornecer aos startups os fundos e a assistência financeira necessária. O recurso descentralizado proporciona a esta plataforma idealizada pela equipe uma maior escalabilidade e integridade. A proposta de implementação bem sucedida poderia chamar mais atenção do planejamento de startups para hospedar em uma rede descentralizada e fazê-los preferir a cadeia Cardano em relação às outras cadeias. Dito isto, sinto fortemente que o impacto disto poderia ser enorme para a comunidade.", "q0r": 5, "q1": "O proponente fornece aos leitores um detalhamento elaborado de seu plano de jogo. O desenvolvimento por fases e os prazos correspondentes fornecem à comunidade o resultado previsível. A menção da necessidade adicional de fundos nas próximas rodadas acrescenta mais credibilidade à autenticidade da proposta. A mistura da equipe e sua experiência é um complemento. A extensa quantidade de trabalho de base já estabelecida é outro ponto positivo a ser considerado. A equipe também reconhece as possíveis ameaças e fraquezas que pode enfrentar e como eles planejam mitigá-las através de uma análise SWOT, que certamente é única em comparação com muitas outras propostas. No entanto, uma elaborada divisão orçamentária teria feito o truque para obter notas completas sobre os critérios de viabilidade.", "q1r": 4, "q2": "A criação de uma nova ficha para facilitar as operações certamente mostra que esta proposta está avançando em direção a seu destino previsto. No entanto, o proponente não faz indicações claras sobre as métricas que os auditores poderiam usar para monitorar o progresso regularmente. O número de partidas a bordo, a quantidade de financiamento, as novas contribuições facilitadas pela plataforma podem ser suficientes para que eu sinta que o proponente poderia ter adicionado um número estimado para cada uma delas. O cronograma e os resultados parecem promissores e, portanto, dou uma pontuação de 4 em 5 para a clareza e auditabilidade da proposta.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal has been presented by a strong team, after detailed planning and SWOT analysis. With this background work and detailed planning, there is a very high chance that the project will be implemented in the best possible manner. The Github repos are also very active with substantial work showcasing the team's capability and commitment.", "q0r": 5, "q1": "This proposal has been presented by a strong team, after detailed planning and SWOT analysis. With this background work and detailed planning, there is a very high chance that the project will be implemented in the best possible manner. The Github repos are also very active with substantial work showcasing the team's capability and commitment.", "q1r": 5, "q2": "The proposal includes a whole meaningful KPI that can measure the actual adoption rate. The funding is for the development round, enabling scaling and allowing rapid mass consensus by a more extensive network to assess the idea. There are a nicely laid out roadmap and plan. Therefore the I think the proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by implementing 3 Token Double Sided Marketplace offering a combination of due diligence, network validation, investor capital preservation and liquidity to encourage mass adoption for crypto startup investing. The project offers complete end to end solution that solve three common problems for crypto startup which are credibility, network validity, and capital. This project is certainly a game changer in DeFi and could potentially foster lots of new crypto startups. \r\n", "q0r": 5, "q1": "Team consist of multiple individuals with significantly relevant credential and expertise. Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides clear roadmap and requests a reasonable budget with detailed breakdown. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable, and team has explained clearly their step-by-step execution plan. This proposal is one of the best in Fund 7 and should be voted by the community.\r\n", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. So, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. This proposal is one of the best in Fund 7 and should be voted by the community.\r\n", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 17, "ne": 5, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "Startups lack a lot of resources and have to do tons of inexperienced work in a limited time. For good startups that want to save time and get rid of problems in due diligence, this idea is a silver bullet for them. Moreover, this idea also inspires a lot of investors to come and help young startups because its mechanic and features can help startups transparent info easier. \r\nIn addition, throughout the proposal, there is a lot of solution that is not just for solving the problem, but also motivate users a lot to engage with this platform. \r\nI think that the success of this platform will affect a lot to the world and Cardano ecosystem, especially it can help startups in Catalyst problems go further easier. ", "q0r": 5, "q1": "This team can make it! \r\nThis is an experienced team in startups and TradFi, DeFi... that's not just from their profile but checking the detailed info of their plan, they have a good guiding about how their solution can point out the necessary features/ activities that really need for the user based on user insight - as my experience with the position of startup and stakeholder. \r\nBut I hope the team can have a better roadmap, more detail to help me understand what they are doing and gonna do in that time. \r\nLast but not least, it's appreciated when they add their SWOT into the proposal. It means they have well analytics and can has a good plan to implement this idea. ", "q1r": 4, "q2": "The roadmap is less info for auditing what the team will do. But their KPIs are very promising, all about the number of user adoption. \r\nI hope that this team will succeed in this idea, this will help a lot of startups around the world. And will increase the number of startups that can fly to the moon. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 3, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "3 Token Double Sided Marketplace oferecendo uma combinação de due diligence, validação de rede, preservação do capital do investidor e liquidez", "experience": "Equipe educada e experiente com múltipla experiência em startup coletiva. Somos fortes e equilibrados com experiência nos setores tradfi & defi"}