{"id": 383099, "author": "juliusu", "title": "NFT Trading Platform / DApp", "url": "https://cardano.ideascale.com/a/dtd/383099-48088", "category": 26240, "amount": 23880, "description": "Como os colecionadores de arte, os detentores do NFT podem não desejar vender suas peças. Entretanto, eles estão dispostos a trocar suas NFTs por outras NFTs de valor.", "funded": 0, "upvotes": 16221670, "downvotes": 15537194, "votes_result": 684476, "votes_cast": 148, "f6_no_assessments": 3, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a platform for individuals to peer to peer swaps of NFTs is a great idea. If successful the proposal will add another avenue for use on Cardano and as such increase the utility of the ecosystem.", "q0r": 3, "q1": "The proposal provided a link to LinkedIn for the team leader, he appears to be a well rounded business executive, but without software programming skills. I would like the proposal to expand on the technical team members. Furthermore, I would like the team to expand on the go to market strategy, how are you going to populate (find customers) your marketplace. ", "q1r": 1, "q2": "The proposal provided a high level roadmap and line item budget. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date – swap 50 NFTs by month 3, have 100 users by month 4. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "A user-friendly site to swap NFTs is likely to result in a secondary market once tickets for events and other such values are transferred to NFT. The NFT and other native tokens will be a major role played once the ecosystem develops. This proposal will provide a great platform to give liquidity and unlock new models for using NFT. It is addressing an important challenge. ", "q0r": 5, "q1": "The proposer has more than 10 years of experience in various field and also have more than 4 years in managing his own online business. With this experience and a straight forwards proposal to build an NFT swapping platform, I believe that he will be able to build the intended site.  ", "q1r": 4, "q2": "The proposal has a simple and clear aim with well-laid-out features. The budget is also very reasonable. The business model for sustenance would have clarified a few issues and information on whether the proposer will opensource the code would have added great value. Overall the progress of the project and the final delivery is auditable and success can be easily measured. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The dapp that is the scope of the proposal would not necessarily attract new users to the Cardano ecosystem, but it would definitely ad quality of life improvement to existing CNFT enthusiasts and collectors. The CNFT space has been one of the key drivers of Cardano in 2021 & this proposal accurately recognises a need of some of those involved in the scene and looks to address it in a promising matter. But I would have liked to see a bit more details about the proposed solution.", "q0r": 4, "q1": "After reading the proposal I was under the impression that the proposer himself is the one that will be doing the development and smart contract coding, as no mention is made in the proposal of needing to hire outside help to complete the project.\r\nI feel this is a bit misleading as it was only after reading the comments that I discovered that the proposal is actually looking to contract Plutus developers to complete the deliverables.\r\nThe timeframe given seems to be based on the proposer's own assessment and doesn't seem to be based on prior consultations with developers.\r\nI would suggest resubmitting the proposal to a future fund after a clearer presentation of the skills needed to complete the project is made and perhaps the costs reevaluated.", "q1r": 2, "q2": "The development of the project and progress made towards the ultimate goal is defined in clear and verifiable tasks and as such, it would be relatively easy to audit by the community. The timeframes and metrics are described clearly and would be easy to follow, the budget is a bit low, and may force the proposer to cut corners on deliverables, but this also depends on the location of the development team/developer hired for the project.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Criar uma plataforma baseada em contratos inteligentes onde os detentores de NFTs poderiam colocar seus NFTs para negociação e receber propostas para negociações.", "experience": "4 anos de consultoria em TI/gestão para empresas internacionais\n4 anos de construção e crescimento de negócios on-line\n3 anos no espaço criptográfico"}