{"id": 384071, "author": "keith", "title": "Music NFT Launchpad", "url": "https://cardano.ideascale.com/a/dtd/384071-48088", "category": 26240, "amount": 20500, "description": "Os músicos não são capazes de efetivamente diversificar e monetizar sua música usando plataformas atuais lideradas por corporações dominantes.", "funded": 1, "upvotes": 47129533, "downvotes": 9794957, "votes_result": 37334576, "votes_cast": 183, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta aborda o problema de os músicos não poderem rentabilizar sua música utilizando as plataformas existentes na indústria musical. Sendo eu mesmo músico, sei disso tudo muito bem. A solução para a declaração do problema não contém a solução real, mas felizmente isso se encontra tanto no título da declaração do problema quanto no roteiro. O objetivo da equipe é criar uma forma de os músicos aprenderem sobre Music NFTs e lançá-las como tal, juntamente com um lançamento em uma plataforma de streaming. Considerando que a indústria musical é bastante complexa, eu gostaria de ter um pouco mais de explicação em detalhes de como sua plataforma irá funcionar, mas chegarei a isso mais tarde. A integração da música e dos artistas no espaço NFT foi proposta e tentada muitas vezes antes (porque é muito necessária), mas ainda tem que haver uma plataforma realmente sólida para ser lançada. A idéia central é muito relevante e ótima, e se bem sucedida e devidamente desenvolvida pode ser um grande negócio tanto para o Ecossistema Cardano quanto para a indústria musical como um todo. Concordo que esta proposta trata do desafio, embora vagamente na forma como visa executar o referido plano.", "q0r": 4, "q1": "A equipe tem muita experiência em marketing, design, engenharia e consultoria. O fundador principal é um operador de Stake Pool, o que prova um profundo envolvimento e compreensão do ecossistema Cardano. Uma adição que fortaleceria ainda mais a credibilidade da equipe é a inclusão de algumas outras fontes que podem verificar a experiência e a competência da equipe. Há um link fornecido para um beta do produto (que é bom), mas o que estou pedindo é uma apresentação dos próprios membros da equipe. A proposta está pedindo menos de 10% do orçamento total do desafio, mas seria bom ver uma estimativa das horas de trabalho incluídas na parte da alocação de recursos da proposta. Por exemplo, quantas horas significa a alocação de 5000 dólares em um desenvolvedor web, e para que período de tempo? É muito promissor que a plataforma de lançamento (artistdrop.io) já esteja em funcionamento, o que fala bem para o futuro do projeto. Se eu entender a proposta corretamente, a equipe será a que cunhará a obra original dos artistas em NFTs, o que provavelmente será apreciado e criticado pelos artistas. Um exemplo simples de como o processo de utilização da plataforma, tanto do ponto de vista do artista como do comprador, proporcionaria muita clareza a esta proposta.  Em resumo, concordo que há uma boa chance de que esta proposta seja implementada com sucesso.", "q1r": 4, "q2": "A proposta inclui um roteiro que se estende do 4-2021 até o 2-2022. A fim de aumentar ainda mais a transparência da proposta, em minha opinião (como um Conselheiro Comunitário experiente) seria útil incluir alguns KPIs no roteiro. Por exemplo, a partir de quando começa o \"a bordo de 4 músicos por mês para um NFT a cada semana\"? Já começou? Também, explicando o processo de remoção do intermediário do serviço de cunhagem e os possíveis desafios de fazer isso, uma vez que muitas pessoas não estão familiarizadas com as entradas e saídas da cunhagem NFT.\r\nO que realmente aumentaria a credibilidade tanto da equipe quanto da proposta são algumas reflexões sobre os riscos e desafios potenciais ligados ao desenvolvimento deste projeto. Como músico ativo e com experiência em ser contratado para gravadoras, estou me perguntando como a equipe lidará com os direitos da música se ela for lançada em outras plataformas, mas cunhada em artistdrop.io ao mesmo tempo? Será em colaboração com plataformas de streaming e gravadoras, ou sem seu conhecimento? Ou a proposta vai se concentrar em artistas independentes? Há muitos contratos e armadilhas na indústria musical, e acredito que o maior desafio de criar uma plataforma NFT sólida para os artistas está aí. Ter uma explicação de como a equipe pretende navegar através disso aumentaria a confiança e credibilidade da proposta proporcionalmente. Devido às informações limitadas fornecidas nesta proposta, não discordo nem concordo que esta proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal defines a problem and introduces a solution to tackle it. It could have been made clearer what exactly makes this marketplace special in comparison to other marketplaces. ", "q0r": 4, "q1": "The proposal is already in the works which shows the commitment of the team. The team has a wide experience in tech and blockchain and the lead founder is already involved in the cardano community since several years. They could have added some more technical aspects to the proposal in my opinion, why I will rate this with a four.", "q1r": 4, "q2": "The proposal provides information about the team, the roadmap and how they will use the budget. In my opinion the roadmap could be more detailed. Also the key-succes metrics could be explained a bit more in detail. Overall the proposal provided more than enough information to asses it and get an idea of the product", "q2r": 4, "assessor": "z_assessor_41", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem in the proposal is within this challenge. Their success metrics also fit with the challenge direction. But the team should provide more info about how their event will impact the Cardano ecosystem. ", "q0r": 4, "q1": "The team doesn't have a clear implementation plan that helps to understand what they will do. This project is not simple and they need to think more about the plan to add to the proposal instead of only brief info for each field of activity. \r\nAfter that, they should make a more detailed roadmap. And some relevant risks, that the team doesn't mention here. \r\nAt last, the budget that the team required is suitable with the provided roadmap, but as I mentioned above, they should make a better plan, then a better roadmap to help CA assess it. ", "q1r": 3, "q2": "For the idea of this project, my advice to the team is that they should make a better roadmap. The current roadmap and key metrics are close enough to audit what they will do in the future. \r\nThey don't have any content to show about the well-acknowledgment about problem context and clarify how their solution can address it. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The music NFT launchpad proposal fits well with dApp & integrations by allowing the artist to launch their singles or albums using a NFT along with a release to their streaming platform. This will encourage more artists to use the platform and lead to increasing adoption on Cardano.", "q0r": 5, "q1": "Although the proposer team has no direct experience in music, their technical background (engineer, consultant, and designer) will help them to implement this proposal. It would be quite good for them to locate someone who could look into smart contract development as they will work closely with smart contract developer and it will be a smooth operation when the team can communicate which feature is necessary for the future launchpad.", "q1r": 4, "q2": "The funding allocation looks plausible but the community would appreciate more elaborate response for this part. To create the launchpad ready in 6months is quite an impressive task in itself. Anyhow the community can assess the fund flow as well as monitor the project progress anytime at ease with the mentioned KPIs. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I see value in creating a platform where creators/musicians can sell their music NFT(s) in the Cardano ecosystem. This will in fact benefit the current users and attract new users, as the problem has been clearly  stated, that musicians in the traditional schemes of this business are being monetized by corporations and not having the true value of their own crafts. ", "q0r": 4, "q1": "The team members are clearly stated, and I have looked up to the website. I am not sure what the proposer means as live, as the current website have only few information about the proposal. Moreover, I have tried joining the discord server but was unable to as the invitation was expired. In addition to this, as a UI/UX designer that uses Figma, the prototype on the given link is only half way done. This gives a lack of confidence for both CA(s)  - to understand clearly the proposer's idea, and voters - to have confidence in which how the technical development of the idea. Though the roadmap has been defined, but vision of expansion, milestones to develop, and risks to be taken are not well delivered. ", "q1r": 2, "q2": "The required funding must be broken down in a detailed manner and take account of risks that will be addressed, as to have better auditability. What's lacking is the milestones and management on the KPI(s) given. For example, how do the proposer intend to increase musician revenue by 20% by Q2 2022. What steps should be taken to put importance and protect/avoid musicians from scammers in the platform? What are the UX features that enables users to adopt the platform easily? ", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Onboarding musicians to distribute their work through NFTs on Cardano, has the potential to greatly popularise the platform. However, after reading the proposal I'm not convinced that the team behind it is the right candidate for the job. On the other hand, this may be the result of a rushed proposal due to lack of time.\r\nThe idea has a lot of potential, and it would be great to see a CNFT \"record label\" be born, that's why I would hope that the team resubmits a more complete and thought out version of the proposal in the future.", "q0r": 2, "q1": "The description of the proposers' experience is very promising at first glance, but no credentials or links to previous works are given to allow the community to verify and better judge for themselves.\r\nGiven that their landing page is presented as a working platform I have my doubts about the standards of the team at the moment.\r\nI would advise filling in the gaps in the gaps in the proposal, elaborating on the promising concept and resubmitting it to a future fund.", "q1r": 3, "q2": "Not a lot of thought seems to have been given to the KPIs of the proposal, they are present, but are very shallow. I would suggest further elaborating on them in a future iteration of the proposal.\r\nThe proposers are keen to point out that their service is already live, however on inspection of their website I discovered that it is little more than a landing page with a brief FAQs section.\r\nThe budget is broken down, but the figures seem a bit generic, particularly the sum allocated to the smart contract developer. The roadmap is brief and introduces elements not detailed elsewhere in the proposal.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Os músicos poderão lançar seu single ou álbum como um NFT junto com o lançamento para plataformas de streaming.", "experience": "Nossa equipe inclui atualmente três membros com uma grande variedade de experiências em tecnologia, finanças de cadeia de bloqueio e marketing."}