{"id": 384406, "author": "justin.cdnc", "title": "Local Charity Fundraising Platform", "url": "https://cardano.ideascale.com/a/dtd/384406-48088", "category": 26240, "amount": 10000, "description": "Caridades locais e empresas de apoio sofrem com as altas taxas de transação com cartão de crédito quando arrecadam fundos juntos.", "funded": 0, "upvotes": 15465094, "downvotes": 13958630, "votes_result": 1506464, "votes_cast": 142, "f6_no_assessments": 5, "f6_rating": 3.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses a problem that isn't aligned with the challenge. Yes it is an integration of sorts and eventually a Dapp perhaps, but the problem that is being addressed is sort of counter productive because it focuses on using Fiat. Yes you need to exchange your ADA to pay for things in Fiat, but that could be one transaction a month. The same goes for the other way around. Fiat to ADA. One transaction a month. It's weird that the title is Local Charity Fundraising Platform when the main focus is on saving on transaction fees from exchanging ADA and Fiat. You can create 2 pools. Let people fund the Fiat pool and let people Fund the ADA pool. You might never have to exchange ADA for Fiat ever again on any exchange because you have 2 big pools. Problem solved. The initial plan isn't well thought through or communicated correctly so it's hard to see how this will ad value to the Cardano system. There is no metrics aligned with the Challenge and I don't think this project will scale well as the plan needs some work.", "q0r": 1, "q1": "A link has been provided to a newly created Github page with info about the project. No proof of skills or team has been provided. The budget will be used to pay for on chain transaction fees. $10000. This makes no sense at all. I firmly believe a better model can be created that saves on reducing unnecessary transactions. The whole proposal revolves around building a token to fiat bridge to save on transaction costs. Reading the proposal you forget that it is a Charity fundraising platform. Maybe getting more team members on board will help you solve this transaction fee problem and shift your focus back to the Charity fundraising platform. No risks have been considered, the challenge presented again focuses on the high transaction fees. Refining the initial plan and showing that you are aware and prepared for future risks will develop trust on your project.", "q1r": 1, "q2": "Roadmap with milestones for Fund 7 and Fund 8 has been created. All mostly focusing on the token to fiat bridge. KPIs include finishing some parts of the project and collecting data on transaction fees. They identify the problem of high transaction fees when paying with a credit card to fund charities and they try to solve this by creating an open source token to fiat batch processing service. The problem and solution doesn't have to exist, it almost feels as if both are created and not necessarily real. The problem doesn't have to be a problem. You don't have to walk through a rock, you can walk around it. Maybe I am misinterpreting  this proposal and it just needs someone to better explain the problem and solution here.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 25, "ne": 10, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal identifies a clear existing challenge and provides a solution to funds getting lost through charities. Through on chain tracking they provide a clear idea on how they are going to tackle this problem. Through providing transparency for all stakeholders the proposal benefits all sides. ", "q0r": 5, "q1": "The team has a lot of experience regarding software engineering, they run a stakepool which means they are imbedded in the cardano community. Since this is a big project it also helps that there are 3 partner companies working on the product. They provided a clear Dev roadmap and their budget is reasonable for what they are asking and will be enough to cover on-chain transaction fees in modelling and testing best methods to store native token transactions across the 3 stakeholder groups. ", "q1r": 5, "q2": "The proposal is well written and they provide enough informations regarding their team, roadmap and budget. They have clear milestones and several metrics to define the succes of the project", "q2r": 5, "assessor": "z_assessor_41", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposer wishes to create token on the cardano chain that would allow for batch transactions of charty donations. This application matches the challenge settings as it's a dapp that will increase cardano adoption and utility. There's a clear in how exactly will value will be added to the cardano ecosystem. Unlike many other proposals this one has not only KPIs, but KPIs that are related to the challenge. One thing not mentioned in the proposal is future challenges that can be faced, related to the implementation or adoption of the project. IMHO it's an important part of every proposal, so the authors might want to add a few lines concerning the unknown future. This project adds promise and hope to the ecosystem which is always needed. As a developer I don't have any major concerns with the proposal. ", "q0r": 5, "q1": "There are some links and reference links that seem valid as far as project credability goes. I would have been a lot happier if this about to be plutus developer had a name to him so I could verify, but that's not to say I don't trust them, just just like to connect a face to a project. There's a mention of three partner companies developing version one, but no names or referals again, which is a bit disappointing. Even so a comprehensive roadmap with specific milestones is provided and it's clear and understandable enough. The only thing not clear is how many people are going to work on this roadmap, because as a developer I would be able to tell if the timetable is relevant or not, because one person can do only so much work for a given time.  Other than that, the plan seem sensible for the required implementation. There are iterative steps taken to meet the end goal. There are some mentioned resources necessary to implement the proposal, but I would always ask for more specifics to be able to verify what's promised in the proposal. The technical aspects are mentioned enogh to be understandable and they make sense.   Overall I think this project is feasible. If implemented it will bring cardano adoption.", "q1r": 4, "q2": "The project will be open source so I see no problem with tracability for anyone interested. There's a github repo link which anyone can use to have a peek at the progress and the implementation. Metrics and KPIs are relevant and most important present in the proposal. This is very important for me, as I dabble in optimization and a process that is not monitored can not be optimized. There's a roadmap with milestones and a yet to be seen sensible time horizon. The description as well as the problem statements are well defined and written. Good luck to the proposer, I wish you all the best!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Using blockchain can help advance a lot to charity activities, in this proposal the team will use it to cut off the transaction fee and make everything transparent by their platform. \r\nBut the team should provide some key metrics to help people know what success this idea will bring to communities. ", "q0r": 2, "q1": "The team has described very detail how their platform work but doesn't have any detail about what they gonna do. Their asked budget in this fund will be used for paying the transaction fees in modeling and testing best methods to store native token transactions across the 3 stakeholder groups (Charity, Vendor, Consumer). That completely makes me confused because there is no detailed plan to show that purpose, and what will happen after that, what is the next step to optimize that budget... \r\nI think the team should invest more time to fill anything they planned to prove to Catalyst community that they are doing that and will succeed with this idea. \r\nEverything in the proposal must make sense, be connected, and reasonable. ", "q1r": 2, "q2": "They don't have a detailed roadmap and key metrics for auditing this project. The included roadmap is so fried because it has no explanation about what are these steps about. \r\nI think the team maybe have a bit of experience with the problem and they made their solution somehow can address some of the standing problems. But have no explanation about the problem. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "The Proposer wants to use a Cardano blockchain token to track transactions in a fundraising platform, providing transparency to all stakeholders, cutting out fraudsters, and building a fiat bridge. This will increase utility & adoption of Cardano, and have a positive impact on the ecosystem.", "q0r": 4, "q1": "The Proposer has identified the team needed, but does not disclose any names, or links to their skills and experience. The budget is not broken down but is discussed briefly what they will use it for, so we have no idea how they came to 10 000 USD. They mention that they will need funding in Fund 8 as well. They do have a detailed month by month implementation plan. Risks are not discussed. To improve your proposal, add the team and their experience/skills. If they don't have the necessary skills or expertise then you can just add what additional team members you will need to recruit to cover the needed skills and expertise needed for your project.", "q1r": 3, "q2": "Milestones/KPI's are provided but no means of how the voters or community members can track it is mentioned. This proposal is a good idea, but needs a little bit more work. Definitely name the team that you have now, and that you will need. Maybe identify where you will find these people. Also break down your budget a bit more in detail, and discuss any possible risks, and solutions. Make sure the progress of the proposal can be tracked, by either social media , a website, Discord or Github.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 17, "ne": 4, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Usamos um token Cardano personalizado de cadeia de bloqueio para acompanhar as transações em nossa plataforma de captação de recursos e realizar a conversão de fiat em massa em intervalos.", "experience": "20+ anos de engenharia de software (fluidmedia.ca). Stakepool cdncardano.com. Funrayzr.com\nEm breve, serão desenvolvedores Plutus certificados pela Emurgo."}