{"id": 384575, "author": "jeffghome2020", "title": "StoryTime - A Writers Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384575-48088", "category": 26240, "amount": 41200, "description": "Os escritores estão sujeitos a um tratamento injusto como resultado de suas opiniões e histórias. Sua liberdade e seus direitos estão muitas vezes em risco.", "funded": 0, "upvotes": 17281303, "downvotes": 16707663, "votes_result": 573640, "votes_cast": 155, "f6_no_assessments": 5, "f6_rating": 2.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Do meu ponto de vista, esta proposta visa criar um mercado para os escritores compartilharem e venderem seus trabalhos, onde os autores podem optar por ser anônimos, mas ainda assim manter a transparência e os benefícios da tecnologia da cadeia de bloqueio. Trabalhando no setor cultural e estando envolvido no espaço de criptocracia, eu diria que não houve um desenvolvimento adequado com dApps ligados às artes e à cultura. Os artistas sofrem com empresas que agarram a maior parte do lucro, e ainda são controlados pela mão do meio em que conteúdo criar. Esta proposta seria um passo para desenvolver um lugar onde os autores pudessem criar e gerenciar suas obras de forma independente, se executadas corretamente. A declaração do problema é clara em sua descrição, assim como a solução para o problema. À primeira vista, esta proposta parece ser muito mais agradável apenas para os autores, mas depois de algumas reflexões, este projeto também visa conectar com os consumidores (é claro), o que o torna uma história totalmente diferente em termos de alcance e adoção. Poderia muito bem ser uma boa utilização da tesouraria do Catalyst, com muito potencial de escala no futuro, se executada corretamente. Na melhor das hipóteses (segundo o proponente), esta seria uma das primeiras bibliotecas descentralizadas, se tudo correr bem. Concordo que esta proposta efetivamente enfrenta o desafio.", "q0r": 4, "q1": "O proponente/equipa tem experiência em ter propostas financiadas no Fundo4 e no Fundo6, o que fala da credibilidade e da competência da equipe. Aqui seria benéfico se a proposta incluísse um conjunto de links para verificar ainda mais a competência dos membros da equipe principal. Isto poderia ser links para seus perfis no LinkedIn, ou links para as propostas para as quais a equipe já recebeu financiamento. Há um vídeo do youtube com o fundador (que é muito bom), mas eu teria gostado de algumas informações mais detalhadas relacionadas a esta proposta. A proposta DOES inclui informações de contato valiosas para os membros da equipe principal, o que raramente é visto em propostas (a partir de minha experiência como Conselheiro Comunitário).\r\nA declaração de que a equipe pretende reembolsar os fundos para esta proposta dentro de um ano fala de altos níveis de comprometimento com o projeto e com a comunidade, mas seria bom ter informações mais detalhadas de onde virá este dinheiro e será distribuído ao longo do ano. A alocação do orçamento é bastante simples e inclui um plano de contratação de desenvolvedores com a competência necessária, apresentado com horas de trabalho e uma estimativa do salário por hora durante um período de tempo mais longo (aproximadamente 2 meses, 1 dev em tempo integral e 2 dev em tempo parcial). Há uma parte da alocação orçamentária que irá para o fundador para trabalhar 30 horas por semana, mas seria bom ter uma breve descrição do que está incluído nesse pacote de trabalho. É marketing, gerenciamento deste projeto apenas ou outros projetos? Se o fundador trabalhará 30 horas por semana neste projeto, isso significa que ele não fará parte dos outros projetos? A viabilidade da proposta seria muito mais forte se pudéssemos saber mais detalhes sobre a própria dApp, já que a proposta apresenta principalmente a idéia central, mas não muitos detalhes. Que funções terá além de carregar/adquirir material? Os compradores serão anônimos e como será distribuído? Será que ela incorporará NFTs, e como funcionará? Sei que estas podem ser perguntas \"óbvias\", mas se o objetivo é ter um grande alcance para pessoas com experiência variada de trabalho com a tecnologia Cardano e Blockchain em geral, acredito que seria benéfico se a proposta incluísse estas informações. Por causa das razões expostas acima, eu não discordo nem concordo que é altamente provável que esta proposta seja implementada com sucesso.", "q1r": 3, "q2": "A fim de medir a auditabilidade de forma clara e estruturada, eu sugeriria que o proponente acrescentasse muito mais detalhes em relação ao desenvolvimento e processo do projeto. Seria incrivelmente benéfico se pudéssemos ver um roteiro claro com marcos e com a inclusão de um cronograma estimado. No momento, só podemos ver que o proponente significa criar um mercado, mas quais são os passos para criar um mercado para os autores? Onde está o projeto após 3 meses, 6 meses, 9 meses e 12 meses? Que canais sociais a comunidade poderá acompanhar o progresso do projeto?Eu também sugeriria incluir algumas medidas de sucesso a fim de monitorar o desenvolvimento (KPIs e métricas). Quantos usuários serão esperados durante o primeiro mês, ou após 6 meses? Se eu entender as coisas corretamente, o Cardano Outreach parece ser bastante ativo na mídia social, e incluir esse plano ou processo na proposta aumentaria ainda mais a auditabilidade e a transparência do projeto como um todo. Também incluir um pequeno parágrafo de texto explicando os riscos e desafios, e como a equipe planeja lidar com eles aumentaria ainda mais a confiança na equipe, e mostraria que eles têm uma visão multi-perspectiva e uma compreensão profunda tanto dos aspectos micro como macro do projeto.\r\nCom base na falta de informações fornecidas, discordo que esta proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Concordo que esta proposta fornece um problema muito interessante e sua solução potencial para a comunidade.\r\n\r\nCom cada vez mais controle e monopólio chegando se certos pontos de vista de qualquer escritor não estiverem em sincronia com as plataformas como google, facebook, twitter, temos visto que muitos escritores agora temem se expressar, pois ou serão bloqueados OU bloqueados das plataformas para se expressar. Portanto, na minha opinião esta solução, se implementada, dará pela primeira vez voz a tais escritores e permitirá que eles não apenas se expressem mas também sejam recompensados por isso, o fator anonimato é absolutamente importante quando se trata da implementação desta proposta.\r\n\r\nNo entanto, vejo aqui muitas oportunidades de melhoria, especialmente dando um pouco mais de detalhes sobre como este dapp irá funcionar ? pelo menos um alto nível de conjuntos de recursos e funcionalidades OU informações sobre o fluxo de trabalho teria sido melhor, já que a descrição atual é bastante abstrata. Vejo algum espaço de melhoria na escrita, portanto, 4 estrelas do meu lado.\r\n", "q0r": 4, "q1": "Do ponto de vista da experiência, os fundadores ou líderes desta proposta são bem experientes, mas, para mim, no final do dia, caberá aos desenvolvedores que implementarão esta solução\r\n\r\nPor um lado, posso entender que a equipe não pôde entrar naqueles desenvolvedores para compartilhar publicamente seus detalhes aqui por causa das limitações postadas pelo proponente na seção de comentários. Entretanto, tenho que lembrar que existem outras propostas que o fizeram, :) portanto, faz total sentido dar mais estrelas/ratings para aquelas propostas que fizeram um trabalho melhor ao se apresentarem para que a comunidade tenha maior confiança nelas.\r\n\r\nPara mim, gosto da idéia de que o proponente se propõe a pagar as taxas geradas pelo aplicativo, e isso significa que o proponente está muito comprometido com esta proposta e quer dar o pontapé inicial na implementação desta idéia. Portanto, estou disposto a dar-lhe 4 estrelas, mas algumas melhorias são necessárias, portanto, não de acordo total aqui.", "q1r": 4, "q2": "O bom desta proposta é que o proponente da idéia é bastante ativo na comunidade cardano e, portanto, proporciona boa confiança à comunidade de que ele estará disponível à comunidade para fornecer um bom roteiro sobre o projeto.\r\n\r\nEntretanto, posso ver que há muitas melhorias que são necessárias para que esta proposta tenha uma classificação completa. O plano, os KPIs e as métricas de sucesso estão faltando. Como será o sucesso ? qual é o roteiro detalhado para o MVP ? A idéia é abstrata e é sempre melhor sentar-se com seus desenvolvedores e apresentar algum plano básico sobre qual conjunto de funcionalidades seu MVP terá, quando você o implantará e quem irá auditar/ dar feedback sobre ele ?\r\n\r\nPortanto, do ponto de vista das classificações, eu lhe darei 3 estrelas, o que significa que não posso dizer com certeza como é provável que esta idéia possa ser auditada e rastreada perfeitamente.", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This idea is excellent! Proposer clearly presents the problem with writers and offers a clear solution. This proposal if implemented, would have a positive impact on the Cardano ecosystem and is clearly visible in the proposal on how it will add value to the Cardano ecosystem. Unfortunately, KPIs are not listed so it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.\r\n\r\n", "q0r": 3, "q1": "In this proposal it is clear how the proposer is looking for developers who would realize this idea. It would be good to know who is behind this proposal. Maybe some link from a proposer via LinkedIn or a website. The bearer of the idea does not have the necessary skills and knowledge needed for the realization of this idea. But if he could find developers with experience, knowledge and the necessary skills, the project surely could be realized. The proposer clearly communicates how many developers are needed in the team and most of the requested budget that is clearly presented would go to external collaborators aka developers. The budget is reasonable and broken down into identifiable items. An additional funding is required to implement the proposal but the proposer states that they will be borne by the founder and the devs. Proposer does not specify a detailed implementable plan and details of actionable tasks and order of execution are missing. Unfortunately, there is no more detailed timetable to complete the work and the possible risks have not been elaborated. In the proposal we can find the necessary resources to implement this idea but it would be better to present them in more detail. The explanation and technical aspects and technologies required for implementation are missing.", "q1r": 2, "q2": "It would be good to have an elaborate roadmap with milestones and a time frame within which the idea would be realized. It is also necessary to present KPIs with which the success of this proposal could be measured. Unfortunately the community can't follow the development of this project in any way due to the lack of necessary data.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I find it difficult to see an app like this becoming popular at this time. \r\nThe DApps success defined as attracting users to Cardano. The service that this app aim to provide is not appealing enough compered to many other apps proposed in this challenge.\r\nThere are many platforms for publishing, and readers will not pay for more texts that in the current environment.  ", "q0r": 2, "q1": "The experience \r\n of the proposer seems legit, but there is a lack of information about the rest of the team - in the proposal it specified - \"3 Developers \r\n• Front End, Back End, UI\"\r\nBut there are no names. Is those developers are already part of the team or the plan is to recruit them later? It is not clear. ", "q1r": 3, "q2": "There are no KPIs. ", "q2r": 2, "assessor": "z_assessor_871", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The problem stated is the lack of publishing platforms for writers. I assume StoryTime would be the decentralized version of Amazon KDP publishing, instead of a blogging platform. If so, then this proposal fits the Challenge's needs and could drive more adoption. But if it's a blogging platform, then Publish0x and Steemit is already providing a solution. This proposal would benefit from having a clear statement on its unique selling point. What does safe and decentralized environment mean? Amazon KDP publishers face the risk of being taken down and their funds frozen if the subject material does not meet their requirements. Are StoryTime writers protected from this? There is also no KPI on how the success of this project can be measured. The proposal can be much stronger if these details are added.", "q0r": 2, "q1": "\r\n\r\nNot enough time is spent on the technical aspect of the proposal. The proposal has a clear idea on the manpower needed for the job, but comments seem to reveal that the developers are busy with full-time jobs until January. The team's linkedin/github profiles should be shared to add credibility to the proposal. The dev cost for an MVP product is $32,000 and $9,200 is paid to the founder. More details on StoryTime's implementation needs to be included to justify the money involved. The proposal could also benefit from a section on the risks involved: what if there's too low of an adoption? What if no one finds out about StoryTime? How would censorship or quality management of published content be enforced? Just a few questions that come in my mind.", "q1r": 1, "q2": "No roadmap with milestones for the MVP. No metrics to measure success of the project as well. The proposal would benefit from sharing some technical details as well as expected number of users/sales/books published. Maybe a comparison to Publish0x and Steemit would help? Like a chart showing the differences.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Queremos criar um mercado para que eles vendam seu trabalho e sejam compensados de forma justa em um ambiente seguro descentralizado através de um DAPP.", "experience": "Fundador do Cardano Outreach um vencedor do fundo4/6. Mais de 20 anos de experiência como manjedoura, empresário e educador."}