{"id": 384826, "author": "albert.feghaly", "title": "OpenScienceNFT Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384826-48088", "category": 26240, "amount": 23700, "description": "O conhecimento científico é frequentemente trancado atrás de paredes de pagamento, apesar de ser financiado em sua maioria pelo público. A ciência deveria ser mais acessível.", "funded": 2, "upvotes": 229711277, "downvotes": 6106817, "votes_result": 223604460, "votes_cast": 1322, "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Uma proposta muito bem articulada e apresentada que se encaixa perfeitamente com os cenários de desafio.  A declaração do problema é fácil de entender e, sendo eu mesmo um Engenheiro de Software, tenho visto em primeira mão situações onde muito bom conteúdo/trabalho científico não está disponível para o público em geral, mesmo que o financiamento venha de domínios públicos.\r\n\r\nEsta proposta, se implementada com sucesso, está tentando resolver tal problema e fornece um olhar profundo sobre a variância múltipla deste problema.  A proposta já considerou o quadro legal que será importante para realizar o sucesso desta proposta. Portanto, em minha opinião, esta proposta terá um bom potencial não só para melhorar a força da rede cardano, mas também se alinha com a visão e objetivo do cardano, ou seja, ter um mundo de oportunidades iguais para o futuro.", "q0r": 5, "q1": "A equipe desta proposta já obteve um financiamento bem sucedido na rodada anterior, e esta proposta se baseia no trabalho que foi prometido/direcionado na proposta do Fundo 6.\r\n\r\nA experiência da equipe está disponível ao público, e a última atualização da equipe é rotineiramente atualizada no link fornecido na proposta.\r\n\r\nO plano é muito ambicioso, e um layout detalhado foi fornecido tanto do ponto de vista dos olhos das aves (para ter sempre uma visão geral) como ao mesmo tempo uma descrição detalhada sobre as estratégias de monetização da OsNFT. Claramente a equipe pensou no roteiro e nos marcos, e foi dado um impacto destes marcos, com marcos de execução em 3-6-12 meses.\r\n\r\nFaz sentido que, embora a equipe tenha permitido à comunidade ter detalhes iniciais sobre o roteiro a longo prazo, mas também que a equipe tenha se restringido a esta rodada de financiamento em termos de orçamento solicitado. A divisão do orçamento é justificada para mim, e tenho certeza de que a equipe terá muito sucesso e um ciclo de feedback positivo com a comunidade, levando ao sucesso desta proposta.\r\n", "q1r": 5, "q2": "Concordo plenamente que as informações aqui fornecidas são suficientes para auditar o progresso e o sucesso desta proposta. A equipe é pública e um link para seu website onde eles estão postando atualizações semanais de progresso é uma boa maneira de a comunidade manter um olho no desenvolvimento rotineiro.\r\n\r\nAlém disso, o site fornece nas diferentes fases detalhes, que cada fase espera um conjunto de características juntamente com os cronogramas estimados para ela. Isto em combinação com as atualizações semanais dá um bom ciclo de feedback positivo para a comunidade, de modo que qualquer mudança no roteiro projetado é rapidamente propagada para a comunidade.\r\n\r\nEm geral, muito detalhado e bem escrito para esta proposta e, portanto, pontos completos do meu lado.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Os proponentes querem criar um mercado acadêmico para pesquisa acessível, que poderia ser apostado, vendido ou emprestado. Há um problema mencionado na proposta de que a pesquisa acadêmica não está tão facilmente disponível, embora seja na sua maioria pública. Eu não sabia disso, mas depois de fazer um pouco de pesquisa, vejo que o problema é real e se encaixa nos cenários de desafio. A proposta acrescenta uma explicação exaustiva do valor que acrescentará para fazer o sistema cardano, trazendo mais acadêmicos para a comunidade cardano. Os objetivos da proposta são exatamente aquilo pelo qual toda comunidade se esforça: pessoas mais instruídas, pessoas de ação a bordo. Depois de ler a proposta, não tenho dúvidas de que os autores não terão problemas em escalar sua solução para se adequar aos desafios de escala que serão enfrentados. Eu li algumas propostas agora ao norte de 40 e não vejo nenhum item-chave faltando nesta. A proposta incluiria a esfera acadêmica e criaria um mercado que ajudaria também alguns acadêmicos desprivilegiados, o que é realmente nobre.  Esta é uma grande proposta, vou votar e torcer por eles!", "q0r": 5, "q1": "Os autores aumentaram sua equipe desde a última rodada de financiamento, o que foi uma agradável surpresa para mim. Isto significa duas coisas: 1. Eles foram aprovados com sucesso e já trabalharam em uma proposta. 2. A idéia deles é suficientemente boa para atrair outros acadêmicos e sua motivação. As credenciais são verificáveis, uma vez que os autores ligaram todas as equipes ligadas em contas. A equipe está se formando para ser uma equipe formissivel, pois é formada por membros de todo o mundo. O orçamento é descrito e dividido em detalhes. Há metas razoáveis e realizáveis. Não sou especialista de forma alguma no ambiente acadêmico, mas no que se refere à codificação e ao desenvolvimento, como um dev, seu roteiro e cronograma parecem sensatos e totalmente exeqüíveis. O plano de implementação parece solitário e seqüencial. Todos os recursos necessários para implementar a proposta estão listados, e vários cenários como descentralização, governança futura, assim como trazer mais pessoas a bordo, são bem pensados e detalhados. Os aspectos técnicos da proposta também são mencionados. Os idiomas e tecnologias que serão utilizados juntamente com a razão. Os proponentes consideraram os desafios e riscos relevantes para a implementação e estabeleceram metas. Eu gostei especialmente do fato de eles terem pensado em diferentes maneiras de fazer uso de sua ficha osNFT. Estes acadêmicos fizeram suas pesquisas sobre o que está disponível, e construirão sobre outros membros da comunidade construindo tijolos, que é a maneira correta de fazer o desenvolvimento de código aberto. No geral, esta é uma solução viável e mal posso esperar para que seja uma realidade.", "q1r": 5, "q2": "Ao contrário de muitas outras propostas, não estou preocupado com a traçabilidade. Em seu site vinculado, os autos criaram uma seção chamada atualizações semanais onde, eles interagem com todas as pessoas interessadas em seu projeto e dão atualizações de progresso. Mais adiante, eles planejam ter uma seção com artigos no blog sobre o que está sendo feito e como o progresso está se comunicando. Esse é um excelente canal para manter a comunidade envolvida e intrigada. Há métricas relevantes e KPIs mencionados que IMHO estão em linha com o sucesso dos projetos. Há uma visão de olho de pássaro do caminho, bem como marcos, tudo em um período de tempo viável. Uma descrição clara e compreensível do problema visado e uma descrição acadêmica detalhada e bem pensada para a solução.   Desejo-lhes o melhor. Continuem fazendo o que estão fazendo!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims for a continuing of the funding after the project received funding in the previous round. The team has been spending time and funds to research and set up a framework, deal with copyright issues and other relevant topics around creating a science marketplace in combination with an NFT model. One of the objectives is to get rid of paywalls so that more people have access to scientific papers - another objective is to reward scientists and give the opportunity for them to receive funding for future work.", "q0r": 5, "q1": "The team is multi-disciplinary and does include academics as well as developers - so the necessary skillset of the team matches the objectives and enhances the likelyhood of this proposal being implemented successfully. The prior work and the references provided are very positive and on task and it is nice to see how excited the team is about their project, I like it. I think the proposing team has done good work at looking at the necessary issues that come with creating such a marketplace, which is good. I´m an academic researcher with more than 7 years of experience both as a peer reviewer as well as a published academic in peer reviewed academic journals. While I think that the process of reviewing the quality of a paper or a study could be improved, I do not believe that the peer review process is meaningless, I find it important that internal and external validity of a research design is monitored to ensure that . The way that this group of people are brainstorming and creating a framework to include researchers with less access to funding is great and could contribute widely to a fairer system of how science and scientists can use their research. ", "q1r": 5, "q2": "The team is a prior funded team that is now seeking additional funding to continue their work. They are providing several very thorough ways of auditing their progress, the team is very transparent, the roadmap and the goals are realistic and the budget makes sense. The skillset of the team matches the task, the work they have been doing since they got funded is very goal oriented and the project is taking shape while the team seems to be very excited about this project. Overall great.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal spells out a useful tool for the scientific community and a powerful draw for ADA adoption through NFTs.", "q0r": 5, "q1": "The team has made good headway and clearly considered many of the potential stumbling blocks for their ambitious set of goals. This is an already funded proposal that has done good work. The budget and roadmap are transparent and feasible.", "q1r": 5, "q2": "The team's credentials, a plethora of readily available resources such as github, and the well-defined roadmap all point to a transparent and auditable product.", "q2r": 5, "assessor": "z_assessor_501", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "In academic world, we didn't realize how much scientists' hard-work could be overlooked and under appreciated inside this multi-billion dollar industry (scientific publishing). This proposal deliver a solution to give that ownership back to them, the scientist, with building an OpenScienceNFT Marketplace. This project will help the academic world become decentralized and independent from the middleman (that is the publishing firm), and get royalties paid directly to the scientists. This will help not only the adoption of Cardano, but the independent scientific academy to self sustain itself without the need of publishing industries. ", "q0r": 5, "q1": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q1r": 5, "q2": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 18, "ne": 6, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by implementing NFT for researchers can publish, retain ownership of their work and distribute it to the general population in a marketable fashion. The science innovation often not available for public, despite it being mostly funded by the public. This project will be a solution to make science and knowledge more accessible for the non-scientific community. The use of NFT as main source of ownership is already common and widely accepted in the world. Should this project able to convince science community to join, it could bring more credible credential to Blockchain especially Cardano. ", "q0r": 5, "q1": "Team consist of multiple individuals with significant credential who hold PHD and Post Doc. Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides clear roadmap and requests a reasonable budget with detailed breakdown. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable, and team has explained clearly their step-by-step execution plan. This proposal is one of the best in Fund 7 and should be voted by the community.", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. So, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. This project is the one holding most potential in Fund 7 and should be voted by the community.", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Publishing scientific research is necessary for the development of human beings, it will help people to learn - understand - develop this world better and faster. And one of the big values that bring to the digital world is preventing info manipulation or fake info that is happening every day. \r\nThis project will have a huge impact on the Cardano ecosystem, not by just its idea that can drive and keep sustainable users, but also as the team points out in the proposal. ", "q0r": 5, "q1": "A part of this project was funded in the fund6 and the team finished it well, now they made this proposal for the next step of their roadmap. There, I absolutely support them in this proposal. \r\nThey have a good vision and detailed info that can help us well know about what the team will do to make the idea come true. For this fund, they have a reasonably required budget that fits with the plan in the scope of 6 weeks. ", "q1r": 5, "q2": "The team provides various ways to track and audit their project. Their roadmap and key results also are clear and detailed, which makes the auditing process easier. \r\nSure that they have a good acknowledgment about the problem context that is detailed in the referral proposal in fund 6, and that helps to better understand their solution explanation. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1}], "solution": "Com osNFTs, os pesquisadores podem publicar, manter a propriedade de seu trabalho e distribuí-lo à população em geral de forma comercializável.", "experience": "Bioinformática, Python, JS, Big Data, ML, AI, Blockchain.\nEquipe = 5 + 3 Conselheiros -> https://intellart.ca/#/team\nNível de doutorado, nível pós-doutorado."}