{"id": 384979, "author": "abehazbunjr", "title": "Smart Contract Video Streaming", "url": "https://cardano.ideascale.com/a/dtd/384979-48088", "category": 26240, "amount": 45000, "description": "Plataformas de conteúdo centralizadas e empresas de gerenciamento de artistas se aproveitam dos criadores como os únicos guardiões da monetização de conteúdo.", "funded": 0, "upvotes": 17335319, "downvotes": 23387070, "votes_result": 6051751, "votes_cast": 183, "f6_no_assessments": 3, "f6_rating": 1.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "From the description, it is unclear how it would work or increase the adaptability of Cardano.\r\n\r\nMore information is required and more work needs to be done.\r\n\r\nRating given 1. ", "q0r": 1, "q1": "The information provided is lacking more crucial information, and it is not clear how the project would proceed. \r\n\r\nThe relevant experience seems to be stated, but this is not a one-man project, therefore it would be nice to see more people implemented with relevant experience.\r\n\r\nRating given 2. ", "q1r": 2, "q2": "A detailed plan, KPI, roadmap - nothing is stated here, therefore from the proposal, it is not possible to assess whether it would be sufficient for the audit. \r\n\r\nMore information is required.\r\n\r\nRating given 1.", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nThe problem statement is clear and easy to understand in my opinion. It is true that Meta, Google, Twitch and other such giants are a gate through which content creators need to pass, if they want their content to get out into the world.\r\nThe solution however, mentions a smart contract called Looking-Glass, which would supposedly enforce distribution rights and royalties as configured by the creators, but there is no explanation of how this smart contract works, how it would be integrated with the media giants, what configuration options the content creators have etc. This is all crucial data that is missing from the proposal. \r\nThis project sounds like an integration solution (of a media platform and a Cardano smart contract), so it fits in the DApps & Integration challenge, but the proposal fails to describe how it would accomplish this. In order for it to be more clear, it would have to add details about how it would convince the media giants to be a part of this, as well as define KPI's clearly and specify a concrete, well described goal. As it stands, I strongly disagree that it effectively addresses the challenge.", "q0r": 1, "q1": "The proposer mentions that he is a Plutus student and the notes on the provided github do reflect this, but there does not seem to be much other activity there, especially in the fast few months. Aside from this, two years of Cardano experience are mentioned - this is too vague in my opinion. Try to detail what exactly you have done in the ecosystem in the future. Lastly, 14 years of experience of web analytics and managing large technical projects are mentioned, but no references are provided to verify this. It's a good idea to try to add at least a Linkedin page to back you up.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the very large budget of 45000 USD would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. As the proposers mentioned, the full plan was due at the end of November, but it does not seem to have made it unfortunately.\r\n", "q1r": 1, "q2": "There are no KPI's or a roadmap, due to the proposal being unfinished, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 20, "ne": 4, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "\"The idea of bringing Smart contracts to protect the rights and interests of content creators is a great idea. It will encourage the growth of this industry while also encouraging content creators to create more great products for the benefit of themselves and the audience, not the companies.\r\nBut let the proposal have high impact. Proposal should give a concrete plan rather than an idea\"", "q0r": 2, "q1": "\"The proposer is a full-time Plutus student with two years of Cardano experience and 14 years of web analytics and managing large technical projects. But I have not seen any evidence for the experience proposed by the proposer.\r\nBesides, the lack of a specific implementation plan and roadmap is a big limitation for the feasibility of the proposal\"", "q1r": 1, "q2": "\"The proposal needs a lot more information to define the likeliness of success. \r\nIt needs a detailed plan, some kind of justification for the requested funding, a roadmap, a risk assessment, links to web pages with additional information, maybe an infographic to illustrate what is intended to be created, metrics of success, how it could reach people. \"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "A Looking-Glass é uma instância contratual inteligente (por mídia) que faz valer os direitos de distribuição e royalties conforme configurados pelos criadores.", "experience": "Sou um estudante Plutus em tempo integral com dois anos de experiência em Cardano e 14 anos de análise web e gerenciamento de grandes projetos técnicos."}