{"id": 382026, "author": "altimario", "title": "1st universal E-learning connector", "url": "https://cardano.ideascale.com/a/dtd/382026-48088", "category": 26250, "amount": 9999, "description": "Eラーニングプラットフォームのベンダーは、データの相互運用性を妨げ、学習者は、重複するコースやプラットフォーム間でスキルを証明することができません。", "funded": 2, "upvotes": 78339375, "downvotes": 3740072, "votes_result": 74599303, "votes_cast": 183, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem is relevant, the solution has the potential to address the problem, and the proposal can be considered in the right challenge. \r\nHowever, there's still room for improvements in the solution, as it addresses the problem with limitations: \r\n- It would be relevant to students only when enough LMS companies start partnering. And the proposal doesn't describe well this important step for its success.\r\n- Without partnering and with the big LMS companies, PoLiL (the solution) will miss the biggest part of the certificates. \r\n\r\nTo improve the solution: I suggest that the proposer could strengthen the solution by playing with competitors (big LMS companies) instead of trying to move all students to other small platforms where records are going to be interoperable.", "q0r": 4, "q1": "The plan presented gives enough evidence that the proposer knows well the problem and the context around it. Information about the market, target group, and additional issues within the problem were given. The proposer has also explained the need for further support from other developers.", "q1r": 5, "q2": "MIlestone 3 of the proposal is a bit controversial. Proposer states that it's a \"This last milestone is quite a huge amount of work impossible to do from a single person in a short amount of time, but the community can help by delivering one Statement at a time.\"\r\nAt the same time, the proposer states that: \"Everything else needed to complete Milestone 3 will be covered for free by\" himself.\r\n\r\nTherefore, at least in the way that the proposal is written, it brings some weakness in an important stage of the project. There can be a risk that the project does not get to completion or sustainable evolution.\r\n\r\nI suggest including this completion in the budget or writing other strategies to ensure completion.", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "This comment \"Without partnering and with the big LMS companies, PoLiL (the solution) will miss the biggest part of the certificates.\" highlight that I have to clarify better that there is no need for any partnership, or at least a partnership is not mandatory for the success of the project.\nI wrote that the budget requested covers only milestones 1 and 2, maybe I have to clarify even better. Milestone 3, as I wrote, is unpaid work (for free) from the community and myself and it is not related to the 3 months planned for delivery of milestone 1 + 2.  "}, {"q0": "This proposal addresses an exciting idea about connecting learners and e-learning platforms that can store learning history for individuals in Cardano through a PoLiL approach. \r\nPoLiL can disrupt e-learning market by empowering the final users, and therefore for sure a proposal of high impact.  My concern is how the proposer team uses xAPI to solve the centralisation of learning records of monopolistic companies and how they effectively integrate Cardano and xAPI together. ", "q0r": 4, "q1": "It is undoubtedly that the proposer is highly qualified in IT industry. His field of expertise and impressive experience is clearly added to his background material. With a quite huge amount of work, in order to make this investment a success, he need to recruit a qualified team as it's impossible to do from a single person. Also, the plan is explained in detail. Therefore the likelihood of success can be very high. This proposal need a long-term effort by the team and community involvement. ", "q1r": 4, "q2": "The proposer provides a step-by-step action plan for implementation with clear milestones, and defined roadmap. The proposal gives a realistic timetable for personnel to complete the work and there is KPI to define success rate and goals. However, the proposer hasn't considered challenges and risks relevant to successful implementation. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "After all of these nice words, I expected at least a 5 stars :-P\nAnyway this comment \"My concern is how the proposer team uses xAPI to solve the centralisation of learning records of monopolistic companies and how they effectively integrate Cardano and xAPI together.\" is explained in \"SOLUTION & TECHNOLOGY\""}, {"q0": "I agree with the idea of ​​storing learning journey data in Cardano, where only the learner owner can access and decide to share it. This will help professionals or small companies to create their own courses with a global application that benefits many people. For those who are not experts, they will be able to monitor their learning process to improve and change the way they learn towards their goals.", "q0r": 5, "q1": "The proponent clearly provides identity information, expertise and experience related to blockchain. The implementation model and development steps are described in great detail. The proposed cost should be detailed according to the steps you have described. The proponent has also followed up on updates and answered all relevant questions about the proposal.", "q1r": 5, "q2": "The roadmap steps have been clearly stated with the timeline and the goals to be achieved in 3 months according to the criteria of the challenge, I appreciate this. The challenge and risk the proponent has also stated, it would be great if you share a bit about the extension of the proposal if available in the following funds", "q2r": 5, "assessor": "z_assessor_697", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "Fantastic!\nThis is it \"This will help professionals or small companies to create their own courses with a global application that benefits many people\", you got it 100%\n;-) "}], "solution": "学習者とプラットフォームをつなぐコネクターで、データはCardanoに保存され、ユーザーのみが自分の学習データを所有し、アクセスすることができます。", "experience": "IT業界での22年の経験は以下の通り。\n大企業や政府へのソフトウェアコンサルティング、テック・スタートアップ、AI、オープンソースへの貢献、EdTechなど。"}