{"id": 350694, "author": "Jonathan W.", "title": "Stake Pools in 100 Countries", "url": "http://app.ideascale.com/t/UM5UZBiPF", "category": 25946, "amount": 200000, "description": "How can we enable stake pool operators in 100 new countries in the next 12 months?", "no_assessments": 21, "rating": 3.761904761904762, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Cardano's main mission being \"bank the unbanked\", it is difficult to classify this proposed challenge setting as a priority. It is not clear why it is imperative to have stake pools in 100 countries for growth of Cardano. Currently, SPOs have a choice to either host nodes on bare metal, which will be locked geographically, or on cloud infrastructure, which gives them the freedom of mobility. Therefore, thriving to achieve 100 geographical locations will not provide a clear benefit to Cardano's ecosystem. A more viable option for a challenge setting would be to task SPOs to reach for Carbon neutrality or participation in Charity. Furthermore, current ADA distribution amongst supernodes needs careful consideration and review since it does not support small pool operators. Adding more small pools will not help this problem and will set them up for failure. ", "rating": 2, "c_fb": 1, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 4, "note": "Staking and the rewards connected to it are a good mechanism to spread awareness about cardano and teach operators something about the network. In addition to this, the network aims for decentralisation, so this challenge is a good idea. However, since staking usually slso is available without a stake pool in the country of a delegator, this challenge is currently not the most critical issue.", "rating": 4, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 4, "note": "The idea is very good, distribution of stake nodes across the globe is very much needed. It aligns very well with Catalyst goals. It is a simple and straight forward idea that can have a huge impact in the Cardano security and operability.", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 4, "note": "Perhaps not critical to success but certainly a valid goal that may benefit from a fund challenge. Author has produced useful submission that has received attention from PC community. I have no qualms assessing this proposal highly with some room for further development of the idea and how it would look once progressed. ", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 4, "note": "Yes, more stake pools = more decentralisation and lead to more tps in the future ", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 4, "note": "This challenge is fully aligned with the objective of any decentralized public blockchain, especially Cardano due to Cardano's own ethos in promoting decentralization in the protocol's own incentive parameters. One of the essential properties of public blockchains is decentralization and geographic distribution plays a very important role.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 4, "note": "This appears to be a proposal to promote stake pool diversification, rather than a challenge for example that could be more useful broadened to be \"how best to improve Cardano's decentralisation\" I don't believe it is controversial or needing of multiple proposals to encourage diversification these are more issues that can be addressed through network parameter modification. ", "rating": 1, "c_fb": 1, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 5, "note": "Cardano's current trajectory is evidence of organic growth and future mass adoption. Amongst Cardano Ambassadors, Local Community Centers, Community Managers, Cardano Foundation, and development arms of Cardano, the ecosystem has ways to reach global distribution on its own. ", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 5, "note": "There are plenty people that know how to set up a stake pools and can teach it to others or execute it for them. A lot of people that might not have done it before might even put in some efforts if an incentive like that is provided and they are less scared of failure costing them substantial amounts of money", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": true}, {"question": 5, "note": "I believe that the idea is good, but it would be better to divide it into smaller challenges. 100 is a great number but it would be difficult to reach that amount of people at once. It should also have some criteria to avoid having two different proposals for the same country, since this is very likely to happen. Also, some marketing would be needed in order to achieve the desired goal of 100 countries.", "rating": 3, "c_fb": 1, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 5, "note": "I believe that this challenge could certainly lead to positive outcomes and further engagement from the PC community. It certainly fits with the current mentorship (informal at present) ethos of the community. ", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 5, "note": "I believe that the definition of 2,000 USD per pool is not realistic. This encourages the creation of unsustainable operations just so that the proposals meet the challenge goal. it is necessary to establish a more sustainable definition considering how these pools will maintain decentralization for a longer period.\r\n\r\nI think the objective should focus less on the number of countries and more on geographic decentralization, legal jurisdictions and the potential duration of these operations. Perhaps establish a minimum period for these pools to operate.\r\n\r\nThis challenge establishes 2,000 USD as the minimum estimate needed to start a pool, which indicates that the 200,000 budget would be impractical to meet the target of + 100 countries with operations.\r\n\r\nLeaving the bold target aside, I believe that the challenge has the potential to significantly increase the number of countries with operations.", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 5, "note": "The community would definitely encourage diversification of stake pools and bare metal implementation, but it may not be very interested in stake pool promotion with Treasury funds.", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 6, "note": "Suggested KPIs are easy to manipulate since it is not difficult to claim various geographical locations or obtaining an extra team member to claim a different country. Giving new SPOs $2000 dollars has varying buying power around the world and will not provide a level playing field. Furthermore, the biggest investment for an SPO is their stake, which at the current valuation of ADA will run in the tens of thousands USD in order to have a slightly attractive and competing stake pool. It is unclear where these funds will be aquired. ", "rating": 2, "c_fb": 1, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "It can be seen that a lot of work was put in this proposal in defining success criteria and discussing how to measure success of the project. The challenge proposer made clear that individual propositions would be audible and clear criteria are set for success", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 6, "note": "Definition of success is very clear. The Challenge KPIs and metric are good and clear in relation to the proposed success criteria. Some information like that should also be included to assess the funded proposals in this challenge. Only negative side is the risk of receiving multiple proposals from the same country and not reaching to 100 different countries as well were not assessed.", "rating": 4, "c_fb": 1, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 6, "note": "I feel a solid effort on metrics has been provided and there is likely more that would follow. Success criteria is reasonable and would certainly show growth of the Cardano voice and therefore is a useful proposal to consider. ", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 6, "note": "I think the proposer needs to think more widely on how this could be achieved. Simple ideas like changing the SPO rankings, or changing the SPO block selection algorithms to favour geographic diversity can push this to happen by changing the economic incentives. We don't need to specifically fund the physical setup of nodes in countries. ", "rating": 4, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "Measurement seems straight forward enough; number of pools in country after 12 months ", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "Considering that there are about 195 countries around the world and dozens of those countries already have SPO operations, I think that the established objective may not be realistic, as we do not know exactly how many countries already have some type of operation, this makes it difficult to measure the established goal. Perhaps we should start by defining the number of countries that have some SPO participation (according to the criteria set out in the challenge description)\r\n\r\nThis does not make the challenge any less important, I just believe that an easier goal to be verified should be set.\r\n\r\nThe other metrics presented are good indicators for assessing success.", "rating": 4, "c_fb": 1, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "Need more metrics to assess proposals rather than success or otherwise of the challenge itself ", "rating": 1, "c_fb": 1, "no_vca": 3, "reply": "", "pc_fb": false}], "importance": "++Where is a stake pool?++  \nIn a simpler world, it would be easy to say that a stake pool is wherever the operator and the hardware are both physically located. In reality, in our modern decentralized world, there are many more permutations. A single stake pool may have nodes running on servers in multiple countries. A team running a stake pool could be spread across the globe, having never met in person. Someone may start a stake pool while living in one place, and then move to another country and continue operating it.  \nFor the purpose of this challenge, I recommend that we leave the definition of \"where is the stake pool\" to the individual proposers, so long as they can meet this minimum requirement: **there must be hardware running part of your stake pool or a bona fide team member living in the country you are claiming as your location.** Of course, you can have more: a whole team living in one country, or all of your nodes could be running on servers in a specific place, or both.\n\n  \n++Long Term: Hardware Everywhere++  \nToday, even as more people around the world gain access to high speed internet, there are many countries where it is impractical to run a reliable stake pool due to local conditions: electrical blackouts, inconsistent network connections, government restrictions, etc. The Cardano community has a vested interest in improving the availability of network access in places where these problems exist. This challenge will serve to offer specific monetary rewards for pioneers to push the boundaries of what is possible with stake pool operations, and not be confined to the existing models. And further, this challenge will highlight the limitations that exist in specific places around the globe. After 12 months, it will be very enlightening to see exactly where the geographic gaps remain, and then additional questions can be asked and challenges formulated to improve local conditions in those places to allow Cardano to flourish in the future.  \n\n++How to Measure++\n\n*   One option is the Relays page on AdaPools.org which lists stake pool relays by the country they are operating in:\n\nhttps://adapools.org/relays\n\n  \n\n*   This or some other source of stake pool geographic data will be used to collect a list of countries with and without stake pools at the beginning of the challenge.\n*   Each individual proposal in this challenge should state which country (or countries) they plan to focus on, and success will be measured by the number of stake pools operating in that country(ies) after 12 months.\n\n++Example Solutions++\n\n*   A team or SPO who has implemented a stake pool on the Testnet but lacks the capital to initiate it on the Mainnet\n*   A team or SPO who will hold remote education sessions to train those in a country where no stake pools exist\n*   Fully loaded stake pool servers (on RasPi or traditional hardware) that can be shipped to countries for easy \"plug-n-play\" setup\n*   The \"Diplomat\" approach - where an experienced SPO moves to a country without a stake pool, lives there for a few months to setup a stake pool, provide hands on training and then turns over the reins to a local team.\n*   The \"Multinational\" approach - where an experienced SPO travels to multiple countries, sets up stake pools in each, then continues to operate them remotely from their HQ.\n*   Big picture efforts (infrastructure, protocols, etc.) to bring down barriers to global expansion of the network.  \n    \n\n++Budget Rationale++\n\nWith the exception of the actual stake amount, I feel $2,000 is the minimum that someone would need to start a stake pool completely from scratch: including the cost of hardware or cloud server fees, network connection, electricity, labor, and marketing. Based on this, and the stated goal of reaching 100 countries, I multiplied $2,000 x 100 = $200,000. My hope is that some proposed solutions will find a way to spread stake pools to more countries more efficiently than this calculated estimate. It's also entirely possible that in some countries there will be some additional financial hurdles that could necessitate much more for an individual project's budget.\n\n**Important note: This is a Fund 7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of $200,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}