{"id": 350613, "author": "rich", "title": "Atala PRISM DID Mass-Scale Adoption", "url": "http://app.ideascale.com/t/UM5UZBiNv", "category": 25946, "amount": 250000, "description": "What will drive mass-scale adoption of decentralized IDs on Cardano?", "no_assessments": 19, "rating": 4.2105263157894735, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Cardano is in the early stages of becoming a platform where individuals will manage their identities, ownership, assets and more. The proposed challenge setting would allow the community to explore possible use cases utilizing Atala Prism that are outside of IOG's scope at the moment. This would accelerate outreach and mass adoption throughout industries and drive brand recognition. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I see this challenge as a very promising one, specially due to the mentioned aspects that make Cardano a great choice to use DIDs. It would be an excellent use case to bring awareness of Cardano technology. It also makes sense in this case to aim using a specific tool since it's being developed by IOHK to serve as a basis for the Cardano ecosystem. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Definitely very important to the success of Cardano ecosystem as a third generation blockchain technology. ", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 4, "note": "Proper use of DIDs is very important. A challenge to figure out different aspects of DIDs seems very important. It dhould not solely be focused on the adoption aspect, but also on the security and personal data aspects.", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "The areas the assessor thinks are missing are covered, and are the general thesis behind DID.  We wrote: Enable secure, private and (where applicable) authenticated; and Enable secure, private and (where applicable) authenticated.", "pc_fb": false}, {"question": 4, "note": "Thank you for your idea proposal. I enjoyed reading it. To improve its relevance to the Cardano community, please kindly consider the following suggestions: Rethink and revise the need to have more details like a business plan, cost breakdown excel or a project plan. The proposed metrics are spot on but recommend an overview with some quadrants or SWOT or PEST analysis.", "rating": 4, "c_fb": 1, "no_vca": 2, "reply": "The assessor might be confusing this with a proposal rather than a challenge.", "pc_fb": false}, {"question": 4, "note": "It is worthwhile to examine DID use cases. The future of self sovereignty depends on robust and actually decentralised DID and Cardano is uniquely positioned to provide it. A challenge in this area could be a good way of eliciting useful new use cases and project teams to pursue them.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Community has bright minds flocking to develop the ecosystem into a decentralized utility. There are possible use cases that the users might explore and develop with the tools available now and in the future, and in some cases with the aid of Cardano Foundation more government deals might get closed.", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "Assessing the outcomes and not the challenge.", "pc_fb": false}, {"question": 5, "note": "This challenge would be very technical and specific, and I am not sure if the Catalyst community today would have enough people involved to create 5 high quality proposals in this area. Although, this could bring new people to the experiment. I believe that the budget could be a bit lower since it's the first time that such a Challenge would should up and since this is a technical and specific field, I think it would be better to have like 150k or 200k maximum to fund only high quality proposals.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I think so. It is all well organized marketing strategies to sell the awesome benefits of the DID technology in different use case scenarios to the world. ", "rating": 4, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "Since this topic is very multi-faceted, the Catalyst community should have the perfect mix of competencies to adress this.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "Not clear this is feasible for the community. DID requires use cases. This means finding large organisations (public or private), to take on DID's on blockchains (such as the Ethiopian education system deal). These types of deals are more generally achieved through centralised marketing than a decentralised approach. However maybe across the community we have the connections.", "rating": 3, "c_fb": 0, "no_vca": 3, "reply": "Assessor didn't read the proposal if they are saying only Ethiopia etc..  We clearly wrote: This Challenge is about increasing self-sovereign ID worldwide, starting small with organizations and entities who can easily benefit from DID technology and not necessarily be a nation sate.        To our thinking, while taking 4-5 years to close a country is on par for the government adoption route, addressing smaller organizations who can benefit from DID solutions, feels like a promising parallel go to market strategy the community can advance—seeding the market with DIDs by using a grassroots, early adopter, crossing-the-chasm approach.\n\nSimilar to the route crypto in general took, even now, government is slow to fully adopt crypto, so use cases in other entities can lead the charge into DID utility and best if we can bring those into the Cardano ecosystem. While 5MM DIDs in Africa is huge, 7.5B to go still leaves a lot of upside potential!", "pc_fb": false}, {"question": 5, "note": "What I like about this proposal is that it addresses the challenge. It's a very good idea explanation and bringing Atala PRISM mass-scale adoption will be extremely important to Cardano.\r\nThe outcome and idea proposal would have been much stronger and bolder if they were sustained by additional information and data collected from solid sources in the proposed area, thereby creating a sort of triangulation in your data to be in a better position to draw such conclusions and recommendations ... making them much more credible and authentic.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Different types of use case for DID are within the capability of the community to come up with and some will be more able than others to implement.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has a great understanding of what is required to measure performance and success of the project, and has identified areas to track data for assessment. Following these KPIs should provide with sufficient understanding of the progress. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "As I see, the main key metric in this Challenge would be how many places Cardano reaches out to due to the proposals submitted in this challenge, and also how many daily users, as already mentioned in the possible campaign brief. Other specific metrics should be included based on specific use cases for DIDs, but the ones mentioned are a very good start point.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The Success Metrics and Criteria can effectively address the challenge.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria are clear, however a bit narrow as they are very focused on one aspect. The metrics could be more diversed and consider more aspects of the topic to enable more diverse proposals. Overall, they are executable, bit still there would be more potential.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "More though needs to go into the metrics. A proposal should be accepted based on potential number of users and their repeated interactions. We also want to encourage diversity of uses cases. We don't want to fund multiple applications in the same industry or geography, as these have less impact going forward than different use cases which can really grow adoptions. Use cased which engage users to other interactions with the Cardano blockchain should also be valued highly.", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "Again, not a proposal, a challenge.  The metrics are clear.  Key Metrics to measure\n* The number of proposals that directly address DID use cases in a quantifiable manner.\n* The quality of proposals measured by community interest and engagement.\n* Results of any Fund7 funded projects significantly impacting mass-scale adoption of DID's and their utility on the Cardano blockchain.", "pc_fb": false}, {"question": 6, "note": "More detail on how particular DID proposals should be differentiated would be useful, as well as capability and processes the proposers might use in developing them, as well as business plans as necessary to implement them.", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "It is not the job of this Challenge to detail how proposals should differentiate themselves, nor the processes or tools they should use, and certainly not to explain they need a business plan.  ", "pc_fb": false}], "importance": "**INTRODUCTION**  \n*VOTERS PLEASE UNDERSTAND: This is a Fund 7 COMMUNITY CHALLENGE others will make proposals to the challenge. It is NOT a proposal itself. Therefore do not expect to see the same thing you see in proposals, like teams, solutions and budgets. The proposals who apply for this CHALLENGE create those things.*  \n\n***THE CHALLENGE:***\n\n*Propose a means or way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem (preferably Atala PRISM when released). This can include any method that will offer users or entities a decentralized ID to start defining their digital self-sovereignty. Think about how this is implemented at scale drawing millions of users, who, once onboard, can become customers for dApps, tools, DeFi and other services.*  \n\n**WHY THIS IS IMPORTANT TO GROW CARDANO**\n\nWe are a community of thought leaders and it is time to demonstrate our thoughts with actions. Using a Decentralized Identification (DID) technology to establish self-sovereign presence and ownership of Personally Identifiable Information (PII) advances decentralization of institutions; benefiting individuals and entities.  \nThis Challenge is about small ways we can incorporate DIDs into the Cardano ecosystem to start the ground swell at the grassroots that demands PII be secured and controlled with DID technologies and standards.  \nIt is about **signaling to the world** that the Cardano community plans mass-adoption of DID that is interchangeable, interoperable (by WW DID standards) and **we care deeply that the origin of our personal DID is tied to our home blockchain—Cardano.**  \nWhile we prefer to support Atala PRISM's instantiation of DID, this is more about building ideas and concepts that require DID to draw users to the Cardano platform. And since PRISM is building to the open standards, those are available for anyone to imagine possibilities and offer proposals.  \nIt won't be lost on IOHK how the community responses to this Challenge. Should IOHK see a ground swell of great ideas and proposals, that could help them justify expediting timelines for their planned open sourcing of PRISM components.  \n\n**THE ELEPHANT IN THE ROOM**\n\nWill Atala PRISM be open source? Yes, in a phased approach while keeping some items proprietary, has been explained in several TH and CH videos. This offers lots of room for the community to build on those standard protocols that will be open source.  \n\n++PUBLIC INFORMATION ON ATALA PRISM++\n\nIOHK is working on Atala PRISM and will be releasing it in phases with protocols open source.  \nBelow are details that have been publicly released from the Product Management team of Atala PRISM:  \n\n**Mark Griffin, Product Manager TH Jan 28, 2020 Comments**\n\n\\* There is a mobile app on IOS device. We also have Android app too.  \n\\* The next release of the mobile Apps will have a lot more features and functionality!  \n\\* Not just educational degrees but it will be generic to handle the issuance of all types of credentials . E.g civic records.  \n\\* Currently Atala PRISM mobile apps are native. Please check them out. We have some exciting features coming in next update.  \n\\* The browser wallet is not available publicly yet.  \n\\* We are currently working on SDKS and these will be available in development portal.  \n\n**Dynal Patel, Senior Product Manager TH Jan 28, 20202 Comments**\n\n\\* Hi everyone, We intend to open source the PRISM platform. We're working through when that will happen  \n\\* Also it will be possible to build many front ends for PRISM. We should mobile Apps right now but plan to extend that to other platforms, hardware included. We hope the community will build some of these too  \n\\* We are aligning the PRISM architecture to what is specified by DIF / W3C. Many things are specifications and not standards yet. \\* We are tracking them and contributing to standardization.  \n\n**RATIONALE**\n\nFeedback suggests most people need help imaging use cases for PRISM beyond turning large governments on with DIDs and can't imagine other use cases in smaller entities or organizations.\n\n  \n\nTo our thinking, while taking 4-5 years to close a country is on par for the government adoption route, addressing smaller organizations who can benefit from DID solutions, feels like a promising parallel go to market strategy the community can advance—seeding the market with DIDs by using a grassroots, early adopter, crossing-the-chasm approach.\n\nSimilar to the route crypto in general took, even now, government is slow to fully adopt crypto, so use cases in other entities can lead the charge into DID utility and best if we can bring those into the Cardano ecosystem. While 5MM DIDs in Africa is huge, 7.5B to go still leaves a lot of upside potential!  \n  \n\nThis Challenge is about increasing self-sovereign ID worldwide, starting small with organizations and entities who can easily benefit from DID technology and not necessarily be a nation sate.\n\n++BUDGET RATIONALE++\n\nI propose a $250,000 budget which would accommodate five (5) $50K submissions on average and give each a fair shot of making something that could make a significant difference in the ecosystem.\n\n**WHAT SHOULD BE PROPOSED**\n\nProposals should be framed towards specific use-cases, and the community will know of specific cases where DIDs or Atala PRISM can be used to solve identification problems. Focusing on DID in general may be most productive, with a strong focus on Atala PRISM if it is appropriate.  \n  \n\nWe believe many community members will have good ideas on where it could be adopted and believe at a functional level, the community has a lot to say about it.\n\nThis is important for Cardano's future and could be the base for many dApps on Cardano where it is vital to uniquely identify the other party. This is a call for exploring the possibilities where DID or specifically Atala PRISM could be one of the services that drives mass user adoption of Cardano.  \n  \n\nThis is a huge topic with importance to not only Cardano, but blockchain and cryptocurrency in general and will have a global impact.\n\n**EXAMPLES FOR PROPOSAL INSPIRATION**\n\n++++Identifiers and Discovery++++\n\nA key piece of the decentralized identity equation is how people, organizations, and devices can be identified and located without centralized systems of identifiers (e.g. email addresses).\n\n++Authentication++  \nDesigning and implementing DID-based authentication across a wide variety of exchanges and use cases.\n\n++Claims and Credentials++  \nThe ability to verify the claims and assertions of identities is key in establishing trust among entities on a decentralized system that lacks a centralized hierarchy. Integrate DID-signed claims into apps and services.\n\n++DID Communication++  \nEnable secure, private and (where applicable) authenticated message-based communication, where trust is rooted in DIDs and depends on the messages themselves, not on the external properties of the transport(s) used.\n\n++Secure Data Storage++  \nEstablish ways for secure data storage (including personal data).  \n\n**POSSIBLE CAMPAIGN BRIEF**\n\nDID use case development is mission critical because user adoption will have a key role in determining the future utility and value of Cardano. That's why we are looking to the Project Catalyst community to refine and answer our challenge.  \nOver time, development opportunities on Cardano will evolve to include everything from DIDs, metadata to KEVM/IELE, Plutus, Marlowe and more. Ultimately, the goal here is best summarized by the question:  \nDid the funded DID use cases manage to drive user-adoption?  \nTo find out, we might track the following metrics:  \n\\* How many daily active users?  \n\\* How much daily local token volume increased?  \n\\* How many transactions were made?  \n\\* How much funds were transacted?  \n\n++Guiding questions++\n\nWhere are gaps in the market where DIDs originating on Cardano have a unique advantage?  \nWhat kind of DID solutions can already be developed in the next six months?  \nInspirational potential directions  \nThe community open roadmap contains a \"Use cases\" section and \"Driving adoption\" section that can serve as an inspiration for proposers.  \n\n++Developer resources++\n\nFor access to all currently available developer tools and guides, visit our developer site. Further documentation can be found here.  \n  \n\nMeanwhile, here are some quick links you can start with:\n\nhttps://atalaprism.io  \n\n++DID Standards++\n\nDecentralized Identity Foundation (DIF)  \n**https://identity.foundation/**  \nThe World Wide Web Consortium (W3C)  \n**https://www.w3.org**  \n**https://www.w3.org/TR/did-use-cases/**  \n\n++Metadata++\n\nMetadata tells the story of transactions made on the blockchain. Cardano is working to provide cutting edge tools for embedding data into transactions and while adding robust search functionality in the block explorer. Check out our blog on metadata or look at our documentation for more information.  \n\n++The Marlowe playground++\n\nMarlowe is our bespoke domain specific language (DSL) built for creating robust financial smart contracts on Cardano. For a closer look at Marlowe check out our recent blog or check out our overview on the Cardano Developers page.  \nChallenge budget in USD. Only use numbers! No symbols, letters, fractions.  \nWhich of these definitions apply to you? Entrepreneur, Marketing professional"}