{"id": 350604, "author": "drakemonroe", "title": "DeFi/CeFi Cardano&...TBC in Fund 7", "url": "http://app.ideascale.com/t/UM5UZBiNm", "category": 25946, "amount": 400000, "description": "How can we create an environment for seamless (no extra fee/delay) integration b/w ADA and FIAT?", "no_assessments": 25, "rating": 2.84, "videos": ["https://www.youtube.com/watch?v=wWzxaHoiEZc&start=7210&end=8093"], "media": [], "assessments": [{"question": 4, "note": "Whilst this would be great to have, there are ways to achieve it using other intermediaries which already handle the FIAT side such as centralised exchanges, payments providers (VISA/Mastercard/paypal) and other cryptocurrencies. If people can directly earn ADA and can spend it on real world goods and services, the need to convert to fiat diminishes.", "rating": 3, "c_fb": 0, "no_vca": 3, "reply": "states how it would be \"great to have\" but dimineshes it because exchanges exist", "pc_fb": false}, {"question": 4, "note": "IOG's vision for Cardano is to build it into the next world financial system. Exploring further into DeFi/CeFi options and tapping into the community resources might reveal some exciting opportunities worth exploring early on. 4 stars given since IOG is already on track to finish laying foundation in this segment and DeFi proposals have been previously funded, as well being discussed in the current fund. ", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 4, "note": "The proposal is well aligned with Cardano's mission to become a central technology in the future, although I am not sure if such a solution is completely feasible. In the near future, most country will have regulations regarding transactions and it will not be as easy as it is today to send money abroad without paying the usual taxes. Although, I believe such a solution could still have lower taxes than the current methods.", "rating": 2, "c_fb": 1, "no_vca": 3, "reply": "states it's mission critical, yet ranks a 2", "pc_fb": false}, {"question": 4, "note": "This is indeed an important challenge that should be implented sometimes soon in the future, especially since it will potentially make access to ADA easier. The amount of set budget however is very high and there is no rationale why it needs to be that high, even, after it was asked for in the comments.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Seamless conversation of fiat and ADA is definitely critical to mass adoption of ADA and blockchain as a whole. Replacing 3rd party wallets such as PayPal, Zelle, etc., with decentralized apps will certainly increase adoption. ", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 4, "note": "A challenge that promotes the integration of ADA with FIAT is something that is in line with Cardano's mission, but a reference timeline for the challenge has not been defined, which increases subjectivity.\r\n\r\n\r\nOne of the requirements of the checklist is that the challenge does not include the endorsement of a specific proposal and the proposer is referencing his proposal:\r\n\r\n\"I have a solution, which will be given in Fund 7 (I'm not saying this in attempt to corner the challenge. I'm telling you this so you know it's 100% feasible.)\r\nThis Proposal Solves the \"Philippines Problem\".\r\n* Proposal received over 200 Kudos in previous funding round.\r\nOnce the transition between $ ADA and FIAT and back is easier and cheaper for consumers than going from one FIAT to another (ex: USD to YEN), $ ADA will become a world currency by default…\r\nThe funding request amount is due to not only cost of development but also the creation of liquidity pools. \"", "rating": 2, "c_fb": 0, "no_vca": 3, "reply": "challenge setting is completely open ended", "pc_fb": false}, {"question": 4, "note": "I would have loved to see greater detail on the timeline. If a more detailed plan can include a budget estimation and how development will be carried out in real-life terms might the assessments. Also - with regards to metrics. It is great to use a metrics framework with concrete examples of goals and objectives & targets.\r\nIs there any way to quantify this? Other than that - it doesn't have much context without quantifiable measurements that could convey this message.\r\n", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "challenge setting requires no solution be given", "pc_fb": false}, {"question": 4, "note": "It is indeed important to have a multiplicity of reliable and secure rails for interaction with the legacy financial system. DBS and the Monetary Authority in Singapore are looking at a blockchain ledger agreed by traditional finance participants to manage foreign exchange in Asia and there may be opportunities for example for Cardano and its rails, whether by DEX or other means, to interact with it. It may be worth thinking through particular proposals for use as a currency which your proposal seems to be focused on. It is worth pointing out that there are many blockchains and other networks competing to be financial rails for interaction with the payments system, including all three of the main payment services providers globally, and Cardano may be more likely to be adopted for back-end interoperation and specific use cases than for general retail \"front end\" payments. That said, partnerships such as that with COTI are interesting and are definitely worth encouraging. ", "rating": 2, "c_fb": 0, "no_vca": 1, "reply": "speaks on importance, yet ranks 2", "pc_fb": false}, {"question": 5, "note": "A critical problem here is national governments which control who can interact with their currencies. Look at what the US does with its currency imposing sacntions and blacklists on individuals, companies and countries and imposing large fines and threat of removal from the ability to conduct business in USD to anyone who fails. Look at the $6 billion fine and 1 yr banning of USD transaction in NY given to Society Generale.", "rating": 2, "c_fb": 1, "no_vca": 4, "reply": "comments focused on possiblr limitations to solution and not on challenge setting", "pc_fb": false}, {"question": 5, "note": "DeFi/CeFi has been booming in the blockchain sector in 2020, creating some seasoned developers, fin-tech professionals who could lead the pack within Cardano community. With the successful Goguen release and proved track record, these individuals will be looking to apply their knowledge on a proven platform. Currently, Catalyst development community is spread thin over various challenges and proposals, but has high enthusiasm and spirit to take on new projects. It is still early on to expect any major developments in this area from the community, but nonetheless possible to achieve results. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I believe that the Catalyst community would be able to submit good proposals to this challenge since it has a similar technical side as the DeFi challenge, and this one has great proposals already. Although, there are probably taxation problems that might make it unfeasible to create such a seamless, almost zero taxes international transaction system.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "While there might be groups within the community that have the dkills to work on such a solution, financially this will be challenging considering the amount of funds demanded.", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "mights and maybes are the foundation of challenge settings, not their limitation", "pc_fb": false}, {"question": 5, "note": "The Catalyst community certainly has the capacity to address this challenge with the diversity of skills and perspectives available within the community.", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 5, "note": "There is no clear description of potential directions in this challenge, this makes it difficult to assess how feasible this is / what type of proposals may arise from this challenge.\r\n\r\nThere is an idea of integration in stores, user adoption of ADA, broader audiece served, but I consider these aspects to be very broad and subjective. In addition, most of the proposal description is the endorsement of a specific solution, which is against the self assessment checklist filled by the proposal creator.\r\n\r\nA challenge with such a broad scope would result in difficulties in the assessments phase.", "rating": 2, "c_fb": 0, "no_vca": 2, "reply": "comments focused on solutions not the challenge setting", "pc_fb": false}, {"question": 5, "note": "It's recommendable a more understandable view of the proposed metrics and how the value can bring ROI and value to the entire Cardano ecosystem.", "rating": 2, "c_fb": 1, "no_vca": 2, "reply": "a challenge setting cannot give a full ROI", "pc_fb": false}, {"question": 5, "note": "There are community members with links to the legacy financial system that can help participants in it think about the advantages of using Cardano to make traditional finance more efficient and to build new products that integrate with it, and these should be encouraged. It may need some refinement of your challenge to get a really professional engagement in that regard through.", "rating": 3, "c_fb": 0, "no_vca": 2, "reply": "challenge setting, not a solution", "pc_fb": false}, {"question": 6, "note": "If the problem is to bring in FIAT to ADA seamlessly, then the metric should be the number of currencies and jurisdictions this is able to be done in, probably weighted by population an/or GDP of the currencies. It could also be useful to measure the number of entities through which these transaction can be done, again possibly taking into account the volume of transactions these entities undertake.", "rating": 2, "c_fb": 1, "no_vca": 2, "reply": "metrics were possible examples, as this is a challenge setting", "pc_fb": false}, {"question": 6, "note": "The proposer needs to search for more feedback to expand their KPIs listed. Given the amount set for the challenge and the category in question, more data needs to be considered for collection in order to better understand the direction of development. ", "rating": 2, "c_fb": 1, "no_vca": 2, "reply": "this is the point of a challenge setting", "pc_fb": false}, {"question": 6, "note": "It is unclear how (international) transactions as a form of commerce are distinguishable from other wallet to wallet transfers.", "rating": 2, "c_fb": 0, "no_vca": 2, "reply": "doesn't consider CeFi aspect into comments", "pc_fb": false}, {"question": 6, "note": "The metrics included in the proposal are good, and it could also include some others like 'money saved in comparison to traditional international transactions' and some others that shows that this is a better solution than the current financial system. Although, risks of taxation from some countries, such as the US that current has some strict rules about this, should be assessed as well and should be taken into consideration when creating these metrics.", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "comments focus on solution, calls criteria good, yet ranks challenge setting 3", "pc_fb": false}, {"question": 6, "note": "The criteria and metrics are sufficient and measurable. However they might be a bit biased, as the proposer indicates he already has a solution for the challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria and suggested metrics are rather broad and could be refined further, although, they are sufficient to measure progress.", "rating": 3, "c_fb": 1, "no_vca": 3, "reply": "\"sufficient metrics\" for success but no comments on the importance/relevance to community", "pc_fb": false}, {"question": 6, "note": "The suggested success metrics are relevant if they are measured against the proposals resulting from this challenge, but the lack of a timeline for indicating impact makes these metrics subjective. I recommend including a time horizon for evaluating metrics.\r\n\r\nThe definition of success is very subjective, I think more tangible goals are necessary.", "rating": 2, "c_fb": 1, "no_vca": 2, "reply": "can't give a timeline on a challenge setting", "pc_fb": false}, {"question": 6, "note": "There is no detailed project plan included in this proposal or attachments", "rating": 2, "c_fb": 0, "no_vca": 3, "reply": "this is a challenge setting, not a solution.", "pc_fb": false}, {"question": 6, "note": "It is certainly useful to try to measure the ways in which the Cardano network interacts with the legacy financial system but I think the challenge needs more work to elucidate what metrics and criteria can be used to make judgements about that and to encourage specific proposals for partnerships that can engage it. It might be worth thinking for example about how to approach governments, agencies, exchanges and companies which IOHK and the Cardano Foundation have not yet had the bandwidth to approach, and ways that interaction with them could be encouraged and measured through proposals in response to the challenge.", "rating": 1, "c_fb": 2, "no_vca": 5, "reply": "comments seemed constructive. Anything stated as \"useful\" doesn't warrant a 1", "pc_fb": false}], "importance": "**Why do we need this type of environment?** To become a World Financial OS. THIS is how we change the world.  \nI have a solution, which will be given in Fund 7 (I'm not saying this in attempt to corner the challenge. I'm telling you this so you know it's 100% feasible.)  \n**This Proposal Solves the \"Philippines Problem\".**  \n\\*Proposal received over 200 Kudos in previous funding round.  \nOnce the transition between $ADA and FIAT and back is easier and cheaper for consumers than going from one FIAT to another (ex: USD to YEN), $ADA will become a world currency by default…  \nThe funding request amount is due to not only cost of development but also the creation of liquidity pools."}
