{"id": 350697, "author": "Greg Bell", "title": "A.I. & SingularityNet", "url": "http://app.ideascale.com/t/UM5UZBiPI", "category": 25946, "amount": 400000, "description": "How can we create a mutually beneficial partnership with SingularityNet and other A.I. developers and researchers?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "**++Marketplace/News++**  \nSome facts  \n**Microsoft**\n\n*   **Is acquiring Nuance for $19.7 Billion -** to deliver new cloud and AI capabilities across healthcare and other industries  \n    **McKinsey estimates** AI techniques have the potential to:\n*   **Create between $3.5T and $5.8T in value annually** across nine business functions in 19 industries.\n*   **$2.6T additional value in Marketing and Sales**\n*   **$2T in Supply Chain Management and Manufacturing.**\n*   **$200B in value to Pricing & Promotion**\n*   **$100B to Customer Service Management** in Retail.\n*   **Have an 11.6% impact on Travel industry revenues**\n*   **Have a 10.2% impact on High Tech**.\n*   **In 69% of the use cases in the study, AI and deep neural networks improved performance** beyond what existing analytic techniques were able to deliver  \n    **SingularityNET was born from a collective will to distribute the power of AI.**  \n    SingularityNET is a *full-stack AI solution powered by a decentralized protocol* and the first and only decentralized platform allowing AIs to cooperate and coordinate at scale, removing one of the major limiting factors to AI growth today — the lack of interoperability — which severely restricts the ability to leverage the strengths and capabilities of individual AIs.  \n    SingularityNET enables anyone to take advantage of a global network of AI algorithms, services, and agent. No longer must AI technology exist in silos, only capable of operating within a specific company, infrastructure, or industry.  \n    Sophia, the world's most expressive robot, is one of our first use cases.  \n    https://www.youtube.com/watch?v=LZkADy2RRoA  \n    **Artificial Intelligence will be a driving force this century.** It will be at least as big as cryptocurrencies and blockchains.  \n    **The Singularity community has put their trust in Cardano by voting overwhelmingly** to risk the value of their AGI tokens by issuing new AGI tokens based on Cardano and moving swiftly from Ethereum to Cardano. We can reward that trust and recognize the risk they took by dedicating a community challenge to them and their field of endeavor.  \n    The speed and efficiency of Cardano combined with the possibilities of SingularityNet will make a great partnership that sets both communities apart from other cryptocurrencies/tokens and drives enormous growth and value.  \n    Also… I want a world for my kids and community where Artificial Intelligence's goals are as beneficial and ethical as Cardano's  \n    **What does success look like**\n*   SingularityNet teams and individuals arrive on Catalyst enthused by the possibilities for proposals and funding.\n*   Catalyst users get exposed to SingularityNet's technologies and get excited by the ways they could be used.\n*   Great collaborations happen before, during and after the challenge.\n*   The challenge is looked back on as part of the beginning of a great partnership between two crypto communities.  \n    **Guiding questions**\n*   What do SingularityNet's technologies make possible?\n*   Where can AI + Cardano benefit society  \n    **Potential directions**\n*   AI improvements to help project Catalyst scale to many times its current size\n*   AI projects that fire the community's imagination and enthusiasm\n*   Knowledge base & Documentation\n*   Samples, recipes and templates\n*   Hackathons  \n    **Budget**  \n    **++US$400,000 in ADA:++** *I struggled with this. 1/2 a million dollars is a catchy headline for the crypto media and the SingularityNet community to feel good about. But it is more than half the total budget. If the total budget was 1 Million or more it would be an easy decision and I would propose 1/2 a million regardless. But proposing that much might prevent it from getting over the line and winning the vote. In the end I decided that half the total budget emphasized that Cardano and SingularityNet is an equal partnership.*"}