{"id": 350798, "author": "JO8N", "title": "PROJECT CATALYST'S FIRST NFT ART 🌅", "url": "http://app.ideascale.com/t/UM5UZBiQx", "category": 25946, "amount": 800000, "description": "**Can Project Catalyst's first NFT art draw a worldwide Declaration of Independence?🌎🌍🌏**", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "**Can Project Catalyst's First NFT Art draw a worldwide Declaration of Independence?** 🌎🌍🌏\n\n  \n**Yes**, because **decentralization is localization**, and **money is only as good as its art**.\n\n  \n\n(The following is only **my example** of Project Catalyst's First NFT Art, but **it is not THE solution**.)\n\n  \n**VISION** 👀:\n\nUtilizing the **synesthesia of sight and sound** **through abstract representation** as seen/heard in \"Idle, Torrent,\" our NFT can appeal to a **worldwide audience**.\n\n  \nThis worldwide audience can be **educated visually on the mechanics of the Cardano Roadmap/Logosphere** (Ouroboros, Daedalus, ADA, Voltaire, Catalyst etc.) and **educated philosophically through a** **chain reaction** as seen in \"3M Brand Rube Goldberg Machine.\"\n\n  \n\nThe depiction of this chain reaction through digital **Japanese style 2-D animation** as seen in \"Machine 機械 Sakuga MAD 2\" can boost participation in Japan, where Cardano's Initial Coin Offering took place.\n\n  \nBy **directing this Japanese style 2-D animation from the actual Cardano Source Code script** as seen in \"How to Create Word Cloud Text Portrait Designs!,\" the **gap between programming and non-programming language can heal**.\n\n  \nIf this programming and non-programming language barrier heals, **inconceivable possibilities materialize** as seen in the **commercial success** of the \"Matrix He is the one 1080p Full HD.\"\n\n  \n**A commercial success of Project Catalyst's First NFT Art is the fruit of the Cardano network's labor**. \"How Trees Secretly Talk to Each Other in the Forest | Decoder.\"\n\n  \n**NFT SHOWCASE 📽:**\n\nThe **biggest issue facing NFT art is how to showcase** the certifiably purchased art.\n\n  \nI propose a solution using **movie theaters**, which have the largest ubiquitously available screens and social seatings, to **showcase Project Catalyst's First NFT Art** 🌅.\n\n  \nIf Project Catalyst is successful in displaying its art in a movie theater using a **proof of concept approach to identity certification with NFT**, not only will sale price and media attention increase, but also, the cultural foundation for **Pokemon style NFT \"battles\" at movie theaters** becomes a real possibility.\n\n  \nWith the media attention surrounding public support of Gamestop and AMC, Project Catalyst can show one solution to the public that conventional finance never would.\n\n  \n**BUSINESS🤑:**\n\nAnimated films announce rates of **anywhere from $10,000 to more than $200,000 per minute**.\n\n  \nWith this huge range, I think it is **safe to assume closer to the $200,000 mark with the complexity of my proposed task** (with a length between ~3:14 to 7:12).\n\n  \nHowever, with the fresh Cardano market, the Project Catalyst stamp of approval, the work with NFT-DAO, the media attention, the sale price, and the showcase use case, it is a **big risk for a big reward.**\n\n**Using a Multi-Level Marketing style rewards based system with ADA for larger contributions and NFT for smaller contributions, we can give merit based rewards for each section of the completed work, no matter how small. This will facilitate the division of labor and create an assembly line system. A finder's fee can be given to community members that find specialized labor, including animators, a venue owner, musician, programmers that draw etc.**\n\n**AUCTION ✋:**\n\nAfter the showcase of Project Catalyst's First NFT Art, an **auction reaction livestream** by Charles Hoskinson (and potentially other IOG members) to the bidding would be ideal (if said people wanted to of course.)\n\n  \nIn addition, the **auction's bidding would take place in Fibonacci numbers** **to produce maximum excitement**.\n\n  \nThe NFT smart contract would embed this logic as well, so later sales maintain the Fibonacci sequence.\n\n  \n**PROJECT CATALYST COMMUNITY BUILDING🔄:**\n\nThrough the lens of this Fund7 challenge proposal, I believe **every current Fund5 challenge setting can be adapted to further the use case of Project Catalyst's First NFT Art**.\n\n  \nCommunity members can **feel free to propose ideas in collaboration with this proposal in Fund5 challenges**.\n\n  \nKeep in mind, **80% of Internet traffic (data wise) is video**.\n\n  \nTherefore, **all Fund5 challenges combine for $1,700,000 and 80% of Fund5= $1,360,000**.\n\n  \nThis would be an **unheard of collaboration within the community**, so an unheard of figure is not out of the question in my opinion.\n\n  \n**Project Catalyst sponsored the framework for NFT-DAO, but now, what funds are available for the DAO to make an NFT?**\n\n**TLDR**:\n\n\"Idle, Torrent\" https://www.youtube.com/watch?v=6gH7maR3XPE **+** \"3M Brand Rube Goldberg Machine\" https://www.youtube.com/watch?v=GEzcO3nfjZk **+** \"Machine 機械 Sakuga MAD 2\" https://www.youtube.com/watch?v=TneoJDExtN4&t=262s **+** \"How to Create Word Cloud Text Portrait Designs!\" https://www.youtube.com/watch?v=RtUum5zB8Oc **+** \"Matrix He is the one 1080p Full HD.\" https://www.youtube.com/watch?v=zYwdzYC3uUc&t=70s **+** \"How Trees Secretly Talk to Each Other in the Forest | Decoder.\" https://www.youtube.com/watch?v=7kHZ0a_6TxY **\\= Project Catalyst's First NFT ART 🌅**"}