{"id": 350751, "author": "vladimirp", "title": "Explore & model ADA monetary policy", "url": "http://app.ideascale.com/t/UM5UZBiQB", "category": 25946, "amount": 50000, "description": "Can ADA's monetary policy be explored and modeled to inspire confidence among new users, organizations and experts, in the next six months?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "Monetary policy is the use of monetary authority to control the supply and availability of money.  \nA financial operating system for the world is bound to be defined by its monetary policy - so it needs to be explored.  \nCardano stakeholders are the ultimate monetary authority in the Proof of Stake system and the system runs as a proxy of this authority.  \nHaving stakeholders in charge of a PoS system brings distinct possibilities and advantages to a PoS system that has inbuilt governance, such as Cardano. When combined with Project Catalyst / Voltaire - the possibilities are endless.  \nStakeholders and future partners need to identify pertinent monetary issues that will be relevant to Cardano stakeholders and to the systems structure and future development.  \nThis is not a Challenge designed to change the current Monetary Policy. It's aim is to explore it fully.  \n**The proposed budget of USD50,000 is designed to motivate sufficient proposers to be able to launch and contribute certain deliverables on the Cardano monetary policy in any form that they see fit. However, the proposed sum is not larger - as the challenge has a limited scope at the current moment of Cardano's development - yet it could potentially lead to other future initiatives, if successful.**The point of the challenge is to provide scientific and economic analysis about future evolution of a revolutionary monetary system such as Cardano. There will be macro trends that need to be identified, possible scenarios that may emerge depending on adoption. The Cardano ecosystem needs to be aware of all implications.  \nCardano has a general Monetary Policy document available\\* The current Monetary Policy as it stands addresses two issues:\n\n*   The necessity to offer rewards for people who participate in the network\n*   Funding the treasury  \n    However, a true financial operating system for the world will eventually need to explore its Monetary Policy in more depth.  \n    What will a new financial operating system for the world look like? If it has governments as partners and if it has large corporate and small business partners, as well as international organizations - eventually the monetary policy will need more definition.  \n    Proposers should explore consequences of laissez-faire (minimum or no interference) policy - no changes to current status quo and scenarios that it may lead to  \n    The full range of goals of Cardano monetary policy should be identified and their implications  \n    Are the concepts of inflation / deflation relevant and how for Cardano? How do we measure inflation in a blockchain-based system?  \n    Specific monetary policy objectives that should come on the radar of Cardano stakeholders should be identified.  \n    Effectiveness and consequences of different monetary policy alternatives explored, even if they are small (changes to rewards systems) or large (modification of key tenets).  \n    Identify pros and cons of why / why not Cardano will need a monetary authority (or new solutions) and what are possible avenues ahead  \n    In any case, decision will have to be made about monetary policy and for decisions to be made, theoretical and practical issues need to be explored.  \n    In order for issues to be explored and researched - they need to be identified first.  \n    Right now a new economic monetary genius or crack research team is somewhere looking for a monetary system to test some revolutionary ideas on. Cardano is a system that - with its decentralized nature independent of any government - can allow for real-time research and proposals to be developed and theorized about.  \n    Monetary ideas or tools that were impossible or too complicated for legacy financial systems may be invented or reimagined for a new financial operating system such as Cardano.  \n    It might be as simple as changing the reward scheme to providing a new scale of incentives to tweaking network parameters based on developments from new economic theory.  \n    Cardano needs to open the door to the brightest economic minds and to open the door to the best research teams.  \n    This challenge is about starting to open the door, leaving it ajar for economic talent to join us.  \n    **Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD50,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**  \n    \\* https://docs.cardano.org/en/latest/explore-cardano/cardano-monetary-policy.html"}