{"id": 350877, "author": "vladimirp", "title": "Ouroboros: Endless self-disruption", "url": "http://app.ideascale.com/t/UM5UZBiSF", "category": 25946, "amount": 30000, "description": "How can we ensure that the Cardano system nurtures bold minority contrarian views on KEY elements of ADA ecosystem in the next 6 months?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "One of the inherent dangers of any majority led system is that only majority views will prevail. This in itself is democratic, but voting is a democratic mechanism, while true democracy is a system that allows minority view to flourish and eventually - if they are healthy and sound - grow to become a majority view.  \nCryptocurrencies emerged partly as a reaction to the established system and the established way of doing business. Cryptocurrencies are in essence a reaction to the establishment. However as crypto starts going mainstream a new class of tech savvy early entrants become part of the new establishment.  \n  \nThere is a risk of missing radical talent and great innovators as the Cardano ecosystem becomes more complex. There will be multiple layers of \"middle decentralized management\" and more institutions in charge of running the protocol, creating dapps, running nodes, community advisors, consulting companies, etc…  \nEvery groundbreaking idea is in its essence a minority view at the very outset.  \n\"Today's \"best practices\" lead to dead ends; the best paths are new and untried.\"  \nThe issue is how can we prevent the continuous exclusion or sidelining of minority, contrarian views on key elements of the Cardano ecosystem in order to avoid driving away new visionaries and regressing into an echo chamber environment?  \nIf the new Satoshi Nakamoto or the new Charles Hoskinson or the new Steve Jobs is lurking in the shadows of the current Cardano ecosystem and has radical new ideas, will the system embrace him/her - or leave them standing at the gates?  \n  \n\n\"The most contrarian thing of all is not to oppose the crowd but to think for yourself.\"\n\n  \nIt is probable that radical innovation ideas will not be understandable immediately to the voting majority of stakeholders and the system may shun future visionaries.\n\n  \nHow do we ensure we don't lose this visionary and give him/her some room to play and some time to develop the vision, instead of just slamming the door? Maybe some key tenets of the Cardano ecosystem need to be revisited?\n\n  \nDo we need a special sandbox environment for radically novel ideas and plans that could not attract normal funding, but could thrive with a little Catalyst magic?\n\n  \nHow can this be resolved?\n\nThe proposed limited size of budget for this challenge is designed to motivate proposers to address this issue with initial proposals and projects, as it a challenge that lays the ground to ensuring the continued vibrancy of the Cardano ecosystem. If we plant seeds to longevity early, we can benefit reap the results a long time from now.\n\n  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD30,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}