{"id": 351012, "author": "vladimirp", "title": "Disaster: When all is at stake", "url": "http://app.ideascale.com/t/UM5UZBiUS", "category": 25946, "amount": 150000, "description": "How can we help SPOs tackle risks & plan, develop and participate in disaster recovery tests in a safe hiccup-free and decentralized manner?", "no_assessments": 29, "rating": 4.413793103448276, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Securing the network and giving people (incl. but not limited to SPO or personnel from the three big orgs) incentives to test, educate themselves and others allows for more input into the secure development of Cardano.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "As stated in the proposal, assuring the security and robustness of the blockchain is integral to its success, and decentralized efforts would sure help to make it more secure if many different devs and SPOs etc. could inspect the security mechanisms and work on them transparently.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Ecosystem security is about as mission critical as it gets. Devoting a challenge setting to it is certainly justified and I would urge the entire community to consider potential risks if we do not address the security aspect early on to maximise impact. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Proper risk assessment and preparedness is key to every well laid plan. Setting up a mechanism for ensuring the backbone of the whole Cardano ecosystem can efficiently recover from an disaster situation would be a very smart thing to do.\r\nThe name of the challenge could be rewrote to better describe the actual challenge and make it more appealing to interested parties to participate.\r\nNote: It would probably take a series a disasters to actually cause damage to the network, as the decentralised nature itself protects from a single disaster, but still. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "As pointed out by the proposer, establishing system support from within is crucial to maintain stability and security. Having SPOs be involved in the development of some of the upgrades, building out the architecture of a more robust network, having them communicate in an organized environment will set them up with tools necessary to ensure decentralization of the Cardano ecosystem. This challenge setting is a proactive action that will act supplementary to the main Cardano mission. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Awesome idea. Reliability needs to be incentivised to be achieved.  ", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge is well aligned with some of the guiding questions of the challenge. A more secure network will make it easier to increase adoption, might attract the attention of lots of ADA stakeholders, specially SPOs, and the outcome would benefit the whole community. Some initiatives by IOG have been going on related to the security of the network, but I've not seen one specific for stakeholder operability. I am not sure if it already the time to focus on this points, but as mentioned, it would be good to have some tests doing on during testnet.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "There are several intrinsic risks to a blockchain and this challenge is a good way to study those risks and propose solutions to increase the blockchain's resilience in the event of attacks.\r\n\r\nIOG has done a great job in research to design the blockchain security consensus mechanisms, but in the end it is all about incentives. Every blockchain has a cost to be attacked. The development of Ouroboros Omega was recently announced and the development of a self-healing concept was mentioned. This challenge is a step in the same direction that IOG itself is going, but with the added benefit of engaging the community and decentralizing the blockchain security process among members of the community.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "For me this challenge setting is adressing a super-important topic. In established companies there is typically a dedicated risk-assessment and risk-management team. I highly support such a proactive and systematic approach also for CARDANO. The following ideas could be investigated and incorporated into this challenge setting:\r\n\r\n1) This could contain an even wider screening of potential risks, such as CyberSecurity, political and regulatory risks, internet-related risks etc.\r\n\r\n2) Investigate to what extent IOG and/or CARDANO Foundation are already working on this. We need to make sure that this challenge setting is utilizing all potential synergies.\r\n\r\n3) Make this to an integral part of Cardano branding strategy. Proactive risk assessment & management by the community would be another great argument and 'USP' for CARDANO. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I think a challenge is not needed for this matter at this time, as much thought already goes into Cardano in respect of its resilience one way or another. It does make sense though to highlight the need for SPOs to have their own resilience plans, and bare metal facilities with backup and a good range of relay partners if at all possible.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Social engineering, impersonations, as well as political, regulatory, and business risks are topics that the greater community can and should contribute to.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "It takes a lot of knowledge and education to audit systems for their security, especially such complex systems, that even a notable portion of devs might not have. This might make it difficult, but probably not impossible to find a sufficient number of people involved in the process. Expecting several proposals however seems quite utopic. I think this would better serve as a concretized proposal than as a challenge.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The community's SPOs have the experience to handle this challenge. They know best where possible pain points are and are best positioned to tackle these issues. So in terms of capacity to handle this, the infrastructure is already there. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "A lot of SPOs are part of the Catalyst community. What better source of drawing up tests and plans for recovery than the collective intelligence of the ones that have the most skin in the game. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Cardano ecosystem has plethora of highly motivated and variously talented SPOs who are involved in the process. This will give them yet another chance to share information and resources as well as provide incentives for doing so. Another benefit is this will give them a chance to stand out as the active and involved community members vs the idle stake pools that only provide delegation slots. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is definitely within scope of what the community can achieve.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Catalyst community has some active SPOs that would probably submit proposals in the challenge, and also this would bring the attention of other stake holders. The amount asked for in the challenge is said to be used, for e.g., to reimburse some of the SPOs losses during stress testing, but for big SPOs I am not sure that this amount would be enough, depending on the duration of these tests. But in any way, I believe that if this is clearly communicated to individual stakers, mentioning that it would be a test to the improve the system itself, I don't see it as a big problem.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This challenge has a different concept than the others and will require a more academic and theoretical approach. The Cardano community has hundreds of SPOs who can help to come up with proposals for this challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Yes, I think that the community is able to do this. Especially the SPO community can make major contributions to this. Together with an emerging team of community-elected experts, this can not only become an important activity, but also another source of income for SPO and experts. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I am sure the community would have lots of knowledgeable people able to contribute to ideas in this regard but not all members would be interested, and there are better fora such as the Discord/Telegram/Reddit groups for advice on these matters.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics are broad to invite for more creativity at the cost of ambiguity.", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "Most of the key metrics that have been set could be adressed by concrete projects and their success measured. However, there are far to broad for the small group of capable people that will be adressed by this challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "A lot of potential risks are already listed in the proposal. Additional, possibly unknown ones are TBD through stresstesting. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposed challenge offers metrics that should cover almost every conceivable type of threat that could be posed to stake pools. It addresses the need for incentivization models to be planned for to get SPOs on board. The definition of success is clear, understandable and would be easy to track. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has given a thorough review of what is required in order to see this challenge setting become beneficial to the overall mission and long-term success of Cardano. Their suggested list of KPIs and performance metrics is a great way to track the progress of the perfoming SPOs. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Well set out proposal. I think its also important to publish metrics on SPO's in terms of location, operating system, hardware diversity. This should be included in the SPO ranking analysis in Daedalus to encourage this.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Success criteria and suggested metrics are good and clear. My only comment is related to the 'dedicated team' metric. If the team goal is work in building the plans related to disaster events only, it would be ok, but it should be noticed that a dedicated team for the network, if created, should be as decentralized as possible. Maybe people from different SPOs, countries, continents, etc.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The definition of success is clear and well articulated, but I recommend defining a time interval so that the performance evaluation of the challenge is more objective.\r\n\r\nThe suggested metrics are good quantitative and qualitative indicators of the proposals resulting from this challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Even though the input to verifiability is not (yet) fully elaborated in detail here, future proposals could be based on very tangible KPI. There is lots of experience available in established industry segments, where best-practice-examples can be found.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "Disaster recovery (DR) is an area of security planning that aims to protect an organization from the effects of significant negative events.  \nHaving a disaster recovery strategy in place enables an organization to maintain or quickly resume mission-critical functions following a disruption.  \nCardano as a proposed financial operating system for the world must have several layers of built in redundancies even for events that may seem remote or very unlikely now.  \nAlthough a testnet exists, real-world conditions can never be fully replicated. Maybe proposers can develop a way of incentivizing further SPO participation in the Cardano testnet and more simulations.  \n  \nIt is great that IOHK/IOG is currently spearheading efforts, but SPOs should also initiate a decentralized and coordinated effort that could complement the existing activities.\n\nResponsibility cannot be centralized, it is best if it is shared.\n\nOne aspect of a system's stability is the fact that the system is able to look at itself in the mirror and rebuild itself in real time to adapt to environmental threats.  \nThreats to stakepool operators are direct threats to the system itself.  \nThere is a wide range of potential risks that both need to be identified and mitigated. These do not only include network-related parameters and threats, but also potentially social engineering / hacking risks, cybersecurity, impersonations, political and regulatory risks, business risks, etc.  \n  \nStakepool operators may be wary of taking their pools offline for any type of stress testing as they might lose the opportunity to forge blocks and they may lose rewards and delegators.  \n  \nThis might be addressed as part of this challenge, where SPOs might be rewarded in some form for taking part in these essential activities.  \n  \nIt would be good if SPOs would take an active part in submitting proposals for this challenge -as they are the beneficiaries and the best candidates to address the issues at stake.  \n  \nThe budget has been set at USD150,000 as it is a critical element of network safety.  \n  \n  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD150,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}