{"id": 351148, "author": "vladimirp", "title": "GRL PWR: Women Welcome!", "url": "http://app.ideascale.com/t/UM5UZBiWh", "category": 25946, "amount": 150000, "description": "How can we increase the overall participation of women in the Cardano ecosystem across all entities, functions, roles & overall community?", "no_assessments": 29, "rating": 3.9655172413793105, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Including women and non-male identifying people is critical to build solutions for a better world.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Cardano thrives to be inclusive and representative. For this to be truly the case for Cardano it is essential to discuss measures to onboard more people identifying as women in the traditionally male dominated crypto space.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The proposal has a very strong argument: \"If we do not widen the net, we won't capture talent. Women are 50% of the world's population and a major source of available talent.\" The fact that women are underrepresented in technology-oriented companies and projects for a variety of reasons deserves an additional effort by the Cardano community. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The (relative) poor engagement of women in Blockchain and Crypto represents a good opportunity for Cardano to distinguish itself from other projects and increase it's user base. The proposer has done a good job in supporting his argument in the challenge brief with external literature and also by making it clear that the challenge is about promotion rather the exclusive or sexist proposals.  ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Absolutely! I fully agree with the importance of raising the participation of women in the Cardano space, and would say the opposite of 'It may seem non-essential now', that it is essential now, and has been since the name ADA was chosen.  Move aside boys and tech-men, the stronger sex is on the rise!  More female leadership, less men in the mix (percentage wise!), and Cardano will thrive all the more.  ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I am a woman and can speak from experience when saying that initiatives designed to \"attract women\" or \"specifically for women\" are more often than not, a means to mask the preservation of the male dominated status quo. The initiatives that are actually sincere in their intentions, very rarely produce meaningful results.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "It is widely known that the economic expansion in developed countries during the 20th century was in large due to Women entering prominent roles in every industry en mass. Creating a welcoming and tuned-for-success environment will aid in the attraction of the 50% of the population and hopefully finally break the \"men only\" tech sector stereotype. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Obviously we Cardano cannot become a significant part of the world economy without significant contributions from women.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I believe this challenged is very much aligned with Cardano's missing to be an open, inclusive and strong community, and this cannot be achieve without the participation of women. The challenge is very clear to address that it is not in any way promoting unfair treatment, but trying to leverage women participation in ways not yet foreseen, it's open for community ideas. I also believe, and that's my personal view, that incentives to create role models, or even quotas, are beneficial in some aspects, but not needing to appeal to that would be even better.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "While it is hugely important that people of all genders are welcome in our community and given the tools to participate and achieve their dreams, I do believe that the community and protocol do this well and it is brilliant to see so many awesome women involved. Long may that continue. Women are by and large bigger adopters of crypto as it is and that should definitely be encouraged as decentralised identity and financial capability are critical in the modern world to everyone being able to achieve their goals. I don't believe though that this is a good topic for a challenge as challenges should be aimed at delivering functionality, development and adoption for everyone. It is always open fro proposals that target the female population for engagement on those particular aspects within challenges to be submitted so that we make sure any gender specific ideas that might help are drawn out. ", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Comments by personnel of the three big organizations drive the culture of the ecosystem. Unfortunately, these have often underlined the heteronormative view and reinforce contemporary conservative gender roles of the West. The Catalyst community should strive for improved equity among women, however, I evaluate this needs to come from the centrally organized organizations that currently drive most of the actual development and adoption of Cardano.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The diversity of the community is a big strength in this challenge, as the many different cultural and social contexts we come from can gelpt to adress many intersectional aspects of onboarding more women.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Of course, the Cardano community has the skills to meet this challenge. However, it will not be a quick win and there is no model solution either, it is about the willingness to face this question and to fight for change together. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The challenge is very open ended and could be addressed in many different ways. The creativity of the community would be able to address this. On the negative side, some community members could be skeptical of this challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Again, Absolutely!  There are many active members, both women and men, who are working around these issues, and the numbers are growing every day.  This challenge would super-charge the growth of female participation in our Cardano ecosystem. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "As an accomplished woman I know that talented and capable women are often put off by the fact that they're viewed as needing special assistance. \r\nHow is it that it's ok to lump 50% of the population together and view them as a single block simply because of their gender? A lot of men would be (rightfully so) horrified by being equated to every other man simply because they share a gender.\r\nI would also add that Cardano/Catalyst is an open, decentralised and democratic system, everybody's voice has a chance to be heard, everybody can participate. This is really not the space to be worried about anti-woman discrimination. There are definitely failings of society at large that reduce the participation of women in technical environments, those certainly need to be addressed, but apart from that it would be like forcing young girls to play with boys toys and calling ourselves progressive.\r\n*I don't feel that the Cardano 360 example given is representative of the Catalyst community.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Currently, Cardano is proud to present several examples of Women being showcased at the front line of the ecosystem. They can act as examples and benchmarks for what is possible. This can be expanded upon by initiating the challenge to see what other ideas the community is able to come up with. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I don't know if the community has the resources. Do we have gender stats at the moment? Its easier to drive non-male focused outcomes from non-males.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Catalyst community today has a small representation of women, there are some strong and very participative examples so far but they still are minority. Even though, I believe that the community could come up with several proposals regarding this topic, and it could even put lights on Cardano to bring more women to participate, and in this way the whole ecosystem would benefit from it.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "While female role models are certainly important, they are not the metric to be measured for real progress. Not accounting for people's wishes for anonymity, self-identification of gender in combination of an increased presence in the ecosystem is a suitable metric - which is of course also used in other industries.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics and success criteria set are well suited to measure the implementation of the challenge. The blockchain has the potential to even record many of those metrics and record their change over time if the future data and anonymity policies will allow it.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "It would be good to develop concrete methods and tools to easily measure the proposed indicators. ", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria suggested are all relevant but might be hard to measure e.g. \"increased female presence in the Cardano ecosystem\" how to you measure that ? or increase of female participation in Project Catalyst ?. A more simple metric could be external recognition of Cardano having higher female presence e.g. number external articles of social posts  mentioning Cardano and female engagement  ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Maybe I miss something, but, I do not see any such metrics... There is justification for the chosen budget, but to be honest, I am not sure what such metrics for evaluating success criteria, etc. would be. \r\nI do think that this challenge should and will achieve a high number of voters, and will provide springboards for adoption of Cardano.  May it become a challenge in Fund 7!", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer states: This funding challenge isn't devised to promote: (a) diversity training, (b) hiring tests, (c) performance ratings and/or (d) quotas. But nothing from the proposal itself reads any different than the initiatives he mentions, neither in motivation, nor scope.", "rating": 2, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer presented a sufficient list of KPIs and performance metrics to measure in order to track the progress of the challenge and its participants. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria and metrics suggested needs more focus. If we don't use quotas how do we drive it?", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The verifiability if this could be a challenge since the idea is not to 'tick boxes' about this topic. The key metrics are good ideas and represent what should result from the proposals in this challenge, but it might be difficult to put a number on it. Even though the idea is not to 'tick boxes', some metrics like number of women in Catalyst, Discord, proposals, CAs an other places could be tracked for reference, but not as a goal. Maybe a subjective feedback should be assessed from those participating in Catalyst, or something similar to that.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Some good metrics there for measuring the challenge if it were to go ahead, but it might be good to focus on the degree to which women have been able to achieve their goals, in addition to the degree to which they are represented in different aspects of community and protocol participation.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "Ada Lovelace was a woman.  \nThe brief is simple. We all benefit from including more women and the female perspective to the Cardano ecosystem.  \nThis funding challenge **isn't** devised to promote: (a) diversity training, (b) hiring tests, (c) performance ratings and/or (d) quotas.  \nhttps://hbr.org/2016/07/why-diversity-programs-fail  \nOne of the ideas behind this proposal is to gradually better reflect the reality of the world in the Cardano ecosystem as a whole and promote social accountability—to continue promoting fair-mindedness.  \nCardano has a unique opportunity to expand its ecosystem to onboard humanity's oft-neglected source of talent and resourcefulness: women. We are in a position to attract great female talent - which may be the Catalyst for even more female involvement.  \nThe Cardano ecosystem can decide to address identity considerations that act as barriers to entering the technology sector and that some high-cognitive skill women do not apply because of their high identity costs.  \nSome research has shown that changing the perception that women cannot succeed in technology can be achieved by providing role models, information on returns and access to a female network:  \nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=3266427  \nEventually all blockchain platforms will turn to expanding their userbase and stakeholder bases, so we can get an advantage by starting early. It may seem non-essential now, but speeding up adoption is a common goal for all Cardano stakeholders.  \nCardano was the blockchain platform that achieved an unprecedented success a few years ago when an all-female class of highly driven women became the very first African class trained to develop and build on Cardano, the first third generation blockchain to evolve out of a scientific philosophy. The initiative was born out of a signing of a Memorandum of Understanding (MOU) between IOHK - the company overseeing the technical development of Cardano, and the Ethiopian government in May 2018.  \nhttps://emurgo.io/ja/blog/the-inaugural-all-female-african-class-of-cardano-ada-blockchain-developers  \nOn the negative side, many in the community are aware of opposite examples such as this one:  \nhttps://www.reddit.com/r/cardano/comments/md4e7y/the_misogyny_on_the_cardano_360_live_chat_was/  \nSo, in that spirit, let's show our true colors - by supporting social accountability, promoting fair-mindedness and respectful communication.\n\n  \n\nThe proposed budget has been set at USD150,000 after taking into consideration the importance of the challenge and also the need to ensure that if this challenge is accepted, there will be sufficient funding for more than symbolic or token projects.  \n  \nOn the other hand, setting the budget higher might make it less likely for the challenge to be approved. So, a balanced budgetary proposal has been submitted.  \n  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. The proposed budget of USD150,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}