{"id": 351148, "author": "vladimirp", "title": "GRL PWR: Women Welcome!", "url": "http://app.ideascale.com/t/UM5UZBiWh", "category": 25946, "amount": 150000, "description": "How can we increase the overall participation of women in the Cardano ecosystem across all entities, functions, roles & overall community?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "Ada Lovelace was a woman.  \nThe brief is simple. We all benefit from including more women and the female perspective to the Cardano ecosystem.  \nThis funding challenge **isn't** devised to promote: (a) diversity training, (b) hiring tests, (c) performance ratings and/or (d) quotas.  \nhttps://hbr.org/2016/07/why-diversity-programs-fail  \nOne of the ideas behind this proposal is to gradually better reflect the reality of the world in the Cardano ecosystem as a whole and promote social accountability—to continue promoting fair-mindedness.  \nCardano has a unique opportunity to expand its ecosystem to onboard humanity's oft-neglected source of talent and resourcefulness: women. We are in a position to attract great female talent - which may be the Catalyst for even more female involvement.  \nThe Cardano ecosystem can decide to address identity considerations that act as barriers to entering the technology sector and that some high-cognitive skill women do not apply because of their high identity costs.  \nSome research has shown that changing the perception that women cannot succeed in technology can be achieved by providing role models, information on returns and access to a female network:  \nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=3266427  \nEventually all blockchain platforms will turn to expanding their userbase and stakeholder bases, so we can get an advantage by starting early. It may seem non-essential now, but speeding up adoption is a common goal for all Cardano stakeholders.  \nCardano was the blockchain platform that achieved an unprecedented success a few years ago when an all-female class of highly driven women became the very first African class trained to develop and build on Cardano, the first third generation blockchain to evolve out of a scientific philosophy. The initiative was born out of a signing of a Memorandum of Understanding (MOU) between IOHK - the company overseeing the technical development of Cardano, and the Ethiopian government in May 2018.  \nhttps://emurgo.io/ja/blog/the-inaugural-all-female-african-class-of-cardano-ada-blockchain-developers  \nOn the negative side, many in the community are aware of opposite examples such as this one:  \nhttps://www.reddit.com/r/cardano/comments/md4e7y/the_misogyny_on_the_cardano_360_live_chat_was/  \nSo, in that spirit, let's show our true colors - by supporting social accountability, promoting fair-mindedness and respectful communication.\n\n  \n\nThe proposed budget has been set at USD150,000 after taking into consideration the importance of the challenge and also the need to ensure that if this challenge is accepted, there will be sufficient funding for more than symbolic or token projects.  \n  \nOn the other hand, setting the budget higher might make it less likely for the challenge to be approved. So, a balanced budgetary proposal has been submitted.  \n  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. The proposed budget of USD150,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}