{"id": 351795, "author": "SofiH", "title": "Sustainable Development Goals 2030", "url": "http://app.ideascale.com/t/UM5UZBiiI", "category": 25946, "amount": 102030, "description": "How will you drive high impact collaborating in the Cardano and global community to achieve the 2030 Sustainable Development Goals (SDGs)?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "**\"We are the ones we have been waiting for\"** - June Jordan\n\n**\"Education is the most powerful weapon which you can use to change the world\"** - Nelson Mandela\n\n**Let's propose ideas that are designed with sustainability at it's heart, guided by the same founding principle on which Cardano was built upon.**\n\n**++Urgent solutions for urgent times++**\n\nMore people around the world are living better lives compared to just a decade ago. More people have access to better healthcare, decent work, and education than ever before. But inequalities and climate change are threatening to undo the gains.\n\nWith the world increasingly facing the extremely damaging impacts of climate change upon ecosystems, populations and species, the need to limit global warming to 1.5°C cannot be contested. Alarming data includes the loss of primary rainforest equivalent to a football pitch every 6 seconds in 2019 leading to dramatic consequences such as soil erosion, flooding, loss of biodiversity, carbon release or fishery livelihoods being threatened in small island developing countries, or the Coral Triangle region in South-East Asia due to warming water temperatures and coral bleaching.\n\nAt the core of the 2020-2030 decade of action is the need for action to tackle growing poverty, empower women and girls, and address the climate emergency. Sustainable development has been defined as development that meets the needs of the present without compromising the ability of future generations to meet their own needs.\n\nSustainable development calls for concerted efforts towards building an inclusive, sustainable and resilient future for people and planet.\n\nFor sustainable development to be achieved, it is crucial to harmonize three core elements: economic growth, social inclusion and environmental protection. These elements are interconnected, and all are crucial for the well-being of individuals and societies.\n\nAction against climate change entails structural behavioural change at an individual and systemic level to embed sustainable practices.\n\nThis will entail the adoption of a new framework of thinking to ensure sustainability is embedded at all levels of action, well beyond the social sector, and includes all strata of society.\n\n  \n**The critical core competencies required for sustainability include:**\n\n• Critical and systemic thinking - promoting and ensuring all learners acquire knowledge, embed values and develop the skills needed to promote sustainable development. Being able to discern and distinguish greenwashing from genuine sustainability, and shifting from thinking in siloes to thinking holistically and embracing complexity\n\n• Collaborative decision making - ensuring multilateral action so no one is left behind and the empowerment of all communities\n\n• Taking responsibility for the present and future generations - ensuring sustainable, alternative lifestyles and ideas from the consumer society and beyond are promoted and adopted by the global society\n\n  \n\nWith such critical competencies in place, sustainability can be achieved, with the fulfilment of the SDGs within the necessary time.\n\n  \n• Eradicating poverty in all its forms and dimensions is an indispensable requirement for sustainable development. To this end, there must be promotion of sustainable, inclusive and equitable economic growth, creating greater opportunities for all, reducing inequalities, raising basic standards of living, fostering equitable social development and inclusion, and promoting integrated and sustainable management of natural resources and ecosystems.\n\n• Investment in inclusive and sustainable economies can unleash significant opportunities for shared prosperity. And the political, technological and financial solutions are within reach. But much greater leadership and rapid, unprecedented changes are needed to align these levers of change with sustainable development objectives. #ForPeopleForPlanet\n\n• To achieve the Sustainable Development Goals, annual investment requirements across all sectors have been estimated at around $5-7 trillion. Current investment levels are far from the scale needed. With global financial assets estimated at over $200 trillion, financing is available, but most of these resources are not being channelled towards sustainable development at the scale and speed necessary to achieve the SDGs and objectives of the Paris Agreement on climate change.\n\n• Interest and investment in the Sustainable Development Goals are growing and investment in the Goals makes economic sense. Achieving the SDGs could open up US$12 trillion of market opportunities and create 380 million new jobs by 2030.  \n\n**++Cardano Sustainability++**\n\n**Encouraging the growth of a Community Led Local Hubs Network as a means of accelerating and expanding the Cardano ecosystem in strategic places for high SDG impact:**\n\nOut of the world's approximately 7.8 billion inhabitants, 6.45 billion do not speak English as their first language. Living in the Western world, one may forget this fact, with many never having considered it.\n\nLet's consider it now.\n\nLet's build an ecosystem that grows sustainably, in harmony from the local to global scale, while remaining inclusive and equitable.\n\nWhen you drive grassroots adoption, you do more than just 'build cool products'; you empower people to change their lives and world in previously unimaginable ways. You give them the tools to imagine that anything is possible.\n\nRemember that the **Bitcoin network is one protocol of the 75% of blockchains that use Proof of Work (PoW)** mining power to reach consensus.\n\nWith consensus on the **Cardano blockchain through Ouroboros estimated to be over four-million times more energy-efficient than the Bitcoin protocol -** let's use the tools available to us today to help build a sustainable world.\n\nIn a world where Cardano exists, maybe we don't have to wish for these things to happen, we make them happen!\n\n**EACH PROPOSAL PUT FORWARD FOR THIS CHALLENGE CAN REQUEST FUNDS AMOUNTING TO NO MORE THAN A MAXIMUM OF 20% OF THE TOTAL FUND AVAILABLE.**\n\n**THIS IS TO PROMOTE AND ENCOURAGE A DIVERSITY OF PROPOSALS WITHIN THE SDG FRAMEWORK :)**\n\n**++Guiding Budget Rationale:++**\n\n*   Basic infrastructure costs\n*   Developer Training, Education and Tools\n*   Catalyst Proposer Onboarding\n*   Translation and Outreach\n*   And more…\n\n**++For more information:++**\n\n\\* https://www.un.org/sustainabledevelopment/development-agenda/  \n\\* https://en.unesco.org/news/unesco-launch-esd-2030-roadmap-africa-region  \n\\* https://unesdoc.unesco.org/ark:/48223/pf0000374802  \n\\* https://forum.cardano.org/t/world-computers-that-don-t-cost-the-earth/41259  \n\\* https://forum.cardano.org/t/consensus-on-cardano-vs-other-blockchains/38738  \n\n**++Videos on Sustainable Development Goals:++**\n\n\\* https://youtu.be/0XTBYMfZyrM - Do you know all SDGs?  \n\\* https://youtu.be/vc8-7VncIbA - UN Chief on Decade of Action for the Sustainable Development Goals  \n\\* https://youtu.be/xVWHuJOmaEk - Nations United: Urgent Solutions for Urgent Times | Presented by Thandiwe Newton"}