{"id": 351806, "author": "SofiH", "title": "Support Ongoing/Small Projects", "url": "http://app.ideascale.com/t/UM5UZBiiT", "category": 25946, "amount": 15000, "description": "How can we make sure projects that are doing good work but ran out of budget/fail to get funded are supported to continue on or try again?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "Have operational costs for an ongoing service? Got funded in an earlier round, but worried if your project will stay alive?  \nStarting a new proposal but worried how to pay the hosting bills if you don't get funded? Split your proposal!  \nHere you can asks specifically for funding for the operational costs.\n\n  \nThe idea is to either link to a proposal in another challenge for which this is the operational bill (should not be included in the other one). Or if you have an ongoing project which got funded earlier and now most importantly needs to pay hosting bills to stay alive. If you are making some other personal expenses at the benefit of the community feel free to argue for a case to get reimbursed here.\n\n  \n**Rules:**  \n\\- Each proposal can ask for 1500 max (to support at least 10 projects with the total funds)  \n\\- Proposals should include a clear overview of actual operational costs made\n\n\\- Proposals can include projected costs for up to 3 months, based on previous operational cost made (should be explained)  \n\\- Proposals can not include budget for work to be done or any rewards for the proposers (can be done in other challenge)  \n\\- No referrals\n\n  \n**(V)CA Guide / rating rules:**  \nBecause many small proposals can overburden the CA system, a simple rule set is provided to simplify CA work in this challenge. Any proposal that follows the rules as mentioned above should get a 5 rating, no explanation has to be given but feedback is ofcourse welcome. If a proposal does not follow the rules it should get a rating 1 with an explanation/ reference to the rule. The actual judgement of value is left to the voters."}