{"id": 352036, "author": "vladimirp", "title": "Science Coins: Bridging differences", "url": "http://app.ideascale.com/t/UM5UZBimF", "category": 25946, "amount": 75000, "description": "How can we initiate & establish community-led bridges to other science-based blockchains to unlock new value in the next three months?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "Bitcoin is now widely referred to as a first-generation blind, deaf and mute blockchain that sought out to find out will decentralized technology work at all.  \nLater the community realized they wanted more from blockchains—things like programmability and scalability. This is where Ethereum, or the second-generation of the technology, came in and made a revolution in the industry. However it suffers from a lack of scalability and problems with decentralizing governance, as well as from other teething problems that were inbuilt into the code.  \nCardano and several other third generation crypto currencies are looking to science to provide the theoretical foundations for key building blocks and elements of their infrastructure. Some more, some less.  \nWe all know that interoperability will also be one of the defining characteristics of a decentralized system that services into the future. However, interoperability will not only refer to the technical blockchain side - increasingly we will require interoperability on governance, funding, community, research and other aspects.  \nFurthermore, by building and linking interoperable chains - risks (governance, stability, etc.) posed to one chain may spill over to other chains.  \nHence in real-life, community integrations are important as they lead to a common realization of joint interests, instead of a destructive Hunger Games mentality in which blockchains fight each other to extinction.  \nThe improvement of all science coins is a win for all, especially in an open source universe such as this. The destruction of all science coins could also eventually lead to the demise of the last coin left standing.  \nThere is no victory when diversity is lost in an ecosystem. That's the very point of decentralization.  \nTo use another botanical analogy, it is no wonder that the most vibrant genotypes in the plant world are created from hybridization (cross-pollination).  \nCardano itself is a by-product of cross-pollination of ideas. This idea is a basic principle worth funding and could lead to massive gains for each and every \"science coin\" ecosystem.  \nThe Cardano community should not leave the responsibility of cooperation to IOHK, Emurgo and the Cardano Foundation. They have provided momentum, we all have a responsibility to keep the ball rolling and to expand the playing field.  \nThe proposed budget takes into account the need to initiate contacts and elaborate modes of cooperation, which is the object of the challenge. Further initiatives could ensue through this newly-established cooperation, which could result in new Challenges and new Funding requests in the future.  \nHence, the proposed USD75,000 budget was set to be sufficiently large to motivate creativity and ideas, which could eventually lead to new funding rounds.  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD75,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}