{"id": 352036, "author": "vladimirp", "title": "Science Coins: Bridging differences", "url": "http://app.ideascale.com/t/UM5UZBimF", "category": 25946, "amount": 75000, "description": "How can we initiate & establish community-led bridges to other science-based blockchains to unlock new value in the next three months?", "no_assessments": 24, "rating": 3.9166666666666665, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Such a project would be a good addition to Cardano, as interoperability is an important aim of it. ", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 4, "note": "The proposed topic is very relevant and is makes a lot of sense to create this bridge across science backed blockchains, in the same way that it occurs in science in general: there are no 'parallel' sciences going on, everybody talks to everybody. It blockchain wants to benefit from science, this bridge between science backed blockchains must happen.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Interoperability with peer blockchains, preserving value across blockchains, and cross-pollination of technologies, on the whole, will be ideal for the development of the cryptocurrency industry as a whole. A challenge to identify how bridges could be found between projects either technical or structural can be a major catalyst for future growth.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Cooperation with crypto projects built on similar foundations and with similar goals as Cardano could certainly help make those goals a reality much faster and much more efficiently. However sometimes cooperation without synchronisation can have the opposite effect, and the risk is not appropriately identified. Would the efforts required to achieve that synchronisation be worth it? But it would be a potentially great loss, not to attempt the route of cooperation.\r\nI would suggest a different name for the challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Collaboration is always good. Its not clear this is critical to Cardano's mission however. The exact goal needs to be specified.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge setting has the potential to attract talent from other chains who want to collaborate or need more resources in order to accelerate their development. If they present favourably to Catalyst community, this can lead to interoperability in governance at the least, which would expand our existing talent pool. As a result, more quality developments and partnerships will take place because of Catalyst. Projects with similair long term goal for blockchain technology as Cardano have an incentive to partner up and take charge together. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "One of the biggest obstacles we face today is the lack of communication between blockchains. Interoperability is a complex challenge due to the great technical difficulty to create such solutions. Promoting a challenge that seeks to address this problem is essential for any blockchain that wants to be used by hundreds of millions of people, such as Cardano.\r\n\r\nThe open source nature of our space is one of the properties that guarantees the constant evolution of blockchains and prevents the technology from being contained by governments interested in maintaining financial control of the global economy.\r\n\r\nThe open source nature exposes weaknesses and this exposure stresses protocols and makes them stronger. Increasing collaboration between blockchains focused on solid foundations of research, science and collaboration is a way to pressure Cardano to face the best of each blockchain and this is a positive game for the ecosystem as a whole.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Dissemination of knowledge about what constitutes well founded blockchain and DLT and what is not would definitely be useful, as would thinking about modes of cooperation, and it is fair to say the Cardano blockchain's community is more willing than most to pursue such goals. I am not sure we need a challenge to look into this and question whether it would be the best use of Treasury rather than focusing on development and adoption, which are at the end of the day what will make or break any project.  ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The interoperability of blockchains is a very hard to cope with topic, as only a portion of the catalyst community are developers and even a smaller fraction of those will have the technical knowledge to understand multiple blockchain mechanisms in order to execute projects tackling interoperability problems. However something the catalyst community could cope with is indeed beeing in contact with other blockchain communities and elaborate cooperations on common goals that could then be pitched to the actual devs.", "rating": 2, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 5, "note": "I see this as a very high level interaction between blockchains at first, if the developers of each one are going to talk about all the possible interoperability. But, as well as is happens in Cardano, the communities of other science backed blockchains might be very active and this bridge could start from less technical community members. I see the budget as being reasonable for this kind of interaction at first, instead of connecting the 'core' of blockchain at first.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The most innovative community in blockchain industry is with Cardano. There are substantial technical challenges in achieving interoperability however enough technical expertise exists In the Cardano Catalyst community to come up with good ideas.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Given that the proposal is for an initial, exploratory challenge that would later set the ground for seeking of actual technical solutions, I feel the Catalyst community is more than equipped to address it. My only concern is that the proposed budget for the challenge might be too low, as some high value individuals and organisations would need to be engaged.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "THere are plenty of communit members with links to other coins. However it is not totally clear what the goal of the challenge is. This makes it hard to asses if we can address it. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "At the present, there have not been many cross-chain partnerships outside of the existing IOG ecosystem. Project Catalyst has yet to create an environment where this can be facilitated. Creating such a challenge setting will put the Catalyst community to a test, and it should be ready to produce results given this will take place in Fund7. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "There is already a public interest in creating interoperability between Cardano and other blockchains, such as Litecoin, Iota and Cosmos. The interest in creating a model of interoperability between Litecoin by Nipopows is public and is already in the early stages of development by IOG and Litecoin. A few months ago there was a mutual interest in integrating IOTA and Cardano and this was made public by Charles Hoskinson's conversation with Dominic Schiener. In addition, interest in the community arose to create a bridge with Cosmos blockchains. We have a very strong research partnership with ERGO and there are already projects in joint development. Other blockchains like Algorand and Tezos have synergies in their interest in research and similar technologies.\r\n\r\nThis all indicates a great potential for collaboration that is already public knowledge and has already led to the creation of some proposals in Catalyst itself. Just look at the recent proposals to integrate with blockchains like Cosmos, Ergo and Incognito.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is really a matter for IOHK and Cardano Foundation leaders at this point rather than the community, supportive as the community is of a rational, informing and friendly approach to partners, competitors and the public.", "rating": 2, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "The criteria are for the most part clear and measurable, expect for example the stratification of cryptocurrencies. This will be hard to measure and quantify as their are many multi-purpose coins and those that can not be clearly defined and also the crypto space is expanding faster than it can be analyzed and measured.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Since the proposals in this challenge would lead to connection between people at first, and that seems to be the objective, specially with the proposed budget (a technical bridge between blockchains would need a much higher budget), I believe the metrics proposed are appropriate and embracing.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposal has listed nine criteria, and all of them are clear and easily measurable. Many are even achievable with moderate effort and can bring up the value of the complete ecosystem.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics are clearly defined and appropriately set for what is intended to be an initial exploratory challenge. There would however, probably be some difficulties in measuring results and success given the community nature of the challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The goal of this challenge is not clear and no metrics have been suggested for success. What does success look like? Are we trying to collaborate with other blockchains, or is the aim to merge?", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has identified multiple KPIs to track the performance and success of the participants and their projects during this challenge setting. Should this challenge setting take place, it will be sufficient to measure progress. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The key metrics describe various topics relevant to assessing the performance of the challenge and the definition of success is clear and objective. My only recommendation is to define a time window for assessing the performance of the challenge and to increase the objectivity of the resulting proposals.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "I think more criteria and metrics for dissemination of rational material to educate people would balance the metrics of the challenge better.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "Bitcoin is now widely referred to as a first-generation blind, deaf and mute blockchain that sought out to find out will decentralized technology work at all.  \nLater the community realized they wanted more from blockchains—things like programmability and scalability. This is where Ethereum, or the second-generation of the technology, came in and made a revolution in the industry. However it suffers from a lack of scalability and problems with decentralizing governance, as well as from other teething problems that were inbuilt into the code.  \nCardano and several other third generation crypto currencies are looking to science to provide the theoretical foundations for key building blocks and elements of their infrastructure. Some more, some less.  \nWe all know that interoperability will also be one of the defining characteristics of a decentralized system that services into the future. However, interoperability will not only refer to the technical blockchain side - increasingly we will require interoperability on governance, funding, community, research and other aspects.  \nFurthermore, by building and linking interoperable chains - risks (governance, stability, etc.) posed to one chain may spill over to other chains.  \nHence in real-life, community integrations are important as they lead to a common realization of joint interests, instead of a destructive Hunger Games mentality in which blockchains fight each other to extinction.  \nThe improvement of all science coins is a win for all, especially in an open source universe such as this. The destruction of all science coins could also eventually lead to the demise of the last coin left standing.  \nThere is no victory when diversity is lost in an ecosystem. That's the very point of decentralization.  \nTo use another botanical analogy, it is no wonder that the most vibrant genotypes in the plant world are created from hybridization (cross-pollination).  \nCardano itself is a by-product of cross-pollination of ideas. This idea is a basic principle worth funding and could lead to massive gains for each and every \"science coin\" ecosystem.  \nThe Cardano community should not leave the responsibility of cooperation to IOHK, Emurgo and the Cardano Foundation. They have provided momentum, we all have a responsibility to keep the ball rolling and to expand the playing field.  \nThe proposed budget takes into account the need to initiate contacts and elaborate modes of cooperation, which is the object of the challenge. Further initiatives could ensue through this newly-established cooperation, which could result in new Challenges and new Funding requests in the future.  \nHence, the proposed USD75,000 budget was set to be sufficiently large to motivate creativity and ideas, which could eventually lead to new funding rounds.  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD75,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}