{"id": 352667, "author": "SofiH", "title": "ColabHackathon first-timers welcome", "url": "http://app.ideascale.com/t/UM5UZBiwb", "category": 25946, "amount": 25000, "description": "How can we encourage new people to jump in, start contributing and help them succeed in building something meaningfull in a short time?", "no_assessments": 24, "rating": 3.7916666666666665, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Lowering the bar to entry for people to start making meaningful contributions to Cardano is a very much in line with Cardano's mission.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The suggested challenge setting would allow early on-boarders to go through a low-pressure Catalyst proposal experience in order to gain better understanding of the inner works of the system and establish connections with the developed teams. This would not have an immediate impact on Cardano's mission achievement, and potential result depends on the implementation of such Hackathon. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Excellent idea, budget is well fit and I think this would be a great experience. Since this would be an 'irregular' challenge, voters should be aware that they would be voting for a already developed project. The idea of rating only 5 or 1 also seems a good way to leave all decisions to the voters in this specific case. If successful, each Fund could have a different topic for this hackathon.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "While it is a really creative and open concept that has the potential to unlock more resources, it is not essential to cardanos mission; It will basically not introduce new projects that could not be realized via other funding challenges. A lot of them are already formulated in an open manner enabling many different ideas to be integrated. It is still a great idea for people to self-organize themselves ahead of proposal phase of a funding round in order to brainstorm and plan ideas", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Great idea. This will create favorable atmosphere for users, developers to be engaged and involved in building a cardano ecosystem.\r\n\r\nIn my opinion, your challenges should be directed to a particular interest, purpose or gap in the ecosystem. ", "rating": 5, "c_fb": 1, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 4, "note": "Great idea to get more people involved and building for Cardano.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 4, "note": "This is great to encourage first timers.  It seems essential to involving more people into the community. Consider strengthening the rules to include new proposed, like increased scoring or requirement to have a new proposer.  All other sections seem to encourage it, but missing action from rules to acquire this group.  ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Creating alternative funding models is promising and can benefit people willing to work first and get paid for the quality of their work, which helps to bring about a dispute for productivity and innovation.\r\n\r\nMy only recommendation is to rewrite the challenge in order to communicate the concept more clearly, because the name of the challenge, the question statement of the challenge and the statement of why it is important did not effectively communicate the idea presented.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This might be better suited as a proposal within a wider challenge as to \"how should we improve Catalyst\", although the idea that ways of linking community members to each other to develop proposals and practical ways of delivering on them is very valid for consideration.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Since this is just allowing one more avenue for collaboration, the community is well positioned to address the challenge.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "The idea of having a lower-barrier to entry Catalyst experience might prove beneficial as Voltaire era nears completion and full rollout. New to Catalyst individuals will have to compete with seasoned and established teams and might find it challenging and discouraging. Providing a level playing field for this group has the potential to spur collaboration and create new connection and networks. As we continue with project Catalyst, more and more people could benefit from this implementation. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I believe many people would be able to participate in this challenge and I can see this experiment being very successful. Catalyst community is very active and lots of people will probably participate. I believe this challenge is completely feasible.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This challenge will of course be within the community's capacity and potential, as it plans to utilize exactly those resources and even has the potential to mobilize more of those resources by the openness of the procesd.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I think that the concept of this challenge stimulates the development of good proposals and can stimulate a healthy dispute where those who produced more have more visibility and more confidence in the community. BUT, how do we judge the proposals by the result they delivered without Catalyst having a functional audit model? Before this turns into a viable challenge, it's necessary to establish how to evaluate these proposals in a fair and efficient way.\r\n\r\nMy recommendation is that the challenge describes how these proposals will be evaluated fairly so that the model is not gamified.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "There may be community members who could set up incubation hubs as part of community hubs, including virtual connection and collaboration, who might be interested in pursuing this, and it would be worthwhile.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics will not necessarily measure the impact of the challenge, but potentially the overall increase of people's awareness and the improved capabilities of the Cardano ecosystem.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has laid out good foundation for their proposed challenge setting and is encouraged to build onto it by adding more depth and detail. Overall, great suggestion and good start with KPIs as mentioned. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Since the project needs to be ready in time for voting, it would be easy to verify which ones have met their goals. Also, in the unlikely case that not enough projects are delivered in time for voting, a backup plan for what to do with the Fund money could be developed.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria and metrics suggested are useful, however the demand of changing the voting system is not reasonable, considering there are already several mechanisms built into the challenge proposal (budget, team requirements etc.) that would limit proposal numbers.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Criteria and metrics are ok. I think the commercial significance of this proposal should also be considered. ", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 6, "note": "Metrics set out well. Its not clear however that enough funds have been requested. 25,000 would only cover 5 projects at the cap. Either set the limit lower or raise the funding request. Perhaps have a lower initial payment then prizes at the end of additional funds for the best completed projects?", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Overall if the focus is 1st timers, add data for new proposers in addition to the full population.\r\n- number of projects that manage to deliver before the deadline \r\n\r\n- number of mergers before finalization \r\n- number of proposers that continue on in other challenges (consider having a metric of all participants that continue & 1st timers separate as well).  \r\n\r\n\r\n- People that continue to work together after this challenge (consider having a metric of all participants that continue & 1st timers separate as well).  \r\n\r\n- first time proposers (good easy metric to acquire)", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics and definition of success described are reasonable. \r\n\r\nThe problem I see with auditability is before the vote stage, because today there is no audit model done by the community, will we depend on the IOG staff? Do they have the capacity and time to do this?", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics appended are more for assessment of whether a proposal has worked than of how particular solutions to your proposed challenge might be assessed by the community. They are though the sorts of things that should be thought about within iterative feedback to proposals that have been funded by Treasury and can therefore improve Catalyst. ", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "Are you a new proposer? Looking to try and learn how this all works?  \nHoping to find others to collaborate with or just prefer to start small?  \nThen this might just be the right challenge for you :)\n\n  \n**The Idea:**  \nForm a team, make a proposal, get to work and deliver in 8 weeks (starting from insight sharing).  \nProposers are encouraged to collaborate and merge their proposals along the way.  \nIn the end all should have delivered by the time the community votes, so they are the judge of this Hackathon.  \nProposals should be judged on the value they delivered at that the time of voting\n\n  \n**Rules:**  \n\\- minimum 2 co-proposers  \n\\- max 5k budget per proposal (not including work after the deadline)  \n\\- max 1 proposal (main or co) per person within this challenge  \n\\- no referrals (to avoid abuse)\n\n  \n**Reasoning:**  \nThe total funds for the challenge and max funds per proposal are limited. This allows for new proposers and teams that are just forming to experiment without interfering with the larger and more mission critical challenges. No one is asking for the world here, so please be mindfull of eachother when providing feedback!\n\n  \n**(V)CA Guide / rating rules:**  \nBecause many small proposals can overburden the CA system, a simple rule set is provided to simplify CA work in this challenge. Any proposal that follows the rules as mentioned above should get a 5 rating, no explanation has to be given but feedback is ofcourse welcome. If a proposal does not follow the rules it should get a rating 1 with an explanation/ reference to the rule. The actual judgement of value is left to the voters."}