{"id": 352667, "author": "SofiH", "title": "ColabHackathon first-timers welcome", "url": "http://app.ideascale.com/t/UM5UZBiwb", "category": 25946, "amount": 25000, "description": "How can we encourage new people to jump in, start contributing and help them succeed in building something meaningfull in a short time?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "Are you a new proposer? Looking to try and learn how this all works?  \nHoping to find others to collaborate with or just prefer to start small?  \nThen this might just be the right challenge for you :)\n\n  \n**The Idea:**  \nForm a team, make a proposal, get to work and deliver in 8 weeks (starting from insight sharing).  \nProposers are encouraged to collaborate and merge their proposals along the way.  \nIn the end all should have delivered by the time the community votes, so they are the judge of this Hackathon.  \nProposals should be judged on the value they delivered at that the time of voting\n\n  \n**Rules:**  \n\\- minimum 2 co-proposers  \n\\- max 5k budget per proposal (not including work after the deadline)  \n\\- max 1 proposal (main or co) per person within this challenge  \n\\- no referrals (to avoid abuse)\n\n  \n**Reasoning:**  \nThe total funds for the challenge and max funds per proposal are limited. This allows for new proposers and teams that are just forming to experiment without interfering with the larger and more mission critical challenges. No one is asking for the world here, so please be mindfull of eachother when providing feedback!\n\n  \n**(V)CA Guide / rating rules:**  \nBecause many small proposals can overburden the CA system, a simple rule set is provided to simplify CA work in this challenge. Any proposal that follows the rules as mentioned above should get a 5 rating, no explanation has to be given but feedback is ofcourse welcome. If a proposal does not follow the rules it should get a rating 1 with an explanation/ reference to the rule. The actual judgement of value is left to the voters."}