{"id": 352815, "author": "rich", "title": "NFT Business models", "url": "http://app.ideascale.com/t/UM5UZBiy1", "category": 25946, "amount": 200000, "description": "What non-Art use cases of NFTs can distinguish Cardano as the blockchain of choice for NFT based businesses?", "no_assessments": 0, "rating": 0, "videos": [], "media": [], "importance": "**INTRODUCTION**  \nVOTERS PLEASE UNDERSTAND: This is a Fund 7 COMMUNITY CHALLENGE others will make proposals to the challenge. It is NOT a proposal itself. Therefore do not expect to see the same things you see in proposals, like teams, solutions and budgets. The proposers who apply for this CHALLENGE create those things.\n\n++What are Non-Fungible Tokens?++\n\nA non-fungible token (NFT) is a unit of data stored on a digital ledger, called a blockchain, that certifies a digital asset to be unique and therefore not interchangeable. NFTs can be used to represent items such as photos, videos, audio, and other types of digital files. Access to any copy of the original file, however, is not restricted to the buyer of the NFT. While copies of these digital items are available for anyone to obtain, NFTs are tracked on blockchains to provide the owner with a proof of ownership that is separate from copyright.  \n\n  \n\n***THE CHALLENGE:**  \nPropose a means or way to drive business use cases on Cardano that have NFT usage as a core component and can act as an onramp to the Cardano ecosystem. This can include any business model based on NFTs. Think about how this is implemented at scale drawing millions of users, who, once onboard, can become customers for dApps, tools, DeFi and other services.*  \n  \n\n**WHY THIS IS IMPORTANT TO GROW CARDANO**  \nThis Challenge is about building recurring businesses that incorporate NFTs on the Cardano ecosystem. The more types of NFTs that are circulating on Cardano will increase the utility of Cardano and ADA.\n\n  \n\n**RATIONALE**\n\nFeedback suggests most people need help imaging use cases for NFTs (Non-Fungible Tokens) beyond the recent Digital Art phenomenon and can't imagine other use cases without some inspiration.\n\nTo our thinking, the recent Art NFT boom is a small fraction of the trillions of dollars the NFT market will represent in the next decade. And since there are already many Digital Art NFT projects underway in Catalyst, this challenge is about expanding the use cases beyond simply Digital Art. It does not preclude all art forms however, so if you have ideas for other business models that are also considered part of the broader category of the Arts, those are welcome proposals. Even so, no use case would technically not qualify, even Digital Art. It is merely the intention to reach beyond to other use cases.\n\nThis Challenge is about increasing worldwide uses of NFTs in everyday transactions, especially on Cardano with business uses that can easily benefit from NFT technology.\n\n++BUDGET RATIONALE++\n\nI propose a $200,000 budget which would accommodate four (4) $50K submissions on average and give each a fair shot of making something that could make a significant difference in the ecosystem. This is 1/4 of the $800,000 budget for something that has a trillion dollar potential in the next decade.\n\n**WHAT SHOULD BE PROPOSED**\n\nProposals should be framed towards specific use-cases, and the community will know of specific cases where NFTs can be used to solve various problems. Focusing on NFTs in general may be most productive, with a strong focus on business models that rely on NFTs as a core component of most transactions.\n\nWe believe many community members will have good ideas on where NFTs could be adopted and believe at a functional level, the community has a lot to say about it.\n\nThis is important for Cardano's future and could be the base for many dApps on Cardano where it is vital to uniquely identify the other party. This is a call for exploring the possibilities where NFTs could be one of the products or service that drives mass user adoption of Cardano.\n\nThis is a relevant topic with importance to not only Cardano since the Mary hard fork and UTxOma introduction, but blockchain and cryptocurrency in general and will have a global impact. Cardano an multi-asset functionality make Cardano an excellent candidate to dominate the NFT futures market. Build something that can make that happen!\n\n**EXAMPLES OF USES FOR PROPOSAL INSPIRATION**\n\nDigital content\n\nGaming items\n\nDomain names\n\nPhysical items\n\nInvestments and collateral\n\nInsurance\n\nContent management/distribution\n\nData management\n\nFinancial Services\n\nManufacturing and industrial\n\nStorage\n\nGovernment\n\nRetail\n\nTransport and Tourism\n\nMedia\n\nRealEstate\n\nLand Registry\n\nIdentification\n\nAdvertising\n\nAuthorship and ownership\n\nSocial Network\n\n  \n\n**POSSIBLE CAMPAIGN BRIEF**\n\nNFT use case development is mission critical because user adoption will have a key role in determining the future utility and value of Cardano. That's why we are looking to the Project Catalyst community to refine and answer our challenge.\n\nOver time, development opportunities on Cardano will evolve to include everything from NFTs, DIDs, metadata to KEVM/IELE, Plutus, Marlowe, Glow and more. Ultimately, the goal here is best summarized by the question:\n\nDid the funded NFT use cases manage to drive user-adoption?\n\nTo find out, we might track the following metrics:\n\nHow many daily active users?\n\nHow much daily local token volume increased?\n\nHow many transactions were made?\n\nHow much funds were transacted?\n\n++Guiding questions++\n\nWhere are gaps in the market where NFTs originating on Cardano have a unique advantage?\n\nWhat kind of NFT solutions can already be developed in the next six months?\n\n++Inspirational potential directions++\n\nThe community open roadmap contains a \"Use cases\" section and \"Driving adoption\" section that can serve as an inspiration for proposers.\n\n++Developer resources++\n\nFor access to all currently available developer tools and guides, visit our developer site. Further documentation can be found here.\n\nMeanwhile, here are some quick links you can start with:\n\nhttps://developers.cardano.org/en/development-environments/native-tokens/native-tokens/  \n\nhttps://forum.cardano.org/c/developers/cardano-tokens/150  \n\nhttps://forum.cardano.org/t/documentation-how-to-create-ada-nfts/50131  \n\n++Metadata++  \n\nMetadata tells the story of transactions made on the blockchain. Cardano is working to provide cutting edge tools for embedding data into transactions and while adding robust search functionality in the block explorer. Check out our blog on metadata or look at our documentation for more information.\n\n++The Marlowe playground++\n\nMarlowe is our bespoke domain specific language (DSL) built for creating robust financial smart contracts on Cardano. For a closer look at Marlowe check out our recent blog or check out our overview on the Cardano Developers page."}