{"id": 381005, "author": "matthiasksieber", "title": "Haskell & Coffee ☕", "url": "https://cardano.ideascale.com/a/dtd/381005-48088", "category": 26234, "amount": 8200, "description": "Il n'existe pas beaucoup de moyens pour les nouveaux développeurs Haskell d'apprendre et d'échanger des connaissances avec des développeurs expérimentés dans un écosystème décentralisé.", "funded": 2, "upvotes": 85957784, "downvotes": 3652601, "votes_result": 82305183, "votes_cast": 492, "f6_no_assessments": 8, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "As a developer, we really need this kind of community event. It will help keep the DEV community together, to learn more about Haskell, Plutus and also how to propose a good project in Catalyst.\r\n\r\nIn addition, the workshops & mentoring will increase collaboration between developers to create project in Project Catalyst.", "q0r": 5, "q1": "The team consists of experience people in Plutus and Haskell, and also several team member from Gimbalabs, in addition with Victor from Catalyst School to give workshop. \r\n\r\nIn my opinion, this proposal will be implemented successfully if funded. Budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion. \r\n\r\nMoreover, the team also include realistic time frame to complete the work that they mention in the proposal.", "q1r": 5, "q2": "KPI that define the success of the proposal is included and clearly described. Roadmap and time frame for every achievement is well-written too. Maybe adding specific milestones for each month would give more information for the community.\r\n\r\nAdding a link, such as: Meetup or Discord channel, where Cardano Community could track the project progress will also add some additional value to the proposal.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The the proposal addresses the criteria for the challenge because it works to increase the number of people who are knowledgable in the Haskell language to code Cardano smart contracts. There is a demand for programs, such as this one, due to the complexity of Haskell, so providing a friendly environment for individuals of all skill levels to participate can bring more community members and proposers. Although this proposal does not necessarily immediately increase the number of community members involved with project catalyst, it can influence the number of future catalyst participants, especially in challenges related to smart contracts since more people will be able to learn about Haskell through this project. (score given: 4)", "q0r": 4, "q1": "Based on the information provided, it does appear that the proposal will be successfully implemented because the proposers have many years of combined experience with software engineering. \r\nThe plan outlined by the proposers does seem feasible because the program will run weekly for three months. Recording the sessions also allows members of the community to catch up with the lessons -- a valuable feature given that people are busy and might not be able to make it to every session. The budget seems to be reasonable given the time spent on the program. (score given: 5)", "q1r": 5, "q2": "The proposers only mentioned 2 key performance indicators, participant numbers and retention rates throughout each session. While these are two very important metrics to track success, it would be helpful if there were some other metrics as well. How can the community be certain that this program will lead to meaningful engagement with project catalyst in the future? If the proposers could elaborate on some other key performance indicators, it would greatly strengthen the proposal. (score given: 4)", "q2r": 4, "assessor": "z_assessor_310", "no_vca": 21, "ne": 9, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposers have clearly identified a looming problem that unaddressed will become Cardano's bottle neck. Haskell is still unpopular among the general developer landscape. Which perhaps stems from the Haskell dev team of uncompromising their rigidity for popularity. Though widely known companies such as Microsoft and Kaspersky Labs uses Haskell. Creating this approachable setting to discuss everything Haskell is the perfect marketing tool this code needs. It will attract not just Haskell users but individuals, companies, entities who seek Haskell developers. This proposal will definitely benefit and effect the Cardano ecosystem as a whole, from the increase in  quality of proposals to the number of curious participants seeking collaborators in various community events. The proposers idea is very easy to scale and I predict will naturally scale.", "q0r": 5, "q1": "The proposer and co-proposer are stellar examples of proven Cardano community members. One is a Cardano Ambassador and Catalyst Circle member of Cardano Foundation, also a CA and vCA with years of experience in software engineering. While the other is the founder of Catalyst School, also CA and vCA. Based on the stated team, they have the technical expertise and experience to achieve the intended deliverables, though links on their experience would have been helpful. Their budget is easily broken down making it easy to understand and is very reasonable but would have appreciated more detail. Most specifically what are they trying to deliver in the coding sessions since it is mentioned they need 1,5 hours to prepare for the coding sessions. They unfortunately did not consider potential risk or threats regarding this proposal also, which perhaps can come in the form of language barriers or the fact that it's an online event, where people might have already reached Zoom fatigue; 'How will they counter that?' Nonetheless, because they are stellar examples I believe the community will help them and am 100% this proposal will eventually deliver.", "q1r": 5, "q2": "Since the duration is only 3 months the roadmap is clearly stated and easily imagined. Though there are no clear metrics of success, for example; 'How many participants do they seek to onboard after 3 months?' or 'What percentage retention rate are they aiming for?' and for that I can only give a 4-star rating. Between their problem statement and solution there is a clear connection which supports each other.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 24, "ne": 3, "ng": 14, "nfo": 7, "vca_o": 1, "reply": "In terms of Auditability, the CA states that there is a \"Lack of concordance of challenge indicators and KPIs\" but it doesn't explain where is that lack of concordance, when the proposal explains in detail that this is a Governance Body, comprised of a Cluster of 4 proposals, 9 SMART KPIs where provided with dates and measures, and all those KPIs are totally related to the challenge and the purpose. I do not agree that the proposal will not be auditable by the community, and the CAs did not provide a valid reason for that, just an opinion."}, {"q0": "The proposal is within the challenge because it aims to increase technical Catalyst members by organizing weekly coffee hangout for tackling Haskell code problems. If it is successful, we may have new developers for Cardano and Catalyst community.\r\nHowever, I would recommend the proposers add more details about the key metrics for readers can see clearer if the key metrics align with the outlined challenge settings.", "q0r": 4, "q1": "The proposals describe the team's experience and relevant skills in detail with feasible budget (clearly broken down into identifiable items, just a small mistake at the result of calculation: $700x12=8400 instead of 8200 actually). However, I would like to know more about these things:\r\n- What is the content of the meeting each week in detail? The proposers mentions content is about to tackle Haskell code problems, to help students on improving their skills. I hope I can see more clear in the plan.\r\n- How does the success look like?\r\n- What is being done after each week?\r\nAnd I would recommend the team should add reference or links to represent relevant skills and experience of the team and describe the resources which are needed for the successful implementation.\r\nBecause of missing a sensible and conductible plan I rate feasibility with a score of 3.", "q1r": 3, "q2": "The proposers commit to transparency process with the community by recording and uploading all sessions to YouTube. However, I recommend roadmap and milestone should be added. The KPIs are not clear to be audited. The proposers should give an expected number of participants in each sessions and in all sections (if possible) as the targeted problem to be audited. The targeted problem should also need to be described understandable clearly as well as the solution that addresses the problem. Since this idea is good, I believe the team will make it become fully auditable in next Fund. \r\nNow I do not agree the proposal is auditable.", "q2r": 2, "assessor": "z_assessor_714", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1, "reply": "The CA mentiones that no roadmap or milestones were added to the proposal, but we explicitly mentioned that we will host 12 sessions between February and April 2022. Due the this proposal's simplicity, it doesn't required a detailed roadmap and also milestiones, since the implementation is quite straight forward: hosting the mentioned Haskell coding sessions."}, {"q0": "As the aim of the proposal is to organize caffeine hangouts to tackle code problems with Haskell, the proposal fits into the challenge settings. However, the problem statement has not fully reflected the challenge because it's only the Haskell that is the priority in that section. Cardano's benefit from this proposal is narrow since developers will first have to learn Haskell then become Plutus developers and after which can build smart contracts on Cardano.", "q0r": 4, "q1": "Per the information provided in the \"relevant experience\" section, I believe the team possess the skills needed to implement the proposal. What is missing are links and references. The budget is well presented and reasonable for the implementation of the proposal. I was hoping to see an in depth description of Haskell so that the proposal can be much appreciated. The plan presented is comprehensible enough to achieve the proposal. What is missing are the possible risks/challenges involved in the implementation of the proposal. ", "q1r": 4, "q2": "The proposal has provided a roadmap for its implementation. However, time horizon for the implementation of the proposal is not included. Also, milestones are not clearly identified. I appreciate the fact that the proposer has included metrics for the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Great proposal and a fantastic way to learn Haskell. The idea is wonderful and good for the community as I believe the event can help build more Haskell developers for the Catalyst community. ", "q0r": 5, "q1": "The team experience is excellent and involves a partnership with educators like the Catalyst school. The proposal would be successful based on the strategies, road map, and measurable outcomes. Also, recording the lesson and uploading on YouTube would be essential to make individuals in regions with low internet connectivity (Africa) catch up with the lessons as well. ", "q1r": 5, "q2": "The budget is detailed and the proposal is open. The road map of activities is traceable and helpful for documenting and auditing. I believe this proposal should get the needed support from the community. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "In terms of community events that can have a positive impact on the future of Cardano, this is at the top of the list. There is a huge need to grow the number of Haskell developers so that we can continue expanding the number of dApps on Cardano. I think this project is a worthy cause and is a smart way to spend ~$8,000.", "q0r": 5, "q1": "It's clear from the team's resumes that they are incredibly qualified to lead this educational series. Their work on Liqwid and with M Labs is exactly what we need more of. Having them lead these events and share their practical knowledge of building dApps will be an important resource. Their clearly outlined KPIs, budget, and partnerships also bolster my confidence that they will be successful.", "q1r": 5, "q2": "Their KPIs and budget clearly outline the scope of this event series. It's difficult to measure this in the short time, but I would love to see examples of success stories from these events in future funding rounds (for example, gathering data from attendees by administering a survey after events to see how they have benefitted.) In terms of the community's ability to audit this proposal, the KPIs and budget will be easy to keep track of in future rounds. ", "q2r": 5, "assessor": "z_assessor_753", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This proposal aims basically an approach to onboard new developers and existing ones  alike to discuss and shares idea with experts on transparent and friendly collaborative environment. The proposal will create and nurture active participation by community that is interested on issues concern on haskell programming languages.", "q0r": 5, "q1": "The profile of the proposal's team has requisite qualification, skills and experience to deliver on this project. In addition, The proposal has well detailed plans  in terms of budget and its deployments and roadmaps to be achieved. Am convinced that the proposal is in the right hands. ", "q1r": 5, "q2": "The metrics provided in the proposal is quite effective to its assess progress and performance", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Un rendez-vous hebdomadaire sous le signe de la caféine pour s'attaquer à des problèmes de code avec Haskell dans un environnement virtuel amusant et accueillant.", "experience": "Ingénieurs en logiciel senior, instructeurs de codage, pionniers de Plutus, vétérans de Gimbalabs PPBL, lauréats du hackathon CardStarter et de Plutus Pioneers Capstone."}