{"id": 382265, "author": "matirdaeg", "title": "Cardano Creatives Swarm community", "url": "https://cardano.ideascale.com/a/dtd/382265-48088", "category": 26234, "amount": 6500, "description": "Il y a un manque d'incitations et d'environnements permettant aux cas d'utilisation de la blockchain une interaction directe avec les initiatives culturelles et artistiques.", "funded": 1, "upvotes": 34592582, "downvotes": 12441686, "votes_result": 22150896, "votes_cast": 255, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=10880"], "media": [], "f6_assessments": [{"q0": "Il s'agit d'une proposition de niche visant à étendre la constellation de l'essaim Catalyst afin d'inclure des artistes de tous types dans la conversation avec l'aspect technique de Cardano et Catalyst.  L'intégration de la culture, de la philosophie et des arts a été un processus osmotique au sein de Catalyst jusqu'à présent - en arrière-plan, sans culture - et cette proposition vise à mettre le rôle de ces domaines au premier plan avec un espace dédié et des membres responsables de la communauté pour mener la discussion.  La philosophie et les arts étant des outils permettant de découvrir et d'imprégner du sens, il est logique d'encourager ces outils à se développer parallèlement aux NFT et aux échanges, en se guidant mutuellement de manière réfléchie.  Il reste à voir à quel point la communauté est désireuse que cette avenue réclame une partie de la bande passante limitée de l'attention nécessaire pour naviguer dans les espaces déjà vastes de Catalyst (les premiers efforts des équipes de proposition ont indiqué que 30 personnes ont participé), mais cela pourrait n'être que le début.  En dehors de l'encouragement d'un dialogue sur le rôle des créatifs dans l'écosystème Cardano, cette proposition n'est pas très précise sur ce que pourrait être le résultat de cette campagne.  Elle suggère peut-être des ateliers d'art ou des expositions, mais ne précise pas vraiment comment cela fait évoluer Catalyst ou Cardano.", "q0r": 5, "q1": "Cette équipe de proposition semble avoir déjà mis en œuvre une version de base de cette idée, une session d'essaimage sous le format Catalyst Swarm, dont elle a tiré les idées pour cette proposition, ainsi que des canaux médiatiques sur discord et telegram, on peut donc s'attendre à ce qu'elle puisse répéter l'exploit si nécessaire pour continuer à livrer le produit.  Bien que cela ne soit pas explicitement indiqué, la feuille de route (sessions d'essaimage créatif, idéation visant à établir des questions et des objectifs créatifs fondamentaux pour Cardano, et préparation des nouveaux membres aux processus de Catalyst et de proposition) semble conduire à la création d'une équipe de défi Fund8 basée sur les créatifs.  À cette fin, la feuille de route énumère des objectifs concrets tels que l'établissement de sessions d'essaimage fiables sur 3 mois, tout en maintenant et en mettant en avant leurs canaux médiatiques dans Catalyst.  Si le calendrier de la feuille de route est quelque peu vague, les étapes sont spécifiques et réalisables.  La possibilité de s'appuyer sur les équipes et les protocoles Swarm existants donne à cette proposition une forte probabilité de succès.  Le budget est raisonnable et pour les 3 à 5 mois de couverture prévus, il devrait permettre de disposer de ressources suffisantes.", "q1r": 5, "q2": "La création de réunions publiques permet un haut niveau d'auditabilité, et les canaux médiatiques proposés devraient permettre à la communauté de rester en contact avec le projet au fur et à mesure de son développement.  Le site web/blog proposé ne sera pas disponible tout de suite, mais dès qu'il sera en ligne, il offrira un autre moyen de voir si le projet reste sur la bonne voie.  Enfin, ils espèrent apporter leur contribution au moins une fois par mois lors des Town Halls.  La mesure des objectifs semble toutefois se limiter au suivi du nombre de participants au groupe et peut-être au nombre de \"sous-groupes\" spécialisés que la collaboration pourrait engendrer.  Une autre mesure qu'ils devraient envisager, surtout s'ils pensent pouvoir parrainer une équipe de défi dans Fund8, serait un certain nombre de paramètres de défi très spécifiques à gérer au cours des premiers mois et des premières réunions.  Un exemple pourrait être un concept comme la \"valeur\", qui a des racines profondes dans la philosophie et l'art, et de consacrer des sessions de l'essaim à la réflexion sur la façon de créer un cadre de défi détaillé et concret autour de ce concept.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This will be a beautiful inclusion to the Cardano ecosystem. For I see this as an embryo towards the creation of Cardano art community, which is very important, the reason being will come later. General public might dismiss art due to the over-saturation of NFT projects which by it's nature to some extent is being exploited by individuals or entities, whether that be giving value to NFT through hype or market manipulation. Both practices has occurred in major NFT marketplaces and NFT issued by brands or influencers. Art's value is slowly being redefined by this practice and by the misconception of associating the current NFT with art. When there is a strong community of artists, curators, collectors, historians and educators talking to each other from around the world discussing blockchain and it's interaction with art in one forum, only then can NFT have value that is rooted in history, in art education, in techniques, in differentiation and not in hype. NFT is here to stay but NFT will evolve. Although this proposal articulates well it's intent, it's effectiveness in growing Cardano through the metrics of the Challenge setting, is a visionary sell. Meaning, only those who have the knowledge, understands the value of this proposal.", "q0r": 5, "q1": "The team involved and whom are in the proposal, on the basis of what is stated, correlates well the intent, knowledge and the implementation plan inside this proposal. There is also a mentioning of a co-proposer, though details regarding their background is limited. I can only wish there were links to the proposers but to a certain extent I can understand the nature of individuals from the art field. This though is counter-balanced by their timetable which is very detailed and also the intent to collaborate with Catalyst Swarm, a reputable community within Cardano. Proposer has also considered the challenge and risk they will face, which although is an obligation, not many take effort into explaining them such as what the proposer has done. This must be valued as upholding the standards of a good proposal. The small budget provided is also sufficient in comparison to the timeline determined and goals to be achieved.", "q1r": 4, "q2": "Again there is a detailed roadmap, although not attached with numerical targets, situations correlating with art is valued not by numbers but by the quality of engagement. Which in the beginning can be limited interactions in the grand scheme of things. Provided also are OKR's and KPI's that fits well with how developing a creative environment can be. Problem statement also correlates well with the solution provided.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 17, "ne": 8, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal focuses on exploring and establishing an environment of social and cultural inclusion to support, facilitate and generate culture and art movements. This is a great and attractive idea. The problem is clearly explained in detail. The solution is clearly defined, shows the clear potential impact on the ecosystem in long term. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, skill, experience is suitable for implementation, but without reference/proof (documents/links,...) for verifying. The roadmap is clear but without KPIs/metrics are not measurable. Budget explanations of calculation base are not provided. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, but for better understanding, my advice is: (1) Budget explanation for each item should be provided; (2) KPIs should be specific and quantitative; (3) Risk should be analyzed. Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is a good idea. However, it's difficult to understand the problem statement, it appears to have a grammatical challenge though the idea of the problem statement with proper scrutiny can be ascertained just that time will have to be spent to better understand it. However, the goal of the proposal fits into the challenge settings and hence if implemented will be of benefit to Cardano.", "q0r": 4, "q1": "I believe that the proposer has skills for the implementation just that it would have been more appropriate to add links and references. The proposal is a one man team.\r\nThe budget is well presented.\r\nThe proposer has also outlined the possible challenges involved in the implementation of the proposal.", "q1r": 4, "q2": "The proposer has provided a comprehensible step-by-step plan, milestones and time horizon for implementation of the proposal. The proposer has also stated the metrics/KPIs for the success of the proposal.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal addressees the challenge brief and requirements. The proposal speaks in clear terms how they intend to provide a desired solution to their current problem by organizing events which is able to add more value to the ecosystem by onboarding  individuals into Catalyst etc. Good job by the proposer", "q0r": 4, "q1": "The proposer from my assessment of the proposal has the required knowledge set to carry out the project. But the proposer failed to add links and details of his team members who will help him execute the project should the be funded. the budget is reasonable to carry out the project but not so elaborative enough that is being broken down into smaller activities.", "q1r": 3, "q2": "The proposer has included a roadmap to guide in the project execution. The proposer has also stated the metric/KPI's which is  key to tracking success and progress of the project when funded.", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This is a great project and should be supported overwhelmingly. \r\nIt aims to create a platform where active participation and collaborations in the project catalyst can be given a broader perspective of onboarding potential new members from other spheres of human endeavors.\r\n Creating awareness and sense of belongings to other members that may not be technical in their affiliations and providing solutions to their needs and aspirations in the community, could be of immense benefits to the goals and set objectives of the campaign.", "q0r": 5, "q1": "The team seems to well qualified  and the plans to collaborate with the catalyst swarm and leverage on their format and experience is very helpful. The project has also provided a detailed budget plans and roadmaps couple with its risk factors consideration, am of the opinion will be successfully implemented.", "q1r": 5, "q2": "I think that the metrics provided at this stage of the proposal is effective enough. Considering the detailed roadmaps and/or milestones provided and with the plans to make their activities easily accessible by the community, the project can be fairly assess for its progress and success of the project.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Explorer et établir un environnement d'inclusion sociale et culturelle pour soutenir, faciliter et générer des mouvements culturels et artistiques.", "experience": "Études en architecture, construction écologique, artisanat, histoire de l'art et sociologie. Consultante et conseillère psychologique et pédagogique."}