{"id": 382330, "author": "swhitenstall", "title": "Catalyst Swarm 2022 GitBook", "url": "https://cardano.ideascale.com/a/dtd/382330-48088", "category": 26234, "amount": 4350, "description": "La documentation du projet Catalyst nécessite un soutien pour être durable.", "funded": 2, "upvotes": 124217289, "downvotes": 2056258, "votes_result": 122161031, "votes_cast": 592, "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "En tant que membre actif de la communauté Catalyst, avec une participation régulière aux événements, mais aussi en tant qu'organisateur d'événements et bâtisseur de communauté, je pense que cette proposition répond efficacement à l'objectif du défi, en particulier en aidant à augmenter la participation et l'intégration des nouveaux membres, en promouvant l'objectif et en documentant les événements et les réunions de la communauté Catalyst Swarm. Des communications claires et bien documentées aident les gens à comprendre ce qui se passe et à définir comment et où ils veulent participer.\r\nUn domaine d'amélioration cependant, pourrait être de créer un gitbook de la communauté Catalyst ENTRY, qui peut référencer les différentes communautés et groupes, permettant à de nouveaux groupes de soumettre leur volonté d'être ajoutés, co-créant une sorte d'index des communautés et de leurs événements et nouvelles (mais cela pourrait être une proposition distincte comme un parapluie pour cela et d'autres qui nécessitent la même chose).", "q0r": 5, "q1": "J'ai vu le travail précédent de QA-DAO et je peux certifier que Stephen est un membre bien connu et actif de la communauté Catalyst, impliqué dans de nombreux projets, Vanessa semble également très active dans la création de plusieurs projets similaires, comme la surveillance du Catalyst Circle. Je pense donc qu'ils sont tout à fait capables de mener ce projet et de tenir ses promesses.\r\nLe calendrier du projet est approprié et je pense qu'il couvre la capacité nécessaire pour les objectifs énoncés, ils ont également identifié des objectifs à court, moyen et long terme.\r\nL'équipe et l'effort sont bien identifiés et s'alignent sur le budget demandé. Les risques ont également été identifiés et leurs atténuations également.\r\nPour la valeur que ce projet apportera, je pense que le montant du financement demandé est conforme au soutien de la communauté.", "q1r": 5, "q2": "Le calendrier fourni est bien détaillé et comporte des résultats généraux spécifiés pour chaque étape, les indicateurs clés de performance fournis sont alignés sur ceux des objectifs du défi. Mais pour que les résultats et les indicateurs clés de performance puissent être vérifiés correctement, certains objectifs de mesure quantifiés spécifiques auraient dû être fournis (par exemple, 6 sessions Swarm documentées dans le gitbook - 2 par mois). Comme les activités Swarm sont très publiquement communiquées et suivies par de nombreuses personnes de la communauté, je pense que le projet peut être suivi et contrôlé pour comprendre qu'il fournit la valeur promise, mais il aurait été préférable d'avoir ces chiffres (c'est la raison du 4).\r\n", "q2r": 4, "assessor": "z_assessor_288", "no_vca": 21, "ne": 14, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "La connaissance de l'état du projet Catalyst (c'est-à-dire ce qui s'est passé, quand cela s'est passé, ce qui se passe maintenant et où) peut être l'un des problèmes les plus frustrants pour un nouveau venu (et même pour un vétéran établi !) lorsqu'il se plonge dans cet écosystème.  Des documents tels que QA-DAOs Catalyst Circle et Genesis gitbook représentent un niveau de base de connaissance de l'état qui est facile à référencer et à distribuer, et soutenir ces types d'efforts garantit qu'ils seront disponibles alors que la communauté connaît une croissance exponentielle, et la confusion qui peut l'accompagner.  Le financement communautaire de QA-DAO Swarm 2022 est une étape clé dans la pérennisation de cette base de connaissances et pourrait être un excellent exemple d'utilisation du financement Catalyst s'il acquiert le statut d'autofinancement, dans un avenir proche.", "q0r": 5, "q1": "Cette équipe a déjà été financée dans les Fonds 5 et 6, y compris pour des propositions similaires, et le Gitbook derrière la proposition actuelle (Swarm) a déjà un modèle précurseur à développer.  Le budget présente à la fois une allocation raisonnable des ressources et des charges de travail et délais raisonnables pour la maintenance du hub d'information.  Le facteur le plus important dans les projets de cette nature est de savoir si le développement d'une telle ressource communautaire atteint réellement le public visé.  L'équipe a établi une feuille de route avec des indicateurs clés de performance pertinents qui lui donnent une bonne chance de diffuser avec succès ce produit à la communauté.  L'exposition interne de la communauté Catalyst (discord, telegram, townhalls, etc.) est réfléchie et vise une adoption de niveau moyen, comme les hôtes de salles de réunion, et l'exposition plus large sur twitter, reddit, etc., bien qu'elle puisse certainement parler à la communauté Catalyst, servira probablement un double objectif d'intimider le haut niveau d'auditabilité et de responsabilité de la gouvernance du projet Catalyst aux utilisateurs ou aux adoptants potentiels de Cardano.  S'il y a un problème ici, c'est peut-être simplement qu'il y aura tellement de demandes pour ces informations, et tellement de choses qui doivent être enregistrées, que cette petite proposition pourrait être dépassée et devoir réduire sa zone cible.", "q1r": 5, "q2": "Les projets précédents de cette équipe ont maintenu des normes élevées de responsabilité envers la communauté, et ont en fait représenté eux-mêmes ces normes élevées.  Il s'agit d'une pensée méta-audit, où ils fournissent les outils pour auditer avec succès la communauté dans son ensemble.  À cette fin, les Gitbooks sont publics, et ils ont clairement indiqué leurs intentions quant à ce qu'ils chercheront à suivre.  Il devrait être facile pour les utilisateurs intéressés de suivre le processus et même de suggérer des changements sur place.  Les indicateurs clés de performance énumérés fournissent des points de contrôle naturels (seuils d'ajouts, seuils de visualisation de pages) et des mesures incrémentielles qui devraient maintenir le projet sur la bonne voie.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Documentation of Project Catalyst requires support to be sustainable as otherwise documentation wont get done.\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by providing resources to do the documentation & tracking of Project Catalyst and thereafter ommunicate the content of the Catalyst 2022 GitBook to the community.\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a document. \r\n  Key metrics  would be  number of downloads,  number of page views, number of users of the book   \r\nThe key metrics and goals of the proposal fall within the scope of the challenge \r\nProposal can be scaled up to address future challenges by adding more content to the document. Maybe variations for different use cases and regions. Maybe localizing into local languages\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members to build this book, and localize it into different languages.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n I am also a writer and publisher of English and Local language books\r\n", "q0r": 5, "q1": " \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as managing the documentation process for these events.\r\n\r\n The links are sufficient. \r\n \r\nI have visited these links and contacted the relevant people\r\n  \r\n \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated. \r\nThe team structure is listed and experienced.\r\n The budget has   been given in detail. \r\nThe budget is  reasonable to achieve the set goals.\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n \r\nThe proposal has technical aspects which have been addressed \r\n\r\nThe proposer has  identified risks in this namely that he would not be able to continue in this capacity , the solution is its migrating to QA DAO.\r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   ", "q1r": 5, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms. \r\n   \r\nThe problem has been clearly understood and solution has been given in much detail. \r\n    The proposer has not identified possible hurdles, challenges and difficulties other than what would happen if he werent able to do this in future. He has a solution for that which is creditable \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "I agree that it is important to keep track and archive information flow, yet it is not in a perfect accordance with the challenge goal - to increase community participation, rather than keep the community alive :)\r\n\r\nOverall a good proposal, rating given 4.", "q0r": 4, "q1": "The relevant experience is stated, with a detailed roadmap and team members are a well-known community members.\r\n\r\nI am very convinced that they can implement the proposal to the successful end. \r\n\r\nRating given 5.", "q1r": 5, "q2": "A detailed KPIs are provided which I find to be sufficient to audit the progress and the final product. \r\n\r\nI also like a risk mitigation approach, which increases the overall feeling of the proposal.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal to the untrained eye might seem out of place in regards to this Challenge which is called Community Events. Please take note though, the core development of any business, any organization and event organization is data. When you do not have a database, you can not leverage that database for support in terms of finance, in terms of onboarding quality collaborators, in terms of sending signals of the events credibility to the larger community etc.. Simple example; if an event that has been ongoing for 3 months can not provide data of their participants growth, the chance of that event's capability to find further funding would be very challenging. This documentation system that is currently being developed will help community event organizers throughout the Cardano community to have  a universal database input system that can be easily tracked and is 100% transparent. The output of this proposal is what addresses this Challenge effectively. How things are made clearly structured can be viewed through the various links provided by the proposer, shows factually how beneficial this database system is. It is easily scalable and can be applied to any form of meetings, Zoom meetings, discussions etc.", "q0r": 5, "q1": "Through the experience stated and various links provided, it is clear the proposers are high performing individuals. Most specifically one of these proposers are also stellar examples of an individual who contributed their skill continuously for the development of both, the Project Catalyst ecosystem and Project Catalyst itself by supporting the meticulous documentation of Catalyst Circle. Budget wise, it is clearly stated with an adjoining action plan, though  the numbers requested are very low. In comparison to the services provided the amount is unreasonable. A continuing trend in Project Catalyst that is borderline unhealthy. Timetable correlates well with the type and amount of work. Above all, this proposal has taken account the risk and challenge they might face and have even formulate mitigation steps. Kudos to the proposer for a great job in writing up this proposal!", "q1r": 5, "q2": "Roadmaps are clear, with a detailed adjoining action plan and milestones with clear dates. Although there are also numerous KPI's, unfortunately they will be challenging to audit for there are no numerical targets. Problem statement and solution have been well thought of and are interconnected with one another. A byproduct of this interconnection is this amazing proposal. Again, great job!", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "As the aim of this challenge is to fund maintenance of the Catalyst-Swarm-2022 GitBook, this proposal fits into the challenge settings and undoubtedly Cardano will benefit.", "q0r": 4, "q1": "I believe the team possess the skills and experience to achieve the proposal. I can see links provided and that for me is good.\r\nTo add, the is well presented and reasonable for the achievement of the proposal.\r\nThe proposer has provided a detailed and comprehensive plan for execution and that for me is very key for the successful implementation of any proposal. It's good that the proposer has outlined the possible risks involved in the implementation of the proposal.\r\nThe proposer has also given clear understanding to some technical terms used in the proposal like sustainability, maintenance etc", "q1r": 4, "q2": "The proposer has provided a roadmap and detailed time horizon for the achievement of the proposal. The metrics/KPIs that define the success of the proposal are captured. The targeted problem and it' is clear and well understood.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Documentation, tracking and publicizing of Catalyst activities and events are vital and value adding initiatives that needs to be supported. This will provide new proposers access to existing proposal and events that will beneficial to them.", "q0r": 5, "q1": "The team behind this project are individuals with long standing experience in the cardano community, undertaking this project on a smaller scale prior to asking for funding shows their readiness to execute this project. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely not only serve as a source of history for cardano activities, but it will also serve as a source of knowledge base on how to organize events and how to develop proposals. Additional, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, based on the proper budgetary allocation provided, it will be very easy implementing the project successfully when funds are provided.\r\n", "q1r": 5, "q2": "To project provides a metric to monitor and track the progress and success of the project; for instance, the project has a system for knowing page views (measured by Google Analytics); growth of page views during project, accessing comments, views and interactions on social media and a system to let new catalyst members become aware of the Gitbook (measured e.g. by occasional Zoom polls at Swarm breakout rooms to ask if new attendees are aware of it)\r\n\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Ressources pour la documentation et le suivi du projet Catalyst.  Communiquer le contenu du GitBook Catalyst 2022 à la communauté.", "experience": "QA-DAO possède une expérience combinée de 50 ans dans le soutien, la documentation, l'audit et l'engagement de communautés indépendantes telles que Catalyst."}