{"id": 383009, "author": "wadaghana", "title": "Mass Cardano Education for Students", "url": "https://cardano.ideascale.com/a/dtd/383009-48088", "category": 26234, "amount": 26000, "description": "L'éducation est la clé de l'adoption et de l'utilisation d'un service. Comment pouvons-nous sensibiliser les étudiants du nord du Ghana à l'écosystème Cardano et à ses avantages ?", "funded": 1, "upvotes": 54863067, "downvotes": 9764557, "votes_result": 45098510, "votes_cast": 472, "f6_no_assessments": 14, "f6_rating": 4.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "Je pense que cette proposition répond aux objectifs du défi, car en lançant l'idée de créer un événement sur Cardano pour éduquer et engager les gens dans le nord du Ghana, ils abordent les sujets de l'apport de nouvelles personnes dans la communauté et de la formation de nouvelles équipes, et en favorisant cette entrée de nouveaux membres, la communauté entière en bénéficierait. Cette proposition s'inscrirait également, à mon avis, dans le cadre du défi \"Grow Africa, Grow Cardano\", lancé lors du précédent cycle de financement. L'impact local serait certainement très bon, car en fait, l'Afrique est un lieu potentiel pour le développement de Cardano, comme la communauté elle-même le reconnaît en proposant un défi spécifique pour le continent à f6. Mais j'aimerais que les auteurs en disent plus sur le Ghana, pourquoi ce pays ? En général, la proposition est en ligne avec certains des objectifs du défi, se concentrant plus sur la partie d'amener des étrangers à la communauté Cardano, j'aimerais plus de détails dans la proposition sur pourquoi le pays en question a été choisi. À part cela, j'ai aimé l'idée, je pense qu'elle est de grande valeur et peut apporter de grands avantages à la fois pour le lieu choisi et pour notre blockchain.", "q0r": 4, "q1": "L'équipe impliquée dans le projet, Wada, a déjà une bonne réputation pour Catalyst, j'ai moi-même évalué plusieurs de leurs propositions (dans le défi Afrique, de f6, il y en avait plusieurs qu'ils ont libérées). En raison de ce répertoire, beaucoup de confiance dans leur capacité à mener à bien le projet est transmise. Ils joignent également le lien du site Web, où l'on peut voir divers contenus qu'ils ont produits et comprendre l'ampleur du groupe, pour ceux qui ne les connaissent pas. Cependant, j'aurais aimé qu'ils incluent une liste avec les noms des personnes qui travailleraient sur ce projet, spécifiquement, parce que comme promoteurs nous avons Jeremiah et Wada, puisque Wada est un groupe, qui dans le groupe agirait ici ? Nous aurions besoin de connaître leurs noms, leurs rôles et leurs expériences passées afin de transmettre une compréhension complète de cette partie de la proposition. Qu'en est-il de Jeremiah, que fait-il, quelle est sa relation avec l'écosystème Cardano ? Il n'y a pas de scénario à établir ici, nous savons que des conférences seront organisées dans le but d'exposer aux étudiants ce qu'est Cardano, comment il peut bénéficier à leur localité et leur donner des opportunités de travail. Un script est établi, qui pourrait être plus détaillé, organisé en fonction du passage du temps (par exemple, au mois 1 ceci serait fait, au mois 2 cela serait fait, et ainsi de suite). Nous ne savons pas dans quelles villes, si les auteurs ont déjà en tête des établissements d'enseignement à contacter, quel est le nombre moyen d'étudiants qui attendent une réunion, quelles matières (par thème) seraient enseignées, qui seraient les professionnels pour transmettre les contenus... La division financière est également abstraite ; le budget est assez élevé, et les parties en lesquelles il a été divisé ne sont pas détaillées. Par exemple : 7000 $ pour le transport, le logement et la nourriture des personnes. Combien de personnes, quelles personnes, iraient où à où, séjourneraient où ? 2000 $ pour la publicité, comment cela serait-il fait étant donné qu'il existe plusieurs approches marketing ? En général, il manque des détails dans plusieurs parties, à la fois pour comprendre qui serait l'équipe, ce qu'ils feraient pour réaliser le projet, et comment l'argent serait utilisé.", "q1r": 3, "q2": "À mon avis, c'est la partie qui est la mieux envisagée dans la proposition. Les auteurs nous ont fourni beaucoup d'informations qui peuvent être utilisées pour le suivi du projet. En commençant par la vision du succès, nous savons exactement quel scénario ils visent, donc nous savons quoi mesurer lorsque le projet commence à produire des résultats. La question de savoir combien de dapps simples émergeraient, de programmeurs Haskell et d'autres données infimes devrait être constamment évaluée par quelqu'un (ou un groupe) choisi pour cela, ou même un membre de Wada lui-même pourrait organiser ces données et donner un retour à la communauté. Les auteurs exposent également certains risques et défis auxquels le projet serait confronté, ce qui nous permet de contrôler, également, si de telles barrières ont été franchies. Je pense que nous disposons de suffisamment d'informations pour réaliser un grand audit, il suffit de sélectionner la ou les personnes prêtes à rassembler de telles statistiques et à les faire connaître au reste de la communauté Cardano.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Pour moi, l'idée du projet est fantastique. L'objectif du projet étant d'atteindre plus de deux mille étudiants dans les établissements d'enseignement supérieur et les lycées du nord du Ghana pour les informer des opportunités que Cardano apporte au continent africain et de la manière dont ils peuvent participer au projet en tant que catalyseur, il faut donc s'attendre à ce qu'il y ait un certain niveau d'appréciation en termes de connaissances de la technologie Blockchain et plus particulièrement de Cardano.\r\n\r\n\r\n\r\nJe constate que les auteurs du projet ont clairement défini le problème qu'ils cherchent à résoudre en indiquant les étapes à suivre pour y parvenir.\r\nL'un des principaux objectifs décrits dans cette proposition est l'adoption de Cardano et la participation des institutions du Ghana par le biais du projet Catalyseur.\r\nÉtant donné que ce projet s'adressera principalement aux étudiants des écoles supérieures et des lycées, je pense donc que l'éducation sur Cardano aura un impact considérable sur les masses, car il faut surtout des personnes éduquées pour influencer les personnes non éduquées à comprendre les questions fondamentales de la vie.\r\n\r\nUne question que je voudrais que les proposants essaient de clarifier est d'être spécifiques avec les écoles qu'ils vont sélectionner, quels critères ils vont utiliser pour ces sélections et quelle sera leur motivation pour cela ?\r\n\r\nEn conclusion, je suis tout à fait d'accord avec les proposants sur le problème qu'ils ont identifié et sur les solutions et plans qu'ils ont proposés, avec l'espoir qu'ils seront capables de faire un excellent travail lorsqu'ils seront soutenus. Je leur attribue la note 5.", "q0r": 5, "q1": "Je suis convaincu qu'avec le plan et les expériences présentés dans la proposition, la mise en œuvre sera finalement un succès.\r\n\r\nIl est évident que les auteurs de la proposition sont composés d'une équipe de personnes compétentes ayant diverses expériences dans le développement, l'éducation et les praticiens actifs de la communauté Cardano. S'ils sont capables d'utiliser leurs connaissances approfondies de la technologie Blockchain et plus particulièrement de Cardona pour éduquer leur groupe cible, c'est-à-dire les étudiants des établissements d'enseignement supérieur et des établissements de deuxième cycle, cela permettra de former de nombreux ambassadeurs de Cardona qui pourront mieux se répandre dans d'autres régions du pays.\r\n\r\nIls ont également démontré qu'ils ont de l'expérience dans l'organisation de programmes pour les étudiants. Cette expérience les aidera dans leur démarche pour faire accepter ce projet par les différentes écoles, ce qui permettra une mise en œuvre sans heurts.\r\n\r\nSur le plan, je vois un calendrier bien coordonné qui est réaliste et réalisable.\r\n\r\nConcernant l'activité, l'organisation de conférences et d'ateliers. Il serait bon d'indiquer clairement pour quel niveau d'étudiants vous allez organiser des conférences et pour quel niveau vous allez organiser des ateliers, car les deux sont différents dans leur approche.\r\n\r\nEn ce qui concerne les moyens de publicité, je vous suggère d'ajouter les émissions de télévision et de radio. Il s'agit de l'un des moyens les plus dominants pour atteindre les gens avec un message qui peut leur être bénéfique.\r\n\r\nEn ce qui concerne les défis qu'ils envisagent de relever, je pense que la prise en compte des réunions virtuelles pourrait être la clé ici puisque la pandémie n'est pas encore terminée.\r\nIls pourraient également envisager de demander la permission au Service de l'éducation du Ghana pour avoir accès aux écoles qu'ils ciblent. Cela pourrait les aider à ne pas se voir refuser l'accès aux étudiants pour leurs programmes.\r\n\r\nJe conclus, les plans partagés dans cette proposition ont été bien articulés sauf les quelques observations que j'ai faites. Je leur attribue une note de 4.", "q1r": 4, "q2": "Le proposant a fait un bon travail en fournissant des informations sur la manière dont le projet sera audité et les allocations budgétaires pour leurs activités. J'aurais cependant souhaité qu'il ajoute plus d'informations sur ses activités. Ainsi, fournir des détails en termes de nombre de personnes ressources à utiliser pour le projet, combien de bannières et d'affiches ils prévoient d'utiliser, etc.\r\nDavantage d'informations sur le travail et la carrière des proposants auraient également pu être proposées dans la proposition afin d'éviter tout soupçon sur l'identité réelle des proposants.\r\n\r\nJ'attribue donc à cette proposition la note de 4.\r\n", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "\r\nThe problem needing to be solved has been identified and articulated namely that it can be hard educate students in Northern Ghana about Cardano Ecosystem and its benefits\r\n. \r\nIt is clear that this proposal falls within the scope of the challenge brief by Organizing community events to educate about 2,000 tertiary and high school students in northern Ghana about cardano and its benefits\r\n \r\nThis proposal shows how it adds value to the Cardano system by organizing community events  \r\n  Key metrics  have  been stated clearly. They include Number of attendees, Percentage who become CAs, Percentage who become referrers, Number of brilliant proposals to solve local problems, Percentage who become proposers, Number of students who create native cardano wallets, no of new voters, local Haskell Developers \r\n\r\nThe key metrics and goals   fall within the scope of the challenge\r\n   \r\nProposal can possibly scale up by bringing in new schools and universities\r\n\r\nThis project will have a positive impact on Cardano system by enabling ease of seeing events going on as well as listing yhour own event\r\n\r\nI can say that this proposal  adequately addresses the challenge   hence i have given it a 5 star rating.\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 5, "q1": "\r\nThe proposers  has not provided ample evidence  of themselves with their skills and experience in software road shows, or conference management. His name is not given and no profile links on FB IG or Linkedin are given.  Only the WADA link is given which gives me no basis to assess.\r\n \r\n The links are not sufficient. \r\n \r\nIts unable to contact anyone since no one is listed as contacts\r\n   \r\nIt is hard to say if the proposers are  experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated as him and his son\r\n  \r\nThe team structure is not listed  \r\n \r\n The budget has  been given in detail. It is far too high in my professional opinion as a CEO of a web development company for over 10 years and organizer of various events.\r\nMost of the money has been allocated for transportation , feeding and accomodation of resources persons. In this case a better option is to have an online conference. Another large cost component is refreshements and conference rental space. In the COVID environment having such large \r\n \r\nThe budget is not reasonable to achieve the set goals.   \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are  described.   \r\n  \r\nThe proposal has technical aspects which have  been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n\r\n\r\n This proposal is detailed but budget is much higher than it could be if considered a little more, hence I have given it a 2 star rating.   \r\n\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\n", "q1r": 2, "q2": "\r\nThere is a clearly laid out roadmap with milestones   \r\n\r\n There are  Metrics such as Number of attendees, Percentage who become CAs, Percentage who become referrers, Number of brilliant proposals to solve local problems, Percentage who become proposers, Number of students who create native cardano wallets, no of new voters, local Haskell Developers, \r\n  \r\nThe problem has been  understood and solution has been given in  detail but the solution is not a cost effective one based on projections and cost centres.\r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\nThere are no contingency plans in place for various outcomes.\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the budget is very high hence I have given it a  3 star rating.\r\n ", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 5, "nfo": 8, "vca_o": 1}, {"q0": "The proposal very much aligns with what Cardano's purpose is; \"a platform built for a sustainable future, to help people work better together, trust one another, and build global solutions to global problems\". Educating youths and spreading awareness are essential to not only increase the number of participants in the ecosystem, but to also provide options in their life, opportunities and great exposures especially for students. ", "q0r": 5, "q1": "The risks have been clearly mentioned and how the proposer is going to address it. Vision of its success are effective to bring new users to the ecosystem, alongside with the roadmap that has been clearly given. To bring in 1000 students awareness and education will be a challenge but a possible one within 3 months. Although, the project activities can be elaborated much more (such as how the conferences and workshops are going to be held, I know the proposer have mentioned virtually, but how and what). I have tried clicking on the \"services\" of the proposer's website, but unavailable to do so. That brought me to the curiosity on the comment I gave. ", "q1r": 4, "q2": "The budget allocation have clearly broken down and it seems reasonable. With given links of the team members and their experiences, addition to the team in their website. I believe the proposal will be successful. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem is clearly descibed and explained in details. The proposed solution has a certain fit to the Challenge, with well-defined target group(high school students in Northern Ghana). Given the existing objectives and descriptions, the expected impact is clear. It would be more convincing if the author could add some quantification of the expected impact based on the listed key metrics.\r\nTherefore, I strongly agree that this proposal effectively addresses the challenge. I can rate the impact of this proposal with a score of 5.", "q0r": 5, "q1": "This proposal is clearly described, with details. The team's skill, experiences is suitable for implementation and Wada is a quite active team in this space; There are similar successful community events was organized by this team (in Northern Ghana, and Kumasi), achievements can be found on provided twitter's link. The budget structure is quite clear and logical with financial items, however, for better understanding, explainations of calculation base for each item are needed. Risk is clearly and logically defined with risk mitigation. \r\nTherefore, based on the given information, I strongly agree with this proposal's feasibility, and I can rate  this proposal with a score of 5.", "q1r": 5, "q2": "There is a lot of information provided. Team's profile is provided and described enough for understanding, with external links for varifying. The budget structure is clear but lacking of explainations (calculation base). The roadmap is provided with quantitative metrics. My advice is: (i) It is necessary to supplement the Budget Detail expenditure (basis for calculation) to show feasibility; (ii) Also, in case this proposal is implemented, on what platform can the community track the progress of the implementation?.\r\n\r\nTherefore, I can agree with this proposal's auditability and give 4 points.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The project Mass Cardano Education for Students by WADA aims to educate up to 2000 young people in Ghana about the benefits of Cardano. The proposal is aligned with the challenge in that it introduces a great number of new community members from Ghana to Cardano diversifying the community. The impact is local, with resources built specifically for the workshop series that could be deployed in other communities. ", "q0r": 4, "q1": "The proposer has successfully run workshops on Cardano in the region and seems to have a strong track record of achieving success in this space. The team are aligned with the proposal objective and have provided a clear timeframe and budget. ", "q1r": 4, "q2": "The community can audit the project progress through monitoring social media accounts. It would be benificial to hear directly from the participants along the way in terms of how the project is impacting them and benefiting them. \r\n\r\nThere are clear KPI's for the project although they are not given any specific metrics and are possibly a set of objectives more so than key performance indicators. The delivery dates are Feb-May 2022. The project has clearly identified risks such as covid lockdowns and how that might disrupt the progress of the project. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree the proposal addresses the objectives laid out in the challenge: organize community events to widen Cardano ecosystem as well as Catalyst community by educating students in northern Ghana about Cardano.\r\n- The proposal's problem is within the challenge: YES, clearly.\r\n- The proposal clearly articulates how it will add value to the Cardano system: YES. Education for the youth (about Cardano) is the key to create a human resource potential for the growth of Cardano ecosystem. (This point is clear in section 'Evaluation' of the proposal).\r\n- The key metrics and goals of the proposal align with the outlined challenge setting: YES. Increase in the number of students participate in project Catalyst activities, the number of proposals submitted by those students, the number of Cardano wallets created by those students and the transactions from these wallets, the developers learning Haskell and developing local dapps, is within the challenge setting.\r\n- The proposal is able to scale to address future challenge: YES. The proposer (if success) will be a good foundation for projects in future.", "q0r": 5, "q1": "I agree the proposal is likely to be successfully implemented due to following points:\r\n- The proposal provides evidence of relevant skills and experience needed to implement the proposal: YES. They provide website running about connecting African Developers and Entrepreneurs to the Cardano Ecosystem and Distributed Ledger Technologies and twitter of one of proposers. I clicked to see his work which was mentioned in the proposal: three successful community events, two in Northern Ghana and one in Kumasi. I recommend the proposers add more details about those success in the proposal because I belive that would be the most power evidence of the proposers' experience to implement this proposal.\r\n- The budget is outlined clearly and broken down into identifiable items: YES. The split fund is very detailed an be reasonable to achieve the set goals.\r\n- The proposal offers a realistic timetable to complete the work: YES\r\n- The proposal provides a sensible and conductible plan: YES, not only clear understandable what being done but also how.\r\n- The resources necessary to implement the proposal: the proposers do not state this clearly but YES, we can see in project activities and in budget broken down list, however, I recommend the proposers should add more details about the resource persons, because their role is very important to the success of the proposal. Details of them will raise the trust in readers (CA, vCA, voters).\r\n- Type and number of team members: YES but not clear. I would commend the proposers should provide more details about team members'roles in the proposal.\r\n- The proposers consider challenges and risks relevant to the successful implementation: YES and very clear.", "q1r": 5, "q2": "Roadmap with milestone and time horizon for achievement: YES\r\n- Metrics/KPIs that define the success of the proposal: YES, very clear and easy to audit.\r\n- Clear understandable description of the targeted problem and clear understandable solution that addresses the problem: YES.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "As the goal of the challenge is to educate students in Ghana about Cardano, the proposal fits into the challenge settings. Successfully executing the proposal would get more people informed about Cardano and would help to get more people to join the community. This would bring so much fortune and benefits to Cardano.", "q0r": 5, "q1": "From the \"relevant experience\" section, the team consist of skilled personnel in diverse fields and especially the team also consist of active Cardano community practitioners. However, the team is still vague because the number of teams members are not known. \r\nI appreciate the fact that the proposal contains a video and relevant links of previous activity sessions. The budget is well presented. The team also outlined the risks and challenges involved in implementing the proposal and for me is good.", "q1r": 4, "q2": "Yes, the proposal has outlined the roadmap, milestones and time horizon for the achievement of the proposal. Metrics that define the success of the proposal are also stated and I appreciate that.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Great proposal. This would be very impactful for people in Northern Ghana if it gets funded. I like the specificity to educating 2000 students in northern Ghana. The targeted group is essential for the future as well.", "q0r": 5, "q1": "There is a great team with experienced and well-resourced individuals to deliver this project successfully. The road map and outcomes are clear and would be easy to determine success as well. The team has past experience in delivering informative events, therefore, I think the community should vote for this proposal.", "q1r": 5, "q2": "Great budget breakdown. This makes it easy to audit and track deliverables in the project. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Reaching out to students is a very good idea and a way to reach out to the nation faster because students are representatives of families and villages. Your introductory video is satisfactory just that I expected to see a more comprehensive timetable stating when of the activity, mentioning the institutions you intend to visit, and the expected numbers.", "q0r": 4, "q1": "Great team with support from WADA. I sought to see a video of one of your activities since it has been in operation for a while. Also, the growth per month of your membership could have enriched the proposal.", "q1r": 4, "q2": "the growth rate and other KPIs are good for the audit but would have been better if the timetable against major milestones is provided. in this a timetable of the weekly programs and the topics to be discussed etc. \r\n\r\n", "q2r": 4, "assessor": "z_assessor_728", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Providing education to students about cardano and its benefits is an excellent idea. This will be helpful in creating awareness and also increase the cardano community in Ghana. Therefore, as far as this proposal seeks to expand the cardano user base, I agree that the project will address the challenge. ", "q0r": 5, "q1": "The experience of the WADA in the Cardano community cannot be overestimated hence their track record makes them the ideal team for this project. More importantly, the target audience is well captured and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in the north of Ghana and also increase the number of ADA holders. Additional, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully", "q1r": 5, "q2": "The project provides a metric to monitor and track the progress and success of the project. For instance, the project intends to develop a database to capture the details of students who will be attending conferences, capture those who will remain active proposers and those who will successful create a cardano native wallet. ", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The Challenge of onboarding, integrating new people and increasing participation have been addressed.  The proposal aims to educate about 2,000 tertiary and high school students in northern Ghana through conferences and workshop on Cardano and its benefits.  The proposal is well written and easy to understand by the voters.  This feels like  a good use of Treasury funds.", "q0r": 5, "q1": "This proposal is very likely to succeed as its backed by a highly experienced team. in addition, evidence of successfully holding similar events in the past has been provided. The proposal does not mention what the roles of the team members are and how the funds been allocated. This information would have elevated the proposal. \r\nThe cost seems excessive for a project of 3 months.  Also the price of $4,500 for t-shirts also seems excessive, having worked in merchandising with the Far East for 30+ years, $4,500 can buy you lots of stuff.  The proposer should be clear on how many t-shirts they will get.", "q1r": 3, "q2": "The metrics and success criteria are clear but some should be made more specific eg. Percentage of students that become active CAs.  A more specific metric would be for 1,000 students a 10%(?) conversion to CAs.\r\nKudos to the proposer for highlighting the risk of Covid by delivering online.  However, for completeness more information should be provided on what happens to the unused funds of around $15,000 that has been allocated for Transportation, feeding, accommodation of Resource persons, refreshments, conference space in this scenario.", "q2r": 4, "assessor": "z_assessor_774", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This is one of the better proposals I have come across so far. The proposer clearly states his vision, Road Map, challenges, Evaluation plan, budget break down etc. This proposal meets the requirements of the challenge and will most likely benefit the Cardano/Catalyst Ecosystem. After doing some research from the links he provided, I can see the proposer really has a passion for this.", "q0r": 5, "q1": "I believe the proposer will be successful as he has already done events on blockchain technology and Cardano, he has also provided a twitter handle to show his events. The budget is broken down nicely and seems achievable to reach the set goals. He has a detailed implementation plan, road map and evaluation plan. He discusses challenges that might come up and possible solutions. It is clear to me that the proposer has a clear vision and knows that there might be challenges. ", "q1r": 4, "q2": "The Proposer has provided a road map and timeline. I am not sure how the progress of the project could be followed by the Cardano community, as nothing is mentioned. There is how ever key metric that will clearly be able to show if the project is successful should it be made available either on twitter, a website etc. Somewhere where the Catalyst community can follow it. This is the only reason I am rating it 3 is because I am not sure how the community will be able to follow progress.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is alignment with the goals and objectives within the campaigh. The idea aims to basically proffer an holistic awareness approach of hosting events to educate, enlighten and engage targeted audience inGhana i.e. University students. This proposal has the potential to onboard increased numbers of new members and motivate active engagements in the project catalyst process. ", "q0r": 5, "q1": "The team has been involved in similar task and activities and with the level of collaborations with WADA and others, it seem very likely for the project to be successfully implemented.", "q1r": 5, "q2": "There is detailed information about measures to assess the success of this project and coupled with detailed plan and roadmaps on how to deploy resources, there is enough information to audit the propoal's success. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Organiser des événements communautaires pour informer environ 2 000 étudiants de l'enseignement supérieur et secondaire du nord du Ghana sur cardano et ses avantages.", "experience": "Wada : Constitué d'une équipe de personnel qualifié ayant une grande expérience du développement, de l'éducation, de praticiens actifs de la communauté Cardano, etc."}