{"id": 383180, "author": "quest.zwerg", "title": "#G4L Gaming Expo-Festival 2022 GSA", "url": "https://cardano.ideascale.com/a/dtd/383180-48088", "category": 26234, "amount": 15000, "description": "Nous souhaitons présenter le Cardano Catalyst Gamers On-Chained Challenge à la communauté européenne des jeux indépendants et aux consommateurs en 2022.", "funded": 0, "upvotes": 18699852, "downvotes": 16370113, "votes_result": 2329739, "votes_cast": 220, "f6_no_assessments": 6, "f6_rating": 2.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Je suis un fervent partisan de l'adoption massive de Cardano par le biais des jeux, mais malheureusement, en raison de la façon dont cette proposition est structurée, elle devient rapidement confuse pour ceux qui partagent un intérêt limité pour les jeux et pour les AC généralistes, ce qui peut être préjudiciable pour cette proposition. Dès le départ, l'énoncé du problème n'est pas un énoncé de problème, ce qui donne déjà un ton négatif. Il y a de nombreuses mentions concernant les retombées de cet événement, la diffusion en direct de l'événement, l'utilisation d'une agence de marketing de performance, d'une équipe d'engagement communautaire, d'un partenariat avec des médias réputés, etc. Il n'y a pas d'objectif clair de la part du proposant lui-même sur ce que son implication dans cet événement se traduira, par exemple, la couverture médiatique, les mentions dans les médias, les visiteurs prévus sur le stand, la conversion des prospects, l'engagement dans les médias sociaux, etc. et comment tout cela pourrait être lié aux objectifs du défi. J'aurais aimé vous aider à formuler cette proposition et j'aurais souhaité en avoir connaissance plus tôt, mais malheureusement je ne peux pas justifier mon parti pris personnel pour donner une note supérieure à 3 étoiles. Une note de 3 étoiles peut sembler élevée, mais d'après mon expérience personnelle, faire partie d'une grande exposition peut augmenter fortement la notoriété d'une marque, dans ce cas la marque Cardano's Gaming Ecosystem, mais vous aurez besoin de beaucoup d'outils d'engagement pour y parvenir. Nous vous recommandons de consulter l'école Catalyst pour savoir comment formuler une proposition percutante la prochaine fois.", "q0r": 3, "q1": "D'après les brèves données fournies par le proposant sur son expérience et ses références, et sachant qui il est avant, il ne fait aucun doute qu'il peut développer un jeu. Cela ne correspond peut-être pas à ce qu'ils proposent maintenant, à savoir organiser un événement dans une grande exposition. Il n'y a aucune mention de qui s'occupera des opérations du stand. Il n'y a pas non plus de plan clair sur ce qui se passera pendant la durée du stand, quel est leur plan d'engagement, quels matériels de marketing seront utilisés pour présenter l'écosystème de jeu Cardano, qui couvrira les coûts de l'engagement et du plan de marketing, etc. Bien qu'il y ait une mention du budget nécessaire, les détails de l'utilisation de ce budget, pour une raison quelconque, sont placés dans la section des commentaires. D'après les chiffres disponibles, la majorité du budget est consacrée à la production du stand. Malheureusement, il n'y a pas de calendrier précis pour le début de l'exécution des tâches, par exemple, en commençant par les actions les plus simples comme l'impression du matériel de marketing.", "q1r": 2, "q2": "Si elle est présentée hors contexte, et si elle se concentre sur l'utilisation du budget pour la production du stand, cette proposition est hautement auditable, mais ce défi a des objectifs qui doivent être respectés et, dans le meilleur des cas, il est généralement très difficile d'auditer une participation à une exposition. Et encore moins dans le cas où il n'y a pas de plan d'action clair pendant la durée de la participation. Ce problème peut toutefois être évité à l'avenir en se coordonnant avec l'école Catalyst sur la manière de formuler une proposition. En commençant par l'énoncé du problème et la solution, ce qui manque également à cette proposition. J'aime tellement cette proposition que je vous invite à réessayer.", "q2r": 2, "assessor": "z_assessor_635", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The idea of hosting a Cardano specific stand at a Gaming event is a really good idea. This proposal is however is quite confusing on what it is trying to achieve and how its going to achieve it. An ask of $15k for this proposal doesnt feel like goo value for money. I would have expected a lot more background work to be done at this stage with only 2 months to go  (eg engage all gaming related projects from previous funds, have more details of how the proposers see exhibition flowing over the 3 days). Having exhibited in many international venues around the globe it is essential each day is planned in detail with objectives and targets otherwise the days go by very quickly and nothing is achieved.\r\nAs it stands if this proposal was asking for $1 or $2k (to cover cost of exhibiting with some incidental costs. It could then act as a pilot exhibition & proposers could then come back in a future fund with 'proof' and arrange a much larger event.", "q0r": 3, "q1": "The proposal provides a decent outline of a plan but it is not easy to understand.\r\nA simple presentation would have helped showing how activities, resources and funds  are aligned.\r\nThe $15k is not broken down so it is impossible to work out how its going to be spent.\r\nThe proposers could really help themselves by adding their LinkedIn profiles or evidence of their experience in this area.\r\n\r\ni hope the proposer takes onboard these comments in a positive light and returns with a more coherent proposal or uses the comments section or ideafest to provide clarity on the questions answered. ", "q1r": 2, "q2": "No metrics or KPI's have been provided that align to the challenge. eg is the proposer looking to encourage new gaming proposers in future funds?\r\nAlso the obvious risk of COVID has not been taken in to account, what is the mitigation (if any) and what will happen to unwed funds if the exhibition is cancelled?", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely that a lot of Gaming tradeshows are out there, BUT not even one is promoted by Cardano\r\n. \r\nIt is clear that this proposal falls within the scope of the challenge brief by   presenting the Cardano Catalyst Gamers On-Chained Challenge to the European Indie Games Community and Consumers in 2022\r\n \r\nThis proposal shows how it adds value to the Cardano system byproviding exposure of the Cardano based games to the overall gaming community and exposing the Cardano game developers to a real game expo environment where they could network and collaborate and make useful connections.\r\n\r\n \r\n  Key metrics  would be  number of participants,  number of events, number of stalls, number of games presented, number of new developers represented.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n  \r\n \r\nProposal can be scaled up to address future challenges by adding more game development companies to this event.  it could also setup facilities at other events for more Cardano game developers \r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between game developers, game reselling companies and brands and the overall gaming community\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 5, "q1": "\r\n \r\nThe proposers  has not provided ample evidence  of themselves with their skills and experience in gaminr or organizing similar events. His name is given but no profile links on FB IG or Linkedin are given. There is a link to the event website but there is no way to link that to the proposer nor to see whether its a comprehensively planned event\r\n \r\n \r\n The links are not sufficient. \r\n \r\nI have   emailed the relevant people but not received a response as yet.\r\n   \r\nIt is hard to say if the proposers are  experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is not stated.\r\n \r\n \r\nThe team structure is not listed  .\r\n\r\n The budget has not been given in detail. \r\n \r\nThe budget is not reasonable to achieve the set goals. I am not sure if the 15000 is to rent some stalls or for organizing an entire convention.  \r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres no realistic timetable  to complete the work\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are not described.   \r\n  \r\nThe proposal has technical aspects which have not been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is not detailed and budget cannot be assessed hence I have given it a 2 star rating.   \r\n\r\n\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n", "q1r": 2, "q2": " \r\nThere is no clearly laid out roadmap with milestones  \r\n  \r\n There are  Metrics such of number of participants a and number of events and discussion rooms. \r\n  \r\n \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n   \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n  \r\nThere are no contingency plans in place for various outcomes.\r\n\r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  2 star rating.\r\n ", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This is a large community which is largely untapped and ready to be introduced to cardano. I think it would gain a lot of interest among the gaming community. \r\nHowever the proposal has to increase the way in which Cardano is pushed to the forefront and actually marketed to the public.", "q0r": 4, "q1": "The proposer seems to have a good understanding of the field and has done sufficient research into what is required. I think it is important for the proposer to have good networking skills as this relies on the relationships made.", "q1r": 4, "q2": "There is no real success criteria for this project. It would be better if the proposer provided some metric that can be used to quantify the success and allow for an agile workflow.", "q2r": 2, "assessor": "z_assessor_525", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is related to the organization of the event to introduce the Gamers On-Chained Challenge to the EU Game community in 2022.\r\nThe problem statement raised is quite convincing and suitable for the Challenge. If possible, the proposer should be more explicit with some compelling arguments/evidence.\r\nThe proposed solution does not really represent the solution, rather, it is presenting more of the problem statement. The proposer should consider rewriting this passage, for better understanding. However, the solution is described clearly in detail and has a certain impact.\r\nTherefore, I  can agree with this proposal's impact and give a score of 4.", "q0r": 4, "q1": "Team's skill, experiences is suitable for implementation of this proposal but withour any reference / proof (documents / links,...) for varifying; it is hard to verify team's ability through the provided link (because it is written in German, I guess). There is a lack of similar activities/achievement/ demo / pilot that is relevant. Only the total budget is provided. Risk/ challenge is not provided.  However, the event's program is provided in detail and show logical.\r\nTherefore, I am neutral with this proposal's feasibility, I rate 3 points.", "q1r": 3, "q2": "The team's information has not been described in full and in detail; Also, did not provide relevant external links for verification. So the proposer needs to provide enough information about the proposer and the expected implementation team to make the proposal more transparent.\r\nInformation and presentation of Roadmap/Timeline, expected Budget are not clear, making it difficult for the community to monitor. The proposer needs to clearly state the expected activities along with the corresponding KPIs/metrics, detailed estimated budget (Ex: What is the estimated budget for each item mentioned in the \"program\" ? or What is the basis for calculating the expected budget?.... )\r\n\r\nTherefore, I disagree with this proposal's auditability and give a score of 2.", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal for #G4L Gaming Expo-Festival is being proposed by the host of the Cardano Convo Podcast who has produced a number of podcasts that highlight projects and initiatives being built in Cardano. The proposal is all about promoting Cardano to the billions of gamers and developers in the world who are looking for an in-road into crypto. In this way it would add value to the Cardano Ecosystem by driving new community members that are interested in bringing game development and games to Cardano and raise awareness about project Catalyst. The proposal is to support the cost of installing a physical booth within a tradeshowin Messe Dusseldorf that would promote Cardano to other booth holders and visitors, could be an interesting model to use to scale or transfer into other tradeshows. ", "q0r": 5, "q1": "The team behind this has 20+ years experience in gaming business, runs a successful podcast and is skilled in marketing. In this way they are well positioned to tackle a trade show of this nature and on-board new participants. The timeframe is clear, budget is not clearly marked out however there is further information about where exactly the funds will go further down in the comments. ", "q1r": 4, "q2": "The event will be streamed so community can audit the project progress that way, there are no specified targets or KPI's set, which could be addressed through setting an acheivable target for # of new game developers integrating cardano into their game. The timeframe is clear as there's a physical event deadline. ", "q2r": 3, "assessor": "z_assessor_699", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Il existe de nombreux salons de jeux, MAIS aucun n'est promu par Cardano ! Ce serait donc un bon début, du moins en Europe.", "experience": "Marcin : 20 ans d'expérience dans le secteur des jeux, notamment en Europe (GSA).\nConward : Animateur du podcast Cardano Convo et expert en marketing."}