{"id": 383300, "author": "demingfactor", "title": "Add a calender for community events", "url": "https://cardano.ideascale.com/a/dtd/383300-48088", "category": 26234, "amount": 6900, "description": "Il peut être difficile de se tenir au courant de tous les événements qui se déroulent au sein de la communauté et de savoir également quels sont les événements à venir.", "funded": 1, "upvotes": 53634002, "downvotes": 4361612, "votes_result": 49272390, "votes_cast": 354, "f6_no_assessments": 11, "f6_rating": 4.393939393939394, "videos": [], "media": [], "f6_assessments": [{"q0": "A community calender could be an amazing thing to keep up to date for everything that happens on cardano. If its accessable for everyone this would be amazing. It states exactly how this would benefit the community on many ways.", "q0r": 5, "q1": "The proposer already is a founder of a Studio and brings 10+ yrs experience as a coder with him. A linkedin profile to verify the experience would have been great. The proposal is really well structured and contains all the necessary parts like a roadmap and a budget. In my opinion it is likely that it will be successfull.", "q1r": 5, "q2": "The proposal is well structured and really easy to assess. Since it added a definition of success it will also be easy to check the progress of it.", "q2r": 5, "assessor": "z_assessor_41", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This idea comes perhaps at the perfect timing. Numerous community driven projects have popped up from the fund series and are all seeking to grain traction as part of their KPI's. Having a well designed hub that informs on all the funded projects and not the excel format that the Project Catalyst is currently using will definitely make tracking and navigating the ecosystem easier. Though it does not directly effects metrics such as; increase proposal submission, CA onboarding or voter participation, it does potentially provide easier access to community events which correlates to the metrics above and will eventually lead to the intended initial metrics. The hub if well designed will definitely scale.", "q0r": 4, "q1": "Although there is some relevant experience provided, after Googling the entity founded, there is no further detailed information on the proposer. Though from the plan presented, it does show the proposer has some form of experience in project management. The plan proposed is detailed and adhering to the checklist standards with clear milestones and a sufficient budget request. Having some form of further verification, such as a portfolio, would further instill confidence towards the proposer in delivering the contents of their proposal. There is a risk and challenge factor that has not been assessed by the proposer, such as the possibility the general community might feel the existing channels suffice and adding another layer of navigation just complicates things. With that said, perhaps a strong UI/UX and proactive communications with the larger community might be the determining factor in the success of this proposal.", "q1r": 3, "q2": "There are clear metrics, roadmaps and milestones but very limited numerical KPI's intended to achieve. With that said, this proposal is auditable but having limited KPI's does somewhat make it challenging to responsibly audit. Problem statement and solution though was excellent, catches attention instantly and would most likely perform well in the voter app.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 18, "ne": 7, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This is a proposal to create a website that specializes in providing information about online and offline events related to cardano-based blockchain technology. I see a lot of events in our community in the near future, so this is an essential tool to make it easier for the community to know what's happening and how to get involved.", "q0r": 5, "q1": "Technically the implementation is not too complicated, the plan is quite clear KPI. But the proponent needs to have a strategy to promote to the community how people know to enter the website to give event information instead of the website administration doing it themselves. But that only solves the problem of the scale of this project.", "q1r": 4, "q2": "When the website is completed, we can easily check the number of events organized with specific content and schedule. And it is also quite easy to know the number of visits from the community, to draw conclusions about the effectiveness of this event information website.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": " If this doesn't exist yet, this might be one of the best ideas of all proposals. Simple yet important and so handy. It ensures that even more people will attend the local events. As the proposer points out, it will increase active participation in the community. I'm also a big fan of the tags idea.", "q0r": 5, "q1": "I see no dangers or obstacles within this project, for a proposer with this experience making a calendar is a little job. The training that comes with it also seems very feasible to me. The only thing I have questions about is the user-friendliness because the tool will have a training event and manual, will it be such a difficult calendar to use?", "q1r": 5, "q2": "The roadmap is well developed, it is transparent which process the proposal will go through. Measuring success based on numbers and statistics, here are further goals set. You might already be able to estimate the number of unique visitors to measure your success.", "q2r": 4, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "A great proposal that aligns with the challenge, of such solid solution as the introduction that brings impact and value to the community. That being said, the proposer also mentioned the guiding questions of the challenge and how they are addressing it. With this convenience, I truly believe this will improve the community participation and simplify the problems raised before. Though the proposer can further explain about the platform (calendar site) which can bring a deeper understanding and visualisation for voters to comprehend. I am giving this a rating of 5, as I see positive impact and benefits for the Cardano community.", "q0r": 5, "q1": "The proposer claims to have necessary experience to develop the platform, but it would be great to have further references such as LinkedIn links or what they have successfully created. This is essential to bring confidence for voters. The budget required seems reasonable and allocated clearly. What can be added is marketing outreach of this platform that allows participation of users. The proposers claims for an open-invitation for tis workshop and this can further be described on how it will be done through the community. ", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. There are also several metrics that measure the success of this project. This will definitely be a good indicator for its auditability. Moreover, the proposer should mention possible difficulties and how to deal with them. The quality of the proposal suggests that the proposer is aware of the challenges, but it is easier for outsiders to understand if a statement is made.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 14, "ne": 4, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Having a central calendar of Cardano events would be useful and a valuable addition to the community. The development of this tool would increase the number of people actively participating in Cardano events and increase access to Cardano by making it easier to find places and ways to engage with Cardano Ecosystem globally. \r\n\r\nDepending on the technology developed through this there is potential for this idea to scale and support other projects and groups through the use of the technology.", "q0r": 4, "q1": "The project team have described their skills and aptitude however do not have previous experience in delivery a project of this specific design. They have articulated ways that they will engage the community in the development and execution of the design so it's clear that the proposal will meet the objectives of this fund and has ways for the community to value-add to the project throughout the timeframe. \r\n\r\nThe budget is clear and fair with most of the money directed towards paying skilled professionals for their time and some allocation to infrastructure costs. The team are hoping to have an initial site live after three months and contributions of 6 events or more added to the site. The milestones in the timeframe are achievable and one would hope that with increased engagement from the community in the development of the platform it would lead to successful uptake in the community. ", "q1r": 4, "q2": "The project has a website that the community can audit progress on the project. The KPI's are clear and measurable and timestamped to ensure succesful delivery of the project in accordance with delivery dates.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a good idea. It is actually attempting to solve the problem in the \"problem statement\". \r\nAdding a calendar for Cardano community events is going to keep people informed about the community's events and that for me will make a positive mark for the community.", "q0r": 5, "q1": "The proposal from the \"relevant experience\" statement shows that the proposer is an experienced decoder. However, links and videos should have been attached as evidence. I can't see a team the proposer would be working with. The budget  is clearly stated and also broken down into identifiable items and that for me is good. However, the proposer has not included possible risks involved in the implementation of the proposal.", "q1r": 4, "q2": "This proposal has clearly indicated milestones, roadmap and time horizon for the achievement of the proposal. However it would have been good the proposer added the risks and challenges that would arise from the execution of the proposal. It's good that the proposal has included the metrics that define the success of the proposal.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Great proposal. I like the motivation behind the idea. This would be great for marketing events among the Catalyst community and new members as well. The open-source component is fantastic and makes room for further improvement on feedbacks.", "q0r": 5, "q1": "The team has immense experience to deliver the proposal successfully. The idea falls within their domain. The road map is practical and realistic. \r\n\r\nI think it would be great to have the calendar developed to help schedule events for participants at ease. \r\n\r\nThe deliverables and definition of success are measurable outcomes. I would be glad if the team include strategic marketing to help the usage of the calendar when developed. The proposal is feasible.", "q1r": 5, "q2": "The budget breakdown is great though I am not seeing any allocation for marketing. That said, the proposal is open and include open-source development which would enable easy tracking. Also, the breakdown of the budget would be helpful for auditing. This proposal should be voted. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposer has provided a clear and concise description of the problem solved in the challenge. I believe it would be beneficial to have this project come to life. This project will most definitely have a positive impact on the Cardano/Catalyst Ecosystem. All aspects of the challenge are addressed in this proposal and explained. I would love to see this project get funded.", "q0r": 5, "q1": "It does look like the proposer has the skill set to be able to bring the project to life, but no links have been provided as proof of his experience or skill set. There is mention of a team but their experience are not provided, or a break down of how many in the team and what their roles will be. There is mention of a Developer, Lead Developer and Designer in the budget, but no names or links on their skills and experience. The budget is broken down to demonstrate the basic flow of funds. It would have been nice to see an example of what a typical Calendar would look like and presented as. Milestones and metrics are provided. The proposer does seem to have a good idea of what he wants to achieve. All that is needed is maybe some links and attachments around skill set, experience and examples.", "q1r": 3, "q2": "The key Metrics have been provided and seems sufficient. I would like to see mention of how the community and voters can access and track these metrics as it is important. ", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "In order to increase participation with Catalyst and community events, having a place to go to for tracking upcoming events would be a great idea. That is exactly what this proposal addresses, in having a site with a calendar that uses open-source resources and the community to maintain an updated schedule of events.\r\nFeedback comments on advice of improving the proposal was taken well and acted on by the proposer.", "q0r": 5, "q1": "The web development experience shared by the proposer is fitting for the plan. As for the plan proposed, the structure is indicative of a clear understanding of how to achieve the goal of a calendar event tool. This is broken down into 3-month structure, per month.\r\nEven with a low budget, the structure of that is greatly explained in detail. This proposal is a needed item in the community. It is better than the alternative of hoping you are following the right people and paying attention at the righ time.", "q1r": 5, "q2": "The metrics outlined are perfect for the plan. Number of visitors, number of events listed, and number of hosts. It should be easy for viewers to track most of the information.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree this proposal addresses the challenge since the Catalyst project and Cardano is working internationally. Users now can reach out to events via social media platform like Twitter, Telegram, Discord or the Cardano Forum, but the fact is that people have to check on each and every notifications (important or not) to make sure if it is the event like want to engage/ participate and when. Yet, the time zone is inconvenient for many members internationally since they have to convert it to local time and set alarm after that. This proposal bring up a simple idea but really is practical and helpful for the community events and engagement. Therefore, I rate for its impact the highest score of 5.", "q0r": 5, "q1": "Reading the detailed plan of this proposal makes me feel it's just a plan since I don't see the proposers mention to draw on any open source yet? Additionally, as the budget is allocated for many people but I can't find the team, or I guess the team hasn't been formed. Because the idea of this proposal has high impact, I suggest the proposer to spend more time working on it. ", "q1r": 3, "q2": "Key metrics and KPIs of this proposal remain incomplete, so I advice the proposer to fill them. After fixing the detailed plan, I suggest the proposer to specify more about roadmap and its milestones as well.", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Développez un calendrier pour la communauté, un calendrier facile à ajouter et facile à inscrire et à consulter.", "experience": "Fondateur de Digital Media Design Studio (10+ ans d'expérience en tant que codeur)\nConception de médias et sciences informatiques\nDéveloppeur Web expérimenté (ruby, rails, js)"}