{"id": 384031, "author": "felixweber", "title": "NFT Guild", "url": "https://cardano.ideascale.com/a/dtd/384031-48088", "category": 26234, "amount": 10000, "description": "Il y a une friction entre l'espace CNFT et le projet Catalyst. Un manque de communication et de collaborations nous oblige à construire des silos.", "funded": 2, "upvotes": 58951882, "downvotes": 9227148, "votes_result": 49724734, "votes_cast": 332, "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition aura un impact sur Catalyst en créant une source de financement pour un public qui se dit en grande partie \" wen moon ? \".  Là où elle pourrait briller dans l'ensemble de l'écosystème Cardano, c'est en encourageant l'échange d'idées avec des projets NFT très engagés pour nous faire passer de \" wen moon ? \" à \" je ne savais pas que l'on pouvait faire CELA avec un NFT !  Catalyst a le potentiel pour être LA force qui fait passer les NFT à un niveau supérieur d'innovation pour les créateurs et les participants au marché.  Une idée sur les projets NFT spécifiques, qu'ils soient déjà natifs de Cardano ou qu'ils cherchent à passer d'une autre plateforme, leurs besoins et leurs frustrations avec les outils existants, serait une mesure utile pour évaluer la pertinence de cette proposition pour le problème tel qu'il est énoncé.  Mais en tant que simple passerelle pour engager la conversation, c'est un excellent début en l'état.", "q0r": 5, "q1": "L'équipe de proposition est un groupe bien connu d'ambassadeurs, de constructeurs et de contributeurs à la communauté Catalyst.  Ils ont été financés à plusieurs reprises par Catalyst, et ont démontré à chaque fois les meilleures qualités et les intérêts de la communauté.  L'organisation d'Idea Fest, qui a remporté un franc succès auprès des proposants, est un bon indicateur de leur capacité à faire émerger de nouvelles idées au sein de la communauté NFT, en particulier en réutilisant et en adaptant les formats et outils existants.  La proposition n'indiquait pas s'ils avaient une connaissance particulière des forces et du caractère unique du potentiel NFT de Cardano, mais cela ne devrait pas être nécessaire pour organiser avec succès les réunions entre ceux qui ont cette compréhension et ceux qui sont curieux du potentiel CNFT, et la capacité de Catalyst à trier les idées et à les faire décoller.  Le calendrier, étant donné qu'ils ont déjà des outils, des équipes et des formats disponibles est urgent sans être précipité, et le budget proposé est en ligne avec les propositions précédemment financées par cette équipe.  Le budget proposé est conforme aux propositions précédemment financées par cette équipe. Les chances de succès sont donc élevées.", "q1r": 5, "q2": "Il s'agit d'une proposition simplement vérifiée, car son produit sera un flux constant de contenu accessible au public qui commencera à être disponible presque immédiatement en février.  Les mises à jour prévues jusqu'au premier événement ne sont pas mentionnées, mais ce groupe maintient une présence constante dans les médias de Catalyst, et ils nous ont tenus au courant de tous leurs autres projets jusqu'à présent, et sont toujours disponibles et prêts à répondre aux questions sur leurs projets et leurs progrès.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This idea is necessary for inspiring the development of NFT Creators community, which also boosts the development of NFT project in the Cardano ecosystem. In the proposal, the team also mentions the tied relationship between NFT ecosystem and project Catalyst, and that info proves that this event will improve the collaboration between them. Therefore, it strongly impacts on Cardano ecosystem. \r\nThis project also has KPIs & OKRs that will make a big impact on the ecosystem, and of course, align with the challenge givens ", "q0r": 5, "q1": "The leader of this project is well-known in the Catalyst community, he has well connected to CNFT community, and has experience in organizing events with Calalyst team. Moreover, the implementation plan in the proposal is clear for what the team wants to do, going with the clear roadmap for months. Therefore, this proposal absolutely gets high feasibility. \r\nThe budget is used for covering the whole roadmap and detailed in each activity category, all are reasonable. ", "q1r": 5, "q2": "The KPIs and roadmap are clear and detailed enough for auditing. The team also has a good acknowledgment about the current situation of the problem through their explanation. And they make a plan to solve it that is very close and lean. All of these info easy to understand for assessing their step to do and goal to get. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The idea is really fascinating which it adds value to NFT creators, collaborators and business through communication. It also improves the evolution of NFT(s) being only an asset of flippening or creating a mindset of \"get rich quick\". NFT(s) are more than just being that, and we have seen it grow into a more functional asset! This also includes that the community can innovate together to implement and venture extraordinary insights and experience between each other, which in turn not just adopting new users to the Cardano ecosystem but to plant an innovative signature as a routine in the NFT side of the ecosystem.", "q0r": 5, "q1": "The team members are not classified though the idea of the proposal resonated where it said \"Regarding the NFT Ecosystem, we see a lot of competition and run for the fast Money\". The evolution of NFT(s) is slowly starting to be a more functional and utilitarian asset, and this proposal would be a great way to improve the quality of creators, marketplaces and businesses. Besides NFT Guild YouTube channel, zoom calls and discord, will there be other online platform to increase awareness of the proposing subject? A more detailed metrics to what extent of number of participants can be achieved, potential collaborators and types of held events will be helpful to foresee the success of this proposal.", "q1r": 3, "q2": "Though I believe its the funding required is reasonable, and milestones given are achievable, it would be helpful if there are few important key points that could be listed. Firstly, how does the budget will be allocated for each biweekly events. Secondly, essential key points on how to have great outreach and marketing campaign with the budget given. Lastly, a list of potential of well established and experienced projects from the Catalyst ecosystem (to back the point of the proposal feasibility).", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is clear and the objectives of the proposal are clear in terms of how the NFT Guild would assist in building a stronger line of comunication between CNFT Space and Project Catalyst. However there is some key information missing such as the team behind this. The proposal could be strengthened through the inclusion of some suggested topics for discussion to open communication lines between the disparate groups even if it was done as an example for how the two ecosystems of CNFT and Catalyst could begin to open that conversation. ", "q0r": 4, "q1": "The proposer has indicated connection to however no specific commitment has come from established groups within the Cardano community such as Catalyst Swarm, Eastern Town Hall, Catalyst School, Ambassadors Guild and the Bridge Builders Guild. It's therefore unclear if this project seeks to leverage these already established initiatives to bring greater awarness about Cardano to the CNFT space - or indeed if it is about creating additional work that would lead to a greater understanding. The reporting mechanism within the monthly Catalyst Town Halls would likely mitigate or steer any project creep away from the intended mission. \r\n\r\n\r\nThere is a clear budget and timeline inlcuded in the proposal with a proposed amount of 500USD per event over a three month period. Given the scope of this project is lacking specificity it is hard to determine if this is an appropriate amount for the work and/or if this is split across the many initiatives that would contribute to the development?\r\n\r\n\r\n", "q1r": 4, "q2": "There are clear KPI's included in the project scope and community can audit the project through the monthly reporting feature as previously mentioned. Again - no specificity around the size of the market, the number of events that the project is seeking to hold and therefor what success looks like in terms of people engaged and number of events delivered, quality assessment of the discussions and potential onboarding of projects to the next Catalyst fund. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The goal of the proposal is within the challenge settings. However, I recommend goals and key metrics to have their own separate section in the proposal for easy identification. The proposal would promote Cardano when implemented since it seeks to remove the conflict between the CNFT space and Project Catalyst.", "q0r": 4, "q1": "I believe the team possess the skills and experience to execute the proposal considering the fact that they partook in earlier Project Catalyst and others. The budget is well presented. The plan of the proposal is detailed and reasonable enough to achieve the goal.\r\nHowever, possible risks/challenges involved in the implementation of the proposal are not outlined.", "q1r": 4, "q2": "The proposer has provided a plan, timeline and milestones for the achievement of the proposal. It is good that KPIs that define success the success of the proposal are outlined.\r\nFrom the problem statement section, the targeted problem is clearly described.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Great idea. The project seeks to build collaboration with others within the catalyst ecosystem. It would be great to establish at least one partnership with any collaborator, say Catalyst School, since it is stated within the proposal that, they would take the educating aspect.", "q0r": 3, "q1": "I think this is achievable however, other detail in the proposal is dependent on stakeholders with whom you have no established partnership. ", "q1r": 3, "q2": "The proposal involves documentation and recording that I believe is transparent and easily trackable. ", "q2r": 4, "assessor": "z_assessor_727", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal has a clear definition of its problem statement and it tends to proffer the solutions. The idea to foster a platform event to collaborate issues of concern as it relates to NFT community and Project Catalyst with aim to providing solutions to challenges and creating a common front and standards or values in the NFT community in Cardano Ecosystem. The proposal provides a collaborative process that is really in the NFT community.", "q0r": 5, "q1": "The proposal did not provide any information on the main team but its well detailed collaborative efforts  with other experienced, active and committed community members and events, it is very likely that that the proposal poised to be a success. Given the detailed budget and its deployments coupled with its comprehensive roadmaps, it is my opinion that the project is in the right hands.", "q1r": 4, "q2": "The proposal has provided enough metrics to assess the performance of the project in addition to the detailed roadmaps and plans to ensure their activities will be made easily accessible to the community to judge its progress.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}], "solution": "Organiser des événements communautaires en mettant l'accent sur les créateurs NFT et les Markeplaces où les idées peuvent trouver un lieu commun pour se rencontrer et se connecter avec Catalyst.", "experience": "Créateurs et fabricants d'outils NFT, SPOs, membres de la communauté CNFT bien connectés, proposants financés et conseillers de la communauté, ambassadeurs Cardano."}