{"id": 398069, "author": "zakiristesting", "title": "DemeterGift", "url": "https://cardano.ideascale.com/a/dtd/398069-48088", "category": 26443, "amount": 100000, "description": "There are still many challenges and problems that are being faced. In Africa there are more than 25 million people living with HIV.", "f6_no_assessments": 4, "f6_rating": 2.083333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 629, "q0": "It is not clear how this project comes into alignment with the challenge it has been presented in.  It suggests a DeFi platform based on the Harmony SDK which is an Ethereum ready blockchain where NFT minting and marketplace can be hosted.  The team has indicated they will be running an NFT auction marketplace in conjunction with Cardano.  We'll unpack some of that in feasibility.  The goal of this NFT auction will be to allow charities and donors to have a transparent process for tracking their donations to their intended beneficiaries, having access to fund matching protocols from general donations as well as providing documentation to help establish basis for things like tax incentives for donating.  However, the challenge setting revolves around building out decentralized identity, and the connection here isn't clear.  One tenuous thread would be the ability of a donor to track the receipt of an intended charitable contribution, but if NFTs are used, than DIDs would not be necessary:  the transaction is fully confirmed on-chain.  This proposal would benefit from considering the potential of operating the entire structure on Cardano where cNFTs are a low-fee native asset, as well as consider a challenge setting with better alignment.  The team has clearly identified a problem area in the charity/donor space, especially in Africa, but it is unclear how this proposal bridges the gap effectively.", "q0r": 3, "q1": "An issue hinted at in Impact should be discussed here, namely the choice to use Harmony ONE to develop this protocol rather than using the available, in built tools of Cardano, such as cNFTs or PRISM track and trace.  There is no mention in the proposal of the need for a Cardano bridge, which currently doesn't exist for Harmony, so this team may need to rethink how they are approaching this project.  There are also major issues with the budget, which at $100k represents a full fifth of the available challenge funds.  There is no budget breakdown provided, nor any roadmap for the deliverables, so we don't know how the money is to be applied to solve the problem.  It would be helpful to know what technologies they already have or feel they need to develop (Cardano bridge at the very least), as the Harmony solution they posit will not work in its current state, at least not in conjunction with Cardano.  The provided timeline doesn't seem accurate, either.  It proposes 3 development sprints totaling right around 7 weeks, with barely 3 weeks allowed for the backend, which would be an incredibly challenging pace.  Finally, while they have provided team member names, they have not provided any links to bios or work...it would be helpful to have some basic linkedin information, to at least put a face to a name.", "q1r": 3, "q2": "We have already mentioned the unrealistic time horizon, and there wasn't much in the way of a roadmap:  design and backend as deliverables plus a general fund for 'Other'.  Separating this out is necessary, into weekly beats with more details regarding what is delivered in design (UI?  UX?) and what specific steps are included in developing the tech.  They mention they have already added some things to the project and removed others that weren't needed...but what are they?  At this point there is no included contact data or places where they can be followed, and the linked website isn't functioning properly, so hopefully they will be able to get something up and running in time for voting.  Auditability really highlights that this project doesn't seem prepared to meet either its own needs or the needs of the charities and donors that it is hoping to represent.", "q2r": 2, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 2566, "q0": "The proposal is a humane idea, a practical contribution to charity funds for the society, and has a large impact on the world. Along with the problem of more than 25 million people living with HIV in Africa, the project's goal is to bring It does solve some of the problems charities face.\n\nThe proposal has given many problems and solutions for each specific problem. The project is based on the DemeterGift platform, to create auctions, and to help charities raise money from donors and increase support from the Community. On the other hand, it also creates a transparent process that allows organizations like Government and Pharmaceuticals to double the amount you donate. Also In many countries, You can make tax-deductible contributions, which will help make the process transparent and automated.\n\nThe proponent introduces many risks, and there are solutions to those risks. Thanks to the DemeterGift platform that harnesses the power of the Cardano and Harmony infrastructure to create NFT auctions on the blockchain with ease, attraction, and transparency. The biggest goal is to help charities raise money from benefactors, donors and increase support from the community. Thank you for choosing a humanistic and meaningful project. This is great!", "q0r": 5, "q1": "The project has a timeline, but it will be more convincing if the Group explains the goals in more detail.\nThe budget is $100K which is 20% of the budget for the challenge. However, in the project, I have not found an explanation of how to use the budget, and where to allocate it. I think the Team needs to be more specific about this part of the budget.\nThe Project does provide a list of teams but does not see updated personal information, experience, or specific assignments. It's hard to figure out the list you gave. It will be more complete if you provide all relevant personnel information so that we who evaluate and read the proposal have a more objective view.", "q1r": 2, "q2": "In this section, there was no proposal to give specific metrics. The scheme mentioned the old version that implemented this project. Now in this new version, they have integrated new things. and remove some unnecessary things. To make the information clear and transparent, we hope that the team will provide enough information related to salary measurement and specific quantity. At the same time, update more information about the integration. new and removed something unnecessary for this project.\n\nSuccessful challenge confirmed. Proven successful donation with two major markets, is USD 470 billion in 2020 and USD 40 billion in digital NFT in 2021, With the DemeterGift platform, and passionate team with enough experience and knowledge, and a passion for helping the society, I believe they can help the community achieve the Sustainable Development Goals.\n\nThis is a completely new proposal, with a team full of enthusiasm, great love, towards helping the community and society, especially solving problems for the World charity. I feel this is a humane project, which is being supported and energized to develop together. Hope this project is considered for funding!", "q2r": 4, "assessor": "z_assessor_1534", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7146, "q0": "Unfortunately, the proposer did not provide any details that would be sufficient to assess the impact. The sentences are repeated across the proposal, are superficial, and lack deeper clarification. As a reader, we have learned almost nothing, except that a goal is to build something to help charities. Another factor is that DID is not mentioned even once, so there is almost nothing to build on. \n\nThe proposal did not discuss nor reflect any of the impact scoring criteria. (problem within the challenge related to DID, clarity of bringing value, key metrics, or scaling in the future.)\n\nTo sum it up, the proposal is lacking a lot of important information. ", "q0r": 1, "q1": "The proposer did not provide any relevant information sufficient for a positive score - no identity links, proofs of previous works, experience, or skill. The technical aspects of the proposals are not present, there is no roadmap nor vision, only a superficial time schedule, but we do not know who will perform these tasks, what are subtasks, and so forth. There is no information that would create trust and confidence in proposers. \n\nThe team is introduced by names, which in this form and detail is equal to being anonymous. ", "q1r": 1, "q2": "there is no detail about auditability of the proposal, no key metrics, roadmap, and it even seems that proposers did not pay attention to proposer guidelines. \nThe proposal is lacking too much essential information. ", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8264, "q0": "Unfortunately, this proposal does not address the challenge. The team is proposing to create an easy, transparent, and fun NFT charity auction site, however, there is no linkage made to decentralized identity. Rather, the team discusses the need of a revised charity fundraising approach due to the problems facing the existing system. \n\nI want to encourage the proposers to continue with this effort but would suggest either identifying a challenge setting which is more aligned with the overall goal, or making it very explicit how the proposal fits into the challenge. ", "q0r": 1, "q1": "No, given the experience and plan presented it is unlikely this proposal will be implemented successfully. Again, the team does not adequately identify what they are planning to do or the steps that would be required to achieve it. As written, there is no real information for what voters can expect. I read the document which they include in the feasibility section but it is also sparse and provides no specifics. The team also only lists their names without any sort of credentials, this is an important component that showcases the ability of the team to deliver. ", "q1r": 1, "q2": "No, the information provided is insufficient to audit the progress and the success of the proposal. There are no success measurements or indicators to track progress. As there is no plan provided, there is not an adequate way to know when and how the team will proceed, which does not allow for auditing to occur. \n\nI would encourage the team to do a better job at building their plan and ensuring that any measurements or indicators are clearly articulated. ", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "DemeterGift creates the most easy, transparent and fun NFT charity auction on Web3, by helping charities raise additional support!", "experience": "As a team we want to do something for the world, especially for SDG 3 and 5. During the interview with Yvette Rafael from APHA South Africa, we found out several difficulties for charity organizations:"}