{"id": 398547, "author": "danbonfil", "title": "DID Community Course", "url": "https://cardano.ideascale.com/a/dtd/398547-48088", "category": 26443, "amount": 15000, "description": "Vocabulary and applications of DIDs to everyday life can be difficult to grasp, this could hamper the speed of its acceptance and adoption", "funded": 0, "upvotes": 17490087, "downvotes": 10028117, "votes_result": 7461970, "votes_cast": 82, "f6_no_assessments": 5, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 648, "q0": "This sounds like they want to make a multilingual version of the AtalaPRISM Pioneers course in GitBook format, which would be an awesome resource for the community.  The differences would be to bring terminology to the forefront instead of as an addendum to the coding protocols, to succinctly deliver the clarifications on things like trust registries contained in the numerous fireside chats, and to bypass the testing and Q&A sessions by providing workshop style support for anyone wishing to put the GitBook to use.  I mention the Pioneer course because one of the aspects of it was to work with the Atala SDK, and with this proposal's goal being for someone who accesses the GiBook to be able to execute the basic DID calls and VC verifications, there will need to be some version of the SDK to run.  They indicate a partnership here with RootID project, a Catalyst project in parallel development that has a testnet wallet that is essentially the same thing as the Atala course SDK, so I suspect this is what people will be using to clarify their understanding from reading the GitBook.  This kind of hands on education could help many, many more people become comfortable with the complex world of DIDs and SSI, and to add the multilingual component to it just makes it all the more impactful.\n", "q0r": 5, "q1": "They have taken responsibility here for the first English version and then the first three translations (which appear to be languages the team may have experience with), so I don't think the team is biting off more than they can chew.  They have given themselves 6 months to complete the project, and the only issue that I have with the way the plan, timeline and budget come together, is the description of the workshops.  We don't really have details to figure out if these are live support events, or more static learning resources such as videos provided for the GitBook.  Either way it would have been good to see more of a breakdown of how these were to be delivered and what their measure of success was.  This lack of detail also creates a lack of clarity around the Wallet partnership, and whether they envision the wallet experience being a part of the GitBook hands-on process, or a separate deliverable tied to the workshops, or even just a general link for anyone to follow of their own accord.  The budget doesn't clarify any of this for us, as the workshops are only included in the Design phase, though they may be part of the marketing budget line item as well.  A reworking and clarification of the timeline/roadmap would help put this otherwise excellent proposal at the top of many lists.  In fact, I would say that just the GitBook and translations are a solid project, and if the hands-on wallet experience can be included, whether as a walkthrough in the GitBook, or as a series of workshops leveraging the GitBook material, than that would just be a bonus.  In general I would say this proposal is very close to a top rating with just a little tightening up.", "q1r": 4, "q2": "It would be good to see a fair number more milestones (this comes back to reworking that roadmap) or deliverables, as the auditability section is a bit sparse.  The general educational resource and translations side of things is very tight, as they will obviously be available as opensource repos, and the community can immediately begin to work on more translations of the material.  But the Wallet/Workshops side of the proposal has a lack of clear vision that makes it hard to picture exactly how we might measure their success.  Again, tightening up the descriptions, timeline, budget to better account for the addition of the workshops, and how the Wallet experience is threaded through the project will provide the key indicators that this project is able to stay on track.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5601, "q0": "The proposer would like to offer an online course for SSI. Basically, there is not much material currently available, so the idea for a course is quite reasonable and useful. However, we are still in a very early phase as far as SSI is concerned. We are still far from a general adoption phase and the added value of translating a course into languages other than English is relatively minor. If someone is not fluent in English (most of us are not native speakers) and then learns about SSI in a course, they will not be able to do anything with the knowledge, because all the technical material is in English as well.", "q0r": 4, "q1": "I would have liked to see more attention paid to the course content. To create and think through these properly is the essential part of the work. The rest of the timeline is very rough and lacks clarity. What exactly does \"Support workshops about SSI, DID and Atala PRISM\" mean? Which workshops? In front of which audience, in which form? Details are missing to really assess the feasibility thoroughly.", "q1r": 3, "q2": "The proposal is understandable, but not elaborated enough. The indication that the results should be published as a Gitbook is positive. Otherwise, there should be bi-weekly reports. However, exact goals / KPIs remain unclear.", "q2r": 4, "assessor": "z_assessor_2024", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5923, "q0": "The proposer has identified a problem and a solution to solve the problem but is somehow unclear who is the target audience thus making it difficult to assess the impact and to quantify the added value to the Cardano ecosystem.\nBased on what the proposal is aiming to deliver it seems that it doesn't fit into the Challenge brief as the Campaign addresses the issuers, the holders and the verifiers of the digital credentials for real world use cases. Creating a documented material about SSI/DID is necessary but is not enough to emphasize the benefits of using the Atala PRISM. (things should orbit around this).", "q0r": 2, "q1": "There are no evidences of the proposer's skills and experience necessary to successfully implement the proposal.\n\nThe requested budget is broken down into identifiable items and being related to content creation it is recommended to give details about the estimated amount of hour that are to be spent ($2.500 could be for 10 or 100 working hours, it has to be clarified). Also the amount requested $15.000 seems to be unreasonable for what is to be delivered.\n\nThere is a defined timetable with achievable milestones but one period of time seems to be overrated as 3 month for content creation is more than what is usually enough (1-1.5 month will suffice).", "q1r": 3, "q2": "There are no KPI/metrics to define the success of the proposal. Being about a teaching material some relevant metrics to follow could be te number of attendees and their satisfaction about what they learned.\n\nA kind of gathering of feedback, in other words, so that we could understand how these courses and workshops positively impacted the audience. It would be essential for the author to clarify how the activities could specifically benefit our blockchain, as this is somewhat uncertain in all the details of the proposal.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8267, "q0": "Yes this proposal effectively addresses the challenge and focuses on self-governance of Emergent Communities: Education, Career, and Emergent Reputation Primitives within the challenge brief. \n\nEntering into the blockchain space can be overwhelming with a mountain of information leering over the individual. However, having a basic understanding of blockchain is important given its foundational nature to DIDs, and specifically Atala Prism on Cardano. By developing an introductory course to DIDs that can be delivered to different multilingual communities, more individuals from diverse backgrounds can come to gain the same knowledge. \n\nThe reason why I am not giving full impact marks here is because there are several other projects within this challenge committing to developing similar introductory courses. If all these projects do their courses in isolation the impact on the broader community of each specific project may not be as great as the information would be spread out. I'd encourage the proposers to think how they could partner with existing efforts/projects to align efforts for greater impact. ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is likely that this proposal will be implemented successfully. The proposers do a good job at outlining their vision for the next six months and offer reasonable milestones and deliverables throughout the stages. \n\nWhat I would have liked to see more detail are the components that will be included in the introductory course given the primacy of this deliverable to the overall project. While they identify SSI/DIDs as the focus, what specific components will you be looking at? Since blockchain is pivotal to DIDs, will you include basic blockchain education? What types of materials will you provide: worksheets, modules, videos, games? How will you verify the information with the community? \n\nI commend the proposer on identifying other contacts who will become partners to get the material into the hands of communities looking to issue and verify DIDs. Although, I would have also appreciated links to external resources that could verify the skills and credentials of partners, as well as the main proposer. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. As Cardano works to become the world's largest open source ecosystem it is a good sign when proposers commit to being open source from the beginning. This project will use github to ensure that all information is publicly accessible, which can give voters confidence that the project is open to external scrutiny. \n\nWhat is missing for me in auditability is the proposer's plan to verify and validate the course they are developing with the broader community. As mentioned above, there are several groups intending to work on an introductory course and it will be vital for these groups to work together to ensure accuracy and accessibility of information. This type of effort should welcome peer review and community challenges, particularly as \"an accessible and standardized approach for any community to learn about and use the SSI/DID technologies\" is quite subjective. What exactly would you measure to know you have achieved this? ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9149, "q0": "The proposal proposed the introductory course to increase awareness of SSI/DID technologies in multilingual resources, including English, Indonesian, Spanish, and Portuguese in Gitbooks style and workshops on SSI, DID and Atala PRISM. The proposal mentioned that based on the previous unfunded proposal on the same area in Fund 7. I believe the proposal has a certain degree impact on the three languages other than English with information delivery in Gitbooks style, a web information page. If the proposal has provided more explicit types/methods/approaches of impact measurable or collectable data from the participants regardless of Gitbooks style or the direct workshop, that would be very good for this impact. With the workshop on SSI and DID, if there is some information such as the session plan on this workshop’s series that would be able to estimate the impact of the proposal better.", "q0r": 4, "q1": "I believe with 15,000 requests for this proposal, it is easily delivered in six months with the introductory courses on SSI and DID. The proposal should have included the information or details on how to manage the translation process into three different languages from English and how to validate the translation process that can be acceptable and accurate and the acceptance from the learners.", "q1r": 4, "q2": "Since the proposal uses Giftbook and workshop series so the information bi-weekly from the proposal would be readily available online so anyone can audit, the most important for your feasibility writing is first 0 to 3 months and 4-6 six months should move or repeat it in auditability. With the current audibility on your introduction course and workshop is not clear where to actual milestone to audit.", "q2r": 4, "assessor": "z_assessor_726", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A standardized introductory course to increase awareness of SSI/DID technologies, and its possible applications with multilingual resources", "experience": "Msc Economics focused on Quantitative Finance, Incentives and Blockchain\nPhD in Management: Institutions, Government and Policy"}