{"id": 399832, "author": "heinz.gassner", "title": "DLT360: DID/ZKP & GDPR-Data Privacy", "url": "https://cardano.ideascale.com/a/dtd/399832-48088", "category": 26443, "amount": 25000, "description": "DLT/Blockchain is apparently in conflict with EU-Personal Data Privacy regulation and with major GDPR PbD (Privacy-by-Design) principles", "funded": 2, "upvotes": 72967316, "downvotes": 6346239, "votes_result": 66621077, "votes_cast": 266, "f6_no_assessments": 5, "f6_rating": 4.7333333333333325, "videos": [], "media": [], "f6_assessments": [{"id": 8273, "q0": "Yes, this proposal effectively addresses the challenge. Specifically, the proposal seeks to improve the functionality and interoperability of Atala Prism in relation to existing regulatory requirements. This is a lofty goal and one that should remain the focus of the community until realized. The success of Atala Prism will largely be driven by its adoption not only in new systems, but also how it interacts with our legacy systems. \n\nThe proposers highlight a conflict between blockchain based solutions and EU- Persona Data Privacy regulations (GDPR). Key features of Cardano's Atala Prism may be seen as in contrary to these regulations, such as Hydra, Sidechains, Zero knowledge proofs, and so the team proposes to explore and summarize the best practice solutions/approaches with these features in mind. Given the entrenched nature of these types of regulations across the globe, it is paramount that the community identify methods to align and integrate Cardano, and more specifically, Atala Prism. Should this be successful, the proposal would likely have a significant impact for myriad groups across the ecosystem. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely that this proposal will be implemented successfully. The DLT360 team is no stranger to the Catalyst process and has been successfully funded in several previous rounds. Their track record not only speaks for itself, including their willingness to open themselves to scrutiny through their community Miro Board and presentations at the Town Halls, but they do not rest on this. Instead, the team does an excellent job outlining their reasoning, approach, and integration with their existing suite of proposals. They clearly articulate who comprises the team and how they plan to work together to realize this, in tandem with the previous proposals. \n\nOne thing that could have strengthened the proposal is a better delineation of the research that will be undertaken. If the goal is to summarize best practices, what type of information will you be seeking? What will you do if you do not find research you are looking for readily available? Would you conduct additional research as needed? How will you ensure that your findings can be extrapolated to other regulatory environments? \n\nThe team is not asking for a lot of funding given it's an add-on to their previous proposals. I appreciate the budget being broken down by task and the allotment for each task being broken down into it's hourly rate. This type of granularity avoids voters needing to just \"trust\" the team and can give confidence that the team has thought through the necessary components. \n\n", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress of the proposal. It is obvious that this team has gone through this process before as they have hit all the marks. The team continues to make themselves available through the various Town Hall events and through the Catalyst Coordinator's meeting, this can give confidence to voters in the ability to follow and audit the proposal. \n\nThe KPIs are interesting but do feel maybe slightly broad for what is being proposed here. If the team is focused on summarizing best practices in relation to the GDPR to better integrate Cardano and its many features, I do not immediately see how \"number of projects/ regulatory partners engaging with us\" necessarily applies, and do question whether \">5\" would be achievable by the end of Q3. These measures would likely be dependent on the other components of the DLT360 funds and so may not be an accurate measure for this specific project. However, the completion of this one component (0-100%) is extremely specific to this project, which is likely achievable within the timeline provided. \n", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 10510, "q0": "This proposal is an additional project linked to an previously funded proposal from fund 7. The proposal is clear and the aim is to analyze and integrate best practices regarding data privacy into DID technology developed for Cardano. The proposal speaks directly of working on developing solutions regarding EU data privacy legislation however it is reasonable to assume that any solutions found would be useful in any implementation of DID technology around the world. Since this challenge is primarily about increasing adoption of DID technology and we know that solutions to data privacy will be required in order to get any large scale adoption of DIDs by governments and large organizations then this proposal is very well aligned with the goals of the challenge. Adoption of DIDs built on Cardano is of very high value to the community and therefore solutions to the problem of data privacy specific to the Cardano blockchain is well worth the investment by the community. The project team is building an ongoing project DLT360 which has significant potential of bringing further value to the Cardano community and be able to bring any solutions and best practices to the attention of other projects such as ATALA Prism. KPIs, such as cooperation with ATALA Prism, are well aligned with the proposal and challenge goals. The fact that the aim is to focus on Cardano specific solutions is an additional bonus in terms of value to the community. Given all of these positives for this proposal I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "This team is well known to the community and has had previous projects approved for funding through catalyst. The team has all the required experience and education background to complete the task it is requesting funding for. All of the relevant experience and education is verifiable through links provided about individual team members in the feasibility section. A line by line breakdown of costs associated with the proposal is given and seems reasonable for the work performed. There is also a timeframe given for the completion of the proposal which again seems perfectly reasonable. Since this proposal is tied to the future of the DLT360 project as a whole explanations on how DLT360 intends on sustaining itself financially in the future is also included. This is good to see and the plan seems well thought out and actionable reducing any future risk and future utility of this particular proposal. One aspect that I would recommend looking further into is in terms of risk analysis. Data privacy can be a double edge sword in terms of adoption. Too much privacy could easily turn away nation states for example from any DID system that would make regulation too difficult. Understanding that risk and weighing it when working out best practices regarding data privacy would increase the value to the community. I would assume this would be part of the expert level discussions listed in the KPIs, but it was not explicitly stated. Overall I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "This team is familiar with the catalyst reporting process as it has had previously funded proposals. The KPIs listed are clear and a process for reporting them is included in section 3 of the generic DLT360 project which includes various reporting mechanisms. The reporting mechanisms are not yet linked however as the website is under production but it is good to see that it is already started. It would be nice to see clear updates on the website regarding catalyst projects and would likely improve community involvement with the team. There is a clear timeframe given to complete the required components of the proposal. There are both qualitative and quantitative metrics given for judging success of the proposal and those metrics are realistic and proportionate to the requested funds. The goals of this project are clear and easily auditable and therefore I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2119, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 20 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal. \n\nSpecific part: Fund 7 has funded a DLT360 proposal called DID Application Blueprint. Initial works show  tensions between blockchain proponents and EU-data-privacy enthusiasts. The team sees a need to outline reliable approaches for public permissionless blockchains. \n\nThe aim is to summarize best practice scalability approaches (HYDRA, Orbis, sidechains) as well as anonymisation / storage of pseudonymous data. I find a good match between the proposal and the challenge.", "q0r": 4, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with at least 20 additional proposals across several challenges, for a total funding of at least 411.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: project would comprise basic research by senior & junior contributors and various meetings & discussions including travel.  For budget core-work rates are 80 USD/hour. Core research + meetings take up 60% of the budget.", "q1r": 4, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.\n\nSpecific part: The result will be an add-on to the team’s existing project already funded, so it would be an add-on.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5778, "q0": "The problem, identified by the DLT360 team, comes from the heated discussion about dealing with personal data privacy and regulation. The teams ambition is to research, archive, and make readily available, solid best practice solution-approaches in dealing with regulatory framework for public permissionless blockchains.\nThe 'why' and the 'how' are described in detail and  in a concise manner. \nI strongly agree that research done by DLT360's team here will provide Cardano community with necessary intel for future development.", "q0r": 5, "q1": "Everything is well documented. The team is established counting 9 members, all positions are detailed with LinkedIn pages of the members. Overall guidance form Mr. Heinz Gassner, with more than 30 years of industry-leadership experience combined with direct access to relevant ATALA Prism expertise.\nThe roadmap for this project suggests that key activities will commence all during Q3 of 2022.\nAll 7 bulletpoints describe in detail the means of conduct of the team members and their associates.", "q1r": 5, "q2": "As an established team, already running projects from funding rounds 6 and 7, they are well familiar with Catalyst Coordinator, and relevant reporting processes within Catalyst.\nThe KPI's are in 4 stages and well detailed. The success is described as reached when all KPI activities have reached 100% (presumably by end of Q3 2022). Furthermore, partnerships in major industries, consulting and other are established, and number of regulatory partners, share same weight of NPS (5 each), with success defined as 80% NPS reached.\nThis is separate proposal that builds upon an active Fund7 proposal, DID Application Blueprint.\nI rate this projects auditability with a top score of 5.", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7153, "q0": "If I read the problem statement and the solution statement alone, these two are hard to connect. \n\nConflict with the EU-Personal Data Privacy regulation will be solved by deepening the F7 proposal. This part could have been elaborated better. \n\nLong story short - the proposal is continuing their work related to DID application blueprint which is a guide for other projects/applications built, using Atala Prism. Since it is aiming to help all the new projects and ease their development, cooperate with them, the impact on Cardano is high.\nThe current problem to be solved is EU and GDPR issues, which will be covered by this proposal. If they will manage to establish an agreement at the scale of EU entities, it will open the doors for adaptation of Cardano and DIDs to another level. ", "q0r": 5, "q1": "The presented experience is sufficient, along with the skills required. Also induced by the fact, that the projects are already running for some time. LinkedIn profiles are posted aswell, allowing a better verification. \n\nThe roadmap is set to three months, regarding this specific proposal, and a thorough list of goals is provided. I am missing an allocated time to perform these actions.\n\nA detailed budget is provided, showing that each task performed is having allocated expected time (which could have been linked to the sections in the roadmap part), and hourly wages are used to calculate the budget. \n\nThe budget is 25k, which seems reasonable given 8,33k/month per 5 core members + some assistants. To improve the proposal, specific team members could have been linked to activities performed, to have a better picture of the budget distribution over a person/task. \n\nDespite some small drawbacks, I am keeping the score full. But consider these for future proposals.", "q1r": 5, "q2": "The progress and the success of the proposal are outlined in two sections, where I find these KPIs and success related to each other, and at the same time reasonably set. \n\nMaybe it would be nice to consider some weekly, or monthly (or any other periodical) reports. Or, a shared repository of the current state, and the current version of the blueprint. I could not locate it anywhere, so I am not sure whether it is not displayed on purpose, or I just completely overlooked it. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We are deepening our fund 7-funded project with very specific research regarding latest best implementation practice in this field", "experience": "DLT360 Domain Expert Team and the contributing network with\nSenior industry leadership experienceInterdisciplinary domain-expert teamUniversity assistants, students & Industry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}