{"id": 400391, "author": "proofspace.nick", "title": "Support ADA pmnts in PRISM workflow", "url": "https://cardano.ideascale.com/a/dtd/400391-48088", "category": 26443, "amount": 32205, "description": "ADA value and PRISM VC usage can increase mutually, but triggering ADA payments through VC interactions requires wallet-level integration", "funded": 1, "upvotes": 41138093, "downvotes": 4942630, "votes_result": 36195463, "votes_cast": 122, "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 700, "q0": "I think the proposers may have been a bit worried about their alignment to the challenge setting, but I am here to assure you that allowing an Identity wallet to transact ADA might be the most directly relevant idea in the whole challenge.  IT occurs to me that it may not be well known that when developers in the SSI space talk about identity wallets, that they are not talking about wallets that can hold most tokens, which includes ADA.  This proposal intends to include the protocols in their backend dashboard and in their mobile wallet (api submit to blockfrost.io) to be able to not only generate the required tx, but to also make that compatible with a smart contract to allow DIDs to create the transaction (not sure if this is to be a two way street or not).  The use cases are completely emergent  (though I have an idea the team is after a particular use) and collaboration should yield a lot of lucrative ideas for DIDs and SSI that might have been on the backburner due to the slow moving nature of the SSI space.  There is no need for trust registries or governance frameworks, or any of the other bugaboos I usually try to suss out of these SSI/DID proposals.  Just ADA, and unless I miss my mark, plenty of it.", "q0r": 5, "q1": "This is a five month development plan with a budget heavily pitched to the developer side of things, which I like to see, and pretty evenly divided between the Holder wallets and the Issuer/Verifier set-up (little surprised to see more budget going to the mobile side vs dashboard, but it isn't unreasonable.  Just a curiosity).  They lay out the workflow with plenty of detail up front, and do a good job of expressing both the high level approach across the timeline and clear actionable sprints within each month.   A quick note about the team, Proofspace creates pretty good proposals, and it is all a part of a high level roadmap that plans on delivering a no-code SSI SaaS solution, with plenty of partners in this space.  It kind of feels like a ccvault/nami thing going on with proofspace/RootsID in the Identity wallet space.\n", "q1r": 5, "q2": "I'm resisting the urge to downgrade them for not making this opensource, but it has always been clear that they do it when they can, and that they have every intention of helping others explore the use cases and margin cases that this protocol might inspire.  For tracking they have listed out specific deliverables by the month with KPIs, so we even have general release dates for a couple of videos from the  project.  They do say that this will be submitted for the monthly reports, but those reports are hard for the community to find.  Maintaining a place for those and other announcements would be a nice add.  The project success metrics are fantastically laid out, plenty of detail, and they correctly point out various raates of growth that are important to the ecosystem:  transactions from the contracts for both ADA volumes and VCs issued/verified, and cross-pollination with other projects.  Both of these are long-tail type indicators, but they should have some early data from the prototype to use for forecasting.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 8277, "q0": "Yes, this proposal effectively addresses the challenge. Voters can appreciate that the proposer took the time to go through the challenge brief and identify the exact components they wish to address, specifically, solution development for Prism adoption and interoperability between Cardano and Indy anchored DIDs/VCs. By doing so, the proposers draw the direct link for how their proposal fits within the challenge. \n\nThe idea of upgrading the ProofSpace App to become an ADA token wallet may have an impact but it is unclear the scope to which it is being used in the first place. The proposers could have provided more details on the app's specifics given its primacy to the overall proposal. Without knowing how often, and for what, the app is currently being used, we are left wondering how big of an impact it could have. \n\nOne way the proposers could have gotten additional marks would be to identify the \"high-value use cases\" that they are thinking about. Currently, this is open to interpretation and what is considered high-value for one may not be for another. Providing more details around what you mean here would would also create a baseline from which to measure the second impact criteria: opening up a new range of possible payment use cases. How will you determine what is new vs. old? ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is highly likely that this proposal will be implemented successfully. The team does an excellent job clearly articulating their idea and outlining their plan to completion. In addition to the high level tasks that are required, they do a good job at breaking down each of these tasks into it their sub components allowing voters to see more granular steps that will be undertaken at each stage. \n\nIt is a little unclear how long this proposal will take with what is provided. They do offer a sparse roadmap from May-September but it appears that only goes to piloting their solution and not to full adoption/integration. This isn't to say that the project need to be fully finished by September but a forward looking plan would also better situate the proposal as to when it may be determined to be implemented successfully. \n\nThe team's credentials as listed seem strong for the proposal and give confidence in their ability to deliver, however, there is no supporting documentation. It may sound simple but linking to LinkedIn or other sources that showcase your credentials will go a long way for voters. Moreover, a way to strengthen the proposal in this section would be to identify which team member will be responsible for which component - assuming that the team has all the skills to complete the task - to show that you are well equipped given those skills are already on the team. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The proposers do an excellent job at clearly articulating their plans for ensuring accountability to the community and the measures the community can use to keep them on track. At each stage of the roadmap the proposers have noted the exact type of evidence that will be provided to the community to update them on progress, and how they will maximize existing auditing processes such as the monthly coordinators meeting and end of project reports. \n\nI think the proposers could have explained in a bit more detail how the community will participate, or not, in the development and testing of the working prototype. Will you encourage community scrutiny by allowing other like-minded teams to use your product during prototyping? Will you develop your tools in an open-source way to apply your findings more broadly? \n\nThe reason why this section is not receiving full marks is due to the fact that they proposers provide 3 criteria by which success will be measured (# of credentials issued/verified; volume of ADA transacted; increase in collaboration or submission of new proposals) but they then say that each is difficult to measure and may not be accurate. This makes me question the strength of these indicators as measures of success. Moreover, what are the thresholds for each to be a success? Adding in these details would increase the score to full marks. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 10511, "q0": "The problem being addressed is clear and so is the proposed solution. Out of the three focus areas of the challenge this proposal fits best with the interoperability aspect. The proposal creates a way for individuals to bridge their identity from legacy systems to Cardano and would link that identity to the ability to perform payments. This is a natural evolution of the space as wallet and DID integration will be necessary for several use cases but also the ability to perform payments will onboard users who will want that functionality. The proposed solution brings value to anyone in the Cardano community that would use the software created and would bring new users to the ecosystem. The impact is limited to this particular software unless other applications are able to learn from the integration to help build other solutions. The impact is also dependent on services deploying on the platform. In simple terms this is a case of \"if you build it they will come\" which is likely true with proper marketing but makes impact a little more uncertain. If successful this could create many new users and the scaling potential for the future is high. Given all of this I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team proposing this project has all the required experience and expertise required to complete this task. Some background was provided for each team member but interestingly no outside links were on this proposal. However all information was easily verifiable based on links provided on other past and present proposals and also on websites for the project. This team has put forward several other proposals in the past and is well known to the community. This proposal is a continuation of a past fund 7 funded proposal. The project has set targets written in a chronological order and timeframes are included for estimated completion of individual targets. There is a budget available with individually budgeted items. Timeframes, budget, and proposal targets are all reasonable and seem well thought through. The proposer has also taken the time to think about several risks associated with this proposal and address each point with appropriate mitigation. I strongly agree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 5, "q2": "This is a team with previous experience with catalyst and understands the requirement to provide ongoing material to audit the proposal. There is a detailed roadmap with individual goals listed which all have timeframes attached. The team commits to monthly community reports and an end of project report including screenshots and video demos of certain KPIs. There is no specific site mentioned where these updates would be made available but this should not be a problem for this team to report this information since they are very active on catalyst. The KPIs listed make sense to judge the success of this proposal and are in line with the aims of the challenge on the whole. Therefore I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1409, "q0": "I believe that Support ADA payment in PRISM workflow proposal satisfies the Accelerated Decentralized Identity challenge well in the sense that this opens up more possibilities in accepting ADA payment. The feature will allow both PRISM and Indy credential holders to utilize ADA in transaction. However, there is still a potential risk after supporting ADA payments in prism workflow but the adoption among users are low which would leave the proposition futile. It is not necessary that the community who want to utilize PRISM and ADA payment would like to go through Proofspace wallet app. ", "q0r": 5, "q1": "Although the tasks, milestones and deliverables are outlined clearly in this proposal. The budget does not have the breakdown in term of number of hours involved within each task. For example, how does the team come up with mobile development cost of $16,080. The team budget seems to go to decimal point but not transparent on the rate per hour. The team members are experienced and well qualified to conduct UI/UX, integrate ADA payment (frontend & backend) and pilot ADA payment in Proofspace wallet. ", "q1r": 4, "q2": "The project can be audited by checking if the deliverables are satisfied mainly for UX/UI design and wallet integration. They will put the progress in monthly report and end of term project report. As in the case of other mobile apps, it is unclear why they do not include the number of users that do the verified credential and use the ProofSpace wallet as their key metric. Although I understand that they may not have a lot of partners in this early stage but the traction is really important to include as the key metrics to measure their performance and whether there is a strong case that supporting ADA payment through proofspace wallet will accelerate the decentralized identity (DID) adoption.", "q2r": 4, "assessor": "z_assessor_1358", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2076, "q0": "The proposal fills all the boxes required to enhance the scalability of use and implementation of ada. SDG metrics show impacts on the structural and fundamental variables most relevant and necessary to build the foundations for a sustainable community with a prosperous destiny; the promoting sustained, inclusive and sustainable economic growth. Achieve higher levels of economic productivity through diversification and do it by using PRISM VC interaction potential. By integrating ADA payments into the ProofSpace wallet so that payments can be triggered upon completion of a PRISM VC interaction, the flow of possible transactions increases exponentially over the worst case scenario. the tool already works in different digital wallets, the user is authorized to select which digital currency he wants to use through a visa debit card, the same wallet does not allow this action with ADA", "q0r": 4, "q1": "Due to the technical and detailed nature of the roadmap, the proposal should have possibilities. PRISM/Indy interoperability is not an easy challenge for the chain if its scale does not have the basic security development necessary for the objective. The proposal seems solid. Associated profiles nest experience in their summaries. Challenges, risks and mitigations understandings.", "q1r": 4, "q2": "This would be my eighth assesse proposal. Due to the level of detail, it seems the one with the most probabilities of achieving its goal. I have reviewed the proposal presented in substance7 entitled \"No-Code SSI SaaS for Mass Adoption\" and understand its link and need to be able to advance in parallel and in a complementary manner. successes in endever.", "q2r": 4, "assessor": "z_assessor_1451", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7155, "q0": "The proposers aim to implement AtalaPrism to their ProofSpace wallet, which would enable verification along with the transactions, which can find their use in real-life cases, thus adaptation is expected of both AtalaPrism and Cardano blockchain. \n\nThe drawback of the proposal is that it is focused on a single wallet (which is not integrated, as far as I tried to search) and the project is not open-source, so no other wallets can benefit from it, therefore the adaptation will be purely based on the success of this particular wallet. ", "q0r": 4, "q1": "The stated bio of team members is vast and seems sufficient to perform the tasks outlined. I am missing LinkedIn profiles, but considering the states as true, they definitely are possessing the required experience and skill. \n\nThe roadmap is set to 6 months and three \"main\" tasks are defined. I find this detail of the roadmap lacking some more information, preferably on the weekly basis. \n\nThe budget is calculated based on the proposer's expectations, but we do not know the expected hours spent on the respective tasks, or hourly rate. \n\nAlthough the proposal seems feasible, I am missing some additional information for the full five stars. \n", "q1r": 4, "q2": "The progress of the proposal will be monitored by monthly reports provided by the proposers, regarding the planned tasks.\n\nThe success of the proposal will be monitored by the completion of the planned tasks and the number of use cases of their wallet.\n\nThe most impactful metric is definitely possible collaborations resulting from this proposal. \n\nThe key metrics are straightforward, and audit is possible to perform effectively.  ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Integrate ADA payments into ProofSpace wallet so that payments can be triggered upon completion of a PRISM VC interaction.", "experience": "Engineering team with 80+ yrs full stack dev and distributed systems research. Business team with 60+yrs legal, sales, product and ops across industries and geographies."}