{"id": 400751, "author": "crjarove", "title": "Small Farmers DAO", "url": "https://cardano.ideascale.com/a/dtd/400751-48088", "category": 26443, "amount": 33000, "description": "Small farmers lack in self-organizing and self-governing production which hinders access to markets and the ability to negotiate fair prices", "funded": 1, "upvotes": 25698513, "downvotes": 15157116, "votes_result": 10541397, "votes_cast": 96, "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 8280, "q0": "This proposal effectively addresses the challenge. This is the second component to a previously funded proposal which was focused on building a network of small farmers in Latin America. This proposal now suggests that turning this network into a DAO will help address low productivity, financial exclusion, and limited market access for the participating members. The proposer does a good job of identifying exactly which component of the challenge brief they are hoping to solve, particularly the \"small producer problem\". \n\nThe reason why this proposal has not received full marks is that they explicitly state that the success of this proposal is linked to the success of the F7 proposal, yet that project just got underway so it is not clear as to its outcome. Given this dependence, voters cannot be certain that this proposal would have the intended impact beyond what the first would deliver. While they have identified several associated risks, the fact that this is not clearly articulated, is somewhat concerning. Moreover, the mitigation strategies for the risks that are identified seem to relate more to the network that is being built through the F7 proposal, than to this one specifically. ", "q0r": 4, "q1": "Given the experience and plan presented it is unclear whether this proposal is likely to be implemented successfully. This proposal requires a lot of trust on the part of voters to believe it is going to be a success. First off, it is challenging to know whether the project is feasible given the uncertainty of the first component (building a network of small farmers in LATAM) just being started with no results provided. \n\nSecond, while I do not question the motives of the proposer, from the information provided they do not prove that they have the adequate skills or training to complete the work. In fact, the key tasks (establishing relationships with small farmers, taking Atala Prism course, learning how to build a DAO, establishing relationships with buyers) are likely pre-requisites to the success of the project but are not yet within the proposer's skillset. It is good that the proposer is situated in the appropriate geographic area for the project but I would have liked more explanation on how farmers will be onboarded to the DAO. \n\nThe one component that can give voters confidence in the feasibility of the proposal is the connection to Start Up Mexico. Partnerships with this type of organization may reduce the likelihood of failure given the expertise and supports provided. However, given the issues highlighted herein, it is equally as likely to be feasible as not. ", "q1r": 3, "q2": "The information provided is neither sufficient nor insufficient to audit the progress and success of the proposal. The idea is there, and the plan somewhat makes sense to get there, but there is a disconnect between the activities highlighted in the plan and those that are being measured for success. For example, the tasks that need to be completed are more dependent on the proposer themself being able to learn the technical requirements for Atala Prism and DAOs. How will the community audit the success of the proposer in doing so? What if you aren't successful in one or the other? The completion of these tasks is directly linked to the project's success yet there is no indication that they will be finished, calling into question the rest of the project. \n\nThe KPIs and success indicators for the DAO component are clear but other than a tangential mention of identity it is not clear how success for accelerated decentralized identity will be measured. One could assume that the crypto wallet registration is where the Atala Prism component is introduced, but is registering 200 crypto wallets an accurate measurement?\n\nFinally, it is good that the DAO itself will be able to perform self-auditing functions on the success of the DAO given its transparent nature but this does not necessarily mean that the DAO itself will undergo any auditing prior to being introduced to the network. One could also assume that Start Up Mexico would have its own auditing requirements here which could be dual purpose and serve the Cardano community. I would encourage the proposer to include this information if required to resubmit. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 711, "q0": "This is a project in desperate need of a high level roadmap!  What they are working on is a perfect idea for leveraging blockchain:  a small farmer's co-op to help decentralize and distribute knowledge (from best practices to current market conditions), formed as a DAO and with decentralized identity characteristics.  Because this latter component is the source of challenge setting alignment, it is really the most important, and the project as outlined here sort of fumbles around with it a bit, in an unsure fashion.  What they KNOW is what they need it to do, but they are being deferential to how much they willingly acknowledge that they need to learn, and being somewhat noncommittal to what it is that does these things.  I can clear that up a bit:  they are going to need DIDs.  They may seem optional, but for the financial transactions they have planned, it isn't.  NFTs will not give them the security they are looking for, and no governance protocol with the kinds of funds they are going to have at stake will be safe without sybill protection.  Additionally the scaling opportunities they forsee for a food tracing program will also require DIDs.  Again, it can be done with NFTs, but only as a sort of mvp, and the protocols will need to be scrapped to run the more robust DID protocols anyways, so they really aren't worth the bother at this scale.  Because they need DIDs, it also means they need to develop a trust registry, and it should probably be an emergent property of the DAO (ie arising from the requirements of DAO membership, as opposed to a wider SSI type integration), so that is something I would like to see in their planning as well, and what I recommend they focus on as they dig into Atala.", "q0r": 4, "q1": "The team is feeling its way along, having only just been funded to start the project that this funding will continue, so they are kind of like a person in the dark with a flashlight to find the way.  This is why I think they should put some time into a robust 10,000' view project roadmap that they can use to orient themselves no matter where the project is.  The team seems suited to the task at hand, bringing key insight from multiple stakeholder angles and good support partnerships locally and in Catalyst, but I highly recommend that they consider getting several more technical partnerships on board, in particular an Identity Wallet partner (RootsID and Proofspace from within Catalyst) and also a peer/partner to get feedback from that is working on similar ideas, such as Waya.  I don't intend to promote any particular projects, I am just aware of these, and aware of their commitment to opensource projects.  Despite needing many of the deeper characteristics of DIDs for this project, I appreciate the early focus on the DAO, as the governance framework established there informs not only the financial characteristics of the protocols they are discussing, but also the trust registry which is a critical implementation of the governance, and the root of the DID tree's authenticity.  The budget is heavily tilted to this DAO development, and with a partnership in hand, it would be good to see an Identity wallet integration into their onboarding process (which I believe only currently has a regular ADA wallet under consideration).  As to risks, this project has landmines all over the place in front of it, but if they keep this \"learn your way forward\" approach, they should be able to avoid the worst of it.  Add a few critical partners, and I think the path clarifies even more for them.", "q1r": 4, "q2": "There is a good list of measurables here, mostly centered on the DAO.  it would be good if the onboarding process included acquiring DIDs as that would be a critical challenge setting metric.  The choice to include the NFTs is a two-edged sword, as the longer term protocol may not be measured like that, but as a prototype, or for gauging the uptake of the technology, it could be a very good metric.  Onboarding the cryptowallets and including some hard numbers for registered farmers is a useful way of gauging the project, but I wonder if it really feels \"Complete\" upon hitting those metrics?  It feels to me like the funding is really tied to that DID usage, but as the proposal is currently drawn up, completion in terms of the DAO may have to suffice.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 928, "q0": "The main requirement of the challenge Accelerate Decentralized Identity is to implement with Atala PRISM, and the proposal lacks details how Atala PRISM would be used or how decentralized identity would benefit small farmers. The DAO for small farmers is presented as a relevant, useful idea to have them collaborate and escape exploitation or share knowledge. The proposer still wants to take the Atala PRISM pioneer program and has not researched the solution yet or how it can be applied to the DAO. Therefore, although Identity could become a key benefit of this proposal, it is in its current form lacking the link between \"DAO for DAO's sake\" and possible benefits of providing identity or even identifying the problems caused by lack of it.", "q0r": 3, "q1": "I really wish the proposer well in his Catalyst journey, but think it may be too early to say that the proposal has a chance of success in the way it is presented. Taking part in the Atala PRISM program and learning how DAOs work using Cardano smart contracts are some of the milestones required in the presentation of the feasibility. Therefore, confidence we gain about the existing skillset to pull off the task is low. The proposer refers to himself as a  blockchain enthusiast and not a developer, which is honest but might be a challenge for creating a working DAO. However, the passion for creating something useful to improve the livelihoods of Latam small-scale farmers comes through in the proposal. \nThis is the continuation of a previously funded proposal, but the much less ambitious scope of the Fund-7 proposal, to onboard farmers and help them in a charitable way, is unlikely to have provided the learning curve necessary to create a DAO.\nThe funding requested and timeline presented alone will not be enough to see the project achieve any meaningful progress turning the dream into a reality. I highly recommend the proposer to find Partners in other Catalyst members or teams maybe by attending Latam Townhall or Telegram and to seek like-minded people and guidance to refine the proposal and build the skillset required.", "q1r": 2, "q2": "The metrics presented for this proposal seem reasonable and relevant. It would be good to see how they can be linked to the goals of the proposal, for example: number of farmers using the DAO - okay KPI, better: farmers being able to increase revenue/crop yield/exchange rate etc. by using this or that tool of the DAO. Simply getting farmers to sign up for the blockchain and able to log in and query information without actually improving their lives could be a waste of their time.", "q2r": 3, "assessor": "z_assessor_1243", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1943, "q0": "The project aligns well with the challenge as it attempts to build a DAO of small farmers in response to the difficulty small farmers have in accessing markets and negotiate fair prices. This has impact on both the community and the cardano ecosystem. The project can be easily scaled up and implemented in other communities too thus helping a lot of small farmers.", "q0r": 5, "q1": "The team consists of the proposer and a partnership with a Mexican organization. In regards to the roadmap and timeline, I see an inconsistency which I have tried to understand but it is still unclear to me.  The roadmap is at first presented for 3 months with specific tasks and then it begins again from 0 to 6 months with different tasks. The budget is broken down in detail and the way it will be utilized does make sense.  Apart from the confusion of the timeline, the project is feasible. The proposer has laid out the challenges that may be encountered along the way.      ", "q1r": 4, "q2": "The proposer clearly identifies the KPIs which are measurable and can be followed by the catalyst community as they are quantified. It is a very straight forward project which will open the way to DAOs in other areas.", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8118, "q0": "The Small Farmers DAO addresses the Accelerate Decentralized Identity challenge well by building a DAO for small farmers to improve their organization and governance and provide them with a digital decentralized identity. It would send a direct impact towards the small farmer community in Latin America. The value transferred is via minted NFTs and the proof ownership of agricultural asset. They have defined the challenge of this project as lack of education and limited connectivity in rural areas. The proposal has consider the problem and address the challenge with the effective solution. The proposal will be impactful for Cardano to be adopted by the farmer in LatAm.", "q0r": 4, "q1": "The project duration is 6 months and the team lead (Cristian) is a farmer himself making it logical of this DAO mission. However, the salary for each team member is 4500. It would be helpful for the community to see how many working hours are spent on the project. The project looks feasible considering the consistent in budget and timeline. Living Roots is also part of Startup Mexico which adds to their credential and willingness to bring this project to completion.", "q1r": 4, "q2": "The team will use number of farmers and buyers as the key metrics along with registered crypto wallets and minted NFTs. It is thoughtful to put along the target figures along with the key metrics so that the community can see the project progress and performance. With full information on display, the project is highly auditable. The proposal would improve more if they can also specify the medium of reporting whether it is the meeting or the report and where the community can take a look at the above mentioned progress. ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Build a DAO of small farmers to improve their organization and governance production and provide them a digital descentralized identity.", "experience": "Industrial Engineer with orientation in logistics processes.Working as farmer growing food in my local community.Blockchain enthusiast, currently learning about blockchain development and smart contract development."}