{"id": 401700, "author": "rhysstoic", "title": "NFTPass: Atala DID Integration", "url": "https://cardano.ideascale.com/a/dtd/401700-48088", "category": 26443, "amount": 50000, "description": "Passes for businesses and events are often tied to some form of Identity verification such as age or name & affiliation etc", "funded": 1, "upvotes": 27652425, "downvotes": 13085869, "votes_result": 14566556, "votes_cast": 116, "f6_no_assessments": 6, "f6_rating": 3.944444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 726, "q0": "If you are an event organizer, and you wish to offer backstage access by issuing an NFT to provide that access, you have problems if you also want to have identity related characteristics for that access, such as an age requirement.  Presently, that means some kind of KYC behind some kind of login to either access the NFT faucet or drop, or it involves manual KYC at the event.  The suggestion here is to integrate did:prism into an existing NFT ticketing/issuance platform in order to create and issue DIDs for the users of that platform to prove they have access to restricted NFTs.  In addition, the integration of ZKP allows the platform to only share specific pieces of that digital identity as needed, and without personal knowledge being exchanged.  One issue asked and answered relates to not just using DIDs for the whole process, why add it to NFT functionality?  This is because there is functionality for NFTs that doesn't exist (yet?) for DIDs.  While both processes are different ways of looking at the same thing, there are already real life protocols for gameification of NFTs in hybrid events, secondary markets for rarity or collectibility of event NFTs, and the ability in general to pass control of the NFT to someone else.  An important question asked and not answered is how to establish these proofs of identity in the first place in order to have them on the blockchain.  This is a critical piece of the puzzle, especially to people who want to purchase event access or memorabilia via crypto.", "q0r": 4, "q1": "The issue with this proposal doesn't come down to the team or the budget, which both seem adequate for the task at hand, in terms of a development workflow and cost.  What concerns me is the lack of a description in the proposal of one of the most critical elements of success:  the trust registry protocols.  In this scenario, the personal data of the person seeking a DID has to be initially validated and stored somewhere and this process underpins the whole protocol.  In the case of NFTPass, as the issuer of the DID, they must maintain the trust registry, which means they need to store the private data.  The ability to hold that data but only allow it be verified by ZKP is a nice (necessary, really) addition, but it doesn't change the fact that the user has private data on a server somewhere, maybe even the cloud.  From the point of view of an event manager, if I were to issue my age-restricted backstage NFT passes through NFTPass, I would want to know that I could trust that NFTPass can prove the actual age of the participant in order to accept their ZKP, since the ZKP only proves that NFTPass has data not whether that data is valid.  I need to trust NFTPass to have valid data that meets either my needs or the needs of the regulators I answer to (an age restriction due to government regulation requires an identity validation that is acceptable to a government, usually one that is issued by that government in the first place).  As you can see, this is a thorny problem.  Solutions could involve establishing why NFTPass could be trusted with personal data, or for NFTPass to only issue DIDs within a certain scope (no driver's license DIDs, or verification of age by affidavit (i.e. signing a web document without actual proof)).  Alternatively they could use a connection protocol to simply onboard DIDs established elsewhere via more robust Trust registries (such as Hyperledger or Sovrin), but this introduces more steps for an end user.  In the end I feel like the best case scenario, limited trust via user affidavits, would lead to limited use cases (however, I can still think of many uses, regardless).  My issue isn't that the one protocol over another might be better or worse, it is that this critical element hasn't been included here for us to evaluate.", "q1r": 3, "q2": "The team plans to stat with design of the integration of did:prism to their NFTPass platform, which should be trackable via research and documentation commits, and of course the implementation itself can be tracked on GitHub, when they get to that.  Of interest to me is the adoption and marketing phase, as there is an oblique way of solving the trust registry problem, which is to onboard the vendors as partners and have them essentially establish the trust behind each issuance, in effect becoming the issuers with NFTPass just contracting its platform (note this does not obviate the need for a trust registry...it just means the one that is created needs to account for the vendor as issuer, as opposed to NFTPass as issuer).  Whether they onboard partnerships or beta customers, tracking their work with event organizers and vendors is the key to that final few progress reports heading into the completion report.  The team already maintains regular communication with the community (and the lead is the Catalyst Circle Representative for SPOs currently), so I expect that, to the extent that they don't get blocked by the governance issues, this project will be transparent and accountable to the community.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2664, "q0": "This is one of the coolest ideas I've read through so far. The only thing is , projects like IAMX are already building DID solutions and have a working use-case in action today. The only difference being that you guys are attempting to integrate the DID solutions into NFT's. Although this could be game changing for the industry, I believe that there are many other projects that already have the infrastructure in place to launch this kind of solution, and have a working product to demo.", "q0r": 4, "q1": "Without a solid plan for advertisement, this project will be dead in the water. You need to partner with businesses and social media to get your idea spread far and wide, and have them financially back the idea to help bootstrap your platform prior to launch.", "q1r": 3, "q2": "Even though the information provided would allow the more tech savvy among us to track your growth, I think putting someone in charge of human relations could expand your reach exponentially. Harness the power of social media and advertising to help solidify your customer base and in turn, your success in the saturated blockchain project world.", "q2r": 4, "assessor": "z_assessor_1548", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5594, "q0": "I think this proposal adheres closely to the challenge in question - allowing for people that use the NFTPass solution to be able to share only the necessary personal information every time they are going to use an NFT ticket within the app, avoiding unnecessary personal information to fall in the hands of certain enterprises which can then be used for unwanted purposes or even worse sold out to third parties - this project aims to decentralise the possession of personal information by the 'big monopolies' and allow people to regain control of their data while still comply with requisites to use tickets for events, flights, etc. Brilliant idea that accelerates decentralisation in every way in my opinion.", "q0r": 5, "q1": "By reading this proposal carefully, it is clear that this solution should be feasible to implement given they have the right team in place with a wide range of experienced people in different areas of software and web development, marketing, project management, business development among others. It seems also that some of these individuals are actually also involved with Atala prism and familiar with it so this gives even more credibility to the project. Social media information on the team members is also disclosed so it allows the public to look into these people's experience, credentials and involvement with the ecosystem which is always a plus. Time frames have been set out in a detailed manner which also gives credibility to the proposal given there are several steps the team need to take to make it a reality; and the budget seems fair with concise but relevant description of the items it will be spent in and in what timeframes, given the amount of people that need to be involved in this project and the amount of work it can take to make this a successful venture, mostly on the marketing and business development side. In conclusion, the project seems feasible and together with its sister project NFTPass could be a game changer in the ticketing industry", "q1r": 5, "q2": "The proposal is complete and detailed enough and their evaluation metrics and KPIs seem correct, which makes this project completely auditable in my opinion. Very detailed and clear explanation of what problem the proposal tackles, how the team is planning to get the project done, a complete list of team members and their credentials and a detailed budget that seems sense checked and appropriate for the size of the project.", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5945, "q0": "The idea presented in the proposal has a good potential to be implemented as a real world use case. From my view, it seems that the proposal is a mix of an app that will use Atala PRISM as a DIS and some other activities to promote DID (and the developed app). Being in UK, this has the premises of a good playground as UK being one of the entities that issue digital identities that sit on Hyperledger Indy ledgers and is a good opportunity to integrate this into the Cardano ecosystem. It's somehow unclear what is the status of NFT Pass (its developing phase) as it wasn't funded in Fund 7, as the scope of the proposal is to integrate Atala PRISM into NFT Pass app. If the app won't evolve in the near future this proposal will lose its scope.", "q0r": 4, "q1": "There are some references about the members of the team and their skills and experience, but I think it will be relevant to see any of their projects, in which were involved, as a repository in GitHub, or something similar, thus make it stronger to believe in their chance to succeed. Rhys background is related with training (gym) thus making it somehow unclear what is his role in the evolution of this project. Providing more evidence about his technical background will clarify this aspect.\n\nThe requested budget is broken down into identifiable items, but they are presented in a vague manner. It is recommended to present the requested amount (at least for development phase) as a multiplier of working hours and a price per hour for every person involved. Another unclear aspect is the number of events that will be set for marketing the app and for presenting the other related materials. (there will be 3, 10, 20 events?). The number of events can grow the number of attendees and the potential number of customers.\n\nThe proposer has not considered challenges and risks relevant to a successful implementation (the main risk would be the NFT Pass development status, and there may be some legislation constrains (underaged people)).", "q1r": 3, "q2": "Based on the info provided is difficult to audit the progress of this proposal. There is a defined timetable (12 months) but is very unclear what are the deliverables of each phase (\"App development (3Months)\" cannot be quantified - relevant details about what is to be done and how (production, testing, release - alpha/beta versions etc.).\n\nOne goal is to onboard one business/event as a real world use case but other KPI/metrics should be define to measure the success of this proposal (how many people are expected to attend the marketing events? etc.)\n\nAs it is, the proposal looks more like a concept than as a working product.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8285, "q0": "Yes, this proposal effectively addresses the challenge by integrating DIDs into the NFT Pass project. As stated by the proposers, having ticketing/event passes on the blockchain is not enough in itself as many of these events require additional information such as age or corporate affiliation. By integrating DIDs into this process, users will be able to verify that they meet all requirements for an event without needing additional sources of identification. \n\nIn addition to the strict integration of identity into the NFT Pass project, this proposal will also explore the use of zero knowledge proofs into the system so that the information that is required does not need to be revealed in order to be validated. This type of privacy-by-design feature is very exciting and if successful would certainly have a broad impact on the use of DIDs in similar situations. Given that the NFT Pass is already under construction, the team seems well positioned to put their ideas into practice for testing. \n\nOne potential hurdle to having a broad impact is the reliance on marketing to socialize the idea across a variety of venues and sectors. It is unclear whether the marketing is for the NFT Pass overall or specifically for its use as an identity tool. If it is the larger project itself, how will this marketing differ from what would be required anyways through that project? Given that real-world adoption is the primary obstacle, highlighting some mitigation measures for addressing it would help improve the strength of this section. ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is likely that this proposal will be implemented successfully. What gives significant weight to the feasibility section of this proposal is their commitment to continue the work regardless of funding results. To me, this implies the team's willingness to continue to drive this idea forward given the potential impact it might have. Over the next twelve months, the team will design and build the identity solution that will integrate with their dApp.\n\nI appreciate that the team has provided external links which allow validation of their credentials. Also, as an active Catalyst Circle representative, Rhys is a well-known community member fulfilling a key role in community governance. This exposure lends some weight to the project's feasibility and at a minimum gives a public facing contact that can be reached should questions or concerns arise.\n\nWhere I am marking down this section on feasibility score is the fact that dApp development comprises $15k of the total budget. However, there is not a substantial discussion on the current state of the dApp and whether this money is for the identity solution or the broader project. \n\nFinally, as marketing makes up a significant portion of this proposal, some more details on the plans for marketing, including business hubs to engage, materials to be included in media kit, and a preliminary list of events to attend, should be highlighted. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The proposers make clear that they will use github as the initial tracking system using commits as their measure, unfortunately there is no indication of how many commits would be deemed a success. It is good that the materials will be provided open source but how do you foresee this information being provided outwards? Will you complete monthly community reports via github? The use of a Kanban board to identify action items and track them to completion is a useful tool to help the community follow along but how will you get engage the community to use this tool? \n\nOverall, the team will measure success by the integration of SSIs and DIDs into a functioning and useable ticket system, but there is no threshold noted. How do you define \"functioning and useable ticket system?\" How many users (businesses/events) will you be seeking? Is one enough to claim a success? \n\nWhile there are certainly ways for the project to be audited, the measures and goals need to be more clearly articulated. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10514, "q0": "The proposal provides a clear and simple problem. The proposed solution is easy to understand and the use case is interesting. Having NFTs that both can be used as a means of gaining access to an event including specific restricted DID info but also double as collectable among other things could have strong growth potential. The impact of this type of endeavor hinges on the promotion and adoption of the product which this team acknowledges and have budgeted for. If this technology was adopted even by a few venues and promoters this could bring in a significant amount of new members into the cardano ecosystem. The KPIs for the project are well suited to increase adoption of DIDs in general. They do not however directly conform to the three stated aims of the challenge (Interoperability between Cardano and Indy anchored DIDs/VCs., Self-governance of Emergent Communities, Circular Supply Chain). If this tool however was integrated into current ticket issuing systems then some level of interoperability would be expected. Therefore I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team has all the relevant skills and experience to complete this proposal. They have provided links and everything is verifiable. The project has a website (curiously not included in the proposal) with good additional information. The team lead is involved in several projects in catalyst and in the cardano ecosystem in general. This includes SPO activities, active discord channels, etc. The budget for this project seems reasonable and the timeframes included for each item also reasonable and achievable. There are adequate resources within this team to execute on this plan and the plan is well ordered. The technical details on how exactly this proposal would be achieved is part of the overall project and therefore not yet available yet. The main concern for me regarding this proposal is also the main challenge identified by the team. That is that the success of this project will hinge on successful marketing and adoption which is very difficult to predict for a project requesting a non trivial amount of funds. The team does acknowledge this however to their credit and part of their plan is to post progress to github therefore the community could benefit from any technical progress the team makes regardless of future adoption. On the whole, I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "There are clear metrics associated with the successful implementation of this projects. There is a roadmap which has well laid out objectives and timeframes. There is an active team which is working on several proposals. There is a website posted. Team members can be reached via several different methods. The main KPIs for the project are broken down as part of the roadmap and would be available to review progress on github and eventually by having a finished product to evaluate. I would have liked to have seen more KPIs included regarding the marketing and promotion of the product. This could have included numbers of business events attended, specifics regarding promotional materials etc. That said since marketing is part of the last phase of this project which would not occur for some time it is understandable that this component is a little vague however I would hope the team would work out specifics for the community at a later date if this proposal does get funded. Overall I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Integrate NFT Pass with Atala Prism to enable access NFTs to share only necessary proof of personal information securely and as necessary", "experience": "Blockchain & DAO Devs, Plutus & Atala Prism Pioneers, Software Engineers and B2B marketing specialists"}