{"id": 384783, "author": "jondorn12", "title": "Schedule Standard Audit Template", "url": "https://cardano.ideascale.com/a/dtd/384783-48088", "category": 26253, "amount": 5000, "description": "As auditorias precisam ser concluídas, mas há demasiados bloqueios para que sejam feitas.", "funded": 0, "upvotes": 17442081, "downvotes": 26131878, "votes_result": 8689797, "votes_cast": 108, "f6_no_assessments": 6, "f6_rating": 1.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "A template for auditing would increase the audit, yet we need people and more tools for it. \r\n\r\nOverall, it is a very poor proposal, but it is in accordance with the challenge. \r\n\r\nMore details are required to properly asses the impact of this proposal - how we would benefit from it? Who would perform these audits? Would it be with cooperation with IOHK? or new teams? Or it would be filled by funded proposers? as a form of a checklist? How to prevent manipulation? \r\n\r\nRating given 1.", "q0r": 1, "q1": "More information is required, a proposal is in not in a form ready to be assessed. More work needs to be done. \r\n\r\nRating given 1.", "q1r": 1, "q2": "More information is required, a proposal is in not in a form ready to be assessed. More work needs to be done.\r\n\r\nRating given 1. ", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "are you trying to solve the problem stated? how did you solve it? This is an incomplete proposal and cannot solve your problem. You should take your time to complete it next quarter.", "q0r": 1, "q1": "What is your experience? corroborate YOUR experience? you will complete the project next time.", "q1r": 1, "q2": "this seems to be a draft. the team hasn't given any accurate information yet. I'm pretty disappointed", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 21, "ne": 0, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "\"Audit is always an important step in all projects to ensure safety as well as avoid fraudulent projects. Creating a template is a great idea to make the audit easier. Because Audit is not an easy job. That's why an audit always costs a lot.\r\nTo be able to determine the impact of the proposal, the proposer should offer a specific product, solution or plan rather than an idea as in this proposal.\"", "q0r": 1, "q1": "\"Proposer owned & operated a federal & state certified mental health clinic & got audited for accuracy and legal correctness in records paperwork. This experience in my opinion is not very relevant to the idea of this proposal\r\nThis proposal does not provide sufficient information to be able to properly assess it.\r\nNo plan, no references and no budget explanation are presented. It is not clear what the proposer wants to create and how.\"", "q1r": 1, "q2": "\"This proposal does not provide sufficient information to be able to properly assess it.\r\nThere is no milestones and no metrics presented. We don't know what to expect from this proposal therefore it is not auditable. \r\n\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 20, "ne": 0, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "This proposition is fascinating and at the same time a bit confusing. The problem is that the Catalyst audit process has too many barriers, and the solution to the problem is to create a review form to check for accuracy and efficiency. While this proposal is excellent, it is only an idea, not a plan. Therefore, we will not know how you implement this proposal.", "q0r": 3, "q1": "No idea what the end product will be (a website? A mobile app?) and so no idea what products will be offered. I cannot consider this proposal as a strong candidate in this challenge because very little information has been provided to gauge its progress and success.\r\nAccording to the description, the proposal does not present evidence regarding blockchain knowledge. The group is an important aspect to evaluate the feasibility, here the proponent does not mention whether he will make the proposal alone or in a group, the proposal does not provide sufficient evidence of the techniques. Relevant skills and experience required to make a recommendation as a reference or guide", "q1r": 1, "q2": "As pointed out, the probability of evaluating the proposal is low, as it does not show a roadmap with development plan, detailed explanation of each step, milestones and delivery of each part, timeline and several ways. for the community to evaluate the success of the proposal, such as metrics and KPIs. In addition, the budget should be better explained and broken down into smaller and related parts of the development process, so that the community can also track the cost of the project. The budget given is 5000$ but without any explanation I don't know what you will spend it on. Hope you will return to the fund in the future with a more complete proposal", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 16, "ne": 5, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The main point of this proposal is to create an audit template form that checks accuracy and efficiency across all the recorded data during a time period. Since this proposal is not completed, without a roadmap, KPIs/metrics, and budget breakdown,..., the solution is still very abstract, unclear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's experience is briefly described as Owned & operating a federal & state-certified mental health clinic & got audited for accuracy and legal correctness in records paperwork, however, there is no proof/external link for verification. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree that it is highly likely that this proposal will be implemented successfully, and would give it a score of 2.", "q1r": 2, "q2": "This proposal is incomplete (since it has no roadmap, KPIs/metrics, and budget breakdown,...) where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal could have a positive impact, but a lot more detail is necessary on how and what you want to do. ", "q0r": 2, "q1": "There is no idea if this proposal will be implemented successfully because there is no links or proof of the skills or experience of the team member. The budget is not set out at all. There is no detailed implementation plan or actionable tasks or timeline. Risk is not discussed or how it will be dealt with. In the next proposal, give more details on these points to be more successful for funding.", "q1r": 1, "q2": "There is nothing mentioned on how the success of this project could be measured. There are also no KPI's mentioned. In the next proposal, these should be added for a more successful assessment.", "q2r": 1, "assessor": "z_assessor_795", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "Criar um formulário modelo de auditoria que verifica a precisão e eficiência de todos os dados registrados durante um período de tempo.", "experience": "Eu possuía e operava uma clínica de saúde mental federal e estadual certificada e fui auditada quanto à exatidão e correção legal na papelada dos registros."}