{"id": 380957, "author": "wvalthar", "title": "@chain-lib Documentation Website", "url": "https://cardano.ideascale.com/a/dtd/380957-48088", "category": 26251, "amount": 4211, "description": "La documentation actuelle de chain-lib est sur github. Ce sera pour créer un site web docusaurus sur le site chain-lib.com que nous possédons.", "funded": 2, "upvotes": 47396000, "downvotes": 6366578, "votes_result": 41029422, "votes_cast": 105, "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Le proposant veut construire un site contenant toute la documentation pour le développement effectué dans deux autres propositions de sa part. J'aime la définition du succès énoncée dans la proposition, car en tant que développeur ayant essayé de nouveaux frameworks et bibliothèques, il est important d'avoir une bonne documentation. Cette idée est excellente pour ce défi et je crois que si les deux autres propositions sont votées, celle-ci doit l'être aussi.  Les métriques laissent à désirer, bien qu'elles soient en accord avec le défi. Comme l'indique l'auteur, la majeure partie du site sera générée, ce qui rendra le soutien relativement facile, et il pourra être transféré lorsque le projet sera suffisamment développé. Ce qui manque dans la proposition, c'est un plan pour le cas où cette proposition (la documentation) serait votée alors que les bibliothèques pour lesquelles cette documentation est écrite ne le seraient pas. Il aurait peut-être été préférable de regrouper cette proposition avec l'une des deux autres pour éviter un tel scénario. C'est juste une suggestion pour le prochain cycle de financement.", "q0r": 5, "q1": "Bien qu'il y ait une longue liste de compétences relatives, je n'ai pas pu trouver un moyen de les vérifier en googlant ou en suivant les liens laissés dans la proposition, ce qui m'a laissé un peu sur ma faim quant aux références de la personne, de l'équipe ou de l'organisation qui a l'intention de faire le travail. Puisqu'il n'est pas fait mention d'une équipe, je suppose qu'il s'agit d'un projet individuel.  Le budget est clairement indiqué et l'on peut comprendre où va l'argent et à quoi il est destiné. Le calendrier fourni me semble également légitime en tant que développeur ayant déjà fait quelque chose de ce genre. Il y a une image claire qui montre le plan de mise en œuvre de la documentation et les outils qui vont être utilisés.  Les aspects techniques de l'architecture sont assez simples, mais ce serait une bonne idée de les répertorier à l'avenir. Je ne pense pas qu'il y ait de risques pour la réalisation de ce projet particulier, à part ce que j'ai déjà mentionné sur le fait que seule cette proposition sera financée. Je recommanderais à l'auteur de rechercher des développeurs partageant les mêmes idées dans la communauté et de collaborer avec eux pour de futurs fonds.", "q1r": 5, "q2": "Il y a un lien vers le projet github et c'est tout ce que l'on peut souhaiter quand on veut suivre l'évolution de la mise en œuvre d'un projet. Les KPIs listés sont pertinents et c'est une bouffée d'air frais de voir enfin une proposition avec des KPIs réels. D'autres mesures que je recommanderais d'utiliser sont celles de l'entonnoir des utilisateurs actifs et du taux de désabonnement. La feuille de route est assez simple et le travail dure environ 3 mois. Une fois qu'elle sera terminée, le site de documentation sera en ligne et disponible pour tout le monde.  La description et la solution décrites dans la proposition sont suffisamment claires pour être comprises par tous.  ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The curse of open source is documentation since it takes a completely different skill set and developers are notorious for not creating proper documenting which limits the use and maintainability of the package. The proposer is nice in making an initiative to document the package and rightly address the challenge. ", "q0r": 5, "q1": "The proposer has published the code base of the library in Github and it is being used. The quality of the code is good. Based on this observation the proposed will be able to prepare the proper documentation and host it. The proposer seems to have the capability for this activity. \r\n", "q1r": 5, "q2": "The documentation for a library is the most important component for its sustenance and usefulness. The open-source project has a serious issue in this respect. The quality of the documentation can be a subjective assessment and the amount of work can vary widely. The progress and the quality can be monitored closely. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the challenge by building an API documentation website for developer to use. By creating a proper documentation website for @chain-lib library, it will make it easy for developers to navigate finding information for the library. Since this @chain-lib project is a work in progress, the impact of creating this documentation will depend on the success of @chain-lib project (which being proposed in this Fund 7).", "q0r": 4, "q1": "The proposer doesn't have any other information other than their short name and their past experience in working with Cardano, but they did provide a work poof on their GitHub repo. The proposer know what resources are needed to implement this proposal (using Docusaurus framework). It would be better if they also provide other information such as hosting platform will be used. This proposal provides budget details like working hours and domain cost. However, the proposer doesn't explain the taxes clearly. It would be better if the proposer also explain how those tax is calculated, so we could verify if the budget is honest and reasonable. All in all, creating a documentation website using a well known Docusaurus framework will make this proposal feasible to implement, however, the budget is still not clear regarding the taxes.", "q1r": 3, "q2": "The proposer doesn't have any other information other than their short name and their past experience in working with Cardano, but they did provide a work poof on their GitHub repo. The proposer know what resources are needed to implement this proposal (using Docusaurus framework). It would be better if they also provide other information such as hosting platform will be used. This proposal provides budget details like working hours and domain cost. However, the proposer doesn't explain the taxes clearly. It would be better if the proposer also explain how those tax is calculated, so we could verify if the budget is honest and reasonable. All in all, creating a documentation website using a well known Docusaurus framework will make this proposal feasible to implement, however, the budget is still not clear regarding the taxes.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 20, "ne": 6, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This idea will help everyone know that chain-lib helps and can accelerate the development of other projects by using chain-lib open sources. But the detail of this proposal says nothing about how their project impacts the ecosystem and which particular part of their system will be used in this project, all is common info.\r\nAnd the team doesn't identify any key metrics for this proposal, which confused me to assess their idea more. ", "q0r": 2, "q1": "There is no plan that is presented in the proposal, there is just only common introduction about their current Github and a short technology explanation about what they will deploy for this project form their source. Moreover, there is no roadmap. Therefore, the feasibility of this project can be assessed because of lacking these things. \r\nBy the way, their required budget also is not reasonable because everything is unclear", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is about creating a proper documentation website to make it easy for developers to use the API, and to ease the creation of plugins. The problem [of Current chain-lib documentation] is clearly described, and explained in detail. However, the solution is not clearly defined enough and remains quite abstract, as a result, no clear expected impact. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "The Chain-lib team's profile is provided and described enough for understanding with suitable skill and experiences for implementation. However, it's hard to verify the ability and experiences of each member. There is no information on demo/pilot/similar works done by this team. In similar, KPIs and Risk (and mitigation) were not provided. On the contrary, the budget is clearly provided with structure and explanations of calculation base. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of info on Chain-lib, however, there is a lack of: (1) Chain-lib's member's profile and external links for verification; (2) KPIs, (3) Risk (and mitigation). By the way, there is no information on similar works done by this team. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Créez un site web de documentation approprié pour permettre aux développeurs d'utiliser facilement l'API et pour faciliter la création de plugins.", "experience": "Développeur de clés Novella / Cardano, SPO, Alanzo Purple tester, Plutus Pioneer 1, et a déjà construit plusieurs composants dans le repo github."}