{"id": 383426, "author": "juliane", "title": "GMBL Turning Dev > Blockchain Devs", "url": "https://cardano.ideascale.com/a/dtd/383426-48088", "category": 26251, "amount": 64000, "description": "Il n'y a pas assez de développeurs de blockchain Cardano pour répondre au raz-de-marée de travail qui nous attend.", "funded": 1, "upvotes": 52644389, "downvotes": 19749965, "votes_result": 32894424, "votes_cast": 269, "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Les proposants veulent engager deux développeurs extrêmement compétents et en faire des experts de la blockchain de Cardano afin qu'ils puissent à leur tour amener et enseigner encore plus de développeurs. Il y a un gros problème, car en raison de la croissance rapide de la communauté Cardano, il y a un besoin d'applications mais ces applications doivent être écrites par quelqu'un. Ce projet permet d'enseigner à ces personnes à créer de superbes Dapps qui feront croître la communauté en tern. Cela apporte une grande valeur à l'ensemble du système Cardano, car il introduit les futurs constructeurs de l'écosystème au développement de la blockchain. En tant que développeur moi-même, je me sens également tenté. Il y a des paramètres et des objectifs clairement définis pour les propositions, ainsi qu'une relation bien étudiée entre le défi et la proposition. La proposition est vraiment axée sur la capacité à passer à l'échelle, et a prouvé sa valeur dans les fonds précédents, ce qu'elle fait déjà. Je ne vois rien qui manque dans cette proposition, et ce n'est malheureusement pas un commentaire que je fais souvent. L'équipe apportera une grande partie manquante à l'écosystème : un processus d'onboarding de développeurs expérimentés dans le monde de la blockchain.  Je ne manquerai pas de suivre de près ce projet et son évolution !  Bonne chance !", "q0r": 5, "q1": "Il y a plus que suffisamment de preuves des compétences des personnes mentionnées dans les propositions. Leurs noms et profils complets ont été donnés librement, ce qui apporte de la crédibilité à l'ensemble de la proposition et de l'idée. Le nombre exact de personnes et de processus est donné de manière claire et aucune réflexion n'a été gaspillée pour trouver la meilleure façon d'aborder le problème. Le budget est exposé clairement et décomposé de manière directe afin qu'il n'y ait pas de confusion ou d'éléments trompeurs. Plan simple : verser des salaires à des personnes pour qu'elles effectuent un travail pendant une durée déterminée. La proposition offre un calendrier réaliste pour terminer le travail, et des incitations à faire le meilleur travail possible en écrivant des documents et en formant de nouvelles personnes. Il y a un plan raisonnable pour la mise en œuvre de la proposition et des étapes fournies à suivre. Les ressources nécessaires à la mise en œuvre sont abondantes, car une partie des outils est déjà réalisée, et une analyse approfondie a été faite sur ce qui est nécessaire ainsi que sur ce qui dépend de quel défi et de quel retour d'information.  Les défis que la proposition pourrait avoir à l'avenir comme la perte de personnes en raison du manque d'environnement stable est un problème sérieux, mais les proposants ne déçoivent pas. Ils ont pensé à tout, j'ai l'impression. Le projet est en parfaite harmonie avec ce qui a déjà été fait. Et veut construire par dessus comme il se doit.", "q1r": 5, "q2": "La traçabilité du projet sera facile à suivre car les proposants ont mentionné plusieurs endroits comme discord qui peuvent être utilisés non seulement pour suivre mais aussi pour interagir avec différents membres intéressés de la même communauté. Les mesures et les indicateurs clés de performance sont également mentionnés et une attention particulière leur a été accordée. Il existe des objectifs clairs, réalistes et mesurables, comme celui de fidéliser les personnes avec lesquelles vous travaillez en leur offrant le bon écosystème pour qu'elles restent. Il y a une feuille de route avec des étapes simples mais facilement compréhensibles et traçables. Il y a une description claire du problème à résoudre et de la solution proposée.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "Among the proposals in this challenge, this proposal is exemplary in its alignment with the mission of Challenge. The proposal aims to contribute to an open source ecosysteem as a whole, rather than proposing an open source solution to a single problem. Educating and onboarding new developers into the ecosystem while they help build on open source tools is a very direct and effective way of addressing the challenge. The efforts of the Gimbalabs team have been a cornerstone to the current Open Source Ecosystem in Catalyst", "q0r": 5, "q1": "This is a continuation of an ongoing effort and the team has shown capable of organising these efforts succesfully. Clear details are also provided in the proposal itself about the team.\r\nThe proposal includes a clear roadmap and achievable plan. The proposal could have included more details on the trajectory and expected activities of the 2 Developers.\r\nThe team has shown that this format is working so far, however success does rely on continued efforts from the 2 Developers being educated. Perhaps in the future the plan could include some details on contingency in case of a drop-out along the way and how funds are distributed (e.g. as montly salary or upon completion)\r\n\r\nThe budget will be used to provide a fair income for the 2 developers adn facilitation. The majority of the funds are destined for other people then the proposers. However the total funds are ~1/3 of the total budget in the challenge. This is not excessive but definitly on the high side. (This was weighted less in scoring due to the more altruistic nature of the proposal)", "q1r": 4, "q2": "Because the proposal focuses specifcally on two developers, the progress of proposal  should be clearly trackable through their contributions to open source projects and future continued efforts. \r\nThe efforts that are currently ongoing include 2 weekly public sessions where other people can observe. This makes the proposal transparent and auditable.\r\nFurthermore the Gimbalabs team has shown commitment over the past year to regularly provide updates through their social media channel on all their ongoing efforts.\r\nFor accountability some information could have been included in how the work will be the developers will be organised. For example, some indication of who/what will decide which projects or tools the developers will work on.", "q2r": 4, "assessor": "z_assessor_587", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "GMBL hopes to continue their work of engaging community development to solve the coming \"tidal wave\" of Cardano expansion. The proposal seeks funds to move 4 volunteer developers to full time paid positions for four months. This is an interesting request but I think that it is a logical step in the evolution of Gimbalabs and Catalyst. As Catalyst fund sizes grow, it makes sense that incubators like gimbal should be able to jump-start developers who have proven their potential through project based learning. This may be the capstone moment convincing junior developers to embrace Cardano full time, which is exactly what the ecosystem needs. ", "q0r": 5, "q1": "Gimbalabs have been around since the early days of Catalyst and grown into a valuable incuabator for new Catalyst developers. Interesting projects have emerged. This is a very straightforward proposal requesting funding to pay new junior developers. I have no doubt that gimbal has talent in their discord worthy of being paid full time, and valuable projects to which they can allocate those skills. ", "q1r": 5, "q2": "The success metrics are outlined for 3,6, and 12 months and it should be easy to track if these developers go on to add value to the ecosystem. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 4, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Aidez les développeurs expérimentés à devenir des experts du développement de la blockchain Cardano.", "experience": "Vous avez fait vos preuves en matière d'intégration de nouveaux développeurs dans l'écosystème Cardano en leur fournissant des outils essentiels et des possibilités de collaboration."}