{"id": 384527, "author": "vivek", "title": "Dataset - Stake Pool Analytics", "url": "https://cardano.ideascale.com/a/dtd/384527-48088", "category": 26251, "amount": 10080, "description": "Les explorateurs de blocs ou les sites existants ne disposent pas actuellement d'ensembles de données historiques complets sur les réserves de piquets pour l'analyse et l'apprentissage automatique.", "funded": 2, "upvotes": 54808984, "downvotes": 15076497, "votes_result": 39732487, "votes_cast": 143, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Outil qui obtiendra des données à partir de multiples sources de données sur la chaîne et externes qui fourniront des analyses sur plusieurs sujets liés à l'exploitation de la piscine. La proposition est adaptée aux paramètres du défi, offrant une éducation et une croissance pour la communauté et les SPOs pour être précis. Il y a des exemples clairs de la façon dont le projet ajoutera de la valeur à l'écosystème de Cardano en amenant plus de personnes à devenir SPO en les éduquant sur la crédibilité de l'ensemble de l'opération. Il n'y a pas d'indicateurs clés de performance et de mesures du succès, ce qui est étrange si l'on considère que les proposants font une proposition analytique. En tant que développeur moi-même, je pense que ce projet serait capable de s'adapter à une croissance potentielle (techniquement parlant).  C'est une pièce qui manquait dans l'écosystème, et beaucoup des FS actuels ont dû trouver des solutions par eux-mêmes, ce qui est difficile et n'est pas donné à tout le monde.   ", "q0r": 5, "q1": "Les compétences concrètes et les personnes qui effectueraient le travail sont mentionnées. Je les ai trouvés sur linked in et ils semblent légitimes, tous les diplômes et les compétences correspondant à ceux décrits dans la proposition. Un chemin clair pour la mise en œuvre de la proposition est montré. Un seul bémol : le lien manquant vers le dépôt Github mentionné dans la proposition (où tout le code sera placé). C'est un petit effort pour faire un repo vide, mais c'est payant. Le budget pourrait être mieux décrit. Il y a une certaine ventilation par tâches à effectuer, mais aucun raisonnement n'est donné derrière les sommes spécifiques. Je m'attendais à des taux horaires pour le développement comme toutes les autres propositions, parce que c'est logique. C'est un peu bizarre de donner un prix pour le développement d'une autre manière parce qu'il est difficile de prouver qu'une fonctionnalité pourrait être plus ou moins chère par rapport à une autre. Il y a un calendrier réaliste, c'est certain. Je ne doute pas que les proposants se débrouilleront avec l'horizon temporel actuel. J'espérais une sorte de document technique sur la mise en œuvre, mais ce n'est pas grave s'ils n'en ont pas. Cela aiderait cependant les geeks comme moi.  Les aspects techniques sont un peu flous pour moi et je serais intéressé à aider si je savais quel était le plan. C'est la beauté de l'open-source. Les auteurs n'ont mentionné aucun type de risques ou de défis attendus, donc je suppose que soit c'est très simple, soit ils n'y ont pas pensé.  ", "q1r": 4, "q2": "Il manque un dépôt github ou un endroit unique pour suivre l'avancement du projet, mais en toute honnêteté, les auteurs ont mentionné qu'ils allaient faire un dépôt github. Je ne suis pas sûr de savoir où ils vont poster leur dépôt github et comment ils vont le mettre à la disposition de la communauté après le financement ? Ces questions pourraient être évitées en liant simplement un repo github vide dans la proposition. Aucune mesure ni aucun indicateur clé de performance, ce qui est plutôt décevant compte tenu du type de proposition. Il y a une feuille de route et des jalons clairs pour le temps prévu, donc pas d'inquiétude à ce sujet. La description est claire et compréhensible pour les non-techniciens, ce qui est une bonne chose. La solution est également bien écrite.  Le projet bénéficierait grandement à la communauté Cardano s'il est réalisé avec le bon niveau d'inclusion de la communauté. Bonne chance !", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Availability of ready-made chain datasets will encourage ML researchers to develop insights and promote Publications on Cardano. This also has the potential to be out the superior technology of Cardano. The direct impact is debatable, and data updating will also be necessary. \r\nHowever, the data is currently available in PostgreSQL and is relatively comprehensive for meaningful research. The proposal will build a snapshot of the current state, and the proposers have not included details regarding will they maintain the dataset for a specified period. ", "q0r": 3, "q1": "The proposers are SPOs and have more than 15 years of software experience. The task is relatively simple and does not have significant risks. Therefore they should be able to do it. ", "q1r": 5, "q2": "The task analysis is fairly comprehensive and it requires the effort of two programmers with ML/Deep learning backgrounds for at least a month. The amount requested may be fair and comes to about USD 5000, which can be considered marginally higher. However, data science is a high-paying area and the talent required to satisfy community requests might justify the fund requested. More details on the baseline of the data source would have added clarity to the proposal. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The challenge asks for open source projects and they are going to develop a public data set for pools so, this will be very useful and is exactly open source for developers this addresses perfectly the challenge", "q0r": 5, "q1": "The plan is well detailed and divided into steps, for each one they have the budget needed so this shows that they have very well planned each part and what the development of this will suppose. About the team, they provide their names and explain their experience in the field so reading it conveys a good feeling that the project will be carried out", "q1r": 5, "q2": "They do not provide any information to audit the progress. The success is not measurable by any indicator provided so will be very difficult to audit the succes. There are not even performance indicator so I cannot give a good mark here.", "q2r": 2, "assessor": "z_assessor_547", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This project will develop an open-source code for generating an analytics dataset then showing off a full historical stake pool dataset for targets who wants to analyze it. This project will help to the development of a stake pool in Cardano more effectively, and means will help to grow the Cardano community a lot because the staking pool is one of the key development models in Cardano network. But the proposer should add some more info about key metrics to measure the project success. ", "q0r": 3, "q1": "The proposer shows a very detailed roadmap that clarifies all the work that has to do, even this project is very simple to compare to others. Hence, their budget is fit with the roadmap \r\nWith the experience of the team that the proposer show in the proposal, I think they can do it. ", "q1r": 5, "q2": "The proposer provides a detailed roadmap for auditing the development progress easily. But the proposer doesn't add some key metrics to help people know what success will be looked like when this project goes public. \r\nAbout the problem and solution, the proposer made a good detailed explanation about that. The proposer also listed some questions that help me understand why users need the solution of this project. \r\nLast but not least, I think the proposer should show some potential risks that this project can meet in the implementation plan, that will help them have some backup from problems. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "There is so much hidden valuable information stored in the Cardano blockchain and at the same time the open source developer ecosystem strongly needs contributions in the analytics domain.", "q0r": 5, "q1": "The experience and track record is present and strong. I see a small risk (what may not have to realize), when the plan includes 'collaboration with community on requirements' - is there enough resources planned for that? Currently the community only has to hope that the experienced team comes up with nice result, but the proposal does not present the actual plan in sufficient detail. ", "q1r": 4, "q2": "Would have been full score if there would have been some KPI or indication how many views or queries will be resulted. Six specific queries included in the proposal can be verified easily, but by themselves might not justify the 8 weeks.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Référentiel de code source ouvert pour la génération d'un ensemble de données analytiques à partir d'un mélange de données db-sync sur la chaîne et de sources de données externes.", "experience": "Fondateurs de Cardano Canucks et Canuckz NFT avec plus de 30 ans d'expérience dans l'infrastructure de données, l'analyse et la visualisation pour les entreprises."}