{"id": 366705, "author": "", "title": "GIST - Cardano / Polkadot Bridge", "url": "https://cardano.ideascale.com/a/dtd/366705-48088", "category": 26103, "amount": 15000, "description": "Smart contracts ecosystems should be able to pass messages. For example, allowing users to pay with BTC while contracts are run on Cardano.", "f6_no_assessments": 8, "f6_rating": 2.375, "videos": [], "media": [], "f6_assessments": [{"q0": "'- I really liked the idea and the problem is well stated. It's very important starting to develop nowadays, and even more if we think in scalability and in the growing potential, the inter communication among the different ecosystems. Therefore, it's vital, for a growing community, such as Cardano, to be able to communicate and operate with others systems. The idea is consistent with the campaign briefing.\r\n- The problem and the intention is clear stated and the proposer make clear how the development of this idea will help the Cardano ecosystem.\r\n\r\n- The scalability in this proposal is great. If it works, the interoperability will allow users of several other system to use the backbone of Cardano.", "q0r": 5, "q1": "'- In order to know whether this project will be successfully implemented or not it is desirable that the proposer shows some proves of his work, since he is the only developer. \r\n- Other thing that may be worth to be incremented is the budget – add more details about it, e.g. the technical equipment, or software or which 'Outsourcing for non-technical components of the project to speed up project delivery date'. This would help us to imagine if the proposer is asking enough fund or not and, if not, if the project will stop or if would be possible to continue with it.\r\n- The timetable provided could be more detailed, a more step by step approach.\r\n", "q1r": 4, "q2": "- In order to be more auditable, it's important to give more details in between the milestones given (3, 6 and 12 months). It would be desirable if you gave us something to verify the progress between these.\r\n- As said before, it could enrich the proposal if the proposer added a methodology to quantify the usage of this bridge, counting the use of it. As stated, the overall liquidity would grow, however, as long as the ADA is gaining visibility, it will attract more investors and it'll have the same practical result. Therefore we need to imagine a way that guarantee the we're growing because of this product and/or there are more and more people using this bridge. (maybe adding a way to count the usage of the project)\r\n- I am missing the key metrics in this proposal. A way to verify if the community is growing because of this project or if there are a considerable amount of people using this application. A way to do this may be measuring the amount of requirements to enter in the Cardano environment or the opposite, requirements from the Cardano network (really don't know how it would be implemented – maybe to check the 'head' of the protocol (if such thing exists) - but it's a way to be sure that this project is being used).", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 10, "ne": 7, "ng": 1, "nfo": 2, "vca_o": 2}, {"q0": "This proposal was supposed to WITHDRAW.", "q0r": 1, "q1": "See below.", "q1r": 1, "q2": "The proposer says in the comments section: \" I am going to resign from this funding round to let other projects get the funding they need and come back with another idea next round.\"", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 10, "ne": 2, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "The proposal effectively addresses the challenge as it proposes an application which facilitates integrations, thereby increasing access to the Cardano ecosystem. The proposal proposes \"passing messages\" between Cardano smart contracts and other ecosystems. Given that interoperability has increased usage of platforms it is the view of this reviewer that a successful implementation of this proposal will result in increased functionality for Cardano users, as well as enabling others in ecosystems outside of Cardano to use Cardano. Perhaps it would be good if the Idea Submitter could explain why Cardano is a good system to hold the smart contract. \r\n\r\nAlso, I have 20 years experience negotiating legal contracts. So when I read of the possibility to pass messages I am interested not only in passing messages like pay Y 1000 ADA, but also pay Y 1000 ADA after a message has been received confirming compliance with a condition, or once a certain date has been reached. This type of functionality would be useful. E.g. Pay Y 1000 ADA when [system] messages the smart contract that the date is 1st January 2024.", "q0r": 5, "q1": "As a non-coder, I cannot say whether or not the timeframes are viable. However 12 months to get to a fully functioning website seems possible, though the budget appears to be small in size for this endeavour. There is also another issue which is in the comments for this idea = the Idea Submitter says that they are going to resign from this round and resubmit next round. If this is the case it is unlikely the proposal will be implemented successfully for this round. I suggest providing more granular detail on how the proposal will be achieved in the next round.", "q1r": 2, "q2": "I do not think there is enough information to audit the progress and success of the proposal. The 3, 6 and 21 month milestones are fairly broad in how they are defined rather than being specific.\r\nAlso I suggest that next time the Idea Submitter provides more detail on how and when the budget will be spent. Provide actual dates, don't just say that a bridge will be complete by Feb/March. Which is it, the 1st February or the 31st of March. What properties will the bridge possess? Also the proposal talks of creating a bridge and a dev kit on the one hand yet in another section it speaks of a website by month 12. What exactly will the funding pay for? The bridge, the toolkit or the website? Please be more specific in the next round. ", "q2r": 2, "assessor": "z_assessor_404", "no_vca": 8, "ne": 5, "ng": 1, "nfo": 2, "vca_o": 2}, {"q0": "This Proposal addresses the challenge very well ,  Increase in Liquidity will be beneficial to the Cardano ecosystem, having a bridge to other blockchain will increase the adoption of cardano , for that I score 5 ", "q0r": 5, "q1": "The Proposer seem to have relevant Technical Experience with cardano blockchain ,  A Plutus Pioneer Class 1, Alonzo Purple Participant is a valuable experience to the successfully implementation of this Project but there is no additional information to back up the claim , No Github or Linkedin to proof the Skills , for that I am neutral", "q1r": 3, "q2": "I think the proposer is mixing the road map with the definition of success , There is no launch date,  The information  provided is not enough to successfully audit the progress of this proposal , for that i score 2", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "Project comments indicate that this is proposal withdrawn.\r\nToo similar to dcspark proposal.", "q0r": 1, "q1": "Project comments indicate that this is proposal withdrawn.", "q1r": 1, "q2": "Project comments indicate that this is proposal withdrawn.", "q2r": 1, "assessor": "z_assessor_434", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The creator has voiced his plan to withdraw the idea for this round as per the comment from 26.08.2021: \"I am going to resign from this funding round to let other projects get the funding they need and come back with another idea next round.\"", "q0r": 1, "q1": "The creator has voiced his plan to withdraw the idea for this round as per the comment from 26.08.2021: \"I am going to resign from this funding round to let other projects get the funding they need and come back with another idea next round.\"", "q1r": 1, "q2": "The creator has voiced his plan to withdraw the idea for this round as per the comment from 26.08.2021: \"I am going to resign from this funding round to let other projects get the funding they need and come back with another idea next round.\"", "q2r": 1, "assessor": "z_assessor_488", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "the proposer resigned from this funding round.", "q0r": 1, "q1": "the proposer resigned from this funding round.", "q1r": 1, "q2": "the proposer resigned from this funding round.", "q2r": 1, "assessor": "z_assessor_560", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "I think is a factastic idea and one that will bring interoperability in the Cardano ecosystem. The bridges solution could help ecpand Cardano smart contract capabilities and the NFT marketplace as well as future adoption in Africa.", "q0r": 4, "q1": "Given the details and experience in Plutus and as a software engineer I can see this proposal deffinitly implementing what it set out to accomplish and the funds are quite modest and detailed.", "q1r": 5, "q2": "The project is an integral part of the space and when you want to expand with smart contract interaction with other ecosystem only makes Cardano stronger and more efficient taking on strength of other projects and aligning it to become a hub.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Create a smart contract on Cardano / Polkadot to facilitate messaging. Create a multilanguage open-source package so other devs can use it.", "experience": "Software Engineer, Plutus Pioneer Class 1, Alanzo Purple Participant."}