{"id": 366822, "author": "", "title": "ccwallet.io - light web wallet", "url": "https://cardano.ideascale.com/a/dtd/366822-48088", "category": 26103, "amount": 30000, "description": "The main Cardano wallets lack quality-of-life features that the community desperately wants.", "f6_no_assessments": 2, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "- I really like these projects which aim the simplification of things. I believe that if we want something to scale, we need to make it easy. Only by this it would be possible to make everybody feels comfortable to use the tools and enter in some environment. \r\n- One thing that was not clear in the proposal is that it says that you take features requested by the users and community members and implement it, however it's not stated what is the plan if, hopefully, your wallet grows bigger than you're capable of answering – imagine a scenario in which you're receiving thousands of requests per month, how are you will be able to read them, separate what is really important, etc. \r\n", "q0r": 4, "q1": "- It seems to be very feasible since it's already running some functionalities and you're willing to contract another developer to help you. \r\n- Some data that I would like to see are: how many active users you already have or a growing graph; number of transactions per time; number of requests/suggestions per time. These would aggregate meaning to those who does not use the platform yet.\r\n- Another point that might add value in this proposal is to add the method that you're planning to get the things done, e.g. multi-delegation: planning to achieve this doing this by that method, otherwise those 'desires' in the proposal are just dreams and desires.\r\n- One thing that you might add in the proposal is the explanation of how are you going to monetize in order to continue adding value to the wallet by adding functionalities. Since you're asking money now to pay the development, after the fund what are you going to do, since the plan is to continue adding features asked by the community.\r\n- And there is the scalability point which I've already mentioned. If you start to receive thousands of requests, are you going to be able to review them all?", "q1r": 4, "q2": "- One thing that should be added is a timetable of the desirable functionalities that you want to implement. That way we should be able to verify if you are really working.\r\n- It would be great if you have some way to show the growing of the platform (# of wallets (maybe per time), # of transactions, etc)- One thing that should be added is a timetable of the desirable functionalities that you want to implement. That way we should be able to verify if you are really working.\r\n- It would be great if you have some way to show the growing of the platform (# of wallets (maybe per time), # of transactions, etc)\r\n- Maybe adding a place that shows us that you're reading the requested features and is actually dev them would be nice", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 8, "ne": 5, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "This isna great idea and one the community desperately needs to create a more robust product capable of incorporating the growth of Cardano Alonzo capabilities while also being user friendly to the newcomers. More detail as to the plan and perhaps visuals to highlight the key concepts of the project needs to be presented.", "q0r": 3, "q1": "Although there is some experience shown  in the solution to the challenge presented more details are required on how to get there. What language is used? what is the step by step process and KPIs to access the progress of such development.", "q1r": 3, "q2": "There are no timelines present besides the 4 month workflow determined by the fund allocation. Will the host list be implemented by 4 months of development? what are the stages of implementation or how to measure progress of the solution presented needs to be more clearly specified.", "q2r": 3, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "By implementing features requested by the community, we will strive to be the innovative light wallet for power users and newcomers alike.", "experience": "We've already implemented many features that are missing in today's wallets: NFT display, better token processing, address book etc."}