{"id": 366809, "author": "", "title": "ADAPlus.io - Mass payments system", "url": "https://cardano.ideascale.com/a/dtd/366809-48088", "category": 26103, "amount": 30000, "description": "A mass payments system that allows you to save time and money. Send numerous transactions for the price of one.", "f6_no_assessments": 8, "f6_rating": 4.625, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal will be implemented successfully based on the experience and plans of the proposing team, though I suggest more information be included within the proposal regarding the relevant experience of the proposer in managing initiatives of this nature, as well as a more detailed plan and budget for the task described.", "q0r": 4, "q1": "According to the plans and experiences, this proposal might be likely be successfully implemented. There should have been more information about the proposer's experience with Plutus and Haskell, as it is a proposed development work and architecture. There is a lack of costs breakdown and financial detail and milestones in the realization plan, according to my assessment.", "q1r": 3, "q2": "Congratulations on the video and all the presented details. Would you be able to break down which kind of projects costs and risks?", "q2r": 3, "assessor": "z_assessor_243", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is relevant and would have a great impact in Cardano ecosystem. Usefull and innovative ways to pay are always welcome in our globalized world, even more when they has the proposal of decrease the costs envolved on the transaction. When we talk about facilities of payment transactions, the market in general tends to embrace easier the chrytocurrency that provides that facility. \r\n", "q0r": 5, "q1": "By the explanation given in the proposal, I believe the team of co-proposers is able to make the project happen. But, as a not specialist in programing, I don't know if USD30,000 is enough for all the project. The phases and their respective costs could be better explained.\r\n", "q1r": 4, "q2": "This project can be audited by the metrics of the Cardano mainnet, testnet, and a guild network that the co-proposers are going to provide to the community test and see how the platform works. Furthermore, websites and platforms are able to have some metrics that show how is the acceptance of the community with the system and how many transactions each person is doing, for example. I really think the project is easy to audit. \r\n", "q2r": 5, "assessor": "z_assessor_409", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal can offer a solution that can be used by other wallets. Sending funds to multiple addresses at one can save people ADA. With the current ADA price there is already a demand for a solution like Adaplus.", "q0r": 5, "q1": "The proposal is a great implementation of what blockchain data can provide with a proper analysis. Current state of the proposal is a working website with the proposal information and pool rewards calculator that works with the real blockchain data.", "q1r": 5, "q2": "The proposal is structured and the roadmap, including a marketing strategy, is provided. More measurable key metrics could be added to audit the progress. Some points like \"Active FE and BE development\" are not very clear.", "q2r": 4, "assessor": "z_assessor_436", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Adaplus is more of an analysis solution that can be in demand in the market as it grows. The wallets analysis looks pretty promising. We don't need another blockchain explorer, but the user/wallet explorer is something we don't have yet.", "q0r": 5, "q1": "Some parts of the proposal depend on external solutions. Therefore, the team has provided risks involved with possible integrations. The team has also provided possible solutions in case agreements will not be reached.", "q1r": 5, "q2": "The proposal mentions onboarding larger companies to start using Cardano for payments. I think the number of such companies can be a crucial metric of success. ", "q2r": 5, "assessor": "z_assessor_446", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "since the key metric for this challenge is attracting users to the platform, this proposal can attract new companies to use payments in ada.", "q0r": 5, "q1": "the current website looks pretty clean. at the same time, it already has a tool to calculate potential delegator rewards for any epoch. It also provides copy-paste bash commands to send ada to delegators.", "q1r": 5, "q2": "marketing stage 3 does not have any time mentioned. it would be better to describe the marketing stage in addition to educational materials.", "q2r": 4, "assessor": "z_assessor_448", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "Improves Cardano ecosystem by working with payments. Big companies may need such products (maybe using API) for performing mass payments to clients.", "q0r": 5, "q1": "The prototype is publicly available and can calculate possible rewards for any existing pool. You can just set ROI percentage and see how much rewards any delegator would get.", "q1r": 5, "q2": "All parts are well described and the roadmap looks realistic. Most risks and obstacles are presented for wallets integration. I think it's a big task to get onboard developers of Yoroi, AdaLite etc.", "q2r": 5, "assessor": "z_assessor_545", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is a phenomenal development and one that can save money to the ever growing adoption of major players. Banks fortune 500 and investment firms could see huge benefits in future adoption models of opting for something like this to send funds and save in the process. The solution presented is well explored between the entry, intermediate  and expert level arguments. Is great that the transparency one is developed over the other 2.", "q0r": 5, "q1": "The experience presented is quite vast and well thoughtout. The degree of technical innovation is warranted. The team shows confidence with their develooment team and their exploration of different solutions to solve its challenge presented.", "q1r": 5, "q2": "The proposal has great metrics and a stage by stage plan in arriving to its solution. The only thing I would say is to detail a breakdown of hiw the funds are distributed for more transparency in the monetisation of each stage of the process.", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "This project has potential to bring utility by companies into Cardano space. The more adoption we get, the more it will be in demand.", "q0r": 5, "q1": "There is another project by the same team that already has a working service. Given that it is highly likely to be implemented. The provided online calculator is working with real blockchain data.", "q1r": 5, "q2": "The description is very detailed and risks are well described. I would also like to see CIP improvements that are mentioned in the roadmap.", "q2r": 5, "assessor": "z_assessor_595", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}], "solution": "Creation of a system that combines several transactions into one and reduces fees. Marketing tool for pool operators and all users.", "experience": "Two co-proposers. Over 15y of experience as architects and software engineers, entrepreneurs, marketers. From the developer of CardanoWall."}