{"id": 366967, "author": "", "title": "Cardano Credit Card", "url": "https://cardano.ideascale.com/a/dtd/366967-48088", "category": 26103, "amount": 70000, "description": "ADA holders can not leverage their ADA the way they can leverage traditional financial assets.", "f6_no_assessments": 5, "f6_rating": 3.599999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "- It's exciting seeing this kind of proposal, one which wants to bring together the traditional financial environment. That is mandatory in order to make the crypto world more popular.\r\n- It clear articulate how it would benefit from using Cardano system end how Cardano community would gain from it as well.\r\n- I've read the website from connect financial and I could not encounter the information about how many users it already has. Since I do not know the card, it would be a great information to help me evaluate how many members it would bring to ADA environment on the spot.", "q0r": 5, "q1": "- Since it's already working using the Etherium ecosystem, I imagine that is pretty feasible with ADA as well. \r\n- Since you still do not have the dev, it's quite hard to judge how long it would take to make the integration, which are the milestones that we should be waiting and when, e.g..\r\n- The budget of $70K will be only used to pay the dev, or there's a part of it that will be used to buy some software, for example?", "q1r": 4, "q2": "- I am missing some roadmap and milestones. It's said in the \"Definition of Success\" that there will be some functionalities in the end of Q1, 2022, however, it would be useful to add some important marks on the way in order for us to verify the progress.\r\n- Also in the \"Definition of Success\" is said about a 'Significant Adoption'. What is the number? What do you imagine that is significant?\r\n- It would be great if you display the info about the adoption and cash flow. This data would be useful to measure the success and impact of this proposal into the environment.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This would be a worthwhile and useful dapp and would be interested in it myself. Many ADA holders HODL, and this would present another way of utilizing those holdings. It would seem the bigger Cardano community benefit of this would be to provide a bridge for this CNFI to leave the dark side of ETH and come to the ADA light side. This could, for $70K, provide another product to secure more bragging rights and to show another financial asset using Cardano/ADA.", "q0r": 5, "q1": "The experience and plan has many variables that lead to success. Connect Financial already has had a rollout and what seems to be success with their ETH card. For $70K Catalyst could assist in placing itself on another website, another asset offered on its crypto card.", "q1r": 4, "q2": "For $70K: I would have liked to have seen a video. I think the information sufficient, but would have liked some more solid examples on this DevOps, even if just examples of possible candidates. However, this doesn't mean the information provided in insufficient: just seems like it could be useful to list some of the needed qualifications of this DevOp since so much of this proposal centers upon their involvement.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is to provide credit in the form of an International Visa Card by allowing ADA to be used as collateral without the need to liquidate assets. The challenge is adequately addressed.", "q0r": 5, "q1": "Would like to see a more transparent team with credentials to successfully complete this proposal. This plan does require successfully hiring a lead developer to implement the project.", "q1r": 2, "q2": "The proposals definition of success is to complete Bridging of Connect Financials Staking, Treasury and Yield Protocols to Cardano by the end of Q1, 2022. Also to have significant adoption and use of Connect Financial products and services by the Cardano community. Some of the key metrics will be easy to audit (Visa Card availability), while others may be a bit more challenging to determine if the project is a success.", "q2r": 4, "assessor": "z_assessor_449", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Coming up with credit card facility on cardano would be great things but there are few things that can made more clear and given more priority . Like insted of bridging and staking , the proposal should more focus on the plan to launch the credit card and issuing to the mass users.", "q0r": 3, "q1": "Teams claim of having decades of experience in finance sector so think there should more clarity on the product specification and implementation.", "q1r": 3, "q2": "I think if there should me more details about the product development and planning. It would be great to have a roadmap and deatils about how funds will be used.", "q2r": 2, "assessor": "z_assessor_538", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The project has the potential of creating, or migrating over, a large number of future Cardano users. Mass adoption and scaling are possible to an unknown extent as no information has been provided indicating current uptake, usage, interest or other metrics.", "q0r": 4, "q1": "The project supports the challenge and is already active elsewhere. A budget is indicated without much detail. There is a lack of external links or useful attachments.", "q1r": 3, "q2": "The delivery date is provided as Q1 2022. An actual month is preferable due to the varying nature of business calendar years. The proposer fails to indicate potential risks to include regulatory. Again, no links are provided in order to assess registrations or other supporting evidence of risk mitigation.", "q2r": 3, "assessor": "z_assessor_591", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Provide credit in the form of an International Visa Card by allowing ADA to be used as collateral without the need to liquidate your assets.", "experience": "Our team forms decades of experience in Financial Technology, International Banking and Compliance industries."}