{"id": 366929, "author": "", "title": "Token Allies: Business Tokenization", "url": "https://cardano.ideascale.com/a/dtd/366929-48088", "category": 26103, "amount": 20000, "description": "In this modern society It is still hard for businesses and start ups from all over the world to get quick and easy access to funding.", "f6_no_assessments": 7, "f6_rating": 3.285714285714286, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is innovative and I think this has potential to show the distinctive features of Cardano such as native tokens and low fees. \r\nFor example, doing the same thing on Ethereum would be more difficult as a simple swap costs in the like of 20$ currently, and this could significantly impact users which want to trade smaller portions.\r\nAs the only suggestion, I would add a note detailing possible means of tokens appreciation and value for investors", "q0r": 4, "q1": "The plan and the experience listed sound reasonable, even though I would suggest for next time to include some of the project you've worked on in the past, so that voters have something for comparison.\r\nAnother point which I think could be improved is the status of the project.  The plans list Q1 2021 as the execution phase of the project but it's not clear if it's already done or the timeline needs to be updated. (Btw, it would  have been impossible to have it built on Cardano at that time without smart contracts). If parts of the project are already developed, a mention on what you will use the funds for would help voters in their judgement", "q1r": 3, "q2": "The proposal is lacking explicit success metrics. While you can derive some from the timeline of the project, better defined one will definitely help in later phases. For example, a metric could be the amount of ALLI purchased in the first X months from launch, or  the number of companies onboarded in the project.\r\nIn addition, the number of unique users/investors and the amount of transactions made could be used as well.", "q2r": 3, "assessor": "z_assessor_131", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "- I enjoy the idea of tokenization. Allowing all sort of \"willing to be\" business adopt a tokenization funding is amazing.\r\n- One point that I would like to be more worked with is the actual goal and target: there are times we do not have the money even to start and, saying that, are you going to crowdfund someone who already have something to show or is already running, or we're aiming just an idea?\r\n- Another point is: Why are you filtering whoever decides to enter in the platform? Why don't make it completely decentralized? ", "q0r": 4, "q1": "- One thing that is troubling me is: Suppose there is an idea that I think could be promising and decide to help, giving them USD 1K, however, to start running they need 100K. Is there the risk for me to lose the money at the same time they don't get more funding? \r\nMaybe adding a functionality with smart contracts that it waits certain amount of time for me, who is investing, to let the money there and for the idea to have more time to attract more investors, then, when the idea reach some margin that they can start with, they receive the money.\r\n", "q1r": 3, "q2": "what are you expecting to be a success (# of proposals, funding, etc), what is a desirable flow of money and in which interval of time?\r\n- I`m missing some better detailed roadmap with some milestones. ", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is a brilliant idea and has the potential to be a game changer for people who ordinarily wouldn't have access to funding. \r\nI see that this is currently on BSC with the plan being to migrate towards the end of the year, which is great. \r\nThis has the potential to grow the user base, network utility and value however, as this is currently on BSC and not Cardano, I do think there should be additional details as well as firmer timelines both here and in the detailed plans on when the switch to Cardano will happen. \r\nAlso I see the purchase of ALLI will happen through stable coins. Will that change when the switch to Cardano happens? Would purchase of ALLI happen through ADA? As that would improve the circulation of ADA. \r\nI believe one definition of success and done that could help this proposal would be the successful migration of ALLI Token from BSC to Cardano. ", "q0r": 3, "q1": "There isn't any information outside of tentative timelines on when the switch to Cardano will happen.\r\nIt isn't shown on your roadmap for 2021 nor is there any mention of what could happen if there are difficulties in transitioning to Cardano. It would be great to see more details on this. The funds requested and the overall plan seem to indicate going to your team as is and I don't see any marked for the transition to Cardano. Based on this lack of information, I don't expect a successful implementation on the Cardano network", "q1r": 2, "q2": "You have a great project, great in its use case and its objectives, the only gap I see here is a reference to Cardano utilization and implementation which outside of a reference to the end of 2021, says nothing additional. \r\nYour proposal and your work is great, but it is on BSC and this proposal could focus more on the project to migrate to Cardano while referencing the excellent work you have done and are doing on BSC.", "q2r": 1, "assessor": "z_assessor_423", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to create a site for enabling entrepreneurs in organising token sales to raise funds for their business. This proposal can be seen as a variation of crowdfunding. The proposal is also enables staking and voting rights. However, the distribution of profits via smart contract and other related activities are not explicitly expressed. Overall the site has a utility and addresses an important requirement. ", "q0r": 5, "q1": "The website of the proposer list four people in the management; however, the background and the experience of the people were not explicitly mentioned on the site. Based on the designations, it can be inferred that the team has the necessary strength to complete the project. ", "q1r": 4, "q2": "The amount requested is reasonable; however, the set of features in the software that are expected to build using the funds are not explicitly clear. Will they open-source the software build is also not clear. However, based on the features considered mandatory for the token sale, it can be said that it will be easy to audit the project but difficult to measure its success of the project. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This team wants to create a platform for business to create manage and sell their equity tokens. They are talking about quick funding. However, from my own experience it is the due diligence process that makes a start-up funding so long and difficult. But this is necessary process. So offering tokens as a startup doesn't mean that you get good money for that. Because real investors still want to go through this process to be able to know if their money is invested sustainable und secure. How do you address this issue? Furthermore, there are already some projects with aiming the same goal. How do you differentiate from them? What is your additional impact?", "q0r": 3, "q1": "Creating such a platform is one thing but running it successfully and getting a lot of traction on it, is a different story. But the go-to-market strategy is missing. Also the legal side of running such a platform is not described. Also the technical aspects of the platform are not described, and we don't even find a reference of this team if they are capable of building and running this platform.\r\nOverall, based on the provided information this project looks more like an idea rather than a something ready-to-go. For a higher rating of the feasibility, the community needs more precise information. \r\n", "q1r": 2, "q2": "The team presented a roadmap and a timeline, but the deliverables are overall very vague. For example: 'presale and exchange listings. It is easy to just name it and say what you do. But for auditability we need to know 'how are you doing this'. To further improve this proposal, I recommend to add a documentation source, so the community can track the progress of this project. Also it is not defined how success would look like for this project. So adding some real KPIs would help. Based on the given information auditability is not really possible. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "I thought the idea was very good, fitting perfectly with the challenge's objectives. Here we have the beginning of a business that will certainly only grow and become more important with the blockchain growth, than the process of creating tokens for companies' products/services. dapp promises to create one that will facilitate both the process of creating the tokens and the financing of companies, which according to the authors is still a complicated process. I would say that it is of paramount importance, and despite not using ada (they have their own currency), the authors intend to store information in the Cardano blockchain, thus favoring our community. If dapp becomes popular, the growth of our blockchain usage will also be exponential. In addition, there is already a website for the project, as well as social networks created for it. Instagram's profile is very beautiful, containing a strong visual identity and being a good bridge between the project and society. I really found a very interesting proposal!", "q0r": 5, "q1": "Regarding the proposal authors, we know what they are capable of doing, but regarding the detail, unfortunately I felt that this part left a little to be desired. As happens in several proposals that I evaluated, here we have a practical demonstration of what they do, through the website, the explanations of (which I will comment below) and the social networks attached. But there's not much development regarding who they are, neither in the proposal description nor on the attached website. We know very little about who they are. It would be good if they included where they had their backgrounds, examples of previous work, linkedin profiles... more information about themselves. So I thought we did have some confidence in their abilities, but we could be even more confident if we knew more.", "q1r": 3, "q2": "In this part the proposal is very detailed, being almost everything perfect. We know the steps to implement the proposal, their order and when they happened (they time with quarters). About splitting the funding money: here is the problem, as I see it. That's 20k dollars ordered, with 15k going to the developer and 5k for costs such as servers, marketing and legal. The point here is, other professionals would also need to work to make the idea come true, like the blockchain specialist (cited on the site), some UI/UX designer... it wouldn't be just the development. And how would these people be paid? This question was open to me, and it would be extremely important to clarify it. Other than that, I believe that everything is very well detailed, I thought it was great how they have already created a solid bridge between the project and society (through social networks).", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal effectively addresses the challenge and its solution is quite interesting addition to the Cardano blockchain if properly executed in the migration from Binance smart chain.", "q0r": 5, "q1": "It is a great idea and one that can easily take off in Cardano. But the exlerience required to having a MVP is unclear. The relevant experience presented is of 2 Entrepeneurs. Need to mame clear who is developing the smart contract, migration and the developments required to get the project to that Q4 stage.", "q1r": 3, "q2": "There is a plan detailed and a stage by stage development goal with funds allocated towards legal, marketing and development. Unclear if the project has otger external financial sources to develop its project goal if 20k is enough to support a developer, legal fees and marketing. More transparency on those areas could help increase transparency.", "q2r": 3, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We aim to provide a platform where businesses and start ups will be able to easily create, manage and sell their business tokens.", "experience": "Entrepreneur from Argentina. The amount of obstacles that I had crowdfunding these years, is what made me create Token Allies."}