{"id": 367170, "author": "", "title": "Ledger Live Support", "url": "https://cardano.ideascale.com/a/dtd/367170-48088", "category": 26103, "amount": 15000, "description": "Viewing your ADA and token balances, as well as portfolio value is not possible with Ledger Live.", "f6_no_assessments": 2, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "I am not a Ledger user yet I see the value this could bring to members of the community who own one. The kinds of integrations already ubiquitous to and widely used by Ethereum should be just as available and existing to Cardano and this is one project that evens the playing field. I certainly hope that should this proposal proceed, that it isn't hampered by the Ledger Live team who could deny its deployment.", "q0r": 4, "q1": "On spec I would have given this proposal the full 5 stars. The proposer has the background to complete the work, is utilising an already existing Ethereum template and has presented a realistic work schedule to the months and hours for support on two formats. However, the dependency on Ledger Live team in approving his commits casts a small possibility of failure. The commits will likely not be denied if codified to their standards, but that there is a chance it could be can't be ignored. That aside, the presentation of this project gives a high degree of confidence that success can be achieved.", "q1r": 4, "q2": "The fact the proposer is inviting the community to track his progress via GitHub give confidence to its auditability. The roadmap for the two development tracks being done concurrently seems achievable and realistic as the proposer described the amount of time that could be devoted to the project. The hourly rate is acceptable too including the 20% leeway to react to any changes requested by the Ledger team. Overall, there is enough to audit this proposal should it win funding.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "While Ledger support is definitely something Cardano needs for adoption, this proposal does not solve it.", "q0r": 3, "q1": "Given this proposal lack of engagement from the vendor, it is almost certain this will not be implemented successfully.", "q1r": 1, "q2": "As this proposal is greatly depending on the vendor cooperation, which is missing, it is questionable this proposal will be auditable.", "q2r": 1, "assessor": "z_assessor_490", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "The Ledger Live application is open source and written in JavaScript, HTML and CSS, meaning a web developer could add this functionality.", "experience": "I've been a professional web developer for over 15 years."}