{"id": 367125, "author": "", "title": "Divine Blockchain", "url": "https://cardano.ideascale.com/a/dtd/367125-48088", "category": 26103, "amount": 210000, "description": "Bad temperature monitoring, the storage conditions through the entire supply chain are the most common cause of loss of a wine's quality.", "f6_no_assessments": 5, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "So they´re planning to \"plan and create\" a whole blockchain platform and a corresponding NFC communication application. While an NFC DApp would address the challenge, creating a new blockchain does not. The problem is, that this proposal does not provide adequate information on actionable steps and success criteria.", "q0r": 2, "q1": "The website does not provide the necessary information to assess if the team behind this proposal has the necessary qualification to \"build a blockchain\". The website does not provide any technical background information that would lead me to believe that the team has done previous work in this field. The financial budget is not broken down into any actionable steps in with 210.000 Dollars it takes nearly the whole challenge fund. Without giving us more information on why the requested amount for this proposal is so high, I would not expect this to be implemented successfully. The plan that the team provides is not consistent and there is no relevant documentation about the steps and prior work of the team on this project, except the webpage. The plan includes a token but there is no additional information about it, no actionable steps.", "q1r": 1, "q2": "No. There is no actionable steps, there is no measurement for success, there is no financial budget breakdown, no milestones, no documentation, no information about the team. NO. This is not auditable and should be edited and relevant information should be provided if the team plans to be considered for future funding.", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "- I really love this idea, thrilled with this kind of practical world solution using the blockchain technology. Moreover, using to create traceability with this kind of industry in which the costumers' tent to be judicious. \r\n- The problem is well explained, being comprehensible even for me, who does not know anything about wine.\r\n- I'm missing the key metrics and goals. I've read that you already have a partnership to develop and test. However would be nice to see all the ambition and in how long are you plaining to achieve it.\r\n- I do believe that if this is successful, the broad use of blockchain would be more well accepted…", "q0r": 5, "q1": "- It seems that the product is already running and what is missing is the development of the blockchain environment to use with it. However, the timetable given is quite simple and I am missing a broader explanation, since you're asking for almost all the fund. Therefore, would be quite useful for me having more details.\r\n- Moreover, the proposal would gain if the budget could be more detailed, showing what is actually missing, how it is going to be done and how much it costs. Alongside with those information, include a timetable with actual dates and progress expected.\r\n- Since you're asking for a lot of money and your already have the product developed without the blockchain implementation (I imagine), I'm thinking how you could divide this proposal in order to be complemented in the next rounds. This way, since the timetable is aiming the production only in 2023, it could be divided and be easily funded.\r\n- I've seen that we're going to use the NFC tech within our phones, however I've missed which sensor was used and how it uploads the info to the web allowing the winery to control everything. All these information could be sent to a temp controller inside the container, e.g., the same way we do with greenhouses, maintaining the ideal temperature, giving expertise to the distributor.", "q1r": 3, "q2": "- Unfortunately, I'm missing some budget details and timetable details, which is crucial to follow all the development.\r\n- Moreover, I am missing some metrics to follow the success.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal highlighted a problem and offered a solution but i do not see how this will help the adoption of Cardano .The Solution lack details on how it will go about achieving success, no cost breakdown or timelines provided , then the huge request of $210000.\r\nThe proposal will need more details.\r\nI disagree.", "q0r": 2, "q1": "No verifiable experience was provided with links.\r\nThere is no implementation plan.\r\nThe proposal failed to give a cost breakdown  on how the requested funds will be utilised despite requesting for a huge amount of $210000.\r\nI strongly disagree.", "q1r": 1, "q2": "Sufficient information to help audit the proposal progress and success was not provided .\r\n\r\ni strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Problem statement being some of the common causes which are effecting the wine quality the proposer is building a blockchain platform which will be helpful to track the causes effecting the wine bottles hence this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has given detailed plans and steps with timeline. As proposer has mentioned they already have experience working in blockchain products. Hence it is very likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer have provide a detailed steps to be implemented with timeline but if they had given detailed fund break down it would have helped a lot to audit the progress and the success of the proposal", "q2r": 3, "assessor": "z_assessor_419", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"q0": "The proposal offers a real-world implementable use case for blockchain deployment. Associated technology for supply chain management has to be developed in an established and professional manner. The availability of one supply chain managed on Cardano can act as a catalyst for many such projects. ", "q0r": 5, "q1": "intellics engineering claims 12+ years experience in the toolchain, DSL, framework, and in embedded system design in addition to many associated fields.  The product design using Near Field Communication (NFC), 10 data storage, and blockchain authenticated user feedback all have to develop from scratch and the team from the proposer claims to have the capability. Based on the info from the company site it seems that they have the necessary expertise in the same. ", "q1r": 5, "q2": "The proposal has five documents detailing the process and the capability of the proposer. However, the detailed break up for 210 K USD budget is not traceable in the proposal. Also, the details about the ownership rights (whether open source) are not explicit in the proposal. How much does the company proposing this project is investing or already had invested is also not clear. Lack of these date is making it difficult to audit the project. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A blockchain platform and an NFC communication with mobile devices - it keeps track of wines, share feedback and monitor the bottles.", "experience": "We are Intellics Engineering Ltd. Some of our major products are blockchain solutions on intellectual property management."}