{"id": 367134, "author": "", "title": "OctoWars", "url": "https://cardano.ideascale.com/a/dtd/367134-48088", "category": 26103, "amount": 125000, "description": "Cardano doesn't have a high quality game which can be played indefinitely and can gain new users every day", "f6_no_assessments": 5, "f6_rating": 1.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is vague and the proposal doesn't provide enough info to understand exactly what is the target problem to be addressed. \r\nA game with enough materials in the core story is an ambiguous statement. The key metrics and goals of the proposal are not defined. No timeline defined and no milestones to achieve. The buget is not broken down into identifiable items, and the amount requested has no justification. No info about the impact on Cardano ecosystem as an outcome for the proposal.", "q0r": 1, "q1": "The team consists of 5+ members who work part time on various parts of the game. No role defined for the members (add at least one leader, and define the role of each team member and for what they are assigned). No links/info/documents emphasizing the experience/skills needed to implement this proposal.\r\nThe proposer hasn't considered challenges and risks relevant to a successful implementation of the proposal. Unfortunately there is nothing to asses at this proposal.", "q1r": 1, "q2": "The information provided isn't sufficient to audit the progress and the success of the proposal as there is next to none information.\r\nNo roadmap with milestones and a time horizon for achievement.\r\nNo metrics/KPIs that define the success of the proposal.\r\nNo clear and understandable description of the targeted problem.\r\nNo clear and understandable solution that addresses the problem.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal highlighted a problem and offered a solution but failed to provided implementation plans, timelines and cost breakdown.\r\nMuch of the proposed solution can be found in the attachments provided but all do not contain the above mention issues.\r\nThe requested amount for the proposal seem too high considering the funding pot for the challenge and will do well if the funds are broken down in phases and across multiple funding rounds.\r\n\r\nI can neither Agree nor disagree.", "q0r": 3, "q1": "The proposal did not provide verifiable links to given experience and there is no implementation plan.\r\nI strongly disagree.", "q1r": 1, "q2": "The proposal did not provide sufficient information to help audit the progress and success of the proposal solution.\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Firstly, the proposal in itself feature a very low amount of information, luckily more information are provided in the attachments section. \r\nThe proposal aims to create a unique and high quality game developed on the Cardano blockchain. It's an attractive idea which might lead to a lot of users being introduced into the Cardano ecosystem. It is addressing the challenge brief vaguely, but I would have liked to see a bit more detail in the description of HOW OctoWars aims to stand out as unique in the world of similar type games. What incentive will make it attractive, apart from it being on the Cardano blockchain? Or are games developed on Cardano its only competitors? I'm unsure if a total of 50% of the total funds for the challenge is suitable for the little amount of information that is provided in the proposal. Having said that,  I agree that the proposal adress the challenge. ", "q0r": 4, "q1": "There is A LOT of information provided about the actual concept and game system (which is impressive and looks great), but not so much specifics added about the development phase, which is imperative in order for this proposal to be assessed properly. It would be beneficial if the proposal were to include a list of the team members, their experience in the field, maybe also some links to earlier projects and LinkedIn profile pages. The budget amount of 125 000 USD could be further clarified by adding information on how these funds would be allocated between the team and different stages of development, preferably with an added timeframe and estimated labour hours between each team member. The timeline could also be clarified a bit more. For example, there is a mention that the game will have an in-game wallet for the assets earned, but there is no mention if this could be one of the official Cardano wallets (like Daedalus) or if the proposal would include the creating of a separate wallet. Instead of focusing on game mechanics, I would have liked to see details on HOW the team means to complete developing the game, with more specific milestones and estimates on what is required to reach these milestones.", "q1r": 2, "q2": "There is a development roadmap provided, but it is currently a bit too vague in order for this project to be fully assessed. The proposal does include a mention of KPIs and success metrics, but it could be a bit more specific in its explanation. For example, one of the success metrics measured short term for 3 months are the number of users that played the demo game, but where is that demo game in the project timeline? Is it in the deployment phase of June 2022, or earlier? Also, where will the community be able to follow the development of OctoWars? Is it via their social media channels? Github? \r\nIn order to make the development transparency a bit clearer, could the project timeline be somewhat merged with the development roadmap? I believe this would make things a lot more clear. \r\nAnother point that would be nice to include in the proposal is to ensure that the proposer has a decent understanding of the risks and challenges of taking on this project. How does the project aim to market itself in a world where similar games are numerous? How will they incentivize people to invest money the first thing they do, in order to be able to play the game? \r\nBased on these statements, I believe that this proposal doesn't provide me with sufficient information to assess the progress in attaining its goals. ", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Game proliferation can increase the utility of the network. However, their success depends on a large number of issues. The documents explaining the game enclosed with the proposal are insufficient to estimate the quality and the idea of the proposed game. Therefore it is not possible to estimate whether the game will have any adoption or not. ", "q0r": 3, "q1": "The proposal does not include any detail of the proposer's experience and does not provide any details about the status of the game devepment. WIth such void in information, it is unlikely that the proposal will be implemented sucessfully.", "q1r": 1, "q2": "The proposal includes 6 files that outline the game and include some Gantt Chart for development. Details regarding a number of developers, the platform being aimed for, and the methodology are not found in any document. No justification for the development cost is also provided. It is difficult to audit the progress of the proposal. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "A great idea which articulate the problem needing to be solved.\r\nThis proposal also falls within the scope of the challenge brief. A lot of people love to play games recently especially with respect to the fact that people now work from home and would need some exciting experience to relax with when they're feeling exhausted. A high quality game of course can bring on board a lot of people to the ecosystem.\r\nIt is stated in the proposal that the game would lead players to the Cardano Ecosystem which I think would be a great idea in on-boarding people to the ecosystem but I'm uncertain how that will work as it's not defined in the proposal. ", "q0r": 4, "q1": "The given experience places me in an uncertain seat as to whether this proposal can be implemented successfully or not. No reference links to previous projects have been provided, no team data, budget has not been outlined clearly, requested funds which is USD125000 is huge enough for the information provided in the proposal and scope of work, there's no timetable with regards to how the proposal would be completed,  technical aspects like architecture, language and technologies which are crucial for successful implementation has not been defined. ", "q1r": 3, "q2": "No roadmap with milestones and a time horizon for achievement is provided in the proposal.\r\nNo clearly defined Metrics/KPIs that define the success of the proposal is provided.\r\nPossible hurdles,  challenges and difficulties have not been identified in the proposal.", "q2r": 1, "assessor": "z_assessor_565", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A game with enough materials in the core story to be expanded indefinitely and expose players to the Cardano ecosystem", "experience": "Product, project and development experience. The team currently includes 5+ people working part-time on various parts of the game."}