{"id": 367390, "author": "", "title": "School of Life", "url": "https://cardano.ideascale.com/a/dtd/367390-48088", "category": 26103, "amount": 7500, "description": "School of Life is here to address the growing dissatisfaction with the quality of education provided to our kids all around the world.", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "- When this idea fully works, the potential impact to the Cardano system and even to the world in general would be huge. However, this is still an idea with not much targeting. There's not much said in this proposal in order to evaluate metrics, e.g..", "q0r": 3, "q1": "- In the written proposal in the ideascale you said that the implementation of this idea is far beyond your capabilities, however you did not give us a solution.\r\n- Another point is the budget, you're talking about AI development, tokenization implementation, attract tutors, developing (or attract) edu. Games, however, during the budget breaking down, you're talking about researching and building the learning material and building a trial game. I think two things about this: 1) is this quantity enough?; and 2) is this the right path to start?", "q1r": 2, "q2": "- I'm missing the way we're going to measure the enhancement of the content learned compared with the traditional way.", "q2r": 2, "assessor": "z_assessor_25", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has identified a problem, but the solution provided looks like it addresses something else. (the problem - the growing dissatisfaction with the quality of education, the solution - creating a gamified curriculum that engages children and allows them to learn at their own pace) Keeping one, the proposer has to rephrase the other for better addressability (marketing).\r\n\r\nThe proposal doesn't fit the challenge settings (propose a way to drive business use cases on Cardano that have NFT usage as a core component and can act as an onramp to the Cardano ecosystem.)\r\n\r\nThe proposer doesn't articulate, in a clear manner, how the Cardano ecosystem will benefit from the implementation of this proposal. (how many users will onboard?)", "q0r": 2, "q1": "The proposer provides evidence of some skills and experience but the are not relevant to implement the proposal. (hiring experts will give a better chance for a successful implementation).\r\n\r\nThe budget is outlined but is not broken down, clearly, into identifiable items. (realistic costs for any resources used).\r\n\r\nAdditional funding is required to implement the proposal, but the proposer has not provided a verifiable plan in this regard. (seems to be a long term plan).\r\n\r\nThe plan doesn't describe, clearly, the resources necessary to implement the proposal.\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (any government regulations/laws that can interfere with the proposal's path to success).\r\n\r\nThe proposal looks more like a story than as a working plan.", "q1r": 2, "q2": "Unfortunately, due to luck of necessary and relevant info it's difficult to asses the proposal.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is a good proposal but however, the statement \"his could be a great addition to Cardano's work in Africa as a great place to build out new curriculum\" clearly indicate it is out of scope for this challenge and will be well suited for \"Grow Africa, Grow Cardano\" considering it is educational in nature and focuses on Africa.\r\n\r\nI disagree ", "q0r": 2, "q1": "The proposal did not provide verifiable link to given experience and lacks a detailed cost breakdown to justify the requested amount.\r\nI disagree", "q1r": 2, "q2": "The proposal did not provide. sufficient information to audit progress and success of the proposal solution.\r\nI disagree", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Problem statement points out the poor quality of education provided to the kids around the world the proposer is creating a curriculum which is engageable and practical which also help kids to learn on their own pace hence this effectively addresses the challenge", "q0r": 5, "q1": "the proposer has mentioned is a blockchain expert and has presented a detailed plan to be implemented therefore it's very likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided clear fund breakdown and timeline which will be helpful to audit the progress of the proposal and also to track the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 12, "ne": 2, "ng": 6, "nfo": 4, "vca_o": 1}], "solution": "Creating a gamified curriculum that engages children and allows them to learn at their own pace. Offering a holistic practical education.", "experience": "Parent. Certified blockchain expert. Dev in training. There is an existing example of this type of education in Elon Musk's Ad Astra school."}