{"id": 367627, "author": "", "title": "API for Multi-Delegation Portfolios", "url": "https://cardano.ideascale.com/a/dtd/367627-48088", "category": 26103, "amount": 10000, "description": "It is difficult for Cardano community members to support multiple causes and projects by spreading out their stake to multiple pools.", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": ["https://www.youtube.com/watch?v=CLrQgYF3mCI"], "media": [], "f6_assessments": [{"q0": "I agree that this proposal effectively addresses the challenge. \r\nAs a developer and cardano investor myself i have often seen the need to make delegation to smaller/multi stake pools from single wallet. Additionally, idea to have automated/easier access to information such as stake pools grouped by certain filter criterion, e.g. charity types (certain section of earnings go to charity), will help Cardano network grow stronger and continue to be driven by the willingness to thrive for a more equal world. However, i notice that the solution statement language could be simplified for making it more appealing and understandable for new investor. Hence, not going with 5 stars :)", "q0r": 4, "q1": "After having a brief look at the proposer github page,  developer has the necessary credentials to fulfill the task of API implementation. As a developer myself, API development of such kind does not seems to a very complicated task, and given the credentials of the proposer, (github commit history and projects contribution) this should be doable in the given time frame.", "q1r": 5, "q2": "The proposer knows what he wants to achieve and how he wants to achieve it. The proposal essentially outlines the implementation plan, and the budget asked for this proposal has quite high reward to investment ratio. \r\n\r\nThe website already exist where we can see basic set of groups of stake pools listed based on certain filter groups. This is an important attribute for this proposal as it gives a good overview on that proposer has done his homework and has clear implementation path for the API\r\n\r\nAs a developer myself i am confident that the information provided is enough to audit the progress and proposal would be successfully implemented in given time frame. ", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Portfolio for staking is a unique concept enabling fine-tuning of one staking choices. Such dynamic staking feature is a strength of Cardano protocol design with no lock-in period and affords such freedom of choice. However, creating API for allowing third-party organizations and services to curate and consume the portfolios looks far-fetched. Data on expected demand for the service and the method to sustain this service is lacking in the proposaal to arive at a firm openion. ", "q0r": 4, "q1": "The proposer team is operating a useful and functional website along with a Stake pool therefore they must be capable of creating a functional API for the intended service. ", "q1r": 4, "q2": "The progress of the proposal is auditable since it can be expected the code for the API with documentation will be released as open-source however the success of the project is not adding any substantial value addition to the Cardano eco system. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "It's a cool idea, but I think it fits more in the developer ecosystem rather than Daps because you would be providing an API (defined in the \"potential directions\" in the \"Developer ecosystem\" challenge), not a decentralized application.\r\nEven so, I like the idea, although I don't believe the impact for the community would be as great as other proposals such as libraries exposing the Cardano ecosystem.", "q0r": 4, "q1": "The lack of credentials is something I notice, but on the other hand, you have linked a Github repository, which has a nice CC-BY licence, which is a good start. \r\nIt would have been nice if you had provided a more detailed breakdown of the budget distribution and timetable because if a community member wants to follow your progress he/she would be limited to watching the commits you make in the Github repo. As a suggestion on this point, I'd recommend a blogpost or simple release notes so that everyone tech-savvy or not can follow your progress.\r\nOverall I love the idea, but the description of the components of the proposal could have been better. For more credibility in your next proposal, you can consider linking a GitHub or Linkedin accounts of people that will be working on the project.", "q1r": 4, "q2": "It would have been nice to have more than a GitHub repository planned to keep your peers informed about the progress of the proposal implementation.\r\nAnother thing that would have been nice is to have KPIs like how many devs do you expect to start using your API or how many shared portfolios for a year, or something relevant.\r\nI like the project, Good luck!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Our website https://adafolio.com provides a platform for community members to create and share portfolios of multiple stake pools.", "experience": "The team consists of engineers with advanced degrees who operate VIPER stake pool and developed the working prototype, https://adafolio.com."}