{"id": 367954, "author": "", "title": "Payments for High Risk Businesses", "url": "https://cardano.ideascale.com/a/dtd/367954-48088", "category": 26103, "amount": 5000, "description": "Many legitimate businesses have had bank accounts frozen and credit card accounts terminated due to the perceived risk of their business.", "f6_no_assessments": 6, "f6_rating": 2.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a payment gateway that can accept ADA for payment will reduce the risk of having their funds frozen and business can continue their operation which their bank account is frozen therefore effectively addresses the challenge", "q0r": 5, "q1": "The team has relevant experience but they haven't provided any roadmaps or steps to implement, which makes it harder to be successfully implemented.", "q1r": 3, "q2": "The proposal doesn't consist of any timeline and fund details which would make it hard to follow the progress and the success of the proposal", "q2r": 2, "assessor": "z_assessor_317", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal highlighted a popular problem of the lack of crypto based payment gateways and offered a solution but failed to give details about the solution and a detailed implementation plan, milestones or cost breakdown.One can see the intention here of the proposal but the lack of solution detail works against making a decision.\r\nconsidering the above i can neither agree or disagree.", "q0r": 3, "q1": "no verifiable links to given experience was provided and the implementation plan, timeline, cost breakdown is missing.It will be helpful to this proposal in future funds if the above highlighted are provided with their section in the proposal to enhance the chances of the proposal being funded .\r\nI disagree.", "q1r": 2, "q2": "The proposal did not provide sufficient information to help audit the progress and success of the proposal solution.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Creating a Point of Sale system for businesses to accept ADA will encourage more businesses to use the Cardano network, thus increasing utility and adoption. ", "q0r": 3, "q1": "I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\"", "q1r": 2, "q2": "The team provided no roadmap (timeline) and a single line budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond a single line entry and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "It can be interpreted that the proposers are pointing a solution to a problem that is not the one they have pointed. Because there are currently multiple forms of payment in crypto to business. The \"perceived risk of their business\" might have to do with illegal activities in some regions where they are forbidden or simply with scam business, therefore protecting customers. What is the solution to this case? The proposal is too broad and could be more tailored to a specific issue to become more clear if the solution is really addressing the problem. \r\n\r\nIt is also not clear what the proposers consider a simple peer-to-peer form of payment, because there are indeed many forms of transfer crypto and to pay for goods using crypto. \r\n\"No simple application yet exists for peer to peer crypto currency exchange.\"\r\nIn this case, what would really be an innovation, or what is the new technology that has not been created yet?", "q0r": 3, "q1": "As the proposal still needs to be improved, and it consists of a request for a very initial development, there is not enough evidence that it will succeed or that it will be fully implemented. To ensure that, the proposers can detail and refine better the proposal and give more robustness to it. ", "q1r": 2, "q2": "The success of the proposal relies on further development and further investment (which according to the proposers is $50k-$100k). However, the proposers are asking for a small budget to start and then evolve to other phases, and that is a reasonable approach and prevents failed investment of the Catalyst's funds. However, the proposers provide no information or metrics or KPIs for this initial phase, neither forms to audit its success. ", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The existing wallets are designed for handling high-value Cardano transactions. Along with hardware wallets, it is very secure. Moreover, other offline-signing methods do not expose keys to a networked computer. It isn't easy to understand the use of the mobile platform for high-value transactions.  This proposal has a security connotation, and citation of audit reports should have been appropriate to evaluate in proposal in detail. ", "q0r": 3, "q1": "The proposal does not have references to past work of the proposing team in the app development or security products to evaluate the experience. ", "q1r": 3, "q2": "The proposal does not have a detailed security plan and implementation plan or budget. There is a lack of analysis on how it will be published for the community. Without these details, it won't be easy to audit the progress of the proposal. There is also a need to compare and define the extra security that this wallet aims to achieve compared with the existing Cardano wallet.", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "- I think the idea of an app that allows people to seamlessly transfer Ada is great and would provide users a lot of value if successful, so I would give it 5 stars for addressing the challenge.  However, we are asked to assess whether it *effectively* addresses the challenges, and I have some concerns about that, hence the 3-star rating.\r\n\r\n        First, the proposal states that \"No simple application yet exists for peer to peer crypto currency exchange.\".  Maybe I am misunderstanding, but I don't think this is true.  For example, it seems to me that Valora (app for sending Celo) would qualify as such.  More generally, apps such as Coinomi support many assets, and Cardano is on their radar at least, according to this Reddit post https://www.reddit.com/r/COINOMI/comments/hkf14d/hi_could_i_add_cardano_to_coinomi, which is admittedly a year old.\r\n\r\n        That doesn't mean that it wouldn't be beneficial to have something specifically for Ada, though and perhaps something along the lines proposed would help to streamline, facilitate and encourage use of Ada, which would benefit the Cardano community.  However, I think the proposal would be more effective if it explained how it would be better than existing apps.\r\n\r\n        Like most useful tools, if successful, the app could be used for many purposes, including \"good\" ones (e.g., charity, remittances) and \"bad\" ones (e.g., financing terrorism).  So I don't see the point of focusing the proposal on \"High Risk\" and (maybe, for some) \"controversial\" use cases.  If the proposers want to focus on *legitimate* businesses that are \"deplatformed\" by traditional mechanisms, that seems reasonable motivation, but also seems narrow to me, as there would be plenty of value beyond those if the app were successful.\r\n\r\n        Finally, I think a key challenge is whether/how these businesses could withdraw funds.  Is the idea that they would do business in Ada (e.g., paying their suppliers and other costs), or convert to other crypto-assets for that purpose?  If so, why couldn't they use one of the existing apps for that?  If the idea is that they would withdraw to fiat to do business, the question remains how they do that in the case of the motivating use case of \"high risk\" businesses.  Might it not be the case that they are restricted by exchanges due to regulations and/or social cost of enabling such businesses?\r\n\r\n        These seem to me to be key issues to address before building UI and demo app.", "q0r": 3, "q1": "Based on the descriptions of the team, it seems feasible that they could implement the proposal, although no specific experience in UI design and implementation is mentioned, which is the focus of the proposal.", "q1r": 4, "q2": "There is not much in the plan that could be assessed beyond \"initial user interface and demo app\" with \"minimal functionality\".  While it seems clear that the team could produce something fitting that description, the description is not specific enough to assess whether the project is successful.  I think the proposal would be improved by discussing specific features that will be implemented and artifacts that will be demonstrated.", "q2r": 3, "assessor": "z_assessor_499", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a simple payment gateway for businesses to be able to use to accept Ada.", "experience": "Team members have over 40 years of combined IT experience in Systems and Network Architecture Disciplines."}