{"id": 367956, "author": "", "title": "Nature Coin: Climate Change DAO", "url": "https://cardano.ideascale.com/a/dtd/367956-48088", "category": 26103, "amount": 50000, "description": "Eliminating climate change demands international support and wartime levels of spending in the public sector.", "f6_no_assessments": 5, "f6_rating": 3.599999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "- The climate change is becoming the main concern of the world, and the tendency is that, each new day, the carbono, energy and transportation topics relating greener solutions becomes more popular.\r\n- In order to this project works, it must bring lots of people to spend and use the Nature Coin, otherwise it'll be not able to fund projects (since the pollution free solutions are, most of the times, expensive).", "q0r": 5, "q1": "- A point that concerns me is the adoption, which needs to be huge in order to raise the funds necessary to fund projects. Therefore, I would like to see a more detailed plan about how it would be advertised, how are you willing to create the platform that gonna sell/buy NFTs, how are you going to develop the games that will add value to the coin, etc. These points are important because they are the method you'll use to create the coin's value.\r\n- I really think that is mandatory add into the budget some marketing in order to create awareness about the project and the coin.\r\n- Building a game, most of the times, are very expensive. Maybe this much of capital required will not be enough to make it running.", "q1r": 3, "q2": "- How are we measuring success? How are the metrics throughout time such as number of transactions, number of NFT offered, number of artists join, games, expectation of fund, etc. These information are important in order to allow us to know if it is feasible and the impact that is expected to the community.\r\n- Another point is that we must have a way to verify (obligate) the project funded to be transparent enough for that the community be able to see its development. Maybe creating a platform that allows them to share its progress.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Protecting nature and fighting climate change is important, however I feel this proposal should have been entered into the \"NFT Business Model\" fund category since the proposal has NFTs at the core of the business model proposed. For this reason, I believe the proposal did not effectively address the challenge.", "q0r": 2, "q1": "Although the team provided a link to discord and youtube, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\" ", "q1r": 2, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "This proposal does provide a high impact for the Cardano ecosystem and Catalyst in two main ways; bringing new users that are passionate about climate change and showing that catalyst funds projects linked to sustainability.\r\nThe solution is rather well explained and supported by the short video, however, what is missing is a deeper explanation of the problem. This is important to argue for the solution it would have been better to underpin the specific problems that it aims to solve. This would have also made the solution more tailored.", "q0r": 4, "q1": "The team shows good experience when it comes to building this type of platform, both having an engineering background. The budget also is reasonable and specific enough to understand where the funds are going, mainly to hourly work for now. The parts that could have been developed further for voters to better understand are the specific milestones and timelines that they aim to follow as only a rough guide is given. This is also true regarding the architecture of the platform, I would have liked to be able to understand what they plan to use to build the front-end and back-end.", "q1r": 4, "q2": "This part get's a 3-stars as there are some key elements missing in the plan to provide the community with audibility. There are no details on what the potential challenges and risks of the project are, as well as no numbers that forecast the number of users or transactions that would be done on the platform. This makes it difficult to understand how success can be measured. Additionally, the roadmap only provides brief statements of what happens each quarter and arguably the first one being the most important one only specifies \"launch the Nature Coin token\". It would have been preferable to see specific milestones and maybe more specific timelines to track.", "q2r": 3, "assessor": "z_assessor_473", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A great DApp idea, that falls in the right challenge category for sure. A very nice idea that will make Cardano and the whole cryptocurrency space sound more and more friendly no non-tech-savvy people.", "q0r": 5, "q1": "The experience is one thing I'd like to touch on here. In the proposal, there's a great description of both participants but a Linkedin profile would have been great as well. I actually found it https://www.linkedin.com/in/blakelock/ but it would be so much easier if it's linked in the proposal. It allows me to see the previous experience of the person along with other interesting facts I find that would bring credibility to the proposal.\r\nWhat I really like about this project is how long into the future it looks and that it's planning to be self-funded in due time. These are two very important components that I look for in every proposal I asses and they sure are present in this one.\r\nThere is a meaningful breakdown of the budget which is very important for transparency and as a developer I find it acceptable.\r\nOverall I like the idea, I like the enthusiasm and I love the vision this proposal has.\r\nGood luck!\r\n", "q1r": 5, "q2": "The creator didn't mention if the implementation will be open source or not, but I assume that I won't be since there was no Github repository mentioned or any other kind of repository. In case there's no public repository any community member would be able to follow, I'd recommend a newsletter or some other form of information provided to all community members interested in the proposal.\r\n", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Great proposal and for such an important subject. Well presented problem and solution and align it to Cardano ecosystem. It could definitely attract users to be part of such an initiative. I was involved with NGOs working in the last few years (www.earthworm.org) and I am highly concerned about climate change and the need for new solutions driven by the community and customers as unfortunately, we do not see enough action from the corporate world. I also like the use of \"wartime level spending\" as this is what we need.  The proposal motivates everyone to take action in a simple way and be part of the change we want to become. \r\n", "q0r": 5, "q1": "The team seems smart and capable. Great video pitch presenting the proposal in a simple way. More info and LinkedIn profile would have been helpful. I also believe having more team members on board and advisors would be helpful and one idea could be to start registering community members that wish to be part of the project and purchase nature coins when available. \r\n\r\nGood replies to questions from the community on the message board. \r\nThe plan is aligned with the idea with some clear next steps. \r\n\r\nThe budget also seems reasonable and well explained, and focuses on the development phase. I would suggest adding/assigning some budget also to marketing and get community engagement. Regarding the business model, I would suggest choosing the main one for now and concentrate on it. \r\n\r\nOverall from my experience working with many startups (i.e. mentor at seedstar.com, Givingway.com), the plan seems clear and focused.\r\n", "q1r": 5, "q2": "Deliverables, timeframe and roadmap are all put in simple and clear terms which makes it easy to follow. \r\n\r\nMeasurebales KPIs are missing. For example how much ADA you will raise? how many community members will participate? How much $ you plan to raise from the NFTs? How many projects will be supported?...I understand it is still early stage but it is important to have it planned as a baseline, so you can measure and improve ongoing \r\n\r\n\"we're aiming to have enough capital in the Nature Coin treasury….\" how you are planning to do it? What is enough treasury?   \r\n\r\nMissing risks and challenges which could show you considered and understand them. \r\n", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "Nature Coin is Project Catalyst for the environment - creating, supporting and funding environmental projects.", "experience": "Co-founded an ecotourism company, software engineer at Instagram for 2 years, college valedictorian."}