{"id": 368353, "author": "", "title": "Win-Win Dispute Resolution", "url": "https://cardano.ideascale.com/a/dtd/368353-48088", "category": 26103, "amount": 25000, "description": "The legal dispute resolution space suffers from an antiquated reputation model, ethical dilemmas, and little use of helpful technology.", "f6_no_assessments": 2, "f6_rating": 5.0, "videos": ["https://youtu.be/0izQVGQ5KrM", "https://www.youtube.com/watch?v=AftfAbJMxQE&start=8587"], "media": [], "f6_assessments": [{"q0": "A friend of mine who's a mediator in one of the local courts around has been complaining bitterly that there's no work as Covid19  striked. I ask him why, and he said few cases come to court and just about 0.1% of them gets referred by Judges to go in for Mediation processes. While there are many of these mediators in the house, the job is usually is handed over to the old (senior) mediators due to assumed experience and thus leaving behind the new(junior) mediators.  They (junior mediators) are left to fend for Mediation jobs for themselves which is a very tough task especially with Covid19 restrictions (lock downs) being imposed and it'sjust not fair. He made mention that some time ago, a dispute party was furiously dissatisfied with a mediation process that was handled by one of these senior mediators in the court because he (dissatisfied party) didn't pay his mediation fee early, and the Mediator was somehow related to the other dispute party, he (dissatisfied party) was partially treated.\r\nI'm giving this team a high score because I've realised this decentralized application they're seeking to implement has potential solutions to many problems that the Dispute Resolution is facing in not just local courts but national ones as a well.\r\nThis marketplace, I strongly believe will be very useful as a lot more mediators around the world going through similar problems just like that of my friend Mediator, would love to jump on it and receive peaceful mediation jobs.\r\nAlso, they wouldn't have to go roaming in search of jobs as the jobs would come to them via the marketplace. They will also be able to render a very accurate mediation job as information (time of payment, regional background and others) about dispute parties would remain anonymous to Mediators, I think it's a good solution which clearly aligns with the challenge. ", "q0r": 5, "q1": "Having look closely at the Team data, I feel there's enough expertise in there to make the implementation of this project a success.\r\nBudget and other needful information have been outlined clearly and it sounds reasonable to achieve set goals.", "q1r": 5, "q2": "There's a clear Roadmap presented by this team for Auditability purposes. From the proposal,  KPIs have been provided to help define the success of this proposal. \r\nAlso,  a targeted problem  has been accurately described and addressed with a clear solution.\r\nSustainability has been clearly defined by the Team that their project would generate income out of charges they place on services they render which I feel is the perfect idea. ", "q2r": 5, "assessor": "z_assessor_565", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This addresses the challenge in a direct way and offers a very attractive solution to issues that can arise with smart contracts. ", "q0r": 5, "q1": "The extensive team has expertise covering both the technical sides (Plutus and both backend and frontend development) as well as the legal side. The team is also composed of several active Catalyst members which lend credibility and trust in that the team will put its utmost effort in making this succeed.", "q1r": 5, "q2": "The roadmap is very clear and the proposal clearly outlines KPIs that can be assessed. Furthermore, it clearly uses specific numbers in terms of its definitions of success which makes it also easy to assess. Its only weakness is the lack of detail provided in regards to the budgets. This could've been improved but fortunately the budget is relatively low compared to many other projects so it is not a big problem. ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "A marketplace with certified mediators, financial guarantees via Plutus, and convenient technology that enhances the mediation process.", "experience": "A team of a dozen developers, Plutus pioneers, legal experts, dispute resolution specialists."}