{"id": 368768, "author": "", "title": "Sweaty", "url": "https://cardano.ideascale.com/a/dtd/368768-48088", "category": 26103, "amount": 66500, "description": "No decentralized gaming streaming services or wager(Crypto) app/website for gaming.", "f6_no_assessments": 2, "f6_rating": 1.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea itself is good but the plan, rollout and execution is not defined in detail.", "q0r": 2, "q1": "The whole '60 years all together in gaming' is a poor metric in my opinion. Does that mean there is like 10 people with average 6 years of gaming experience? if so, would be better to say that. Also, just because you play games does by no means make people qualified to make a gaming/gambling platform. I would like some real software programming credentials listed. Also details on the team itself would be beneficial.", "q1r": 1, "q2": "More detail. What coding languages? How big is the team? What experience do they have? How will the money be spent? When will the money be spent? What are some milestones.. \r\nHaving a repository of past projects in an open source repository so people can see the skills you have would give this project some light.\r\nIt seems to me that the funding amount was chosen out of nowhere.", "q2r": 1, "assessor": "z_assessor_119", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal.\r\n\r\nThe problem described is not clear. What is the exact problem with not having a decentralized streaming platform? What aspect of centralized streaming platforms could be improved with decentralization?\r\n\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal.\r\n\r\nThere is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal.\r\n\r\nThere is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Sweaty will place streamer against streamer in selected video games for people to wager on in crypto.", "experience": "Our team has 60 years all together in gaming with 6 years in streaming. Cardano and gaming is our passion and we will put them both together"}