{"id": 368921, "author": "", "title": "Shared Reality - incentive token", "url": "https://cardano.ideascale.com/a/dtd/368921-48088", "category": 26103, "amount": 20000, "description": "Disinformation is a grave threat. The public is losing this information war. We need to incentivize the creation of better information.", "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Incentivizing the truth with a token system can be a great experiment and could educate a lot of people about Cardano in the process as well. There is a huge community that wants honest news or information in general. This is no easy task though and a project like this is still exposed to risks. You need to come up with a robust plan to proof check validity of information. Sometimes the truth will never be known.", "q0r": 4, "q1": "Only one team member with no plutus or backend experience. Getting the necessary team on board to make this project a success is essential to gain voter confidence. You also need these team members to help refine your budget and plan. Right now there is no budget allocation or plan behind it. The overall plan also needs some work and that will come naturally with a fully committed team.", "q1r": 1, "q2": "It will be hard to track the progress and success of this project as no launch date or roadmap with milestones has been provided. No key performance indicators as well. The solution to solving the disinformation problem is buy paying smart people to find out the truth. You would need a much more complex system than this to insure that people indeed are telling the truth. There would need to be some form of reputation mechanic attached to each profile. There would need to be a team of reputable assessors fact checking articles. This team also needs a reputation system going and they also need to be assessed. It's hard to trust people. Obviously there are better ways of doing this and I think that should be the main goal of this project. Getting a team together and figuring out how to experiment with information to make the truth come out on top at the end of the day.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "While the proposal addresses the challenge in that a native token is used as rewards for contribution on a website, relevant information is missing to understand how the distribution and rewards system per contribution would be set up. Without information (x-rewards for x-contribution) it cannot be estimated if the proposal would enhance the value of the Cardano network. The number of tokens and the expected growth and number of addresses holding the token are not addressed.", "q0r": 3, "q1": "The proposal does not provide enough information to assess successfull implementation. Relevant experience of the proposer is stated as web developer, but this is also tapping into politics and journalism as well as mediation/ moderation to guide the discussions. Commitment can be seen in that the website and first challenges are already set up. It seems that this website atm is focussing on US politics. The challenges asking for instance Trump to respond to a question and provide one side of the argument does sound very unrealistic. The proposing team would have to have relevant networking power to even get access to government leaders. Generally, the whole outreach and rewards plan is missing and would be central to understand how this proposal will be set up.", "q1r": 3, "q2": "The proposal is difficult to audit because not enough information about the roadmap and milestones are provided. The financial budget does not state how the reward system would look like. I would argue that a total budget for the project of 20.000 dollars would not attract very many specialists of a field to contribute to the platform. At the same time, the whole idea is and the website claims to specifically get responses from experts as well as have experts rate those responses. The proposal does not give any success criteria (like we would like to attract xexperts to contribute to xtopics in this timeframe). So audatibility is not possible. Possible risks have not been addressed: giving access on a platform to both sides of an argument sounds like a great idea to create neutrality, but there are several risks of bias for instance through over representation of one side or through the quality of a statement that does not necessarily have to correlate with the quality of the content itself. So the risk of creating bias should be addressed. For instance: who can contribute? And who is responsible for contacting \"experts\" and how to avoid bias in contacting experts? The website challenges \"Prager, Trump, Biden....\". How would outreach to these people work and why would they be interested in contributing to a website? Outreach in general is not addressed and would be necessary to audit visibility of the website.", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "The proposal highlighted a problem and proposed a solution but the solution sounds more like a sales pitch for Shared Reality that an app that will benefit Cardano as stated below.\r\nTruth is subjective and rewarding people for truth brings up serious game theory problems which this proposal solution failed to highlight.\r\nAnother problem of vetting and incentivising truth is bad actors(no solution to verify this was provided) and controversy that cardano will very much want to avoid due to the subjective nature of truth.\r\nI disagree.", "q0r": 2, "q1": "The proposal did not provided verifiable links to given experience and there is no implementation plan.\r\nI disagree.", "q1r": 2, "q2": "Sufficient information to help audit the progress and success of the proposal was not provided.\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "A token-based rewards system for contributions for the Shared Reality platform, to support the frictionless flow of information.", "experience": "I am a web developer, developed the https://SharedReality.solutions platform, and understand the defects in our information ecosystem."}