{"id": 369097, "author": "", "title": "AdaQuest(aka The Quest for Ada)", "url": "https://cardano.ideascale.com/a/dtd/369097-48088", "category": 26103, "amount": 75000, "description": "Building the first mobile classic fantasy MRPG Game in a world called ADA. Fully related game design to Cardano´s blockchain technology.", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=4560"], "media": [], "f6_assessments": [{"q0": "This project has the ability to scale and evolve tremendously. Gaming and NFTs seems to have a bright future, so there is already a community ready and waiting for games like these. This will ultimately bring a lot of new people to the Cardano space.", "q0r": 5, "q1": "Looking at the website and the team, their experience and commitment seems legit, although adding evidence of their experience or profile links as extra reference will boost the voters and CAs confidence in your team's abilities. It would be great to see what Dirk is capable of building and some of Chris' past works. Showing some form of Budget allocation for funds requested will boost voter confidence. You already have other funding models in place and on the horizon for extra support, which increases your chances at success.", "q1r": 4, "q2": "Very clear and detailed estimated roadmap with key performance indicators defining success. It is clear what needs to be done and how they will accomplish these tasks. Some potential risks needs to be considered. NFT drops can be very attractive to new players. But when all NFTs (or most of the good ones) have dropped some players tend to leave. I know these mechanics for your game still needs to be figured out. I just wanted to give you a heads up on that one.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Very thorough in outlining past and current goals. This sound more engaging than most NFT projects.", "q0r": 5, "q1": "Well written proposal and the experience provided is encouraging for what they are trying to do. Their website is also proof that progress has been made and confidence it will continue.", "q1r": 5, "q2": "Their goals are well outlined and seem attainable. Their release one would wish would be on the earlier side of the range provided and the decision to return the funds once up and running is aspiring.", "q2r": 5, "assessor": "z_assessor_223", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Proposal is very well described. This role-playing game is designed to take advantage of Cardano's blockchain technology and it uses Cardano related items throughout the game. Cardano needs some epic Dapps, and the gamers of the world can help this proposal be successful.", "q0r": 5, "q1": "This team has extensive experience with professional gaming, business, and blockchain  which completely support the vision that this proposal will be implemented successfully. The is a very clear plan and timeline for success. ", "q1r": 5, "q2": "The budget is reasonable, and the milestones and timeline seem to be well thought-out. The metrics for auditing the proposal should be more clearly defined, but I love the fact that the ultimate success of this proposal will be the team providing their funding back to future Catalyst proposals (nice touch).", "q2r": 4, "assessor": "z_assessor_449", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The proposal effectively faces the challenge, as I am a game designer / project manager and a lover of fantasy video games, I mirror my gaming ideals in this. The gamification linked to blockchain technology and the Cardano ecosystem and its ADA currency is interesting. The game idea could add value to the Cardano ecosystem given the recent hype for video games linked to blockchains. The objectives that the creators set out to achieve are clear and concise. One thing that I recommend to improve is the explanation of the mechanics and dynamics of the game, perhaps by developing a Game Sketch or a Game Design Document to be attached to the proposal as well as the teaser and mockup images.", "q0r": 4, "q1": "The plan is presented in a truly optimal way, there is a good chance that this proposal can be successfully implemented in the manner described by the proponents. The roadmap is well estimated in my opinion, the terms seem concrete, the team is well trained and multidisciplinary in the gaming area. The budget is clear and reasonable to achieve the objectives set, however it is not divided by areas (eg Graphics, Development, Design, Sound, ..), doing this would certainly help to better outline the costs, perhaps even dividing them by phases. In essence, however, the plan describes the resources needed to implement the proposal.", "q1r": 5, "q2": "As I said previously, the roadmap is well defined with milestones in my opinion and with the achievement of the objectives. The description is clear and understandable. I could recommend adding a more detailed project GANTT in chronological order than a description as it was done, but that's already very good in reality. Another thing that I believe can help is to specify the risks or incidents that may exist and how these can be addressed.", "q2r": 4, "assessor": "z_assessor_481", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "A really well-made game brings an enormous amount of attention to the Cardano eco system and certainly brings many new users. The professionally designed graphics and teasers attract attention. Furthermore, this project addresses the currently important topics of NFT and gaming. ", "q0r": 5, "q1": "The realized project steps already show the professional approach of the team and their great wealth of experience. The roadmap is very detailed and seems very well thought out, which makes a very positive impression on me. I believe that the presented plan can be implemented in this way.", "q1r": 4, "q2": "The schedule and implementation steps are listed in great detail. Based on the documentation, I know exactly what progress I can expect at what time. I am sure that this proposal can be successfully implemented despite the immense scope. Whether it will be a commercial success, I can only hope. ", "q2r": 5, "assessor": "z_assessor_557", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Let me just say its a great proposal. Good progress being made and has a very solid team working on this game development.", "q0r": 5, "q1": "The experience is quite present and evident and the team growing more as time going by. The stage by stage transparency is clear and the information is concise. ", "q1r": 5, "q2": "Fubds allocations are quite transparent and the timeline to assess the progress of deliverables are great.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "This proposal will address the challenge of attracting users to Cardano and the built gaming platform. Those users will most likely consist of future developers and the general gaming community that perhaps is not yet aware of Cardano tech capabilities. Introduction of gaming through blockchain is perhaps one of the most effective method of gaining traction for Cardano, for gaming and NFT is an economically logical alignment in the form of the sub-industry/market of skins and loot boxes. Add to that the ever-growing game industry which is predicted to onboard 400 million users in 2023, traction is probable. One aspect that kept this proposal from receiving a 5 star rating is the genre the team chose. MRPG growth has been minimum or stagnating. All the craze now is about Battle Royale.", "q0r": 4, "q1": "This proposal provides avenues to verify the experience  and relevant skills  that will be needed to achieve their deliverables (though having links would be helpful). Which includes; organizing the right team members with the right skills needed, determining a budget that fits the Catalyst funding process, determining the global budget needed to achieve a full operating game and it's ecosystem, a global overview of their timeline and etc. This proposal though was short of a 5 star rating due to lack of budget breakdown and lack of identifying potential challenges or risk the team might face during development. One form of challenge or risk is potential of bugs, which perhaps can cause unforeseen delivery delays resulting in potential unforeseen additional overhead cost.", "q1r": 4, "q2": "This proposal provides a general and quite in-depth roadmap with milestones that can be easily audited and understood. There is though room for improvement in describing their problem statement and the solution provided. The current information available tends to be more of a marketing pitch rather than a problem-solution statement. This and an unclear KPI format is the hindering factor for not achieving a 5 star rating.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "We will offer the whole fantasy gaming experience, story, exclusively hand-drawn artworks, world and game design will be fully hand-made!", "experience": "Coding: Dirk\n\nArt: Chris\n\nG-Design: Marcin & Michael\n\nStory: Thomas\n\nOver 20 years pro experience\n\n30y Pen&Paper XP"}