{"id": 369086, "author": "", "title": "Tales In The Blocks|Collab-writing", "url": "https://cardano.ideascale.com/a/dtd/369086-48088", "category": 26103, "amount": 11600, "description": "Writing and drawing are seen as single person activity, what could be the result of a collaborative piece?", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=34779"], "media": [], "f6_assessments": [{"q0": "This proposal aims to add a cooperative story writing/ illustrating tool to the cardano network. I think it´s a unique idea in the area of \"zines\" and \"fanart\" and other sites and it adds collaboration, I find it very interesting. The proposal does a good job at explaining how they would utilize the network, involve ADA and create growth for the network. Key applications are the collaborative writing tool as well as the option to purchase NFTs of the work and interactive features as well as voting. It could create a community that is interested in art/writing/collaborating and it has potential to engage community members. I have given 4 instead of 5 stars since for this funding round, because of the risks that the platform would not be used. In addion to the good ideas of the proposers to publish now contributions on social media, more outreach, marketing etc efforts should be added to the idea. I recommend that the proposers - maybe in a future fund - request additional monetary support for outreach and marketing to make sure that the tool is being used.", "q0r": 4, "q1": "User interface is already developed and I added a sentence to the existing demo story and it worked. It is a fun and engaging activity. In addition to prior work done on this project, the proposers also provide information about their background and experience - which match the intended outcome. It is highly likely that the project will be implemented as stated. Financial budget is broken down clearly. Maybe for fund 7 or 8, if this project gets developed, it would attract users if a prominent writer would start a story that users could add to. The same would go if the stories are \"themed\" or if a charitable cause might be one of the marketing ideas (well, I´m not suggesting that charity is marketing, but it would be an addition that could attract new users AND be charitable). So I would recommend to start the project and maybe request further funds for special marketing ideas in a future fund. Ongoing work on developing the idea and iteration of the project (the proposers describing their thinking on how to solve the problem of the costs for contribution) shows a high dedication of the two proposers to their idea and honestly, if people are dedicated to doing something, that will make it even more likely that the project doesn´t \"die\" and will be not only implemented, but iterated and developed further. I would add as a risk that a user has to pay for most actions, which might limit the amount of people that would contribute (to start the website to gain traction). Maybe more brainstorming on this topic would make the tool more attractive for new users - for instance add some free things that can be done, so maybe then a user would want to spend some money to do a specific task. I think most websites and tools work like that. Some things are free, but more interesting and desirable things are not free.... so I would recommend thinking of the pros and cons of this topic some more: some free things will make it more likely that more people engage with the tool and this in turn might attract more people and so on .... ", "q1r": 4, "q2": "Roadmap is very actionable and allows for high auditability, milestones are set clearly and are feasable, especially with the prior work that has been put into the project, launchdate is set for the start of next year. Challenges and risks have been addressed with the costs of 1 ADA to contribute being possibly too high. I tend to agree, but the proposers already are working on ideas how to tackle this limitation, which is good and shows that they iterate and develop their idea. The measures of success are great! Very specific, very measurable. Problem statement and solution match very well. Additionally, giving options for collaboration, creativity and including voting is part of decentralization, making this project very suitable for the network. ", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Whilst the proposal doesn't describe a problem specifically I can clearly see how this product would help to attract users to the Cardano ecosystem as it offers a platform that could be used by educational institutions. If this isn't successful then my advice would be to describe the problem and solution more clearly. ", "q0r": 4, "q1": "I have followed the provided links to Dehlic.it and I can see that the company does have experience in creating interactive and useful websites.\r\nTheir plan is well presented and thought out and shows clear attention to detail.\r\nThey have also provided a link to a working design that allows us to see the concept in action which goes some way to illustrating that the core infrastructure is already in place.  ", "q1r": 4, "q2": "The KPIs that have been provided a very detailed and if successful could easily provide the metrics required to prove that the solution is a success or not. \r\nFrom my own experience adding a timeframe and an expectation to KPIs fro the outset is a good way to benchmark success, which they have done here. of course, KPIs can be adjusted as they get closer to delivery. ", "q2r": 5, "assessor": "z_assessor_518", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal meets the objectives of the challenge well because it promises to create a kind of game based on a concept that already exists, which is a story created in a group (each person writes/draws a part) and relates to blockchain and transactions in ada. In this way, the attributes of our ecosystem can have this more playful function, and in a very simple way, that if built in a functional and ergonomic way, it can become very popular, increasing the number of transactions in ada and attracting a new type from audience to community. I found it very promising to use the basis of this idea for other contexts, such as for educational purposes, as the authors mentioned to be a possibility.", "q0r": 5, "q1": "The proposal's authors seem technically well prepared to execute it, although they don't elaborate on their descriptions. I think this because of how the construction of the game is detailed in the auditability, as I will mention in the comment below, and also because there are already prototypes of the idea. However, it would be interesting for them to attach more details about themselves in the proposal description, such as previous works (since they are quite experienced, apparently), tell us more about their interests, perhaps attach linkedin profiles or social networks... In my view, there was a lack of detail in relation to who they are, but because of the content shown, a very solid security is passed in relation to the technical capacity to develop the project.", "q1r": 3, "q2": "Regarding the auditability of the proposal, everything is very well detailed. Here we have the small parts, small activities that will result in a whole, how long each one takes, including in what order they would happen. It is also calculated how much money would be needed for each part to happen. Unlike many proposals from this fund, it is a relatively simple idea, in which the work of a very large team is not necessary, making the authors enough to make the game happen. Its very functioning is also very detailed, how Cardano would be listed there, how transactions would take place via ada, including how much ada would be needed to do each thing. So, there are no criticisms regarding this part of the project, everything is very well clarified.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "WOW! That is the true definition of \"Innovation\". High praise to the team. Great potential and great way of linking blockchain technology, art and governance to the subjective value each branching could give in form of an NFT. ", "q0r": 5, "q1": "Given the track record and current work being done as well as experience in the process the team shows great passion and knowledge on jow it can be implemented sucessfully with Cardano.", "q1r": 5, "q2": "The project has great KPIs, stage by stage plan, transparent funding allocation and part of the development well under way. Good luck team.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Build a platform to create a gamified experience to write and illustrate game-book tales in a collaborative way using the blockchain.", "experience": "\\-++Dehlic++ 9 years experience in Web/Mobile development\n\n\\-++Atto++ 8 years communication studio (founders +13 years experience in design&branding)"}