{"id": 369136, "author": "", "title": "Fight scammers & protect Cardano", "url": "https://cardano.ideascale.com/a/dtd/369136-48088", "category": 26103, "amount": 8000, "description": "The growing scam problem threatens entire eco-system, the community and all users, potentially stealing unrecoverable value from all", "f6_no_assessments": 6, "f6_rating": 3.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "Scammers are getting better tools these days. New people to the space are especially vulnerable.\r\nYou want to solve a lot of problems, but there is no plan to generate income. Creating a platform that incentivizes reporting scams is a good idea, but where would that incentives come from. Running a stakepool can help with this. Or maybe getting stakepools involved with this project to help pay incentives to community members reporting scams. People delegating to these pools receive extra rewards when successfully reporting scams.\r\nEventually if SPOs needs delegators they will come to you.\r\n", "q0r": 3, "q1": "There is a lot of factors at play here and a lot of possible outcomes depending on the approach and team behind this. To attract more team members to actively join you, I would suggest you ad more info and evidence regarding your experience. Like past projects you worked on or a profile site. Github page etc. Even a prototype of what the website could potentially look like would give voters and CAs a good glance at your skills. Don't give up on this project. Keep looking for people to help you and join you on this journey. With the right team you can make this project become a reality.", "q1r": 1, "q2": "Definition of success is clear, but no roadmap or KPIs are given. This will all be easier to do with a full\r\nteam behind this project. Project also seems a little ambitious. Focusing on many different integrations.\r\nMaybe focusing on fewer, more important ones and providing more detail on how they will be implemented will make some of the goals more clear. This project can always evolve to include all problems, but I think you should focus only on a few at first and tackle more the bigger your team and community becomes. The bigger the community behind this the quicker they will also identify new upcoming threats.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "Creating a platform to report scams will help users to be aware and will help fight scammers as soon as possible this addresses the challenge", "q0r": 5, "q1": "The proposer has required experience for the platform and has provided the detailed plan hence it's liked this proposal will be successfully implemented", "q1r": 5, "q2": "The proposal doesn't consist of a timeline or fund break down hence it will be hard to track the proposal's success and would have helped to audit the progress", "q2r": 3, "assessor": "z_assessor_317", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Development of a DApp to assist in educating users and combating scammers would certainly address this challenge. I 'Strongly Agree'", "q0r": 5, "q1": "Having many years as an IT Manager / Project Manager and being faced with new challenges all the time, I have reviewed your proposal.  I believe you have the technical experience and also like that you are a Plutus Pioneer (2nd Cohort).  I also like that you have declared upfront you are new to this idea but feel an urgency to make something happen that would help protect the Cardano Community.  I wish you had a clearer path of execution but understand this is more of a pilot project into the subject matter and may take more efforts in future funding.  I think the budget listed is reasonable since this first effort may not be so much coding as exploring what to code. For this reason I'm selecting 'I Agree'.", "q1r": 4, "q2": "This effort will be auditable when you begin collecting information and getting / giving feedback to the Voting Community.  'I Agree'", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Fighting scammers is important to the ecosystem in order to provide trust for potential new users of the Cardano ecosystem. If implemented successfully the proposal could accelerate adoption. ", "q0r": 3, "q1": "Although the team provided a link to news websites, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\".", "q1r": 2, "q2": "The team provided a no roadmap and single line budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond a single line entrie and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Scam management in Cardano will define adopter experience. There is a need for a unified system for the identification and reporting of Scams in Cardano.  The most simple system is a site for users to submit links/addresses and another community member gives the remarks. A better system will provide rewards in terms of social ranking/ monitory benifit. Therefore the proposal is very relevant. ", "q0r": 5, "q1": "There is limited reference to the proposer's experience however based on the claim and the details in the proposal it is very likely that the proposer will be able to link up resources in terms of developers to build the app. ", "q1r": 5, "q2": "The app/web app will be the deliverable and will be open source which has not been explicitly states in the app therefore the progress is highly trackable and the success will be based on the community interest in the project.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal would bring tremendous value to Cardano and blockchain/DLT as an industry.\r\nFinding a way to educate, monitor and warn users would give the industry a better reputation and draw investments into Cardano rather than other platforms.\r\nThe only caveat I have is that the plan and vision is a bit vague. As a Solutions architect I have reviewed many different proposals for development. While there is an abundance of good ideas, few are executed and realized in line with the vision. \r\nWhile I whole heartedly support this initiative and idea, the proposal needs more detail, as I'll expand on in the other assessment sections.", "q0r": 4, "q1": "The idea is great, and the proposer, being a Plutus pioneer might have some of the dev skills required, but the execution plan is not well developed. \r\nThere are good ideas and concepts in this proposal.\r\nAn API platform, with reward incentives is a good concept. But as stated in the \"Detailed plan\":\r\n\" First stage would be an assessment of the problem, drawing together input and information from across the space to ascertain more precisely the scale and nature of the problem, and to get an idea which starting point would be likely to deliver the greatest benefits for the community in the shortest time, given the resources.  Then it would be the task to use this information to start to design solutions which align with the vision detailed below.\"\r\n\r\nThe detailed plan is a prestudy with unknown (or undocumented) skill and time requirements. \r\nThe proposer would have to detail much more on the activities needed, the skills required and an estimate of how much time that would take and an estimate of the cost of the above.\r\n\r\nAfter the prestudy there is the implementation tasks, which is unknown at this stage, as the result of the prestudy is yet to be discovered.\r\nThat there is already a presupposition that a platform would have to be built is probably a tech bias given the background of the proposer (nothing wrong with that, being a tech person myself, I would also presuppose this, but one should have as open mind as possible when going into a prestudy).\r\n\r\nThere is no discussion of risks or challenges to the initiative nor any references to other projects like this.", "q1r": 2, "q2": "As stated in the proposal this is the proposers first proposal. The idea is great, but the plan needs a lot more work. So please take these points as feedback, not personal critique.\r\nThere is little to no breakdown of costs, skills or time required. Thus the requested funds does not seem to have any plan or process behind it (as documented in the proposal at least).\r\nThere are no measurements mentioned with which to measure if the initiative is successful or not.\r\nThe plan is to first gather information, but there is no activity to report back findings to the community. The progress of this initiative would be nearly impossible to track, given the information provided.", "q2r": 1, "assessor": "z_assessor_533", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "I propose to solve by means of one-stop \"protect\" application or platform aimed at all users for reporting, collating, evidencing, educating", "experience": "Technology Consultant, Facilitator, Technology Tutor, prior experience as programmer/developer, Plutus Pioneer (2nd Cohort)"}