{"id": 369107, "author": "", "title": "Estati - Real Estate Investments", "url": "https://cardano.ideascale.com/a/dtd/369107-48088", "category": 26103, "amount": 24000, "description": "How can real estate transactions be facilitated on the blockchain using smart contracts?", "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does meet the needs of the challenge. It proposes to bring a real-world financial transaction, real estate sales and rentals, to the blockchain. It is perhaps the most significant of real-world utility projects.", "q0r": 5, "q1": "This proposal team has already won funding in Fund4, and has met many of the milestones for their project. This project has wisely chosen to fund small portions of the overall goal over multiple Funds rather than seek a large bulk funding. The team has, with prior funds, contracted companies to develop the portions of their plan that they lacked experience with.\r\n\r\nThe level of experience and the plan presented have a high level of confidence for completion.", "q1r": 5, "q2": "The ultimate goals of the project are easily audited by transaction and marketing figures.\r\n\r\nThe choice by the proposers to segment their funding requests over multiple rounds of funding gives the community unparalleled opportunity to audit the project.", "q2r": 5, "assessor": "z_assessor_218", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As an investor myself I am excited of the possibility of fractional real-estate investment. I would like to use this system myself. It goes to show this definitely meets the challenge brief: a value-adding dApp.\r\n\r\nMy only criticism is that the proposal lacks competitive / historical analysis: why should this succeed while so many crypto real estate projects have failed before?", "q0r": 4, "q1": "The anonymity of the CTO is not a promising sign at this point. There might be personal reasons, I understand, but to get 24,000 USD you should be able to publicize your team.\r\n\r\nOn the other hand, it sounds like most of the money actually goes to paid services (marketing & smart contract development). Because of that, more explanation of these service providers would have been in place. Why them? Who are they? What is their track record with Cardano specifically?", "q1r": 2, "q2": "The 80% / 20% division is not enough. Please, in the future, provide a more detailed budget and show where the money goes exactly.\r\n\r\nNow this requires a bit of a leap of faith from the voters. Impossible to know if this funding round will yield results or if the proposer comes back to ask for more funds in later funds, as is mentioned.\r\n\r\nIf you don't get funding now and come back in Fund7, please show a way to financial sustainability - how will you make this happen independent of Catalyst funding?", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "1 - Historical analysis of competitors have been analyzed in F4 and the community has given a lot of insights. To concentrate on the project development and future goals this analysis has not been included (please refer to F4 appliaction).  2 - CTO asked not to disclose the name due to other projects and equity positions. We also haven't secured the funding to move forward, so this would be a \"false information and reputation damage\" if we don't secure the funding to move forward... 3 - track record, the CA has not checked the partner website and information, they only specialize in Cardano development and already have a product to show that they are working on. Some information is also confidential and cannot be shared with the public yet.  4- yes, most finances will be spent on the product development. Well this is the whole reason of the Fund to help build products, right?  5- 80/20 distribution is very standard, we need to cover some marketing costs as well. We don't know ecxactly how much SEO will cost, how much FB ads, etc. Also depending on the project status, maybe 100% of the financing will go to project development instaed of marketing. 6- how will it grow without Catalyst - it's clearly stated in the application that we already closed one sale and got a commission fee. This already shows profitability potential without Catalyst, but everything has been done manually and without any smart contracts (based on trust and agreements)"}, {"q0": "Investing in real estate is illiquid, and if there is a method for shareholding a property that can be traded in small quantities, it can lead to liquidity and a host of other financial innovations. However, there are legal complications and requirements of regulatory backing. Even with all the constraints, if some viable method is introduced into real estate transactions be secured using a smart contract, there is a scope for more such experiments. In this light, this project is a step in the right direction. ", "q0r": 5, "q1": "The proposer has sufficient experience and is running a verifiable business online for real estate in USA, UAE and Germany. The proper is most likely capable of implementing the proposal successfully. ", "q1r": 5, "q2": "The cost projected is reasonable, and measured steps show professionalism. The deliverables of the current project are Smart contracts and for infusing momentum in marketing. The MVPs are achievable and measurable; therefore, the proposal's progress can be audited, and the successes can be measured accurately. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal corresponds very well to the objective of the challenge in which it was inserted. The idea is to create a platform for real estate negotiations, buying and selling real estate, in which transactions are coined in blockchain. In this way, technologies from the Cardano ecosystem will be used to perform a very everyday task, in an innovative and safe way. In addition to using the blockchain to record transactions, the site proposes that payments can be made in cryptocurrency, which is also a positive point for our community. The site mentioned here already exists, and is very well structured, UX design leaves nothing to be desired, and it is always positive when an idea already exists in the real world and the background aims to boost it or add changes (improvements), how is the case.", "q0r": 5, "q1": "Regarding the team's ability to carry out this proposal, they are certainly very well prepared for this. We know this for two reasons: First, we are told the names of the team members (less than 2, and that's okay, although it would be more interesting if we had this information too), and a brief description of what they do professionally, in this case , one person and 2 companies, from what I understand. It would be even better if we had linkedin links or the specialized website of the companies, to get to know them more deeply. And secondly, during the presentation of the idea, we are informed of some things that they have done before, as they were covered in the financing of f4, such as a guide on how to do real estate trading with cryptocurrencies. And about the roadmap: we have very clear notions of what the next steps will be, as well as some success metrics, which allows us to have a good idea of ​​the next steps to be taken.", "q1r": 5, "q2": "We are informed about the next phases for the development of the project, which are basically the development of smart blockchain contracts and marketing + domain. It's very satisfyingly detailed what it would be like to develop the smart contract, where ClearContracts.io would take several small steps to make the technology happen. In addition, the team establishes dates for the results to be delivered and success metrics, which makes the monitoring of the community towards the project more accurate. In addition to all this, the team is concerned with making it very clear what the impacts of this change on the existing site would be, how it would benefit users, which is extremely positive. Few proposals draw such a solid bridge between idea and audience. For these reasons, I believe that the auditability of the proposal is perfect, with no points to criticize, just praise.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "All-in-one Interface to facilitate real estate transactions (buy and sell) using smart contracts on Cardano Blockchain", "experience": "Donatas Varnas - Entrepreneur, Real Estate, +6 years   \nCTO - ex-2 startup CTO, +9 years  \nClearContracts.io - Contract development partner"}