{"id": 369118, "author": "", "title": "Gamify Your Life using Cardano", "url": "https://cardano.ideascale.com/a/dtd/369118-48088", "category": 26103, "amount": 60000, "description": "I'm trying to solve the problem of keeping people motivated and engaged in achieving their tasks / goals in real life using a Gamified App.", "f6_no_assessments": 7, "f6_rating": 2.476190476190476, "videos": [], "media": [], "f6_assessments": [{"q0": "Gaming and Crypto has a bright future so there is a community ready for a project like this. Habatica is quite a successful product. Creating something similar with play to earn mechanics can be an interesting project. You have to find ways to keep people from exploiting the game mechanics though. Creating a bunch of tasks and solving them as quick as possible to get rewards is one way people will exploit this. Getting more members onboard will help you solve potential problems like these.", "q0r": 4, "q1": "Please provide more info and proof regarding your experience. The more people know about the mind behind the project the easier for them to trust you. Potential team members will also want to know more about you and your abilities. Adding content to your proposal that was made by you will also give a feel to the voters and CAs of your abilities and commitment. The plan seems sensible and the budget seems reasonable for the potential\r\nteam behind this project. But it would be beneficial if you already have the team before receiving funding.\r\nPeople are more likely to vote for you if they see an already focused and committed team with a solid plan.", "q1r": 2, "q2": "No real roadmap or KPIs is provided and most likely because of lacking team members. Team members are essential at identifying future obstacles and constructing a plan with viable solutions. Also team members will be able to provide better estimates as to how long it would take to reach certain milestones. Don't give up on this project.\r\nJust focus on making your proposal more attractive to potential team members by providing\r\na little more info about yourself and proof of your skills.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "As a developer I see that the proposer understands the challenge and the complexities of producing such a DApp. IF the DApp succeed it can definitely help to achieve the challenge's objective, both at attracting more users to Cardano's as well as to increase transaction volume.\r\nIt does lack a more detailed plan both on the expected deliverables and milestones and on the structure of the team. The amount requested seems reasonable for a DApp such as this, and the expected first MVP time frame. You mentioned smartcontracts and off and on chain usage, not very clear what part of the DApp the blockchain will support, I assume you have that figured out, per your experience. I do suggest though you clarify this as soon as possible if you get funded, to validate technical feasibility.\r\nAs an Entrepreneur and Business Leader, I don't see a clear monetization strategy, neither a go to market strategy, so the requested funds could potentially be not enough. I understand that this will deliver a first MVP (For Friends and Family and Hypothesis validation) and more funds will be needed in future stages. I do recommend you add a statement about how are you planning to growth and if you are expecting more funding form the Treasury in future rounds. ", "q0r": 4, "q1": "There is no detailed plan or milestones, just a general 3-5 months estimation with no detailed team and efforts. So it is not possible to give an educated opinion on wether the project will be successful o not. I would love to see a more detailed plan, team composition, DApp modules or general architecture, so the project can be assessed clearly. Not having this plan, create also doubts about the budget requested, as it cannot be validated nor even analyzed. A detailed plan should be provided explaining all this topics and a breakdown budget to understand how do you plan to use the resources provided.", "q1r": 3, "q2": "As there is no detailed plan, neither KPIs or metrics to be measured, there will be no way to audit the progress and success of the proposal.\r\nIf you add a detailed plan, milestones and a breakdown of the budget, it will make this project auditable.", "q2r": 1, "assessor": "z_assessor_288", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I would like to love the idea but I don't.\r\n\r\n1) I hate notifications so battling pop-up messages doesn't sound like fun.\r\n\r\n2) If the point of the game is to essentially become a better person in real life, all this hunting and gathering for digital goods (and pets) might dilute the original idea.\r\n\r\nReading the comments section, a thought occurred: have you considered making this a fun productivity-enhancing app for workplaces? B2B market might be better suited for this than the cluttered B2C market with the avalanche of time-wasters available in App Store and Google Play.", "q0r": 3, "q1": "The proposer: \"I will be responsible on gathering this team and/or would warmly welcome anyone from our Cardano community who is willing to take part on this idea.\"\r\n\r\nTo get $60,000 you need more than an idea. And you need that team at least half-ready. Now you don't have either.\r\n\r\nPlease get to the drawing board, gather the team, finalize the proposal with more meat around the bones and you will get the funding.\r\n\r\nThe fact that you are a software engineer and gamer yourself is a great start. Do share your professional profile and let people know what you have built before.", "q1r": 2, "q2": "More than a full-fledged proposal this functions as a teaser and recruitment ad. Hopefully you get the team together and come back with a solid plan in Fund7. Whatever happens, don't get discouraged. dApp development is a rocky road!\r\n\r\nI am an IT consultant so I have some perspective to evaluate the maturity of this proposal.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Starting the problem statement with 'I am trying…' already shows the deficit of this proposal, which is more a vague idea instead a ready-to-implement project. As an application it is in the right challenge. However, by not providing a clear project plan (especially almost no technical details) the impact of this proposal remains unclear.", "q0r": 2, "q1": "As mentioned, the presented project is in a state of ideation, but no executable plan is provided. Starting with the team, we have no proof-of-life of the proposers. No references or links are provided. A team is required, but not there yet. Furthermore there is no detailed roadmap, which shows a step-by-step implementation plan. As developing this Dapp is just the half of this project. For the second part (go to market) there is no strategy explained. Also, there is no budget breakdown, so we can not say if the requested amount is reasonable.", "q1r": 1, "q2": "There are no metrics like how many users, etc. provided. No Github or similar documentation source is provided. The funding is for an MVP, so further funds are needed. What is the business model for maintaining this Dapp? As the idea might be a good one, this project need much further refinement (see all mentioned aspects) in order the get a higher rating for all criteria. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Games within cardano are a great idea however this proposal does not effectively addresses the challenge", "q0r": 3, "q1": "The experience of the proposer is great however the plan is lacking developers, artists and game designers at this point. The game also states there will be rewards with ADA but fails to mention where the ADA will come from.", "q1r": 3, "q2": "The information provided is lacking a team of professionals who can develop this game at this point and mentions the team will be sourced after funds are received. As mentioned the rewards using ADA must be addressed as the funds need to come from somewhere, perhaps a token? At this point I lack confidence this proposal will be successful ", "q2r": 3, "assessor": "z_assessor_523", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "In regards of mass adoption I can't really say without investigating success of Habitica personally but where are the funds to maintain the playtoearn mechanism of this solution comes from? who monitors that the tasks are completed/penalized? if it's  done by the individual it could be exploited. And if someone monitoring the task manager then is not decentralized.", "q0r": 2, "q1": "The proposal has potential to be implemented sucessfully but funds wouldnt cover the amount of team members needed to produce a workable product unless there is some extra funding source not specified in the proposal although the proposer did mention is the MVP with small resources. More clarity on this regard could strengthen this case.", "q1r": 3, "q2": "A stage by stage detail of the plan is missing as well as how the project advances in 1, 3 and 6 months roadmap after fubding that could bring more transparency to the progress auditing. So.e KPIs added to the proposal can strengthen this case.", "q2r": 3, "assessor": "z_assessor_594", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The idea seems to be clear (as it is to copy an other game) however, to be sure to have a sufficient community for this game, you should try to estimate how many people from habitica are cardano users and should be interested in changing of game. ", "q0r": 3, "q1": "In my opinion, you have well describe what skills you need to achieve the projet but the description of the team is partially done thus it is not clear of how many people you really need to start the project. An exact description of the team should be done.  (an organisation chart for instance?)\r\n\r\nYou should also clearly say if you already have people interesting in working in this project.", "q1r": 3, "q2": "the planning seems in my opinion too light. You said : when the team is created, it will be 3-5 months of dev but there are no proof or exemple of this duration. You should describe more this planning with the main phases of dvpt \r\n\r\nYou should also describe more how the business work... you say that people are able to buy object in the game (in ADA?). Is it how your business will work? You also say that acheving tasks in real life will also earn ADA in the game but you don't explain from where those ADA come?", "q2r": 2, "assessor": "z_assessor_602", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Create a Gamified (RPG-like) Task Management System using the Cardano Blockchain similar to Habitica - https://habitica.com", "experience": "Full Stack Software Engineer with 17 years experience\n\nSolutions Architect\n\nPlutus Pioneer\n\nBlockchain Enthusiast \n\nEntrepreneur\n\nGamer!"}