{"id": 369292, "author": "", "title": "Car service history", "url": "https://cardano.ideascale.com/a/dtd/369292-48088", "category": 26103, "amount": 150000, "description": "There are a lot of cars on the market with \"grey\" history often people buy based on verbal declaration fro sellers or paper-based records.", "f6_no_assessments": 7, "f6_rating": 1.9047619047619047, "videos": [], "media": [], "f6_assessments": [{"q0": "Its a nice basic idea but it needs more thought and planning", "q0r": 2, "q1": "I believe for this to work we are bet to go down the atala prism route where there are issuers of credible data and people receiving that data defined. In this case the issuer would be car repair companies and instead of people getting the information it would be vehicles. There is plans for atala pinoneer program but iohk is not ready to deploy yet", "q1r": 1, "q2": "The amount of requested funds appears very high to me and I would like to see more credentials and qualifications. Who is the team? what are the milestones? how is the money being allocated? how is it going to work witht the various types of people involved? if you can answer these questions then I will consider voting for in a next fund", "q2r": 1, "assessor": "z_assessor_119", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposer does not provide adequate information on his idea, so efficacy is not clear. But I remember that vet partnered with BMW and does a similar thing, so the proposal - if implemented - could be addressing a similar topic. Here´s the text about the other project, to be noted, I copied this sentence for informational purposes: \"Vechain has recently partnered with BMW to develop an auto security platform, which will keep vehicles free from forgery. The partnership will launch a blockchain-powered app (dApp) dubbed \"VerifyCar\" to collect vehicle data such as mileage, repairs and additional services. The dApp will run on the VeChainThor blockchain and will keep the data secure and untampered.\" However, the proposer would have to indicate how he would utilze the Cardano network.", "q0r": 3, "q1": "It is not clear if the proposer has enough experience to implement this idea - the proposal does not provide relevant information on financial budget, actionable steps, milestones, roadmap, experience of proposer, intended use of Tokens, NFTs, ADA, applications. Without these information, this proposal is unlikely to be implemented.", "q1r": 2, "q2": "Auditability is based on information provided not possible - the proposer should add details and documentation. Respective: Milestones, Roadmap, Launch date, Team and Experience, financial allocation of budget, risk-management. Definition of success - how many users will be using the platform and why? Will there be partnerships with car-dealers? Will there be smart contracts or NFTs for the information? .... and so on.", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal clearly states a problem (unsecure car records) and adresses it with a solution (blockchainbased records). Both problem and solution could be more detailed and contain some key metrics. ", "q0r": 4, "q1": "Any smart-contracts on a blockchain are complicated to write and take a lot of effort. Since the proposer does not have programming skills he would need to find devs first. The proposal doesn't contain any information about other possible team members, doesn't have a laydown of the budget and does not have a clear roadmap. These are the reasons which do not make me think that it will get implemented.", "q1r": 1, "q2": "There are no key-metrics of sucess and step-by-step roadmap. There is also no clear description on how the proposer plans to takle the problem. Since there are almost no informations in the proposal it is really hard to assess.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Draft proposal. \r\n\r\nThe problem described is reasonable and I see that keeping records/data of automobiles in blockchain is a promising concept and already used in some projects.\r\n\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 3, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal lacks information regarding the challenge ", "q0r": 2, "q1": "There is no plan on how this will be done, no roadmap and no transparency on where the funds will be allocated ", "q1r": 2, "q2": "This proposal is lacking information on details on how, where and when. Much more information is needed to create confidence in this proposal. ", "q2r": 2, "assessor": "z_assessor_523", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses an interesting use case that cries out for implementation with a blockchain. The service history of a car is difficult to prove today, as everything can be written on paper. The Cardano ecosystem can thus help to make the history of a vehicle credible and traceable.", "q0r": 4, "q1": "Successful implementation of this proposal depends on several components. On the one hand, a development team that knows the Cardona Ecosystem well is needed. On the other hand, it is almost more important to find good partners in the industry who are ready for a pilot. This proposal depends very much on these partnerships. For good partnerships to happen, the final product must have a very high quality. I cannot estimate this from the description.", "q1r": 3, "q2": "I would like to see some criteria or objectives here on the basis of which progress and success can be measured. ", "q2r": 2, "assessor": "z_assessor_557", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal in very interesting and could be made into a great Dapp integration to Cardano blockchain. But more details hkw this can be achieved to reach mass use for it to be viable use of funds for the return on investment.", "q0r": 3, "q1": "The proposer has great insight in the Car servicing aspect of the proposer but more information regarding hkw it will be deployed on areas of the industry where this can be widely used as well as what jurisdictions and Country. How it plans to market it and hkw it plans to develop and link to the blockchain needs to be made clear.", "q1r": 2, "q2": "There needs to be more information regarding how the large amount of funds are allocated transparently. What is the roadmap and timeline for deliverable MVP in the next months after funding to audit the progress of the project. This proposal requires more information to strengthen its case for auditability.", "q2r": 1, "assessor": "z_assessor_594", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Create a platform to keep secure car service history by WIN on the Cardano blockchain.", "experience": "Operations Manager with 15 years of experience. Founder of the uhood.ae - online platform for car servicing"}