{"id": 369515, "author": "", "title": "Develop to Earn", "url": "https://cardano.ideascale.com/a/dtd/369515-48088", "category": 26103, "amount": 44500, "description": "Open source developers are not rewarded monetarily enough. Platforms offer nonredeemable \"points\" for contributions rather than crypto.", "f6_no_assessments": 4, "f6_rating": 1.0833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Not very clear what is the problem to be addressed. No mentions of platforms/apps that can be used to integrate Cardano ecosystem or to build on top of it. No key metrics defined to measure the success. The proposal isn't able to scale and to address future challenges. No timeline for the proposal implementation. No resources (human/finance/stationary/apps) allocated for the project implementation. The idea is just in its incipient phase. No justification for the amount requested to implement the proposal.", "q0r": 1, "q1": "No team info or details about the experience/skill of its members. There is no plan to implement the proposal. The fund requested, $44500, is not sustained with a proposal. No risks and challenges associated for a successful implementation. Unfortunately, there is nothing to asses at this proposal, as is not a defined idea.", "q1r": 1, "q2": "No KPI/metrics defined to measure the impact/outcome of the proposal. No roadmap with milestones and a time horizon for achievement of the proposal's goal. No clear description of the targeted problem.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal doesn't really show how developers do not earn enough. It does not provide a clear idea how this would be changed if it was the case and how it would provide value to the cardano ecosystem.", "q0r": 2, "q1": "There is almost no plan presented and there are no informations about the team behind the proposal. They claim to be plutus pioneers but do not provide any proof of it. Since there is no clear description of the idea it makes it hard to beleave that the proposal is implemented successfully.", "q1r": 1, "q2": "There are no verifiable informations about the team, there is no roadmap and no success metrics. Since the proposal is really short it makes it quite hard to assess.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "There is no clear relationship between the problem presented and this challenge.\r\n\r\nDraft proposal. There is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 2, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "This proposal does not fulfill any firmal qualifications and should thus be ineligible for funds.", "q0r": 1, "q1": "No plan is presented here. No rationale for the funds and no proof for the claimed experience is given.", "q1r": 1, "q2": "This proposal is to underdefined to be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "A Codewars and Stack Overflow type experience that rewards contributors with Cardano native utility tokens with on-platform functionality.", "experience": "As Plutus pioneers and users of Codewars, Stack Overflow, GitHub and other coding platforms we find ourselves to be well positioned to help."}