{"id": 369613, "author": "", "title": "CcNFTs: Empowering Musicians", "url": "https://cardano.ideascale.com/a/dtd/369613-48088", "category": 26103, "amount": 1500, "description": "The Classical music field is dominated by centralization, making it dysfunctional and taking away from overall potential impact on the world", "f6_no_assessments": 7, "f6_rating": 2.5714285714285716, "videos": [], "media": [], "f6_assessments": [{"q0": "The music industry is in dire need of decentralization. There is a huge community ready and waiting for this. If successfully implemented this will drive many new people to Cardano. Plan needs a little work, but that will come with getting the right team on board.", "q0r": 4, "q1": "You need a team to properly workout the budget.\r\nA project like this needs people that knows the industry and also developers. Consider joining forces with Cardano music streaming Dapp. They already have a plutus developer onboard. I think your heart is in the right place and you would be a great asset to them.", "q1r": 1, "q2": "Proposal needs to join forces with similar proposal or get more experienced people on board. With the right team members on board this proposal's plan will be in better shape and you'll be able to identify more challenges and risks. Keep refining the plan while looking for others to join you on this journey. You need to find developers with the same vision as you, giving this proposal strong roots.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal would effectively empowers musicians to have financial control of their own creativity rather than the power being in some controlling body. The proposer also is highly creative and suggests a good approach. ", "q0r": 5, "q1": "The plan to achieve the proposal is clear. Alan has extreme credibility in the classical music field. With a small amount of cash it looks like he will have a huge impact. However it does look like writing a smart contract and finding the correct developers to do this work may be more expensive than anticipated. However this could be done if that work was voluntary, which should have been made clear and considered. ", "q1r": 3, "q2": "You'll be able to view the NFT's. It's not clear how the mint the Classical Cardano NFT. It would have been good to find out how he plans to onboard musicians onto the platform instead of just minting their own NFT's. ", "q2r": 3, "assessor": "z_assessor_332", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Since we don't have much in the proposal to go by I assume the proposer plans to use NFT as intellectual property to sell classical music. In the proposal, he also talks about using smart contracts for royalty payments. While in the detailed plan he talks about the creation of a dApp. This leads me to believe that the proposer does not fully understand the challenge settings. If the end goal of the proposer is to make an NFT based property for classical music it can be done on already existing Apps. How will this idea ensure an increase in users on the platform? I feel like this proposal is still in its baby steps and that the proposer still needs to search for more input about this before. It's a solid idea but it needs more elaboration. ", "q0r": 2, "q1": "Since I already gave about that I feel this is still in the early stage of an idea. I must say that I don't see this being implemented successfully. The proposer gives experience in the music field but this is not really relevant to making dApps. The proposer has not provided a verifiable plan in this regard. He talks about building a team but gives us no indication that he knows how many people he needs and what skills are required for the proposal. The fact that the proposer asks for others to help fill the gaps is a good indicator that he knows he needs help but this should be done before submitting the proposal. I would suggest that the proposer asks the community for help on this proposal al make a better proposal. Budget wise I don't see a breakdown and only asking 1500 for a creation of a dApp from scratch just isn't going to do it.", "q1r": 1, "q2": "The proposer provides a roadmap but there are no details on what steps need to be taking. The plan is missing technical steps that need to be done for the creation of dApps. The budget breakdown is also missing which makes it hard to assess where the funding is going. Given the lack of information, I don't see how the progress of the stated goals can be assessed succesfully.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The idea can make up for a good new usecase. However it could be presented more detailed.", "q0r": 4, "q1": "The proposer does not have experience with the technical part and has not set clear milestones. The budget seems to be an underestimation. It receives still two stars because the proposer at least seams to know the artist perspective very well.", "q1r": 2, "q2": "The only very brief formulation of objectives and milestones male it difficult to audit the proposal. It seems the proposer himself struggles to define the MVP.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Although a nice premise and a good idea, it has no method to achieve this and is in need of fleshing out. As a musician, I have experienced first hand the need for this, as copyright in the music industry is described as akin to the wild west. Limiting this to classical music will limit its success and use community however by changing the name to something more inclusive it will allow it to be more widely used. Also, with aspirations to revamp an entire system, a clear marketing strategy is important; details on how to entice composers and musicians is lacking in this proposal. ", "q0r": 3, "q1": "The experience shown in the music industry is helpful and was vital in identifying that this is an area in need of dire help; however the proposer lacks the skills required to form a successful strategy and enact it, meaning that partnership with both technical and marketing experts is required.", "q1r": 2, "q2": "No success criteria is provided. Target numbers of pieces using the CcNFTs by 3 months, 6 months and 9 months would be a good start. Also including usage by both small and large entities in the music industry would be useful.", "q2r": 1, "assessor": "z_assessor_525", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Really good idea here and while this Dapp may be a little niche, once developed it could certainly add value to the Cardano ecosystem. The problem identified is certainly valid and coming from a musical background the proposer will be able to connect with the industry. As is the case with many proposals the team to build the Dapp is yet to be established and this may prove as a roadblock to progress until that can be finalized. ", "q0r": 4, "q1": "The proposer whom appears to be a team of one at present certainly ticks the box on one side of the development equation. I have good confidence that he has the experience necessary from a classical music side. The technical development of the Dapp is somewhat problematic at present and I would encourage this aspect to be solved asap. The plan is straightforward although I have an inkling that it may need the technical expertise to truly define how this project can go forward and what a budget to achieve this would look like. ", "q1r": 3, "q2": "It is a decent proposal that would have been measurably improved with greater technical imput. That's not to say it cannot be done but considering the budget requested and the simplified timeline it does leave out much of the information required to assess auditability and ultimately success. I would highly recommend that a team of technical developers are brought into the team so that the roadmap can be thoroughly communicated to the catalyst community. A good starting point may be from the community itself. ", "q2r": 2, "assessor": "z_assessor_53", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal presents an idea using NFTs for classical music that could bring value to those artists throughout the life cycle of their IP. Musicians would have a way to ensure royalties and prevent interference.", "q0r": 3, "q1": "The proposer has expertise in music and I assume has relationships with musicians, but they do not state any development experience or how they plan to create this dapp and implement it in the real world. This seems like an early idea that hasn't fully developed its plan and does not have a team put together yet. Not sure that the budget is enough to develop this plan.", "q1r": 3, "q2": "This proposal gives is key metrics in order to audit progess and success, but they do not provide a timeline and concrete evidence. When going to audit, we would have to gather more information and define ourselves what success is in order to determine the progress and success.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Use CcNFTs as a foundation in giving artistic and financial autonomy to Classical and non-Classical musicians alike", "experience": "I received my MM in Orchestral Conducting from Peabody Institute of Johns Hopkins and have worked with world class musicians/institutions"}