{"id": 369851, "author": "", "title": "Ecommerce and lending platform", "url": "https://cardano.ideascale.com/a/dtd/369851-48088", "category": 26103, "amount": 50000, "description": "Today SMBs in India face a lot of problems like an aggressive promotional strategy from big eCommerce, lending, fraud detection,  SCM, etc", "f6_no_assessments": 3, "f6_rating": 1.3333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The project wants to establish an ecommerce and lendigplatform for medium sized businesses on the blockchain. The problem that should be solved is that medium sized businesses in india face \"aggressive big players\". That to me sounds not as a reasonable motivation. Especially as the projects mentions \"fraud detection\" as a problem for small businesses. ", "q0r": 1, "q1": "The project owner has \"zero experience\" in ecommerce.  There is no road map, no specifications on how the platform will look like. ", "q1r": 1, "q2": "The sole description of the project is basically \"ecommerce platform\". It is not auditable, there is no roadmap. There is no definition of success and the owner has zero knowlegde of ecommerce. ", "q2r": 1, "assessor": "z_assessor_296", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal highlighted a problem and offered a solution however the proposal needs more details.\r\nI disagree.", "q0r": 2, "q1": "The proposal did not provide verifiable links to given experience and did not provide implementation plan with the cost implication breakdown.\r\n\r\nI disagree.", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposed solution.\r\n\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Draft proposal. I would recommend providing more information about the context of the problem.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "A decentralized eCommerce platform that will tackle issues based on consensus & transparency. A platform for the SMBs by the SMBs.", "experience": "I have zero experience in ecommerce industry but I have good amount understanding and problems faced by businesses."}