{"id": 370175, "author": "", "title": "NAGchi", "url": "https://cardano.ideascale.com/a/dtd/370175-48088", "category": 26103, "amount": 9500, "description": "Finding the \"vehicle\" to drive mass adoption, increase utility, while educating and strengthening the security of Cardano is a puzzle.", "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no real plan in this proposal on what will be delivered or how it will be delivered.\r\nQuasar has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details", "q0r": 1, "q1": "Please provide a plan so that it can be evaluated. As it stands, there is not plan so it cannot be implemented successfully. Given the widely varying experience quoted for Quasar in all the other proposal submitted, some evidence should be provided.", "q1r": 1, "q2": "No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposer has not defined what success would be. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal for the problem statement chosen doesn't seem to quiet convey the message how it actually effects the mass adaption/utility apart from statement that describes about a game like feature.", "q0r": 3, "q1": "Given a Team of Elite people from software Engineering background in multiple industrial areas, they might be able to pull off this project efficiently although details about plan of execution would have been great", "q1r": 4, "q2": "The proposal is somehow missing details about the fund breakdown and also implementation plans or timeline which can be used o measeure the progress, hopefully can be added along with unwraped plans.", "q2r": 2, "assessor": "z_assessor_16", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Draft proposal. It is not clear what problem the proposal intends to solve. There is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is no plan, just some information about the team. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is clearly unfinished and does not fulfill the formal criteria.", "q0r": 1, "q1": "No plan, budget rationale or proof of capability are presented.", "q1r": 1, "q2": "Due to the complete lack of metrics this proposal cannot be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal does not provide any information on how it would provide value to end users, it only states wanting to create an onchain game in order to drive mass adoption. An onchain game could provide value, but without any further details I cannot properly asses that information.", "q0r": 1, "q1": "They do not provide any supporting material to the experience of their team, nor do they provide a plan on how they will implement this idea successfully. They have no measurables and no plan for their budget that is presented.", "q1r": 1, "q2": "This proposal does not provide enough information to audit the progress and success of this proposal. \r\nThere are no key measurables, no information on intent for budget, and no examples of success.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Onchain game based on anthropomorphic beings that will generate excitement within the actor networks and those yet to arrive.", "experience": "Senior Engineers, AWS, Enterprise Tech/Systems, Risk Narratives."}