{"id": 369838, "author": "", "title": "Tutorchain.io - for Entrepreneurs", "url": "https://cardano.ideascale.com/a/dtd/369838-48088", "category": 26113, "amount": 15000, "description": "専門家を見つけたり、自分の専門知識を収益化するためには、集中的な審査サービスが必要となり、選択肢が制限され、アクセスもコントロールされます。", "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a nice idea, however is is not clear how it fits this challenge. It is an app to line up tutors with learners. Whilst it could be used for mentors and mentees, the platform doesn't have the base of mentors to start with and it states the clear issue with the platform is getting started. The proposers have submitted a basically the same idea into 5 other challenges, with a different cost each time. In the metadata challenge it seemed to fit reasonably well.", "q0r": 2, "q1": "The proposer have the experience to set up the platform generally. However for the specific use case of Entrepreneurship, it is not clear they have the connections with experienced mentors to get it started. The fact they have sent it into different challenges with difference costs makes me wonder about what the budget should really be? ", "q1r": 2, "q2": "Delivery of the platform is easy to audit, however what's really important for this use case is how it will impact entrepreneurs. How many mentors can they bring onto the platform, what would they charge, could mentees afford these fees. A lot of the proposal are not for large sums of money, spending thousands of dollars on mentoring fees may not be an option for many proposers.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has identified a problem within the challenge. It is good to start with a 'niche' of targeted audience (profiled users) as along as you know exactly the people/resources in the environment your are living/working.\r\n\r\nThe proposal doesn't cover very well how it will add value to Cardano ecosystem. 'This money will get us started on the best chain out there' it's a statement that doesn't emphasize the truly benefits of using the Cardano ecosystem (Atala Prism API could be used for this project - DID component).\r\n\r\nThe proposal is missing in setting up KPIs/Metrics (i.e. what is the number of users that impact the app? etc.).\r\n\r\nThe ideea has potential, but this time it wasn't presented with a working plan.", "q0r": 3, "q1": "The proposer provides evidence (references) of skills and experience needed to implement the proposal. The proposer should take into consideration to assign roles to each member of the team for better accountability. Is not very clear, based on his brief bio, what is the programming languages Sam is using and masters. If you were part of a successfully implemented software project you should add references to it to sustain your skills.\r\n\r\nThe budget is defined but is not broken down into identifiable items. (i.e. Salaries - 2x$2000/month for 6 months, Web hosting services - $240/year etc.). The project seems to need additional funding and this should be taken into consideration.\r\n\r\nA timetable is provided but with no milestones clearly emphasized (i.e. 1 month - backend design and functionality, 1 month - testing/reworking 1 month -wallet integration and testing with the backend etc.)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. The proposer should define risks that can be associated with the ongoing plan (i.e. what if none of the onboarded users (students) don't initiate a contract in a time frame (1 month, 3 months - your choice)\r\n\r\n'We will be profitable with only a 5% cut' this is arguably a bad financial approach. Relative numbers looks good when they are low but for a healthy financial perspective they should be weighted relative to an accepted (positive outcome) absolute value. It is clear that this project needs a minimum threshold of necessary income to be running. If the '5% cut' from all the closed contracts in a period of time, doesn't cover your expenses, it's a good chance that this business will fail or to be needing additional funds (also this could be a risk to be taken into consideration)", "q1r": 2, "q2": "The problem has been identified but the working plan is not presented in a clear and understandable manner. \r\n\r\nNo KPI/metrics are defined (i.e. number of users onboarding in a time period, number of users that close a contract in a time frame etc.)\r\n\r\nPossible challenges are not considered. In conclusion, the progress of this proposal is hard to assess.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal was duplicated into the wrong campaign, or at least: the duplicate was then not tailored to that campaign. In this case: this proposal would need to contribute to the entrepreneurship community of Catalyst. This project could do so by, for example, developing an aspect of its app for Catalyst users to leave reputations for proposers, that would be on chain and off Ideascale, and that this proposal would fund just that aspect of the project (with it not being funded then the feature perhaps not developed, but then other proposals accepted: their features could be).", "q0r": 1, "q1": "I think this team could succeed in producing a proof-of-concept app as outlined in their proposal. I just don't think this campaign is the proper one that should fund it.", "q1r": 3, "q2": "Information is well presented and I can see their plans being detailed enough to where it would lead them to developing a prototype app.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal aligns with the challenge, they have a well-defined plan on how to help start-up entrepreneurs get mentoring and help in the development of proposals.", "q0r": 5, "q1": "The proposers appear to have experience in application development, as well as educational content development, however, there are no links in the proposal or on the website to check their background.", "q1r": 4, "q2": "The proposal is very good, they have a very clear idea of what they want to do, however it seems that the development is planned to start in early 2022, so it is not clear what they will do the previous 2 months with the funds received.\r\n\r\nThere are also no clear metrics to define the success of the proposal.", "q2r": 3, "assessor": "z_assessor_470", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal doesn't explain the problem clearly. I think you need to break this down for the voter's to understand what the Challenge is. Personally, I think you are trying to say that A marketplace for knowledge and tutoring will work better in a decentralized system. I still am not clear on how the centralized place isn't working. I think Cost, Match & Trust should be highlighted in the Problem statement. Also I think you are limiting this to academics if you stick to the term \"Tutor\" only. You can use more terms like specialists, consultants, advisors or advisers.... Your problem statement should be more like \"Finding an expert consultant/ tutor or monetizing your consulting/academic expertise requires centralized vetting services that limit your choices limiting your choices based on your budget, expectations and integrity of the Tutor/Student\".\r\nI hope this gives you pointers. Great Initiative and I know you have great prospects here.", "q0r": 4, "q1": "I noticed you have a well thought out plan/roadmap. I am however concerned about the resources you intend to allocate and I think Sam will need to get more buy-ins to get this ball rolling. Sam and Gabe appear to have the required experience but I think you will need a few more hands to meet those timelines stated.", "q1r": 3, "q2": "The milestones can be audited. However, how do we define high-quality tutors and functional marketplace. Can we get numbers and ratings(with defined criteria) included?", "q2r": 4, "assessor": "z_assessor_617", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "スマートコントラクトを使用して、金銭的な交換に関連付けられた検証可能な顧客レビューを保存します。専門家は自分がコントロールする評判を構築する。", "experience": "創業者は、ソフトウェアエンジニア（暗号化スタートアップの経験あり）と物理学教授で、家庭教師市場を獲得するためのスキルとコネクションを持っています。"}