{"id": 383644, "author": "mammoth", "title": "Woolly Mammoth de-extinction D₳O", "url": "https://cardano.ideascale.com/a/dtd/383644-48088", "category": 26237, "amount": 33000, "description": "The plans to de-extinct the mammoth will face numerous challenges and will require interdisciplinary expert input and public acceptance.", "funded": 1, "upvotes": 44294704, "downvotes": 9328870, "votes_result": 34965834, "votes_cast": 224, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=2655"], "media": [], "f6_assessments": [{"q0": "Brave! The proposer wants to de-extinct the mammoth using a DAO creating a consensus between scientists and regular folks. The proposer wants to solve part of the biggest practical problems that ever roamed the earth - climate change. Needless to say, this will bring value to the cardano community if they succeed and to the whole planet as well. Ambitious is the right word for this proposal. No need to express how exactly will this bring value, since I am sure all are in agreement here. There are mentioned metrics that include a staking pool being created to fund the organization, an NFT collection to market the de-extinction and a afew other interesting expected results. The proposal will be able to scale with future challenges, because it's a DAO that will be goverend by academics proving to be 60% of the DAO members.  This proposal surely adds something missing from the ecosystem and that would be the link from the technological back to the biological, which is curious to see. As a developer I have plenty of worries and concerns, but they are only about not funding this amazing project, because of misbelief. To ease the voters mind I'll tell you that the proposers won't be de-extincting the original mamoth, but a crossover with some type of african elephant, but still there will be some genome mixing. ", "q0r": 5, "q1": "The proposer has linked a lot of relevant references links and a whole site dedicated to bringing news to the community concerning the mamoth project. I was able to verify most of the names mentiones in the accademia circles along with some of the investors. The proposer has some idea of the type and number of team members required to implement the proposal, but it's too early to say the exact people that will be necessary. I can say though, that the project is underway and has been working for over 2 years. The budget is outlined and set up in items more than clear, I like how concrete evidence was given of money already spent and possible workarounds were found in order to have contributions in term of development instead of funding. That shows the commitment of the proposer to get the end result by whatever means necessary. I can't speak about how realistic is the timetable to revive the mamoth, but as a developer I can speak to the technical things mentioned like NFTs an pools to be created. These items from the roadmap are completely realistic and sensible. I'm not sure that I would understand the implementation of this project even after reading it for a year, but it nevertheless can be found by following the links from the proposal.  The proposal tries to explain the effects that the successful realization of the project will bring to the world with simple words. The project knows it's going to face many challenges along the way, but It has some experience with them already.  This is amazing, and actually seems feasable from a technical standpoint at least! Good luck to you and I hope you make it. I'll be following this project closely.", "q1r": 5, "q2": "No worries about the tracability of the project. Every community member interested will be able to follow the announcements in the telegram channel, on the site \"https://www.mammoth.news/\" ( yes, they've got the domain) or through twitter.  The roadmap milestones and the timehorizon seem reasonable for a creation of a DAO along with a pool and design NFTs. There's a clear and understandable description and a somewhat understandable solution to the problem, although all relations de-extincting a species will have is a bit too much for me to elaborate on.  I think any voter would be intrigued by the idea of reviving a mamoth, because we can! Again good luck to these brave souls. I'll vote for you! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Before I go full blown Jurassic Park here, let's take some things into consideration: The idea claims there would be a positive impact on the ecosystem if these animals were to be (partially) brought back. It has to be acknowledged that this is a theory that is not necessarily true. So before going ahead with engineering back an extinct hybrid, there is some ethical and scientific discussion to be held on the use of CRISPR to create hybrid species in order to change climatological circumstances. That said, it's not impossible to achieve and if it could all be launched by the funding of a Cardano staking pool, imagine the publicity that would generate around the world. This has the potential to really put this blockchain on the map big time and the effort merits an attempt at it, regardless of potential environmental impact as the herd could also be kept small if it turns out that the species does not benefit the climatological circumstances. ", "q0r": 5, "q1": "This is one of those make it or break it things that will either get a go ahead from the international community or a big no no as it intends on deploying complex genome editing technology. Therefore, the only correct stance on the feasibility of this project is neutral. The feasibility could be improved if the proposal mentioned team members that are yet to be sought. You will need an SPO, NFT-designer, webdesigner, plutus engineer and actual CRISPR-engineers and a facility to incubate the embryos. Especially the last part would cost some serious money, but as the intended DAO is aiming to become self-funding, it is yet to be determined if it will be able to raise enough funds. ", "q1r": 3, "q2": "There is sufficient information to determine the auditability on the aspect of creating the DAO and staking pool. Especially the funding breakdown is remarkably detailed. However, it is impossible to know when this first mammoth hybrid will take its first steps as there are long discussions to be helf with an unpredictable outcome. There will be a need for actual research data, excluding theory, to back up the project. As well as a risk assessment that investigates the potential impact of unleashing a new species into the wild in the vicinity of inhabited areas. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 11, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignment between challenge and proposal. It seems that this team wants to build a community around their project and therefore can attract new people to our ecosystem. Even tough this idea is interesting and has my support I don't see enough explanation on why this should be funded under this challenge and how it will positively impact the growth of Cardano.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development and research tasks. By the given information I think that this project is in the state of an idea rather than a ready-to-implement plan.", "q1r": 3, "q2": "\r\nThe team gives a schedule in which the solution should be released. In my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up DAOS in Cardano.\r\nI miss in this area that the proposer has not mentioned possible difficulties and market competitors and how to track the progress of this proposal. \r\n", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Great idea about mammoths and climate change but to match this challenge is a DAO solution I haven't seen mentioned. How the idea of ​​implementation uses Blockchain, how the DAO is applied, this should be fully complemented", "q0r": 3, "q1": "The proposal outlines the project's benefits on how to respond to climate change and mammoths, plans for NFTs and opening swimming pools, and details the costs needed to purchase domain machinery. How all this cost serves this challenge, building a pool I don't know what role it plays in this challenge. A lot of information needs to be clarified about the solution of the project", "q1r": 2, "q2": "Apart from the December 2021 roadmap to build NFTs and swimming pools, I have not seen any further plans to build DAOs. You need to add the DAO roadmap for the Token you want to issue. Who will participate in this system, how it works with benefits and risks. What are the indicators to be achieved for each route?", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "DAO incorporating scientists, ethicians, environmentalists, climate change experts and members of the public will facilitate a consensus.", "experience": "Understanding of democratic processes utilising blockchain.\nVery strong communication skills, experience in media relations and lobbying."}