{"id": 383950, "author": "jt.aussiegingersnap", "title": "Game development update podcast", "url": "https://cardano.ideascale.com/a/dtd/383950-48088", "category": 26253, "amount": 4500, "description": "El descubrimiento de los juegos de la CNFT está fragmentado y el seguimiento de los progresos significativos en Discord es desordenado.", "funded": 0, "upvotes": 17054967, "downvotes": 21134093, "votes_result": 4079126, "votes_cast": 110, "f6_no_assessments": 4, "f6_rating": 3.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "I am sorry - or I have failed to understand how this would increase audibility, or it has nothing to do with it. More like - increase the awareness.\r\n\r\nThe impact of this proposal is not in accordance with the challenge where it is listed.\r\n\r\nRating given 1.", "q0r": 1, "q1": "Visiting the webpage, this seems more like marketing rather than an actual proposal.\r\n\r\nIt is not in accordance with the challenge. \r\n\r\nRating given 1.\r\n", "q1r": 1, "q2": "The progress can be measured and the information is possible to audit, but it has nothing to do with the challenge. \r\n\r\nRating given 1.", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Nice to read your suggestion. What excites me the most is when you declare '' the Duo community is proud to call Cardano home.'' This team proposal also considered scales to address issues. the problem can be solved in the future, I am interested in your solution. However I think you should clarify how do you tweak and filter the game content? You should also clarify the criteria for interviewing or evaluating a game. Hope you will clarify some of the above next time.", "q0r": 4, "q1": "The proponent has provided enough information about the group, with your experience statement I believe that with your design experience, you will do well. However, you need to clarify who will be the person. moderate the content in the group, or who will build the interview content. Need more clarification on this. The budget is clearly stated in parts to be used, but also the profit from advertising you will use Here's something I've been wondering and needing clarification on. I'm also pretty excited for your 1st Episode, which will premiere on March 2, 2022.", "q1r": 3, "q2": "The promoter has not provided detailed information on the route to implementation. You have only given a broadcast time, so when will you release the content? but in return the team does quite well in terms of estimating the content to be produced. But the team is also lacking a few indicators to evaluate the success of the proposal. I hope the team will clarify and detail the actual steps in more detail. show up next time.", "q2r": 3, "assessor": "z_assessor_644", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The idea of a podcast channel of updating regularly the game info biweekly will help to educate and drive a lot of users to NFT game industry. Inside the proposal, the team also shows that they will interview 12 funded games from Catalyst and other non-funded games in the Cardano ecosystem. Therefore, this idea will make a strong impact on the development of Cardano communities. \r\nMoreover, their measurables also include some key metrics about the traffics of views, downloads, and listens to the podcast that is the direct impact to make users get into the game. ", "q0r": 5, "q1": "For this simple project, the team has a detailed picture of what they going to do. Including regular video clip publishing, content that will make... I hope that the team can provide some more about the marketing plan instead of just the production process because it will help this idea spread the content faster. \r\nHence, the roadmap they give is enough and fits with the budget they want to be funded. \r\nAfter looking at their youtube channel that is attached to the proposal, and they also have an NFT game plan so they will need time for researching the market. Therefore, I think they can do it without any risk. ", "q1r": 5, "q2": "The timeline is suitable and the measurables are clear enough for us to audit this project. \r\nFor this simple idea, their explanation about the problem and solution is also fulfilled, and easy to understand what the team wants to deliver, surely, they're all impact on Cardano ecosystem.  ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 5, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal plans to provide media channel auditing of the Cardano game space, with Catalyst funded games as a priority.  Its biggest benefit would be the immediacy with which this information will become available.  As a youtube show and associated podcast the community could quickly catch up with funded proposals and their progress, and stay up to date as new funded proposals enter development.  Beyond just auditing, this proposal could collect valuable feedback via interviews (Q&A:\"what did you do right/what do you regret\" about the proposal and funding process) and in the process boost the proposal base of Catalyst gamers.  This proposal has the potential to scale over time, covering other areas of Catalyst, but it could also remain solidly in gaming, including as an ambassador of the Cardano gaming community, and achieve scaling via rolling out more frequent videos, or specialty topics, or even Catalyst Swarm type events.  Despite only addressing a subset of the funded Catalyst community, it has the right elements to keep the community up to date on the development sprints within that subset.", "q0r": 4, "q1": "Someone who is a game developer is someone who understands what process a just funded game developer has to go through, including establishing the relationships needed to get shows like this scheduled and executed on terms sensitive to development cycles.  The proposal team looks to be that someone.  While they don't include any specific milestones along the lines of particular games or personalities to feature, they do indicate they want to start with 'freshest first' i.e. Fund7 games, and then continue to cover previously funded games, once every two weeks, for a total of approximately 12 hours of content over 6 months.  This bi-weekly schedule makes for clear goals.  The funding requested should be able to shoestring decent post-production and access, and even includes a small budget for cross-promotion.  They don't include a likely scenario:  popular enough to need more funding for more shows, or cover more games, however they do indicate familiarity with non-Catalyst sponsorship of this type of media, with an expectation to move to that when possible.  The actionable event list is pretty simple:  make show 1, make show 2, etc.  While it would help voters assess feasibility to provide a basic two week script for rolling out a show and podcast, this is something this type of channel typically develops on the fly.  There is no breakdown in the roadmap for how long it will take before the first content is available, so the expectation is that it will be two weeks.", "q1r": 5, "q2": "The proposal team plans to produce the shows, which will be publicly available, and then to report engagement metrics like views, subs, listens, to the community, likely via media channels (including the one they propose to develop.  never hurts to have a little meta in your life.)  They address the unlikely issue of a lack of content, and indicate that would merely open the show up to wider, non-catalyst gaming community on Cardano, which still keeps them accountable to the Cardano community.  They didn't include specific KPIs for auditability, such as sub thresholds, or view thresholds over particular time frames by which to establish success.  I would suggest getting view duration/retention rate to some high threshold.  Because the shows are ~1hr, this will drive the engagement metric that gets the videos recommended.  Additionally, monitoring the clickthrough rate for links to the games, designers, previous interviews, etc. will provide the community with good information about how effective the audits and information have been.", "q2r": 4, "assessor": "z_assessor_811", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Crear un podcast de vídeo quincenal que cubra los nuevos juegos y las actualizaciones de los juegos anteriores en cada episodio para destacar los proyectos de la comunidad.", "experience": "Una década como Fundador Tecnológico y Director de Tecnología, junto con un Diseñador Principal y Youtuber"}