{"id": 384213, "author": "geekship", "title": "SOIL: Auditable E-Commerce", "url": "https://cardano.ideascale.com/a/dtd/384213-48088", "category": 26253, "amount": 42, "description": "Los gobiernos y los proveedores de comercio electrónico deben ponerse de acuerdo sobre cómo realizar las auditorías.", "funded": 0, "upvotes": 16979811, "downvotes": 23536557, "votes_result": 6556746, "votes_cast": 102, "f6_no_assessments": 4, "f6_rating": 1.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "a good idea, but just a draft, as a proposer admits himself. Yet I am not sure how templates will provide real audit results. \r\n\r\nAlso big picture sounds more like an idea-hub rather than auditing proposals. \r\n\r\nMore work to be done,\r\n\r\nGood luck! :) ", "q0r": 1, "q1": "He can deliver, yet more people needs to be involved which are currently not present.\r\n\r\nAlso, the proposal is a draft. ", "q1r": 1, "q2": "more work to be done, no key metrics, no road map, a draft proposal.\r\n\r\n", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "This proposal focuses on creating sample E-Commerce template compliant with regional audit requirements. The problem statement is convincing but it would be better if some explanation was provided. The proposer has failed for showing what he wants to solve. In the section of \"Big Picture\", the problem was not clearly defined, instead of that , a token-related mechanism [creating, burning,...] is provided. The proposed solution is not clearly described [without any specific roadmap/timeline and KPIs, budget breakdown, ...]. As a result, there is no proof of addressing this challenge or showing the potential impact on the Cardano ecosystem as a whole. Therefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2.", "q0r": 2, "q1": "Profile of the proposer is very briefly described, but understandable, shows suitable skill, and experiences for implementation, with an external link [LinkedIn - https://www.linkedin.com/in/martin-vavrovic-9617514a/] for verification. Therefore, the profile convinces me of feasibility in certain aspects. By contrast, the plan was not well-prepared, without the budget breakdown, specific roadmap, KPIs/metrics, and risk management. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better auditability, (1) Roadmap (with KPIs), (2) Budget allocation, (3) Risk management should be provided. Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "Despite $42 proposal requested, however, the impact from what you have written down it's not so much for the next three months to improve and grow auditability. I believe you should focus on all the proposals with the link you have provided in this proposal", "q0r": 1, "q1": "The proposal is at very early draft version of writing, so there is no detail of any timelines or the deliverable milestone.", "q1r": 1, "q2": "The author mentioned he would focus on the completed written proposal (https://cardano.ideascale.com/a/dtd/SOIL-BITs/384198-48088) in  \"Accelerate Decentralized Identity\" challenge. Therefore, this proposal would not go ahead seen there is not much information provided on how to audit and the timeline for each month for weeks.", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The problem is clearly defined and a solution given however the idea needs to be fully fleshed out to effectively address the challenge.", "q0r": 3, "q1": "It is impossible to tell as the proposal has not been fleshed out. A greater insight into the timeline, problem and Team is required.", "q1r": 3, "q2": "No roadmap or KPIs provided. Hopefully in future proposals you will have the time to flesh this out.", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Crear modelos de plantillas de comercio electrónico que cumplan con los requisitos regionales de auditoría.", "experience": "Desarrollador de software desde hace más de 10 años, centrado en el frontend en los últimos 5.\nhttps://www.linkedin.com/in/martin-vavrovic-9617514a/"}