{"id": 384586, "author": "jeffghome2020", "title": "Financial Audit Taskforce", "url": "https://cardano.ideascale.com/a/dtd/384586-48088", "category": 26253, "amount": 25000, "description": "Actualmente no se realiza ninguna auditoría financiera sobre las propuestas financiadas. Queremos asegurarnos de que los fondos se gastan de acuerdo con los presupuestos votados.", "funded": 0, "upvotes": 19513694, "downvotes": 21950380, "votes_result": 2436686, "votes_cast": 115, "f6_no_assessments": 5, "f6_rating": 2.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims at auditing 40 proposals submitted in a future fund, regarding its financial expenses and what is presented in their proposals. It says that it would take 3 months to complete the documentation and train the team, but it also says that this auditing process would be applied already in Fund 8, so for me it was not clear if they were referring to their own team or the proposing teams.  They mentioned that they would come up with a website and prepare a process where funded proposers would have to upload ther documentation according to a system called GAAP. The proposer doesn't explain if this same process would apply for different kinds of entities and services. It doesn't mention how the volatility of ADA would be taken into consideration, and how the team would prove that they are holding ADA or a stablecoin. That said, the proposal is well aligned with the challenge as it allows the financial audit of funded proposers, and although, as mentioned, its budget is not enough to audit all the proposal in a single Fund, it would be enough for a test with 40 proposals, which is aligned with the spirit of experimentation in Catalyst. On the other side, since proposal mentions that continuous fund is required to scale up this initiative, it might be very limited in the future if it doesn't get funded again, or if the 'Grow Auditability' Challenges is not chosen again for some reason, for example. If not funded this time, the proposer should also include some KPIs to help measuring the impact and success of this proposal.", "q0r": 3, "q1": "The proposing team has provided background experience in management (Jeff) and IT (Steve). It also states that Steve has 20 to 30 accounting students, which was not clear to me since he is a retired manager of IT and no further information was provided. The plan of implementation of this proposal is just very superficially mentioned here, it doesn't have a clear roadmap, milestones or example of documentation that will be required from the funded proposers. It also doesn't mention some risks such as ADA price volatility, difficulties on how to work with different kinds of projects and services (it mentions a system called GAAP but doesn't extend much on that), how to choose which proposals to review in a fair way. It is also not clear if the plan is to implement this procedure durind Fund 8 or 9, since it says it would take 3 months to train the team and prepare the documentation, but at the same time it says it would start in Fund 8. The budget seems ok, although it's also unclear if its sized for 3 or 6 months. As an advice for a future fund, if not funded in the present round, would be to provide more information about the team, include a detailed roadmap, more information about possible risks and challenges expected when auditing proposals in this environment. ", "q1r": 2, "q2": "The information presented in this proposal to enable its auditing is the number of proposals to be audited. Although, as mentioned in the previous criteria rationale, it's not clear if the timeline is 3 or 6 months. Since a roadmap is not presented as well, it is not possible to follow up with the progress of the proposal on a monthly basis, as it is required by IOG currently. To improve this proposal's auditability, some progress KPIs and a clearer, broken down roadmap should be included.", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 18, "ne": 9, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The audibility of proposal funding is very important, this tool will be helpful to the community for transparency. At the moment the problem statement and solution is the same, I would like the team to clarify the solution.  If the proposal is succesfull it will improve and grow audibility in the Cardano ecosystem.", "q0r": 4, "q1": "The proposal provided a link to LinkedIn for the team leader. The team has proposals funded from previous rounds. The team experience and work history give me confidence that the proposal will be implemented successfully.", "q1r": 4, "q2": "Although the budget is simple and self-explanatory. I would like if the proposal further developed the 90-day roadmap, with simple milestones it will be easier to audit the proposal. I like that the proposal addressed future funding concerns.", "q2r": 3, "assessor": "z_assessor_358", "no_vca": 18, "ne": 3, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "A great and worked-through idea with good points - yet,  is documentation posted enough to actually audit their results? More details would be required in this matter, and also, how to enforce them to be part of it? \r\n\r\nAlso - financial audit - will you examine invoices? I do not see a way how you could perform an audit of e.g. Asia proposer and expect valid results - high risk of manipulation. This would require more detail. \r\n\r\nRating given 2.", "q0r": 2, "q1": "Linked in profile seems fake - too low connections for such claims - 20 years + Management Experience, property investor, semi-retired\r\n\r\nA former manager of audit within the Canadian Federal Public Service.\r\n\r\n\r\nCardano's outreach twitter page seems to be completely not-in-accordance of the proposal, nor its content is not increasing the creditability of the proposer. \r\n\r\nA youtube guy in the proposal has nothing to do with the proposal, decreasing creditability. \r\n\r\nSeems fake.\r\n\r\nBased on the information provided, I am skeptical whether they would deliver what they aim to do, based on \"seemingly fake profiles\". \r\n\r\nCompared to other proposers, with no signs as here, therefore I put rating 1.", "q1r": 1, "q2": "more detail would be required on these team members and how they would participate. \r\n\r\nBut overall, I believe that we can audit this proposal by performing audits.\r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "hi nice to read your suggestion.i have few questions for you official not? Should we not move to a model where what needs to be done is agreed upon first and then we conduct independent, competitive bidding to bring costs down to a reasonable level?\r\nI have yet to see a proposal that would actually explicitly refer to return, or risk…", "q0r": 3, "q1": "The proposal team has provided the necessary experience to implement this capital audit proposal. However, the link you provided to view the team leader's information when accessing it is not displayed, it looks like this is it a bug? i'm quite bothered about this. i also came across the youtube channel you provided with 1.64 N subscribers, the group has a pretty useful youtube media channel. on a budget The group's work is broken down into clear sections. But the team has not provided a plan or a way to see the progress that the group is making, hope the author will clarify this next time, so that can be rated with a higher score by the CA community.", "q1r": 3, "q2": "This proposal seems to be missing a few important items, in order to be appreciated by the CA community for the transparency of the project. I think the author should add a roadmap item (with milestones to achieve the results so that the project can be completed). help achieve results as well as make the project more transparent). In addition, the author also needs to add KPIs that determine the success of this proposal, bring the team to consult with me, and correct dress.", "q2r": 2, "assessor": "z_assessor_644", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The Proposer want to ensure funds allocated to winning proposals are spent according to budgets proposed. This is within the scope of the challenge, and will benefit the ecosystem. I don't see any vision of developing smart contract audits or something that will be easier using blockchain technology, which is mentioned in the challenge brief. I believe we should try and make the process easier and simpler than the old ways of auditing. It might cost more in the beginning to develop, but in the long run will have huge savings. The old way will become more and more difficult as the funded proposals grow.", "q0r": 3, "q1": "There are two team members, one who has experience in Audits and a LinkedIn link is provided. Further more they want to make use of 20 to 30 students to perform the audits. I feel that the challenge wants us to develop something more simpler, this method could be used in the mean time till something better is developed. The budget is laid out and broken down and seems reasonable. It is states that additional funding will be needed and not all proposals might be audited as funds wont allow for this..\r\nRisks are not discussed or how it will be dealt with.", "q1r": 3, "q2": "The project could be tracked by the amount of audits done, other than that nothing else is set out for the community to track this proposal should it be funded.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Actualmente no se realiza ninguna auditoría financiera sobre las propuestas financiadas. Queremos asegurarnos de que los fondos se gastan de acuerdo con los presupuestos votados.", "experience": "Antiguo director de auditoría en la administración pública federal canadiense. He revisado miles de auditorías del impuesto sobre la renta y de los impuestos especiales."}