{"id": 385201, "author": "busssard", "title": "A portal to audit and release funds", "url": "https://cardano.ideascale.com/a/dtd/385201-48088", "category": 26253, "amount": 9000, "description": "No hay ninguna plataforma que permita auditar los proyectos de forma sencilla y ver en qué fase de la propuesta se encuentran. ¡Hagámoslo sencillo y justo!", "funded": 2, "upvotes": 72708443, "downvotes": 2198144, "votes_result": 70510299, "votes_cast": 172, "f6_no_assessments": 10, "f6_rating": 3.766666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Me ha gustado mucho esta idea y creo que se ajusta totalmente a los objetivos del reto. La idea es crear un portal en el que la comunidad pueda seguir el progreso de los proyectos; en este portal, también habría \"paquetes de trabajo\", que son básicamente partes del proyecto por hacer, una vez que el equipo presentara resultados de las respectivas partes, la financiación sería, poco a poco, liberada, y así los paquetes avanzarían y el dinero estaría disponible. Lo que me pareció estupendo fue que se organizaron las cosas de una manera muy sistemática y pre-estandarizada. Creo que cada proyecto tiene sus especificidades, pero sin duda es posible prever un calendario de acciones para cada uno de ellos y dividirlos en paquetes. Creo que la navegación necesaria aquí es un punto crucial para el éxito de la idea. Porque habría muchos proyectos categorizados, divididos y especificados. Hay que estudiar el diseño UI/UX para crear una plataforma lo más sencilla posible. Una duda que tenía era precisamente dónde estaría este portal. ¿Una página web, una app? Sería interesante que el autor aclarara dónde estaría alojado. Aparte de eso, me encantó la idea en sí, creo que haría mucho más accesible el seguimiento de los proyectos (¡es muy complicado seguir cientos de proyectos financiados, reflejados en los más diversos rincones de internet!)", "q0r": 5, "q1": "En cuanto a la capacidad del autor para ejecutar el proyecto con éxito, me gustaría tener más detalles sobre quién es. Nos da muy poca información sobre sí mismo, lo único que sabemos es que es ingeniero, empresario y que tiene experiencia en la distribución de financiación. Pero sería importante tener un currículum más detallado, ejemplos de trabajos anteriores, cómo es esta experiencia con la distribución de la financiación, cómo sería el método tradicional. Sería muy beneficioso que adjuntara un perfil de linkedin o alguna otra plataforma donde pudiéramos conocerlo más de cerca. Sería muy importante para este proyecto contar con la experiencia de un diseñador UI/UX para construir una plataforma intuitiva y fácil para cualquier miembro de la comunidad que quiera ejercer la auditabilidad. Tampoco queda claro si el propio autor sería el programador, no dice si piensa contratar un equipo de marketing para dar a conocer la idea, etc. En cuanto al guión, esta parte está muy bien detallada, y se suma a la división de los gastos. Si bien el autor señala lo que se haría, dice cuántos fondos se utilizarían para una parte determinada. Y los pasos están bastante bien desgranados, por lo que tenemos una idea sólida de lo que va a pasar en cada parte. Por lo tanto, lo que creo que hay que mejorar es la presentación del propio autor y la explicación de la formación de un futuro equipo, sobre todo porque no es posible que un proyecto de tal complejidad lo haga una sola persona. Y al presentarnos un equipo y lo que haría cada profesional, también tendríamos mayor fundamento para determinar si el dinero que se pide en la financiación es justificable.", "q1r": 4, "q2": "El autor se preocupa por trazar definiciones de éxito en función del paso del tiempo, de forma directa para ejercer la auditabilidad; yo también creo que esto podría hacerse en dos pasos. Primero, por supuesto, sigamos la construcción de la propia plataforma. Esto podría hacerse a través de reuniones, en las que el autor muestre los avances, qué partes se hicieron en determinados períodos de tiempo. Es posible saber qué cobrar a través de la división de fases que establece, y como es muy detallada, sabemos exactamente qué esperar de cada una. Y una vez finalizado este proceso de creación, habría que observar si la plataforma funciona correctamente, si la auditabilidad de los proyectos \"alojados\" ha mejorado realmente, si la comunidad está teniendo acceso, qué piensa la comunidad al navegar por el portal, posibles errores a corregir. En otras palabras, es posible controlar el progreso del proyecto a través de la información proporcionada durante la descripción de la propuesta, además de las mencionadas métricas de éxito. Basta con que, primero, el autor establezca este puente entre el proceso y la comunidad, y luego la propia comunidad utilice el portal y dé su opinión sobre la experiencia.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 12, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal is a driving a meaningful impact towards improving catalyst transparency and growing auditability. ", "q0r": 4, "q1": "The team describes a solid plan to build a funding release tool that would hold grant funds and release them to proposal teams on a hybrid of a work package completion and time wighted basis. ", "q1r": 4, "q2": "The team defines success in the proposal and has included a high level roadmap for the funding tools complete implementation. ", "q2r": 4, "assessor": "z_assessor_1005", "no_vca": 39, "ne": 2, "ng": 19, "nfo": 18, "vca_o": 1}, {"q0": "this seems like a good start to find ways to improve audibility. Granted there are externalities (such as Idasscale cooperation, designing a WBS form for presenting proposals, and a learning curve for proposers.. However, nothing ventured nothing gained. At the requested level of funding, worthwhile to sponsor a new model and first steps.", "q0r": 5, "q1": "I am satisfied that a MSc Engineering holder can tackle a problem such as this. An engineering mindset is appropriate, for problem solving. The perspective of Work Breakdown Structure (WBS) as an organising framework is well established tool.", "q1r": 4, "q2": "I can understand the approach. And the most interesting aspect is they propose to apply the system they would develop to their own proposal and funding mechanism. High marks. Walk the Talk!", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 21, "ne": 2, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "What seems to be suggested here a project management tool to help on governance and budget availability.\r\nI really like the concept of having a tool for managing projects where its possible to see all projects in standards way and to generate views on the pipeline as whole. It also allows for much more managament by funded proposers besides the audit itself. I also like the idea of the fundings being released by work packages as it evolves, according to its schedule, completition and depencencies and have a system manage this \"stage-gate\" would be awesome. The way I see, this project is divided into 2 main phases: a research, which there are plenty of questions to answer and depend on data availability and de development of the solutions\r\n\r\nOn the first, I wonder if all the information required in firtst months would be available. It would be good check with whomever \"owns\" this information if you could have access to it before starting. Else, the rest of the project wont be feasible\r\n\r\nFor the second part, this proposal could have more details on the development of this tool and how it would be implemented. Firts, it should be clearer if the desired solution is going to be developed internally or if it would be an arealdy exiting commercial solution - or if both would be evaluated. It seems to me that the idea is to keep this management in idea scale but that brings the question of this place is really the best for this kind management and if the solutions proposed would be available from ideascale. I also wonder if this solution could be used together with other project management activities as schedule, communication, risk management, etc.\r\n\r\nThere are plenty of challenges but if fully applied, the overall impact is  good", "q0r": 4, "q1": "It seems to have only one person dedicated with a vague experience and no links to resume or linkedin. For this project, I guess it would be nice to have at least 2 people involved as there are plenty of things to do and challenges to overcome.\r\n\r\nTheres a sensible plan (with time) and with a budget breakdown within it which is great. \r\nOne suggestions of improvement is having  on the plan c more details on the activities itself. It is currently more focused on the goals of each phase (but not on how they will be achieved)", "q1r": 4, "q2": "Some milestones can be extracted from the plan but they could be outlined in clearer way, in a sense to say which steps in each stage are more critical.\r\nNo Kpis described and lot os risks as the proposal brings so many questions.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 18, "ne": 8, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "i strongly agree because the problem needed to be solved has been identified and fallin within the scope of the challenge.\r\n\r\nThe proposal will also add value to the cardano ecosysterm.\r\n\r\nkey metrics and goals pf the proposal are stated clearly and fallin within the scope of the challenge. The proposaer scale to address future challengies as well", "q0r": 5, "q1": "Strongly agree because the proposaer has provide evidence, references, links, etc of relevant skills and experience needed to implement the proposal. And the links are sufficient.\r\n\r\ntheir level of competent is good  ,Has  identifiably in manner listed the type of team memebers required to implement the proposal.\r\n\r\nhas good budget outlined and broke down into identifiable items reasonably to achieve the set goals of the proposal.\r\n\r\nThe proposal has describe the necessary resource to implement the project if funded and has consider some risk and challengies relevant to a successful achievement", "q1r": 5, "q2": "Strongly agree because the proposer has provide accurate road maps and time horizone to complete the project.\r\n\r\nthere are clearly defined key metrics/KPI's that defines the success of the proposal.\r\n\r\nwell understandable describtion of the targeted problem and well understandable solutions to address the problem.\r\n\r\nThe proposer has contencyvplans for various outcomes", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}, {"q0": "this is the idea of how to approach audit! release funds after a subtask are performed is definitely a way how to make sure that proposals are delivered, costs are reduced and bad players are pushed out.\r\n\r\nAlso, very detailed and worked-through proposal. \r\n\r\nRating given 5.", "q0r": 5, "q1": "the experience seems relevant and linked in the profile seems legit. But I guess there will be more people needed, thus rating given 4, because this requires to be finished, but overall, perfect! \r\n\r\n", "q1r": 4, "q2": "key metrics are missing, I believe this requires further work to be done. \r\n\r\nOn the other hand, a road map is detailed and the process is described in larger detail.\r\n\r\nSuccess is questionable due to the one-man team. \r\n\r\nRating given 3.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This proposal effectively address the challenge by bringing individual efforts onboard to assess and audit proposals that have received funding. Structural procedure have been clearly stated to approval proposals as well track the ongoing projects to ensure work is being done effectively. Team effort is key to this proposal a good quality which will ensure good work done.  ", "q0r": 4, "q1": "This proposal has some sort of experience which has been stated and a sensible and conductible plan which not just show what but also how the project is going to be done. Also, a budget has been provided even though more details could have been provided on how funds will be used. The proposer also identified challenges and risks associated with this proposals. It is likely this proposal will be implemented", "q1r": 4, "q2": "Even though information about how funds will be used has been provided but with more details provided it will have been sufficient to audit and track the progress and the success of this proposal ", "q2r": 3, "assessor": "z_assessor_568", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "It's a good start and one to bring sustainability to the growing pool of ideas and the need to have auditability and transpatency. More details as to what and how can this be implemented in the Catalyst process. ", "q0r": 3, "q1": "There is abundant experience presented in this proposal as well as insights into a systemic weakness in a growing incubator that needs a support base. Not sure if going from decentralized governance to some form of centralization of funds held by auditors the way to go but more clarity on ways this could be implemented in line with Cardano's vision of fully decentralized governance could polish this idea quite neatly.", "q1r": 3, "q2": "The information provided is quite insightful as to the scope and metrics but in terms of alignment in goals more clarity needs to be made available.", "q2r": 3, "assessor": "z_assessor_594", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The proposal identifies a problem within the challenge which needs to be solved. All active members of Catalyst face the issue on a daily base. Identifying and empowering projects at different stages accelerators the ecosystem and saves time to all community participants. ", "q0r": 4, "q1": "The proposer proves his experience needed to implement the proposal with his linkedin profile. The proposal explains a comprehensive concept of the portal idea including risk, workarounds and payout plans. The proposal outlines a roadmap on a monthly package base and includes the requested funding for the periods. The required resources are indicated and could be elaborated deeper in an improved version. The timeline with up to one year looks pretty long. On the other hand the author uses this timeframe in order to test his own proposal as a prototype to the proposed audit and rund release portal. What I would expect, from my experience building portals for +3 years is an architecture concept taking into account roles & rights and the different user groups a bit more detailed, as it could be the critical point for ease of use for Catalyst users. This is mandatory to accelerate the mentoring and guidance process to fuel the projects.", "q1r": 3, "q2": "The work breakdown describes the targeted problem-solution in an understandable way from a birds perspective. Not yet included are defined metrics and KPIs that define the success of the proposal  which could be the foundation for many Catalyst accelerator programmes.", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposer has identified a key deficiency in Project Catalyst's program: the lack of information on accepted Catalyst projects and their progress. \r\n\r\nCurrently, a Google search for 'Cardano Project Catalyst Winning Proposals' returns only one relevant result (https://iohk.io/en/blog/posts/2021/01/12/project-catalyst-the-first-winning-proposals/). A Google search for 'Cardano Catalyst Project' returns 0 relevant results.\r\n\r\nI think a portal for all relevant information would be helpful for would-be investors and the community to evaluate these projects. In my opinion, it's not clearly articulated in the proposal the value a portal like this would have. Proposer could include an imagined scenario into the proposal, from the perspective of a community member or IOHK, on how this platform can be used to evaluate whether a project should receive continued funding. \r\n\r\nThe proposal is missing details on how this project can be scaled for the future. If successful, more and more projects will be listed on the website. Each of them will require updates on current data(financials, performance, achievements, etc). This data will have to be verified. Unlocking payments will also require manpower(if smart contracts are unused). I assume all of this would require funding. I think details on how this project can be sustainable in the long-term would make this proposal stronger.", "q0r": 3, "q1": " In my opinion, the proposal would benefit from a clear outline on how the infrastructure would be built:\r\n- how many team members are needed? what skills do they need to have?\r\n- Clarity on the execution of the roadmap. How will the interviews during the first month be conducted? What kind of performance metrics is the proposer looking to track? What goes into the process of defining work package as completed?\r\n- include resources needed to implement the protocol. How will information on the current state of the project be gathered? Weekly interviews, email reports, etc; and how will this information be verified as true?\r\n - More specific, technical details regarding plans on smart contract, oracle pools, and selected auditing group.\r\n- A better breakdown on how funding will be used. How much will go to recruiting team members? How much will go to building infrastructure?\r\n\r\nI also think evidence on the proposer's experience of how \"funding is unlocked in traditional settings\" should be included.\r\n\r\nWith what's being shared, I am not confident that this proposal will be implemented successfully", "q1r": 1, "q2": "The proposer has provided with a timeline of 8 months. I find that it is lacking in information on the technical aspects of how the infrastructure would be built. Lacking this knowledge myself, I cannot evaluate even if it is shared. However, proposer will be able to convey expertise and instill confidence in voters if this information is shared in a clear and concise manner. \r\n\r\nProposer has outlined success metrics to quantify success of the project. I find it to be lacking however. What tests need to be done to ensure the portal's implementation with ideascale? what will the team of developers be working on? If this proposal is used as a test of the described process, what would the proposer share during these 8 months?\r\n\r\nI think the inclusion of these details would make for a stronger proposal", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 20, "ne": 7, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "La propuesta se divide en bloques de trabajo con req. ADA, una vez terminada la comunidad/contrato inteligente confirma si se desbloquea la siguiente financiación.", "experience": "Soy ingeniero de la ETHZ, emprendedor y tengo experiencia en cómo se desbloquea la financiación en entornos tradicionales."}