{"id": 382394, "author": "huths0lo", "title": "Real world products", "url": "https://cardano.ideascale.com/a/dtd/382394-48088", "category": 26248, "amount": 100000, "description": "There isnt allot of tangible items that can bring more attention to Cardano.", "funded": 0, "upvotes": 14927288, "downvotes": 24246473, "votes_result": 9319185, "votes_cast": 105, "f6_no_assessments": 7, "f6_rating": 2.142857142857143, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal aims to dedicate a weed strain to Cardano. I think this is a great idea - however, the proposing team should provide more information and in this case I think this information should be about how they are planning on connecting the weed strain to the Cardano mission/vision/ community. Weed these days in the US has all kinds of fancy names and packaging and I have never researched where the name of my \"Kanha\" edibles or \"Kiva\" chocolate comes from. So basically what I´m saying is, that the proposing team would have to explain to us how it will educate or merch their weed with information about the blockchain.", "q0r": 5, "q1": "I find that the proposal does a poor job of explaining it´s objectives, KPIs and ideas. I found the homepage of the Cardano Budz through google and was able to find a roadmap and some more information about the project on there. So it would have been good if the proposing team would have connected their website as proof of prior work and to verify the skillset of the team behind this idea. From what I´m seeing, this project is up and running and there are some interesting ideas on there that would connect the crypto market and the weed market - both markets are bringing in lots of new people, but this proposal does not go into crypto as payment for weed or anything. I think it is highly likely, that the proposing team is able to grow weed and name it after Cardano. I also find this a great idea. I think the proposal is very bad at explaining the value of the idea and it should give us information about the - I guess marketing campaign - that would brand this weed strain with the Cardano Blockchain. For instance, will the logo be connected to the Cardano logo? Will the company provide educational material or workshops on Cardano through NFTs or through QR Codes on their weed products or through their website? As I stated above, I have never researched the background of the name of my weed so the proposal should provide a marketing or branding strategy.", "q1r": 4, "q2": "Especially with a high budget like in this proposal who is asking for 100.000 Dollars in ADA, the proposing team should provide more information about KPIs and actionable steps as well as some risk assessments and further information. While we´d be able to track if growing the strain after 18 months was successful, other measures of success are not mentioned, so it is not clear, how many new wallets or new Cardano users might be onboarded through this Cannabis strain. I´ll say it again - I think this is a great idea but I also think the team has to provide more information on it´s plans for either \"education\" or \"information\" or \"marketing\" of Cardano through this Cannabis strain.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is an interesting project considering that it is very niched, focusing on the cannabis industry and creating an actual physical product. It makes a whole lot of sense why it wouldn't fit in another challenge but the miscellaneous challenge. Having been a Community Advisor with decent enough knowledge about the Cardano ecosystem, I would agree with the problem statement of there not being many tangible items connected to Cardano. I don't have much experience with the Cannabis industry but after quickly looking up some statistics it might be a valuable field to expand into. If roughly 12% of people in the US are active Cannabis users, it would be one (of many) markets where Cardano can spread. This projects success seems to be highly dependent on marketing the Cannabis strain, which is probably why the budget allocation for marketing is roughly 30% of the total proposal budget. (More on budget later). What I really like with the proposal is that the proposers present the process of creating a new Cannabis strain step by step, in a way that is understandable for readers of all experiences. In order to make this proposal more clear and tangible in its execution and description, I would have liked for it to include more information outside of the actual growing process. For example marketing, networking etc. If the proposal would cover more of those aspects then it would be more and more relevant to the Cardano ecosystem because of outreach.  Over all, I neither agree nor disagree that this proposal effectively addresses the challenge. ", "q0r": 3, "q1": "As stated before, the proposal includes a detailed step by step plan in the process of creating the strain but not much information about the distribution and marketing process. If the proposal only includes creating and refining the strain over 12-18 months, then it is clearly presented. 100 000 is a quite substantial sum of funding (50% of the total challenge budget), and considering marketing is included in the budget plans, I would have liked to see a more in-depth explanation on how and when the project plans to market their product during the development phase. From my understanding of the proposal (correct me if I'm wrong), the $5000 x 6 means 5000 USD spent on marketing over the period of 6 months. Are these 6 months the last ones (month 12-18) or beyond that scope? With those details in the budget plan, it would increase the transparency and credibility of the proposal. Another aspect that would be beneficial is to include a short presentation of the team members and who is working on the project (supposedly 2 team members according to the comments). Cardano Budz is a somewhat well known NFT project, but that does not speak about the teams experience with Cannabis growing or marketing. A suggestion would be to include some links to further verify the competency and experience of the team members (LinkedIn profiles, Github, NFT project etc) related to the proposal. Due to the reasons explained above, I disagree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 2, "q2": "The proposal includes clear deliverables during an estimated timeframe. As stated under previous headlines it would be highly beneficial if the proposal also included a detailed plan for marketing in this. (Assuming the proposal takes marketing into consideration since it is part of the budget plan). If some measurements of success (KPIs) were to be added in conjunction with the road map and milestones (for example, by this time we are aiming to have reached out to x amount of partnering distribution companies, and x amount of advertisements in our social media channels) it would make the proposal even stronger.  \r\nI would also have liked an explanation of where the community can follow the development and progress of the project (twitter, instagram, youtube, dedicated community page?) in order to increase the transparency. Lastly, a small discussion on the potential risks and challenges by developing the strain would point towards a deep understanding of the process for the team, especially if it would provide potential solutions to these challenges (What would happen if they run into problems during the refining stage, how does the team aim to solve unexpected happenings?). Conclusively, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 19, "ne": 12, "ng": 5, "nfo": 2, "vca_o": 2}, {"q0": "To a certain extent, it fulfills the Challenge Brief in that it does not fit into other challenge settings... but, I am not sure it is an interesting project for Cardano.  And, in my humble opinion, does not really have to do with Cardano.  And I am a cannabis enthusiast. ", "q0r": 2, "q1": "Given the experience and plan presented, I am not sure at all that the project would be implemented successfully.  There are no substantial details about the 'team' and their qualifications (what does 'IT Expert' really mean?), and asking for 50% of the total budget of the Challenge amount is excessive.  ", "q1r": 2, "q2": "I am not sure what KPIs are here... There is a 'roadmap' for the growing process, but nothing else related to the 'success' of the project in relation to Cardano and its ecosystem. We dont even see the 'mascot' that has received positive attention. Hmmm... I feel like there is a lot more work to do in shaping this idea, and nailing down the relevance to Cardano. Sorry. Just my opinion.  I suggest the team looks at a more specific way to tie it to Cardano, scale back the budget while looking for other sources of backing for getting the growing process going, and create a 'step by step' timeline, aligned with budget (asking for further funding in subsequent funds!), show us more about the cNFT part of the project/ideas, and see where this can go in the future.  ", "q2r": 1, "assessor": "z_assessor_210", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Bringing Cardano to many people in many different fields for Blockchain to come to life is a necessity. But in this proposal the team wants to grow cannabis to introduce Cardano to cannabis buyers. In my opinion this poposal doesn't make too much of an impact for Cardano, cannabis buyers and the community. Because I have yet to see a proposal that outlines any connection between cannabis buyers and Cardano other than their interest in blockchain.", "q0r": 1, "q1": "\"The team behind this proposal does not specify how many people they have on the team and each person's specific experience. So it is difficult to know if they have the ability to implement this proposal or not.\r\nThe team also has no experience with blockchain and Cardano so I don't know how they are going to introduce Cardano to cannabis buyers.\r\nAll funds raised for the proposal are used to grow cannabis without mentioning the money to promote the development of Cardano and Blockchain is unreasonable.\"", "q1r": 1, "q2": "\"This Proposal only deals with growing cannabis and selling it to the market without mentioning the sharing of Cardano and blockchain to cannabis buyers as desired by the project, so it is almost impossible to know the success of the proposal. .\r\nIn addition, We also cannot check the amount of money granted to the proposal to grow cannabis successfully\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about creating the first Blockchain Strain, called \"Cardano Bud\". This is a great idea and convincing in certain dimensions. However, the impact on the Cardano ecosystem as a whole is unclear. Therefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2", "q0r": 2, "q1": "In terms of feasibility, I am not convinced by the proposer profile since it is not clearly described. Besides, the roadmap remains quite abstract, without any KPIs.  The budget structure is clear with explanations of the calculation base for each item. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better auditability, the following information should be added:  measurable KPIs/ Metrics. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "What am I reading here? One proposal wants to bring the image of cannabis to the blockchain world. Blockchain is decentralized, anyone can access it anytime, anywhere without any control. Marijuana or synthetic drugs are destroying the young generation and leaving many consequences. I think this proposal will have a very bad impact on the entire community. It may have a positive impact on the community of cannabis addicts, but what the world needs is not the addicts of the future.", "q0r": 1, "q1": "Although the proposer may have a good reputation in the community. But with a sensitive nature and can cause harm to the community as I mentioned. I assess this proposal completely unfeasible", "q1r": 1, "q2": "I highly recommend that we dont need audit\r\nthis proposal. Because it is feasible and may harm\r\nthe community", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Living in the Netherlands I think this a nice idea. But to link Cardano to a new cannabis strain, funded by Cardano could also have negative consequences for the reputation of Cardano and its Community. Some might use it now and then, but the product should represent the core values of Cardano. I think cannabis would not be right product. There are coins specific associated to cannabis I think they might be more interested in/ suitable for this concept", "q0r": 2, "q1": "Technically it is possible to grow a new strain, but given the considerations above I think linking cannabis to Cardano will not help Cardano in its reputation. Therefore implementation will be counterproductive. ", "q1r": 2, "q2": "It is not clear which strains you are planning to use in the beginning to create a new one. In general the idea and the how is clear and monitoring the progress should be possible, but think the idea in essence it not suitable", "q2r": 3, "assessor": "z_assessor_909", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "The Digital Syndicate team, owners of Cardano Budz, are looking to create the first Blockchain Strain, called \"Cardano Bud\".", "experience": "cNFT creator, tied to Cannabis Culture.  Previous cannabis grower.  IT Expert."}