{"id": 382738, "author": "evaginger", "title": "Researching CNFTs at Uni of Oxford", "url": "https://cardano.ideascale.com/a/dtd/382738-48088", "category": 26248, "amount": 17000, "description": "Cardano is research-based but the immense impact blockchain technology will bring to our society is only marginally reflected in humanities.", "funded": 0, "upvotes": 23687739, "downvotes": 24749288, "votes_result": 1061549, "votes_cast": 130, "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal identifies a valid problem and hopes to contribute to the solution by encouraging further dialogue in academia (specifically the humanities). This does make good sense and Oxford University does have a solid reputation. How much value this paper will add to the community is difficult to judge without further examples of the proposers work.  ", "q0r": 4, "q1": "The proposer appears to have sound experience in the NFT space and academia (I could not find any previous publications but that does not mean that they do not exist). To verify experience it might have been good to include a sample of previous work. The plan is straightforward and gives some hint of the research focus. I feel that it is likely the research and paper will proceed and therefore score this criteria accordingly.  ", "q1r": 4, "q2": "The information provided is good without being great and yet I feel the project to be a worthwhile enterprise. The budget is not extreme albeit directed solely for the individual. The eventual outcome may be of great worth and certainly there is a great need for further humanities based research on the phenomena of blockchain and NFT's. The progress may be a little difficult to audit (although I note intended updates). It will be an interesting project to watch. ", "q2r": 3, "assessor": "z_assessor_53", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "A proposal fits and addresses the 'miscellaneous' already by definition, but another important check of 'effectiveness' is whether it could have suited better in some other larger challenge and since the answer is \"no\", it is, in my opinion, very suitable here and at the same time contributes to the community and ecosystem.", "q0r": 5, "q1": "Obviously the experience to implement the plan successfully is verified already by a top university.. The plan itself follows a classical academic research logic and therefore clear, understandable, and predictable.", "q1r": 5, "q2": "Key performance metrics are qualitative with current wording focusing more on the expected (theoretical) outcome than providing KPIs for progress and success monitoring. However, it is possible to verify the final outcome.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This is a proposal by an Art Major at Oxford, to write a dissertation on Art, CNFTs, and the relations of the two. This involves two major communities: Cardano and Art. This is a great idea by this student to dive into this world deeper and help spread awareness.\r\nDriving adoption from this will be the more challenging component.", "q0r": 4, "q1": "The proposer/student, as stated in the proposal, has experience in the Art world, as well as Cardano ecosystem. While it is not immediately clear that evidence of experience is provided, the full text helps derive this conclusion.\r\nThe plan, a requirement to write a dissertation by Master's Student, and the plan for writing this research paper should likely be successful. Post-dissertation, spreading this paper will be important and look forward to seeing that happen. This will be determinate, first based on the success of the actual paper.\r\nBudget is simple and makes sense for the plan.", "q1r": 4, "q2": "The first key metric is clear. That is the completion of the dissertation and the result of that.\r\nThe second key metric, using this paper as an aid to adoption and awareness is not as clear. However, to be fair, this is a standard with any research paper.\r\nThis sounds like an exciting opportunity for the proposer, as a student of knowledge.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Research into blockchain from a humanities perspective may add value but this part of the project will be going ahead regardless of funding. The additional material the funding would allow, including educational material may add value to people new to the (C)NFT space. Additional visibility for the (C)NFT space will benefit users but it's hard to determine or quantify how much visibility would be gained from this project. ", "q0r": 3, "q1": "Proposer is completing at least the thesis as part of his studies. High likelihood that at least this part is delivered. Proposer has the expertise and time to complete the proposal. Additional work outside of his studies is being well compensated under this proposal funding. Budget seems adequate to complete the activity and incentivise the additional effort required to maximise benefit of this project. Plan seems logical, with reasonable time frames for completion", "q1r": 4, "q2": "Key deliverables including thesis delivery are easy to monitor but progress, depth of research, quality of educational material, reach of increased awareness are more qualitative and harder to assess.", "q2r": 3, "assessor": "z_assessor_902", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "I am establishing a dialogue between Cardano and Academia by writing a thesis on CNFTs, building the foundation for future research.", "experience": "Art History Master Student at Oxford University; engaged with CNFT space; ADA Café host & contributor; expertise to bridge technology & art"}