{"id": 384476, "author": "larde.victor", "title": "Ubuntu Contributionism", "url": "https://cardano.ideascale.com/a/dtd/384476-48088", "category": 26248, "amount": 100000, "description": "Imagine a perfect world full of harmony and abundance. The kind of world most of us have dreamed of all our lives.", "funded": 0, "upvotes": 16899928, "downvotes": 24453984, "votes_result": 7554056, "votes_cast": 103, "f6_no_assessments": 6, "f6_rating": 1.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "The \"One small town\" is based on selection of a 3000-5000 people town and \"Successful businesses, currently in the town, are encouraged to help support the One Small Town initiative by investing in other project/business plans that help achieve the town's self-sustainable goals and generate a profit for the investor\". The idea is noble however the use of Cardano tokens and 100K USD budget for releasing tokens is not very clear, in the proposal. ", "q0r": 2, "q1": "Proposers have ambassadors representing various countries however there is no \"One Small Town\" currently which can be seen as a success to emulate. This is making it difficult to evaluate the practicality of the idea. ", "q1r": 3, "q2": "I could not find the rationale for the 100K USD budget. The statement that \"A symbolic 100K as a requested fund, would be used to start the implementation of our many business plans in our first signed city of Lebanon.\" is the only justification. The business plans in Lebanon have not been referenced in the proposal. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "Being a miscellaneous challenge this proposal seems to fit the brief.  However I have come across at least one other version of this proposal asking for a different amount of money but with the same request details.  I am a bit confused by this, but when I go to their home page they seem to have a lot of ambassadors for different countries so perhaps two or more are attempting to get funding via Catalyst for the same project in different locations.  But the detail in the submission does not make this clear.  ", "q0r": 3, "q1": "The plan is raise awareness of the one town project, but does not specify how Cardano is used to achieve this other than to fund the project.  ", "q1r": 2, "q2": "The longer I study this proposal the more I have come to realise it is a request for a donation and not an idea to build using Cardano.  So whilst the project may or may not be auditable, the fact that there is no Cardano specific goal means there is no practical audit.  ", "q2r": 1, "assessor": "z_assessor_505", "no_vca": 21, "ne": 3, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "\"Proposal brings a huge idea to change society and the world. Building small towns with a model of self-sufficiency and renewable energy is a wonderful thing and can be replicated worldwide to change the world's current problems.\r\n\r\nIf the proposal is successful, it can become a small autonomous country model with visions and laws towards sustainable development. I really like this idea\"", "q0r": 5, "q1": "\"The team of the proposal has a lot of people with different experiences who are perfectly suited to implementing this project. When I go to the youtube channel and website of the proposal, I see that the proposer is a youtuber with over 100,000 subscribers and they also have a number of ambassadors for the proposal. This can make the proposal highly viable.\r\n\r\nBut I'd really like to see a more concrete plan than the ideas the team wants to work on in this proposal. A roadmap and specific goals for each given time period will help people clearly know how those ideas will be implemented specifically. From there, we can have better confidence in the success of the proposal.\r\n\r\nTherefore, with only ideas without specific plans and goals, the proposal will be very difficult to come true because the things the team wants to do are too much and need a lot of resources and efforts.\"", "q1r": 3, "q2": "\"Proposal has yet to come up with a roadmap, KPI or specific plan for implementation, nor has it told us how they use the money to achieve the results they set out to be. So it's almost impossible to audit\r\n\r\nTherefore, the proposer should give a specific plan and how to use the money so that we can know how to audit the proposal.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The problem statement remains very abstract, this term needs to be clarified in detail: \"a perfect world full of harmony and abundance\". I can see the idea of \"The One Small Town initiative\", a potential experiment in the Cardano ecosystem. However, the impact on the Cardano ecosystem as a whole is unclear. Therefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2", "q0r": 2, "q1": "In terms of feasibility, I am quite convinced by the proposer profile [described as Researcher - Scientist - Author - Activist - Humanitarian. Senior Financial Planner. Coach in blockchain & cryptocurrency. Business Planner], but it would be better if a profile link is provided for verification since it is not clearly described. Besides, the roadmap/timelines are not provided, without any KPIs. The budget structure is not provided. Therefore, based on the given information, I disagree with this proposal's feasibility, I can rate it with a score of 2", "q1r": 2, "q2": "For better auditability, the following information should be added: (1) Proposer's profile; (2) Budget structure; (3) Roadmap/milestone with measurable KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The only requirement for this challenge brief is that the proposal must have something to do with Cardano.  Somehow, this proposal manages to fail.  I can suggest one possible scenario where this proposal could be considered tangentially related:  if one of this proposal team's 4 other proposals,  totaling $252,500 in requested funding, across other challenges manages to  get funded, then this funding request would essentially be...insurance?...for execution elsewhere.  Whether one agrees or not with the philosophy of Contributionism or the goals of OST that they present here, this particular request, worth half of the total Miscellaneous Challenge funds available, does not seem to be in alignment with either the purpose of Catalyst, or the brief for this particular challenge.", "q0r": 1, "q1": "There are no requirements of the team, no milestones or deliverables, no budget, no timescale over which these funds are to be applied.  If you read their whitepaper, there is a section that defines the start-up economics of their idea,  3 types of persons or institutions foreseen to participate in the purchase of their token :\r\n- PATRON : Supporter of the OST plan and accomplishment of Contributionism in the\r\nworld. Expect nothing back but the satisfaction to be part of the creation of a new world.\r\n- INVESTOR : Holder of the OST token, ideally believe in the OST plan on a conscious\r\nlevel. Will be able to purchase a NFT that represents a share in a business and will earn\r\na dividend while holding it.\r\n- TRADER : Volatility players, traders are more capitalism oriented and therefore less\r\ndesired to participate in our project.\r\n\r\nIt is clear that they would like to onboard Project Catalyst as a PATRON under the above definitions, so it would  be helpful for the proposers to have included metrics or key performance indicators of the Catalyst community's \"satisfaction\" level, such as a survey or poll once they have been funded, as well as what \"satisfaction\" targets they would like to hit.\r\n", "q1r": 1, "q2": "As noted in my Feasibility comment, the definition of PATRON by this proposer leaves very little to measure in terms of auditing the distribution of these funds.  As suggested, some KPIs such as tracking the delivery of individual emotional \"peaks\" could be a means for this proposal to show they are on track for delivering \"satisfaction\", though there is an issue that no particular timeline has been applied or suggested.", "q2r": 1, "assessor": "z_assessor_811", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "I think this is an interesting idea that promises high-impact to see how crypto-currency and blockchain can alternate cash in an eco-village/small town. It would also add much credibility and validity for the Cardano community. However, the currency and its tokenomy can only be tested in an established community, and from what I understand that there is not yet any ONE SMALL TOWN established since the organization started in 2005. This hindered the potential impact of the project within the consideration of Fund 7, so I only rate it for 2 stars. ", "q0r": 2, "q1": "I am unable to establish the validity for this project for two reasons:\r\n1/ There is not yet any ONE SMALL TOWN in the world, and it's unlikely that the team can set up a town soon within the duration of Fund 7.\r\n2/ In both the proposal and its attachment, I see no implementation plan (beside a brief roadmap in the attachment) to explain the reasons behind its request for a subsequent amount of USD $100,000.\r\nIn order to build trust in assessor and voters, perhaps the team need to rework this proposal, give it an appropriate level of depth, work with its existing community to define a mock-up test, and submit next time. ", "q1r": 1, "q2": "As discussed in previous two ratings, there is no basics to audit the progress and success of this proposal. ", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 18, "ne": 0, "ng": 15, "nfo": 3, "vca_o": 1}], "solution": "This world is possible and we are creating it for ourselves – not somewhere in the distant future, but now, in our own lifetime.", "experience": "Researcher - Scientist - Author - Activist - Humanitarian. Senior Financial Planner. Coach in blockchain & cryptocurrency. Business Planner."}