{"id": 384223, "author": "cargofe2", "title": "Colombian Congress Cardano", "url": "https://cardano.ideascale.com/a/dtd/384223-48088", "category": 26235, "amount": 4500, "description": "Os congressistas colombianos exigem informações de qualidade sobre Cardano para tomar melhores decisões legislativas sobre as moedas criptográficas em 2022/26", "funded": 2, "upvotes": 126426982, "downvotes": 4706993, "votes_result": 121719989, "votes_cast": 479, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "A declaração de solução é sensata à luz da declaração do problema e ambas estão claramente escritas. Uma vez que o desafio procura aumentar os esforços de defesa para pressionar e educar os políticos, com o objetivo de produzir melhores leis e regulamentos favoráveis a Cardano em particular, o tutorial digital proposto em espanhol a ser distribuído aos legisladores colombianos faz sentido. A falta de informações precisas e acessíveis sobre Cardano escritas em espanhol é uma grande barreira para a defesa de interesses nas nações de língua espanhola. Portanto, tal ferramenta tem utilidade potencial em toda a América Central e do Sul. Dado o modesto orçamento proposto (US$ 4.500) e a potencial distribuição escalável do guia, o projeto parece ser um bom uso dos fundos do tesouro. Dito isto, a proposta fornece poucos detalhes que explicam por que a advocacia é necessária especificamente na Colômbia. De modo geral, concordo que esta proposta trata efetivamente do desafio.", "q0r": 4, "q1": "Os membros da equipe possuem ampla experiência jurídica e consultiva relacionada à Colômbia, assim como conexões com o governo colombiano. Dito isto, o tamanho e a extensão desta rede social são vagos. Além disso, não está claro como os guias devem ser distribuídos aos membros do congresso ou a seus funcionários (por exemplo, via e-mail). A partir de minha experiência pessoal produzindo pesquisas patrocinadas de políticas públicas e divulgando estas descobertas aos legisladores estaduais e membros do Congresso, é difícil colocar tais informações nas mãos das pessoas certas. Tais esforços de lobby freqüentemente exigem múltiplos acompanhamentos com os funcionários e, em alguns casos, podem resultar em solicitações de chamadas telefônicas em conferência ou reuniões do Zoom. A proposta não parece conter nenhum plano claro a respeito de tais esforços de acompanhamento. Além disso, a proposta não identifica qual membro da equipe é o especialista em blockchain/Cardano responsável pela elaboração do guia digital. Isto será terceirizado ou feito por um membro da equipe?", "q1r": 3, "q2": "Embora o desenvolvimento e a produção do guia Cardano em espanhol seja fácil de verificar, o \"Roadmap and milestones\" fornecido pela equipe são vagos ou difíceis de entender. Eu recomendaria que essa equipe tornasse esses marcos cristalinos. Além disso, os KPIs/métricas listados na proposta são discutíveis. A maior parte das métricas procura medir o número de guias enviados aos membros do Congresso Colombiano em vez do impacto de tais guias (que é reconhecidamente difícil de medir) ou o número de comunicações de acompanhamento entre a equipe e os membros interessados do Congresso (que na minha experiência é o melhor resultado que se pode esperar). Os guias informativos normalmente são usados para iniciar uma conversa com legisladores e seus principais membros da equipe, o que pode levar ao testemunho do Congresso ou à introdução de legislação (nosso objetivo final). Como tal, não concordo nem discordo que esta proposta forneça informações suficientes para que a comunidade possa analisar o progresso futuro.", "q2r": 3, "assessor": "z_assessor_914", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The plan in this proposal is to create an informational chart accompanied by infographics with the purpose of providing Colombian congressmen with correct information from our viewpoint. This with the intention of them making more favorable decisions based on correct information. It could set the basis of a more friendly environment in Colombian congress towards crypto in general, which would enable an array of possibilities. ", "q0r": 5, "q1": "The proposing team have well documented themselves in the proposal. They are also exceptionally well placed to perform this task. Having a team member who is a former official of Colombian congress enables the proposers to know how things happen on the inside and gives them an edge to plan their approach, which will look professional towards the congressmen. The budget is modest, but not unrealistic. ", "q1r": 5, "q2": "Incredibly detailed proposal with very clear KPIs included. To even improve, a clarification on how the risks in the risk analysis could be mitigated could be included. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 2, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "I really like the idea. Going forward to the people who are decisive - congresmen, in this case, may be a great way to educate them. Well-organized, short but informative one-pagers may bring more awareness and really influence further decisions. Such materials should be not only available to Latin America users but later translated and adjusted to other languages and cultures. It's a chance for a global face-to-face education for politicians.", "q0r": 5, "q1": "2 lawyers in the team, one with experience in politics is heart-warming in such project. It seems they are well prepared to complete what they aim at. Especially as the proposing team claims they are after first talks with targeted people. Budget is reasonable and well explained. Plan has possible dates.", "q1r": 5, "q2": "If proposers take it seriously and will monitor their effectiveness as promised - there should not be any problem with auditability. This will however require a lot of effort, to monitor later legislation processes. I keep my fingers crossed. ", "q2r": 5, "assessor": "z_assessor_324", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "i strogly agree because the problem needed to be solved has been identified in the challenge and falling within yhe scope.\r\nAnd will also add value to the cardano ecosystem.\r\n\r\nkey metrics and goals are been stated clearly and falls with the scope of the challenge and can scale to address  future challenegies to.", "q0r": 5, "q1": "the proposal has provide accurate links and references that show relevant skills and experiences needed to implement the proposal.\r\n\r\nTheir level of competent is good and the proposal have also listed in manner the number of team memebers required to implement the proposal, and team structure is also good.\r\n\r\nHas a reasonable bedget and clearly break down into identifiable items in order to achieve the set goals...\r\n\r\nthe proposal has a provide a realistic timetable to complete the work if funded.\r\n\r\nThe plan of the the proposal also describes the necessary resource to implement it.\r\n", "q1r": 5, "q2": "I strongly agree due to the providing of road maps and has likns to audit  them if project is funded.\r\nall clearly metrics/KPI's define thhe success of the proposal\r\n\r\nthere is also a clearly understanderble describtion of the targeted  problem and a clearly understanderble solutions to address the propoasal.", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "Great proposal. The target of congressmen is great. I think they are the exact group the challenge is seeking to influence. ", "q0r": 5, "q1": "Great team experience. I think one of the KPIs has been given an inappropriate metric. It is not helpful to measure number of congressmen informed but rather, the number of legislative initiatives or private member bills on favorable legislation by congressmen was targeted by the organization's activities. Building collaboration is great as well. I think aspect of the proposal should be given a relook.", "q1r": 3, "q2": "Great road map and detailed budget. The proposal should consider documenting of activities to enable easy auditing. ", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses many metrics of the challenge, however the final version of the document cannot be sufficiently imagined when going solely from the proposal description. ", "q0r": 4, "q1": "The credentials of the team are sufficient and even impressive, due to the claim of having some access to the Congress. In the end it depends in what way CryptoCurrency and blockchain will be presented to the presiding Congress so that it will hopefully complement their current plan and goals. ", "q1r": 4, "q2": "The document itself can be easily audited for progress. The Congress votes and deliberations are also usually public. ", "q2r": 5, "assessor": "z_assessor_832", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Será criado um documento digital informativo e ilustrativo de fácil e rápida compreensão para esta população-alvo", "experience": "Consultor com 15 anos de experiência, ex-funcionário do congresso com amplo conhecimento do perfil alvo"}