{"id": 383521, "author": "lifttrick", "title": "Bank Systems Using People", "url": "https://cardano.ideascale.com/a/dtd/383521-48088", "category": 26233, "amount": 200000, "description": "进入这个新时代，我认为加密货币和人类面临的问题是平等与贪婪的问题。我们必须找到一个平衡点。", "funded": 0, "upvotes": 12367184, "downvotes": 29218319, "votes_result": 16851135, "votes_cast": 341, "f6_no_assessments": 6, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The identified problem looks more like a supposition than a sustainable fact and the solution to the problem starts from a false premise \"The current banking system is used to keep the people poor.\" The bank, like any other business, exists to make profit. \r\n\r\nThe proposal doesn't fit in the challenge objectives and it lacks in providing necessary information about what is to be done.", "q0r": 1, "q1": "There is no info about anything that can sustain this project: no budget, no resources to be used, no plan about what things will look like, no risk awareness. The requested amount is the only certain thing about this proposal.", "q1r": 1, "q2": "Unfortunately there is nothing to assess at this proposal as there is no relevant info about the project implementation.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 25, "ne": 0, "ng": 20, "nfo": 5, "vca_o": 1}, {"q0": "This proposal has identified a problem within the challenge. Unfortunately the proposal lacks crucial information that could help the rate on its impact cardano. I suggest to the proposer to look at funded proposals and use them as reference to improve the structure of this proposal.The problem identified may fit into the challenge. However there is a serious need for improvements to  this project, for instance, by articulating how it adds value to the cardano ecosystem, adding key metrics and strong KPIs and all the other details that can be useful to the proposal.\r\n.\r\n", "q0r": 2, "q1": "There is not enough information in this proposal to be feasible. The proposer should've added evidence of relevance skills and experiences, as well as the team and resources needed to complete the project. The proposer can extend the proposal improvement by adding a budget breakdown section, a timetable to complete the work, a clear description of what is being built and how.  Once all these areas are filled, I think that the proposal can have a chance of being approved in future funds.\r\n\r\n", "q1r": 2, "q2": "The proposal lacks the basic information required to be auditable. The proposer should add a roadmap with realistic milestones , Metrics and KPIs and a clear description of the product being built and the problem it solves. The best way, in my opinion, to get help for structuring the proposal is to head over the funded proposal and emulate them.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "\"I really like the idea of creating a system or platform that can replace the current banking system. Because the current banking system has a lot of problems that need to be solved. The future of Defi will certainly be an alternative to the current centralized banking system. So this is a great idea.\r\nBut it would be even better if there was a specific solution or product the team could come up with. In this proposal, one idea is not enough to show its impact on current reality\"", "q0r": 2, "q1": "\"In my opinion, to implement this proposal, the team needs to have experienced people in Defi and the current banking system. With the experience of working in a Company Oil Company in Marketing and IT for 8 years, I have not seen anything related to this proposal.\r\nIn addition, the lack of a specific plan and solution makes this proposal unfeasible\"", "q1r": 1, "q2": "No, the information provided is not sufficient to audit the proposal at all.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is within the challenge goal, because I think that this implementation will be great for the Cardano ecosystem and users to have an alternative in financial stability, especially the ones that are struggling. I've read the attached document three times to fully grasp and I really like the idea of treasury backed by real world assets/debts. But there are some unclear points and details in terms of the flow of delivering the proposal. ", "q0r": 3, "q1": "The proposer states that it has the necessary experience in developing technology (on hardware and software). But there is no section in the doc mentioning on hiring members (ie; business consultant). Just my suggestion, on the part where the proposer is explaining briefly on the tokenomics, it will be helpful if there is a detailed equations on the yield percentage and TVL in the given timeline. I believe with a more detailed and clear approach of this idea will one day be a revolutionary alternative for users to participate as we are blinded by how traditional banking system works. In relation to the possible success of the initiative, I think that the proposed solution is very ambitious and very complex, it could be successful but there are many many tasks and risks, so my advice is to simplify the steps and reduce the perimeter so as to more easily hit the target (eg a single market, ... ), and consenquenly also reduce the budget\r\nFurther I think it's important to improve details about the process related to the issue related to the market or capital risk.", "q1r": 4, "q2": "This proposal seems interesting as it uses debts as real world assets for the token, but the given file is a quite unclear to understand the in-depth solution. There is no breakdown of the requested fund, on how it will be allocated to the roadmap given. On the roadmap, what are the KPI(s) and goals/risks that can be measured with the fund required to achieve these objectives? What are the values governed by the community ground rules to stabilize and reduce risk in the system? How can we avoid security breach and the steps taken to address when an attack occurs in the treasury? To initially propel the protocol, what will be the team members that will be developing the Bank System, ways to market and expanding the idea?", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 16, "ne": 8, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposer focuses on proposing a new banking system that operates like a circle instead of a pyramid. The problem statement [Equality Vs Greed] is quite abstract and not explained in detail. Conceptually, I do not think it has any certain fit for the challenge. However, It seems that this proposal is incomplete. The solution's direction remains very abstract [changing \"how people think about banks\"]. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "It's hard to assess an incomplete proposal with limited information. The proposer's profile description shows that it is quite not suitable for this kind of proposal, and there is no proof/link for verification. Based on the given information, I strongly disagree with this proposal's feasible, and would give it a score of 1.", "q1r": 1, "q2": "Since this is an incomplete proposal, lack of important components of information: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge.\r\nTherefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Thanks for your suggestion, first in terms of impact. I don't really understand the solution of this option. Crypto and banking work in two different ways. Crypto implements in a decentralized environment with high applicability. Banks are controlled by the state. Because you know that if banks are not controlled, there will be a financial crisis and to avoid inflation due to excessive money printing, the state will need to control. I think we can come up with other solutions like how can we create communities where they understand how financial activities work and contribute to the economy of the country.", "q0r": 2, "q1": "In terms of feasibility, I hope you can elaborate more on your personal profile as well as your team such as whether there is someone responsible for the financial aspect. Also I hope you can show us the short and long term project roadmap. And the criteria you need to achieve in the future, I think it is necessary for your project. ", "q1r": 1, "q2": "In the roadmap I hope you can describe what value you want here, for the country, the financial market or the people. Because you require an investment of up to 20000$ which is quite a large amount. You should explain how you will use this money? For how long and how can people see you using it?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "目前的银行系统是用来保持人民的贫困。我提议建立一个新的银行系统，它的运作就像一个圆圈，而不是一个金字塔。", "experience": "我在一家石油公司的营销和IT部门工作了8年。我不再在那里工作了，因为我的工作已经自动化。"}