{"id": 383884, "author": "mallabs", "title": "Custodian Layer for Cardano", "url": "https://cardano.ideascale.com/a/dtd/383884-48088", "category": 26233, "amount": 95000, "description": "Cardano上的DeFi与机构投资者使用的托管银行不能很好地运作。这阻碍了对这些深层流动性池的访问", "funded": 1, "upvotes": 115778055, "downvotes": 13897794, "votes_result": 101880261, "votes_cast": 801, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案描述了关于DeFi被机构投资者采纳和使用的要求的研究。能够提供最高保证以及符合当地监管的区块链生态系统将有最大的机会获得更多的资本流入其生态系统。这种资本流入将增加生态系统的规模、效率以及能够满足不同要求的DeFi产品的数量。由于需要满足监管和迎合每个市场，这项研究和建议的潜在影响在长期采用方面可能是巨大的。提案小组提供了有经验的金融团队成员的信息，还详细说明了机构在决定和能够向这些市场分配资金时所面临的问题，这些解释很好地证明了提案小组很了解市场要求，他们的研究将有很大机会对Cardano DeFi生态系统产生影响。", "q0r": 5, "q1": "该提案列出了四个团队成员，三个工程师和一个有金融背景的人。提供了工程师的LinkedIn简介。该提案团队代表了正在为Cardano生态系统创建DEX的Maladex组织，Maladex的白皮书和工作以及进步的来源提供了证据，证明该团队拥有实施该提案的技术专长和知识。金融团队成员的背景在金融领域有专门的知识，并在该领域有一个网络，但他仍然是匿名的，这至少是一些小问题。该团队已经提供了足够的证据，表明他们了解金融机构所面临的核心问题，从而减轻了对团队中是否有足够的核心金融背景的担忧。如果能看到该提案的预算有更好的细分，以了解预算如何分配，那就更好了。由于该团队的历史和迄今为止提供的工作证据，该提案团队似乎可以可行地执行。", "q1r": 4, "q2": "提案团队增加了一个他们打算衡量实现目标进展的方法清单，以及他们打算何时实现的时间表。例如，他们提到 \"有多少机构投资者和托管人开始将资金分配给Cardano生态系统？资金分配的水平是什么？机构对Cardano的TVL是多少？\"。建议的清晰度很高，充分描述了问题、解决方案以及他们的建议如何适用于挑战书。建议和研究将在最后公开，然后可以进行审计。由于研究转化为实际生产项目的时间延迟，可能很难准确确定这项研究如何导致机构采用。总的来说，清晰度很高，可审计性对社会来说应该是可以实现的，但应该注意的是，在真正审计这个建议的最终影响上会有一些延迟。", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Another great proposal from Mallabs, connecting traditional finance to DeFi.\r\nThe proposal addresses the issue of research for open source new financial models and the inclusion of institutional investors.\r\nValue for the Cardano ecosystem will be through enabling institutional money to access the Cardano DeFi layer.\r\nKey metrics will include adoption by institutions as well use of the research by other DeFi teams on Cardano. ", "q0r": 5, "q1": "The proposing team is well known to the community, with a development on its own advanced Dex as well as getting funded in Fund6.\r\nThe team is highly competent with a good mix of financial backgrounds, high education and precious Haskell know-how. The team has sufficient experience and capacity to deliver and are well known in the community.\r\nThe budget is clear and covers mainly the cost of personnel for the duration of the research.\r\nThe length of the research seems reasonable over one year with several milestones to report on.\r\nThe possible risks have not been addressed in particular, but given the team background and the research nature of the project, I do not consider it as high impact to deduct points.", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\nThe budget is a bit on the high side in comparison to challenging funding.\r\nThe proposal aims to clarify the legal requirements as well as tools and setups needed for the institutional investors to invest on Cardano ecosystem and DeFi.\r\nIf successful, such research will be a foundation for the whole Cardano ecosystem to build upon.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 24, "ne": 6, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "As the Cardano protocol gains acceptance in the industry, the differentiator will not be so much from other blockchain DeFi solutions, but rather the ability to replicate the levels of security in the traditional world of finance. DEX's themselves do not have the experience or brainpower to develop those tools. But those tools are what  the Cardano financial community needs to grow and capture institutional investors. The real money.", "q0r": 5, "q1": "Not possible to overrate the qualifications that this proposer brings to bear on a). Haskell language programming and b). Financial industry experience. Proposers like this are exactly what Cardano community needs to move the barriers.", "q1r": 5, "q2": "The proposers rationally establish goals as research first then charting a course going forward. \"output of frameworks and recommendations\" The numbers are completely in line with the skill levels of the team. Certainly  these serious players are accustomed to monitoring and evaluation of progress. With no motivation to deceive. ", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 23, "ne": 1, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This is a great idea! The team clearly points out the problem that DeFi has on Cardano and offers a great solution for that problem. This proposal has a positive impact on the Cardano ecosystem and explains in great detail how it will add value to the Cardano and Catalyst ecosystem. KPIs in this proposal match the ones indicated in the challenge and this proposal can scale and address future challenges.", "q0r": 5, "q1": "The team provides all the necessary evidence that perfectly lets us know that their work is adorned with the experience and skills needed to realize this project. Transparency via LinkedIn perfectly shows us that this team of three has the necessary knowledge, skills and experience needed to implement this project. The budget is clearly presented but we do not have a clear insight into how the money will be distributed within the team. It is clear that the team plans to hire additional external collaborators but budget should be broken down into identifiable items. The amount requested for the realization of this project may be realistic, but since the amount is quite high, it would be better to divide it in half and ask for the other half in Catalyst F8. The team does not ask for additional funds to implement the proposal and a detailed implementable plan is presented and perfectly developed. Details of actionable tasks and order of execution for some reason are omitted but the proposal offer a realistic perfectly elaborated timetable to complete the work. Unfortunately, the proposal does not mention the resources and technical aspects, language and technologies required for implementation. It would be good to cover possible risks, especially when such large funds are required.", "q1r": 2, "q2": "\r\nThe team provides a roadmap and time frame within which the project will be completed. The proposal has perfectly developed KPIs that can be used to quantify the success of the project. The community can track the success and progress of this project without any problems.\r\n", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1, "reply": "The main reason for scoring low is the asked for amount. However, there has been purposely created a category called \"Seeding Cardano's Grassroot DeFi\" separate from \"Boosting Cardano's DeFi\" to allow for wider scope and more resource hungry proposals. I believe this feedback would be justified in Grassroot category, but not in Boosting DeFi."}, {"q0": "The proposal addresses an often overlooked aspect of DeFi, focusing on the needs of potential investors, instead of the possibilities of technology.\r\nMost DeFi proposals on Cardano are in a sense playing catch-up to projects on other networks, but this feels like a fresh take, offering something that is lacking elsewhere.\r\nGiven the nature of the proposal, some of the Funds KPIs are not directly applicable, but the proposer is open about it, and makes a good job identifying those, and detailing the expected impact on the applicable KPIs. \r\nAdditionally, although the proposer is a known player in the Cardano ecosystem, and has an ongoing DEX in development, the proposal is targeted towards the whole Cardano community, and not trying to just strengthen their existing product.\r\n", "q0r": 5, "q1": "This is an complex proposal, but team seems to be have the necessary skills and contacts to approach it with a reasonable expectation of success. \r\nDeliverables are defined, although with some uncertainty in the academic output (\"one or many research papers\"), but I'd say in this case the most important deliverable is the report on needs and recommendations. \r\nThe budget is quite high, and I was expecting to see the usual itemization, it is really sufficiently justified by the lenght of the project and profiles involved.", "q1r": 4, "q2": "The proposer offers various metrics of the success of the proposal. Some are difficult to assess (which institutions they interview) or measure (gauging change in interest from investors). But there are a few very good ones: partnerships established within the Cardano ecosystem, adoption of recommendations in other projects in the Cardano community, number and volume of institutional investors allocating funds to Cardano", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 18, "ne": 7, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "研究Cardano钱包的许可和KYC层，特别是轻型钱包，以建立保管人和许可层。", "experience": "传统金融业的资深人士、量化师、经验丰富的Haskell开发者。"}