{"id": 415326, "author": "mie.tran.0407", "title": "Cardano Catalyst TV", "url": "https://cardano.ideascale.com/a/dtd/415326-48088", "category": 26602, "amount": 19020, "description": "Voters do not have time to read and comprehend the insights of all proposals worth voting on, and proposers lack the credibility and reputability to reach voters as well as marketing means", "f6_no_assessments": 22, "f6_rating": 4.5606060606060606, "videos": [], "media": [], "f6_assessments": [{"id": 3446, "q0": "There's a nice idea here, for providing a 5 to 8-minute space in Youtube for proposers in Asia to better expose their proposals and gain the trust of the voters in a more srtaightfoward way. This can certainly help to overcome language barries for both voter and proposers, as this interviews witll be translated in 3 languages. This, of course, addresses the challenge as it fits well in the challenge definition of success (\"A broad spectrum of people across Asia and connected to Asia, coming together and forming teams to grow our ecosystem\"). Moreover, this is a continuation from a project funded in F7 and proposer does a good job on presenting the overal numbers for this (38 videos recorded and more than half proposals funded). In this sense, it would be nice to bring also here the perceptions of the voters who did watch the videos and how they thought this helped them on clarifying about the proposal. Risk management is well done with 3 challenge well identified and a proper mitigation strategy in place.\nIn addition to the information provided, it wold be also nice to understand how proposer would select the proposals who want to have their videos recorded in case there's more demand for it than the capacity to execute these recordings. Other suggestion would be to include how proposer intends to expand and improve in relation to the past fund, it was funded and indicate if there'll be any modication in the dynamics.", "q0r": 5, "q1": "There's asequence of tasks/acitvities but they are not layed out in time, it just mentions it will serve for F9 and 10. it would be nice to see how many weeks or days each task would take , or even the amount of time required for each video, considering its whole cycle (proposal engagement, record, editing, translations and promotions).\nBudget breakdown is reasonable and matches project scope. it decomposes the costs mainly in the tasks or roles (if its associated to a person) by each video to get o the total of each video and the sums up the total number of videos, which is a nice and transparent approach. \nRegarding the team, it has 2 people in it, with already experience in such project in the past and background in translations. Linkedin links are provided.\nAll in all, feasbility doesnt seem a problem in this project, but project plan could be better detailed.", "q1r": 4, "q2": "The outcomes/deliverables of the projects are verifiable by themselves (the video interviews on youtube). In adition to this, proposer suggest some extra kpis, related to the engagement in each videos on YT, and a target for at least 1 of them (100 views/video), which will help to assess feedback. As further suggestions, it would be nice to understand how these kpis will grow in comparison to last time this project was funded and could take into account also feedback from voters, as an extra metric, to understand its impact on their decision.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 14057, "q0": "The proposal is so close to meeting the criteria for the challenge that the proponent has established a channel to help promote the proponents, allowing them fast get support from voters and the community and improve their reputation there. The future development plan, which can scale and solve future issues, was clearly stated by the proponent. Fund7 is the proposal's sponsor, and 38 videos have been made available. I consider it to be fairly successful because, according to the research, each video receives an average of 80 views, with the most popular video receiving 341 views.   This idea has my full approval.", "q0r": 5, "q1": "The proposer offered a link that listed the qualifications that team members must have in order to carry out the plan. The advocate also provided a detailed strategy that would result in 8 videos being produced each week over the course of 4 weeks and being translated into Japanese, Vietnamese, and English. Regarding the sponsorship funds, the proponent has precisely outlined the expenses involved in producing a video that comprises seven parts, and I believe the aforementioned sum is appropriate. Additionally, the proponent examined beforehand any potential hazards related to implementation and suggested ways to mitigate them. Because of Fund7's success and the proponent's extensive experience, I anticipate that this initiative will succeed even better than it has in the past and continue to expand.", "q1r": 4, "q2": "The proponent has supplied social media platforms like Youtube, Twitter, Voter Tool, Telegram, and the landing page for Eastern Town Hall to promote the videos they will release on a weekly basis. The amount of financing proposals submitted using Catalyst TV for Marketing, views per video, shares, feedback, and comments, among other metrics, have been developed as a tool to gauge success. But I believe they ought to gather those statistics. Set KPIs with more specific objectives for this season than those from last. Additionally, the proponent makes clear that it is difficult to define project success.", "q2r": 5, "assessor": "z_assessor_3888", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14006, "q0": "This proposal is likely to build a Cardano Catalyst program that let proposers take part in interviewing Ms.Mie Tran by involving fascinating WH questions around their proposals. This can be seen as an indirect method for proposers to introduce and explain the idea they presented in the proposal. Thus, the opportunities of getting more votes for their project to be financed are enhanced. If the proposal is completed effectively, it can absolutely attract more viewers and new users to our community. The interviews will be recorded and edited as well as translated to other languages like Vietnamese, Japanese, etc. It impressed me about the creation and innovation in the mindset. It is obvious to observe the impact of the proposal on most of Cardano’s community in plentiful sides such as linguistics, interaction, and marketing and bring Cardano closer to a lot more people outside of the community. The first benefit it brings to Cardano’s community is that people who are in community but non native English speakers can understand the content of each video that is published via plentiful social media platforms as mentioned above since the content is translated into multi-languages. Thereby, avoiding or minimizing the number of people that cannot reach the meaning due to the lack of English. By the way, this program will be a helpful tool for proposers to build a marketing strategy to spread the reputation as well as the project/proposals of Cardano’s community on other platforms. Therefore, Cardano’s community can enhance its profit as a beneficiary. Catalyst’s value will also be raised, and the brand name “Catalyst” is expected to attract more new proposals in most of the later funds as well as be easier for citizens all over the world to identify.", "q0r": 5, "q1": "The possibility of the proposal is appreciated by me. Firstly, since this proposal was successful in being the financed proposal at Fund7 in the past, there is a high commitment on the quality of the proposal. I expect this time participating the team can again achieve the same or even higher result in Fund9. The achieved result of this team was so amazing with such a huge creative stuff inside. Hence, I quite believe in the capacity of each member in the team. They already have diversity of experience and I do want to see more innovation this time. The proposer has attached the personal information of each member with such amazed experience in those proposals in a lot of previous Funds before. On the other hand,  the duration and timeline for each item in the worksheet is divided as more specific as possible, guaranteeing to finish before the deadline which is set up at the beginning. Lastly, a very detailed budget is a plus point for this proposal. There is a list of costs that may occur before, during, and after the process is conducted and it is presented chronologically. ", "q1r": 5, "q2": "Overall, in this part, I suggest that the worksheet should supplement some more details about the target KPIs like how many new local users will attend Cardano after watching those videos with the translated content, if possible, this would enhance the quality as well as the truthful level of the sheet. I mean the proposer should provide some spotlight for noticing which items are important in the timeline to measure the successful proportion in 100% total of the proposal. On the contrary, a recommendation here is that we need a particular unit as well as a number to estimate how large the size, or how popular as well as the completing progress. The requirement of asking for a specification might be difficult for the proposer to conduct but he/she can take advantage of the previous data and forecast the targeted numbers based on past success. This would be a great reference for the voters to make an evaluation of how effective the proposal is. This is a convenient method for us to follow the progress step-by-step, stage-by-stage. ", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13644, "q0": "As described by the Challenge, the main metrics are:\n1. Quantity and quality of sponsored proposals sourced from East Asian teams.\n2. Observable impacts of funded projects\nLooking at the author's suggestion above the problem will be solved very easily. Because this proposal will help many Vietnamese project owners easily know Catalyst and contact English and Japanese speaking voters. This can be quite a language barrier for Vietnamese project owners who only use one language, Vietnamese. With this proposal, the possibility of quality projects being supported by voters will be higher.", "q0r": 5, "q1": "According to the author's information I see on likedin is a very young person but has the right skills to complete this proposal.\n\nAt the same time, this is a proposal to follow their other proposal in Fund7. The proposal in Fund7 they have been funded is similar to the current proposal they are applying for. They accomplished it through video content I watched on their youtube channel. Unfortunately, they did not include that information in the proposal. So I believe the author will efficiently complete this proposal.", "q1r": 5, "q2": "The proposal provides detailed information on the implementation schedule and costs. All information about the work progress is publicly updated on the Youtube channel.\n\nI suggest the author should plan the communication to help more voters know about Youtube channel.\n\nI agree that this recommendation provides me with nearly sufficient information to evaluate progress toward the stated objectives and auditability.", "q2r": 4, "assessor": "z_assessor_3710", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13592, "q0": "I think this proposal will help increase the number of proposals in Asia and especially in Vietnam. It also helps to increase the number of sponsored quality proposals on Catalyst. Large voters often do not have much time to consider proposals carefully and in detail. Having a short video outlining the project and the team and what makes it different will save these voters a lot of time. Proposal is also a trusted partner for non-English or Japanese-speaking proposal writers to easily introduce English and Japanese-speaking voters to the value their proposal will bring. However, during the interview, I think the author should develop different questions to explore all aspects of the proposal rather than a common set of questions for all proposals. However, I consider this proposal to fully meet the conditions required by the challenge, and a 5-star rating is completely appropriate. Hopefully the author will improve the video quality better and have more content, or can shorten the time and still keep the quality. Help voters see more proposals and quickly find quality proposals", "q0r": 5, "q1": "After watching the videos on the author's youtube channel and the results they have made. Although their channel does not have many views and the level of professionalism is not high, it is quite average. This proposal describes what the author and team have done before. They did very well on the previous route and plan. Looking at the author's information on linkedin with English language skills, I think the author will help a lot of teams and proposals in Vietnam overcome the language barrier and reach out to large voters. With what the author has done with the portfolio on linkedin and the content in the proposal that the author will do if sponsored. I have full confidence that what the author has put forth in the proposal can be done successfully.\nRegarding the plan, I see that the author is writing not yet detailed. Additional costs or duties are required for communicating the videos to English and Japanese-speaking voters. Introduce new voters to the channel and showcase videos of proposed topics interviewed.", "q1r": 4, "q2": "Information provided by the author about the implementation process and the full cost of implementation. However, I have yet to see the author suggest the risks that would be encountered in the implementation of the proposal if the proposal was funded by Catalyst. For example, if the youtube channel is hacked and appropriated, what solution will the author have? Risky themes aim to scam by crafting a perfect proposition to attract voters and then take money and not execute. So how does the author have a solution to avoid cooperating with those topics with fraudulent intentions? Identifying those risks will help avoid costly repairs and delay the implementation process.\nFinally, the author should have a video showing the number of successful funding proposals supported by the Cardano Catalyst TV channel after each Fund. As such, the community will see how the results of this proposal impact the development of Catalyst as well as the Cardano ecosystem. Finally, the author should think about building a business model that generates cash flow so that this model is sustainable and no longer depends on Catalyst.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12665, "q0": "The proponent identified the issue to be addressed in the challenge that Voters did not have the time to read and understand the details of all the voting-worthy proposals and the proponent's lack of credibility and reputation to reach voters as well as marketing means. The proponent also clearly demonstrated how it will add value to the Cardano ecosystem by reaching audiences, providing general insights, enhancing reputation, and marketing recommendations to multiple members. various community members with a 5- to 8-minute interview with Catalyst TV. To address the proposed separation, the proponent came up with suitable solutions: there were short interviews by Mie Tran and the co-host(s) to allow viewers to know the proponent and help the audience. Vote on the best projects by providing a means by which they can learn about proposals presented in the same format. Interviews will be translated into multiple languages, English, Vietnamese, Japanese, ... Proposers will gain global publicity around their project and on social networks like Youtube, Telegram, Twitter, ... and can increase trust and understanding of voters by posting a link to these videos in their project and on voter tools. Low-effort ways to get voters to evaluate proposals and exploit existing insights. Thereby helping to increase trust, Improve Catalyst's Browsing, everyone will be able to simplify their recommendation into a 5-minute presentation. has a great Recruiting Tool. This proposal, will help voters shorten the time to find out the details of the proposal, and also attract many Asians to participate in voting because it has been translated into English, Vietnamese, Japanese... making it easy for readers to understand and vote on projects so I completely agree that this proposal can be scaled up to effectively tackle future challenges and I give 5* for the impact of this proposal.", "q0r": 5, "q1": "The proponent provided evidence of the required skills and experience of the proponents: Mie Tran: Cardano Catalyst TV presenter, sponsored proponent, Moderator of Cardano Catalyst Eastern Town Hall, Translator and Translator, Challenge Team Member, Sub-Group member, Cardano Passion. Hieu Bui Trung: Japanese Translator, N2 Certificate. The proponent has also specified the types of members needed to implement his proposal. The proponent has also provided a budget that I consider reasonable and clearly outlined. , detailed, broken down into categories: Budget: $1,020 spent on: Interviewers, Video editor subscriptions, Content creators, Video production, Landing page management, Social network management, Registration for otters, Vietnamese, English, and Japanese translation fees. => Total budget for 1 fund $9510 => Total budget for 2 funds 9 and 10: $9510 * 2 = $19020. However, here I have not seen the proponent give a contingency cost to pay for the costs incurred or to prevent ADA price slippage and I think for the project to be successful, the proponent should take into account the costs incurred and should have a specific plan with the contingency cost. The proponent also gave a reasonable timetable as well as a reasonable plan to complete the work as follows: The issuance fund will be used for funds 9 and fund 10 and for each fund, the proponent has given specific tasks and tasks in each fund: Video recording, video translation, video advertising... and in order to successfully implement the project, the proponent has also calculated risks and a proposed way to reduce the project's risk. I agree that this proposal will be successfully implemented and I give 4* for the proposal.", "q1r": 4, "q2": "As mentioned in the feasibility section of the proposal, the Project Proponent has outlined a roadmap to achieve: Successfully uploaded 40 videos per funding round. Translated content has successfully reached local members and aided them in understanding proposal insights. successfully market and increase their presence on most social channels. Add another Asian member to the Catalyst project. Increase engagement between proponents and voters. Create and collaborate with multiple Cardano Ecosystem availability channels. however the proponent has not given important milestones to achieve each achievement, I hope that the proponent will provide a detailed timeline for each achievement that will help the voter Easier to track project progress. the proponent also selected metrics that measure the success of the project: Views Per Video, Play Rate, Feedback and Comments, and Social Shares, and I think those are good indicators too, suitable to determine the success of the proposal. With the stated goal of helping Voters who do not have the time to read and understand the details of all the proposals that deserve a vote, and the proponents who lack the credibility and reputation to reach the electorate. The proponent, as well as marketing tools, have clearly described, is easy to understand, as well as has specific and appropriate measures to help solve the problem, so I give this proposal a good rating, I give 4 * and I agree that this proposal provides me with sufficient information to assess the project's progress toward success.", "q2r": 4, "assessor": "z_assessor_3449", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12242, "q0": "The idea of transforming simple articles into necessarily brief videos, combined with direct interaction with related-parties and linguistic diversity, is a noticeable improvement. \nIn terms of impact, the concept takes a useful step for several reasons. Firstly, technological knowledge is assumed to be hard to acquire, so conveying information relating to technology through video feels much more effective. This form could be a solution to the problem of how to reduce the time needed for conveying technological experience while also creating attraction. Moreover, the video format offers greater space and allows proponents to express their personality and style in presentation than the traditional ways. Secondly, the direct asking-answering form not only properly meets the criteria for the challenge but also overcomes time-consuming problems and maximises efficiency in dealing with queries, especially when reports or proposals are in the worst scenario. In that case, problem-solving requires total coherence among parties that are related, and the direct asking-answering form can afford that. Thirdly, changing the format from reporting to video or expanding to a TV channel is a trend that many successful platforms have previously applied (YouTube, Tiktok) to provide more comprehensive content. If the idea is successful, it not only helps to optimise the Catalyst process, but it also serves as an efficient tool for future marketing. Finally, there will be more opportunities to conquer such a potential market like East Asia if a plan for diversifying languages is launched. As a result, it is simpler to interact with people in foreign countries because messages or information are more effectively communicated through images, videos, and accurate languages than by employing normal translators. Vietnam and Japan are wise moves in the plan. \nGenerally, I will score this criteria 5 points.", "q0r": 5, "q1": "The use of video to communicate with connected parties on social networks has proven to be effective, so there is no doubt about the proposal's feasibility. On the one hand, I believe that direct question-and-answer videos on various social media platforms such as YouTube, Twitter, and others are more appropriate than traditional posts and comments. It means that the suggestion will reach a larger number of people. Furthermore, skilled and qualified professionals in the education and media sector are responsible for this project, therefore there is a chance that it would not only help develop the Cardano Ecosystem but also increase the ties of the East Asian community. On the other hand, I realise the proposal is still an incomplete picture. The operational costs calculated in the proposal show that the proposals are directly proportional to the number of workers. As a result, when the proposals expand, it will cost a greater number of workers. As far as I’m concerned, that is not consistent with the purposes of technology due to its unproductivity. In my perspective, directly adding the AMA form to the community through chatting in Telegram groups is a possible approach to boost efficiency. The solution's benefit is that it can keep the interaction going while saving time on video editing. Moreover, there is a huge income for us if proponents hire us to make their videos. When creating videos used to describe ideas becoming a service, we gain more advantages from saving time and manpower as well as increasing competitive advantages. Furthermore, if the videos are in high demand, the service could be expanded to include a question and answer section.\nI will score 4 points for the feasibility. I hope that my suggestions could give you some ideas to improve.", "q1r": 4, "q2": "Today, it is normal practice to evaluate using indicators such as views, comments, feelings, popularity, and so on. These indications make a great point in that there are now many methods accessible to measure the effectiveness of videos, as well as support to improve transmission performance, so that we can proactively improve the quality by leveraging available models. However, the phenomena of faked channels and indicators that can be faked and spammed by tools may have an impact on the evaluation of the proposal' effectiveness. I believe that adding more indications will make the plan more thorough. To begin, we must assess the percentages of proposals that are approved and funded successfully while using the form, as well as the performance and time savings compared to proposals using the previous form. Secondly, when monitoring community development, it is suggested that tools be added to detect and assist individuals who do not have a fundamental understanding of Catalyst. This is also a great way to develop a new workforce for the Cardano community. Finally, focusing on enhancing and training new users who do not have a basic understanding of blockchain is more important than focusing on aiding individuals who already have a basic knowledge base. To support this goal, a series explaining terms and definitions will bring benefits for new users to catch up with Catalyst.\nIn conclusion, I decide to give this criteria 4 points.", "q2r": 4, "assessor": "z_assessor_3368", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10933, "q0": "As the Cardano ecosystem grows, more and more people are attracted to the Cardano community. After each fund is launched, the number of proponents and projects increases rapidly. As a result, voters do not have much time to stop to read each proposal in detail. As a result, voters may miss out on good, vote-worthy suggestions. The Cardano Catalyst TV project responds promptly to a need for the Cardano community, briefly summarizing a proposal with a 5- to 8-minute interview that is 3 to 5 minutes longer than Fund7's duration. The summary time for a recommendation is quite reasonable; it helps the voter quickly grasp the content and highlights of the project. When too many proposals are posted, Catalyst TV is the fastest way to reach viewers; videos with concise content and easy-to-understand presentations help the project get viewers and increase votes. Especially the content of the Videos is then translated into many languages; this is also a way to help many people know about your proposal and an effective advertising plan. The Cardano Catalyst TV proposal has been funded in Fund7; after being funded, the proposal team has produced more than 38 videos, which is a positive result. Currently, the proposed group is applying for additional funding to continue, expand and upgrade the project. I see this project bringing many benefits and positive impacts to the Cardano community.", "q0r": 5, "q1": "This is a proposal that has been funded in Fund7; I believe it is a proposal that meets the challenges and goals Cardano is aiming for. Currently, the proposal has been working very well; the proponent has completed the task of Fund7, which is to produce 38 videos. The proponent applies for funding to continue creating 40 more videos in the future. The project is intended to promote projects that have not yet been profitable; the proponent should have a detailed plan to generate income from the project to have funding for long-term operation and development. The group of proponents consists of 2 members, I think such a proposal group is a bit small, and the information of the interpreter member is incomplete. I noticed that the content of the videos is edited through another marketing agency. To proactively complete the videos quickly and reduce costs, the proponent should add more members to perform the steps of the project themselves. The proposal has a clear budget and is broken down into categories. In this proposal, I found that the funding budget estimate at fund7 was insufficient to cover the costs, so in fund9, the proponent applied for higher funding and asked for two, including fund nine and fund10. Proposal Cardano Catalyst TVs at greatest risk is time management of interviews, length of videos, and projects with high technical content. Proponents offered reasonable options for addressing the challenge of sending questions to voters for better preparation and limited-time access to key proponents. Besides, the project team exchanging the proposer's details to understand the interview's content is a good way to deal with risks. ", "q1r": 4, "q2": "I see that the project has better preparation and details than Fund7, but the KPIs and audits are not detailed enough. Proposers need to add success metrics such as views per video, play rate, feedback and comments, social shares, and the number of sponsored proposals using Catalyst TV for marketing…I believe the project will be clear and highly appreciated. The proponent should state the results and advantages and disadvantages of the projects in Fund7. For Fund 9, the projects will improve and develop more features to help improve quality and achieve better efficiency. This is a project with positive meaning and value. I hope the team will continue to receive more capital to maintain and develop the project. ", "q2r": 5, "assessor": "z_assessor_3208", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9860, "q0": "The proposal creates a 5 to 8-minute interview with Catalyst TV that fits the challenge. It helps proposal writers to convey more accurate messages to the community, and PAs to understand and accurately propose proposals to give more objective suggestions. Moreover, conveying the message through videos and images makes it easy for the community to accept. This is an ongoing proposal funded by Fund7 and 38 videos have been made, I visited the youtube channel and the video chats with the proposal writer helped me a lot in the process of becoming a PA. The expansion of the content will be translated and subtitled into English, Vietnamese, and Japanese, which will greatly benefit the Cardano community in Asia.", "q0r": 5, "q1": "The project has a great opportunity for implementation. The project has been successful in recent years with a youtube channel, so it is possible to expand more on social networks and languages. A sound budget and a detailed plan that includes progress and milestones to Fund 10 are affirmations for the long term with Catalyst. But when looking at the group, there is only one member \"Japanese Interpreting, N2 Certificate\" with no link to verify the appropriate qualifications with a total translation fee of 9200 USD. This is important because the translation and subtitles of academic and professional proposals need to be accurate. As a side note, interviews should take place before the PA's assessment time. That helps the PAs better understand the project and make more accurate comments.", "q1r": 4, "q2": "The proposal provided success metrics and detailed roadmap information. Videos will be published and easily followed on Youtube, Twitter, voter tools, Telegram, Eastern Townhall landing page. But the proposal needs to provide a more detailed indicator of the milestones achieved so that the community can easily assess and track the progress of the project. For example, how many responses and comments? the number of social shares? the number of sponsored proposals using Catalyst TV for marketing? If giving more detail about the proposed numbers will get the maximum score.", "q2r": 4, "assessor": "z_assessor_3119", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9569, "q0": "\"A good proposal to become a reality must reach the community. The community is always diverse, no one is the same. People like to read, people like to listen, and people like to watch videos with visual images. I appreciate the way you convey the content of the proposals to the community through short interviews with the proponent of the proposal. This is a smart way to deliver content. It not only gives the community concise and concise information but also creates trust for the community to help voters easily make accurate decisions. In addition, the interview has been translated into languages of East Asian countries, helping to further develop this community.\"\n\n“Now the proposals are all written in English. Thus, many voters in East Asian countries, especially those that have not or are developing, will have difficulty understanding the proposal. Your solution to the challenge is very promising. Helping the East Asian community to develop more and more. In addition, I find your interview videos very valuable in terms of quickly disseminating knowledge to the community. So if you add a solution to get your videos to more people, it will be very convincing.”\n\n“Short videos are a good idea, but they also come with risks and challenges. I completely agree that the risks you take are that the video may take longer than expected and that the deep technical issues are difficult to convey accurately. However, if an interview lasts longer than 1 video due to technical problems that are too difficult to understand, you can split it into several videos to make the content of the interview complete. You should also choose proposals that are not too technically complicated to implement. Another risk that I would recommend is that you can't control the interviewee's personality, sometimes the poor preparation of the interviewee will ruin your interview.\"\n", "q0r": 4, "q1": "“A 1-week 8-video progression is appropriate for your current size. I think it needs to be scaled up more to get more proposals to the East Asian community. Remember short videos are always an effective way for the community to access information.”\n“The budget is detailed and consistent with the income of the area where you live.”\n“You need to provide more detailed information about the Japanese interpreter so that voters can easily grasp the information. With what you have done, I believe if your proposal is allocated the funds this time the project will be successful.”\n", "q1r": 4, "q2": "“I completely agree with the metrics you give as a measure of the success and progress of your proposal. I'm particularly interested in social sharing metrics. This is an indicator to help your videos spread to the community.”\n\"100 views per video is less, I think short videos attract more viewers than that. Should be at least 150 - 200 views. In addition, qualitative indicators such as increasing engagement, creating collaboration with other channels, helping local members understand the detailed information of the proposal should be concretized with measurable indicators to the community can easily monitor.\"\n", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9401, "q0": "The author realizes that voters do not have time to read and comprehend the insights of all proposals worth voting on and proposers lack the credibility and reputability to reach voters as well as marketing means. Therefore, she proposes to have short TV interview videos of proposers so that voters could understand and have good decisions. The problem is identified well and I appreciate the way that the author suggests to help proposers approach the voters easily and effectively. Cardano value, through the interviews with subtitles of various languages, could be raised when voters of different languages could approach easily and comprehensively the project content. What I wonder a bit is the limit number of proposers could participate in the interview since the number of project is large and the author does not have enough time to invite all the proposers. I evaluate mark 5 for this criteria.", "q0r": 5, "q1": "There are two members to run this project, the author (experienced working as Cardano Catalyst TV host, funded proposer, Eastern Townhall Moderator, Interpreter and Translator, Challenge Team member, sub-circle team member, Cardano Passionate) and the translator of Japanese language. As to me, if possible, the author should indicate the person in charge of technique and marketing since it is necessary when we edit video and post on different platforms. Besides, the program should be marketed widely to Catalyst community so that more and more proposers know and register for interview. Regarding the budget, it is described logically and clearly. The budget includes fees for translation in Vietnamese, English, Japanese;  costs for Interviewer, Video editor subscription, Content Creator, Video Production, Landing page management, social network management, Otter subscription.\nThe writer also mentions three main matters they may face when running this project, including: time management for each video, limitation of time to reach the major proposers, technical proposals which may make it hard for the team to fully understand the insight and translate correctly. To solve these problems, the writer suggests the proper solutions to overcome. I agree with these solutions. In conclusion, I give mark 5 for this criteria.", "q1r": 5, "q2": "This project is run during fund 9 and 10. It is estimated to conduct at least 8 videos per week until the voting round. Each video will have a complete translation and be promoted on different media social network. The key measurements to evaluate the success of this project are: Uploading 40 videos to each funding round, translating content successfully to reach local members, marketing proposal project successfully, increasing the bond between proposers and voters, creating and collaborating with more Cardano Ecosystem available channels. The KPI for evaluation is clear but it would be more persuasive if it is shown in number. Generally, the proposal is clear and the solution is easy to follow. I agree with the author and give mark 4 for this criteria.", "q2r": 4, "assessor": "z_assessor_3052", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9384, "q0": "This is a well-written project. The impacts of the project are very detailed, I can see those impacts as follows: assist Asian proposers for whom English is not their first language, this also applies to those proposers who want to reach out to Asian voters, in addition , the proposal also addresses onboarding Asian roles on Catalysts such as proposers, PA, and voters as they have language-friendly resources. The solution is to have short interviews by Mie Tran and co-host(s) that get directly to the point and ask questions to explore the proposers for why, what, and how. At that time, the problem of the solution is quickly analyzed in detail, and the author of the project quickly understands the missing problems of the project. The author will supplement to have a complete proposal, meeting the requirements of the proposed project. Voters will also understand the project's issues to vote correctly\nThese videos will also become a great resource for PA to quickly grasp the insight of the proposals for a better assessment. They can be posted on the voter tool where people can see the proposal brief as well as the proposal shortcut insights. The videos can be linked directly to the proposal where people can quickly have a look at it and make a decision if this is a good proposal to vote for. I think this is a spillover effect to the Cardano Community of the project. Creating a communication channel under the proposed project is great, and the project will certainly have a huge impact on the development of Cardano.\nThe author also assesses the risks affecting the project, where the time management of each video is really a challenge for the author. The problem is that blockchain-related knowledge is relatively confusing. I hope the author can handle and have the best preparation to handle these issues.\nI think the project has a direct impact on the development of the Cardano Community in Asia.\n", "q0r": 4, "q1": "The project provides a detailed plan including the items to be implemented and the estimated budget to demonstrate the feasibility of this proposal.\nThe author clearly stated, the project lasts from Fund 9 to the end of Fund 10. This is a project that spans 2 Funds and the values ​​that the project brings are feasible and have a positive impact on Cardano.\nThe project mainly affects the Cardano Community in Asia.\nThe project was made possible thanks to 2 professional personnel, Mie Tran and Mr. Bui Trung Hieu. They are fluent in the language and have experience on the blockchain platform. But this project needs a quality staff to improve its feasibility, so I see the experience in the project's operation staff, they will definitely be the ones who bring the ability to succeed. high cost for the current project.\nThe budget of the project is allocated very detailed and complete. The implementation steps are clearly presented, which has a positive impact on the feasibility assessment of this project. In addition, the staff involved in the project is small but quality, this is also a premise for the project to achieve much success when applied in practice.\nAlthough the time span from Fund 9 to Fund 10, however, the exact execution time of the project is only 5 weeks before each round of voting takes place in each Fund. Building quality human resources is what the project needs to achieve and ensuring quality in the initial proposals and key metrics.\nI think the project is relatively feasible to implement in practice.\n\n", "q1r": 4, "q2": "The project measures success through:\nSuccessfully uploading 40 videos to each funding round, with the hope of receiving at least 100 views on each video, allowing them to reach more voters and have their project funds.\nThe translated content successfully reached local members and helped them in understanding the proposal insight.\nIncreasing the bond between proposers and voters\nCreating and collaborating with more Cardano Ecosystem available channels\nThe author please provide a plan to verify the project's funding source if it is funded in order to make the cash flow transparent when implementing the project.\nIn addition to the above, I think the project is measurable, has great feasibility, and has no small impact on the Cardano Community.\n", "q2r": 4, "assessor": "z_assessor_3049", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9318, "q0": "I find the solution A 5 to 8 minute interview with Catalyst TV is a pretty good way to reach viewers. However, with video interviews, it is quite boring. You should have something creative to attract viewers. For example during the interview can insert more pictures. I think it should only be 5 minutes for a video because making a long video with just an interview can make you sleepy. I see in the video you provided, you have subtitles below and I agree with this.", "q0r": 4, "q1": "\"About the detailed steps of your work, I don't see what time unit it takes place? You just generally say Fund 9, Fund 10.\n\nAbout the members, you have 2 people and have indicated the functions that each person must perform. However in the group's description, it is indicated that the Video and Content Editing will be done by https://gadiac.asia/ - a Marketing Agency mentioned, but no specific specialist was specified. to perform these functions.\n\nIn addition, in the detailed budget table, the steps taken at each time I see the budgets of both fund 9 and fund 10. You have a total budget for 1 fund and a total budget for 2 funds. In general, I find it quite clear.\"", "q1r": 4, "q2": "\"In this section of yours, I see the criteria given are appropriate. However, you still need a specific way to update the summary of the work progress report so that everyone can track the progress of completing the video. You can use google sheets...\n  I think it would also be interesting to periodically conduct questionnaires with these funding organizations to identify significant improvements in the implementation of the videos. Can you\"", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8455, "q0": "I love the concept of using short interview videos to determine important ideas and information of a proposal in order to assist the community in better understanding it. The project would benefit the community in two ways: the proposal summary and the language enablement. To begin with, many people have broad knowledge but lack the time to read completely and genuinely appreciate what proposals are saying; a proposal summary would assist them in expressing their opinions to the proposal. Second, translating movies into other languages will allow non-English speakers to understand Cardano's values as well as its primary goals and objectives. Then, this idea is clearly connected with the situation and successfully addresses it.", "q0r": 5, "q1": "The project timetable is quite explicit and thorough, with attainable targets. The process for completing the assignment is also quite straightforward. The team has supplied extensive information on their past experience. By doing so, voters will quickly discover that they have the necessary expertise and knowledge to carry out this plan.  They have made outstanding contributions to the development of the Vietnamese Cardano community. They have also anticipated and planned for certain dangers that may arise during the project's implementation.\nOne minor suggestion is that the team divide the tasks into weekly or monthly intervals so that I can better understand how long each activity takes in the overall process.", "q1r": 4, "q2": "Overall, the team has identified a number of measures to track the success of the project's progress. These indicators are extremely important and will most properly reflect the project's progress. However, I feel there should be more precise data that the team can follow and compare to footage from the prior fund to determine whether or not the job is progressing. Some indicators to consider are average viewing duration, interactivity, new registration rate, and so on.\nI also believe it would be preferable if the team could update the progress of each work on a weekly or monthly basis, record it in a document, and post it openly so that the community can better keep track and review. People may be concerned with the timing of advancement as much as the outcome.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7814, "q0": "The proposal is a continuation of a previously funded project in Fund 7.  The team plans to make short videos which will inform and educate people about Cardano and project  catalyst. Giving Proposers a platform to sell their ideas to both voters and PA in a language they understand through 5 minutes videos on Catalyst TV is a step in the right direction. The proposal effectively addresses the challenge and for that matter I will give it a 5 star rating.", "q0r": 5, "q1": "The experience of the proposer matches the plan set forth in the proposal. Making at least 40 short videos before voting sessions begin is achievable. \n\nThe budget presented however is a bit ambiguous. The budget amount quoted seems to cover for both Fund 9 and Fund 10. I suggest that the proposer focuses on completing whatever task he intends to within the space of time available in fund 9 before accessing another fund to continue the project in Fund 10.\nThis proposal is highly likely to be implemented successfully when funded. This is why I think it deserves a 4 star rating ", "q1r": 4, "q2": "The proposer has given very clear milestones and key metrics with which progress and success can be audited easily. \n\nThe catalyst community will be able to track progress of this project by checking on the number of videos posted per week on Catalyst TV. Additionally the number of views and subscribers will help the catalyst community to determine the success of this project. The information provided is adequate to audit the progress and success of this proposal and for that matter I will give it a 5 star rating ", "q2r": 5, "assessor": "z_assessor_2924", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6929, "q0": "The impact of this proposal is very high. On average voters vote less than twenty times and often do not read full proposals and video summaries made together with proposers itself who can share about their proposals. 5 to 8 minute videos can be very efficient way for people to explain their proposals and voters to understand what they are voting for. This is an invaluable resource for Catalyst.", "q0r": 5, "q1": "The feasability is strong because the proposer already has delivered on the same proposal already. The Catalyst TV has many different videos and also very strong viewership. The team is strong and I liked the videos they posted and uploaded. It helped me decide which proposals to vote for. The plan and budgets are clear and well planned out. There is not much to scoff at here since the proposal already is doing the work with verifieable traction.", "q1r": 5, "q2": "The auditability is very good since the interviews and any work will be posted to the YouTube channel directly that's available publically and mant proposers advertise on their proposals. This is one of the easiest to audit proposals. I also really like that they are counting views, social engagement as one of their KPIs. I would suggest that the translations would be more available and accessible to the community.", "q2r": 5, "assessor": "z_assessor_2855", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6008, "q0": "I think that this proposal is very good and completely fits the criteria of the challenge \"Grow East Asia, Grow Cardano\" given. The idea here is to build a Cardano Catalyst program - where that proposer can participate to interview Ms.Mie Tran about issues surrounding their proposal such as ideas, solutions, roadmaps, etc. This presentation will be recorded and editing/translated into other languages ​​(English, Vietnamese, Japanese,...) for posting on media sites, the purpose is to, i) firstly help communities when the English language is not an official language can understand what is the content of the proposals on Catalyst are made without having to spend a lot of time to read and understand, ii) second is for the community to have a place to interact discuss with project owners about the issues that the community asks, helping them to have more information to make a decision to vote for that project or not, iii) thirdly, this program will be a tool that proposer can use to promote their project to more places. All of the above benefits will contribute to increasing the value of Catalyst, attracting more new ideas and proposals in the following funds as well as increasing brand awareness. I therefore strongly agree with this idea.", "q0r": 5, "q1": "The feasibility of this proposal I assess is entirely possible because of the following aspects:\n-This is a continuation of the success of the funded proposal in Fund7, the results achieved by the project team in Fund7 are extremely impressive therefore I think the proposer has a lot of experience to continue implementing this time.\n-About the experience of each member: as I mentioned above, all members of the project have had experience in previous Funds. In addition, Ms.Mie Tran is also a very familiar face in Eastern Townhall sessions and is also a member of the Challenge Team.\n-About the budget: very specific and detailed about the cost of implementation for each work item, the cost explained here is extremely reasonable. However, I have a small suggestion for proposer that consideration should be given to the addition of the hedging fee because of ADA price fluctuations. \n- The execution time for each job is also clearly divided from the beginning, ensuring the right schedule. \n- Risks and related challenges are also mentioned and response options are available.", "q1r": 5, "q2": "In terms of audit, overall I am quite satisfied with the information provided by the proposer, but there are a few details that I think it would be better to add more. For example, the proposer already provided milestones to measure project success such as video views, community comments, and shares, but I would suggest adding numbers here. I know it will be difficult to have an exact number to evaluate but we can take the data from previous Funds (eg Fund 7, 8) for reference and projection. This is also a way to help us track the successful progress through each stage of the different Fund. In addition, the communication channels of the project have also been listed clearly and publicly open so the community can check it.\n", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 5218, "q0": "A lot of proposal in the Catalyst Program is often written very long, even with a lot of expertise. Therefore, it is very difficult for voters to understand what ideas the project is trying to solve, how to do it, measure performance, and monitor the community by reading the entirety of the proposal. Besides, the main language that Catalyst uses for proposals is English, which should be a big barrier for voters in non-English speaking countries.\n\nSo, your suggestion is to create a video interview from 5-8 minutes for proposers to present the main contents of their proposal, which is very useful for voters, saving them a lot of time and effort to evaluate and decide to vote for the project more confidently.\n\nThese interview videos are all made for free and edited with high quality, so proposers can also use them as marketing materials for their proposals to help save costs when the project does not know if the project has a fund or not.\n\nThe team's suggestions were very helpful and had a great impact on the Cardano community, especially on proposers and voters.", "q0r": 5, "q1": "Your proposal is expected to be implemented in 02 funds of the Catalyst program: fund9 and fund10, with the goal of interviewing 40 proposals for each fund. The main tasks for making videos have also been described in detail such as sending invitations to proposers with pre-prepared questions, conducting interviews, editing videos, attaching subtitles to videos, and finally posting videos. to their marketing channels to promote the proposal to the voter. The implementation process is very clear, simple, and easy to understand.\n\nThe cost you want to apply for the proposal is $19020 for a total of 80 videos expected to be produced. The cost of video production has been specified and has a corresponding cost, so in my opinion, this budget level is suitable for the scale and goals of the proposal.\n\nAbout the members of the project team, there is Mie Tran, who is very active in the Catatyst community in Asia. With the experience of producing 38 videos for propopsals at fund7, fund8 and more than half of the proposals were funded when accepted for an interview by Catalyst TV. This is a quite impressive result that can prove that Mie Tran can perfectly perform for videos at fund9 and fund10.", "q1r": 5, "q2": "Regarding the evaluation of the project's performance, the community can fully follow the Catalyst TV Youtube channel because all the videos interviewing proposers are posted here.\n\nIn addition, the team also outlined criteria to be able to evaluate the quality and impact of the video through the number of views, the number of feedback, and comments, especially the number of proposals be funded when they joined the Interview on Catalyst TV.\n\nI also have a suggetion for the project that maybe after each fund you can do a small survey with those who have participated in the interview so that they can comment on the quality of the video, the preparation as well as the benefits actually that proposers get from this project. From there, you will have more insights to improve the operational efficiency of the project.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4353, "q0": "You have outlined the situation voters are facing in that they do not have the time to read and learn about the proposals that are worthy of a vote. Your solution for busy people is that they can watch a 5 to 8-minute interview with Catalyst TV. I think this solution is very good, very suitable for people who do not have time to get information about good quality recommendations. Your proposal aligns with the goal set in the Challenge and it directly adds value to the Cardano ecosystem, which is great for the project owner and those interested in the project (for voting, reviewing investment, accumulation of knowledge, etc.). I think the proposal could fully scale in the future with lots of short video interviews (still between 5-8 minutes - this is a feature of the show) but more interviews with more proposals, not only limited to Vietnam but also in other countries in the region, made by collaborators under the arrangement of Ms. Mie (this is my idea to be able to scale up) until this moment). Thus, in terms of impact, the proposal solves the set goals, it also contributes to the growth development of East Asia and the Cardano ecosystem. I completely agree and vote 5 stars.", "q0r": 5, "q1": "The recommender is you (Ms. Mie) who has experience in this field since you are working in the Cardano ecosystem (Cardano Catalyst TV presenter, Eastern Townhall, etc). The videos that you have made (shown in the proposal) and the disclosure of your identity through social networks (Linkedin) make me very confident in you and confirm the feasibility of the proposal. The budget is broken down and presented with a reasonable amount attached. In this Fund 9, if Catalyst has not funded the proposal, will you continue to work on the proposal? My advice is that if possible, you should do your best to arrange financial and human resources to do it. Even if there are only enough resources to make 1 or 2 videos. Because that is the maintenance necessary for the survival of Catalyst TV through all times of the year. This should be maintained regularly, as regularly as possible. Why is Catalyst TV maintenance important? I would say the reason is for it to become a certain brand (this is only formed when Catalyst TV appears regularly) and gradually become an indispensable thing for project investors who need to collect information. If anyone needs it, vote... In addition, it also affirms the author's role (Ms. Mie) in the program, affirming the author's label. The plan and how to implement the proposal have been clearly stated by you. Regarding implementation resources, mainly in terms of human resources: I understand you are working on another proposal in Fund 9, if both of your proposals are funded then you have enough time and energy to do so. to implement both proposals in parallel or not? Is there another team member who can handle the job when you are suddenly busy with your own business (other than Bui Trung Hieu)? I ask this because I fear that the quality of the work might suffer. I find the risks mentioned in your proposal to be well-founded and the solution to overcome the risks is reasonable. Therefore, the proposal has confirmed its feasibility. My question is considered as advice and for the team to refer to and improve. I vote 4 stars.", "q1r": 4, "q2": "The specific roadmap has been outlined right from Fund 9 and also at Fund 10. This speaks to your very good preparation for the job at Catalyst TV. I'm happy with this route but would suggest that it would be much better if the route was tied to specific months of the year. Example: Specific work to implement in January, February, March... - this is just an example). I think that doing so will increase the transparency and auditability of the proposal. It will be easier for the community to audit based on the months of the year. You've come up with five measures of success, which are also key performance metrics (these are mostly related to people's interactions) - very logical. It shows your understanding of the interactivity of community media - this is essential when making proposals, especially those that are heavily socialized that require high interaction. The problem was clearly described throughout the proposal in an easy-to-understand manner and provided a solution to the existing problem. My comments are positive for your reference. I strongly agree with the auditability of the proposal. I vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3812, "q0": "This proposal is about continuing the work of the Catalyst TV that has been launched with Fund7 funding, where proposers can have a 5 to 8 minutes' interview with the intent of approaching viewers, boost and market their proposals to a diverse community members. The problem is stated clearly that voters do not have time to read and understand proposals' insights. So the TV program can provide a quick means to get the community to understand. \nThe interviews will be translated into several languages according to the proposer.\nAddressing the challenge, the proposal seeks to help Asian proposers who find it difficult to write in English language, and the videos translated into their own language will help them understand Catalyst and write proposals. This will lead to onboarding Asians to have roles such as proposers, PAs and Voters as they have language friendly resources. This challenge is about getting Asians onboard Cardano blockchain and grow the ecosystem. \nThe proposer mentioned some risks and mitigating strategy to curb the risks. Risks mentioned are time management and technical proposals. They will give advance questions to interviewees to mitigate the time risk, and provide in-depth discussion on technical proposals to help proposers understand. I can conclude that this proposal has addressed the challenge effectively. My rating is 5", "q0r": 5, "q1": "The plan presented shows that the funds will be used for Fund 9 though a plan has been presented for Fund 10. Details have been provided as to how they will go about the work, such as that they will conduct at least 8 videos per week till voting round to make up 40 videos, and each video will have a complete translation into Japanese, Vietnamese and English. Tasks have also been outlined. \nThe total budget request is $19020, and the breakdown is quite detailed. \nThe team has 2 members of the community, who are Mie Tran and Hieu BuiTrung. Mie is Cardano Catalyst TV host, funded proposer, sub circle member, etc. He has the relevant skills and experience to implement the proposal. \nThe team has said they will return to Catalyst for additional funding in the next round. They are involved in other proposals in Fund 9, and also working on previously funded proposal. With this information, it is likely this proposal will be implemented successfully. My rating is 5. ", "q1r": 5, "q2": "To track progress, the proposer has said the progress of work will be on YouTube, Twitter, Voter tool, Telegram, Eastern Town Hall page - measuring the progress will be looking at the view count on each video, plan rate, feedback, and comment, social shares, etc. \nThe success of this proposal will be seen as successfully uploading 40 videos with at least 100 views on each video; translated content successfully reached local members. Adding another Asian member to the Catalyst project, etc. \nThis proposal is a continuation of Fund 7-funded proposal with the same name. \nI can conclude that the information provided is sufficient to audit the proposal. My rating is 5", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14516, "q0": "This proposal has the aim of interviewing proposers on TV to talk about their projuirn ects in about 5 to 8 minutes so that they can connect to Proposal Assessors who in turn will understand what the proposers are actually proposing.\nThis idea will bring in more Asians who will assume more roles. This is what the challenge is about, to onboard more Asians togrow the Cardano ecosystem.\nRisks and mitigating strategies were mentioned effectively. This is an excellent idea to promote Cardano.\nThis proposal addresse the challenge effectively.", "q0r": 4, "q1": "Proposal here has a plan in place which details show that they will make 40 videos which are also translated ito Japanese, Vietnamese and English,with different set of activities added.\nThe budget is broken down well showing how the expenses will be. \nThere are 2 persons going to implement this project. They both have relevant experiences and they are also active members of the community. They are capable of delivering a good job, so it is likely that this project can be implemented successfully. ", "q1r": 5, "q2": "How to track the progress of this proposal has been explained that it will be tracked on YouTube, Voter tool, and others. \nThe success will be that, 40 translated videos will have been done, and about 100 views added,and more Asianswill have been onboarded to the Cardano ecosystem.\nI think theinformation provided is sufficient to audit the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_4061", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14696, "q0": "Cardano Catalyst TV \"5 to 8-minute interview with Catalyst TV is the fastest way to approach viewers, provide general insights, boost reputation, and market your proposals to a diverse range of community members\", such goals can help The community can easily access each project they are interested in in a deeper, more multi-perspective way. Moreover, they are also experts in making their views more profound and precise.", "q0r": 5, "q1": "The duration of a video is from 5-8 minutes, not too short, which can help users understand the basics of a Catalyst project, what type of project it is, what is the project goal, how to implement the project, the roadmap of the project, the feasibility of the project.\n\nThe Cardano Catalyst TV project is an interview between an MC and an expert. Focusing on answering key questions, should help users quickly understand the basics of a project. From there, it is easy to assess whether the project is feasible or not.\n\nVideos are translated into many different languages, so the reach of users is also more diverse, in more countries.\n\nHaving been invested by Fund 8 is also an advantage so that the project can be continued to invest.\n\nHowever, the Cardano Catalyst TV project also has some disadvantages. As follows:\n1. Access to users is limited. For example, Youtube channel views are quite low.\n2. Advertising strategy needs to be taken more seriously, and more cross-platform to reach a larger number of users.\n3. The number of videos uploaded has not been scheduled to be released.", "q1r": 4, "q2": "Cardano Catalyst TV is quite transparent. The project has been deployed since Fund 8, there have been certain successes.\n\nDirectly interviewing Catalyst project owners makes it easier for users to understand the project, but the transparency of this is also a question mark.\n\nMoreover, the projects interviewed are not necessarily good, sometimes it is exaggerated to affect the Cardano community.\n\nThe budget for the Cardano Catalyst TV project is also quite high, and please also Fund 10 (why it is necessary).\n\nIn short, the success of the Cardano Catalyst TV project is there, but it is necessary to have an objective view of each Catalyst project from the team that developed this project.", "q2r": 4, "assessor": "z_assessor_4096", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A 5 to 8-minute interview with Catalyst TV is the quickest way to approach viewers, provide general insights, boost reputation, and market your proposals to a diverse range of community members", "experience": "Cardano Catalyst TV host, funded proposer, Eastern Townhall Moderator, Interpreter and Translator, Challenge Team member, sub-circle team member, Cardano Passionate"}