{"id": 416699, "author": "cryptoloops", "title": "CNFT Alliance: Vietnamese Community", "url": "https://cardano.ideascale.com/a/dtd/416699-48088", "category": 26602, "amount": 7500, "description": "There is a need to raise awareness of and provide accessibility to CNFT projects in East Asia. Therefore, it is paramount that language does not deter people from being involved within NFT projects.", "f6_no_assessments": 5, "f6_rating": 3.5333333333333337, "videos": [], "media": [], "f6_assessments": [{"id": 1657, "q0": "The proposal is very well aligned with the scope of the challenge, however I believe more details could have been provided here. It is about providing a basis for translating CNFT Alliance projects into Vietnamese. It is argued that this is one of the most widely spoken languages ​​in the world, with around 85 million speakers. In fact, throughout the funding, I've seen several projects that targeted the people of Vietnam. There is no doubt about the relevance of carrying out such translations. Other positive points are: the proponents do not think in a limited way about the services that would be offered, they think both about translating alliance projects into Vietnamese, and translating Vietnam projects into English that want to have a broader reach of users, after all we know that mainly in Europe and the United States there are a large number of members of the Cardano ecosystem. Another positive point is that the team seems to be very careful about the translations that would be carried out, worrying about nuances and technical jargon, as they themselves point out. In other words, the objective of accelerating the interconnectivity of East Asia with the rest of our ecosystem seems to be thought out very carefully and consistently. However, I would like to make a few observations regarding the impact of the proposal. At first, the asking amount worries me a little, it's 7500 dollars to translate several projects - other proposals from the same fund ask for the same amount to translate just 1 project. So, I'm confused about how much would be paid per project and if the values ​​would be adequate. Another issue I would like to comment on is the alliance itself. They attach a website, where we can learn more about the project, its members, news, etc. But it would be important for us to have a more specific detail about who they are in the proposal itself. Researching a little more about the group, it is possible to understand that it is a union between several projects involving CNFTs. The objective would be for them to have an open and beneficial dialogue for all, in order to generate development, economic and other advantages. It is said that the main objective here would be to promote transparency and exchange between such projects, since many ideas involving NFTs are emerging and they can often be developing in a disorderly way. All the information mentioned here is the result of an analysis of the site, but what I'm trying to say is that it would be important, so that readers in general, could learn and understand more solidly what the characteristics of the project would be, that more explanations would have been provided. With that, I think that the proposal will meet the objectives of the challenge, promoting easier access to NFT projects for the East Asian population, but some points could be better clarified. In general, the excerpt “The CNFT Alliance addresses the challenge by accelerating the interconnectivity between East Asia and the rest of the Cardano Ecosystem. With our quality translation services, many CNFT projects will be able to reach farther beyond their native language speaking communities and engage users previously unreachable” makes it very clear how some KPIs in the scope of the challenge would be met, such as “The number of proposals originating from East Asian participants in Project Catalyst + The quantity and quality of funded proposals originating from East Asian teams + The observed impact of funded projects (meeting their KPIs) + Did we increase the participation of the Cardano teams community and Catalyst with East Asian residents?”. However, some improvements are still needed here.", "q0r": 4, "q1": "The script of the proposal, in my view, is somewhat superficial. Six months is explained in a few lines, it would need more detail to have been provided overall. We know that the first quarter would focus on hiring the Vietnamese translator and translating the CFNT Alliance website - but how long would it take to select the translator? They claim to already have contact with this group of professionals, so I think they would have already pre-selected some candidates, but it would be important for us to understand how this selection process would be done. Afterwards, the website would be translated (how long would this take? What would the translator's work routine be in this activity?). Some alliance projects would be translated into Vietnamese. Again, how would you be selected? I think it would be more interesting if proponents had already provided information about which projects they intend to translate, in what order, and why. For example, we will translate project “X”, as we believe that it will have a wide acceptance among the target audience. The translation process would take 1 month, and the dissemination process among Vietnamese would be done in 2 weeks, by more such media, etc. In other words, we really had a more palpable understanding of what was going to happen. In the way it is presented, the roadmap does not provide us with a specific view of what will be done in the project development process. Talking now about funding, as I have already briefly commented on impact, the asking amount in my view is lower than it should be, as we have some projects that alone would cost 7500 dollars to translate. How much would the translation price of each project be? How many projects would be translated? I imagine that some are more expensive than others to translate, because it also depends on factors such as the extent and complexity of what is being done. Would any channels of communication with the Vietnamese be established? Unfortunately, in my view, this part leaves a lot to be desired. I would like a more analytical study to have been carried out in relation to which projects would be translated, how much it would cost to translate each part cited, what the translator's daily work would be like (including the amount charged for the hour of work) and so on. Finally, talking about the team, the members of Fluxos are introduced. In fact, we can get to know them both through the attached website and through the details in the proposal. A lot of confidence is conveyed in these people, as the level of detail here is quite high: we know who is who, what they do, their resumes, where they work within the alliance. But we have not introduced the translator, the person who would be responsible for doing this work, and I believe that this would be essential for us to have more security in relation to the preparation of the future professional to be hired - would he be someone experienced in the field? Therefore, several points here could have been better explained, in my view, and the feasibility was greatly compromised, although there are still some positive points and important information has been provided, especially in terms of the team's presentation.", "q1r": 3, "q2": "Proponents claim that it is complex to keep track of the schedule due to fluctuations, but in my view it is essential that we know how the tasks behind the provided KPIs are going (number of users of CNFT Alliance translation services / number of projects that the services CNFT Alliance translation agencies helped to increase their target audience / number of users engaged by these projects who were not previously engaged due to language differences). How could we monitor the translator's work routine? We know that there is a certain order of activities to be carried out: first, select the translator. Then translate the alliance website, translate some projects, etc. It would have been important that more planning and detail regarding the roadmap had been provided, so that we knew how this work would have to go in practice. With this, monthly reports could be prepared, for example, that would allow us to understand if the plans were followed, and it is ok if there are changes and adaptations, as this is natural. But monitoring only the product of the processes, in my view, is insufficient. Success would then, in turn, be the union of the Vietnamese community with the Cardano community. More people understanding and participating in NFT projects, more investment being made in our blockchain (new projects being started, already established projects being expanded to East Asia, new digital wallets being opened, more Ada being bought and delegated… activities that make up our ecosystem in the geographic location in question). This is all better defined in the excerpt “Overall, we’d use the metrics listed above to measure our levels of success. Furthermore, our ultimate goal is to help bring on board more talents from East Asia that may have been discouraged to enter the CNFT space due to language barriers”. But how can all this be measured, verified and proven? How can qualitative and quantitative data be established and put into practice for analysis, so that the answers reach our community in a verifiable way? My suggestion is that a study be done, and that the results be exposed to us, either through participation in Townhall, a final written report published on channels like discord and telegram, for example... That is, that this data becomes directly accessible by those who wish to verify the results of the project. In other words, I think that auditability in general is average, as it says what would be monitored, but it is not explained as well how it would be monitored (for example, there is a passage in which the proponents state that “it is important to emphasize that we would be able to to provide this information quickly and, in some cases, in real time” - how?). I suggest that some improvements be made, as suggested, so that the level of this auditability is benefited.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 12, "ne": 10, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 13695, "q0": "The idea of ​​this proposal is really very good and perfectly meets the requirements of the challenge. It is about providing translation services to CNFT projects to engage with the Vietnamese community and helping them overcome the language barrier which prevents them from being involved in exceptional ideas.  In my opinion, the idea is correct in several respects. Starting with the fact that the proponent already informs a very specific target audience -  CNFT projectors & Vietnamese community. I notice that many proposals aim to attract lay people to the cryptographic world, which is certainly necessary for our community to grow and become more popular. However, it is also necessary to invest in an audience that is already a little more involved in this ecosystem. With the problem stated above, there is a need to raise Asian awareness and the availability to join in CNFT projects without being prevented by language barriers which I believe awareness of the whole  Cardano ecosystem. For that, the proposal fits with the challenge and I have high hopes it could be fundamental for further expansion to other languages whose participants are in high need of their own language's translation. Now let’s talk about the solution itself, this proposal states it  connects more Vietnamese people with the Cardano ecosystem to understand and join in CNFT by the translation service for the projects. There will be Eng<->Vie Translation for Vietnamese CNFT projects and Foreign CNFT projects for both parties to attract more users. I am convinced with the reason they chose Vietnamese. They protect their opinion with quantitative data and point out the realistic situation. Based on that, I have a deeper understanding about their view and it proves that they have done serious research about what they are about to make for this community. They (and I) have a strong belief that this could accelerate “the interconnectivity between East Asia and the rest of the Cardano Ecosystem” with quality translations. It’s ideal, but I expected a more specific scenario, like what typical documents they translate and how it affects the users when they read those documents. I understand that they translate the CNFT project but the project itself is large and has many aspects. Some don't inquire the users to understand however some need to be clarified to gain more trust for the users. Every project underlies risks and this proposal is no exception. The risk of not having enough funds to maintain the project and that’s why they seek for the Catalyst funding. I quite agree with that, in fact, I expect the proposers state something affects more to the solution instead. I have a quick evaluation and suggest some risks that could occur during the process. It’s the risk in translation quality assurance, the personal ability and knowledge is different among people therefore having a team which includes a Vietnamese native speaker as a moderator or who has excellent skill in using Vietnamese could reduce the risk in the quality. On the other hand, the world is witnessing a financial breakdown and the ADA is no exception, the slippage of it can lead to budget shortage so asking for a reserve fund is reasonable. I would give a 5 if this part can go deeper in the risk management.", "q0r": 4, "q1": "Let's focus on the script: it is rich in detail, but it lacks a sense of temporality and understanding what is behind the translation. I can see obviously  that the project lasts for 3 quotas starting from quota 3 of 2022 and each quota includes general to-do tasks . However, I expect the activities to be carried out during the entire process are enumerated and richly detailed, so that we understand quite clearly what would need to be done and how. For example: how many translators will be hired, what are the basic requirements of being translators for the project (are they foreigners who speak Vietnames or are they Vietnamese), how does the proposer reach the translators, users and CNFT project leaders to connect them together, does the project do Marketing on social media? The point is that we don't know when such things would happen, and a script, in my view, should contain this information: what will be done, in what way and how many people are involved. If the proponent had associated dates with activities, I would say that it is a complete script.  Next is the budget, to be honest, I am quite doubtful with the statement the proposers made “It is difficult to provide a detailed budget breakdown for this proposal as it will depend on the number of projects that want translation.” I mean, I understand that you can’t foresee the result to tell it exactly the way it is. I just expected you to give out an expected number of CNFT projects needing translation. Of course, when you give out that number, there should be a plan with a full purpose and activities to do to reach the goal. You can do Marketing to let the CNFT projects know how potential the Vietnamese market or Vietnamese CNFT project is, how your team can help them benefit from that , making them want to choose you  among others. That’s the way I suggest you reach your KPIs and based on that there will be a clearer budget breakdown. Now let’s evaluate the members of this proposal.  This part is excellent, we know who the professionals involved are, what their professional areas are and it is also explained a little about their linkedin profiles attached, so that we can check all the information that is said. I admire the members as they have so much experience in various fields. They mostly experience gamification, art, some of them involved in development and technology. Yes, it is helpful to have members understand about those fields as our project is partly relating to those. However, the core is translation therefore I expect there should be members experience in translating especially Vietnamese and English languages. That is, I believe that the feasibility will be better, with some above points to improve to gain more trust and rate. \n", "q1r": 3, "q2": "The proponent gives us good indicators on how to audit the proposal, for example: The number of users of the CNFT Alliance’s translation services, the number of projects that the CNFT Alliance’s translation services have helped boost their target audience, he number of users engaged by these projects that were not previously engaged due to language differences.” However I think that in the progress measurement part, we could have a little more qualitative data as well. Anyway, knowing such numbers is undoubtedly necessary, but how could we observe the partial results from a more human perspective? I would like the proponent to have also suggested that a short report be made at the end of each quota, explaining how the result was. Furthermore, if the proponents consider doing Marketing campaigns, it would be easier to measure on social media like reach and interaction rate. On the other hand, it would be more transparent if this proposal state the way people can track the process. The success  also seems to be kind of general “A broad spectrum of people across the Vietnamese community, coming together and forming teams to grow our ecosystem\". I expect a quantitative goal and when we reach it that would be successful. Therefore, I will give 3 stars for this auditability, because I think it is ok but still has a lot to improve. \n", "q2r": 3, "assessor": "z_assessor_3750", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 6327, "q0": "Disclaimer: I will be using almost identical assessment text for four proposals of these proposers.\nThis proposal is about offering English/Vietnamese translation services to CNFT projects to expand their reach beyond the language border. Hence it is aligned with Challenge as it wishes to service the Vietnamese community from East Asia.\n\nFirstly, the need for translating content into Vietnamese is something that may not be needed, nor will it help grow the Cardano community in Vietnam. Because if you do some research online, then you will know most of the students in Vietnam learns English and can understand it clearly, but they lack confidence when it comes to speaking. Also, English is spoken in Business circles in Vietnam. Hence we can anticipate the crypto community, usually educated people from Vietnam, to understand the English language.\n\nSecondly, most CNFT projects fail to gain traction and become dormant or have no community engagement. So, it is essential to know which CNFT projects the proposer will translate to yield the translation's benefits and add value to the Cardano Ecosystem. The CNFT projects popular in the Cardano space should be the viable choice for the translation as they are more likely to add value. He mentioned that they would translate the www.cnftalliance.org website along with CNFT projects. However, this alliance has only a few members, and I cannot see any big CNFT projects here. So, it is also difficult to ascertain the impact of this alliance website translation.  \n\nThe proposer stated that the main risk is the funding, which may be true. But as I mentioned above, the main risk is the selection of the CNFT project, which requires translation to expand its reach. Therefore, only the popular projects will have any impact if translated. This is based on the assumption that 'the Vietnamese translation is required,' which I think is invalid. Also, if the CNFT projects are popular, they can finance their endeavors, such as translation, as they may have generated thousands of dollars from minting. Hence I am afraid I have to disagree with this proposal's impact criteria as I think the Vietnamese translation will not add value irrespective of the project's success.", "q0r": 2, "q1": "The proposer provided the team details along with their brief introductions. Their LinkedIn profiles are also given. The team is skilled as they are comprised of Game designers, developers, videogame programmers, etc., but the main person who will translate the content is yet to be hired. The proposer stated they are in contact with many translation service providers, and they are waiting for the funding to hire one of them.\n\nThe asked budget is $7,500, which can be reasonable if we know the content which will be translated. However, the amount can differ based on the volume of data that has to be translated. The proposer just said they would translate the cnftalliance.org website and two CNFT projects into the timeline. \n\nThe timeline mentioned is three quarters which is quite extended considering the tasks of translating one small website and two CNFT projects. However, I cannot say it is reasonable without knowing the content of the projects to be translated. For example, if the translator has to translate a large volume of texts, then we can justify the three-quarters worth of time, but if the work is not massive, the mentioned time will be unreasonable. At last, I cannot agree or disagree on the proposal's feasibility without knowing the content to be translated and their specific budget. ", "q1r": 3, "q2": "The proposer stated we could utilize the timeline to track the progress. However, as I said above, the timeline is extended over three quarters which is not reasonable to execute the mentioned task of translating one website and two CNFT projects.  \n\nThe asked budget of $7,500 is not broken down into identifiable tasks. This omission also hampers the tracking/auditing of the proposal's progress. If the proposer is in touch with the translators and knows the projects and contents to be translated, they may have some quotes based on those quotes; the budget should be broken and mentioned in the proposal. If they know the content to be translated, then it should also be mentioned in the proposal. \n\nThe success metrics are the number of people using the translation services, the number of projects that are opting for the mentioned translation services, and the new users coming to CNFT projects with the help of the translation services, which were refrained before due to language barrier. But as mentioned above, there is less chance that this proposal can contribute to the Cardano Ecosystem because of the abovementioned issues. \n \nI am afraid I have to disagree with the auditability of this proposal based on the fact that the proposer did not mention the CNFT projects that will be translated. Hence the volume of data to be translated is not specific, which raises questions on the required budget and timeframe, which will vary based on the content to be translated. Given the above points, it is not easy to audit/track the progress of this proposal. ", "q2r": 3, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This assessment appears to be slightly biased. We are focusing on translation for this proposal in order to be able to bring in more members from the Vietnamese Community, and, as building the Alliance to be self-sustaining, we didn't cover marketing in this proposal as we would be seeking that out once we have the alliance up and running and the legalities between projects taken care of."}, {"id": 8438, "q0": "This project has the potential to do well. Breaking down difficult barriers that Vietnamese people face, creating opportunities for Vietnam to access more Cardano technologies and ecosystems. As a development team with the main role in building a project that requires inherent experience to complete, the team meets that need, your solution shows that language is a big barrier for people. Vietnam so you want to make it more accurate and easy. Reading many projects, most of them are oriented to English for Vietnamese people and those who do not know English have not seen any idea to completely translate from English to Vietnamese, such a great idea. The future will bring Vietnam to compare with other developing countries that know NFT on Cardano, not only breaking that barrier but also bringing closer togetherness. The way the proposal solves the challenge is to accelerate the relationship between East Asia and the rest of the Cardano Ecosystem, with quality translations that attract participants and those who have not been contacted before. reachable. The big risk in this project is that when you want to translate, you have to connect with good interpreters to have absolute accuracy, you expect it to go into operation but if that If not funded, is this project a waste and Vietnamese people lose many opportunities, can you try to call for temporary funding from sponsors or other developers to complete a little text? Translate about NFT projects to make Vietnamese people aware and then attract the funding of Project Catalyst, think about it!", "q0r": 4, "q1": "The group's experience with members who have been involved in providing translation services for CNFT projects is one of the important goals to attract Vietnamese people to participate. Each experienced member is arranged with a suitable job in order to promote their talents to make the project better. The plan you presented in the proposal is quite brief, the work does not seem to be more specific, both the quarters of 2022 and the first quarter of 2023 you use to translate the CNFT Alliance websites, and Translating at least 3 NFT projects full of time but the amount of work set and the results seen is a bit less than the original schedule. In general, the plan laid out during the course of the project, it is true that it is difficult to give a detailed budget, this depends on many factors, it is understandable. Hope your hard work pays off.", "q1r": 4, "q2": "is a new proposal on Project Catalyst, but very practical for Vietnamese people, there are still many limitations that have not been broken, it can be said that this project relies on many factors to measure or see results. the number of service users, the number of projects that need translation and exploitation of old projects that have not been participated due to language barriers. Success here brings in more talent from East Asia that may have been discouraged from entering the CNFT space due to the language barrier. And many projects will have the benefits of the service of this project such as when the translation service is translated into the project, language problems are no longer an obstacle for many people, so many people use it. is very beneficial.", "q2r": 5, "assessor": "z_assessor_2984", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 10137, "q0": "This proposal is aimed at breaking down the language barrier, specifically Vietnamese as well as English. This shows that the authors have realized the potential and desire to develop an approach to more customers in the two years. region to scale up Cardano, making it more accessible to people who aren't fluent in English.\n\n      The proponent is trying to create a more inclusive environment for potential communities in Vietnam. I think with such an experienced team it will be possible to successfully execute the good idea.\n\n      Regarding risk prediction, the team emphasized the lack of funding to make the translation and solution clear. However, I think the proposed team should also consider the difference between the two. languages ​​as well as regional dialects consistently. To be able to help the translations be the most accurate. Avoid causing unnecessary misunderstandings.", "q0r": 4, "q1": "For the experience suggested by each team member mentioned above, I believe that you can implement and operate successfully. To provide the best translations to the community. You also provide individual links. corroborate the claim of experience referred to by the group.\n\n  The proposed team did a great job of giving specific as well as precise examples. The team has a methodical roadmap to assign tasks to each person to clearly define the work that needs to be done to operate the idea and lasts for 3 quarters starting from the third quarter of this year to the first quarter of 2023. Whether the 4 ideas in the roadmap you provided are a bit confusing for people. Hopefully, the proposed topic can provide more clarity on the amount of work the team intends to do, and whether a translation requires a step of proofreading prior to presentation. If specified, it would be good to help voters better understand the steps to complete the proposal.\n\n  And here it is quite delicate that the proposed team budget section can please give more detailed budget usage ideas. For example, how much to pay the translator per hour and estimate the costs needed to translate a little more fully. This can help us give an accurate + most intuitive view. about the budget part of the idea.", "q1r": 3, "q2": "   With a team that has been involved in the Cardano community for a long time. As well as having practical experience. Presented a clear idea, and a coherent presentation. of the proposal including Number of users of CNFT Alliance's translation services.\nThe number of projects that the CNFT Alliance's translation services.\nNumber of users who have joined by these projects who were not previously involved due to language differences.\nThis is claimed by the team to be easy to track, I'm fine with this. They also provide transparency about each member's social links to help with identity verification. Overall, this is an interesting proposal, to establish more teams and develop the ecosystem related to project catalysts in Vietnam. If successful, it will help break down the language barrier in the region, and I wish the team every success.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "The CNFT Alliance plans to offer translation services to CNFT projects to engage Vietnamese users into the CNFT space by removing barriers and opening the ecosystem to everyone, regardless of language", "experience": "Co-founder (CF)/Game Design: Alex\nCF/Marketing: Conward\nSr Programmer: Dirk\nProjects Coordinator: Sam\nAssistant PC: Jye\nNarrative Design: Chris\nGame Programmer: Simon\nArtist: Dilara\nIllustrator: Ann-Kathrin\nProducer: Christian\nSFX: Rudi\n(More Details Below)"}