{"id": 416610, "author": "calexander", "title": "East Asia Artistic Grant Proposal", "url": "https://cardano.ideascale.com/a/dtd/416610-48088", "category": 26602, "amount": 33000, "description": "Financial security for East Asian artists can be incredibly challenging, especially at the beginning of their career and often they lack material and technical support to pursue their artistic goals", "f6_no_assessments": 20, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1180, "q0": "\"\nSolve the problem of financial security for East Asian artists when content infringement is quite common, overcome that problem, the project offers a solution to create a supporting art sponsorship program Exclusively for East Asian artists with financial and technical support to mint nft on cardano block bananas. Casting into nft will no longer be possible for blatant counterfeiting or piracy. I find this proposal very reasonable.\"", "q0r": 5, "q1": "\"Solving the challenge posed here tangent creates an attractive dapp to attract talented aspiring east asian artists to cardano and has sponsorship packages such as material support, educational tools, support finance and community recognition.\nThe development roadmap is clearly stated by fund, development milestones have been clearly mentioned, and the issue of financial resource allocation is also analyzed in detail by category.\nTeam members are mentioned with their identities, biographies as well as professional experiences clearly and coherently, I appreciate the team of the team.\"", "q1r": 4, "q2": "\"The transparency of the project's development stages is detailed, but the cost of each stage should be more specific.\nKPIs like\nNumber of registered artists?\nThe success of the artists after they are funded ?\n Media channels: Currently have the number of members\n Discord: ~50, Telegram ~over 1000, Twitter~over 1000\n Links are given\nhttps://github.com/TagentADA\nhttps://tangent.art/\nhttps://www.citrus.app/\"", "q2r": 4, "assessor": "z_assessor_2216", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11902, "q0": "The proposal is about providing financial security for East Asian artists by creating an artistic grant program that exclusively supports East Asian artists with sponsorship to mint NFTs on the cardano blockchain, while sponsorship not just being limited to financial support but also technical or material support. As it is trying to create an engaging dapp to attract talented aspiring East Asian artist to cardano and sponsor them , it will also help in learning minting eco friendly NFTs on cardano and thus aligned to the challenge statement.\n It makes clearer how dapp is used for and how the cardano blockchain would fit here, certainly within the technology teachings our ecosystem would be much addressed as well, which clearly articulates how it will add value to the cardano ecosystem.\nThe project identifies a problem within the challenge, needs to be solved, which is a definite risk of uncertainty if the provided grants to the artist will be rightfully used or not by them for artistic career or in providing amazing art to the cardano system. This problem or risk can be reduced by choosing artists diligently however, I believe certain criteria should have been mentioned. It would have been interesting if we knew better how this risk can be reduced with certain more relevant details . \nThere is no doubt that such a project is very necessary and promising. The project will have a global Impact as East Asian cardano community is very diverse and growing everyday, they can utilize the dapp to provide grants and votes to their artist in their respective region.\nHence I strongly agree that this project efficiently adds value to the challenge and hence I justify it with a score 5.", "q0r": 5, "q1": "The proposing team is qualified to carry out the feasibility study laid out in the proposal. The LinkedIn profile of all the members are shared. They have relevant skills and experience which ultimately help them in executing the proposal. It has specified responsibilities of all the team members in an identifiable manner.\nA detailed plan and time frames are stated on fiscal quarters with the key milestones to be completed which look sensible and conductible plan for implementation. It also shows what is being done in every fiscal quarter.\nA detailed budget breakdown into identifiable sub categories of tasks to be performed has been provided which is reasonable.The proposal to create the community owned DAO, will reassess and evaluate the funding requirements again at that stage. A verifiable plan has been provided in this regard ,they can come again to catalyst for funding .\nThe proposer seems to be aware of risks and challenges posed by this proposal which they will have to look into for the subsequent phase after this proposal. Considering All the above facts I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has clearly outlined few important metrics regarding the project however the information is too short which does not provide with a deep understanding of what is planned for result.\nA clear auditability plan is not provided.There is no detailed plan with when the desired outcomes of the project can be expected to reach .Thus the deliverables of the project doesn't have clear delivery time to monitor the growth of the project .\nIn my opinion there has to be continuous monitoring of the project for which they should define a clear time table by setting dates. This will not only help in providing feedback to the cardano community but also clarifies if what was promised is actually happening or not. However, using the list of final Metrics one could audit its goals and its success but there should have been a little more sufficient information to assess. I neither agree nor disagree and thus a score of 3 out of 5 for the auditaiblity does justice.", "q2r": 3, "assessor": "z_assessor_3312", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11693, "q0": "The proposal comes from a good place and the problem of hardships faced by up and coming artists is certainly easy to understand and relatable. The creation of a DAO for the decentralization of the decision making is certainly one way around the Tangent team taking full control perpetually, though i would not describe it as the most novel idea, but certainly a potentially effective one for people to vote on what kind of art they would like to see more of.\n\n\n\nMy concerns for this proposal would be centered around the credibility or the origination of the idea itself. This will then be closely linked to the commitment of the team as well and the effectiveness and longetivity of the project as a whole. In the description, they mentioned that none of the team members are from east asia, thus i found it hard to convince myself that they understand the nuances of the artists in the east asia community. They stated they would hire a Project Manager from the East Asia Cardano community later on - but, should that not be the a step during ideation, when pain points are being identified? \n\n\n\nAnother concern would be, the breadth of east asia as a region and the proposing team did not detail in what sort of way a strategy would be developed or implemented as a step by step progress. Stating the umbrella term east asia is fine, but the region does not even have a strong unifying language as a base to begin with. If they were to create the DAO for the east asia community, what would be the first country to tackled, why the country, and what would be the language used? An artist from Thailand would not be able to understand a DAO in vietnamese.  I understand that this statement would cut slightly into the Feasibility section, but I think i would put it under impact just because i dont see how they can have a strong impact with this idea after considering all the description provided.\n\n\n3/5 given for score, because it does align with the challenge it's in, and the idea is simple and executable. Its just lacking a number of details.", "q0r": 3, "q1": "For the Feasibility answers, I think the team did well describing key milestones in terms of timeline. Budget is reasonable as well. Team history is impressive too. However, similar to the notes on Impact I wrote earlier, there was a couple elements / factors that could be added to make the proposal much more convincing. What country would they address first in the East Asia community, and why? What language would be a suitable medium of communication then, to get the widest reach? What would be some of their current understanding of the local artist scene, artists in which country would face the greatest hardships, etc. ", "q1r": 3, "q2": "the metric chosen were number of East Asian artists who apply for the grant, success of the artists and their projects following grant funding, and success and participation within the decentralized East Asian artistic grant platform. These are great metrics to measure the success of the proposal. However, would like to know a little more on some more intangible statements such as \"success of the artists and their projects following grant funding\". How can we measure that in a fairly decent way? Doesnt have to be a perfect measure, just a little more details would help alot in understanding how to define artist success.", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11380, "q0": "Across East Asia, national level responses for the art and cultural sector have focused on policies and measures designed to provide immediate short term financial relief. Many art professionals have created initiatives to assess the impact and demonstrate the values of art and culture in this crisis. Artists in philippines are offering skills workshops and design services at home to help build the skills of the people in their community who are out of work. Artists are ready to contribute to rising awareness about design opportunities offered by the government. To create artistic grant program to support East Asian artists sponsorship has to be given by cardano blockchain. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The feasibility part has a detailed plan including creation of apps and recruitment campaign launch , voting for artists grant candidates. Also includes recruitment campaign launch across social media targeting community and release of initial Artistic Grant governance structure. DAO voting and awareness marketing also included. The budget is brokendown clearly which is required for implementation of proposal. The plan describes the resources necessary to implement it. The Clint Alexander is an entrepreneur and an investor who worked alongside bitcoin mining hardware is very impressive. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project can be tracked by measuring the number of East Asian artists and a buzz can be created online within communities. The success and participation within platform can be decentralised and vote , select and grant for funding. The plan is detailed properly and budget breakdown is impressive . The team working with project has very good experience with the bitcoin mining hardware companies which is very good.The project involves engaging East Asian artists to apply for grants and funding is used for the talented artists. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 11352, "q0": "The proposal that fits the formula is to create an exclusive supporting arts program for East Asian artists with supporting accounts to familiarize themselves with NFT on the Cardano blockchain. Help artists create NFT value for the community and bring income to East Asian artists.\nHowever, the proposed solution to the problem is not very convincing because most artists often do not have many blockchain-savvy people and they often focus on making their art rather than moving to another area even have no interest without being educated on the importance of blockchain.\nThe proposal also introduces some risks like the account will be sent to the artists, there is no guarantee that the artists will use the funds to successfully start their art and there is no such thing as success. Any member of the East Asia team should hire a project manager to work on this project from the East Asian Cardano community.\nThe give up the method is not a persuasion to solve the problem. The proposal should specifically state how to deal with the risk and who will do it what the experience of the person doing it will be, the starting product being something specific how many artists can create the NFT How much NFT brings value to the artist and the cadano community.\nI found the proposal to be a good fit for the challenge.", "q0r": 4, "q1": "The proposal that fits the formula is to create an exclusive supporting arts program for East Asian artists with supporting accounts to familiarize themselves with NFT on the Cardano blockchain. Help artists create NFT value for the community and bring income to East Asian artists.\nHowever, the proposed solution to the problem is not very convincing because most artists often do not have many blockchain-savvy people and they often focus on making their art rather than moving to another area even have no interest without being educated on the importance of blockchain.\nThe proposal also introduces some risks like the account will be sent to the artists, there is no guarantee that the artists will use the funds to successfully start their art and there is no such thing as success. Any member of the East Asia team should hire a project manager to work on this project from the East Asian Cardano community.\nThe give up the method is not a persuasion to solve the problem. The proposal should specifically state how to deal with the risk and who will do it what the experience of the person doing it will be, the starting product being something specific how many artists can create the NFT How much NFT brings value to the artist and the cadano community.\nI found the proposal to be a good fit for the challenge.\nWith the experience of the project team, I believe the proposal will be successful.", "q1r": 5, "q2": "The proposal has set out the project development goals such as:\nPromote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all\n\nBuild resilient infrastructure, promote inclusive and sustainable industrialization, and foster innovation\n\nReducing inequality within and between countries\n\nPromote peaceful and inclusive societies for sustainable development, provide access to justice for all, and build effective, accountable and inclusive institutions at all levels\n\nHowever, the goals are still not specific, the proponent needs to be more detailed what the output is, the number of people who know the project as well as the development of cadano.\nWhat is the end result that the community can see.\nWhat do the generated NFTs look like, and what value does it suggest to generate tokens for NFT holders?\nThe proposed solution is not really convincing to me, hoping that the proposed topic needs a more specific solution.", "q2r": 3, "assessor": "z_assessor_3241", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10946, "q0": "I am very impressed with your idea of how caring and influencing a group of artists can have a huge impact on the peoples of East Asia.\nHowever, I still don't quite understand how your solution will be implemented in detail. What types of artists will you approach? How would you recommend working with them? How do you help them get extra income? How does the community know about and reach out to your project?\nI hope you will add more details to the plan next time.\nThe challenges and risks section also does not highlight your ideas and solutions to the challenges and risks of this proposal.", "q0r": 4, "q1": "Because the impact plan is not convincing, the specific timeline in this section is not clear and not really convincing.\nThe project also allocates a budget that is not clear and convincing.\nHowever, I am very impressed with your team. You assemble a team of many people, and you are both experts and experienced in each of your fields. Hope you can write better comments next time.", "q1r": 4, "q2": "In this section, the project has not yet provided a monitoring method and indicator system so that the community can accompany and audit your project progress and results. I hope you come back with a better plan for the next Fund because I appreciate your idea and hope it succeeds and brings Cardano to the community even more.", "q2r": 4, "assessor": "z_assessor_3210", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10859, "q0": "Arts sponsorship program that exclusively supports East Asian artists with grants (financial support primary, technical or physical) for on-chain NFT casting\nCardano blocks. This is a pretty good proposal for the development and creation of jobs for East Asian artists to access nature with Cardano. I think this is a very good idea\nto train artists to come to Cardano and spread the word come to everyone. At the same time in a positive direction create the number of people who know the Cardano ecosystem and contribute to creating a strong catalyst network. KPIs The proposed link is quite strong with the challenging KPI presented. I appreciate the suggestion and thrive in the future.", "q0r": 5, "q1": "In terms of feasibility, I have nothing but praise for the proposal. The members are all very experienced and have the skills required for a strong development proposal. The budget comes up with a reasonable fit for the proposal and can simply be determined.\nThe group also shows the determination to break through soon, even if they don't have extra funding. The group also came up with a plan and sequence as well as a detailed implementation schedule for the project's success. At the same time, measures to overcome difficulties are also given.", "q1r": 5, "q2": "Progress, milestones, and specific delivery KPIs and thinking well, with leaders\nMany years of in-depth experience will give suggestions flourished in East Asia. The community can follow track and audit the proposal without any problems. With KPI and high determination, the team will succeed in\nthe future.", "q2r": 5, "assessor": "z_assessor_3198", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10633, "q0": "This proposal for East Asian artists is very humane, and I think it fits perfectly with the goal of the challenge. The idea of ​​creating an arts grants program that specifically supports East Asian artists with grants (financial, technical, or physical) to mint NFTs on the Cardano blockchain, through a dapp called Tangent. I was pleased that the proponent presented his reasons for developing East Asian art and extremely pleased that the proponent had a very candid view of the success of the artists. Here, I have analysis like this, I agree is an app for East Asian artists, but what kind of art will it focus on (e.g. music, pictures, traditional art) system...).\n\nIt makes sense to propose a funding system for new East Asian artists with sufficient resources (capital/tools/...) Good for both Tangent and the artist and our Cardano ecosystem, it will help more artists know about Cardano, and also increase the number of users learning about the application. However, I think the proponent should add a list of artists that will initially receive an endorsement from Tangent, and what Tangent will plan to do to make that artist's NFT more popular. How can we present the artist's NFT to the audience? I think it will be very interesting if Tangent has early media activities and media to attract emerging artists and educate them about the Cardano ecosystem, in this way, I believe that the proposal will add more value to all 3 parties (Cardano, Tangent, artist). Increase the number of artists who know about Tangent, and increase the number of users who know Cardano, the artist who is supported by the community.\n\nHowever, I would like to make a counterpoint: According to Tangent's share on Meidum (from the project website), Tangent focuses on the development of NFT and the application of art and finance, combining Defi farming with NFT in the modern digital art gallery experience, how exactly would this be done? How will the artist's NFT be displayed? What NFTs will be on display and why are those NFTs, where will the audience go to art galleries to see these NFTs? Beyond this point, I honestly think the project has a lot of potentials and can have a good impact on the Cardano ecosystem.", "q0r": 4, "q1": "The author provides a very detailed roadmap and team information. However, I think some tasks need more explanation and a detailed plan, for example, \"Deploy application testnet and invite testers\" - who will be invited to test the application? How many people can test? What are the criteria for them to be selected as testers? Who will re-evaluate the tester's opinions and views? The proponent did a great job on this part, but adding a few elements makes it even better.\n\nIn the roadmap, I still don't fully understand what the proponent meant, \"Recruitment campaign launch across social media targeting the East Asian community push 1\" - What is this recruitment campaign for, recruiting to target community? I don't understand this point. On the other hand, as in proposal Q4 2022, there will be a voting period for sponsored candidates, which ones? What art do they do? do they already have a small fanbase?... I think it's a good idea to have this list so that CAs can also review and evaluate it, this will help even the proponent can filter potential candidates. The roadmap part is pretty clear too, but I wonder where the application phase is completed, other than that the idea of ​​this proposal is an app with a tokenomic of its own (obviously built on top of the Cardano ecosystem ) - however I see no mention in the proposal. But fortunately, the proponent provided links to information about the project idea (https://tangent.art/) so I have a resource to read about tokenomic. I see that there is a presale route on the website, but I also see that it has not been mentioned in the proposal, the above is information that I think the proponent should clarify in more detail.\n\nThe budget section is quite reasonable and well explained. The budget for a dapp project is not too much, but it is also necessary to let the CAs know exactly what part of the fund will be used for each item, what the experts in the team will do, and how many hours per day for the project,... Calculations are made specifically so that we have a solid idea of ​​the possible outcomes of action if this proposal is approved. I just need to suggest more detail in the working plan and scenario so that the user or CA can better understand, in short, the project idea is good, should make it more detailed.", "q1r": 3, "q2": "The ability to recommend an audit is quite vague, so I will rate it as average, but I don't think it's too bad, can still be improved to be better. Here they say the first key metric that will measure success is the number of East Asian artists applying for sponsorship, meaning the data is about the number of artists or is it from a successful artist metric will link with other data like number of fans, number of successful NFTs sold, number of users voting for artists, etc. Many successful talented artists will contribute to Cardano's ecosystem, more specifically, what will they contribute? I think it is possible to audit and clarify metrics from parties, end-users (fans/artists), apps - number of users, how this apps provide and present information on UX, and how many artists will be released when the application is complete. With the above suggestions, it is possible to track how the project will be completed at the right time and in the right way, always re-measured.\n\nWe can establish a bridge with the community, team and test evaluators, maybe have meetings, or AMA to announce the results of each stage through social networks, so we know see where the project is going, so the project will also have an initial community that loves the project idea for themselves. The community must have a place where information and action data can be continuously monitored. Since the idea does not provide clear audit information, I will give it a medium score (they don't focus much on the audit part)", "q2r": 3, "assessor": "z_assessor_3191", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10293, "q0": "Relevant experience is sufficient for this section, although The main indicators and objectives are found in the following sections. This proposal can be defined in a way as a project that is engaged in blockchain for more than 5 years and has previously created their own NFT platform on an alternative chain and has extensive experience in developing and implementing deploying blockchain & NFT related projects since 2019.more details are needed in the Impact section for expansion if you are rewriting for future funding rounds. How much detail you can fit the proposal is always better.Therefore, there are no plans to scale –– although any strategies for scaling should be added if rewritten.", "q0r": 4, "q1": "the information provided till now is more than enough and it is also very detailed, east asia art sponsorship Modified the team behind it is very professional and committed to the Cardano project, in addition to wanting to do a solution that in my opinion is very workable.\nI hope this project gets done good luck\n  However, financial security for East Asian artists can be extremely difficult, especially at the beginning of their careers, and they often lack the material and technical support to pursue their artistic goals. I believe I can almost overcome it", "q1r": 4, "q2": "The information provided and the demonstrations presented in creating art that we can enjoy, East Asian artists deserve support and have a foundation, and the Cardano blockchain is an incredible technology. wonder can allow it to be so complete, At the same time, this is the art form that most authentically, the most primitively expresses their creative form, making it the most valuable and richest in beauty. Freelancers the growth of the NFT market .so it shouldn't be a problem if you keep a close eye on the development of the proposal that fits this challenge\n.", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9328, "q0": "Your proposed solution fits the current problem that financial security for East Asian artists can be difficult, especially at the beginning of their career, and they often lack material support. qualities and techniques to pursue their artistic goals. One reason to believe in the art of NFT is that this digital space is growing rapidly, with the creation of new, low-energy blockchains like Tezos, which run on a system called “Proof- of-Stake” (Pos) and is expected to significantly reduce the current carbon effect of NFTs. In addition to the risks you mentioned, I think the risks are that successful artists follow a traditional path that is difficult to break. “I was a bit hesitant at first, but then I did a lot of research and talked to a lot of people, especially technologists, who really understood blockchain and then my opinion changed. ”, artist Red Hong Yi, who is based in Kuala Lumpur, who is known as Red, told Al Jazeera. The above is an example when artists have gradually better understood the effects of blockchain. It is a very good idea that you propose a funding system for East Asian artists so that they have the necessary capital to devote themselves to creating art that we can enjoy. Real passionate artists will bring positive effects.I think your project will have an impact but there will be risks.", "q0r": 5, "q1": "\"When I read the detailed plan, I see the budget breakdown is written down in detail, but the total should be below. Milestones in each phase are developed with detailed information on what the team intends to do and achieve in each phase. Regarding the members of the group, I see that you have listed very specific details with a large number of members. Although there is no link to follow, what you listed also shows that good team members have many years of experience in the fields (legal) and especially information technology, I feel trust the team.\nIn short, this is a well-written overall recommendation. So I really feel that it has the potential to be done okay.\"", "q1r": 5, "q2": "\"In my opinion, the analysis and progress metrics of the proposal are fine,\n You have a specific goal to achieve. In addition, further measures are needed to increase artist access, for example through surveys in East Asia on Artists' understanding of the decentralized model. Because from that survey, we will understand and give information about this model for artists to understand. Therefore, I think the survey results will contribute a useful part to improve the project's organizational performance. Besides, I agree with the measurement to monitor the progress of your project as much as possible. The more artists apply for sponsorship, the more talented artists the community will invite to contribute to the Cardano ecosystem. Similarly, success will be measured by the success of artists and their projects after funding. Besides it should set targets with more specific numbers to easily observe whether it is growing more or less.\"", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8855, "q0": "There are lot of artists around the world who doesn't get attention even on producing great songs this will lead to massive discourage of people towards music or any other artistic development as profession, now a days music needs lot of monetary support complete its task, Hence to overcome such issues the proposer wants to sponsor dedicated singers and later convert their songs to NFT's where ownership rights or authorized rights can be passed from person to person , this makes musicians to continue their journey in music field without causing any fear in the future, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Building a portal and converting music's into NFT's is moderate to achieve, however the proposer's team has worked on building Tangent which is a radical art & finance project built on the Cardano network, the team mainly consist of Plutus developers, UI/UX developers, coin minters and marketing executives , Hence team with already set up the task can be completed without much barriers ahead , the proposer has even presented voting bases sponsorship which is definitely great where it increases transparency in the task, Hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has introduced all the team members who'll be part of project and each member has diverse role which is definitely great to see, The audit has presented their previous work as \"Tangent\" for artists which definitely shows proven experience of the team, it even presents the idea of voting which helps in increasing the transparency of the system.\nThe audit has presented detailed timeline to complete the project, it even contains decent budget breaking idea ,with unique to help and encourage musicians , and moderate risks involved ,The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7407, "q0": "The project wishes to support East Asian artists in many aspects such as art creation costs, dApp development, NFT creation instructions for products, and DAO construction. This can be considered a big project, I think the team should divide the project into smaller topics. Help the team navigate the work in phases, and complete each step. All the things that you want to do so much, all presented by you in this proposal, it's not seamless\nIt wasn't until I read the \"get a budget\" section that I knew you wanted to start this project by creating software. Take a look at the \"Challenge\" you submitted, I think it's better suited to the \"F9: Dapps, Products & Integrations\" Challenge. I know everything is relative, and I hope what I contribute will help the team. I give 3 points in this section\n", "q0r": 3, "q1": "The team is really strong in terms of technique, in terms of coding, I appreciate this. Building software is within your reach. The budget table is presented quite succinctly, I think it would be better to be detailed, and clear for each part. For example, how much is internal? How much money is outside? How many outsourced employees? Which direction does marketing cost, and on what platforms?\nYou mentioned the budget for 6 months, but the detailed plan lasts 5 quarters, equivalent to 20 months, this is not really appropriate. Hope you readjust. In this section, I regret only giving 2 points. Since you come to Catalyst for funding, but the budget presentation is in conflict, it is difficult for the community to approve and disburse.\n", "q1r": 2, "q2": "With indicators such as the number of artists registered to sponsor, and the number of products created, how does the team quantify? Please make that clear to the community. Are there other criteria that can be measured or tested? And what social networks do you publish the results on (Facebook, Twitter, LinkedIn ...) for the community to easily track and monitor the project. Hope my suggestions will be of great help to you, in the future will create a useful playground for artists. For now, in this section, I can only give 3", "q2r": 3, "assessor": "z_assessor_2893", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5630, "q0": "The problem described in this proposal is closely aligned with the challenge. It identifies the lack of community support, financial incentives and technical support in the East Asian artistic industry as the culprits of East Asian artists' inability to achieve financial security. Besides, the proposal noted that despite NFT markets providing financial source for artists, its highly speculative and fast-paced nature has disincentivized the creation of high quality art. As the community moderator of a CNFT AI art project, a common complaint I often hear from the community is the NFT space’s hype-driven and “quick-buck” environment deters artists invovelment. Besides, most CNFT projects' short lifespan due to improper management can easily strip artists’ recognition and career progression. \n\nThe proposed solution is to create an artistic grant program providing monetary, technical and material support to sponsored East Asian artists who desire to mint NFTs on Cardano. The artistic grant program aims to be somewhat similar to a DAO (decentralised and community-owned) through the creation of a Dapp. In other words, its vision is akin to allowing the community to determine which artists to fund. However, I think the proposal would greatly benefit from providing extra information on what the funded artists will be doing with the funds. As an example, are sponsored artists allowed to use the fund to mint their own collection, independent of Tangent (the proposer)?; or the certain collection/s from sponsored artists are under Tangent’s NFT launchpad (refer page 11/24)?   \n\nI believe the solution can add immense value to the Cardano ecosystem through the onboarding of East Asians to Cardano, providing assistance to East Asian artists and giving artists greater access to Cardano’s global community. Ultimately, this will bring about a more inclusive, global Cardano ecosystem.  \n\nThe key metrics and goals proposed are closely aligned with the challenge for it brings about East Asian artists to the Cardano Ecosystem. \n\nWith regards to future sustainability, I have difficulty grasping the sustainability of the proposal. On the bright side, it states their confidence in maintaining the grant program for a long time. This brings me to the next question, if it were to be a dApp, how can the project sustain their operation in the future without funding? To my understanding, Tangent will have a fundraising event in Q3 2022. Would the fundraising be the primary source of revenue? \n", "q0r": 3, "q1": "The information available about the team working on this project is highly detailed, consisting of their roles within Tangent and their professional background. I think this is a highly capable team as the team covers project management, business development / marketing, technical development (some are enrolled in Cardano programs), legal compliance and artists. But, as this proposal aims to fund East Asian artists, I think it lacks experts or art enthusiasts well-versed in traditional and NFT art. Such a role is crucial in identifying the most deserving artists who provide quality work and are able to contribute to the Cardano ecosystem. Although there is no East Asian member, the team has acknowledged this and shows thoughtfulness by being confident in this not being a long-term obstacle due to the wide demographic of East Asian. \n\nAlthough there is no working product as evidence of track record for the time being, I think the team has demonstrated sufficient effort to pivot this proposal further. It has a well-designed website, a well-thought out Whitepaper, an upcoming fundraising program, and articles in Medium. To the very least, this showcases a reliable team.  \n\nThe budget breakdown describes three items, but the items are described very vaguely. I think the proposal should address budget breakdown in more detail to allow the Catalyst community to evaluate what the fund requested would be used for. In addition, there is a an excess of $5,000 between the requested fund and what’s listed under budget breakdown. There might be a miscalculation in the proposal. However, given the ambition of this proposal, I think the requested fund is justifiable.\n\nRegarding the timeline, the team has presented a well-described timeline which covers in detail what they set out to deliver and achieve every quarter for a total duration of one year.  \n\nThe team has also addressed challenges and risks relevant to a successful implementation in detail. But, given the proposal’s final product is a community-owned grant program, I think the proposal should address potential exploitation by influential members / whales within Tangent’s ecosystem as part of the risk. This is a huge risk inseparable from any community-owned projects that could determine the success and failure of a project. \n", "q1r": 4, "q2": "The roadmap is well-designed, it details technical development, marketing initiative, recruitment, grant application, DAO development (from inception to a Permissionless DAO). There is also clarity in the described problem. As the chosen output reflects criteria of a successful grant program with great interaction within the community, I believe metrics given are also highly related to the proposal and challenge. ", "q2r": 4, "assessor": "z_assessor_2729", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3857, "q0": "The idea of ​​​​the proposal has identified part of the problem to be solved for this challenge, but the scale of the project's impact is so large that we can extend it to many different areas. conditions are the same around the world. The project needs to measure the difficulty of the artists and assess whether the artists have worked and whether it is really difficult financially and technically to pursue the art, here is a proposal very humane.\n\nThe solution of this idea is good, it identifies some problems of the challenge, besides the author of this idea argues logically, neatly, and creatively. The proposed solution is to create an exclusive arts grant program. from artist to NFT on Cardano blockchain and the artist earns extra income from NFT there. However, the author should first consider running demo creation tests from artists so that the community can assess if the art NFTs are potentially profitable? The profile of invited artists also indicates whether they are financially viable. Or is art a problem?\n\nThe concept of this project has detailed some risks when implemented, the author of the idea also mentioned many solutions to all of those risks, which makes the risk management of the project very difficult. the project faced many difficulties. Projects from the community if Sponsored will be easier and clearer. Not being able to secure financial or technical support for the right artists is a big risk, as it seems to go against the purpose of this proposal, however, the author has also come up with a solution. the selection of sponsored artists may be at the discretion of the Cardano community.\n", "q0r": 3, "q1": "The project provides a vague amount of information about implementation and completion timetables, specifically the progress is only listed in a general way by quarter, but the goals that the project is aiming for. It's very specific and doable. The project is divided into 6 quarters for implementation in 2 years 2022 - 2023, based on the KPIs of each period is a smart and reasonable allocation, but the project roadmap needs to detail the work by a week or at least. monthly, making it easier for the community to track and control its progress.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. The author's spending budget in general needs a more detailed budget e.g. how many hours employees work, cost per hour of implementation, Dev team developing the UI in three months of usage How many employees?.\n\nThis project is quite good when the human resources to implement this project have been assigned specific jobs for each item, the experience of the members shows that it is completely suitable for this project, in addition, the identities of the members are also easily verified clearly by the links. listed above. The scheme is very clear, complete, and transparent. The author of this project, Clint Alexander, and collaborators Ben Gordon, Benjamin Grabow, Sydney Bright, Shahabaj Dange, Roman Gor, Alexis Golding, and Henry (Kurtz Artist), show that this is an experienced team of propaganda. To announce this project, identity is also easily verified by a reputable link to identify identity such as LinkedIn, etc. so that the community can verify identity easily and practically.\n", "q1r": 4, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured by the indicators provided by the project, and they are also easily tested in an implementation. Parameters such as the number of East Asian artists applying for funding, the success of the artists and their projects after funding, the active participation of a part of the community for voting and selection, and the experience Costs are parameters that are easy to check after the project is launched.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea.\n\nBrand new idea information on the Cardano platform never received any funding from the Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3815, "q0": "The proposer in this project, wants to create an artistic grant program that will exclusively support East Asian artists with sponsorships(financial, technical, material) to mint NFTs on the Cardano blockchain. The proposal is seeking to create a decentralized artist grant funding DAO that can be sustainable and eventually owned by the community.\nTo address the challenge, the proposer is saying that raising awareness levels of artists in East Asia about Cardano network and how they can mint clean NFTs should be a priority for the Catalyst community. The chosen East Asian artists would receive materials, finance or simply technical training so that they could create digital art on the Cardano Blockchain. \nThe proposer mentioned risks and mitigating measures to mitigate them. \nThe challenge is addressed well. My rating is 4. ", "q0r": 4, "q1": "This proposal has outlined a detailed and clear plan which shows quarterly timelines with specific activities attached. The timeline has Q2 2022, Q3 2022, Q4 2022, Q1 2023, Q2 2023, and Q3 2022. All these timelines have specific activities attached. \nThe budget total requested is $33000 and it has been broken down comprehensively showing clear costs for marketing, artistic platform interface / Graphics, to mention a few.\nThe team working on this project is made up of 8 experts who have relevant experiences such as digital art through NFTs, Japanese Bohemian Artist, Legal Advisor, Ethereum and Plutus Pioneers, Cardano community members. \nThe team indicated that they may or may not seek further funding from Catalyst depending on circumstances at hand. They are involved in other proposals in Fund 9, but not working on any previously funded project. \nWith the information given about the team experiences and plan, the project can be implemented successfully. My rating is 4.", "q1r": 4, "q2": "This project will measure progress by looking at the number of East Asian artists who apply for the grant; the success of the artists and their projects following grant funding; also how the success and participation within the decentralized East Asian artistic grant platform. \nSuccess in this project according to the proposal, involves East Asian Artists applying for grants, grants being successfully used to help talented artists flourish, creation of a strong East Asian artist scene on the Cardano Blockchain. This is a new proposal.\nThe information provided can audit the proposal well. My rating is 4", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3452, "q0": "Problem statement does exsit, as new artist struggle to emerge, and the solution proposed here tries at least to faciliate their beggining by providing financial support (grants) combined with their technical development and materials, through a DAO approach. All in all, idea is valid and addresses the challenge as it focus on participants in east Asia and will potentially improve Cardano ecossystem in the region. As for the proposal itself, it describes the solution and strategy of it pretty well but still lacks some key information. For instance, it is not clear where the money for the grants (or to buy materials) will come from - by the budget breakdown in feasibility, it doesnt seem to be from catalyst. It also doesnt say who would be the people to support on technical trainings or how proposer would recruit them. It could also contain at least a draft on the marketing strategy, telling how it would be advertised both for digital artist, who might not even know about Cardano, and for Cardano community to participate. Communication is one of the main drivers for this project to succersfully work.\nRegarding the risks part, they are very well identified and it is very imporant to manage them closely throughout the project.", "q0r": 4, "q1": "There's a very fair timeline, divided by quarters with acitivites well detailed and matching project scope. It's good to see that marketing is a recurrent item in the plan. Budget breakdown is sensible and matches project schedule. The only thing that could be added here is the amount of hours for each budget line. it has, however, the number of months.  Other thing that could make the budget breakdown clearer is to see how much will be paid to each person and how many people would be involved in each of thse lines, specially considering it will be a big team (around 10 people) working on the project.\nRegarding the team, there are 8 people already committed with a very diverse background, including software engineering, legal, business and management, Plutus, UI and UX, which are key competencies to run the project. There are reference links provided for all of these people. Important to say though that other 2 people will need to be hired. As these 2 people would represent only 20% of the team, I'll not lower the rate because of it.", "q1r": 5, "q2": "There are basicallly 3 metrics proposed here: (1) number of East Asian artists who apply for the grant, (2) online buzz creation  within East Asian communities and get the Artist sponsorship programme trending on social media and (3)  success and participation within the decentralized East Asian artistic grant platform. The first one is very fair, measurable and does make sense but it could have a target to start with (at least for the first months). The second and the third are quite subjective thoug and propsoer doesnt clearly state how they are going to be measured. This is imporant because a clear definition on it could be used to assess more objectively whether project was a success. For instance, for the second one, the metric could be the number of people engaged in social media (acombination number of likes, comments and mentions). The latter one could be measured by a survey. These are just examples that could make auditability more robust.\nRegarding milestones, it is possible to extract some good ones from the project plan. It's imporant though that proposer communicate about ir properly, in a public way, via, for instance, social media or a github, so anyone can have access.", "q2r": 3, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2412, "q0": "The central idea of ​​the project seems quite interesting, since the market for the sale of NFT arts is heated and we see works being sold at increasingly higher prices. Furthermore, those interested in purchasing works belonging to a specific niche may also be willing to pay notoriously high prices. One idea would even be the possible creation of a series of works focused on sustainability, putting in vogue Cardano's efficiency for the production of NFT's. This project in general, if successful, has a clear potential, in the long term, to bring greater visibility to the technologies of the Cardano ecosystem, making the capital being requested justifiable. However, it is also worth noting that the risks inherent to the project are high, however, we were able to observe a mitigation of these risks since the professional team seems very competent to carry out this challenge, as we will discuss further below.", "q0r": 5, "q1": "We see that the project has broad objectives, but we also note that the team is made up of a large number of professionals with their CVs available for us to verify their experiences. In addition, these professionals demonstrate experience in several areas that are complementary to the correct execution of the project, not only being developers, but also people with legal experience and digital artists. We can also pay attention to the fact that one of these professionals, Benjamin Grabow, has a special affinity with the NFT's market, a fundamental characteristic for the scope of this proposal. Another positive point about the feasibility plan is the temporal organization of the activities to be carried out, the action plan schedule indicates steps that are gradually more complex, demonstrating that the team understands what must be done at each moment. Furthermore, a strong feature of the project is that artists can be subsidized to focus on artistic production without financial worries; therefore, it is essential that such artistic productions have enough visibility so that the chances of commercialization are increased. And in this context, the project shows a clear concern with marketing, with a considerable part of the budget earmarked for this. By the way, in relation to the budget division, we have a justifiable distribution of capital, with the largest amount being attributed to the development of the subsidy panel, which is totally consistent.", "q1r": 5, "q2": "It is possible to notice that the team's perception of success is quite aligned with everything that was passed during the proposal, we say this because we see that the team's ultimate goal is to create an engaged and lively environment where new artists can exhibit their work and contribute both to your personal development and to the development of the entire East Asian region. Likewise, the metrics chosen to monitor the progress of the project are also valid, the only thing left is the observation that the possible presence of numerical goals to help monitor the project would be of great value. For example, an expected amount of works by the financed artists could have been established after a certain period of time. Likewise, it would be interesting to indicate an expected value of donations made by the platform after 1 year of product launch.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2004, "q0": "The proposal’s argument is, basically, that the beginning of an artist trajectory is quite hard - low income, bad material, no opportunities etc, are some of the misfortunes that they might encounter. Therefore, they propose using the NFT tech minting in Cardano blockchain to create an artistic grant exclusively to East Asian artists.\n\nThat being said, this proposal is quite interesting because of two points:\n1 – It’s known that the artist’s begin is quite hard. Lots of the artists sometimes give up of their dreams because they need to work in a traditional job in order to help family and they don’t have the opportunity to wait until that first piece of art that shines brighter and people start to buy it;\n2 – It’s having a big shift in the art world. Early 2000 the art center were located majorly in US and UK. However, nowadays the gravity is moving towards Asia (East Asia – China/Hong Kong) (https://news.artnet.com/market/asia-rising-morgan-stanley-artnet-2030273).\n\nThat being said, the market opportunity now is huge. The prediction to the art market sum in Asia in 2023 is almost USD 0,5T (https://www.statista.com/statistics/1063135/asia-art-market-contribution/#:~:text=Asia%20contributed%20a%20sum%20of,dollars%20by%20the%20year%202023.), meaning that there must be several beginners there looking for an opportunity. The moment is perfect.\nTherefore, since this proposal has a huge growth potential and the onboarding of new artists will make them to learn a bit about the ADA world and blockchain, this proposal fits with the challenge “[…] raising the awareness levels of regular people in East Asia about blockchain and the Cardano network […]” and it focus on East Asia.\n", "q0r": 5, "q1": "The major idea of the proposal is to aid/support, not only financially, artists allowing them to focus in their art and create unique things. To accomplish this task, the team is creating a platform in which the artist can mint they NFT in ADA blockchain and stake it as an ‘operative artwork’ to earn rewards – NFT farming.\n\nThe team: They have a mixed team with all the abilities needed to create this platform, from ADA developer to specialist financial services lawyer. Therefore, the platform is covered, as well as the marketing to disclosure it.\n\nBudget: Explained. The USD 33K will be used to the payroll to create the platform and marketing. Since the platform creation will be made by the team and the amount asked is to their payroll, I believe they won’t need any further investment to finish it. Besides that, the platform is already rising capital selling 30% of their tokens (made in 3 phases – already in phase 2).\n\nThe roadmap is well structured, showing that they have a clear path to follow and also included the next step, being a DAO in which the community will choose who will receive all the grant.\n\nThe overall project is well planned and is also being conducted in a nice manner, having all explained in the whitepaper (found in the link provided).\nTherefore, viewing all the information provided, it seems quite probable that this project will be successfully completed.\n", "q1r": 5, "q2": "The roadmap and milestones are well thought and showed, being easy to know in which development phase they are and, since the github and website was provided, it’s quite easy to follow it.\n\nThe KPI are related with participation of East Asia artist and community, which is nice. Maybe adding a KPI referring to token transactions (volume), e.g., would be nice to see how well the platform is going. \n\nI’m missing here metrics referred to the desired arrival place, meaning ‘we expect that in 1 yar period will have’: X artists onboard; X wallets, X grants, X transaction volume etc. This way we could evaluate the ambition and expectation – what the proposer aim is important to the voters.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12468, "q0": "Personally, I think this proposal meets the challenge’s request ideally. I was so surprised in the first place when I read about the project and that would help lots of people, especially free artists if it was funded. Many of my friends are passionate about drawing and painting they made thousands of pictures on the wall and paper which are very beautiful and qualified. Although, some could not keep their passion because of lacking money for their living. As I know, In East Asia there are millions of street artists in the same situation as my friends. When you walk down the streets in Asia your eyes can easily be caught up by some paints on the wall or some street guys doing artwork for customers. Unluckily, they can not afford their cost of livings by making that kind of job. They are putting their hands into a bunch of stuff to earn money to bring up their artwork passion or they will be left in the dust. Therefore, the idea of creating a grant for artists like all the ones mentioned above is very very necessary and meaningful to the community. In addition, the team is building Tangent (The NFT & Farming Partnership) running on ADA infrastructure. Therefore, this idea kills the challenge perfectly It not only supports the ADA community to growing bigger but also connects free artists and solves their real problem is “make and meet” furthermore helps their passion for artwork living. It is called\n\"one stone kills two birds\".\n\nNFT was one of the biggest trends last year 2021. One individual artist can make tons of unique and beautiful artworks that can be paints, fine art, sculpture and etc. All those things would be very expensive and valuable worth thousands of dollars like Bored Ape Yacht Club or CyptoPunks if they are minted into NFT, especially in the ADA ecosystem. Cardano can grow sustainably with a win-win connection between the artist community and the ADA ecosystem.\n\nIn conclusion, this proposal is highly recommended", "q0r": 5, "q1": "The project has declared a very good and capable solution to solve the artist’s issue. They already built up a website called Tangent.art aiming to allow all artist can stake their operative artwork and earn rewards in an innovative process known as NFT Farming. Though the website and all functions are not fully completed yet it looks so gorgeous,  professional, and responsive. Speed is good. To be honest, I have read many projects and I feel this project’s website is one of the best. This is the only first step there are many to go on the Tangent journey to fulfill its mission.\n\nThe team is almost formed up. Let's see team members' details, they are all experiment people working in blockchain, software, marketing, and even finance industry for many years. They provided clear information on LinkedIn, profession, and position in the project of every member. If voters want to take a look this link would help https://tangent.art/team.", "q1r": 5, "q2": "At this time it's hard to say this proposal can be audited totally. The roadmap and milestones for the project are very clear showing what the team will do for every quarter lasting to the end of next year. There’s no doubt now the team is on the first step. For every quarter, the voters and the community can check where the project is easy on Github and function update on the website. That’s a good point!\n\nHowever, the proposer did not show where and what channel artists applying for the grant granted if measuring the success of this project is the number of artists applying so it should be clear and public so voters and the community can keep up to date.\nGood Luck!", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12667, "q0": "The issue in the challenge that needs to be addressed here is that Financial security for East Asian artists can be extremely difficult, especially at the beginning of their careers, and they often lack material support and techniques to pursue their artistic goals and the proponent clearly describes how to add value to the cardano ecosystem by creating an arts grants program that exclusively supports East Asian artists with grants (support financial, technical or physical) to mint NFT on the Cardano blockchain. Measures proposed by the proponent are to raise awareness among artists in East Asia about the Cardano network. create an attractive dapp that will attract aspiring talented East Asian artists to Cardano and then fund them with attractive support packages such as material support, tools, education, financial support, and community recognition. created a dedicated dapp to give the Cardano community the ability to vote for who gets the funding and the candidates will be selected exclusively in East Asia. Selected East Asian artists will receive documentation, finance, or simply technical training so they can create digital art on the Cardano blockchain. From the above measures, I believe that this proposal can be scaled up to address future challenges. I completely agree that this proposal effectively tackles the challenge and I give it 5*.", "q0r": 5, "q1": "The proponent has provided extremely detailed information about the skills involved as well as the required experience of each member who will work on the project. The type and number of team members needed are clearly defined by the proponent in detail with each role as well as each person's unique experiences: Decision making, development, coding, and marketing. The budget proposed by the proponent to achieve the goal is reasonable, clear, and broken down into specific items: the proponent asks for 33000 of which the East Asia Art Grant Board Development budget of 15,000 dollars, UI Development $8,000, Marketing $5,000, Platform Art/Graphics $5000, however, I haven't seen the proponent take into account the costs incurred, I think the proposal The proposal will be more complete if there is more estimated cost incurred, I hope the proponent can take note of that. The proponent has given a specific realistic timetable including 3  2, 3, and 4 of 2022 and 3 of funds 1,2,3, of 2023 in which each quarter the proponent clearly defines, specific work to be done in each quarter. The proponent described in detail the resources needed to implement the proposal and provided a specific, detailed and appropriate implementation plan, In addition, the proponent also considered the challenge when implementing and solution to that challenge. I rate 4* for the feasibility of this proposal and I strongly agree that this proposal will be successfully implemented.\n", "q1r": 4, "q2": "I consider the auditability of this proposal relatively good. As mentioned in terms of feasibility, the project will take place in the last 3 quarters of 2022 and the first 3 quarters of 2023. However, I have not seen the proponent mention the important milestones as well as the time to achieve achievement. I think it would be great if the proponent could give a specific timeline for each possible achievement of the project. Indicators to determine success are also selected by the proponent: the number of East Asian artists registered for sponsorship. the success of artists and their projects after funding. success and participation in the decentralized East Asian art funding platform, and I find these metrics to be perfectly relevant and good indicators of a project's level of success. The proponent has clearly described and understandably the problem that Financial security for East Asian artists is extremely difficult, especially at the beginning of their career and they often lack material support and techniques to pursue their artistic goals and come up with clear, understanding solutions that effectively solve problems. With regard to the suitability of this proposal I rate 4* and I agree that this proposal provides me with sufficient information to assess the progress of the project to success.", "q2r": 4, "assessor": "z_assessor_3449", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Our solution is to create an artistic grant program that exclusively supports East Asian artists with sponsorships (financial, technical or material support) to mint NFTs on the Cardano blockchain.", "experience": "Tangent is a radical art & finance project built on the Cardano network. Our team is made up of developers from Ethereum and Plutus pioneers building on Cardano and we are passionate about art, cardano and knowledgeable about minting nfts (see to github link)."}