{"id": 417062, "author": "cryptoloops", "title": "Flooftopia: Korean Translation", "url": "https://cardano.ideascale.com/a/dtd/417062-48088", "category": 26602, "amount": 7500, "description": "Currently, there is a need to raise awareness & provide accessibility to CNFT gaming projects in East Asia. As the interest continues to grow, is paramount that we remove any language barriers.", "f6_no_assessments": 6, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 1919, "q0": "Although the idea of translating any projects into non - English in East Asia is always a good idea, I do not see the proposer sharing the supporting data, such as how much the NFT-gaming user base in East Asia vs in the Western, etc and its relation with English proficiency in each country/language. With more and more projects in Cardano build by the western (English) team, I think we need more global solutions rather than using our Catalyst funds for each project to translate into another language. As for this proposal, were aligned with the Challenge setting, and will value the Cardano community as a whole. The adoption of NFT gaming will help onboarding newcomers for sure - IF the game succeeds.\n\nNote to vCA: I use generally the same feedback since the proposer has multiple proposals, with the same problem but different languages to translate. In overall, this is how I view and assess the proposals", "q0r": 4, "q1": "The proposer shares with their team how they will deliver the game successfully, but not about the translation - which they will use external resources - but how good or experienced these resources were not given. Are they experienced in NFT-gaming translation? Is the proposer reached the local Korean Cardano Community to get references? any plan of collaboration? The team might want to add some feedback from them and hopefully can get more insight into how they should start this project.\n\nWith Q3 and Q4 as the timeline which is given in the proposal - but without detail on how many words need to be translated - it is difficult for me as an assessor to see if the timeline is reasonable or not. Considering the proposer are the developer of this gaming, they should have a rough idea about how many words need to be translated and multiple that number using the market price of translation - which is about $0.13 - $0.18 area - but how many words in total?\n\nWithout the total words not mentioned in the proposal, assessing the total budget of $7,500 is very hard (too low or too high? it depends).", "q1r": 3, "q2": "The proposer shares the rough timeline with enough metrics to monitor the progress of this project clearly. I would suggest that the proposer use the Cardano Forum and/or the Github Projects about their progress that can be easily tracked by the community - and they can post these results on their website. With a total of ~ 6 months of implementation, the auditability of this project should be easy to track.", "q2r": 4, "assessor": "z_assessor_2289", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 2011, "q0": "The proposal states that a way to attract East Asian people is through games, and one of the hindrances that delays their participation is the language barrier. Therefore, the solution proposed is to translate their game (not finished), Flooftopia, which will be a MMORPG with a unique customizable NFC minting.\n\nIt’s true that a way to attract people to blcokchain world is through games. The gaming market size is huge and is growing each year, with a value of USD 126B (https://finance.yahoo.com/news/gaming-market-size-grow-usd-084000742.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAKgpBjKoZBVtw0atPsboXOroviuzEjRq97bC2bzll9us9_DFYeTWveN2jAvfmRU1T5R_fvRmlOra3aZQOxXXbj1xkSJReZxsb—obrQx88JJNMLlfaFxP9Peh9-MT-pnWK3zOQ6vymVdYVjcRfUDkGGHHw7mfR8IDISyS5DFeGHe).\n\nHowever, a point that should be taken into account is that the premise of a MMO game is to be an online game. Therefore, the act of translating game NPC might not be sufficient, since you need to collaborate to evolve in this type of game.\nA solution that could address this problem is creating a dedicated server to Korean people, however, this was not mentioned.\n\n\nThat being said, although the intention of this project is to aggregate Korean people in the game and, therefore, rise awareness of blockchain (ADA) in East Asian people, its impact might not be very significant since in an international online game the language would still be a barrier.\n", "q0r": 2, "q1": "The proposal addresses the language barrier problem by hiring a translator to translate the website and the game itself. However, there is no detail on the translator pricing. It was only asked USD 7500 with no explanation.\n\nLots of certified translators charge by word. Therefore, in this context, we have no clue on how much words and, therefore, material he can translate. Thus, there’s no way to know if the project will be finished or not.\n\nTo complete this project there are three major points:\na) Creating the game: This part should not be difficult since it was given proof of knowledge and experience in this field of the whole team;\nb) Translating the game: Hiring a translator deal with this part with no difficulty. The only risk here, which has a huge impact on the project, is the funding; and\nc) ADA integration: It was not giving any proof of a team member having this experience and without a budget plan it’s difficult to validate this part.\n\nThat being said, it’s not impossible to be done, however there is not enough proof or details that allow us to validate the whole project.\n", "q1r": 3, "q2": "It was provided a link in which we see the evolution of the project. There is a timetable there with some milestones and an indication of what has been completed or not.\n\nThere are some KPI which refers to # gamer from Korean-speaking community, #new gamer due to surpassing the language barrier and satisfaction level. These are good, however I would add # users (total), to understand the profile of your players and verify if the project (translation) was worth it.\n\nAnother point that should be added is the metrics, the expectation of the projects, meaning that should be added expected number of users in 3m/6m/1 year, number of korean speakers in 1 year, etc. We have no idea if the project is a success or not if we don’t have parameters to compare.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This is a biased assessment. All one has to do is read the first paragraph."}, {"id": 2417, "q0": "The central idea of this proposal revolves around the translation of a game in development that belongs to the blockchain universe. Indeed, the more people the game reaches, the greater its visibility, as well as the Cardano ecosystem. Thus, we have that the proposal fits the objectives of the challenge in which it finds itself. A possible fear would be that the game is still under development and has even been present in background 8, raising the question whether the continuity of its production has been appropriate or if it has been forgotten. However, when looking at the project's website and news about the game, we realize that its development has been continuous and that there are updated news. Therefore, it is possible to believe in the medium and long term impact that this proposal can cause, as well as the capital being requested seems quite correct.", "q0r": 5, "q1": "One of the main points for this translation to be beneficial to the project and also to Cardano is the success of the game. Therefore, it is important to pay special attention to the professionals involved in the project, since a good part of a game's personality is defined by the team's immersion in the project. In this regard, we can see the presence of several professionals with experience in important companies in this universe such as Ubisoft. Furthermore, such experiences are not restricted only to technical skills in the area of ​​technology, but also in the areas of illustration and marketing, as we observe, for example, the CVs of Christian and Marcin. For all these factors, it is quite possible to believe that this game will be a successful project, and consequently, that the proposal in question is also viable. However, it seems important to mention that the breakdown of the budget could have been a little better explained. It was decided that it would not be possible to accurately estimate such detail as it would depend on the amount of dialogue present in the game. But it would be interesting if a ceiling on expenses, even if approximate, were established, based on an approximation of the final amount of dialogue in the game.", "q1r": 4, "q2": "Regarding the defined ways to follow the project's progress, we realized that very accurate parameters were chosen, since they follow the effect that the translation is having and if the language barrier is being broken. It is interesting to note that even ways of verifying these parameters have already been thought of. Finally, regarding the perception of success, we see that the scenario described is consistent with everything proposed during the development of the idea, including a very positive point is whether to use the progress parameters to understand the success or not of the project. As a single observation, it would be interesting to quote a tool so that the community could also easily follow the success of the translation and the game.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6333, "q0": "Disclaimer: I will be using almost identical assessment text for four proposals of these proposers.\n\nThis proposal is about translating the game 'Flooftopia' from English to Korean to engage more Korean users and thus broaden the game's impact. Hence it is aligned with Challenge as it wishes to serve the Korean community from East Asia.\n\nThe Koreans learn English in school from the third standard, but they will not be proficient speakers of English as they use this learning mostly to pass the tests & exams. Hence this Flooftopia game translation effort from English to Korean will provide value, but it depends on the game's success. \n\nMost CNFT & Game projects fail to gain traction and become dormant or have decreased community engagement after their launch. So it is difficult to ascertain the impact of this translation proposal as it depends on the success of the Flooftopia game. I hope they get the traction and success they desire. But as it is still in the development stage, we cannot evaluate the game's success and impact on Cardano space. \n\nThe proposer stated that the main risk is the funding, which may be true. But I think the main risk will be the success of the game and the onboarding of users to the game. It depends on the quality of the game, marketing efforts, social media engagement from the game developers, and its popularity among the Cardano CNFT community. The success of the game can determine the impact of this proposal. Hence I cannot agree or disagree with the impact criteria of this proposal. ", "q0r": 3, "q1": "The proposer provided the team details along with their brief introductions. Their LinkedIn profiles are also given. The team is skilled as they are comprised of Game designers, developers, videogame programmers, etc.; considering the team's qualifications and skills, they will likely develop a good game. But the main person who will translate the game's content is yet to be hired. The proposer stated they are in contact with many translation service providers, and they are waiting for the funding to hire one of them.\n\nThe budget of $7,500 can be reasonable if the game to be translated is fully developed and we know the volume of data to be translated from English to Korean. The amount can differ based on the volume of data that has to be translated. Also, it has not been broken down into identifiable parts which is not expected from the proposer. It is better to let the game fully develop, and then he can attempt to translate the game's content. \n\nThe timeline mentioned is two quarters. I cannot say it is reasonable without knowing the game's content to be translated. For example, if the translator has to translate a large volume of texts, we can justify two-quarters worth of time, but if the work is not massive, then the mentioned time will be unreasonable. \n \nI think it is not feasible to propose something for translation that is not yet developed fully. So my suggestion for the proposers is to let the game fully develop and get it to the stage where it is gaining traction in Cardano space. Then you will have specific details on the data volume to be translated, which can be mentioned in the proposal, such as 'these many pages multiplied with this much amount.' Then maybe we can justify the amount as well as duration. ", "q1r": 2, "q2": "The proposer stated we could utilize the timeline to track the progress. However, as I said above, the timeline is extended over two quarters which may or may not be reasonable to execute the mentioned task of translating the game that is not yet fully developed.  \n\nThe asked budget of $7,500 is not broken down into identifiable tasks. This omission also hampers the tracking/auditing of the proposal's progress. If the proposer is in touch with the translators and knows how much data will be there on the full game development, they may get some quotes, and based on those quotes, the budget should have been broken and mentioned in the proposal.\n\nThe success metrics are the increase in on-Chain activity from Korean users via the Korean-translated Flooftopia game and the new users coming to Flooftopia with the help of the translation services, which were refrained before due to the language barrier. \n\nI disagree based on the fact that the game to be translated is not yet developed. Hence we cannot ascertain the timeframe and budget required to execute the translation. If the proposer has an idea about the content, they should provide specific details in the proposal.", "q2r": 2, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This is a biased review.\n\nSo, does the game have to be out before we provide translations for the game? This seems to be a re-occurring theme, and we are looking to take the translations for dialogue and more and get those translated for the alpha release."}, {"id": 7104, "q0": "I mostly agree that this proposal addresses the challenge setting. To understand this impact on Korean translation, it is crucial for us to see their timeline. The Flooftopia team finished the website and paper. They also plan to complete the storyline, Chinese and German translation, and their adaptation of the NFT Floof coin. So, by proposing the Korean translation to start in the third quarter of 2022, the timeline is perfect because the alpha tests will be completed in the fourth quarter. That said, I would appreciate it if the sender could give us an estimate of the number of potential users they would reach by providing a Korean translation. I'm sure there are tons of MMORPG players from Korea, but seeing those numbers in the proposal, or at least how many Korean-speaking players there are currently in Flooftopia, would convince us more of the impact of this proposal. I understand that these numbers may not be available at the moment and that the sender could do a quick poll or survey within their community to get them (already listed similarly in the success statistics section), but at the moment the lack of information makes it difficult to determine how important it is to reach a Korean-speaking audience. On the other hand, it's also not a bad idea to reach as many users as possible since they are based in North America. What prompts me to agree with this proposal is that there are many things that need to be translated: their website, their cards, character dialogues, game manuals, etc. As an Asian, I directly observe how many gamers don't play games that aren't in their native language because they don't understand game menus, what to do, and more. It's a shame because the player base here is incredibly large. I think today it's necessary for every game to reach those players through language localization.", "q0r": 4, "q1": "I don't quite agree with the details of their implementation, not because of a lack of skill on their part, but because of a lack of detail in the translation process. On the contrary, the team is made up of very experienced and enthusiastic game developers, and we could see that they had put a lot of thought into the proposal because they had already taken into account the difficulties in translating technical terms and planned to solve them by proofreading. However, there is no information on who will translate it (the proposer indicated that there are already people in the community for this, but no specific profile is given), how many translators they would need, or how they would reward or work with them. The budget is also not detailed enough. The proposer did not mention what would happen if the requested budget was insufficient or too high. Again, I know it's hard to determine those numbers and provide the information now, but it's also hard for me to judge if it's reasonable or not. My suggestion to the proposer is to get closer to the details based on how they translate into Chinese and German, for example, what they are currently doing in the second quarter of 2022. With this as the default knowledge base, the proposer would be able to estimate how much work the translation requested, explain it in the proposal, and finally justify the funding.", "q1r": 3, "q2": "I tend to agree that the current measurements are sufficient for the review. The measure of success is explained by the proposer based on the number of players from Korean-speaking communities and their satisfaction. These measures would be provided through surveys and polls, and the results would be quickly traceable. One small improvement I can think of is the lack of tracking of the translation process. When it comes to translation, keeping track of how many X words have already been translated from Y words doesn't help much. It is much more useful to keep track of the items that have been completed, such as character dialogues, game menus, etc. I'd like to see the community translator's report or keep the proposer informed about the progress of the translation. Ultimately, the current timeline-based approach to milestones is sufficient.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9213, "q0": "This proposal addresses the problem of the awareness of Cardano to CNFT game users in Korea.\nThis project’s goal is to attract more Korean CNFT gamers into Cardano ecosystem.\nThe KPI of this project is explained, however, it should be more details in terms of how many new targeted users of Flooftopia for each month and how intense the new members will contribute to the Cardano community.\nThe proposer has outlined the activities in Q3 and Q4, however, it should be more detailed in terms of how many games dialogue will be translated as a target.\nThis Proposal does not define the future risk or challenges that might happen. it is important to have this so that the team member of this project can have a mitigation plan.\n", "q0r": 4, "q1": "This proposal provides a Flooftopia website which explains that this community is about games. \n\nthe proposal has provided Linked In regarding the information on each team member's background and it is seen that the team members are capable to run this project. \n\nthe requested budget for this project is $7.500 and will be used for Korean translation. it is suggested to have more detail as to how much it costs to translate 1 game dialogue so that the total cost can be seen and transparent.\n\nit does not mention that the project will need additional funds for the future, but it would be best for sustainability to have additional fund so that the project will sustain for the Flooftopia member.", "q1r": 4, "q2": "The proposer provides Q3 and Q4 in 2022 as a plan. how ever it would be best if the plan can be more thorough. \n\nthe KPI of each team member can not be found as well as the KPI of hired translator should be made. the KPI of those 2 items is crucial so that the project can be monitored properly.", "q2r": 4, "assessor": "z_assessor_3031", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Flooftopia will provide Korean language integration to engage more Korean users, thereby broadening the impact of the game and the Cardano Ecosystem.", "experience": "Coding: Dirk\nGame Programmer: Simon\nArt: Christian\nStory: Chris\nMarketing: Conward\nGame Design: Alex\n2D-3D Artist/Animator: Oleg\nLighting Artist: Lena\nStrategic Advisor: Marcin\n(Additional Team Detail Below)"}