{"id": 417033, "author": "cryptoloops", "title": "Flooftopia: Japanese Translation", "url": "https://cardano.ideascale.com/a/dtd/417033-48088", "category": 26602, "amount": 7500, "description": "Currently, there is a need to raise awareness & provide accessibility to CNFT gaming projects in East Asia. As the interest continues to grow, is paramount that we remove any language barriers.", "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1667, "q0": "This proposal, in terms of impact, certainly deserves top marks. We know how Japan is a very fertile destination for the growth of blockchain technology, both because it is one of the countries with the most innovative technologies, and because of the familiarity that this audience has with games, and especially the Flooftopia style (games with NPCs). The purpose of the proposal is to translate the game, from the functionality for users to build their own NFT (which would be their characters in the game, the NPCs), to the missions and more different extensions of the game. It would be very useful for Cardano to have this project translated into Japanese, since the number of speakers of this language is very high (according to the proponents, there are more than 125 million speakers). In addition, the importance of investing in Japanese territories is so great that in past funds the country was the focus of a challenge of its own. In other words, the proposal certainly meets the requirements of the challenge, which in general are to take Cardano to East Asia. We know that the main barrier to be broken down is linguistics, and that would be addressed here. It is also important to think about projects that fit the profile of the Japanese user, which also happens with this project. Surely the proposed solution will accelerate the interconnectivity between East Asia and Cardano, so that more active users are added to our community; more CNFTs are minted (each Floof is an NFT); the number of digital wallets would certainly increase, because from what I understand some in-game purchases would be made in Ada, and through smart contracts (which in themselves are also goals of the challenge, increase the number of transactions being made in the Cardano blockchain). My only suggestion to make the impact of the proposal even more intense would be that more explanations had been given in relation to the Flooftopia project. I know the game because I have already evaluated other proposals regarding this idea, but perhaps other readers of the proposal do not have the same prior understanding. As much as the proponents have attached a website that presents the Flooftopia universe to the proposal, it would be interesting to include in the proposal a brief summary of what this game is and what makes it different from the others. Flooftopia, from what I understand, is an RPG game centered on NPCs (Floofs), the goal would be for the player to evolve their character, explore a world, build houses and villages, etc.; that is, to relate to other players, but not in a dispute or battle mode. I find this game especially interesting as it seems appealing to both a younger audience, such as children and teenagers; as well as for adults who like this modality. It is very positive that the game is not focused on blockchain and the technologies that involve it, which can make it easier for players who are not familiar with these aspects to also be able to enjoy the project. However, all this detail could have been provided directly in the scope of the proposal. Still, in my view it is a project that deserves top marks in terms of impact.", "q0r": 5, "q1": "Unfortunately, the proposal script is not adequate, it lacks a lot of detail so that we can understand exactly what would be done, how and when. The activities are divided into a total of 6 months, being the third and fourth quarters of 2022. We know that the Japanese translator would be hired in the third quarter - but how would the selection process of this professional be carried out? The translation of the site, mainly, and the coining functionality would be done. What would the translator's work routine be like to carry out these activities? How long, within a 3-month period, would the website translation take? And the translation of the dialogue? From the way the information is passed, we can't get a solid view of the process. It is said that the missions and dialogues would be translated in the fourth quarter of this year, but again it is not detailed how the translator's work routine would be and also how long each small part would take to be translated. I notice that in the script there is no step to promote Flooftopia to the Japanese public, which in my opinion would be essential for the success of the project. How can we guarantee that the target audience is reached, that the translations have not been done in vain, without the maximum possible use? Moving on to the next topic of analysis, which is the budgetary part, this topic is also not very good, in my view. $7500 is requested, but the proponents themselves report that \"it is difficult to provide a detailed budget breakdown for this proposal as it will depend on how much dialogue the Flooftopia game has\". With that, what was the criterion to define that 7500 dollars is a fair, necessary and sufficient amount to cover the expenses of the translation work? I think it would be more appropriate if: 1) the bidders had already better defined how much work would be done. How much dialogue to translate and so on, that is, maybe when the game was more advanced and better finished, then we would have an idea of ​​how much content would have to be translated; 2) it would be more interesting if we also had an idea of ​​how much time the translator would dedicate to this project, how many hours per week he would work, what would be the value of his working hour? Therefore, in my view, this topic should also be improved. Finally, thinking about the team, we are very well introduced to the team members that make up the Flooftopia project, we know the names, roles, resumes and also the linkedin profiles of each team member. But the main worker of this project, who is the translator himself, has not been selected yet, we would need to know who he would be, what his background is, if he understands anything about blockchain, if he already has experience with game translation and so on. So I think the information provided in the feasibility is enough for us to have a general idea of ​​how things would be done, but we don't have the detailed understanding that I think is ideal.", "q1r": 3, "q2": "Regarding the auditability of progress, proponents claim that it is difficult to be guided by a schedule, as it would likely have fluctuations (unforeseen). I believe this condition applies with all Catalyst proposals, so it's important to have a thorough follow-up of the work being developed as the stages unfold. We know for example what the partial results would be to expect (number of Flooftopia users coming from Japanese-speaking communities + number of recently engaged Flooftopia users who were not previously engaged due to language differences + satisfaction level of the Flooftopia user experience Flooftopia with the Build-An-NFT process and the Japanese game). But how could we monitor what was being done behind it, to generate this? I believe it would be important for the roadmap to be more detailed and for an informative report to be prepared at the end of each month, so that the Cardano community is aware of all updates. Another suggestion I would like to make would be: establish some time limits for certain gains to be observed. For example, how long are 100 Japanese users expected to discover and become daily Flooftopia players? How could we measure the level of satisfaction with the experience, and make this knowledge reach the Cardano community? Moving on to the analysis of success, it is certain that the desired scenario would be “a broad spectrum of people from the Japanese community coming together to enjoy the world of Flooftopia” and “attract more East Asian users who may have been discouraged from entering the gaming space”. of the CNFT due to language barriers. In the end, having a solid number of users who have benefited from our language integration features.” But how could this be measured and proven? In my view, it would be necessary that after some time of the complete translation of the game (for example, 3 months after the entire game was translated into Japanese) we could assess the acceptance of the public, the number of new users and how they relate to Cardano . Indeed new digital wallets were created and the number of NFTs minted on the Cardano blockchain grew from this project? How would these users be relating to the community, are they interested in other blockchain games as well? The issues to be resolved, raised in the challenge summary, would need to be clearly addressed, such as “What is the novelty and appropriateness of solutions? + Are we on track to improve the lives of people using Cardano in East Asia? + Was social and environmental impact evaluation used to measure proposal performance?”. Although we have a satisfactory view of how the project would be monitored, more details could be provided, both in the case of monitoring the process and the final results.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 2009, "q0": "The idea behind this project is translate a MMORPG game called FlootTopia into Japanese. This MMORPG has a customizable NFT minting in ADA which aims engagement of Japanese speakers in the game and the augmentation of ADA community through this game.\n\nThe game industry is growing each year and the Japanese people are very open to technology and gaming. Therefore, it should be nice to create a game which thinks to embrace this people. \n\nHowever, being a MMO and, therefore, an online game, it’s quite hard to believe that the fact that you have the option to choose NPC and quest in Japanese will really engage people. The fact that MMO is a collaborative game, you must interact with people in order to evolve. And thinking that the overwhelming majority of players will speak English, the Japanese will be suffocated.\n\nThat being said, the proposal do align with the challenge objective at first, however the impact in it is low.\n\nIf it was created a dedicated Japanese server to facilitate them to interact, maybe the idea would be more well implemented. There were games which had dedicated servers to some people (brazil, e.g.)\n", "q0r": 3, "q1": "To accomplish the tasks, you need 3 things:\n1 – Game: it was provided proof of the team qualification\n2 – integration with ADA: It was not mentioned neither budget nor team member which has knowledge in blockchain/ADA programming\n3 – Translation: The budget asked, USD 7500, is dedicated to the translator, however it was not provided how much he can translate with this money (is it too much, is it enough?)\n\nThat being said, the proposal seems feasible but there are some points that should be sorted out first.\n\nAnother aspect is the scalability – if the game grows or it needs more budget to finish the translation, the proposal gives no plan to surpass this difficulty.\n", "q1r": 3, "q2": "There are KPI provided referring to the number of users from Japanese speaking countries and satisfaction. It might be interesting to know the ratio of the users, therefore adding a KPI such as # users, # English speakers, # Japanese speakers. This way the proposer can evaluate if the investment worth and could plan to expand to other languages or not.\n\nIt’s missing metrics, missing the expectations (number of users in 3 months, 6 and 1 year, e.g.).\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "The proposal is just about the translation to Japanese. This is looking far beyond the proposal."}, {"id": 2415, "q0": "We have that the main objective of the project is to carry out the translation of a game in development into Japanese, and as this has the potential to increase Cardano's visibility, in fact the proposal is in line with the objectives of the challenge in which it finds itself. A possible concern about the impact of the project would be that the game may not be in full development (as the project for this game has requested funds before). However, when looking at the game's website and other proposals in this current fund that involve Flooftopia, we can see that the project is active. With this, and mainly because the target audience of the game seems to be quite comprehensive, we noticed that this proposal can really improve Cardano's projection among Japanese speakers, and close to the return that this can cause, we have that the amount being requested is quite befitting.", "q0r": 5, "q1": "Given the main objective of the project, we see that it is not necessary to go into great detail about the actions that must be carried out, the most important factor being the team that will carry out the translation and its experience. In this regard, we realized that the professionals involved in this project are also those involved with the development of the game, a very positive factor that avoids possible problems if the translation were outsourced. As the game's own team is also responsible for the translation, the emotions of the lines and dialogues are more reliably translated, an important feature to bring good storytelling to users (remembering that this is a fundamental factor in player retention). However, one point that could be better addressed is that in the budget breakdown it was said that the total cost may depend on the total amount of dialogue present in the game. A maximum spending ceiling could then be established (even if approximate) so that this idea would be better tied. Still on the professionals involved in the project, it is worth noting that their CVs were made available so that we could verify their experiences. Additionally, when accessing the game's website, we can see that it is in constant development and has current milestones to be reached.", "q1r": 4, "q2": "Regarding the metrics chosen by the team to follow the evolution of the project, we realized that they are relevant and touch exactly the point of integration of a new community to the project. The team's perception of success is also aligned with this aim of expanding the visibility of the game and Cardano. However, as the game aims to reach a large number of users, it would be interesting if these metrics were a little clearer, so numerical values could be defined for the objectives that were outlined. For example, how many Japanese-speaking users are expected to join the game after the translation is done? Additionally, it would be interesting if the project results were periodically made available to the general public through a tool such as Jira.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7102, "q0": "I tend to agree that this proposal addresses the challenge setting. In order to understand this Japanese translation impact, it is crucial for us to see their timeline. The Flooftopia team has finished their website and paper. They also plan on finishing the story lore, Chinese and German translation, and their NFT Floof minting customization. So, by proposing Japanese translation starting from Q3 of 2022, the timeline is perfect because alpha testing is going to be completed in Q4. That being said, I would appreciate it if the proposer gave us an estimate of how many potential users they would reach by providing Japanese translation. I am sure there are a ton of MMORPG players from Japan, but seeing those numbers in the proposal, or at the very least, how many Japanese-speaking players are within Flooftopia right now, would convince us more about the impact of this proposal. I understand that these numbers might not be available currently and that the proposer could do a survey or poll within their community quickly to get them (already stated similarly in their success metrics section), but as of now, the lack of information makes it hard to determine just how important it is to reach a Japanese-speaking audience. Then again, it is also not a bad idea to reach out to as many users as possible since they are based in North America. What makes me lean on agreeing to this proposal is that there will be a lot of things that need translation: their website, their paper, the character dialogues, in-game manuals, etc. As someone from Asia, I observe directly how a lot of players actually won’t play games that don’t have their native language because they don’t understand the game menus, what they are supposed to do, and many more, which is unfortunate because the player base here is incredibly huge. Thus, I think reaching out to these players through language localization is needed for every game nowadays.", "q0r": 4, "q1": "I can’t entirely agree with their implementation details, not because of a lack of competence on their part, but because of a lack of details on the translation process. Far from it, the team is made up of very experienced and enthusiastic game developers, and we could tell they had put a lot of thought into the proposal because they had already considered the difficulties of translating technical terms and planned to deal with them through proofreading. However, there is no information on who is going to translate it (the proposer stated there are already people within the community for this but no specific profile is given), how many translators they would need, or how they would reward or work with them. The budget is not broken down into enough detail either. The proposer has not mentioned what would happen if the budget requested is not enough or if it is too much. Again, I know it's hard to determine those numbers and provide the information right now, but it’s also hard for me to assess if it’s reasonable or not. My suggestion for the proposer is to approximate the details based on how they translate into Chinese and German, like what they are currently doing in Q2 2022. With that as the standard knowledge base, the proposer could estimate how much work the translation requires, explain it in the proposal, and ultimately justify funding.", "q1r": 3, "q2": "I am inclined to agree that the current metrics are sufficient for auditing. Measuring success is explained by the proposer to be determined by the number of players coming from Japanese-speaking communities and their satisfaction. Those metrics would be provided through surveys and polls, and the results would be trackable quickly. One minor improvement I could think of is the lack of how they would track the translation process. When it comes to translation, there is not much benefit to tracking how many X words are already translated from Y words. It is much more useful to track which items are completed, such as the character dialogues, the game menus, etc. I would like to see how the community translator reports or updates to the proposer regarding their translation progress. In the end, the current approach of milestones based on timeline is enough.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 6, "ne": 2, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 13371, "q0": "CNFT game projects in East Asia are gradually being developed and receiving more attention, but the language barrier is the biggest barrier that makes it difficult for non-English speaking indigenous people More difficult, your Flooftopia proposal will offer the Japanese language to attract more Japanese users thus expanding the impact of the game and Cardano ecosystem so it fits the challenge presented, I agree with your suggestion, and I believe it will be useful to the Japanese community in particular and the Cardano community in the world in general.", "q0r": 4, "q1": "- The version to export your plan takes place in the last 2 quarters of 2022, that is, starting at the end of this fund 9, the plan is divided into 2 quarters but that is not enough, I think it is necessary to split more specific jobs.\n- And as You said in the proposal, it is difficult to give a detailed budget analysis because it will depend on the level of dialogue of the Flooftopia game so it is also difficult to score this part,\n- Therefore, you need to divide the game into segments to allocate the amount of work and budget more reasonably, otherwise, it is difficult to control the time to complete the project.", "q1r": 3, "q2": "- In this part of the audit, I can't imagine what your success looks like? because your answers are quite general.\n- Metrics such as the number of Flooftopia users from Japanese-speaking communities, the number of new users joining Flooftopia who have not previously joined due to language differences, satisfaction level in the experience Flooftopia users with the Build-An-NFT process, and the game in Japanese are generally good metrics for measuring success, and I also hope you'll work harder to contribute more further for the expansion of the Cardano network in East Asia.\n- And for the community to track and verify your success, you should create a public file like Google Sheet to summarize and update the KPIs on it, or update it on a website. and copy the link to that website so that the community can follow the success of the project.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Flooftopia will provide Japanese language integration to engage more Japanese users, thereby broadening the impact of the game and the Cardano Ecosystem.", "experience": "Coding: Dirk\nGame Programmer: Simon\nArt: Christian\nStory: Chris\nMarketing: Conward\nGame Design: Alex\n2D-3D Artist/Animator: Oleg\nLighting Artist: Lena\nStrategic Advisor: Marcin\n(Additional Team Detail Below)"}