{"id": 417265, "author": "easterntownhall", "title": "Connecting Asian Voter and Proposer", "url": "https://cardano.ideascale.com/a/dtd/417265-48088", "category": 26602, "amount": 15000, "description": "Language barriers and cultural differences creates a lack of trust on sources to rely on before and during the voting period.", "f6_no_assessments": 12, "f6_rating": 4.472222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 1676, "q0": "The proposal is quite complete and aligned with the objectives of this challenge. It is about promoting a series of actions to “bring voters, proponents and proposals closer together. To establish trust between them.” The problem raised is the lack of understanding and trust of Asian voters in relation to the entire voting process. The proponents (the eastern towhall team) argue that a survey was carried out in which the Japanese community pointed out the lack of (linguistic) support as the main problem in the voting process, that is, many of them did not fully understand the content being presented and therefore voted randomly; there was also some wear and tear due to fraud and misaligned processes in relation to incentives (it would be interesting for the proponents to provide some example of such a situation, so that we could understand more solidly, through cases). Therefore, to solve this situation, many activities would be developed, carried out by the already very active group of the Municipality of the East. Group members are already quite active in the community in order to interact, share ideas and carry out actions, such as biweekly meetings that are directly linked to the General City Hall. With this proposal they want to effectively distribute translation content in a timely manner (it would be important to also clarify the sharing process, what strategies they would use to make this happen as planned). In general, they intend to reach the Asian audience of 3 languages ​​(ID, JP and VN - it would be positive if instead of the acronyms they write the name of the languages ​​themselves, I believe it is Indonesian, Japanese and Vietnamese, but it would be better if we had this information in full). This would be done by some activities, such as “content production to help ADA holders understand the importance of voting” (it would be very interesting if we had some example of content, if it would be in video format, written, etc.) . “Eastern Hemisphere language-specific events focused on voter education and discussion” – would be online events, most likely, so details like the frequency of events and how the audience would be attracted could also be included. ”A proposal to create a language translation pipeline to help bidders reach the wider East Asian community” - what would a pipeline be? They also claim that they will carry out an intense social media campaign to publicize the content that would be created, so that the maximum number of voters could have access to what was being done, and all the communication channels already used would be boosted. In general, I think that the proposal serves very well the objective of bringing the public from East Asia closer to Cardano and Catalyst, but it would be interesting if the activities themselves were a little more detailed, I know that there are many ideas and the proponents already they did a good job of listing them, I really believe that the proposal deserves the maximum score in impact, this is just a suggestion for it to improve even more.", "q0r": 5, "q1": "The proposal script is not very adequate because the proposers repeat the same information in month 1 and 2, even though the work to be carried out is the same, it would be interesting if we had more details on how the activities would be carried out and who would be in charge of each part (they claim that roles are not defined, but I think it would be important to have a little of this notion, to understand how the process would take place). How would voter education videos be produced? What topics would be included in this part, what topics would be covered in month 1 and month 2? How would you partner with the Catalyst AIM group, how would explanatory videos about the proposals be created, how would some proposals be selected to be presented? What electoral content would be translated, relevant to Catalyst? How would you bridge the gap with East Asian voters? Maybe through the channels of communication with the community, such as Telegram, Discord, Youtube and etc… It would be very positive if we had more details about what materials would be created and widely disseminated in these channels. That is, although there is a description of the activities that will be carried out here and a good temporal notion of when each would be carried out (in which month and in what order), it would be important that more details had been provided about each one. Regarding the budget, the amount requested is 15 thousand dollars, which in my view is a very fair amount for the amount of activities that will be developed here. The value is properly divided into several parts, such as video production, marketing and communication, project management, website maintenance, etc. Interestingly, in addition to explaining how much each part would cost, the bidders provide specific details on each: for example, to perform site maintenance, would be the activities of “maintaining and updating the easterntownhall.com site to accommodate the following communities; Indonesian, New Zealand/East Africa/English, Singapore/Korean and Japanese”; to manage the projects, would include the activities of “coordination with partners (building bridges, realizing synergies) + controlling the schedule (meeting KPIs, submitting proposals, etc.) + controlling project costs”. So in relation to this part, I think that the information is provided in a very satisfactory way, we would have an even better understanding of the whole if the activities of the script itself were more unraveled, but from the way expenses are scored here, it is quite clear how the 15 thousand dollars would be used. About the team, as I already mentioned, they say that “there are no roles, no leaders. Instead, people establish themselves over time through participation. We overlap and collaborate with Catalyst Swarm [ 2 ] and Catalyst School [ 3 ] and other community groups across Asia”; I agree that it is not necessary to have leaders, but a division of roles in my opinion would make the proposal's readers better understand how the whole works. The other groups in Asia, which they collaborate with, could also have been mentioned. Talking about the team members themselves, we have a lot of people involved, all presented in a very appropriate way and it's a group that's really involved with Cardano in a practical way, quite experienced, so it gives a lot of trust. I believe that the proposal is very viable, with only a few adjustments being necessary (mainly in the script).", "q1r": 4, "q2": "It would be very positive if the proponents could better detail what the research they will carry out would be. What will be asked, how will the target audience be approached? How many people are we thinking of contacting, and what will their origins be? Several KPIs are said to be expected to measure partial success, such as “increasing Eastern Hemisphere voter turnout by 25% over the previous Fund,\nincrease Eastern Hemisphere participation in Catalyst by 25% over the previous Fund through various channels of community advisor engagement, veteran community advisor engagement, submission of proposals, etc.” The topic “Uncertainty around Catalyst and voting down 25% from previous Fund” gets a little confusing for me: how could this uncertainty be measured? As there are several activities being carried out, I believe that it is very necessary for a member of the team to collect general information at the end of each month and be able to pass it on to the Cardano community, we know that the focus would be on community members from East Asia , but the whole community needs to be aware of the improvements and activities that would be developed here. Therefore, quantitative and qualitative data must be gathered, so that we can understand well about everything that has been developed so far. Talking about success, I believe that this part is very well assured, as many metrics on success are plotted: “average fortnightly Easter City Council numbers increase 25% for each Fund + Catalyst proposals available in three languages ​​(ID, JP, VN) increase 25% for each Fund + Eastern Hemisphere proposals are widely voted on and receive funding with a 25% growth over the previous Fund + poll results show a 25% increase in voter engagement over the previous Fund, etc\". So I think the only thing that still needed to be clearer would be how this information would reach our community members. It would be necessary that all this data, which in short demonstrates whether the proposal had indeed had a palpable impact for Cardano, reaching the objectives of the challenge, would be presented, for example, during a Town Hall. That said, I think the information on auditability is quite valid, varied and detailed, it would just be necessary for the proponents to make it clearer that all of this would be presented to the members in our ecosystem.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 10, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1838, "q0": "This proposal addresses the challenge by having inclusivity with the Eastern Hemisphere to participate in Catalyst proposals and voting. The team’s target audience is for the Japanese, Indonesian & Vietnamese Cardano community. The proposer stated due to language barriers, the voters were having difficult decision to vote in Catalyst because their vote may cause into voting to scams or misaligned incentives. The proposer intends to translate into Japanese, Indonesian & Vietnamese language for their community to understand and vote better in future Catalyst voting. This will be added value to the Cardano community as it adds inclusivity and hence bringing more East Asia participants to the Cardano ecosystem. The team have stated the risk on the quality, accuracy to the original content and ease of understanding the translated languages for the respective community. They propose to distribute the translated contents to the community to audit them before finalizing. This also encourages open-source and increase the participation of the East Asian residents with the Cardano ecosystem. ", "q0r": 5, "q1": "The team have the experience and have the members from each country (Indonesia, Japan & Vietnam) to translate the contents. They are part of the Eastern Townhall for Cardano as well. The team have broken down the timeline to incorporate translated languages into subtitles in videos and Catalyst voting within 3-month period. I believe the team able to execute this project as they have previously successfully added beneficial tools for the Cardano community. Since the team will be working together from different countries, the budget requested is reasonable and well broken down where the funds will be allocated for this project. The success rate for this team to deliver this project is high as they have already been helping the Cardano ecosystem for a long time by building tools and they have the experience to execute this project smoothly. ", "q1r": 5, "q2": "The audibility seems possible by increasing voting participation by 25% from previous fund for Eastern voters. However, I’m not sure where they can get this statistic because as I know voters remain anonymous. I have also checked with the Catalyst members in Telegram that the voters’ location is not disclosed. The easy ways to audit stated in the proposal is from 1) the subtitle languages produced/added in the videos 2) Eastern Town Hall Social Media accounts increase followers by 250 new followers in three months. Hard to say increase of voter engagement by 25% when no statistics about voters’ locations.", "q2r": 3, "assessor": "z_assessor_2274", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4281, "q0": "In a continuous endeavor to enhance Cardano inclusion, particularly within communities in the Eastern Hemisphere, I keep supporting this proposal. How to get more people to participate in language-specific IdeaFest and IdeaFest Reels is one of the crucial issues that this project needs to focus on more. Voters must be able to communicate directly with the proposers in order to build rapport and confidence in their own language. Therefore, there will be an \"emotional element\" between the voter and the proposer.", "q0r": 5, "q1": "The proposer team is made up of people who are engaged in the Eastern Town Hall communities. With a thorough budget breakdown and schedule, this plan is a continuation. The schedule, timing, and duration of IdeaFest and IdeaFest Reels are the factors that must be taken into account to increase engagement with the community. Both activities provide two-way interactions between the proposer and the voter, which is more effective than focusing on translated materials or one-way explanation videos. ", "q1r": 4, "q2": "From the auditability standpoint, everything has been provided by the team, but as the community, we haven't seen any clear information either on the website or social media channels about the state of Eastern Town Hall communities, such as member count, total proposals submitted, funded proposals, survey results, etc. Therefore, it's fair to also let the wider Cardano communities know rather than keep the numbers only within the internal team. ", "q2r": 4, "assessor": "z_assessor_2542", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6019, "q0": "The Proposal presents the idea of ​​​​implementing a program to help connect proposers and voters in East Asia. Because proposals come from all over the world, across all continents. Cultural and linguistic differences are the biggest barrier for countries other than English, making it difficult for East Asian voters to understand the content of proposed proposals. The proposal \"Connecting Asian Voter and Proposer\" effectively solves the above problems through a focus on 6 areas as outlined in the proposal. Increasing activity between East Asian residents and proposers, increasing the quality of ballots cast as voters clearly understand the proposal they are seeking, understand what the value of the proposal bringing.", "q0r": 5, "q1": "I completely agree when it comes to the feasibility of the project. The feasibility of the project is high.\nFirstly: the members of the proposed team have experience in implementing programs such as Eastern Town Hall (I am also a loyal audience for this program), experience in PA and vPA, Proposer and experience in Challenge Team Member. Therefore I don't have any doubts about their performance.\nSecond: the cost of implementation in my opinion is extremely reasonable. We have expenses that include video production, marketing, website maintenance, project management. Each expense category is clearly listed for what they are used for. I think that with the current bear market situation, it is possible to consider adding an additional cost of provisioning for ADA slippage, such as 3-5%/total budget.\nThird: The implementation roadmap has clearly stated each milestone and specific work to be done. A well-prepared plan will be the springboard for successful project implementation.", "q1r": 5, "q2": "We have information about who each member of the performance team is, we know what experience they have. This is shown through each program that this group has done in the past. The videos have Each member's contribution is also publicly announced on Cardano Eastern Town Hall's Youtube channel. We have milestones to measure progress such as the number of videos made per month, the number of new followers increased on social media accounts, the number of proposed participants in Catalyst increases. Therefore I fully agree with the auditability of this proposal.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 8458, "q0": "The suggestion brings up the point that there is a lack of trust in the sources of papers before to and during voting because of the existence of language barriers and cultural differences. The problem is going to be solved by the project by making credible information available in the culture and language of the area in an effort to assist voters in correctly understanding the proposals. It fulfills the requirements of the challenge by supplying places and translations of papers to particularly assist Asian communities all the way through the voting and proposing process, in addition to supplying a community base for specific language groups. Individuals who in the past may have had feelings of exclusion from the catalytic community will be more likely to join and participate as a result of this change. In addition to that, they have effectively demonstrated the work that they have done, which demonstrates that the project needs the support of the community in order to be successful. In my opinion, this idea will have a significant effect on the Catalyst as well as the greater Cardano community since it will make it possible for non-English speaking communities to participate. As a result, the ecosystem will benefit from having more variety and less centralization.\nThis is a project that comes highly recommended from me due to the aforementioned reasons.", "q0r": 5, "q1": "The project strategy for the three-month effort is laid out in great detail and specificity inside the proposal. The work that was supported by earlier grant rounds is going to be continued with this application. Previous proposals have been successfully implemented by the team. The number of people working on the project is substantial, and each one has a wealth of relevant expertise . The budget is quite straightforward and specific, and it is tied to the various stages of the execution process. The team is aware that several components of this proposal have specific requirements that must be met, one of which is a translation that is both accurate and intelligible. In addition, the proposal has anticipated the potential difficulties that may arise and has presented a solution to these issues in the form of a plan.\nThe suggestion, taken as a whole, is extremely plausible.", "q1r": 5, "q2": "The group has presented its objectives in a manner that is measurable, making it possible for the community to simply monitor their progress. KPIs are meaningful when combined with qualitative and quantitative measures of achievement. The URL to the website is provided, and both the links and the videos that are connected contain quite a bit of information.\nOne suggestion that I have is that the team should compile the results of the surveys and any discoveries that we get from them into a document and then make it available to the community so that we can get a better idea of how the project is developing. If this proposal receives funding, the community could easily check the progress of the proposal and measure its performance and success simply by checking the content that has been created and monitoring the metrics that have been provided as goals for success. \nIn general, I have faith that the project will be a success if it is funded using the detailed plan that was shown before.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9335, "q0": "It is suggested that you provide reliable information, before and during voting, for the community in their local language and culture to help voters understand the proposition I see as appropriate to address this issue. subject is reported. But how specifically will your team implement them? I think more detail is needed. You have just stated the goal of the project and presented the solution in a general way that events to connect proponents and voters is a necessary and important task to be completed as soon as possible. the sooner the better. So how will people connect with each other? Where will the event take place? How? I think you should be more detailed.", "q0r": 4, "q1": "In this FEASIBILITY section, you have presented well. I see that this section has answered my questions above. You have a detailed plan within 3 specific months. The budget table you present is easy to see, divided by each job with the corresponding amount, but I do not see the time measurement. Besides, you don't have a total cost at the end. You should do this so that people don't waste time adding up the money. Team information is also detailed in this section.", "q1r": 5, "q2": "I agree that the tool to measure your progress is the voter survey. But how will you report the results of the survey? How will you update so people can follow? Your advantage is that you already have specific goals and specific percentages to measure the success of the project. In your proposal you write that this is actually a follow-up to the East City Hall proposal which is continuously funded from Funds 6, 7, 8 and now 9. and in the previous Proposal Link: https://cardano.ideascale.com/c/idea/399473 that you guys provided I don't see anything there.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9865, "q0": "Language differences and cultural exclusivity prevent governance initiatives from scaling globally. In Catalyst, this is also a problem to be solved, especially in Asia and non-native English-speaking cultures. Proposing to produce content including subtitles in three languages (ID, JP, VN) connecting proponents and voters is a necessary and important task that must be completed as soon as possible to support community participation as a unified space. Proposals that match the challenge posed help Catalyst increase the quality of votes and avoid a culture that dominates the story. The ability to impact at scale when producing videos in a variety of formats and languages.", "q0r": 5, "q1": "A blueprint covering 3-month progress and milestones as outlined in the proposal, working with Catalyst AIM to provide recommendations with explainer videos to voters, including subtitles in three languages in voters' tools. It shows that the project is highly feasible. The core team is people with great experience who have worked on many projects in Catalyst. Especially since they come from many different countries, this collaborative effort brings a wealth of cultural and technical experience to Cardano. A 3-month budget breakdown is given but not clear. I need the project to provide specific budget information in the 6 project sections given. Example: 1. Continue to produce videos in various formats of Voter Education: $4,000. Need to be clear about the number of hours worked, the cost per hour,... It is known that this is a continuously funded project extending from Fund 6, 7, 8, and now 9. But the link given is not available specific numbers mentioned above. The project does not have many risks because it is completed in Fund 6, 7, and 8 with an experienced team.", "q1r": 4, "q2": "The goal of the project is to increase to 25% with the number of Catalyst proposals available in three languages (ID, JP, VN), funding proposals, and survey results showing voter participation. It fits perfectly to see the success of the project. The community can track project progress with social links available from previous Funds. Hopefully, the project works to build community in the Eastern Hemisphere in the long run.", "q2r": 5, "assessor": "z_assessor_3119", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10823, "q0": "I think this is a good idea, it has the potential to achieve the goal of the challenge. This proposal will address the language barrier in the evaluation of the proposal. Besides, the project also wants to create an event to connect proponents and voters. The proponent introduces the proposal relatively fully, and the contents to establish trust between them are also clearly presented. However, in the project's risks section, the proponent has not provided clear solutions to solve.", "q0r": 4, "q1": "The project will be implemented in 3 months. The main tasks for the first 2 months are exactly the same. However, we see the content of the plan is still not detailed. Many tasks need a better explanation of how to do them and who will be responsible for them. I am satisfied with the budget table the proponent provided. It is informative enough for us to know what activities the budget will be allocated to. Talking about the project team, this is a group with many members. In general, all have experience in blockchain technology, especially experience related to Cardano. But, as commented in the previous section, we would like to know the role of each member of the project", "q1r": 4, "q2": "Project KPIs are also explicitly provided by the proponent to measure project progress. All indicators are very realistic. This proposal is also a proposal continuation of the continuous funds Eastern Town Hall proposal spanning from Fund 6, 7, 8. Again, we would like the proponent to provide more information on how the Cardano community can track these developments. KPIs mentioned.", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10968, "q0": "The proposal identifies the problem very clear and I agree that language can be a big barrier for voters to vote. It is important to make a bridge as a tool to help good projects being presented and got voted by communities. This effort will add value to Cardano ecosystem and also can be a good way to give spotlight for good proposals too. The key matrics and goals of the proposal align with the challange and very on point. I think this can be a good thing to unite the communities when languages problem can be solved.", "q0r": 5, "q1": "The proposer provides references, links and also have a solid team to implement the plan. The budget also outlined clearly and broken down into identifiable items. The budget also reasonable to achieve the set goals. I just found that the marketing and communication budget is pretty big. It can be great if the proposer can give some more details with that part of the budget arrangement. Great timeline with a sensible and conductible plan for implementation and also describing the resources needed to implement the proposal. The proposer also has considered challenges and risks relevant to a successful implementation.", "q1r": 5, "q2": "The metrics/KPIs are great and achievable. I think it still important to have an accessible public channel to report monthly to the communities. The proposal describe the measurable targets and the same time offer good solutions to the problem. This proposal can help to expand communities, but also increase the participation of Cardano communities member. They can involve more as voters and maybe have some new ideas to make proposal themselves.", "q2r": 5, "assessor": "z_assessor_3213", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11067, "q0": "Language differences and cultural exclusivity prevent governance initiatives from scaling globally. Faced with that situation, you made a proposal: \"set up a process, format and event stage for the introduction of voters and proponents\". Your proposal is meant to bring voters, proponents and proponents closer together to establish trust between them. I find this a very good proposition because it is only when voters engage, encourage and communicate with the proponents that they can fully understand the benefits of the proposal and then they will become spread the intention of the proposal to the community according to the writer's thoughts. You have given some possible risk that the quality of the incorrect translation will cause the voter to misunderstand the intentions of the proposer, your risk-reducing interpretation is quite appropriate. fit.", "q0r": 5, "q1": "I have read very carefully the solutions you offer, I would like you to clarify the content to help the ADA holders understand the importance of voting according to you. I strongly agree with you the need to conduct periodic surveys and user research to help understand individual attitudes towards Catalyst and the proposed formats available to help voters and users alike. proposals to better understand each other, avoiding the situation where voters randomly vote without understanding the meaning of the proposal. In my opinion, when creating a language translation link to countries, you should have a representation of their local culture to help voters understand the proposal better. I completely agree with you that you need to socialize the content and messages of voters on social media channels to do well in communication and marketing. You guys have built a very detailed plan, specific to what needs to be done, which I find very feasible. The detailed budget analysis for the project does not specify expenditures, there is no total budget for the whole proposal. Please clarify this content so that we can understand.", "q1r": 4, "q2": "You have provided some information to measure the outcome of the project. In my opinion, to provide information to measure the progress of the project, you need to be based on the milestones in the plan to be able to control the progress. The effectiveness of the proposal, I think, is that the reviews that focus a lot on the valuable proposals then show that the voter's capacity has been increased. This is a follow-up to the East City Hall proposal, which has continued funding from Funds 6, 7, 8 and now 9, I see a very high probability of success, I support the friend.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 14012, "q0": "The larger development of the Cardano community is, the more plentiful proposals are sent to the community in order to be financed. In other words, many proposals are sent to Cardano from many countries all over the world. They are all translated into English as the popular language but due to the differentiating cultures from many civilizations, there might be the misleading from the voters or the proposers. It is understandable whether one party or both parties are not English-native speakers so that making a mistake in word choice is possible. Thus, some terrific proposals might be omitted due to the misleading sense. This would be a huge intangible barrier for developers who are not English native speakers to access more opportunities and difficulty in progressing their idea. The idea in the proposal has offered a solution that the team proposer will organize a process, format, and event stage for associating the developers and voters in East Asia. Thus, the developers can be assisted to indicate their proposal and deliver the value from their proposal to the voters and convince the voters to support them. The proposer has indicated the investigation in Asia and came up with the result that in the Japanese community the biggest problem of Catalyst voting was the lack of Japanese support (45.61%) in order to support the reason why the proposal should be financed. By the way, the predicted potential risks are also included with the corresponding solution in the description. I think it would be a big pity if we omit an outstanding proposal like this one. Because its success will engage the trust between the developers and the voters as the voters understand what they are voting for and supporting for. Thereby encouraging the developers as well as proposers to create plentiful meaningful proposals and contribute to the Cardano community.", "q0r": 5, "q1": "I had to say wow when looking at the capacity of the members in the team. They come from a variety of countries like Indonesia, Viet Nam, Australia, New Zealand, etc. They are divided into two main teams: the core-team and the consultant team. The proposer has explained the team working style and their strengthening in detail. I am quite impressed by the sentence “no roles, no leaders”. It sounds like all members are equal and all are essential for the project. Moreover, the experience of the team in organizing events like the Eastern Town Hall made me feel more secure in their capacity. Definitely, they also have diversified experience in being PA and vPA. Hence, I expect a lot from their proposal. On the other hand, the budgeted plan and detailed plan provided a full explanation for the roadmap with important key milestones and all the incurred costs with the computing formulas. That convince me a lot!!!. ", "q1r": 5, "q2": "The team has listed the estimated proportion and number of new followers that is predicted. This would assist people in the community to observe and follow up their progress. After the estimating duration, we can make evaluation toward the proposal’s results objectively based on those predicted numbers. Moreover, the proposer also provided the references link of the team’s previous project which was successful to be financed in from fund 6,7,8. This time, the team is really confident in the percentage of being financed again and I appreciate this. They are such talented individuals and this proposal is a tremendous project too.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14102, "q0": "Proposal is good as its discuss the major concern or we can say that it discuss the national issue ,this type of forum used in national and political aspect. The given problem Language barriers and cultural differences creates a lack of trust on sources to rely on before and during the voting period is not addressed properly ,proposal is not giving aspect on basic knowledge ,target audience , concern areas ,current behaviour of people also the content of proposal ,hence this creates mass mug up in things and leads to slow and failed implementation of plan .Any aspect gets miss leaded then it can create blunder .Who can vote ,to whom to what ,current major issues must be include in plan and detailed answer is missing in proposal .", "q0r": 3, "q1": "The team is plan having is well experienced and well knowledgeable .They have good and knowledgeable mentor ,teacher , also they have block chain expert,   Software Developer, Cardano Foundation Ambassador for Indonesia, Cardano Indonesia Community Manager, Eastern Hemisphere Town Hall Team. also they have members from different different countries and they are market expert as well as well knowledgeable in communication as well as in software industries .They also consultant team from which members are of France and England .but the plan they provided is not adequate for success of proposal as its not providing detailed information about step by step process .Hence we can say that Given experience is well enough but provided plan presented it is risky this proposal will be implemented successfully.", "q1r": 4, "q2": "No , as per my view provided information is not sufficient for audit the progress and success of proposal , as no details regarding  guaranteeing that the translation quality is not just translated correctly but can be understood easily by their respective community and represents as close as possible to the original source material. no step by step process and functions are not available to measure running process .its also failed to provide information of political behaviour and social culture ruling in particular country . also month wise plan is not good hence it is difficult to audit .", "q2r": 2, "assessor": "z_assessor_3902", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Provide reliable information, before & during voting to communities in their local language & culture to help voter understand the proposal.", "experience": "Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Proposal Assesors (PAs) & Veteran PAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain Devs, Plutus/Atala Prism Pioneers, Educators and Accountants"}