{"id": 417268, "author": "lionmode", "title": "Cardano Bridges in Japanese", "url": "https://cardano.ideascale.com/a/dtd/417268-48088", "category": 26602, "amount": 5800, "description": "Japan has a large Cardano community, but the major Cardano bridges do not yet have any Japanese localization. This limits the Japan community's ability to access these parts of the ecosystem.", "f6_no_assessments": 7, "f6_rating": 4.0476190476190474, "videos": [], "media": [], "f6_assessments": [{"id": 1119, "q0": "The proposal is very straight forward – the translation of all textual content of three major Cardano bridges into Japanese in order to facilitate ease of use of these important aspects of the ecosystem for the Japanese Cardano community. Many users currently rely on Google Translate to navigate the interface of the Cardano inter-chain bridges, which can result in unclear translations and confusion. Having a built in Japanese-language interface will allow more Japanese community members to use these bridges comfortably. \n\nThe presenters have years of experience in creating translations related to Cardano and blockchain technology. They have already began contacting the first parties (SingularityNET, Iagon, DcSpark) for their cooperation in the implementation of the translated materials which shows their determination in achieving success on this project. And in the event that one of these first parties is unable or unwilling to implement a Japanese language toggle (which is unlikely as they have worked with them in the past) they will provide guide documents with the translated material to be used as a reference when using one of the aforementioned bridges on their own site/repository.\n\nThis proposal meets the Challenge in helping the growth of the Cardano community in Asia as it will provide the correct information to utilize bridges by removing the language barrier for Japanese community members.", "q0r": 5, "q1": "As the proposers have already implemented similar projects in the past, they have laid out a clear timeline for this proposal. The budget could perhaps be broken down a bit more with additional details for clarity (I would have liked to see how many translators and programmers will be working on the project and how much each is being paid), but the budget is realistic in terms of what needs to be done and how long it takes to do it. \n\nThe team is more than qualified to undertake and complete the proposal as they have been working on Japanese translations of Cardano based projects for over 5 years. They have translated and provided support for multiple Wallets, including Yoroi and Flint. \n\nAlthough many are familiar with the translation work of Leo King/L1ONMODE I do think providing some sort of CV of the principle team members, either on the proposal or on their website, would help instill a better sense of legitimacy and confidence in voters.", "q1r": 4, "q2": "The timeline and milestones for the project have been presented in a clear manner. The team will update the progress of the translation work on the three target bridges on their website, so it should be very easy to audit these KPIs. Any community member or verifying auditor can check the progression and execution of the project as it develops and ultimately view Japanese-language toggles on each target project's interface.", "q2r": 5, "assessor": "z_assessor_2207", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 1920, "q0": "The proposer identified the apparent language barrier problem in the ecosystem - especially in East Asia countries. I believe this problem is valid, but unfortunately, the proposer does not share any supporting data or documents on their findings. To translate both SingularityNET and Milkomeda into Japanese, especially Milkomeda - I believe a further collaboration with (for example) the DCspark team in Japan should be considered as the proposer mentioned in the proposal. With an assumption that the Cardano Japan Community will use the bridge in the near future - this proposal will align with the Challenge Campaign and bring value to the Cardano Ecosystem as a whole.", "q0r": 4, "q1": "Team: The proposer shares the link to their website but unfortunately, there is nothing I can use as an assessor to confirm their related experience to implement this project successfully. The team is also not mentioned both on the website or in the proposal. A name was mentioned \"Leo King\" as the team leader in the past, claiming to do some translation for Yoroi and others - but again - Unfortunately, there is no proof or evidence that I can use to verify.  I would suggest the proposer shares more details, or at least their proof of past work they are claiming. \n\nBudget: Budget was not breakdown and more use guestimate - I believe the market is around $0.13 - $0.15 / word but the proposer seems cannot find the total word need to be translated on those 3 bridges. With a total of $5,800 including contingency, but without a detailed budget plan - this budget can be short or too much. I would suggest discussing further with these 3 sites and sharing a more detailed budget plan.\n\nTimetable: as for the timetable, again without knowing how much work it's going to be, it is very hard for me as an assessor to asses this proposal. ", "q1r": 2, "q2": "The proposer as mentioned above was not clear about the timetable, and how much work they are going to face to translate these 3 sites. So as an assessor, it is very hard to assess this proposal. For auditabiliy, the proposer share that the progress can be tracked via their website - which I OK, but not easy for the community to track every project on different sites. I would suggest using the Cardano Forum thread or Github Project to make life easier - and the result can be posted on their website.", "q2r": 3, "assessor": "z_assessor_2289", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2071, "q0": "According to the proponent, the Cardano community in Japan is very large, but not many Cardano documents are localized in Japanese, which limits the community's ability to access the Cardano ecosystem. The solution is to translate Japanese for all display text, UI elements, error messages, text input fields, and other fields that require translation on each of the major Cardano-enabled interchain bridges. Specifically, this mission will include the SingularityNET, Iagon, and Milkomeda bridges. This proposal's problem and solution statement is presented simply and clearly, and I agree that the proposal effectively addresses the challenge.", "q0r": 5, "q1": "The feasibility of the project is average. This way the roadmap is a little different from other projects, which means that the author outlines the work to be done and the deadline to complete the work. The author says that doing this project consists of 4 steps, but I think it would be better if in those steps in addition to stating what needs to be done it also includes who will do it. It would be better if the steps are explained in more detail so that we can have a solid picture of the process. Example in step 1: Contact each of the first parties to explain the process and get a list of strings. Who are the parties you will contact? Who will be in charge of this task? The same goes for the other steps. As for the budget, $5,800 was requested, which I think fits well with the recommendation based on the work the team describes. Finally, about the team, the person who wrote the proposal is Leo King, he is the head of the L10NMODE team, and this will be the team to implement this project. L10NMODE is introduced as a team of translators and writers who have been working in the Cardano ecosystem for more than 5 years. It would be better if the proposal provides some specific information about the members who will be involved in this project, about their names, experiences, and fields of activity as well as links to individual pages of members, which will make it easier for us to see if the team is qualified to carry out this project.", "q1r": 4, "q2": "The project's success is referred to as \"Each of the 3 target bridges has Japanese language support enabled, with no missing text or incorrect translations, and the Japanese community is freely making use of the bridges\". The community can track the project's progress based on updates on the team's website http://lionmode.io. It would be more convincing if there were some KPIs to determine the success of the project.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5666, "q0": "Taking into account the workload in Asia, I recognize that more needs to be done to capture a large part of  Asia. Therefore I think this is a strategic initiative that supports the overall goal of fund 9 challenge. The underlining focus of this idea is to create Japanese translations for the most popular Cardano bridges and follow through to ensure the text is implemented. All visible text, UI, error messages, input fields, etc. will be translated. Based on the aforementioned I foresee that this initiative would provide easy access to resources and educational materials to the Japanese community in their native language, ensuring the onboarding of more people into the community to take up roles that advance the growth of the Cardano community. The demands of this project would require more Cardano based educational resources; in respect of that, the team has also detailed plans to liaise and network with key stakeholders to get all available resources to ease the translation process. The missing element in this project is a strategy to attract more attention to this  project upon its successful completion. How does the team intends to attract more audience to this project? I suggest the team provide clarity here. In recent times, social media has been great for advertisement; therefore I suggest the team consider social media as a marketing strategy.", "q0r": 4, "q1": "The roadmap outlined for this project is very elaborate and comprehensive. It provides all necessary information on activities to be carried out. As with every project, this proposal presents specific timeframe for each activities within the framework of the project. In all, the design of the roadmap is divided into four, indicating clearly a work structure for the start and the end of work. More importantly, the team profile presented indicates a group of professionals with vast work experience and expertise in the field of language translation within the Cardano community. The link to their site confirms the detailed work experience provided within the scripts. Therefore, this suggest that, the team has enormous work experience and track record working on projects just like this . Additionally, the proposer presents a concise budget with the necessary allocation to each item required for the project. However, the proposer failed to provide a clear breakdown of some items budgeted for. For example, on transcription, I prefer the team allocate transcription per word of $0.15 (this includes transcription, editing, publishing). Aside that , the proposer failed to include key items such as miscellaneous expenses, team expense and contingency allocation. Therefore, I suggest the proposer include these items to enhance the budget of the project. Beyond these observation, I think it's likely the project would be implemented.", "q1r": 4, "q2": "From the information provided on the auditability of the project, we’re not told whether the information on the progress and success of the project would be made available to the community for their perusal. However, I’m impressed with the details presented on the parameters for determining the overall performance of the project. In that regard, the proposer cites indicators like, “whether the Japanese community is freely making use of the bridges, whether there is no missing text or incorrect translations and others\", as the parameters. In my view, these parameters are more qualitative and more precise approach to monitoring and tracking the progress and success of the project. Again, I suggest the team consider making information on these parameters available to the community via the catalyst social media channels for the assessment of the progress and success of the project.  However, I wish the team assigned some milestones to enhance the auditing process. ", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6386, "q0": "For such a lean asking amount -- $5,800 -- this project is sure to expand Cardano in ways aligned with the Challenge, of helping onboard more East Asian members into the ecosystem to foster establishing a stronger base there. As a language enthusiast and polyglot myself, I understand and have experienced many times the breakdowns and confusion in meaning of running anything through Google Translate, so I understand on a personal level the importance that having native language, appropriate translations, such as on bridges like SingularityNET, Iagon, and Milkomeda that the Proposal cites, will be for the expansion of Cardano, especially to a market as strong as Japanese speakers, comprising 128 Million native speakers, some even in the Americas. \n\nTranslation projects like these are valuable to increasing wallets, stake pools, and all-around awareness of Catalyst and Cardano, as the Challenge seeks, therefore this project has strong Impact.", "q0r": 4, "q1": "The team has proactively started coordinating with necessary parties (cited are SingularityNET, Iagon, dcSpark), so the project is ready to begin. Further, the team are experienced translators not just in general, but most importantly already specifically to Cardano and blockchain, therefore the struggle with many jargon or technical words are likely already out of the way. \n\nThe team has laid out a realistic timeline to complete the project, with an appropriate budget breakdown of costs. \n\nThat high experience of the team, spelled-out timeline, and cost breakdown render this project excellent in Feasibility. ", "q1r": 5, "q2": "With the broken-down timeline explained, the team plans to publicly share their progress on their website, which would allow anyone to follow their progress at any of the four/4 time points along the way. With the nature of the project culminating in all translations being live on all 3 bridges (SingularityNET, Iagon, and Milkomeda), one could further verify the project's completion in a timely manner. The only reason I don't give the project a perfect score on Auditability is due to the section being so short and not expanded upon much, which is understandable for a simple project, but a few more sentences in each section than just one, elaborating a bit would have ensured perfect Auditability. ", "q2r": 4, "assessor": "z_assessor_2814", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11142, "q0": "It is a fact that Japan is very open to Cardano when the Cardano community here is very large and many people hold ADA from the beginning. With what the community has shown, I believe they deserve a better experience when participating in the Cardano ecosystem. This proposal aims to create Japanese translations for the most popular Cardano bridges, such as SingularityNET, Iagon, and Milkomeda. Therefore, the Japanese users will have the most positive experience when using the Cardano bridges. The community in Japan will not need other translation tools like Google Translate or Microsoft Translator because they are both inconvenient and ineffective.", "q0r": 5, "q1": "The brightest point of this proposal is probably in the project participants. It is great that they have been working and developing the Cardano ecosystem for 5 years. With the amount of time the team has contributed to Cardano, their professional experience is unquestionable. However, it would be better if the proposal mentioned more specifically the number of members involved in the project. This is very important because it is undeniable that human resources are an important factor for the success of a project. It's commendable that the proposed team provided a detailed plan and anticipate the risk. However, there is currently a risk associated with ADA slippage. What I mean here is that the decreasing of ADA price can lead a budget shortfall for the project. I suggest that the proposed team should ask for an extra budget reserve in other proposals, especially when the market is volatile.", "q1r": 3, "q2": "Fortunately, there is a website attached to the proposal and an update will be posted to the website at each certain milestone. Therefore, the progress of the project can be easily verified by everyone. However, it would be better to have specific metrics and KPIs. This is very important because the metrics and KPIs can help people measure project performance. In my opinion, it would be great if the team learnt from other proposals to improve this section, making the proposal of the team even better.", "q2r": 3, "assessor": "z_assessor_3225", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12402, "q0": "The issue brought up in this proposal is the lack of Japanese language support on major Cardano bridges. I think it’s a relevant issue since it can be a hinder to the adoption of the Cardano ecosystem, specifically for the Japanese demographic. And the proposed solution is to provide Japanese translations for several Cardano bridges, specifically SingularityNET, Iagon, and Milkomeda. The main obstacle for implementing this project is integrating the translated work with the site which will need cooperation from the first party developers. That being said, the proposer claimed to have contacted and worked with some of the teams in the past (didn’t mention specifically which one) where they provided the translated text via the first party Github repo. Worst case scenario, if the translation doesn’t get implemented directly to the site, the end product of this project will be a documentation of the translated text accompanied by the English interface. This worst case scenario does affect the potential quality of the deliverable quite heavily and in turns the value of this project as well. Overall, by providing accessibility options for more Japanese people to use Cardano related services, it can grow Cardano’s outreach and further its adoption from the Japanese demographic, which is in alignment with the challenge setting objective.", "q0r": 5, "q1": "The team member claimed to have worked on translation project for Flint and Yoroi, which is definitely a very relevant skill and experience for the implementation this project. However, there were no explicit evidence (e.g. links to their work) provided in the proposal. The proposer mentioned that their work does exist in a Github repositories when they were working with other developers in the past, but I’m guessing it is made private since there were no links regarding this translation work. I definitely would have liked if their past work was linked in this proposal in some way to back up their claim.\n\nThe roadmap has been laid out into specific timelines and their respective milestones, such as getting the English string from the first party developers or manually from the website, the translation work, Japanese text integration, as well as revision in the span of 9 weeks. The proposer has explained in details on how the initial English strings will be obtained and how the translated work will be integrated to the website by first party developers. With the clear and sensible roadmap, the project seems feasible to be completed in a timely manner, \n\nThe budget has been broken down into several items, including fee for translation works and implementation with first parties. The items have also been detailed further into what tasks are involved in each item of work. However, information like total workhours and requested hourly rates would have been preferrable since they can give a clearer picture as well as provide justification for the budget numbers.", "q1r": 4, "q2": "The project’s progress will be tracked by the completion of the key milestones mentioned in the “Feasibility” section via their website that has been linked in the proposal. This makes sure that the project is transparent and can be tracked easily. The KPIs chosen for measuring the project success is the accuracy of the translated work. The chosen metric is adequate but more explanations regarding how it will be measured would be appreciated. For example, will the accuracy of the translated work be measured via internal review (i.e. by proposer or first party developers) or will it be external review (i.e. by users, or external review, or etc.). ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create Japanese translations for the most popular Cardano bridges and follow through to ensure the text is implemented. All visible text, UI, error messages, input fields, etc. will be translated.", "experience": "We are a team of technical writers and translators with many years of experience making contributions to the Cardano ecosystem, including the Japanese translations of Yoroi wallet, Flint wallet, and the Milkomeda onboarding documents."}