{"id": 417263, "author": "easterntownhall", "title": "Eastern Town Hall Team Operation", "url": "https://cardano.ideascale.com/a/dtd/417263-48088", "category": 26602, "amount": 22500, "description": "Participating in Catalyst is difficult when you live in the Eastern Hemisphere Time zones where English is not the main language.", "f6_no_assessments": 16, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 3459, "q0": "As very well pointed out in problem statement, timezones and language barries are indeed a challenge for people in eartern hemipsphere to participate in the Cardano THs. Therefore, the need for one dedicated to his side of the globe has emerged and been in place since past funds. As for this necessity and the growing importance of these meetings to Cardano community in Asia, keeping this project alive is key to Cardano reach its mission in this continent. Having said that, the fit with the challenge is very clear, as it will estimulate the participation of Asian members in Catalyst, addressing most of the challenge kpis (for example, \"The number of proposals originating from East Asian participants in Project Catalyst\").\nAs suggestions, it could be added here some general numbers on attendence and growth in regard to the latest townhalls to better understand the importance and egagement. In addition, it could be indicated what improvements will be made in relation to last funded proposal, taking into consideration the feedback from community, and how these improvements will be made. In addition, it could also be ellaborated a sort of guide/workbook on how this townhall was initially implemented and what are the lessons learned so far, so it can be replicated in other regios that suffer the same problem.\nAll in all, in spite of these minor suggestions, I think proposal covers what matters the most and I completely agree with it. My rate is 5", "q0r": 5, "q1": "There's a well strucutured plan, consireding the main acitvities for each of the 3 months, which are mostly recurring. It's good they'll have breakoutrooms for specific regions east asia, which helps to, at least partially, address the language and cultural differences.The expansion to Korea or Singapore is also much welcomed, expanding Cardano and Catalyst outreach.\nBudget breakdown is also properly done, explaning well what is included in each workpackage and saying the amount of hours required for the applicable acitvities. It also matches project plan.\nIn relation to the team, there's a big core team (10 people) who already run this initiative and experience with Cardano and Catalyst. In addition, there are also 2 consultants with good network of contacts in Cardano globally. \nAll in all, feasibility sections covers well all its points and my rate is therefore 5.", "q1r": 5, "q2": "There are 2 main metrics proposed based on the growth in relation to last fund, which makes a lot a of sense, since the goal is to keep expanding and improve over time.\nOther ways of verifying project progress are also suggested by proposer, including surveys to check  number of voters and proposers and expert and spending reports, which is great because show they take budget management really seriously. Moreover, the TH will be open to the community so it's possible also to anyone see if they are happening according to the pre-defined frequency. githubs links are also provided, which apprently is where they intend to report all the project tracking.\nThe auditability section is detailed and complete enough to audit this project. ", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3610, "q0": "The two countries proposed to mention are Indonesia and Vietnam in the development of Cardano in the Eastern Hemisphere.\nThe problem solution is implemented according to the right challenge. By creating \"Eastern Main Exam Hall\", to conduct community meetings, organize events to introduce Cardano, in each country, live experience learning their culture and language .\nThe proposal will be to bridge groups in different countries to share and grow the team and all things ADA related.\nYour ideas are very lively and close, it will help the communities in other countries understand and get closer together, all language barriers will be removed, only the consensus will remain to develop Cardano together.\nThe goal is to remove the language barrier, but this is the risk that could prevent the proposal from developing. But if this barrier is overcome, the proposal will create a strong and united Eastern Hemisphere Cardano team", "q0r": 5, "q1": "A detailed plan is developed with specific plans for each month of development and construction in Indonesia, Singapore / Korea / Philippines / Thailand, Japan, Vietnam, with English as the focus.\nThe thing I don't understand in this blueprint is that all 4 target timelines talk about breakthrough goals for Indonesians, Singaporeans/Korea/Filipinos/Thailand, Japan, Vietnam and English England but every month builds a different community.\nThe budget table allocates all the costs involved in organizing events in different countries.\nTeam members with all components in East Asian countries, the information given to the members are all people with a lot of experience in technology and blockchain, with a proposed member who has received Catalyst funding from Funds before. These things prove that they will do and do well on this project.", "q1r": 5, "q2": "Financial statements on revenue and expenditure activities will be publicly reported and translated into many languages, the community in which the language is translated will verify the project progress.\nAlso from these reports will turn into the idea of attracting future sponsors, a very bold idea.\nAll daily activities, weekly months, events will be recorded and reported\nThe project's success is defined as a 25% increase in community participation.\nI think recording as detailed as possible about activities adds transparency to the project.\nThe community will know the project's activities, the proposed benefits, they will be convinced and agree to join the community.", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3818, "q0": "Having read through this proposal, the purpose is to continue the work of the Eastern Town Hall which offers a safe place for Eastern Hemisphere communities to learn, collaborate and build on Cardano.\nTheir solution is to build knowledge, share information; connect and support each other, language and culture are not a barrier to participation, etc. \nAddressing the challenge, the proposal stated that by creating Eastern Town Hall, they are taking Cardano initiative to meet the Eastern Hemisphere community where they are in their country, their language and their culture. By doing translations, building community, sharing knowledge, enabling entrepreneurs and growing Cardano which are divided into various proposals. All these efforts have one goal to grow Eastern Hemisphere Cardano Country and the Cardano Ecosystem. The proposal mentioned that the main challenges are collaboration between different cultures, time zones and languages. To mitigate they use tools such as GitHub, Orbit, etc. and open discussions in weekly meetings. This proposal has really addressed the challenge effectively. My rating is 5. ", "q0r": 5, "q1": "The detailed plan outlined in this proposal shows 3 months duration for the project. The schedule is a monthly one and each month has details of activities added with specific timelines.\nThe budget request is $22500 which has been broken down into defined budgets. The amount requested is reasonable. The various budgeted costs cover Hosting bi-weekly coordination meetings, website maintenance, etc. to mention a few.\nThe team is made up of the initial Eastern Town Hall (ETH) Trusted Seed and incoming new members. The team is made up of the core team and the consultant team. The core team has 10 members and the consultant team has 2 members, who are all active members of the Cardano community and have professions like Haskell Plutus lecturer, software engineering, Haskell developers, etc. \nThe team indicated that they will return to Catalyst for further funding to continue to operate the Town Hall and build communities. They also indicated that they are involved in other proposals in Fund 9 and working on a previously funded proposal. With the team's experiences and the detailed plan provided, it is highly likely this proposal will be implemented successfully and my rating is 5.", "q1r": 5, "q2": "Tracking progress in this proposal, the proposers stated that financial reports will be submitted to the community, and pioneer and prototype DAO treasury management reporting. They will report on how the Eastern Town Hall is spending and allocating funds, and help collaborations identify opportunities to the next 3 months.\nThe proposal mentioned that by close communication, coordination, and collaboration with the Catalyst School, the Ambassador's Guild, and the Bridge, they will build a network of community initiatives able to provide an A to Z onboarding process which allows newcomers to appreciate a fast and safe onboarding process. \nThis proposal is a continuation of a previous funded proposal from Fund6, Fund 7 and Fund 9. The information provided is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4437, "q0": "The proposal is in line with the challenging goals of focusing on providing information to a large region - the Eastern Hemisphere, which accounts for 60% of the total global population with many countries with unique cultures and their own language. Because the proposal is about creating a community hubs, this proposal will able to scale to address future challenges as new people with new ideas will onboard. Proposer also provided the progress from latest Fund which is great! We can see their community increasing each time proposer creating a proposal in every Fund.\nProposer also aware about collaboration with another Cardano Community such as Catalyst Swarm, Catalyst School etc. As far as I know they were already creating Eastern Catalyst School to educate their members and newly members who put interest to join to their community.", "q0r": 5, "q1": "The teams are diverse and tailored to their respective country. It's good since it represents the \"decentralized\" term in their community. With those wealth of knowledges and experiences in various roles of the Cardano ecosystem of the team, they have provided a very detailed plan in the proposal. Therefore, the project has a good chance of being implemented effectively.\n\nThe proposal provided a detailed, clear budget sheet for each section that resulted in a total final budget, a budget that was reasonable given their expertise and the amount of work to be done. But Proposer should recalculate your budget, because when I checked and tried to add up all the budgets you wrote down, I found that the total budget should be $22,665 and not $22,500. Will the $165 difference in your budget affect your team's payout? Also, since this budget proposal are the same with last Fund 8 but next Fund 10 Proposer want to reach out others Eastern Hemisphere communities, Will EHT add more core team? Is there still enough budget for their work at EHT later?\n\nUnlike the others recurring proposal, this Proposal takes into account the review of the PA in the last Fund and adds the necessary inputs to make this proposal more complete. I have seen an improvement too in this proposal from Fund 8's proposal. Proposer added a detail breakdown about their 'Contingency' and then change it to 'Common Expenses' in this proposal.\n\nHowever, the proposal can be improved by adding links or resources backing the team members skills and experience. Other than that, I have a good amount of confidence in the feasibility of this project.", "q1r": 4, "q2": "This proposal can be audited based on the amount of information given by the proposers. They have provided a detailed roadmap with achievable milestones. The key metrics to measure success are also clearly defined and strong.\nI highly appreciate the way they are using prototype DAO treasury management for reporting the project's activities and expenses. It shows the great spirit of auditability, transparency, and innovation.", "q2r": 5, "assessor": "z_assessor_2553", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6992, "q0": "\"   - I see Cardano today being developed very well. Cardano's influence is far-fetched. However, it is a fact that not everyone knows about Cardano, especially countries that do not speak English. with East Town Hall Team Activity solves this dilemma for people living in the Eastern Hemisphere time zone. I found this to be a very good activity.\n\n   - Here the group has raised the issues that are. Those who live in the Eastern Hemisphere time zone find it very difficult to join Catalyst because English is not the primary language here. I found the issues raised by the group to be well-suited to the challenge. This proposal would be great if extended.\n\n   - The solutions that the group raised are. East Town Hall will provide a safe place for people in the Eastern Hemisphere to learn, collaborate, and build on Cardano. By establishing East City Hall, and implementing the Cardano initiative to meet the Eastern Hemisphere communities where they are, their country, their language and their culture. I found the solutions that the group raised to be very relevant. and I believe this proposal will contribute to solving the difficulties of the problems in the challenge.\n\n  - With the presentation of the difficulties that the proposal may face that is. a combination of different cultures, time zones and languages. and the biggest obstacle is still the use of English as the main communication protocol of all Cardano. However, the proposed topic also has solutions to reduce that risk, which is to create weekly meetings, to introduce, educate and develop Cardano through Project Catalyst and all initiatives. available, driven by the community. I strongly agree with these solutions.\"", "q0r": 5, "q1": "\"   - In the section provide a detailed plan, include progress and milestones. I see the team has identified specific milestones, that is, will complete the plan in a period of 3 months. With the time period as mentioned above, I think it is reasonable to complete the set tasks. Here the goals to be achieved have also been stated very clearly for each month as stated in the proposal. However, I find the progress of the project is not easy for the community to follow\n\n   - About providing detailed budget analysis. with a total budget of $22,500 and has been broken down into 8 different expense items. I personally think such distributions are reasonable. Here the team is also very careful when saving a backup budget of $1000 in case additional costs arise. I think that's also reasonable.\n\n    - With a section that provides detailed information about the people who will work on the project. I see the group has raised 12 members. There were specific tasks assigned to each member. Through research, I found that the experience and capacity of the members are very good, they are very knowledgeable about the Blockchain market, and Catalyst. I think with such a good team, the implementation of the assigned tasks should not be difficult.\"", "q1r": 4, "q2": "\"  - With a description of what you will measure to track your project progress. I see the team has also come up with a few indicators like, pioneering and modeling DAO treasury reports that help solve a very complex problem. Understanding how East Town Hall spends and allocates funds also helps the team attract future funding. I find such indicators to be very complete and I have no further comments.\n\n   - What does the success of this project look like? I see the group mentioned a lot of successes of which 4 main successes are, the members will respond to the community about Catalyst in their respective languages. There will be weekly events, and there will be a monthly spending report. There will be a survey of the number of voters in each district. I find successes like the one mentioned to be very relevant to the challenge.\n\n    - In the funding section. For veteran PAs, everyone knows that this is a follow-up proposal to the East City Hall proposal, which is continuously funded from Funds 6, 7, 8 which is a very reputable group. so I believe the value that the proposal brings. Good luck to the group.\"", "q2r": 5, "assessor": "z_assessor_2856", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"id": 8865, "q0": "As there are lot of bridge gaps that we have seen among cardano members , as gaps might be due language, cultural, regional, time zones. these things are hindering for cardano to widen its opportunity in Asia , Hence to overcome such barriers the proposer wants to the proposer wants to set up town hall meeting on virtual mode where people across the community can join and share their ideas where proposer's team can translate ,share knowledge and help in building community more effectively, the team even wants to update  ETH website and ETH Cardano Foundation Forum so that whole community can be regularly updated, Hence this proposal effectively addresses the challenge\n", "q0r": 5, "q1": "The proposal doesn't have any risk involved in it, where it just needs to set up online call with all the members of cardano who are from different region of Eastern hemisphere , this can be achieved easily however the core team consist of members who are mainly from different regions of Eastern hemisphere, these core team guys and their colleagues can participate and complete this task easily, the proposer's team wants to document and update  ETH website and ETH Cardano Foundation Forum which can also be achieved without any difficulties, the proposed team even wants to do marketing in the virtual meeting which is easy to achieve, Hence with minimal risk involved and given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clear idea on how to break the barriers that are surrounded in Eastern Hemisphere for growth of Cardano Eco system. The audit has introduced all the team members who will be working on this job from different regions of Eastern Hemisphere which is great to hear,\nThe audit has presented its proposed solution in very detailed manner which includes about meetings ,marketing and updating, The audit has presented timeline of the project in well structured manner so that proposed plan can be efficient , the proposal even contains detailed budget breaking scheme for each sectors, Hence with minimal risk involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9108, "q0": "This proposal is a follow-up to the Eastern Town Hall proposal, which is continuously funded by Funds 6, 7, 8. The project team has established the Eastern Town Hall to rely on the community to introduce Eastern Hemisphere to Cardano. They created a place, time and space to share information, connect, support each other, learn to apply technology to meet local needs, guide to use Cardano to grow the economy…Eastern Town Hall as a platform supporting Eastern Hemisphere community initiatives has seen significant growth in various metrics within each of their respective communities. These indicators are as follows and can also be found on their GitHub, for example the growth of the Eastern Town Hall Indonesia is as follows: the development of the various communication channels of the Eastern Town Hall Indonesia acts as the daily discussion meeting and testing ground for DAO programs: Telegram channel growth from 295 to 319 members, Discord Channel growth from 250 to 418 members, biweekly sessions from 15 to 25 regular participants, Recommendations from Indonesia from 4 to 11 proposals… The further growth of Cardano Indonesia which is a discussion group for everything Cardano, from the dApps to the Project Catalyst and everything in between in the form of bi-weekly workshops over Zoom. There are also many figures for other countries. So, I think this proposal fits the challenge's goal, has done it successfully in previous funds and should continue to be funded at this fund. Besides, the proposal also introduces risk and has also taken measures to reduce it and has been successful in previous funds.\n", "q0r": 5, "q1": "The project is implemented in 3 months, with specific work for each month: the first month has two East City Halls with 4 breakout rooms for Indonesian, Singaporean/Korean/Philippines/Thailand, Japanese, Vietnam and English; Have 4 (four) Eastern Town Hall coordination meetings; Start of building the ETH Singaporean/Korean/Philippines/Thailand community…the second month continue to do the same work as in the first month…\n\nThe required project budget for 3 months is $22,500, of which the bi-weekly event costs $9,360, weekly coordination meetings $4,680, seminars and breakout room events 720 USD, marketing and communication costs 1,725 USD…The budget is reasonable.\n\nThe project implementation team consists of a core team and a consulting group. The core team of 10 people are software developers, Haskell developers, software engineers… they are Cardano enthusiasts, are CA, vCA. They have done successfully in previous funds and can absolutely succeed in this fund.\n", "q1r": 5, "q2": "The project team will report activities and costs, which will be translated into multiple languages for easy control by the community. They also set a goal to increase participation in East Town Halls by 25% and submit proposals for each Fund Series in the next 3 months. They will measure this through a questionnaire on the number of proposers/voters/Community Advisors/Veteran Community Advisors which is conducted for each Fund Series in the community of the target country.\n", "q2r": 4, "assessor": "z_assessor_3021", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9764, "q0": "The problem statement is linked to the challenge: the adoption of Cardano by and in Eastern Asia. Just like Africa, the project aims to tackle the challenges that prevents the East Asian Countries from being a Cardano adoption leader rather than a follower; there is the need to enhance the community, which proactively participates in building the Cardano Ecosystem. \nParticipating in Catalyst is difficult when you live in the Eastern Hemisphere time zones where English is not the main language, hence the projects seeks to create a place, a time, and a space where: Eastern Asians can build knowledge, share information, connect and support each other in the Cardano Catalyst Ecosystem. By creating Eastern Town Hall, the project seeks to take the Cardano initiative to meet the Eastern Hemisphere community where they are, in their country, their language and their culture.\nEastern Town Hall aims to sustain, grow and evolve a vibrant East Asian community that is engaged and actively growing its contributions to the Cardano ecosystem.\n", "q0r": 4, "q1": "The proposal provides evidence of relevant skills and experiences needed to implement the project. Given the successful implementation of the Eastern Town Hall proposal spanning from Fund 6, 7, 8 and now 9.\nThe information about the implementation of the project described in the proposal are individuals who possess a wealth of cultural and technical experience to Cardano/Catalyst system. These are active members in Catalyst, and community groups across our ecosystem hence bringing on board experiences in the Cardano/Catalyst system. \nThe budget is clearly outlined and broken down into identifiable deliverables. It offers a realistic timetable to complete the work in three months to achieve the daily goals of daily inquiries from the community about Catalyst that are answered by their members in their respective languages, weekly goals of holding weekly planning events and meet-ups, sharing information about their activities with each community, monthly goals of reporting spending and finally by funding goals of counting the number of voters, proposers and experts in each region eastern community.\n", "q1r": 4, "q2": "There is clarity in the description of the   problem, the solution and how the proposal is aligned with them. The road map is very well designed; there are deliverables/milestones that makes auditing the proposal easier. The metrics/KPIs list are good indicators for evaluating the success of the intended project as the chosen outputs will clearly indicate the growth participation by 25% in Eastern Town Halls, the number of proposal submissions for each Fund Series in the next 3 months, and the number of proposers/voters/Community Advisors/Veteran Community Advisors in each Fund Series in the community of the target country. \nThis will help sustain, grow and evolve a vibrant East Asian community that is engaged and actively growing its contributions to the Cardano ecosystem in close communication, coordination and collaboration with the Catalyst Swarm, the Catalyst School, the Ambassadors Guild and the Bridge Builders, to provide full on boarding process, which allows newcomers to appreciate a fast and safe on boarding process.\n \n\n", "q2r": 4, "assessor": "z_assessor_3093", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10822, "q0": "The Eastern Town Hall offers a safe place for Eastern Hemisphere communities to learn, collaborate and build on Cardano. There is no doubting the positive influence of the proposal on the development of Cardano. This is a proposal that has been funded by funds 6, 7,8. The team described the proposed solution very clearly. Besides, there are specific examples of what The Eastern Town Hall has done in Indonesia and Vietnam. The proposed team also detailed how it addresses the challenge. I think this proposal fits the challenge goal, it deserves funding to continue to grow.", "q0r": 5, "q1": "I am very satisfied with this part of the project. I believe the project feasibility is very high based on a clear and detailed provided plan. We know about: mission, time, and the number of occurrences. The budget is properly allocated. Each money will be explained in detail on how it will be spent, each small activity clearly listed. Similarly, talking about members, the information provided is quite complete.", "q1r": 5, "q2": "This continues to be the very well-done theme of the project. They have a way of measuring the project progress that has been made in the fund before. They have plans for daily, weekly, monthly and by the fund to achieve their goals. In particular, they have clear financial statements. I have full confidence in the success of the project as well as its auditability.", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10967, "q0": "The problem is very clear and important. The proposal articulates very clear and it will add value to Cardano ecosystem. With this proposal, many people could know Cardano better and involves in Catalyst project to expand the ecosystem. The proposed solutions are clear and on point. Based on the history performance, the team execute the project very well and able to expand the community in this project. The goals also align with the challenge settings.", "q0r": 5, "q1": "The proposer provides references, links and also have a solid team to implement the plan. The budget also outlined clearly and broken down into identifiable items. The budget also reasonable to achieve the set goals. The timetable also realistic and arranged in a good pace, not too packed or too slow. There is a sensible and conductible plan for implementation and also describing the resources needed to implement the proposal. The proposer also has considered challenges and risks relevant to a successful implementation.", "q1r": 5, "q2": "The goal is clear, increase 25% of participation. It is also implement daily, weekly, monthly and by fund. We hope that with this project, we could get more people in Cardano ecosystem, increase the number of voters, PA, and vPa in Asia. The plan to expanding the collaboration with Singaporean/Korean/Philippines/Thailand are also very strategic and impactful. The proposal also provides an accessible public channel for delivering regular updates to the community for auditing progress.", "q2r": 5, "assessor": "z_assessor_3213", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11696, "q0": "this proposal is a matured one, validated with continuous effort, and has received funding since Fund 6 of Catalyst. Looking at the sheet for funded projects reporting, fund 6 saw 1 proposal, of which it is marked as completed May 2022. Fund 7 saw 3 proposals, of which 1 is completed as of June 2022. Fund 8 saw 4 proposals, all 4 of which is ongoing. It demonstrates that the team behind this is actively working and committed to the project, scaling to a wider audience for each funding. As a fairly new PA from east asia myself, coming to catalyst in 2022 and learning about it, the problem statement is indeed very valid and relatable. Having support networks in my local community and language would be extremely helpful. \n\nI enjoyed the transparency and the plentiful information provided from the team to demonstrate their track record. growth numbers shows that the project is slowly but steadily gaining traction. my only point of comment would be, to provide a timeframe of the numbers within the proposal, without having to scour the github page for data. even after scouring their github, i was not able to find data on the timeframe for the growth numbers. was the growth achieved over the past 9 months? or 3 months? this then gives assessors an idea of the projectile and how steep the growth curve is. \n\nconsidering the established project that has a track record to show for, though the proposal could have been clearer by attaching just a little more information, i will only rate impact as 4.", "q0r": 4, "q1": "The details provided for the funding breakdown is sufficient to understand how will the funds be used. The proposer also demonstrates with their track record that they clearly know what resources are needed to achieve their goals. Team members area also credible and established in the cardano community, with some familiar prominent names that is clearly committed to the growth of cardano having seen them as cardano ambassadors and present during townhalls. ", "q1r": 5, "q2": "the proposer is clear of the challenges faced when it comes to reporting their key performance indicators (KPI) and to being held accountable. They mentioned their ability to report back financial statements, in multiple languages (hopefullly tailored to the east asia region), which is a plus. Additionally, they demonstrate experience when they are aware of current iterative experiments in the DAO space for DAO treasury management, such as those done by index.coop and FWB. i do wish that there can be a dash board to see their KPI growth on a more frequent basis, be it a weekly update or real-time, but i understand that this will consume more resources as well.Thus, a financial statement will be sufficient for now. \n\nFor their KPIs, it is good to see that they have attached a timeframe for their goals, compared to what was presented in the impact section. 25% growth in participation in Eastern Town Halls in the next 3 months, for the resources asked, is realistic. ", "q2r": 5, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11849, "q0": "The proposal is provided with clear description about the problem and proposed solution. Eastern Town Hall acts as a platform to build knowledge and support Eastern Hemisphere community growth. Providing a local community for newcomers and experienced members would greatly support the Cardano community as a whole, providing a safe place to collaborate and learn without language barriers. \n\nThe proposer provides the project’s focus points, such as content accessibility to many local communities, and their growth metrics in each countries, focusing in member growth in various community channels and amount of proposal posted in Project Catalyst. However, the provided GitHub page to list other metrics for each countries leads to an non-existent page. Please change the link to the one provided in the references ([2] GitHub Eastern Town Hall). The proposer knows about the potential risks, such as coordination between different time zones and languages and how to mitigate them, through utilizing collaborative tools such as GitHub. Overall, this project would give a great impact, especially in East Asia through learning and collaborating starting from local communities.", "q0r": 5, "q1": "The proposer provides details about the people that will involve in the project, consists of the core team and consultant team with experienced members in Cardano community from various countries (including countries across East Asia), that collaborates with other community groups in Asia. Providing GitHub or LinkedIn account from each member would provide more background information and their track record in business world.\n\nThis proposal has a clear and detailed timeline and milestones by providing several Eastern Town Hall sessions with breakout rooms for various languages and building Eastern Town Hall community in multiple countries in 3 months duration. The budget breakdown is detailed, listing various action plans, provided with each overall budget and expected workload. However, the budget number itself is not detailed enough. The proposal provides the information about each action plan’s duration, and amount held in each month, and cost per hour, but lacks clarity about the allocation for each member (for point 1 and 2 in budget breakdown). The number doesn’t adds up if I don’t include the total 13 individuals mentioned briefly in point 1.a. To avoid confusion about the budget calculcation, it would be great if the proposer could provide the member information at the top and clarify the amount paid for each member in each action plan (e.g. held 2 times per month, 2 hours for $60 per hour/member). Other than that, providing budget details for each workload (each subpoint) would provide an identifiable budget. Without these details, I think that the proposer could provide better detail in the breakdown. I do hope that there will be some changes to provide clarity to viewers, since this project would bring a great impact to the community.", "q1r": 3, "q2": "As stated before, the proposal has a clear roadmap and milestones for each month, with scheduled activities mentioned (daily, weekly, monthly) to provide evaluation to the project and published via their website, with translation to various languages with the help from collaborators. The proposer mentioned that this project is a continuation of the funded proposal from Fund 6 to 8, but the provided link to previous proposal leads to a withdrawn proposal page. It would be great to provide a link that leads to the mentioned proposal. The project has a GitHub page and its own website as public channels to deliver regular updates.", "q2r": 5, "assessor": "z_assessor_3296", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13716, "q0": "After going through this proposal, I could see that the proposer aims at offering a place where Asian communities can connect and collaborate and add to the Cardano ecosystem. \nThese Town Halls are already operating and benefitting the ecosystem so they want to continue the good work. \nThis challenge has a goal of bringing Asians on board so this proposal is doing a good job by helping to get more people on board to grow Cardano.\nSome few risks were explained and how to cub them.\nI will say that this proposal addresses the challenge effectively.", "q0r": 5, "q1": "\nDetailed plan has been written in this proposal. It depicts that this project will last for 3 months. It is divided into monthly duties and understandable.\nBudget is wn \nell presented and gives us understanding of how the funds will be ite\ndisbursed.i\nThe team working on this proposal is quite experienced. They are the main Town Hall team and active members in Cardano. So their experience and plan presented its likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Metrics for measuring the progress and success of this proposal have been provided. Their progress will be on Catalyst channels for the community. \nMeasuring success, the proposal syas they will see a collaboration with Catalyst Swarm and others. More Asians would have joined the Cardano ecosystem.  ", "q2r": 4, "assessor": "z_assessor_3762", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13718, "q0": "The proposer wants to offer a safe onboarding place for newbiew through the Eastern Town Hall meetings. Their idea is that they will educate and provide opportunities for people to collaborate and build the ecosystem.\nThis challenge aims to get more Asians on board Cardano so this proposal will help to get more people and in the end address the goals of the challenge.\nThe risk stated was also addressed well with mitigating measure. This proposal addresses the challenge well.", "q0r": 4, "q1": "This proposal has a plan in place here which indicates 3 months of work to be done, which has been scheduled with specific activities.\nThe budget stated is broken down well into small divisions which is detailed enough. \nThe team consists of 10 members who are from the Catalyst School, Swarm and Eastern Town Hall. They are active members of the community and their experiences all point to a successful implementation of the project.", "q1r": 5, "q2": "This proposal progress of work will be tracked on the Cardano community channels such as Swarm sessions. \nThe completion of the project will bring success stories of close collaboration with Catalyst Swarm and bring in more new people into Cardano. This proposal is a continuation of previous proposals which success is obvious on the output of Catalyst School that is onboarding more people into Cardano and providing training for them to become more engaged in the community. The information provided is sufficient for auditing the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_3764", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14101, "q0": "Yes, the proposal effectively adresses the challenge as, By creating Eastern Town Hall we are taking the Cardano initiative to meet the Eastern Hemisphere community where they are, in their country, their language and their culture. With the help of townhall we may create an atmosphere were all belong to same community, and have same thought of mind. We make knowledge and content accessible to as many cultures as possible\nWe host different events where community members come together\nWe build bridges to underrepresented groups\npeople will  integrate local perspectives to enrich the Catalyst Community and Gathering opinions and data to help us all understand the social issues.\nthere will be better exchange of ideas.\n\n", "q0r": 5, "q1": "Yes, As it is a good plan we may say that plan will be implemented. Because there the people in this area do not have good knowledge of English, hence it will be helpful for them is townhall is been made were all people may gather and share ideas.\nthere will be organised different types of events as to connect with more and more people, but here there are some drawbacks, It takes considerable consideration to create a working environment that both emphasizes high collaboration yet achieves maximum results in the form of benefit given to the Cardano Community in general and most importantly to each community we represent", "q1r": 5, "q2": "Yes, the information provided is highly auditable as the attendence may be taken of the people who are attending the meetings at townhall, we can also see the retention of people who comes regularly for such discussions, As here the the goal is to grow participation by 25% in Eastern Town Halls and proposal submissions for each Fund Series in the next 3 months. to monitor the progress we can also look into: \n\nInquiries from the community about Catalyst are answered by our members in their respective languages. We will translate Catalyst content and publish it via our website. We hold weekly planning events and meet-ups, sharing information about our activities with each community.Our spending is reported. We will manage your finances in a decentralized manner using a multi-sig wallet.", "q2r": 5, "assessor": "z_assessor_3902", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14517, "q0": "\n\n\nThis proposal's idea is to help the Eastern Hemisphere communities to learn and collaborate on Cardano blockchain. \nThey will use their own language and culture to impart knowledge and help entrepreneurs to grow the Cardano by submitting proposals. This idea is the goal of this challenge and it is addressed by this proposal.\nThe proposer has stated the risks and how to mitigate effectively. \nInconclusion, this proposal addresses the challenge effectively. \n\n", "q0r": 4, "q1": "The plan here is well structured showing tasks per each timeline. \nThe budget is well broken down into details showing cost for biweekly Town Halls, etc. It is well done.\nThe members implementing the project have their names and profiles in the proposal. Some of these are Felix Weber and Nadim, who are active members in Cardano community. \nGiven the experience of the team and the plan, it is highly likely that proposal will be implemented successfully.", "q1r": 5, "q2": "\n\n\n\nThis proposal can track the progress of the work through the Town Hall channel and others. \nThe proposal has said that the success will be that there will be a close communication and collaboration with the Catalyst Swarm, and onboarding process on the meetups will bring in new comers safely to the Cardanocommunity.\nThe information provided is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_4061", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "The Eastern Town Hall offers a safe place for Eastern Hemisphere communities to learn, collaborate and build on Cardano.", "experience": "Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain Devs, Plutus/Atala Prism Pioneers, Educators and Accountants"}