{"id": 417260, "author": "ericphan2510", "title": "HealthFI X Cardano - Move to Plant", "url": "https://cardano.ideascale.com/a/dtd/417260-48088", "category": 26602, "amount": 22000, "description": "Forest cover in Vietnam is decreasing yearly, climate change is becoming more extreme, and environmental protection events are still ineffective in raising awareness due to a lack of transparency.", "f6_no_assessments": 20, "f6_rating": 4.283333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1164, "q0": "The proposal addresses the challenge as it aims to increase the usage of Cardano in Vietnam by exploiting NFTs minted on Cardano, using them in a fitness app. More in details, the fitness app is encouraging users to collect coins in proportion to the amount of km run/walked. The coins collected would serve as currency to be spent in order to plant a tree.\nEvery new tree planted is recorded via a minting of an NFT. \nQuestion 1. Will the NFT also be given to the user who spent the coin, demonstrating the user is actually 'owning' the tree ?\nThe coins could also be generated by donors who care about CO2 sequestration/environment/climate change. \n\nQuestion 2.  Do you plan to partner with known organisations such as Treedom, that is already operation in the field since some years ?", "q0r": 5, "q1": "The implementation of the app does not require a high level of programming, as well as minting the NFTs. The big challenge for the team that in my opinion has noot been fully considered is related to land management and tree maintenance. Who will grant you the land and how do you plan to sustain the tree growth ?\nThe funds that you ask for are covering the first 5000 trees as you state in youtr brief, what about the future trees ?\nYour objective is to plant 5000 trees in about one month, and 1 tree is equivalent to 17 km. That would mean 250 active users for a month exercising every day. I think it's doable, but you need a strong marketing to collect those participants and instruct them about the NFTs, wallet creation... I think more preparation is needed upfront from the educational point of view. \nI am going to rate 4 because the realization of the proposal is something that I see feasibile, especially because the required number of participants is limited, but it is not clear is the tree planting area and manintenance has been planned upfront.\nI also see that this proposal is relying upon the completion/funding of another proposal which is centered in creating the app that would be used by runners to track their mileage, so the risk that this proposal is not completed because of lack of funding is higher that the related proposal (which is the 'primary' one)", "q1r": 4, "q2": "The team has provided a website https://healthfi.io to track the progress of the project, but the page is not working. \nThe cost sheet with the full budget breakdown (link provided in the brief) has not been translated into English. \nThe remaining information are accurate, the team provided a bio of the team members, listed the KPIs to be tracked (number of users/monthly, n. of trees planted ect.)\nI would suggest to propose a mitigation plan in case the app is not built on time: the challenge could be also be completed via a website or via leveraging already existing running apps.", "q2r": 3, "assessor": "z_assessor_2215", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12561, "q0": "Vietnam has a 42 percent forest cover compared to a global average of only 29 percent. The climate in Vietnam is pleasant and livable. The weather in what was once thought of as the \"perfect retirement home,\" however, has recently gotten worse due to people and natural calamities, the proportion of forests has significantly dropped. Therefore, I realize the urgency and this proposal is very suitable for the actual situation.\n\nBy developing a campaign with \"Dual aims\" that both improve health and plant trees, providing motivation for each person to be work hard in sports. Besides, it also takes a better look for blockchains and brings it back to users with the new and positive concept that the proponent has referred to as “green cryptocurrency”.\nHonestly, the proposal was pretty cool from the very beginning. If the team succeeds, I believe it will have a beneficial effect on Cardano and be able to scale up significantly in the future. \n", "q0r": 5, "q1": "The right proposal is just the start of the author team's larger project image. The dates and development of the phases, however, are very thorough. Simply put, it's simple to comprehend. The detailed budget sheet also corresponds to the execution status. The plus point here is that the project is not only expressed on paper. In fact, the authors have developed app HealthFI to version 1.1 and version 1.2 is also fully prepared ready for implementation. This is a positive.\n\nIn addition, the author team's strength is that the qualifications and experience of the members are quite excellent. It can be seen that the team has a long with Cardano. I have faith in their abilities. However I hope when doing tree planting project, the team should thoroughly review the documents and consult with an environmental specialist or someone with authority and a position in the forestry industry. Since afforestation, as far as I'm aware, also requires a license, and I think the paperwork in Vietnam is rather onerous.\n\nOne issue that worries me is that although data indicates that Vietnam's planted forest area has grown significantly in recent years, but most of them are running after achievements. Easier to say is \"take quantity instead of quality\". Hopefully, the author group will clearly analyze the methods and methods of planting, caring as well as solutions to overcome the risks that the group has given in more detail. If so, it will give the project the ideal component. That is just what I think. Rating point 4.\n", "q1r": 4, "q2": "The proposal shows once more that it is capable of responding adequately to solutions. As for the indicators to measure the success of the project, I consider it positive when all the roadmaps including the progress of the number of trees planted and the number of participants, are made public and open to everyone's viewing and trackable. This is the way that the author team cleverly shows when hitting on the user's psychology that they always like transparency, and can also use transparency as a tool for marketing. Besides, the organizational plan, KPI and the author's goals are quite clear and detailed, I think this represents a significant part to help investors calculate the probability and measure the probability of project so that they can make the correct decision whether to invest or not.\n\nThe proposal gives enough information for me can readily audit the project and comprehend it. So I completely concur.\n", "q2r": 5, "assessor": "z_assessor_3437", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12071, "q0": " Proposal \"HealthFI X Cardano - Run to plant trees\" was born presenting ideas related to the development of Cardano community specifically the Vietnamese community, the proposed problem is suitable for the challenge, to address the problem that forest cover in Vietnam is decreasing every year, climate change is becoming more and more severe, and environmental protection activities are still not effective in raising awareness due to lack of transparency .. It has given solutions to a problem in the development of the Cardano community, which is the development of the cardano community in Vietnam. The specific solution of the proposal is to build an environmental protection campaign for the Cardano Vietnamese community with the support of the HealthFI application, allowing users to plant trees by walking and jogging. Therefore, this campaign will help raise awareness of increasingly urgent environmental protection and encourage the Cardano community to switch to using more environmentally friendly means of transport.. specific evidence in the presentation by arguments with specific, feasible, highly effective numbers. It shows that the proposed team has carefully studied environmental protection and the needs of the Vietnamese community, answering the question: How can Cardano users improve their health while thousands of trees are green? replanted? The specific goal of the product you propose is: the public in Vietnam will have a good view of the contributions and role of blockchain technology and Cardano in combating climate change. Through this event, many users will know about Project Catalyst and Cardano. The proposal identified a number of risks in the implementation process and proposed solutions to overcome all those risks. You took a risk in the course of your job and there is a solution to that risk. Objective risks such as natural disasters or improper care, or risks similar to Covid 19. No solutions to overcome risks have been provided. It is possible to explain more clearly the solution of an online PR campaign to promote Cardano and Catalyst in Vietnam through social networks that Vietnamese people often use such as Facebook, Tiktok, Telegram. I rate: 5 points.", "q0r": 5, "q1": "The proposed proposal shows a detailed and reasonable plan or goal to perform the work. Regarding the timeline, the proposing team presented a plan, monthly milestones and goals for each. month has been clearly stated with specific and very achievable numbers. Updated progress on the proposal's website (https://healthfi.io); Any updates will also show up on the app. Fundraising budget accounted for 8.8% of the Challenge.. However, the above part requires a budget of 22,000 USD. But the details section states the total budget is 59,204.43 USD. There are no additional options. Have a detailed, specific, clear and transparent budget allocation plan. The alternative proposed in the supplementary budget is quite reasonable. However, an additional provision is needed in case more videos and podcasts are shared than expected. Proposing to assign specific tasks to each member; Have experience related to the assigned task; The identities of team members are easy to verify. The proposal also analyzes the tasks for each specific, relevant and highly specialized group of members. Work is based on the ability and experience of each team member. Verify identity on Linkedin. No degrees, certifications or intellectual property. I rate 3 points", "q1r": 3, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. Proposal has metrics / KPIs to measure project performance and progress such as number of participants running, number of trees planted, number of app downloads and number of regular users per month.. Easy to check easily, quickly on Website, application.. Success is described in detail as follows: 5000 athletes participated, with 5,000 trees planted; Drive 10,000 installs with 2,000 monthly active users. Above all, the project's success will definitely help increase the Cardano community in Vietnam. Although it is a completely new proposal, there is already version 1.1. In addition, the proposed level is consistent with the United Nations' Sustainable Development Goals SDG, which is Goal 13 Climate action To respond promptly and effectively to climate change and natural disasters; Goal 15 Life on land Protect and develop forests sustainably, conserve biodiversity, develop ecosystem services, combat desertification, prevent degradation and restore land resources. . If funded I think the proposal is in the top 20% of votes. I rate: 4 points.", "q2r": 4, "assessor": "z_assessor_3353", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11799, "q0": "I rate HealthFI X Cardano - Move to Plant as a very good proposition, perfectly suited to the Grow East Asia challenge, Grow Cardano. This proposal, in addition to solving the general problems of the challenge, is how to develop the Cardano ecosystem in East Asia comprehensively, increase the awareness level of the people here about blockchain and Cardano network, also contribute to solving the problem of environmental protection from planting trees.\nI find the uniqueness and outstandings of the proposal very different from other proposals in the same challenge when delved into building an environmental protection campaign for the Cardano Vietnamese community with the support of the application using HealthFI, allowing users to plant trees by walking and jogging. As far as I know, currently, Vietnam is one of the countries most heavily affected by climate change, the forest cover in Vietnam is decreasing every year while environmental protection activities have not been done yet effective in raising awareness due to a lack of transparency. Extreme weather events such as storms, floods, droughts, and saltwater intrusion... have been causing heavy consequences on life and production.\nI completely agree with the author's argument about the solution when building the campaign \"Turn your steps into a healthy Earth\". This is an idea that is combined from running to improve health and planting trees to protect the environment. For everyone, these may be 2 completely unrelated jobs and difficult to do, however, when applying blockchain to life, it has provided us with a platform to create a solution complete technical solutions help realize the above idea.\nI consider this to be a very realistic proposal, which needs to be prioritized and cared for by the Cardano community to help the proposal come to fruition. If funded and the project is successful, it will be a project with great influence in the community. As a Vietnamese citizen, I see that people in my country are paying more and more attention to the health protection of themselves and their families, increasing awareness of daily exercise and sports. To help myself have good health, the values ​​​​of exercise and sports are extremely great. Therefore, the daily practice of sports is becoming a common trend from children to the elderly, in which walking and jogging are always preferred subjects because of their convenience, easy to use anytime, anywhere. I think when the HealthFi project was born, as a Vietnamese citizen, I was willing to wait and participate in this project as well as introduce it to the community around me because of the benefits that this project brings. I think this project will receive a large reception and spread from the community when it integrates all 3 values ​​​​to bring to users which are healthy habits in training to improve their own healthy body, contributing to environmental protection, the more you move, the more trees you can plant and receive rewards from the project. Based on the above points I would not hesitate to give the impact of this proposal an absolute score of 5 points.", "q0r": 5, "q1": "As for the planning part of the proposal, I find the plan table that has given specific monthly milestones to be reasonable, the content of the plan and the implementation milestones are included in the proposal clearly and in detail. \nAs for the proposed budget, I see the team's calculation for each item. However, when I look closely at the overall budget table in the proposal, I see a contradiction because there are 2 numbers displayed. The total budget applied for this project is 22 000$ and 59 204.43$. This makes me not know what parameters to use as a basis to evaluate the project budget. Additionally, when I drilled down into the budget breakdown for each item provided by the author team, although the items were explained in detail but I couldn't see a cost figure that matched the table's total cost proposed. I am really confused and see no clear link for this cost of use. Maybe this is an error in editing the estimate during the team's project completion. If I take the grant number of 59 204.43$ dollars, the amount now represents 23.68% of the total budget of the challenge. This is a large number that requires rigor, meticulousness, carefulness, and thoroughness in making estimates. I feel the authoring team needs to review this budget carefully.\nI see that the authors have also pointed out two main risks that can prevent the success of the project, which are objective risks such as natural disasters or improper care that causes the number of trees to grow after planting. Failure to meet the target and risks from diseases (such as the COVID-19 pandemic) can cause fitness and sports activities in general and running competitions in particular to be postponed. However, I have not seen the measures taken by the author team to overcome these risks.\nI think the proposer is the person who is capable of implementing this proposal. They are people with capacity, qualifications, education and long experience. I can consult their information and public identities from Linkedin, web links provided by the author team.\n3 points is the score I rate for the feasibility of the project because -1 point for the part of budgeting, the data is not matched, -1 point is because the plan to solve the risk of the proposal has not been proposed yet.", "q1r": 3, "q2": "Currently, for me, the project can be audited, but only at the level of the implementation of the project plan, and the implementation budget is not auditable or the audit is not agreed upon because the data aren't linked together. It is clear that when the data budget construction table does not match, the monitoring of the implementation progress and the success of the project cannot take place continuously and closely. Moreover, when developing a large-scale project, with a long implementation time and using a large budget, the author team needs to have a plan for publishing monthly reports in a transparent manner implementing the plan, what has been done and will be done with the use of the budget, how much has been used, what to use, and how much the budget is left.\nI see that in addition to the commitment that the data will be updated on the web and the application, the author team has also come up with KPIs to measure the success of the project, which is the goal of about 5000 runners participating, with 5,000 trees planted. With this proposal, we also expect that it will attract 10,000 installs with 2,000 monthly active users (MAU) after two months of launching the campaign. With the whole project, the author team also wants to change users' exercise habits towards a healthy lifestyle and contribute to the reduction of greenhouse gas emissions by creating a habit of walking/jogging with thousands of products thousands of trees were planted.\nThis is a completely new unfunded project in the grand total project at fund 9. I will still give the transparency of this proposal 4 points and keep my initial assessment when evaluating this proposal, it is a very good idea for community development and for the development of the Cardano ecosystem in Vietnam in the near future.", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11770, "q0": "I was very impressed with “HealthFI X Cardano - Move to Plant”, a good idea and perfectly suited to the goal of the “Grow East Asia, Grow Cardano” challenge. This proposal is part of a larger picture of ideas submitted by the team at this Fund 9 (https://cardano.ideascale.com/c/idea/417168). Here, the specific solution raised by the group is to build an environmental protection campaign for the Vietnamese Cardano community through HealthFI - a \"Move-to-Plant\" application that allows users to plant trees by walking and jogging. The purpose of the solution is, to encourage and engage the Cardano Vietnamese community in activities of greening crops and combating climate change. Since then, raising awareness about Cardano in Vietnam. Through Cardano's unique blockchain technology application to mint NFT - a valuable Green Certificate, recognizing the prestige and dedication of participants and contributors in environmental protection activities in Vietnam. What really excites me about this idea is that this novelty, and originality is that - for the first time, there is a combination of two activities: running for health and planting trees, against climate change. Specifically, how this solution works can be briefly summarized as converting the distance the user travels to Gold (the currency in the HealthFI app). Gold is used to accumulate, once a certain amount is reached, it will be converted into 5000 trees, planted by the project team in real life. The creativity of the idea also lies in the fact that, for each plant, the group will issue a QR code to look up information and its origin. In fact, in Vietnam, we are almost lacking in activities to apply blockchain in real life, creating value for the environment and society like this. So I highly appreciate the solution for its social significance and the contribution it brings. I believe that, when Cardano participates in meaningful activities like this, Cardano will find the perfect way to inculcate the awareness of the Vietnamese community. However, what needs to be further discussed here is the risk of the solution. All plants will be planted and cared for by the group themselves, after about 12 years, they will be handed over to local people. This is not appropriate in my opinion. I suggest that the group consider deducting part of the budget to invite more experts with agricultural knowledge to collaborate. This helps to ensure a high percentage of healthy plants. The group should also set up a fund for crop care and protection, and cooperate with local authorities and people. Because the indigenous people are the most suitable for daily care and protection of plants. Overall, I appreciate the impact and value of the solution. My score is 5.", "q0r": 5, "q1": "Regarding the progress of the project, the information the team provided was complete, concise, and clear. There are 4 specific work milestones, divided into 4 phases (from September to December 2022). The team will begin with marketing activities for the Move-to-plant campaign. Next, update the progress of planting trees, to cheer and guide application users to create daily usage habits. Finally, organize challenges to increase user connection, and prepare for the offline race in 2023. The monthly work plan given by the team in my opinion is complete, appropriate, and ensures the feasibility of the project. The only point that confuses me here is the budget item of the project. There seems to be confusion about the grant amount here. In the USD Request section, the number given is $22000. However, in the detailed budget breakdown, the required figure is $59204.43. I have consulted the attached detailed cost sheet, the total budget figure described here is again $59340.21. I don't know what the exact number of submissions is, although their explanation of costs is very detailed. About the team, the team consists of 3 people with experience and skills in marketing, communication, business, and sports community development. Reference links to individual profiles of members are complete and unambiguous. However, since this activity involves planting trees - an important part of the project, I suggest - the group should consider inviting more experts in the field of agriculture to participate in the cooperation. I believe that the project is capable of successful implementation. However, due to budget inconsistency, I deducted -2 point. My rating on this item is 3 points.", "q1r": 3, "q2": "Regarding the auditability of the project, I believe that the community completely has enough basis and enough KPIs to measure the achievable success of the project. The team delivered exactly what we expected of the audit content of a proposal by its clarity, brevity, and completeness. The team plans to update the progress every 2 weeks on Friday to the community, including the number of trees planted, and the list of users participating in the application. Success metrics are also illustrated with numbers. Specifically, the project is expected to attract 5000 athletes to participate and plant 5000 trees. The team also showed effort and ambition when simultaneously setting higher expectations after 2 months of the campaign's launch, with 10,000 installs and 2,000 monthly active users. The community can easily monitor and check the activities and results achieved through the website they built (https://healthfi.io). I do not have any criticism of this section. My rating is 5 points.", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11141, "q0": "At the first sight, this proposal is really a breakthrough. The object that the proposal is aimed at is not only the health of the community but also the protection of the environment. By creating and developing a health care application called HealthFi, there is a high possibility that this is a project that will create a new concept in the blockchain industry \" Move to Plant \". Vietnamese people in general and the Vietnamese Cardano Community in particular are very interested in improving and maintaining their health. Therefore, the project will be receive a lot of attention from the public in Vietnam. Moreover, this will improve and enhance people's goodwill towards the blockchain technologies and Cardano in Vietnam. What's more amazing is that the project will attract more users to Catalyst and Cardano. The proposal is very suitable for the Challenge \" Grow East Asia, Grow Cardano \".", "q0r": 5, "q1": "In general, the project will be implemented and managed by an experienced and influential team. However, given the group's ambitions and the project's expansion potential, I am afraid that 3 main personnel is still not enough. The shortage of human resources will make the project difficult, especially in the expansion phase. It's great that the team plans to launch phase 1 this coming September but with a small amount of member, this requires the team to work hard to ensure the set timelines. Moreover, it is worth noting that the requested budget ( 22000 USD ) and the budget breakdown do not match. Fortunately, the team has realized the biggest risk of outdoor events at the moment, the COVID-19 pandemic. Although the disease has been successfully prevented in Vietnam, there is no guarantee that new variants will not spread again. Finding a solution is almost impossible when the project is still following the model of physical training and sports activities.", "q1r": 3, "q2": "The goals and KPIs will be measured, tracked and communicated to the community via the website which is belong to the team. In addition, the team will also provide updated information on the app.  The proposed team makes it very clear when metrics and KPIs can be easily viewed by users whether on the website or the app. In my opinion, there is almost no reason to be worry about auditability of this project.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10821, "q0": "Currently, in Vietnam, the majority of the public still lacks understanding and prejudice about blockchain. This project will help people have a more positive view of blockchain. What it can help with environmental protection projects. The HealthFI app will help turn footsteps into healthy earth by planting trees. The proponent detailed how blockchain technology will be applied to help manage this campaign efficiently and transparently. All information about the campaign is also fully explained. I believe that if this proposal is successful, it will help more people know and believe in the good things that the Cardano ecosystem brings. ", "q0r": 5, "q1": "HealthFi was developed in version 1.1 with the proposed team budget. In this proposal, the group focuses on planning and allocating a budget for the campaign to plant about 5000 trees. The author plans the media to reach more people. Not only do we know the main task each month, but we also know what it means. The budget is allocated to The cost of building social channels, The cost of PR activities, The cost of running the \"Move to Plant\" campaign (including the cost of planting trees), and Reserve funds. I think this section has very little information. We need to know what social channels will be built, what PR activities will take place,... With the experience of the project members, I am relatively confident in what they will do to help the project succeed. ", "q1r": 4, "q2": "I love how the proponent provides ways for the community to track the progress of the project. We know when, how often and where progress updates will be made. The goals are also clearly stated. One thing I want from this project is other than quantitative numbers, how do we know that the public in Vietnam has a positive view of Cardano and is willing to participate?", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10542, "q0": "This project seeks to grow the cardano community by making an app that converts users' running mileage into trees planted in the vietnamese forest. I believe this proposal is very interesting for a number of reasons. First, this will help build a bigger, stronger and more environmentally aware community for cardano. By putting running component into it, there is a chance to introduce cardano to a whole new audience, who would already be interested in fitness and the environment, and would help implement those ideas into the cardano ecosystem. The hard work that will be put into running to plant trees will have everyne feeling way moer involved and interested. This also gives people a more sustainable, more positive and approachable image to the crypto-space and cardano. Secondly, the usage of NFTs could be an interesting way to make use of the cardano dapps more. This would allow NFT users to take interest in the project, and allow for connectivity with the rest of the cardano ecosystem. However, I find the implementation of NFT idea a bit odd. If these NFTs are tradeable, they can be sold away to corporations that wish to show a environmental-conscious image, without them ever contributing to planting any trees.This would turn a good initiative into a very shady one, and soil the image of the app. I would like further elaboration from the author about this subject. Overall, I still feel like this project will better the development ofcardano in asia.", "q0r": 4, "q1": "The team seems very experienced in both the cardano community and the running community. I believe the biggest challenge of this project will be in the marketing. They must work on reaching both the crypto community and the runners communities, and somehow link the two together. There may be few users that are interested in both. The team has a strong marketing team with extensive experience, so I do believe it wll be successful in that aspect. The second challenge I see is the sustainability of this project. Will the NFTs be the main source of income to keep the app running? Maybe the runners and users should have a donate option to contribute to the cause even if they are unwilling or unable to run/participate physically.  Overall, i do believe this project has a high chance ofsuccessful implementation. ", "q1r": 4, "q2": "The number of users and the number of trees planted will be visible through the app. The author also offers a websit where we can see progress of development. Both of these are easily accessible. The QR codes for each tree is also a very nice touch to help audit. I believe this project is easily auditable with no issue. ", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10340, "q0": "The idea of \"move to plant\" help to make contribution to the cardano ecosystem. If the project is successful, there is an increasing impact to the cardano system regarding to the development of healthy social activities. Although as mentioned that  the idea of combining running to improve health and planting trees to protect the environment into one seems irrelevant and difficult to implement, even in theory. But i think nowaday, people have awareness of the importance of keeping the environment green for their health status. So i think this proposal will impact the large community. Therefore, i think this proposal is in line with the challenge.", "q0r": 4, "q1": "The KPIs of reaching 5000 trees after one month of deployment, I think, it's up to the marketing activities. The proponent should point out what kind of social channels that they will launch the campaign?, and to know how reaction of the community toward the campaign, the proposal should give more specific explanations than just the target of 50% of runners would be navigated and converted to monthly active users. But i still believe in the feasibility of the project because nowadays the community that loves running in general and blockchain particular can reach the large number and mainly focus on the young ages. The new generation develops the new life style, keep up with the new trend by adopting the high technology via blockchain platform.", "q1r": 4, "q2": "This is entirely new proposal with the entirely new idea, so as to audit the project, I think the proponent should choose more than just website of healthfi.io to report the progress of the project. The KPIs with the number of 5000 runner participate, together 5000 trees planted, and expectation for 10,000 installs with 2000 monthly active users after two months of launching the campaign is just the target. We need to see more details of motivation promoting programs that the project could boost up so that the cardano community can assess and believe in the success.", "q2r": 3, "assessor": "z_assessor_3182", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10272, "q0": "Just like in the Problem statement, deforestation is happening at a very fast rate in Vietnam and environmental protection activities are mainly from the government, without significant participation from the community. I think this is a pretty good proposition, it can Grow Cardano through community events like walking and jogging. There are quite a few apps that encourage physical activity, but on the Cardano platform, this is quite new. Even though, at Fund8, there is already a afforestation project in Vietnam, I still appreciate your suggestions. The goal of planting 50,000 trees in the next 5 years is in line with the policy of the Vietnamese government, so the project will receive support from the community and has potential for development. I agree and support your proposal.", "q0r": 4, "q1": "In addition to the information on Linkedin of Mr. Manh Le, the other members of the group are not available, unfortunately, it is difficult for me to assess the authenticity and reliability of the information you provide. HealthFI application is just a web platform, do you plan to develop it into an application on Android, iOS Apple…? You need to re-evaluate in more detail the budget for social channels, $21,562 needs to be explained specifically for what items? Another issue I want to talk about is the care and management of the planted trees, who will be responsible when planting the trees? How to know the planted trees survived the initial time. The crop will be under the management of whom, will this project be profitable from that new plant source?", "q1r": 3, "q2": "When you provide all the information about the project implementation on the https://healthfi.io platform, I believe the community can easily audit the implementation of your proposal. I want you to be more specific about the method of promoting products and campaigns to the community, because as proposed, attracting 5000 participants in the first stage is not easy. I agree with the solution of using QR code to display detailed information about the crop, digitizing the tree in the form of NFT, minted on Cardano's Blockchain network. You have provided enough information and evidence for the community to audit.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9864, "q0": "Great idea and will change public opinion. Blockchain has been the subject of great criticism in recent years regarding its environmental impact, especially those that use the Proof of Work (PoW) consensus mechanism. The concept of the campaign \"Turn your steps into Healthy Earth\" is the idea of combining running to improve health and planting trees to protect the environment, which will help the public have better prejudices about blockchain especially, Cardano, which has always been considered a \"Green Cryptocurrency\" in the crypto world. Moreover, I hope \"Move-to-Plant\" will be a new concept in the blockchain world!", "q0r": 5, "q1": "At first, the idea of ​​​​combining health-promoting running and planting trees to protect the environment into one seemed irrelevant and difficult to implement, even in theory. But with a specific solution description and an available HealthFI app, I have confidence in the project. The proposal is possible but there are some problems. What is the project implementation plan that is not specific, and does not specify how the activities will be carried out, for example, in a more challenging organization? The project only set a goal of reaching 5,000 runners as soon as possible, but only based on communication activities on all existing channels, combined with PR activities in the press. In my opinion, the project is not sustainable when it does not focus on building the quality of activities but only cares about PR press activities. A project with a large budget but only 3 experienced members in the field of marketing and communication, makes me doubt how to operate. In terms of funding, it is explained in detail and great detail. The proposal will be maximum if it is more complete on how it works on the HealthFI app.", "q1r": 4, "q2": "The project has an updated roadmap and progress on the website, each tree that grows will also be digitized as an NFT, minted on Cardano's blockchain network, so the community can check the progress. The goal of about 5000 athletes participating, with 5,000 trees planted, attracting 10,000 installs with 2,000 active users is reasonable given the project's roadmap. With the goal achievable after 2 months of the campaign launch, I hope the project will continue to let the public have a good perception of Cardano - the green cryptocurrency in the crypto world.", "q2r": 5, "assessor": "z_assessor_3119", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9387, "q0": "This proposal certainly aligns with the goal of the challenge. We all know that in Vietnam, forest cover is decreasing year by year, while worldwide climate change has caused great impacts on humanity. Vietnam is one of the countries most affected by climate change. To mitigate the effects of climate change, there are many measures, of which afforestation is a measure applied by many countries and is especially suitable for Vietnam.\nThe combination of afforestation - health - the growth of the Cardano community in Vietnam is a great idea, as we are seeing many problems that can be solved at the same time, creating different effects. active in the Vietnamese Cardano community.\nThe project provides a platform called HealthFI - a complete (and already developed) health care application that personalizes exercise and nutrition for users, regardless of gender or age. Meanwhile, the campaign concept is \"Turn your steps into Healthy Earth\" campaign will be as follows: One or more users will contribute by walking/jogging every day to achieve a cumulative number of distances (unit: km), which will get a tree planted in return. A great idea, with the meaningful slogan \"Move - to - plan\". The perfect point of this application is the statistics of the number of kilometers the user has achieved and up to a certain number of kilometers, you have planted a tree and can also track the profile of that planted tree. For participants, it is a feeling of accomplishment, satisfaction, and pride because they have done something for society. The positive effects of the project will bring great spillovers in the community because of its practical significance.\nIn addition, the risks associated with crop care or the impact of diseases on participation in outdoor sports will certainly affect the project. They are adverse conditions. However, it is fortunate that currently, the epidemic in Vietnam has been somewhat controlled, outdoor activities can therefore take place normally.\nThe impact of the project is very good on the Vietnamese Community and society in general. This is a well-written, well-informed project for reviewers.", "q0r": 4, "q1": "The project implementation timelines are clearly shown, and I understand the next steps of the project each month. The project provides the full process to operate to deliver results for the proposal.\nThe budget of the project is allocated very specifically and clearly. The authors have provided a clear cost allocation table to increase transparency for the project and also aim at the reader's assessment of the feasibility of the proposal through this method of budget allocation.\nProject implementation personnel includes 2 people, the proposal also clearly states the experience of each person in the project. They are people with a lot of experience in the process of working. I believe that thanks to the accumulated experience, the two personnel can work with their team in a professional manner, bringing efficiency to this meaningful project.\nThis is a very feasible project, I personally think that the project's budget allocation table is well presented, detailed, specific, and gives confidence to the reviewer.\nTherefore, I believe this is a passionate project of the author's team.\n", "q1r": 4, "q2": "It is proposed to provide a measurable and controllable approach.\nThe author gives a number of KPIs that need to be achieved after the project ends. However, I think the author needs to spend a little more time considering the impact of the project on the increased impacts of Cardano in Vietnam. We see the author mentioned that the number of ADA users accounts for 50% of the number of participants in the virtual race.\nIn my opinion, the project needs to show more clearly the impact of the project on the Cardano Community in Vietnam in particular and in the world in general.\nI look forward to the project being implemented and producing desirable results in Vietnam.\n", "q2r": 4, "assessor": "z_assessor_3049", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9334, "q0": "I agree with this suggestion. Because protecting the environment for the Cardano community is an important job to protect our environment. I also like this suggestion that users can move anywhere - anytime, letting them know how much they contribute to the campaign. They can also invite their friends, build a community, install HealthFI and participate in physical activities together. This makes it more environmentally friendly to use and also convenient for the user. This is very necessary, especially for today's life with many environmental pollution. In your proposal, you have clearly divided the benefits of the application: Manage planted trees easily with HealthFi, Use NFTs to protect the environment, Make the Cardano community stronger. I found your explanations easy to understand.", "q0r": 5, "q1": "\"The amount requested and the amount of time provided is reasonable to carry out the project as described. I see your cost sheet provided is very detailed by google sheet but there are some parts in Vietnamese. you should synchronize in English for easier assessment by the international community.In addition, you still have a simple budget analysis for essential costs in the proposal.\nIn addition, resumes are provided to full team members. The team has 3 people and everyone is experienced and qualified. I am afraid that with 3 people is too little to carry out this big and long-term project or not.\"", "q1r": 5, "q2": "The use of a website (https://healthfi.io) to specifically provide any community progress updates every Friday for two weeks and the number of trees planted and a list of participating users. will be publicly visible, transparency on the app is great! If you are Funded, you are responsible for your promised information. In your proposal, there are very specific goals along with the proposed KPIs: about 5000 athletes participated, with 5,000 trees planted; attracted 10,000 installs with 2,000 monthly active users (MAUs) after two months of campaign launch. Overall this is a brief but informative recommendation.\nI really hope the project will be implemented because it will help people to have a habit of exercising, have a healthy lifestyle and contribute to reducing greenhouse gas emissions by creating a habit of walking/running. set, with thousands of trees planted. If your team achieves its goal, it will bring tremendous value to everyone and the entire Cardano community.\n\n", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8864, "q0": "As there is drastic environmental changes around the world in recent days , some awareness need to be created among the people about the importance of nature and contribution of each person towards this nature, Hence to develop an app where it notifies the users regarding their role in environmental development and helps in maintaining the health of the person is a great idea, where it encourages Vietnamese to jog or walk, which will be beneficiary to environment where it reduces the usage of vehicles which in turn helps in maintaining the environment. hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan definitely needs a research team and it even needs a huge number of volunteer team, because on completion of targeted gold by the user , the team has promised to plant of 5000 plants , to plant such number of plants huge number of volunteers are needed, which will be very hard to find on every day scale.\nExcluding the above point calculating the number of steps is not difficult app to build since their are lot of apps which calculates the step count of individual, the proposer has even worked in app development with such experienced person ahead building of app can be achieved. with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has beautiful goal to achieve where it wants to conserve the environment for the future ,still the presented plan is not the best solution to it, The plan has presented the proposed solution in very detailed manner and wants to meet the challenge by achieving the \"dual goal\" concept which is well presented in the audit.\nThe presented plan has even shows how they have already built the app which is in version of 1.1 currently where it just needs some optimizations, The audit has clearly mentioned about their monthly goals to achieve the project, and has even presented excellent budget breaking idea to complete the project in most economical possible way, with great key indicators provided by which they want to calculate the number of plants planted. The information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5225, "q0": "Afforestation is the most direct way to help reduce climate change on Earth. But at present, afforestation is still quite limited, focusing only on the government and non-profit organizations. Although many people want to contribute to afforestation, there is no effective solution for many people to participate.\nYour project has come up with an interesting idea that is \"move to plan\" combining jogging and afforestation. A solution that brings 02 results, both improving the health and sportsmanship of the participants, and increasing the number of forest trees planted to help make the Earth greener.\nUsing NFTs to endorse planted trees is also a good solution to help make transparent the amount of money that users have contributed to the reforestation through running. Besides, the use of NFTs can also help prove to everyone that Blockchain technology and NFTs have real value and can contribute value to society.\nYour proposal is completely suitable for this Challenge, I hope your project will be voted by the community to have the budget to run the project because of the humanity and many benefits that the project will bring. for community.", "q0r": 5, "q1": "The implementation plan based on your project is quite clear, the proposal implemented within 4 months is feasible. However, this is only a small part of another proposal that is “HEALTHFI - Healthcare Metaverse” in Challenge “Dapps, Products & Integrations”. So the success of this “move to plant” campaign depends greatly on the success of the HEALTHFI app.\n\nYour project is applying for funding is $22000, but in the detailed description of the budget, I see that the total budget is $59,204.43, and I don't know which item $22000 is the proposal for Catalyst funding so so I feel unconvinced about this part.\n\nRegarding the project team, I see that you have a lot of experience in the field of business development and Marketing, and for this campaign, these experiences and skills are an important factor to help many people know about this event, especially Blockchain and NFT technologies are quite new to Vietnamese people, so communication will require a lot of effort.", "q1r": 4, "q2": "The goal of the proposal after the end of the campaign is 5000 participants in the contest and 5000 trees planted and NFTs. With your proposed budget of $22000, this goal is feasible.\n\nBut because this proposal will mostly cost marketing and communication, if you can add indicators such as the number of people reaching and interacting with information about the campaign on social channels. And if in your advertising publications, there is a Catalyst-sponsored logo, it will help promote the Cardano brand to more people.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4364, "q0": "The proposal you raised is closely related to environmental issues. Specifically forest cover, climate change, and other environmental issues. The proposal is very close to the Challenge's stated goal of making East Asia a better place. The proposed solution is implemented on the Cardano blockchain platform, which directly adds value to the Cardano ecosystem and is fully scalable to solve future challenges (environmental challenges). school). I see the impact of this proposal very clearly, it also relates to the 17 sustainable development goals of the United Nations. Specifically, targets 13 and 15 (climate; terrestrial environment). I very much agree with your proposal, it is especially necessary not only in East Asia but also for the whole world. At present, environmental issues and climate change are at an alarming rate and it is necessary for solidarity and support from the community to improve the environment and the lives and health of people everywhere. So HealthFI is an application used as an environmental protection tool for the Vietnamese Cardano community, allowing users to plant trees by walking and jogging. This is an interesting application, very rare in Vietnam. I vote for the impact of this proposal 5 stars.", "q0r": 5, "q1": "I noticed that the team all have experience in sales, social media, and blockchain. Especially, some members also work for famous corporations like Pepsi. In general, the team has an understanding of blockchain. It's great that the team has given each member's social media link to better demonstrate the feasibility of the proposal. Through this, the team also won the trust of the community because all member identities are public. Currently, I see the number of team members is three people, with a project proposal of such a large scale, do you need more support from the community to implement the project? I want to know about the team's connection with other organizations because planting a lot of trees in Son La province requires many people. If you explain more clearly the necessary human resources to implement, I believe the feasibility of the proposal will be greatly enhanced. I understand you have had marketing campaigns and associated with influential celebrities to present the information and image of this project proposal to the community. That is highly commendable and encouraging. The budget is broken down by items and is logical to the goal. I don't have an opinion on this but the question is, if I haven't received support from Catalyst in Fund 9, will the proposal continue? Does the project have any other sources of money to implement? The implementation plan is also quite clear, and especially the team knows how to apply technology to deploy to everyone when it is the HealthFi application. I highly recommend this application because it is an effective bridge to help turn jogging steps into trees. However, what barriers exist to the adoption of technology by the elderly? When in general, it is more difficult for the elderly to absorb new technology than the young, will they have difficulty using the HealthFI application and other technology-related issues? I think the team should explain and guide more carefully about the technical aspects of technology used in the proposal so that everyone, even the elderly, who are not familiar with information technology can still understand. Okay. If this can be done, it is very beneficial for the team to demonstrate the feasibility of the proposal. The team correctly stated the objective risk of having a natural disaster or having no one to take care of the trees, and the risk of the Covid19 epidemic recurring. Regarding the issue of no one to take care of the trees, I think that from the very beginning, the team and the organizer should have a strict plan to assign members to take care of the trees during the whole process of greening. grew up until it was handed over to the natives. The proposal should also clearly analyze how the community's running has a good effect on the environment and what benefits will they benefit? Do they hold NFT for the long term, will NFT benefit them? If in the process of growing the tree dies or for other reasons cannot exist, is there any report back to the community? After all, I endorse the feasibility of the proposal and hope you will positively consider my questions. I vote 4 stars.", "q1r": 4, "q2": "I strongly agree when the proposal's milestone roadmap is clearly stated and tied to the months of a year. This is very convenient for the community to evaluate transparency and auditability. The team has stated that the project's success criterion is about 5,000 athletes participating, this number is achievable. I even expect that number to be more than 5,000 (7,000 or 9,000) the next time. Of course, the number of athletes participating depends on the characteristics of the people living in the community in the area. Specifically, do people living in that area have the habit of exercising, and jogging every day or do they have access to high technology in daily life? Anyway, I still hope for the success of the proposal. It is very interesting in that it outlines two parallel effects that are to enhancing people's health and bringing benefits to the environment by planting trees. This is great. However, I'm a bit regretful when I don't see KPIs and key metrics. My advice is for the team to add this metric to increase the transparency of the proposal. Then this proposal will become quite perfect because it ensures all three properties: impact, feasibility, and audit transparency. I find the proposal to show the professionalism of the team when the problem is clearly described and understood and the solution is attached. This is an impressive proposition. I agree and vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3859, "q0": "The idea of ​​​​the proposal has identified part of the problem to be solved for this challenge, but the scale of the project's impact is so large that we can extend it to many different areas. conditions are the same around the world. The issue of raising awareness of transparency is a human problem, it limits the development of mankind in many fields, especially the areas of environment, climate change, and safety. global food security.\n\nThe impact of this project is quite large, the solution of this proposed idea is huge, and it identifies almost every problem to be solved in this challenge, in addition to the author's argument through a realistic description. reasonableness, clarity, and completeness. Move to Earn (MTE) is a positive trend in recent years, especially in 2022, there have been many projects in Vietnam. It is an arrow that hits 2 targets with the motto Win-Win, when participants both improve their health, have more income, or entrust their income to a 3rd party. Health application is one of the prizes. France. well, it both fueled the sporting movement and brought greater awareness to MTE-sponsored reforestation.\n\nThe project highlights some risks in implementation, which will help the community to manage the risks if Funded, in addition, the feasibility of the idea will be better if the author comes up with a solution. to overcome those risks when it occurs. Natural disasters or improper care make the number of trees that can grow after planting do not meet the target => so what is the solution to limit this risk when it happens, we should assign the tree management to a state agency or enterprise management organization. The risk from an outbreak (like the COVID-19 pandemic) can cause fitness activities, sports in general and running competitions, in particular, to be postponed => So when a similar epidemic occurs again, suggest any solution so that the project can continue to be implemented, is it possible to switch to running simulations on the model? The community needs to listen for more solutions to overcome risks.\n", "q0r": 4, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable. However, since this proposal is only one part of the author's big picture, the author should consider resources so that progress does not overlap and lead to each other.\n\nThe project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. I have looked at the attached cost table, it is generally very clear and detailed, the labor cost is also reasonable, but there are some notes in Vietnamese, so it is a barrier that makes the evaluation community unable to speak. Vietnamese, this is just a small insignificant error.\n\nThe feasibility of this project is quite good when the human resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that it is completely suitable for the project. In addition, the members' identities are easily verified using the links listed above. The scheme is very clear, complete, and transparent. The author of this project, Manh Le, along with his collaborators Viet Phan and Ms. Mai Nguyen, show that this is an experienced team in implementing this project, the identity is also easily verified by the experts. affiliate link. Reputable identity verification like LinkedIn, ... for easy and practical identity verification community. However, most of the managers of this project are officers, and quite a few, how do you manage the reforestation on schedule, track the trees and manage the entire forest?? \n", "q1r": 5, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured thanks to the indicators provided by the project, and they are also easily tested in an implementation. Any progress updates and KPIs will be displayed on the http://healthfi.io web app, where the community can easily collate all the information needed to know that the project is live and ongoing.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and testing has achieved considerable initial success which is amazing. With the goal of about 5000 athletes participating, with 5000 trees planted, I believe this project can achieve this target.\n\nBrand new idea information on the Cardano platform never received any funding from the Cardano ecosystem.\n", "q2r": 5, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2419, "q0": "Here we find a very well-structured proposal, which clearly explains what your objective is and what steps will be taken to achieve it. Allied to this, we have that the scope of action of the project is to act for the preservation of the environment, while putting in evidence technologies of the ecosystem of Cardano. We believe that the project perfectly fits the metrics of the challenge, and its eventual success will have a significant impact on Cardano and blockchain application in general. We can say this because the premise of the application in question (physical exercise) is very comprehensive, so a huge amount of users can participate and promote the use of the technologies in question. Another very interesting point mentioned in the proposal, and which can even be better explored, is the issue of partnerships with other companies. A possible idea would be, in the future, to establish a link with other environmental companies so that the NFTs generated by planting trees would contribute to the deduction of some type of tax (as can happen with carbon certificates). In this context, the planting of many trees by a particular partner company (because many of its employees joined the project) could even generate a special NFT. The only point of contention at the moment is that the budget being requested (which looks quite correct) is not the same as what is being shown in the general budget breakdown in the feasibility section.", "q0r": 4, "q1": "We perceive a good strategy to put this project into action. In the timeline described we have that most of the activities are aimed at disseminating the idea, in order to generate engagement, and given that the backbone of the idea is not very complex (converting km into trees) it seems really interesting to focus on convincing people of how the idea can be beneficial in the long term, when using blockchain technology. Also, the app is already built. With that, we have that in relation to marketing, everything seems well structured. As for the professionals involved in the project, it is interesting to note how their experiences are diverse, not limited only to the area of ​​technology, since they also worked in communication, sales and journalism. Regarding the budget distribution, we see that the expenses are consistent with what was mentioned above, of focusing on project exposure. We were able to find allocations in agreement with this. The only doubt remains that this amount does not exactly match the total budget previously requested. But in general, the execution plan seems very well constructed, and the team demonstrates that they know the path to be taken very well. One of the central phrases of the project, “You move, we plant”, is also very creative.", "q1r": 4, "q2": "Regarding the ways elaborated to follow the evolution of the project, we have that ways have been enunciated that aim to always keep the public updated on the most recent evolutions, which matches well with the execution mode chosen for this project, that is, a direct connection with people using the app. And as a complement to this, on the way to measure the success of the project, we have that very precise quantitative parameters were set out, and that well cover the general scope that the proposal aims to achieve. Establishing a target of monthly active users, participating corridors and planted trees are good ways to later be able to evaluate the success or not of this project.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12926, "q0": "The issue is that climate change and forest cover in Vietnam are decreasing. It is necessary to protect the environment by walking to plant trees with the support of the HealthFi app. The problem is in line with the installed challenge, solving the problem of environmental protection. With the walking feature of the HealthFi app that has a good impact on users, they walk to improve their health and contribute a part to planting trees. Meaningful work is scalable in the future, creating more crops that contribute to fighting climate change and environmental improvement. The proposal adds value to Cardano, many of whom are aware of Cardano's role in building a sustainable world. Move - to - Plant on the HealthFi app is the appropriate feature to solve the given problem.\nDaily walking and jogging reach the number of steps prescribed to the iris tree and be attached to the QR code. The tree grows up to be molded into NFT \"green certificate\" on the Blockchain. The next five-year goal of planting 50,000 trees is in line with the proposal. The proposal has identified a number of risks such as natural disasters or improper care of trees that cause trees to die without the target; Covid epidemic. The author does not yet have a specific solution to the risks presented. We think that training the gardeners is technical. Selecting suitable land to plant trees to renovate the environment for disaster prevention and control, Carry out walking right in the environment in accordance with the epidemic conditions. Here are some of the ideas we found effective in minimizing risk.\nI rated: 4", "q0r": 4, "q1": "The plan defines four timelines in the last four months of 2022 as relatively reasonable. The work done focuses on media marketing, which aims to reach 5000 runners and plant 5000 trees. HeathlFi version 1.1 application can already be put into use. The communication plan of the proposal needs to be more detailed, which is an important factor in the implementation of the project. Conveying to users messages requires appropriate networking channels such as Facebook, youtube, Telegram, etc. We can check the progress at https://healthfi.io and right at the HeathlFi app is appropriate. The proposed amount of $22,000 is appropriate, accounting for nearly 10% of the F9 challenge's funding. We found that the detailed budget table was too large for the requested amount of up to $59204.43, there was no appropriate explanation for this. We look forward to having the author consider revising the plan in line with the original offer amount. The implementation team has 3 members, there are specific task assignments, the member's experience is in line with the task, we can verify the identity on LinkedIn.\nI rated: 3", "q1r": 3, "q2": "The proposal does not provide specific measurement indicators. The author is committed to laying out roadmaps on the Web, Google Sheet and the HeathlFi app in terms of the number of participants and the number of trees planted. The social networking channels intending to create media channels have not yet been launched. The proposal has a KPI to determine success: 5000 athletes participating, 5000 trees planted, 10,000 app installs, and 2000 monthly active users. We recognize that the proposal needs to determine the number of people who have been communicated, have good interactions on the social networking platform, the number of groups, communities on social networks. Measurement indicators and KPIs have not yet determined the progress of implementation as planned, have not determined the success of the proposal.\nI rated: 3", "q2r": 3, "assessor": "z_assessor_3514", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13375, "q0": "Move to Earn I already know, but Move to Plant is another story, a quite interesting and new proposal that has a positive impact on the environment and minimizes climate change activities, the proposal of You is perfect for the challenge.\nAt the same time, walking or running to plant trees is a Win-Win mindset, when we run, we get healthy and also contribute to the community by planting forests, regardless of age and gender, regardless of age or gender. Anyone with health can do it, this is a long-term vision and has high practical value.\nI have a few small suggestions before planting You should carefully study the characteristics of that land, study the climate and then choose the right type of plant so that the tree can grow and thrive in the future. long time.\nAnd like I said above, healthy people can contribute a lot to this tree planting project, so what solution do you have for those who are not fortunate in health but want to contribute to the project? plant this tree?\nI also have a small question if the tree unfortunately dies, how will the tree minted on NFT be handled?\nOr if the number of people participating exceeds the number of trees that can be planted and minted on NFT, how will you solve this problem? This can also be considered a backup plan.", "q0r": 5, "q1": "This proposal is just one part of your big picture in another proposal on the dApps challenge side, and this proposal is divided into 4 timelines for the last 4 months of 2022.\nAnd I see that in these 4 months, the main focus is on promoting communication, you also do quite strong communication when combined with major online newspapers such as VnExpress, Vietnamnet, and The Leader and cooperate with famous commentators. popular in Vietnam, this indicates a strong plan of action\nThe budget has been broken down reasonably, I have looked at the ways you PR campaigns and the extra costs when moving from Hanoi to the Northwestern provinces of Vietnam and the cost of buying trees, fees, and expenses. accommodation...etc.. is very clear, complete and detailed, I have seen a thorough preparation here.\nTeam members also have a lot of experience in their fields, creating a solid foundation for the success of the project.", "q1r": 5, "q2": "The project roadmap and progress are updated on your website but unfortunately the healthfi.io website that can't load, please check this technical issue.\nThe KPIs to evaluate the success of the project are also reasonable and have specific target numbers. I really hope that your project will be successful and thereby change the movement habits of Vietnamese people towards a healthier lifestyle and a cleaner green environment.\nCombining running to protect the environment is not a new idea, but applying it to a blockchain is a creative and meaningful step, and is clearly verified by users being able to track it. How many trees will you plant, on what date and year and tree details via QR code.\nBecause cheating is inevitable, I have a suggestion to use the GPS in your running app to confirm the move and use the accelerometer, and gyroscope sensor to evaluate running more honestly and accurately.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Building an environmental-protected campaign for the Cardano community in Vietnam with the support of the HealthFI app, allowing users to plant trees by walking and jogging.", "experience": "We have many years of experience in app development in MedTech, along with partners who are well-known KOLs in the sports community. The team has full skills to complete the project, from R&D to blockchain implementation, as well as PR, marketing, and user acquisition."}