{"id": 417311, "author": "dimitri777", "title": "Cardano in Tamil", "url": "https://cardano.ideascale.com/a/dtd/417311-48088", "category": 26602, "amount": 11150, "description": "Lack of official Tamil content . Thus Tamil speakers cannot learn in their native language. There are 75 million speakers around the world.", "f6_no_assessments": 8, "f6_rating": 4.208333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 4439, "q0": "People always love to learn all the new things in their native language, which will help them to have clear idea on the subject, this proposal will be effectively addresses such challenge.\n\nThis proposal has the great potential to improve the knowledge base about the Cardano ecosystem for 75 million Tamil speakers by providing translated videos. Proposer provides statistics on the number of Tamil speakers, but in my opinion, the proposer should also provide more analysis on the level of blockchain understanding of Tamil speakers. If blockchain understanding is low, then creating basic blockchain videos should be prioritized first, before creating content about the Cardano ecosystem. Thus attracting more audience.", "q0r": 4, "q1": "The information provided in the proposal are clear and understandable. I do think that the proposal has the potential to be successful since Proposer is (maybe) a Sri Lankan, also Proposer and the other team members have a lot of experience. These credentials make me believe that the Proposer will be able to successfully handle this project if get funded. The timetable is certainly achievable. An extensive analysis has been made about the challenges and the risks. An implementation plan is available. Last but not least, the budgets breakdown of the cost is thought out very well and very well-explained. Those breakdown helped me understand how they will use their requested funds.", "q1r": 4, "q2": "The proposal has a 3 months implementation schedule, those 3 months work contents are fully listed and measurable with 120 minutes of translated video with subtitles and voiceovers. KPIs are already measurable, also that can be used to measure the success of this project. Proposer may included a specific definition of how successful Follow by LanCardano Youtube Channel Subscribers Indicators; Average views per video; Watch hours; Number of comments; Number of shares; Number of downloads; What is the goal for each month?", "q2r": 3, "assessor": "z_assessor_2553", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "\n\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 8011, "q0": "There are about 75 million people who speak Tamil. There is limited content about the Cardano ecosystem in their language for these people. Due to a lack of Tamil content, these speakers are unable to learn in their native language. The petitioner's solution is to get official Tamil documentation, translated and made into videos in Tamil. This will educate these people about the Cardano ecosystem. This proposal offers a clear solution to the language problem. This project will have a positive impact on the Cardano ecosystem by bringing in a new community. As a result, 75 million people will have the opportunity to gain easier access to the cardano ecosystem. The main statistics and goals of the proposal are included. (number of subscribers to the Youtube channel, average video views, comments per video, viewing hours) These recorded metrics fall within the challenges setting outlined. It is clearly stated why the proposal meets the objective of Fund 9. These are well described how they will be approached. The biggest challenge included is when a translator falls ill. The submitter has assured that there are enough other translators who can continue working on the project. The petitioner has ensured that he has an emergency solution for the unforeseen circumstances. It is also good to include an emergency fund of 10 percent on top of the total costs to be added.", "q0r": 5, "q1": "The proposer provides evidence of relevant skills and experience to implement the proposal. The linkedin's and their experience are included from the different people who will be working on this project. Previous fund I also gave feedback for this project and most of these proposals were then approved. The submitter describes the team members needed to complete this translation + social media campaigns. There is a clear breakdown of the budget. It is good that a budget is provided to finance social campaigns. It is also good that there is an amount for unforeseen costs. More money is needed to develop more content. The videos will not be monetized until there are 1000 subscribers. A realistic timetable has been included to complete the work. (3 months) There is a clear implementation plan that shows what is being done and how. (YouTube channels, Cardano Forum) The plan lists the resources needed to implement the proposal. (money) The technical aspects are included in the roadmap. This states how everything will be carried out with a few KPIs to follow up on success. The risks and challenges have been included. It is good that the submitter has made sure to provide a solution every time. This project is certainly feasible because that team has already completed a few similar projects in previous funds.", "q1r": 5, "q2": "A road map with associated milestones has been included. The time span of 3 months is certainly achievable. It is good that the published material can be checked through YouTube channels and on the Cardano forum. Clear KPIs have been included in the proposal that will ensure that the success can be properly monitored (number of viewing hours, number of responses, number of shares,...) The proposal describes a clear description of the intended problem. A language barrier can prevent you from getting the chance to learn things in your own native language, which means you often don't understand some things. By translating content across the Cardano ecosystem, you gain a new community. Currently, there are almost no people from this population group who have access to this ecosystem. The translations are a clear solution to the language barrier that exists.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 8463, "q0": "The proposal's possible benefits include facilitating greater knowledge of the Cardano ecosystem among Tamil speakers through the distribution of translated videos. Over 75 million native Tamil speakers exist, according to the proposal's author. Facilitating access to Cardano resources for the Tamil-speaking community through the translation of documents and the production of content films for Tamil speakers is a primary goal of this proposal. Furthermore, the idea will allow a huge number of new people with diverse perspectives to join the community.\nThe proposal provides data on the number of Tamil speakers; however, I think it would be beneficial to additionally include information on how well Tamil speakers understand blockchain technology. Spreading awareness through making documentaries about it might be as important as providing information about the Cardano ecosystem. This will have a larger and more positive impact on the neighborhood.\nThe project's goals are reasonable given the complexity of the work to be done. It's a scalable project with worldwide potential for Cardano's benefit.", "q0r": 5, "q1": "The plan provides a comprehensive schedule and output, down to the number of translated videos to be released each month.\nThe proponents have more than three decades of experience interpreting official documents for the Ministry of Languages, and they also have worked for the Sri Lanka Broadcasting Corporation. In addition, they have prior experience in the field of software engineering. These references give me confidence that the applicants can translate documents and create videos with appropriate material for the Tamil-speaking community. Also, the budget is set down extremely well, including fees for each activity.\nHowever, I think certain details are missing and would benefit from being filled up. First, I'd like to learn more about the content of each video so that we can gauge the extent to which our viewers have a clear understanding of the Cardano ecosystem. The second issue is that not enough information is publicly available about the marketing campaign's success or failure.\nMore specific information will increase the plan's likelihood of success.", "q1r": 4, "q2": "To aid in more precise tracking of progress, proposer presents a thorough roadmap outlining the monthly milestones that need to be achieved.\nThere are certain broad measurements that have been presented but I would suggest some few more examples, including the weekly trend of view rate and the ratio of favorable to negative comments and feedback from the audience.\n I would encourage the proposer to consider adding more specific and quantitative KPIs in the future such as: an increase of one thousand members in the Tamil-speaking Cardano community; ten proposals submitted by the Khmer community;...   As a result, Cardano community will know whether or not the initiative was successful.\nMoreover, is there a means to monitor the project's development outside from the YouTube channel's analytics? I think it would be useful to keep a weekly record of the major accomplishments and share it with the community so that everyone can see the progress being made.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "\n\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 11290, "q0": "Lack of official Tamil content for the Cardano Project. So the team came up with the solution to Provide Official Cardano Documents Translated and made into videos in Tamil to educate the Tamil community in India as well as internationally about Cardano. The project positively impacts the ecosystem by bringing in a new Tamil-speaking community, bringing them into the community will benefit the community. Proposals after being successfully implemented will be more scalable if more information is provided, which will certainly attract more developers. The team raised the challenge of implementing the proposal as Covid, Lack of Terminology, and ADA Volatility, they also gave very detailed and specific ways to solve the challenge.\n", "q0r": 5, "q1": "The roadmap and timeline given by the proposed team are logical and clear. The proposal provides a realistic timetable for completing the work in 3 months. January does the dub and publishes the video translation, February starts the video production, and March launches the channel. At the end of 3 months, it will have about 10-20 videos. The target figures given are very detailed and reasonable. The budget is paid by the team for translation and communication, which I find quite reasonable. What I'm wondering here is that the team did not present a source of the $2000 contingency cost. The team has 3 members, I believe in the experience of the group, the members' information provided via LinkedIn is clear and detailed. The work assignment team is very clear, I see they are on the right track.\n", "q1r": 4, "q2": "KPIs are presented to ensure the quality of the project. The progress and development of the project will be measured through LanCardano Youtube Channel Subscribers, Views, Watch Hours, Comments, Shares, and Downloads. The success of the proposal aligns with the challenge posed, increasing awareness and interest in the Tamil-speaking community to Cardano and Blockchain. I hope LanCardano's Youtube channel quickly reaches 1000 subscribers so they have more money to develop more content.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "\n\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 14993, "q0": "The proposal provides a good key point that is in India has 75 milions people are speaking Tamil. They are lacking Blockchain Cardano documentations in their own language. So the proposal makes a group of Master Translators to take translation from official Cardano documentations from English to Tamil through Youtube channels and the proposal's video with traslation. That will bring a new community to Cardano ecosystem. The solutions will educate Tamil people in studying Blockchain technology and so far it will help code programmer to approach new technology and improve their own career in Blockchain field.", "q0r": 4, "q1": "The proposal estimates to output 10-20 videos after 3 months. It means every 3 days that they post 1 video on their Youtube channels. But the proposal should provide more information about specific content they will translate. Because from IOHK youtube channel, its channel has many contents that are related technology, reports, announcements,etc. So if the proposal just focus on announcements, it would take 1 video/day. Moreover, it will takes 3 days or more time if they translate technology video contents. So far, the proposal should provide more in detail about which category content they plan to translate and how many hours they will take for each category content, and each of category that they should give specific role jobs that accomplish the translation.", "q1r": 3, "q2": "The proposal auditability provides quite a bit of informations. The proposal does not provide how we can check their work. Moreover, the proposal does not show KPI clearly. They should give more detail in their own plan and make a list of work in each of month they will do to accomplist their proposal.", "q2r": 2, "assessor": "z_assessor_4128", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 14996, "q0": "This proposal will look to grow Cardano in the Tamil-native speaking regions of the world.  Thill will be helpful as the Tamil language in South Asia is widely used across a large population.  This should help Cardano's outreach beyond in the region.", "q0r": 5, "q1": "The skills and abilities of the team that is planning on performing this proposal all seem within reason to successfully accomplish this proposal.  The one major question is regarding the funding breakdown and the request for $2,000 of contingency fee (almost 20% of the total requested).  There is no mention why they would need a contingency fee, what it would be used for and what issues they foresee that would required and/or justify adding that into the proposal.  It seems very unclear to have a value unrepresented, requested here.", "q1r": 3, "q2": "The metrics are both strong and sound for development of the translations and the viewers/subscribers of the proposal.  This would make this proposal easily trackable for progress throughout the proposals life.", "q2r": 5, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15032, "q0": "This proposal has a good impact on the objective of the proposed challenge. The proposal is aiming to provide translated content in Tamil. The material is taken from the official Cardano documentation and the content will be translated and made into a Tamil video. Tamil is India's eleventh largest state in terms of area and sixth most populous (75 million people). Proposal description is clear and rich. Content translated and turned into video is a good way to convey information and easily reach the community. Information about the Cardano ecosystem will be quickly transmitted, making it possible for many people to perceive, learn and access the ecosystem, as well as Blockchain technology and cryptocurrencies. One positive thing is that the proponent has laid out the indicators right from the proposal's impact section. This proves that the proponent has a lot of knowledge and ability to carry out the project. Know the goal to be achieved and how to do it. In addition, the proponent also recognizes the main risks and has active solutions to minimize the risks that may occur when the project is implemented. At the same time, set the next challenges and contingencies for his proposal. The proponent added a 10% contingency fund on top of total expenses to cover currency fluctuations.", "q0r": 5, "q1": "The proponent sets a goal of 3 days/1 video. All published video material can be checked through Youtube channels. The team will publish the transcript of each video in the Cardano Forum. Besides, the proponent has made a specific plan. Detailed schedule of jobs in each month. However, in my opinion. The roadmap can be more detailed, for example providing a parallel timetable for each specific task. That helps the proponent to more clearly define the progress of the project. The budget requires $11,150. In my opinion the required budget is reasonable for the work and time to be done in the project. Budget details are presented clearly and reasonably. Team members are clearly introduced through the text and attached links of each member. We can determine the identity, role, professional experience of each member. Wherein Dimitri Fernando: Active Member of the Catalyst Community - Former ADA General Manager in Catalyst Circle V3 and community advisor from the foundation 6. Muthiah Duraiswamy: over 30 years of experience handling translations at the Department of Languages ... All members have shown their ability is suitable to carry out the work in the project. They have enough skills and experience and have a good understanding of the ecosystem. Increase the likelihood of project success. However, the roadmap can improve more details.", "q1r": 4, "q2": "The proponent provided information on all exported video materials checked through Youtube channels. At the same time the team will publish the transcript of each video in the Cardano Forum. Measurement progress will be determined through the proposal's roadmap. The indicators are clearly defined such as: Number of followers of LanCardano Youtube Channel; The average number of views, comments, shares... on each video is tracked clearly and transparently. This is a new project. If successful and properly developed will be a new step for the team. Create awareness and interest in the Tamil speaking community. Increase the number of communities and grow the Cardano ecosystem", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15043, "q0": "The proposal aims on delivering a cardano content in Tamil language spoken by India people. The proposer states that there is 75 mil people around the globe that speaks this language, which creates the assumption of the impact of the proposal. The proposer also states, that having such videos will provide education to those who speak Tamil, and can bring more India people to the ecosystem, because as stated in proposal – there are “almost no Indians in the ecosystem, as well as Blockchain technology and crypto currencies” – well, maybe it has something to do with crypto ban in India? Or, at the same time, 75 mil Tamil speakers does not mean they speak exclusively Tamil. Overall, I agree with the problem statement – to have more content in different language in order to bring more people to ecosystem. Nevertheless, I am lacking more supporting data of the solution, because we can not determine whether having Tamil content will automatically lead to the solution. (since I remember that such proposals were already set in the previous fund – different translations – proposer could have provided these data to support the estimated impact. Key metrics stated in the proposal such as number of views and likes are aligned to the solution of the proposal and we will be able to evaluate the impact retrospectively. ", "q0r": 4, "q1": "The time plan is set to 3 months, whilst the proposer plan to have 10-20 videos at the end. I find this range  - 10-20 large. We are talking 100% diff. If the goal would be 18-20 it would seem more reasonable. Despite this large deviation, it does not decrease the feasibility to have at least 10 videos, but I find it incorrect set. The videos will be taken from official IOHK channels, so the source of videos is clear. The budget is set to 11 150 USD, whereas it is divided into 2 250/ month for videos, and when respecting 10 videos after 3 months, it is 750 USD/video. The proposer states, that the rate for word is 0,15 USD, but since the content of the videos is already pre-determined (taken from IOHK channels) this part could have been more detailed e.g. video 1, duration 10 min, 400 usd….etc. I know it would require more thorough analysis, but since there were many proposals as such from the same proposer, assuming translating similar content in different languages, having one analysis could have been performed. Another part of budget is 2 500 for social media campaign and 2 000 contingency fee. To be honest, I completely disagree with contingency based on market volatility. As far as I know, the ADA received could be transferred to a stable coin in case of need, or even for fiat currencies on any exchange, which would lead to preserving the amount. Maybe I am overlooking something, but it does not seem “needed”. The team is composed from 4 members, with vast bio provided and linked in profiles. I find these somewhat less relevant, since it is mentioned that master translators will be still hired. These profiles could have been disclosed instead (or just a representative). Even tough Muttiah Duraiswamy is having tamil as language, it was not mentioned specifically that he will be master translator. To conclude, because some parts of the proposal I find slightly misleading, overextended or not explained fully, I am decreasing one star down. ", "q1r": 4, "q2": "The problem – lack of tamil content – and solution – to create it and onboard new people to the ecosystem is logical, and the solution will try to fix it. As for KPIs, about the progress, we know that the proposer wants to have atleast 10 videos after 3 months, so we can check whether 3 videos were publicized after each month on their youtube channel. Regarding the success of the proposal, we can count interactions of these videos, but unfortunately, it will not tell us how many was on boarded due to this content, so audit of the success of the proposal is not fully possible, since it is mentioned many times that it will bring new people to the community, and there are no metrics to verify it. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Provide translated content taken from official Cardano documentation in the form of Tamil videos about Cardano ecosystem.", "experience": "1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\nOver 30 years experience in Ministry of Languages as Official Languages translator."}