{"id": 417628, "author": "raz", "title": "ArtSuite Cardano Course Bangladesh", "url": "https://cardano.ideascale.com/a/dtd/417628-48088", "category": 26602, "amount": 18750, "description": "Cardano is not very well known in Bangladesh despite a rising population of 165m people and 19.5m people in the capital city Dhaka, the 9th most populated city in the world.", "f6_no_assessments": 10, "f6_rating": 4.566666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1681, "q0": "The problem is raised quite skillfully. It is very justified because the project is relevant and should be financed. Generally speaking, Bangladesh is a very fertile country for us to implement Cardano's technologies, and this is argued through several statements: 1) the number of people living in the country is gigantic (165 million); 2) it is a place that faces several economic challenges, social inequality and poverty being real problems and that hit this population in full - and one of Cardano's most holistic goals is precisely to make the world a better place for everyone, reducing differences 3) there is a large part of the population that is young, according to the proponents about 30% of people in the country are under 30 years old, that is, the age group is quite suitable for us to teach these people to work with technology , changing their realities and also generating profits for Cardano. The project then suggests that some face-to-face workshops be held, in order to teach the fundamental concepts about Cardano (such as what is blockchain, what are cryptocurrencies, what is Cardano and etc). The main objective of these workshops is to educate people to work with the NFT and art sector, and more specifically work with The Art Suite NFT platform. The proponents have other proposals also aimed at this same project, so here we would have a complement of this idea, from what I understand. A very positive point of this project is that a member of the team is native and resides in Bangladesh, which would facilitate the realization of the workshops and facilitate the selection of future students, people who would potentially be interested and dedicated to Cardano's knowledge. and the universe of CNFTs. My only comment on the impact of the proposal would be the following: I would like more details to be presented about the workshops themselves. What topics would be covered, how many meetings would they be, where they would be, how many people are expected for each event, how these people will be invited to participate, how to capture their attention… that is, how would the target audience be educated to work on The Art Suit NFT? Who would the “teachers” be and what teaching approach would they work with, so that people who have never heard of blockchain can absorb the content in the simplest way possible? I believe it would be important for such details to have been passed on. However, I believe the proposal will bring considerable benefits to Cardano, if funded; we know that with the instruction of these people, the number of active members in the community would grow, more CNFts projects would be started, more active tokens minted on our blockchain… that is, what is sought in the challenge would certainly be achieved.", "q0r": 4, "q1": "Speaking in terms of the script, the information is passed on a little unevenly. For example, we know exactly how long the first two phases would last (phase one would last from week 1 to 8, and phase 2 from week 9 to 26). But in relation to phase 3, no notion of temporality is passed, we do not know how long the proposed activities would last (the monitoring and evaluation of the course, the preparation of reports, participation in public forums, etc.). Another comment would be that: it would be more interesting if the level of specificity of the activities was better described. For example, in phase 1: what criteria would be used to define the location and select a teacher? How would candidates be activated? How would the course material be created? I believe that it would be interesting for materials released by IOG itself to serve as a basis for their creation, but some details such as the topics that would have to be studied should have already been defined, in my opinion; so that we would have a better understanding of what this course would be, after all, how the didactic objectives would be achieved. It would be important to have details regarding the execution of the course, the second phase is very long (25 weeks, which represents more than 6 months); we would need to understand what would be done, how, when, by whom and why. In other words, the way the script is presented, our degree of understanding of it is quite limited. Speaking of costs, the total order ($18,750) is broken down in a very understandable way, but I think more detail on the parts would be interesting, so that we have even more understanding of how the money would be used. For example, how would the teacher act? How many hours per week would he work (part-time or full-time?); How can we assess that the value would be fair if we don't know exactly the extent of the contents being taught? Why would marketing and communications cost $500 a month, what would be produced in those parts? How would the monitoring processes take place? It is said that some learning reports would be made after the course, but would they be extensive, in print, online? Why does this part cost more than marketing itself? The understanding we have on the use of funding is ok, but it could be even better if we provide some additional information. Finally, speaking of the team that makes up the project, this part is quite satisfactory because we have a great degree of detail about those involved. We know their names, linkedin profiles, professional resumes, etc.; my only suggestion is that everyone had their roles in the project already well defined, some do and some don't. For example, all of this can be seen in Nazmul's description: “Graduated from Daffodil International University. Enthusiastic about history, finance, sociology & technology. Worked on various startups. In 2020 I met Alfred Moesker. I was introduced to Cardano and I was totally overwhelmed by the philosophy behind the project and the welcoming community (…)”. That said, I like the feasibility of the design, but some improvements are needed.", "q1r": 4, "q2": "When we think about auditability of progress, we are told that “participatory monitoring and evaluation will be carried out from beginning to end of the pilot project”; like this? What exactly would this monitoring be, how would it be built? In relation to the performance of students in the course, how will the assessment of learning be carried out, what will these questionnaires look like? It would be very positive if the proponents had attached an example of a questionnaire of the scope of the proposal, so that we have a better understanding of what is planned to be done to verify the degree of success of the studies. They state that “we will explore the best tools and devices for use in the workshops based on available needs and infrastructure, and aim to measure and receive feedback using tools such as google forms and have publicly accessible information that we will share through The Art Suite website”; what tools would these be? It would be important to have a sense of what is being suggested and how this would relate to the practical development of the proposal. Therefore, I think that the auditability suggested for monitoring the phases is quite valid, but it could be better explored, with more in-depth details, to make it really ideal. An even better way to find out about this would be, first, through better monitoring of the schedule, and for that it would be necessary to deepen the roadmap. Talking now about final results, this part is very good, almost perfect, in my opinion. I say this because proponents suggest various ways in which success would be perceived. In general, it would be “when local educators, students and a Cardano community are alive and well in a school center and center in Bangladesh”; where in these centers “students are inspired, empowered, empowered to create and work in the Blockchain4Good and Cardano ecosystem, having been informed of new livelihood opportunities and, in turn, transformed in their lives.” To measure whether this has been achieved, some suggestions are to look at the number of “students who have successfully completed the pilot course and workshops + students who are satisfied that the learning objectives have been successfully met + students who find employment/internships in the blockchain industry and crypto within 6 months of completion of the pilot project”, in addition to the learning reports that would be formulated. There are also other indicators that say more about the consequences of the project for Cardano itself, such as the number of open Cardano wallets and CNFT projects generated from this initiative. Proponents also provide what would be the vision of success at 6 and 12 month intervals. The only thing that remained pending would be how all this information would reach the Cardano community. Would a survey be generated and presented in Townhall? In general, I think the proposal is highly auditable.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 3093, "q0": "This proposal fully meets the challenge, as it educates, teaches practical skills, facilitates and empowers everyone to participate in the Cardano community and the digital economy, especially is in Bangladesh, the 9th most populous city in the world. Bangladesh is currently one of the world's leading exporters of modern garments, a fast-growing economy in South Asia, a young population with more than 60% under the age of 30 that the proposal is implementing. 18 to 30 years old, so I believe the success rate of the proposal is very high.\nThe proposed solution is to organize workshops to learn face-to-face, teaching them about blockchain technology, the Cardano blockchain, NFT and the art and opportunities in the digital economy such as the Catalyst project . Along with those who are enthusiastic and committed to pursuing further opportunities, they will be working or interning at The Art Suite NFT platform. This is a solution that both disseminates knowledge for the local community to know about blockchain and the Cardano ecosystem while also training qualified people to participate more deeply in the project. As a result, the amount of funding for the project will serve many purposes, making it easier for the project to succeed.\nWhen this proposal is successfully implemented, it adds value to the Cardano ecosystem in the country, creating a launch pad that can be used for many similar projects in Dhaka, the capital city of Bangladesh, as a grassroots movement whose aspirations and new-found connections help them grow into a resilient, interconnected, and increasingly decentralized community of Cardano.", "q0r": 4, "q1": "The team involved here is certainly qualified to implement the proposal well; we know who they are, their background profiles and previous experiences, as well as their Twitter, LinkedIn profiles where we can dig into each of them in more detail.\nI was very impressed with the detailed budget breakdown, with each item being very clear and detailed. The project was implemented in 6 months with sufficient basic costs to implement, with a total budget of $18,750 funded to hire the venue, teachers and training for 6 months.\nThe proponent has not given the next orientation step after the project is completed, because with the human resources trained after these 6 months, the most beneficiaries are the teachers, who create this proposal because students with the knowledge they learn plus learn more about technology. This resource will be very developed to serve the community well if the right direction is known.", "q1r": 5, "q2": "Proposing a roadmap, detailed plan with 3 phases with important milestones according to the plan each week; The plan is measured by KPIs according to the level of completion. During the course of operation, there is monitoring and evaluation, which is shared with the Cardano community in the form of reports of results and experiences, participation in exchange forums and community knowledge sharing.\nThere is an advantage of the proposal that excellent students will be able to practice or work at The Art Suite – Create showcase products for artists, sell NFT copies and support social impact projects in Bangladesh.\nIn addition to this proposal, the authors have 4 more proposals for this and other challenges.", "q2r": 4, "assessor": "z_assessor_2397", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3464, "q0": "The idea of hosting workshops in Bangladesh is good due to the lack of initatives that incentivizes blockchain and Cardano in the region and the tremendous potential of the country, considering, for instance, its population. Proposer also does a great job on exposing why this proposal is aligned with the challenge, going challenge metric by metric and explaining how he will address each one, so, it's possible to say, proposal is in line with challenge (just to summarize, proposal tackles the main definition of succces in the challenge: \"A broad spectrum of people across Asia and connected to Asia, coming together and forming teams to grow our ecosystem\"). Other very positive aspects in the proposal is the fact that some succesful students will be recruited to work in their start-up, which would work as an excelent motivator, and their reference to a similar initiative executed in Ethipia, which may help proposal to leverage their lessons learned and not to start from scratch.\nHowever, proposal could ellaborate more on how this workshops would work (frequency, size of the audience, syllabus, teaching methods,  practical projects, etc) and how to reach and engage the students intially, which would involve a target audice that could be better defined here and a proper marketing strategy. This information would help to assess project full potential and effectiveness.\nTaking it all into account, I agree that this project is generally impactful and addresses the challenge but the scope could still be better ellaborated, specially in the course strucutre and engagement, so my rate is 4.\n", "q0r": 4, "q1": "There's a general time but, as the scope of the course seems to be a bit open at this point, there's not much details on the activities in it and their timings, which makes it hard to evaluate if its sensible or not. I liked though that a planning stage is taken into account (phase 1), before actually start the course/workshops. The long-term vision is also well presented. Budget breakdown is well done and matches the timeline and the scope exposed here. It's good they show the total value by month and seem to cover most of the required costs (including marketing, venue rental, etc).\nAs for the team, there are 6 people committed with background in art, communication and innovation. These people are also somehow related to other Cardano initatives, which is a much desirable experience here. However, a teacher will still needed to be hired.\nAll in all, it seems a feasible project but some details still need to be improved as better ellaborating the course plan and expanding the team to include the main actor in the workshops/course, the teacher, so my rate is 4.", "q1r": 4, "q2": "There are good kpis proposed (in the feasbility section) that will certainly help to assess project success and progress. I liked they alrerady included the number of walltes opened, the satiscation of the students (which will be measured by a survey) and a report with the main learnings, which may help to replicate this initative in other locations. It's also good that exams will be made, this will aid on assessing if learning was effective. However, at least some of these metrics could have targets such as the number of students.  This would be imporant but as this first step is just a pilot, I'll keep the rate as 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5230, "q0": "Bangladesh has a large population, so if Cardano is known by many people here, it is a great thing for the Cardano community.\n\nThe solution proposed by the proposal is to organize workshops to introduce many Bangladeshis to Cardano-related knowledge, especially knowledge related to NFTs, an area that accounts for the majority of developing projects. developed on the Cardano Blockchain ecosystem.\n\nEspecially for the students, after participating in the courses, and they will be accepted as the official internship/employee of the project. This is a very humane job and can create a future human resource to develop Cardano's projects in the Bangladesh market.", "q0r": 5, "q1": "Regarding the implementation plan of the project, I have not seen a detailed description of each month (your proposal was made within 6 months), although there are general evaluation indicators, but it is necessary to break them down, and phased them out to show the commitment of the team members, as well as easy to monitor and adjust accordingly.\n\nRegarding the budget, you would like to propose this proposal is $18,750 for 06 months, divided into categories and costs for each item, quite clear. This budget level is completely reasonable.\n\nThe team participating in this proposal consists of 07 people, a pretty large number, with the experiences of the members mentioned as having a lot of things to do with education and Blockchain. Especially, you are also running the ADA staking pool as \"HOTEL\", so I believe in your team's ability to run the courses for the project in the most effective way.", "q1r": 4, "q2": "As for measuring project performance, I think you should reuse the KPIs that you mentioned in the [IMPACT] section such as:\nNumber of students that have successfully completed the pilot course and workshops. Number of students that are satisfied that the earning objectives are successfully fulfilled of students that find employment/internships in the blockchain and crypto industry within 6 months of completion of the pilot project. Number of teachers/facilitators joining the course and Number of Cardano wallets opened.\n\nWhen evaluating the success of the proposal, you should add specific numbers to the KPIs. For example, 100 students completed courses, 10 teachers join the courses or 100 Cardano wallets opened,...so it will be easier to evaluate your project.", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6110, "q0": "Bangladesh is a sovereign country located in South Asia, in the Asian continent. Has a population of about 165 million (in 2020). 9th most populous city in the world. At the same time, this is also the historical center of the textile trade. Has the fastest growing economy in 2021. However, Cardano is very little known in Bangladesh. The proposed team recognizes that the Bangladeshi context presents great challenges and opportunities. Now is the perfect time to introduce Blockchaink and Cardano education to Bangladesh, and make a digital revolution. The research team explored in detail the context of Bangladesh facing challenges and negative impacts such as climate, poverty, illiteracy, etc. Understanding the historical context, the proposed team set out the objectives. specific and positive solutions for the proposal. Organize workshops to learn first-hand about Blockchain and Cardano technology, NFT and the art of applying financial resources to the course. In my opinion, the proposal impacts the challenge, fully meeting the objectives set by the challenge. Besides, the proponent also recognizes the possible risks and has good solutions for the risks when the proposal is implemented. However, successful proposal development will be a major challenge for the research team due to Bangladesh's negative background. But I hope your proposal will be successful, it will be an open door for the development of Bangladesh and blockchain and Cardano. As well as the first step to the group's success.", "q0r": 5, "q1": "Proposal is highly feasible. we know that the proposed team is qualified to do the project. As they said, they have people who are actively working on previously funded proposals and supporting this one. Right from the start of the project, the team laid out very clearly, detailing what they set out to do, and there were lots of links so we could check and understand more of what the team wanted to say. Here the team has attached a link explaining what is sustainable Razali and ADA. The team has a very detailed plan. The first is about the route. The group has given specific short-term work for the week according to phase 1, phase 2 and phase 3. and long-term vision of 9 months and 12 months. Very well, the team provided some deliverable KPIs. Next is the budget. The team suggested $18,750. accounts for less than 10% of the total challenge budget and is reasonably justified. In my opinion, this funding is very suitable for the complexity of the work of the proposal. Budgets are detailed for each task, time and space are very specific. In general, we know the entire proposal's plan of work to be carried out and what the overall budget will be spent on. Finally, the team of team members. We know their identity, skills, experience needed to do the work on the project. They are highly qualified people who will spend a lot of time on the project, promoting the development of the project. The group consists of 7 members, each person has a short presentation introducing themselves and each person has a profile attached, so that we can understand more about their background, experience, and work. in the past and present. Nazmul Islam Biplob has been a member of the team that understands Cardano since 2020 and develops Thought Food Project 4 in Bangladesh. Alfred Moesker is also one of Cardano's famous OGs. In 2017, his Hotel Ginebra, was the first business in the world to accept ADA payments… I appreciate the feasibility of the project. I will give full marks for this part.", "q1r": 5, "q2": "This is a new proposal. However, the master plan for the proposal is very workable, the team learned very well from the negative background, and the positive advantages of Bangladesh, transparent budget, skilled and experienced team experience, all constitute positive strengths for the success of the project. The team also provides many good methods for measuring and checking the progress and success of the project. Measure and get feedback through tools such as forms and publicly accessible information through The Art Suite website they will share. If the proposal is successful and properly developed, local educators will operate in a center and school center in Bangladesh. Learners will also be supported working in blockchain4good and Cardano. Help them make positive changes in their lives. People Development, Economy, Bangladesh and Blockchain, Cardano... Finally, all the information is provided to facilitate, to seriously and continuously monitor the project.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7301, "q0": "The current population of Bangladesh is 167,920.404 people as of 09/07/2022 according to the latest data from the United Nations, ranking 8th in the world, but Cardano is not well known in Bangladesh due to the low educational level of the population. short. The proposal aims to host face-to-face educational seminars that teach blockchain technology, the Cardano blockchain, NFTs, and art as well as livelihood opportunities in the digital economy, such as Project Catalyst for everyone. , since then in my opinion it has a positive impact on people and the Cardano ecosystem, can help them have the opportunity to learn and understand more about the Cardano ecosystem, through the learning sessions they will share on their own. more confident with knowledge and skills, help them have more income, improve their lives, and enhance their community, helping the Cardano ecosystem to grow more. Another positive point is that for students who show enthusiasm, commitment and effort to pursue further opportunities and have achieved a sufficient knowledge and skills base, at the end of the course will be reward in the form of internships, or working at The Art Suite NFT platform, it will encourage and motivate learners to try their best to achieve the best results, they have the opportunity to work work in the technology sector and they themselves will contribute to creating a strong foothold, for the future development of the ArtSuite platform and the Cardano ecosystem in Bangladesh and Asia in the future. Also the project can create a capable workforce to power other projects that are developing on the Cardano ecosystem. The project sets a sustainable business goal through The Art Suite, when the platform is profitable, they will self-finance the next educational project like this one and continue to expand. From the foregoing I think this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan of the proposal describes in detail, lists the contents in chronological order, so it is easy to track and evaluate, the project is divided into 3 phases and implemented in 6 months including the standard time. prepared, summarized and reported. Strong team, with rich experience and skills of team members, suitable to be able to successfully implement the proposal, can be viewed through the Linkedin, Twitter and Web site provided by the project. Based on their capacity and experience, members are assigned appropriate and clear work. The budget is clearly presented for each item that is easily identified, and reasonably allocated for each item to achieve the set goals. The proposed team also considered the challenges and risks and should\nu set out restrictions for successful implementation of the proposal. From the above I think it is very likely that the proposal is successfully implemented.", "q1r": 5, "q2": "The project's roadmap is described in detail according to specific timelines, so it is easy to follow, The implementation solutions are presented clearly and easy to understand to solve the given goals. The project has its own Web site. The KPIs are clear and appropriate to determine the success of the project. The project has built a team of management and monitoring and evaluation from the beginning to the end of the pilot project. Metrics can be easily measured publicly via the project Web site, which can be responded to by tools such as Google forms. From the above analysis I think the Information provided is sufficient to assess the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9112, "q0": "Bangladesh is a populated country, facing many challenges such as poverty, illiteracy, climate change…but it is also one of the largest exporters of modern garments in the world and one of the fastest growing economies in the 21st century. In addition, more than 60% of Bangladesh's population is under the age of 30. Therefore, Bangladesh is a country of many challenges and opportunities. Meanwhile, Cardano is little known here. The proposal presents the idea of ​​organizing workshops for face-to-face learning, will teach about blockchain technology, Cardano, NFT, job opportunities with Catalyst and access to internships at The Art Suite NFT Platform. Target audience is 18 to 30 years old. As such, the goal of this Proposal is in line with the challenge's goal of increasing people's awareness in East Asia about blockchain, Cardano thereby growing Cardano's ecosystem in East Asia. The proposal also presents the risk and the solution to overcome it.\n", "q0r": 5, "q1": "The project is expected to be implemented in 3 phases: phase 1 (from week 1 to week 8) will find a venue, hire teachers, create documents, decide on the duration of the workshop and course; phase 2 runs the course and phase 3 is participatory monitoring and evaluation done throughout the course and shared with the Cardano Community in the form of reporting on results and experiences, attending discussion forums exchange and share knowledge with the community, hire some students as interns or staff at The Art Suite. The project has a clear roadmap that can be successfully implemented.\n\nThe proposed budget is 18,750 USD, including project management cost 4,500 USD, venue rental cost 1,550 USD, marketing and communication cost 3,000 USD… This cost is quite detailed and reasonable.\n\nThe project implementation staff consists of 7 people, including many people who are knowledgeable and passionate about Blockchain such as Alfred Moesker - One of Cardano's renowned Ogs, Razali Samsudin - Catalyst Proposal Mentor, Co-Founder of Sustainable ADA, Contributor at Cardano AIM, Positive Blockchain, Cardano4Climate, Catalyst School and Adatruth… With such a strong team, the project can be carried out successfully.\n", "q1r": 5, "q2": "The proposal provides a way for everyone to monitor and evaluate the project from beginning to the end of the project. Learning goals, student progress will be monitored through Assessment of Learning, Assessment for Learning techniques, and Formative testing. The project will measure and receive feedback using tools such as google forms and publicly accessible information shared through the The Art Suite website. Therefore, the community can control easily.\n", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10830, "q0": "This proposal is extremely useful and positively achieves the objectives of the challenge. What we are trying to find during this challenge is to favor Bangladesh and Cardano at the identical time. The author starts with the question: \"WHY it is important to bring education about blockchain and Cardano to Bangladesh\". It's a great way to start, it explains the importance of the project. It is very interesting to see how the people propose the content in the workshops and solutions. What is the novelty and appropriateness of solutions? The problem and feasibility of the project are clarified. Bangladesh, through the knowledge, and the content within the course can make the most of the opportunities of the Cardano ecosystem. As stated here by the proponents, it answers some difficulties regarding membership in Cardano. Starting with the very fact that the majority are completely unaware of what Cardano and Catalyst are. Then we have got a roadblock, which makes it difficult for everybody who doesn't have English to attend community meetings. In short, it is a source of catalyst for new members. Creating opportunities for natives of the country can take pleasure in the utilization positions generated by Cardano. Whether by participating as Catalyst project team members or perhaps developing your Dapps, acquiring Ada, learning to delegate, buying NFTs... and clearly, the Cardano ecosystem should benefit moreover. As new participants join Catalyst, the numbers of Ada holders are going to be added; new digital wallets are going to be created; more people transacting on our blockchain; with this, we can increase investments in our Dapps; children within the technology area are going to be motivated to be told about our technologies, who will become Plutus pioneers. In short, the gains are many. However, I would like more clarity on how these face-to-face meetings will take place. Where will they take place? What topics will be addressed? Who will be responsible for each part? Another important thing to know here: How many people will be in each meeting? How do they attract participants, as apparently blockchain technology and Cardano are still little-known subjects in the country. It would be interesting if the proponent could clarify how they would make people aware and persuade them to participate in the meetings. One positive point here is that the author has given KPIs for each goal of the project, this creates a sense of trust for each purpose, we know what to do and the results to be achieved. I will give 5 if the above suggestions are explained in more detail.", "q0r": 4, "q1": "I think the project's roadmap is lacking in specificity, making it impossible to create a full understanding. The project is divided into 3 phases and each phase has contents. However, the operation in these contents is not clarified. For example: \"Phase 1: Week 1 to 8: Decide on the location, hire a teacher, create the material for the course and lessons and decide on the duration\". We have many things at stake here during pre-production, such as: Where is the location? What locations would be suitable? Identify a teacher or speaker. What are the criteria for choosing a lecturer or a speaker? Where will the course materials be referenced? Who will be responsible for that? What topics will be addressed at each meeting? How many sessions will the course have? How frequency? How long will each meeting be? This part of the planning should be better explained. Regarding the budget of the project, it is also explained superficially. We know \"Project Management (6 months) = $750 x 6 months = $4500; Teacher/facilitator for workshops = $750 x 6 months = $4500; Monitoring and evaluation = $600 x 6 months = $3600\" but don't know about what they will do, the number of hours they work. \"Venue (school/hub) = $1550\", but don't know how long. \"Workshop and course design = $1600; Marketing and communications = $500 x 6 months = $3000\", but there are no details on how it will be implemented, and what strategy will be applied. Finally, about the team, this part builds a lot of trusts. We know their names, and how they relate to the Cardano ecosystem. It's positive that we can see some of the experience they've had so far in the LinkedIn, and Twitter profiles they attached. I think need to improve on the project roadmap and budget.", "q1r": 4, "q2": "The proponent offers a relatively good way to monitor the development of the project. I believe it will be interesting if we get direct feedback from the participating students, and from those who have trained through the school/hub activities. However, how often will this information be updated? Would online and collaborative tools are created. The relationship between the proponent, their mission, and the Cardano community needs to be established. Regarding success, the author first talks about the individual success of the project \"when local educators, learners, and a Cardano community is alive and active in a hub and school center in Bangladesh.\" And especially the success related to Cardano \"learners are inspired, enabled, empowered to create and work in the Blockchain4Good and Cardano ecosystem, having been made aware of the new livelihood opportunities and in turn have their lives transformed.\" However, how do be aware of all this happening, and how this information is tracked. To demonstrate that such effects actually occur the proponent needs to provide ways to verify such a scenario. Therefore, I think audibility is good, but it can still be qualitatively more detailed and varied.", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11293, "q0": "This project aims to bring Cardano to Bangladesh. Bangladesh is the 9th most populous in the world, its economy is consistently among the fastest-growing in the 21st century, it is a good time to introduce blockchain and Cardano to Bangladesh. The team offers a very helpful solution, through Group Education Workshops that facilitate and empower people to participate in the Cardano community and the digital economy, and access internships at The Art Suite NFT Platform. This is quite an interesting solution and clearly shows how it will add value to the Cardano ecosystem. The proposed key indicators and goals match the challenge. They increase the number of active participants in the ecosystem, increase the number of wallet openers, and increase the number of Stake Pools and Stake Pool, Operators. The team also foresees risks and challenges and offers solutions. This proposal can scale to address future challenges.\t  ", "q0r": 5, "q1": "The information provided by the proposal is quite complete and detailed. The Proposing Team has the experience and qualifications necessary to successfully implement this proposal. The budget also seems reasonable, very clearly broken down into identifiable items. The required amount for the group is $ 18,750, divided among the tasks of Project management, hiring Teachers, renting locations, and marketing communications,... The budget is relatively reasonable for 1 project to be implemented. Within 6 months, the amount of content created was quite large. The proposed implementation timeline is clearly outlined and broken down into specific sections. Work will be carried out in phases, Phase 1 (Weeks 1-week 8): Decide on the location, hire teachers, and create course materials, Phase 2 (Weeks 9 to 26): Run the course, and phase 3: Course monitoring and evaluation. The team also has a long-term vision of 6 months, and 12 months with the desire to build a Cardano community in Dhaka.\t  ", "q1r": 5, "q2": "Sufficient information is provided to assess the progress and success of the proposal. The community can judge the progress and development of the project by the number of people taking the course. Assess Student Learning Objectives and progress through end-of-course and end-of-course tests. The success of the proposal comes when local educators, learners, and the Cardano community are alive and active in Bangladesh. This proposal is a new one but I find the group full of enthusiasm and ambition to want the people of Bangladesh to have a better life.\t ", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13378, "q0": "The elements described in your proposal are well suited to the challenge. Bangladesh is a country with a large population of more than 165+ million people and its capital is the 9th most populous city in the world, so this is a fertile ground for us to plant the human element of ideas, educate about Blockchain knowledge, facilitate and empower everyone to join the Cardano community, in addition, according to a study, more than 60% of Bangladesh's population is under 30 years old, and this is the aging labor, is young and has a lot of positive energy.\nYour solution is to host live workshops that will initially teach blockchain technology, the Cardano blockchain, NFT, and the art and livelihood opportunities in the digital economy, such as projects. Catalyst project, after the course, is a form of reward or job opportunity at your The Art Suite NFT platform, thus opening up a lot of career opportunities for young people who love technology and Blockchain.\nI also hope that your project will be successful and resonate strongly in Dhaka, thereby creating a wave of other successful projects and for the followers to have more faith in the company. Blockchain technology in the future.", "q0r": 5, "q1": "The roadmap for your plan is divided into 3 phases, phase 1 and phase 2 have a specific time limit, but with phase 3 I have not seen you outline a specific time for this phase 3. Can you explain more clearly?\nEach course lasts 6 months, so can you tell me how much each of your courses is worth, I have a suggestion that you should give 1 or 3 trial lessons to see if you have curiosity. Are you students here?\nNext to the budget section, I see that the funds are allocated to the items clearly and coherently, but there is the project management part that I still do not understand very well, who will this manager be paid, and what work do they do on this project, how many teachers do you plan to hire? If it's specific then I think it's very good.\nBut anyway, I hope the project succeeds, and you've done your best in balancing the accounting with the right amount of work.\nThe information about the team members described in the proposal is complete, and their experiences indicate that the team is in complete control and capable of succeeding with these project plans.", "q1r": 4, "q2": "I think it will be difficult for the community to audit the success of the project because you have not given a specific number to call the success of the project.\nIn my opinion, you should set a specific number for each goal after a certain period of time, it will be easier to quantify the success of a project.\nFor example, the course will be approximately 50 students.\n3 excellent students will be recruited into your group to work, the number of newly registered students for the next course is 90, ...\nAnd the information about KPIs and targets needs to be reported to the community, so you should update to public service so that the community can click on it to see and track progress. your project.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Educational workshops teaching practical skills, enabling and empowering people to join the Cardano community and digital economy, and access internships at The Art Suite NFT Platform.", "experience": "The Art Suite was created in December 2021.\nOperational in January 2022, we created a working product in a short time, and we are successfully onboarding artists, selling NFTs + supporting a social impact project in Bangladesh.\nTeam Hotel Ginebra BCN, operator stakepool HOTEL."}