{"id": 417974, "author": "eagle", "title": "It is not straight forward for non-", "url": "https://cardano.ideascale.com/a/dtd/417974-48088", "category": 26602, "amount": 1950, "description": "It is not straight forward for non-English speaking users to onboard into the Cardano ecosystem.", "f6_no_assessments": 11, "f6_rating": 2.121212121212121, "videos": [], "media": [], "f6_assessments": [{"id": 1922, "q0": "The proposer only mentions the problem without giving us supporting data such as English proficiency, crypto user rate, etc., especially why focus on Vietnam as the targeted country? The proposer might also want to consider further collaboration with the local Cardano Vietnam community, as this challenge needs to gather the team in Asian countries?", "q0r": 2, "q1": "The proposer mentioned about the team has 10 years of mobile apps experience, but unfortunately, there is no reference / supporting data at least LinkedIn profile or others? In addition, the proposer also does not mention the translator's experience in translating crypto \"language\" in the past, which I found is the challenge to reaching mass adoption. The timeline and number of teams to make this proposal successful are also not mentioned in the proposal.", "q1r": 2, "q2": "Unfortunately, there is no timeline in this proposal and KPI metrics on how to monitor this proposal. Surprisingly the proposer mentioned about users Vietnamese speaking user in Africa is their main target? I believe this is not aligned with the proposal Challenge / the intention of this proposal? The proposer should describe at the beginning of this proposal, who is their target market? I would suggest if the proposer aiming to African-Vietnamese speaking, to work further with the local communities and build this wonderful app they intend to with a clear target, team, and timeline.", "q2r": 1, "assessor": "z_assessor_2289", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2582, "q0": "The problem raised by the proponent is appropriate because not everyone in Vietnam can speak English, his solution is aimed at helping Cardano users in Vietnam more easily participate in the process staking by creating a mobile application called Pool Peek Mobile and translating the application into Vietnamese. Staking ADA is not too complicated, but for those who are not familiar with technology and do not know English, it is really a barrier. So I totally agree This proposal is suitable for the challenge.", "q0r": 5, "q1": "Pool Peek Mobile is an application that has been translated into many languages ​​and it has an average rating of 4.5 stars on Google Play and Apple App, which is the advantage of the project. However, the information about the people implementing the project is quite vague. I don't know who he is, he said that he would use a professional translation service if he provided more expected information about who the translator is, they have a lot of knowledge about the background of the translator. We, especially what it has to do with Vietnam so that the translation is easy to understand and close to the meaning of Vietnamese, it will be more informative. Regarding the budget, the proponent asks for a budget of $1950, including $1550 for translation and $400 for development costs. However, I think the proponent should provide more information about the more specific content such as translating the display functions, information about the pools, how many a4 pages it is expected to be solved, and how to complete it. how long will it take, 1 day, 1 week, or any specific amount of time? about development, costs should also clarify what the job content is so that it can be assessed whether the funding is appropriate or not quantitatively. or have detailed work content, will you know if this budget is missing or not? Finally about the implementation roadmap with the information provided by the proponent I do not know when it will start or when it will be completed. In short, since the project is an active application and many different languages ​​have been integrated, the feasibility of the proposal is there. However, the proponent considers adding my improvements.", "q1r": 4, "q2": "\"I don't know the start date, end date, and development of the proposal. However, the progress of the project can be tracked by viewing it published on both Google Play and Apple App Store in Vietnamese.\nThe proponent defines project success as \"Thousands of Vietnamese-speaking users in Africa will download and use the app, learn how to stake their Cardano, buy and authorize Ada for the stake pool community\" I don't understand what the proponent means. Is the target audience of the project all Vietnamese people in general or only Vietnamese people in Africa? In short, the audit ability of the project is there but it is weak. Proposers can improve with my improvements.\"", "q2r": 4, "assessor": "z_assessor_2323", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 2628, "q0": "The proposal does not clarify the problem to be solved and the content will address the specific problem\nJust saying that it will translate an application into Vietnamese language, not to mention how many people are interested in Cardano in the Vietnamese community, while I know groups in Vietnam are very active, so will this work? is it necessary?", "q0r": 1, "q1": "The proposal does not state-specific information on implementation capabilities, attached documents, and links\nLack of information about the actual number of participants, information about work experience, blockchain experience, and the field to be worked on, in addition, information to authenticate project people is also not available.\nNeed to provide more detailed budget allocation over each timeline, along with the amount paid for personnel\nRoadmap and milestones to be achieved also need to be listed in more detail\nThe technical and risk aspects are covered very lightly", "q1r": 1, "q2": "Is the number of Vietnamese in Africa large enough to really need to do as suggested? They will actively seek out more developing Vietnamese communities, where resources and information are not lacking\nThere is not enough information on the evaluation of project progress after being funded in a reasonable and periodic way, at least including Roadmap and milestones, KPIs to determine success, Clear solution, and access information channel to update project progress", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4444, "q0": "Proposal's Title need to be clear next time, I think proposer copy-paste in the wrong section.\n\nI've tried the web app. It's incredible and useful for Cardano communities. But one thing to be confirmed: as this proposal ask to translate the web in Vietnamese, why choose Vietnamese? If proposer give the 70+ million Vietnamese speakers in the world as reference, why not choose Indonesian language since they have 300 million speakers in 2022? If proposer can give the reason why, I think it can be consider for the communities because the reason behind it is understandable.\n\nIs it will be great if proposer ask for translating their app in entire Eastern Hemisphere Town Hall Hubs? (Japan, Vietnam, Indonesia, Korea, Philipines, Malaysia).", "q0r": 2, "q1": "I can not find any languages option in the web app, so I have to check the app's update (version history) about the languages added in to it.\nWith simple information about the budget in this proposal, I think proposer could add who are the team who will do the translation tasks. It will be nice if we can check their relevant experience. Also, timetable in the proposal is needed too! Next time, if Proposer ask for a funding again, Proposer could add realistic timetable in the proposal.", "q1r": 3, "q2": "Since it's a translation task for an app, roadmap isn't needed in the proposal. And the success of it can be check in version update (on App Store / Play Store).\nOne thing I want to mark: Proposer need to double check the proposal. Because there was some typo in it. First, the title. Secondly, \"Vietnamese-speaking users in Africa..\" That make me have to check your profile activity if you have a proposal in Africa challenge or not. And yes, there is.\n\nIt's good, but please double check it again next time.", "q2r": 2, "assessor": "z_assessor_2553", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5231, "q0": "The title of this proposal “It is not straight forward for non-” is missing something“, I guess it might be “It is not straight forward for non-English” but this proves that the proposer has not yet paid attention to investing in checking the proposal because the title is one of the first and most important pieces of content to be approached and seen by PAs and Voters.\n\nYour suggestion is to use Pool Peek Mobile to assist users with the staking process and translate the app into Vietnamese. However, the methods you suggested are quite rudimentary, mainly talking about the desire to find a translator for your app.", "q0r": 1, "q1": "This proposal did not have a specific plan, and it was explained that it was an easy task to complete and did not need to be detailed. This is completely unconvincing.\n\nThe budget you ask for is $1950, which is quite a small budget for a project, and you are allotted for two costs: translation costs and development costs. However, They are still general.\n\nProject participants are not allowed to specify contact information for the community to verify, so this proposal is not highly reliable.", "q1r": 1, "q2": "To measure the success of this project, you mentioned that the app is listed on Google Play and Apple App Store in Vietnamese. This is not reasonable because when you upload the app to the 02 stores above, you can completely display the app in Vietnam without translating the app into Vietnamese.\n\nMeasure the success of the project you write as “Thousands of Vietnamese-speaking users in Africa will download and use the application, learn how to stake their Cardano, and purchase and delegate Ada to a community stake pool” but in reality, Vietnam is in Asia, not Africa.", "q2r": 1, "assessor": "z_assessor_2678", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8352, "q0": "The proposer has not provided any information of how his poolpeek mobile application will work and its functionalities and use case of the application. It is just a brief saying they will translate English into Vietnamese but what information will be translated is also not mentioned in the proposal and Hence the proposer has failed to address the challenge and I strongly disagree with the proposal.", "q0r": 1, "q1": "The proposer has not provided enough information to support their experience required for this proposal but has just given a vague idea of what they do and also has not provided enough information about their team which will be working on this proposal. Proposer has also not provided reference links to support their proposal. The budget has been mentioned clearly which is 1950 USD and breakup cost is not reliable. The proposer has not mentioned the challenges or difficulties faced during implementation of the proposal. Hence I completely disagree with the experience and plan presented.", "q1r": 1, "q2": "The proposer has not mentioned the roadmap with the steps for the completion of the proposal  and the provided information is not sufficient to audit the progress of the proposal after the funding as no relevant information is provided in the proposal. The proposer has not identified the problem and has failed to provided a working solution that addresses the problem which is most likely to succeed. Hence I completely disagree with the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 1, "assessor": "z_assessor_2976", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10071, "q0": "- A project proposal does not provide enough information and does not address the need to solve problems related to the cardano blockchain technology industry.\n- With today's society developing day by day, the community is always busy with the main work, so you need to have goals to meet the knowledge needs of the development potential of the cardano blockchain technology industry to the community. . easily and quickly.\n- I tried to check the project information but I can't see the development goal or link to the personal information of each of these project members.\n- I have a little advice for you, if you can provide enough evidence of the development of the project towards the cardano blockchain technology industry and more information and about the member's experience can increase the strength attractiveness of this project.\n- I disagree with the impact of this project.", "q0r": 1, "q1": "- With the plans you need to provide for the project to have development goals, and you need to have the processes to put the parameters in order to show the development of the project towards the cardano blockchain more clearly.\n- You need to provide more details about the budget figures that the project needs.\n- You need to provide more personal information of each member participating in this project.\n- I disagree with the feasibility of this project.", "q1r": 1, "q2": "- a successful project needs to have enough information and ideas to improve quality towards the online community for the benefit of the cardano blockchain technology industry.\n- I have a sincere advice for you to provide a full development roadmap as well as present the project with clearer and more specific goals. This will help fund the catalyst fund this time.\n- I do not agree with the audit of this project.", "q2r": 1, "assessor": "z_assessor_3146", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 11543, "q0": "The proposal's goal is straightforward: translate the pool Peek app into Vietnamese, which will almost definitely increase the app's availability in Vietnam. This solution is coherent with both the Cardano ecosystem's scalability goal and the campaign setting in which the proposal was published, as it increases the likelihood of Cardano adoption in the East Asia region. Since many Vietnamese-only speaking people live outside of their home country, the effect is likely to be both local and global. ", "q0r": 5, "q1": "The project is likely to succeed in my opinion because the goal is relatively simple to achieve. While there is no specific timetable or roadmap, the given goal can be accomplished without it because it is highly improbable to involve any substeps. The team has previously successfully translated the app into several languages, according to the proposal, but there is no relevant link on the main developer, not even on the provided website. The budget is modest and straightforward, consisting only of translation and development costs.", "q1r": 4, "q2": "There are no defined KPIs, milestones, or delivery dates. WhileI assume that is because the only deliverable is the translation that is the main objective. The only way I guess the project could be auditable is the linked website mentioning their Twitter account, which has no recent posts or activity. The team could have decided to make the \"number of downloads of the app\" and  \"new vietnamamise accounts: as a KPI. Based on the issues mentioned above, it may be difficult to monitor project activity in general. ", "q2r": 2, "assessor": "z_assessor_3256", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11703, "q0": "the team has a working app that aims to teach users about getting started with cardano. The proposal purpose is to ask for funding to translate their content into vietnamese. \n\nThe proposal is defnitely aligned to the challenge setting. I do have reservations on the impact this project may bring, but i dont speak vietnamese myself and cant vouch for the depth of materials available in the language. i find that in english, the materials explaining the basic concept of cardano is already plenty, and i cant imagine the impact of the existing app in english, and how much incremental value it may actually bring to cardano. HOWEVER, i note that they are working to translate it to vietnamese, thus, i am writing this assessment to remind voters to: \nNOT ASSUME that our ease of access to information in english is directly correlated to what is available in vietnamese. if you feel strongly about developing the vietnamese cardano community, then by all means, do vote ahead.\n\nother than that, nothing much to add for such a simple proposal. ", "q0r": 3, "q1": "budget breakdwon is simple, and no further comments for that part. For the timeline however, the proposer demonstrates confidence that it is easily achievable, but it would help if he or she could still outline timelines to abide to. What is simple for them? can we expect the vietnamese app to be up in a week? or a month?", "q1r": 3, "q2": "auditability is simple enough: is the vietnamese version of this app in the app stores. But this again ties into my comment in the previous section, what is a timeline to expect the app to be developed? Will it be a month for us to check back in? or would it be a week?\n\ni hope that the proposer takes the feedback on a positive note. i understand that the idea can be very simple in his or her head, but readers, assessors and voters, would need more details in order to gauge the project execution ability in a timely manner.", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12407, "q0": "[Disclaimer: The proposer has submitted 2 proposals that are related to hiring a translator team to translate their app to (1) Vietnamese and (2) Swahili. These proposals are very similar in their goal and structure. As a result, the assessments for this set of proposals will also be similar]\n\nThe premise of this proposal is pretty simple which is to translate their Cardano Stake Pool app to have Vietnamese language support. The project is definitely aligned with the challenge setting objective of growing Cardano’s outreach and adoption in East Asia by providing accessibility to users who can understand crypto terminology better in their native language. One challenge I think that was not discussed sufficiently (in my view) is regarding how the proposer will on-board users since presumably the Vietnamese users who are already using the app can understand it in English already.", "q0r": 4, "q1": "The proposer is the developer of the app that is going to be translated, which by the claim of the proposer has already been translated in several languages. After doing a bit of searching on the internet, it has been translated to Korean and French based on the latest update note on App Store. One thing for voter to note is that the proposer’s claim of the app having a 4.5 average rating on Play Store and App Store while true, only has 21 reviews on Play Store and 3 reviews on App Store.\n\nEven if as the proposer stated that the proposal is easily achievable since they have already translated the app into several languages, I still think that they should’ve provided some kind of timeline even as simple as a start and end date since it will allow us to evaluate the project better and it can act as an auditing tool to track the project’s progress/completion.\n\nThe budget has been divided into identifiable items, such as the translation fee and the development cost. I personally would have liked if the proposer included the breakdown for this cost. For example the translation fee can details the number of words or total workhours and the rate requested (can be word count basis or work hours basis) by the hired translation team so that the budget can be evaluated better.", "q1r": 3, "q2": "I think the proposer should’ve added KPIs to measure the project’s success regarding how many Vietnamese speaking users downloading the app, this was mentioned briefly but the proposer did not explain how the downloads from that specific demographic can be tracked and reported. Additionally, the project’s progress is hard to audit since while the update note can be easily seen via App Store or Play Store, the proposer didn’t mention the set end date for this project and what the target timeframe of implementation is. ", "q2r": 2, "assessor": "z_assessor_3408", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12718, "q0": "The Project correctly addresses the Challenge Topic of \"Grow East Asia, Grow Cardano\" when it aims to onboard users to the Cardano Ecosystem.\n\nThe Proposer's problem and solution are identified. However, The Proposer mentioned \"non-English speaking users\" in the Problem statement while his/her proposed solution is made for Vietnamese-speaking users only. This might cause huge expectations for readers and confusion later when they find out that The Proposer's proposed solutions are for a group of non-speaking users only.\nI find The Proposer's proposed solution beneficial for Cardano Eco-system as it gives 70 million Vietnamese potential users a direct platform to read the information on Cardano's Ecosystem and pools. However, the actual impact of the solution is questionable as it depends on the popularity of the Pool Peek Mobile App itself. While the popularity of the app is very important for analysts to evaluate the Proposals' value and its impact on Cardano, it is not mentioned anywhere by The Proposer. The Proposer needs to explain this point with more explanatory information on this matter.\n\nI believe The Proposer's proposed solution can be scaled to other languages, not just Vietnamese alone. However, the impact of the solution is undetermined as there are other competing translation apps, which Google Translate is an important mention.\nFor the above reasons, I give The Proposer a 2/5 score for Impact.", "q0r": 2, "q1": "The Proposer has successfully launched the Pool-peek App, so I believe in his expertise and ability to carry out this proposed project. I give them a high score for Part \"The Proposer\".\nThe Proposer's budget is relatively well-defined, as there are not many items to be paid for by this simple project. I suppose as the budget only covers 2 cost items that The Proposer might have already paid for in the previous stages of his/her product, his/her numbers are doable.\nThere is no timeline provided by The Proposer, which makes the Project unauditable. Therefore, I give The Proposer the score of 1/5 for his/her lack of effort in putting together a properly prepared timeline to keep track on.\nIf The Proposer is already well aware of the timeline, he/she should have shown it to the Cardano Community so all of us can have a grasp of the execution duration. The idea is \"Easily achievable\" but after how long? 1-2 months is reasonable for this kind of project, but 5-6 months would be needed if The Proposer wants to cover broader materials and contents.\n\nAs the project is simple and lies in the expertise domain of The Proposer, I think the execution risk is low. The most important criteria of execution risk for this project is the timeline. I suppose the project can be considered \"successful\" if The Proposer can launch a new language available in a short time, say 1-2 months.\nFor the above-mentioned reasons, I give The Proposer a 1/5 score for Feasibility.", "q1r": 1, "q2": "I believe in The Proposer's understanding of the project, as adding another language is repeating what he/she has already implemented successfully within his/her Pool-Peek App. I give him/her a high score for Part Auditability, due to 3 reasons: 1. The project is simple in terms of budget and feasibility 2. The Proposer has proven to be experienced with his expertise in domain 3. Thanks to the 2 mentioned facts, the Project's probability of success is high.\nHowever, no specific KPIs are provided in this Proposal, which reflects The Proposer's lack of effort in showing the Cardano Community what he/she wants to achieve with this Project. Quantitative indicators like the number of users per day or the number of comments per day, or qualitative indicators like the rating of the app on Google and Apple stores should be added to the Proposal by The Proposer to make the Project more creditable.\n\n\nI give The Proposer a 1/5 score for lack of specific KPI but a 3/5 score for the ability to complete the project, which makes the average score for Part Auditability 2/5.", "q2r": 1, "assessor": "z_assessor_3470", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We built Pool Peek Mobile to assist users with the staking process. We will translate the app into Vietnamese (70+ million speakers).", "experience": "Pool Peek mobile has already been translated into several over languages and has and average rating of 4.5 stars across the Google Play and Apple App stores."}