{"id": 418484, "author": "nvhieu", "title": "Catalyst Events 4 Vietnam Students", "url": "https://cardano.ideascale.com/a/dtd/418484-48088", "category": 26602, "amount": 33040, "description": "Many Vietnam University students are unaware of Project Catalyst's funding campaigns and the opportunities which are existing.", "f6_no_assessments": 46, "f6_rating": 4.58695652173913, "videos": [], "media": [], "f6_assessments": [{"id": 14245, "q0": "I appreciate the impact of this proposal. I propose organizing activities to connect, motivate, and support students to participate in Catalyst. A problem-solving challenge Solving one aspect of the challenge is \"How to promote the development of the Cardano community in Vietnam—a country in Asia.\" The proposal can be expanded in terms of audience and region. In the future, the proposal will provide the community with a blockchain knowledge base, creativity, and many ideas to build good proposals to help diversify the Cardano ecosystem. They will organize online events and work on the Cardano and Catalyst projects for students. Specifically, they target information technology students at universities and colleges in Vietnam. It is suggested that students have a lot of good and creative ideas but often face challenges in project writing and mobilization. capital. I agree with their argument because students are knowledgeable in information technology and can easily learn new skills if properly trained and guided. They will contribute to many good projects in the future. Besides, having support from highly qualified lecturers will help complete the projects. This is the sustainable value that this proposal brings. The proposal suggested that they should tackle the challenge of growing the Cardano ecosystem in an inclusive and supportive way and attracted many students to submit ideas to implement the proposals. I agree with their risk management and how they describe the solution. However, this is a proposal to focus on developing the Cardano community in Vietnam, not Asia, so there is no absolute score yet. Hopefully, this will spur the team to continue innovating, optimizing the offer, and expanding across Asia.", "q0r": 4, "q1": "They planned the implementation of the proposal. It is proposed to define a total implementation time of 5 months, with a specific work plan for each timeline. The timeline they give is reasonable; the work is planned specifically and fully. Notable for their objectives: At least 24 events will be held at the university; about 1000 people attended the event; we will conduct at least 06 surveys; at least 20 proposals will be sent to the idea list at the end of the project; 150 students attended seminars and sharing sessions; and there are 40 sessions dedicated to 1-1 support. These are big and smart goals. These KPIs, along with photos and videos of the event and other materials, will be published on the website: cardano2vn.io. At the same time, they will provide monthly reports on GitHub (https://github.com/cardano2vn) to the community. The fundraising budget accounts for more than 13% of the total challenge. Regarding the budget, the budget has a detailed spending plan for the following items: Event Facility Cost; Events Hosting; Guest Fees; Surveys and Reports; Dedicate people to support; Incentives for the student who has submitted a qualified proposal to IdeaScale; Project Management; and Budget for Marketing. However, there is no additional budget option. Besides, it is proposed to organize eight events/universities. But almost all events are held on-site. Instead, it is possible to organize an on-site event for initial marketing, and then organize online events so that all students of the schools can follow together, reducing the cost of event facilities, event hosting, and guest fees and attracting many more, not just students of previous colleges/universities. About the group: The group consists of 5 members. Although there is no assignment of tasks for each member, the experience of the members is consistent with the tasks in the proposed implementation plan. Praise for the proposal because their team has 3/5 members who are computer science researchers, lecturers, and deans of information technology at some prestigious universities in Vietnam. It proves that they are ready to start and operate the project and have a network of connections to universities and colleges in Vietnam. The community can easily verify their identity via LinkedIn, Twitter, or Facebook and the members all have qualifications. I rate the absolute score for feasibility.", "q1r": 5, "q2": "They defined success. The proposal has indicators of project success, such as: at least 24 events will be held at universities; about 1000 people attended the event; At least 06 surveys; at least 20 proposals will be sent to the idea list at the end of the project; 150 students attended seminars and sharing sessions; and there are 40 sessions dedicated to 1-1 support. The results can be easily checked; they will be publicly announced in terms of quantity (in their monthly report at https://github.com/cardano2vn) and quality (via grant proposals in the future, possibly Fund 10). When the project ended, about 1000 students from 3 universities became aware of the Cardano blockchain, which Catalyst's funding model relies on. At least 20 projects will be submitted to the idea round, many of which will be funded and put into operation. Furthermore, students can join Catalyst in a variety of roles, such as: proponent, PA, vPA, challenge team, and voter. They will experience the new reality of a DAO model. Students are the potential workforce for the Cardano blockchain. They will diversify the ecosystem and ensure the sustainability of the platform. The success of the proposal has a positive impact on Challenge and Cardano. This project will bring knowledge, job opportunities, and opportunities to realize good ideas to help develop the Vietnam Cardano community in particular, the global Cardano community in general, and contribute to the development of the Cardano ecosystem. Thai Cardano This is a follow-up proposal from a previously funded project in Foundation 7: Catalyst Events for Vietnam Students. They had their first project funded and the results were quite successful. However, the website: https://github.com/cardano2vn does not update the project's progress and results as described. This is remarkable. The community highly cares about transparency, but they haven't done it yet.", "q2r": 2, "assessor": "z_assessor_3950", "no_vca": 10, "ne": 6, "ng": 3, "nfo": 1, "vca_o": 2}, {"id": 14086, "q0": "We think the idea is very good and necessary, and theoretically fits the purpose of this challenge.\n\nStudents are the right target to support the growth of the Cardano ecosystem. The proposal is to hold a face-to-face meeting with Vietnamese students. The aim is to promote Cardano, give lectures on blockchain and its technology, thus enabling them to be interested as students who are directly related to this technology. This proposal also aims to make students active and interested in owning ADA/ Cardano on the blockchain.\n\nIn essence, a proposal like this generates a lot of knowledge about cardano which will eventually give birth to active participants in the catalyst. It will be great to have an impact, as it will see the results in practice (where new members join, people who earn extra income to work at Catalyst, produce technology students who specialize in our most used programming language, developers who learn about smart contracts, etc).\n\nwe can imagine how this event would happen in practice. However, this proposal does not explain how educators will deliver Cardano material, so that these students are lured into participating in the project and staying in class.\n\nwe believe in the potential of this idea. It would be optimal if the explanation was more in-depth.\n\nAs another consideration, this proposal is a continuation of the previously funded project in Fund 7 and a long-term plan has been made, this proposal is the second phase.", "q0r": 4, "q1": "There is no problem with the feasibility of the project. The proposal can still be improved in several aspects, by providing more detailed explanations. Among others are:\n- we can know in general what will be covered in each month of the project, because the proposer explains what will be done in several cycles of the 3-monthly period. However, it would be better if the activities that will be carried out per week are also detailed.\n- the proposal should explain whether the university/student is being charged for participating in the event.\n- Explain the approximate number of students attending each class.\n- More detailed time division. We think it's important to set a detailed schedule with dates.\n- Who will do what and what will be the responsibility (committee structure). It would be better if the tasks/parts of each team at this event were determined (person in charge, chief executive, treasurer, secretary, marketing, publication and documentation, correspondence, proposals, accountability reports, archiving files and so on). The proposer writes that he will add team members, this will be good if it is supported by a sufficient number of teams and must be determined at the beginning because considering this is a continuation of the previously funded project in Fund 7, so that the preparation is more mature than the previous proposal.\n- What topics will be discussed along with the timeline. It is better if the team prepares/sets the curriculum (teaching materials).\n- What kind of publicity/Marketing will be used.\n\nTalking about the budget, the amount demanded is worth the investment compared to how the project will benefit Vietnam and Cardano. This proposal is the second phase of the continuation of the previously funded project in Fund 7.\n\nIn the Fund 7 proposal, the Proponent explains that this student face-to-face event is held at 2 universities with a target number of participants of approximately 500 students with a total of 12 meetings (6 events per university), with the hope that students who take part in the event will submit 12 proposals on the Project Catalyst (Ideascale) as a result of holding the event.\n\nThe proposer plans on Fund9 to expand the coverage from 2 universities to 3 universities and increase the number of events by 8 events per university. So that the total number of events held was 24. According to our calculations, from the estimated target participants this time around 1000 students, it is expected that students / participants will submit 24 proposals on project catalyst (ideascale). It's better if the details of event expenses are more detailed. Other detailed details are:\n- We recommend that the cost of event facilities be detailed in more detail. How much is the room rental fee, transportation costs, material/booklets, zoom licenses, costs for drinking water, all of which are detailed separately, making it easier for us to assess the reasonableness of the fees mentioned. We think banners should be included in the cost of marketing.\n- The cost of organizing the event is also the part that gets the second largest portion of the total cost, because it requires a large amount of money, it is better if the details must be in more detail. For example, how many presenters work and how much is the salary of the presenters, making it easier for us to judge the reasonableness of the fees mentioned. In the budget breakdown in this section, the proposer writes \"\"4 hours for preparation\"\", does it mean that the proposer pays an honorarium for the preparation time for the material giver before presenting the material in class? Shouldn't the presenter only be paid the honorarium for the time given in class when giving the material? It would be better if you reduce a little percentage of costs in this section, then add a percentage in other costs (marketing). Please provide further explanation regarding this.\n- The part of \"\"Cost of survey design and survey data analysis, sharing findings.\"\"is interesting. It should be detailed in more detail per section, and also explain how many people are involved in it. So that we can judge also the reasonableness of the stated costs.\n- Budget employs people to support the proposal, getting the largest portion of the total cost. So get special attention. Why does this proposal only explain 20 proposals that will be submitted to ideascale, while our count should be 24 proposals. It should be explained how much energy is needed to support the proposal, because it should already be seen how much the real amount should be in this section, from the activities that have been funded in fund 7.\n- Incentives for students who have proposals that meet the requirements to achieve IdeaScale, it is explained that there are 20 proposals that students will submit to ideascale. According to our calculations, as explained in the previous point, that the number of proposals submitted from students should be 24. It is better to explain this.\n- Project management costs should be detailed in more detail. What is included in this fee.\n- Detailed breakdown of Marketing / publicity costs. What kind of marketing will be used (for example: stickers, pamphlets, the cost of washing brochures, banner fees, certificates, invitations, social media, etc.) . The percentage of the marketing budget is 6% of the total, if needed it can be added by reducing another percentage of costs, because the idea is to expand cardano. Determine the strategy carefully so that the marketing costs you spend are effective and on target.\n\nWe think need to bring in the professionals hired for this project so that students have more curiosity / interest in Cardano.\n\nAnd in terms of the team, we think this section is very good, they seem to be very qualified people and very involved with Cardano. The proposer attached CV of team members. Relevant skills and experience of team members are provided through LinkedIn profiles.\n\nHowever, we think it would be better if the duties and responsibilities of each team member were explained throughout the project outline.\n\nFor complete eligibility, we suggest that the proposer consider my suggestion and elaborate further on this part of the proposal, considering that this proposal is a continuation of the previous Fund. So if this project is still ongoing, the contents of the next proposal will be more convincing.\n", "q1r": 3, "q2": "This proposal is a continuation of the previously funded project in Fund7 (FP7). We have also confirmed the Fund 7 proposal from the link the proposer has attached to this proposal. Proposal 7 has been funded (phase 1) and the event/activity was already and still ongoing at the time this proposal for Fund9 was submitted. \n\nIn Phase 1 of FP7, the proposer focuses on face-to-face meetings with students to introduce blockchain, learn about the Cardano blockchain platform and Catalyst. The proposer will also support the students to implement their project. In FP7 we can get an idea of ​​how to audit the process, because in Fund 7 proposal, the proposer will provide very detailed information on how this monitoring can be carried out over time. The way they describe audit capabilities, it's as if they've outlined everything so that the Cardano community has sufficient grounding in terms of monitoring activities and processes. The proposer talks about the success scenario, we get numerical indicators to understand if the project achieves what is expected.\n\nIn FP7, the proposer also makes us believe that we will get direct feedback from the students involved in the class. The proposer explained that there would be feedback in the form of 12 project proposals on ideascale from the students involved, however we have not been able to see information about the points we mentioned above.\n\nF7 proposal is already funded and attached to GitHub, but we couldn't find any auditable information.\nThis F9 proposal is still related to the F7 proposal activity/event and has also attached GitHub. However, we again could not find any information to audit. We only found website in Vietnamese only, and the website is not translatable by Google Translate. It would be proper to have reports in English for proposals proposed in English, as the Project Catalyst is global and using the international language.\n\nIn other words, if the F9 and F7 proposals are the same, then F9 has a risk of not being audited.\n", "q2r": 2, "assessor": "z_assessor_3899", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 10577, "q0": "“Catalyst Events 4 Vietnam Students” is a very good and meaningful idea, it has met the challenge “Grow East Asia, Grow Cardano”. This proposal raises an important problem: “Many Vietnam University students are unaware of Project Catalyst's funding campaigns and the opportunities which are existing.” I agree this proposal. According to Topdev's report, Vietnam will be the destination of many large corporations because of its abundant resources. I completely agree with this opinion because every year Vietnam has thousands of IT graduates, they are all young and creative people who are potential human resources in the future. However, many students today do not have much access to Catalyst because they do not have a guide or orientation. Therefore, this proposal, if implemented, will have a great impact and influence on the community, bringing Project Catalyst closer to everyone. In fact, many IT students want to start a business, they already have an idea but have difficulty in presenting and planning, and in raising capital. Therefore, if this project is implemented, it will bring a lot of benefits, firstly, it will help students to quickly receive funding for their proposals and projects. The second is to help diversify the Cardano ecosystem and increase the influence and popularity of the ecosystem in the community. Here, the proponent has clearly defined his target audience as lecturers and students, and also planned the implementation. They will provide background on the Cardano blockchain, introduce the programming language, and share opportunities in Project Catalyst and how to get involved. They also assist students in project implementation and management. I can see that the proponent is very enthusiastic. The solution proposed by the proponent I found identified most of the problems of the challenge. They brought up the current state of affairs to emphasize the impact of the problem. To successfully implement the project, the proponent has also foreseen the risks and they also have a plan to deal with them to limit those risks. I find the proposal very meaningful and necessary. I am new to Project Catalyst and Cardano, after researching, I found this is a very potential ecosystem and has more and more practical applications in life. The access to Project Catalyst and Cardano opened up more opportunities for me, I feel a bit sorry for not being oriented and knowing Cardano sooner. Therefore, This proposal is successful, it will expand the target audience, even more, not only students and lecturers but also new people from other professions and fields.\n", "q0r": 4, "q1": "This proposal has a very clear and specific roadmap. The proponent has divided it into important milestones, namely lasting for 4 months. However, this section is mistaken that the timeline is the First month, 2nd month, Third month, and Fifth month (omission of the 4th month). Each of these stages has clearly defined tasks, goals, and specific action plans. The content is presented in a logical order, including university selection, referrals, and opportunities sharing, followed by survey analysis, assisting newcomers to create their projects, then accompanying them in writing, submitting ideas, and applying for funding on Catalyst. I see a lot of work to be done, but the proponent has also come up with a plan to manage that workload. With careful preparation like this, I find that controlling progress and quality will be very easy and effective. Regarding the project's budget, the proponent also pointed out how to allocate and use each part of the budget very specifically and reasonably. Costs are calculated in detail for each event and per working hour. This detailed planning will help the team easily evaluate the efficiency of capital use and avoid wasting costs. In this part, I only have a small opinion that if possible, the team recommends that a small part be used to set up a risk reserve fund because in order to build and develop a project, despite careful preparation, It is also not possible to avoid unexpected risky situations that require additional costs to offset, which will help the team resolve quickly and flexibly. In case, this risk reserve fund is not needed, it can be used to create a reward fund for individuals who complete tasks or for students with creative projects and ideas, excellent, and useful to the community to encourage and engage their active participation. About the team involved there are 5 members, they are all experienced and accomplished in their field. Their personal information is also presented through such media as LinkedIn, Twitter, Telegram, and Facebook. These are all very popular social networks and are easy to access and search, making it easy for the community to evaluate information and learn about members. In addition, the proponent also recruits more team members at the universities they have chosen, I think this is good and necessary because these people will know and understand the needs and requirements psychology of the students, which is of great help in identifying appropriate and effective solutions to meet those needs.\n", "q1r": 4, "q2": "In order to measure the progress of the project, the proponent has given criteria. Each of those criteria is expressed through KPIs with very specific data: number of events organized, number of event participants, number of proposals raised to scale ideas from universities,... In addition, these KPIs along with images/videos and documents are published on their website Cardano2vn.io and provide monthly reports on Github https://github.com/cardano2vn. Thereby, the auditability of this project is relatively high. The success of the project is also clearly defined and specifically, by the end of the project, there will be more than 1000 students from 3 universities of their choice known to the Cardano blockchain, there are dozens of projects submitted to IdeaScale, and many projects were funded and put into operation. At the same time, students will have many opportunities to participate in the catalyst. I think this will help students expand their communication relationships, and have more different opportunities to start a business. This proposal is really good and has a positive impact on the development of society. This is a continuation of a project that was funded in Fund 7 and it also involves two other proposals in Fund 9. I find that the experience and resources built up in the previous fund will be a beneficial substitute for this fund, increasing the probability of the project's success.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 10, "ne": 6, "ng": 1, "nfo": 3, "vca_o": 2}, {"id": 11800, "q0": "I find the proposal of Catalyst Events 4 Vietnam Students perfectly suitable for the challenge of Grow East Asia, Grow Cardano when targeting students as the target audience to solve the problems posed by the challenge which is developing the ecosystem Cardano in East Asia in a holistic way by increasing public awareness of the Cardano blockchain and network, providing funding to those who have learned about Cardano to leverage community support to build or use using the Cardano network.\nThe uniqueness and prominence of the proposal when the author team organizes virtual or on-site sharing events about the Cardano and Catalyst projects for students. Connect, motivate and support students participating in Catalyst. I completely agree with the team's solution argument that this proposal is intended to reach out to faculty and students to raise awareness of Cardano and the opportunities in the Catalyst project.\nAs a Vietnamese citizen, I am very proud that my country is currently one of the world's leading countries in the field of blockchain as shared by many Vietnamese experts and technologists at the Binance Blockchain Week event from March 27 to 30, 2022 in Dubai - the city of the United Arab Emirates (UAE). I see that in a country with a rapid development of electronic money, the author's team transmits and spreads more useful and official knowledge and information about blockchain to Vietnamese students is a smart and right choice. In my personal opinion, this age is a golden age to start for new knowledge, experiences and challenges for each person. The current situation in Vietnam is that the number of students knowing and accessing the blockchain market is not much, or knowing the market, but with a lot of unofficial and unclear information. Overall, I find the organization of virtual or on-site events, thereby introducing knowledge about blockchain projects specifically Cardano and Catalyst projects to students, is a concern that needs to be promoted by the Cardano community to support them to become active participants in Catalyst with different roles like proponent, PA, vPA, challenger, voter.\nI give this recommendation a 4 for impact because of my comments I rate it pretty well.\n", "q0r": 4, "q1": "I think this proposal takes 5 months to implement is reasonable, the author's team has given the specific time by the month, the corresponding tasks that need to be done are also clear. It is clear that the plan and implementation of the plan have been well laid out by the team members, I can see the seriousness in the high-intensity plan when they have shared with the community how they manage and divide the work for each member.\nIn the estimate table of the proposal I found that the authors did a very detailed and reasonable job. The proposed budget of $33404, represents 13.3% of the total grant budget for the Grow East Asia challenge, Grow Cardano is suitable. Since this is a continuation of the proposal approved at Fund 7 before, I believe that the authors have had a lot of experience in balancing the budget of the proposal at Fund 9 close to reality to optimize the most budget to convince the funding from the Catalyst fund.\nThe risk of the proposal was also foreseen by the authors that they might have to organize more events than planned to attract more students to participate and submit more proposals after having data from the events within 2 months. However, I have not seen a convincing solution from the authors for this risk because I see that after 2 months of organizing the event, if the evaluation results are not good, then the authors need to come up with some recommendations, what specific measures to improve at the next event, avoiding wasted budget and inefficient use of resources.\nThe team that made the proposal are people I see as perfectly capable of doing this project. In Vietnam, they are people with names and voices in certain community groups, they have knowledge, education, expertise, skills, and experience working at reputable agencies and units whose identities can be fully learned through mass media channels. I see a lot of the links their community provides such as youtube, facebook, telegram, email, linkedin or twitter...\nI give this part 4 points because I am not really satisfied in the risk assessment of the proposed group.\n", "q1r": 4, "q2": "Obviously, with the plan and budget given by the proposal team, I fully believe the project can be audited when there is more commitment from the author team to commit to internal transparency and With the community, share all project activities and costs in \"https://github.com/cardano2vn\" when the project is funded. This will help the community to monitor the progress and success of the project continuously and closely. For me, this is very very necessary and important, it needs to be done every month for all projects especially for big budget and long implementation projects. It not only helps the project team understand the progress of the implementation of the plan, the use of the budget, but also helps them to review what has been done and not done, from which to draw lessons, experience to adjust the project in the right direction and achieve the expected results as set out.\nI find the KPI of the project given is very clear with specific targets and milestones that are at least 24 events that will be held at universities, an estimated 1000 event participants, at least 06 surveys, at least 20 proposals will be sent to the idea list at the end of the project, 150 students attend workshops and sharing sessions and 40 dedicated sessions for one-on-one support. I consider these to be promising numbers that bring very successful results to this project. With the success of the project from the previous fund and the proposed plan in this fund 9, I very much hope the project continues to be funded, from which there will be a lot of projects submitted to the idea round and into the market work. Furthermore, students can join the Catalyst ecosystem in a variety of roles, which will diversify the ecosystem and sustainably develop the platform in the future.\nThis is a continuation of a project funded at fund 7 and it has a link to 2 other proposals at this fund 9, the community can see more information about related proposals at the group links The author is below the article.\nI will give this section 5 points because it completely answers the questions I posed for this proposal.\n", "q2r": 5, "assessor": "z_assessor_3281", "no_vca": 12, "ne": 7, "ng": 3, "nfo": 2, "vca_o": 2}, {"id": 11474, "q0": "Along with the rapid development of information technology in Vietnam, a large number of IT students have been produced.However, your career development options are limited. This proposal provides you with more good options as well as the opportunity to develop your Cardano ideas.The team's proposal is relevant to the students' current needs and meets the challenge's stated criteria in this category.\nHowever, in terms of risk, I think the team needs a solution to demonstrate that Cardano's technology is sound, as there are many fraudulent Blockchain technologies on the market, as well as a lot of bad news today, causing people's trust in Blockchain to dwindle.I think that student acceptance of Cardano technology and the Catalyst project is low, and that it is impossible to attract well-qualified students without a solution that proves the project's credibility.\nWith the team's knowledge and experience, I believe the team has a solution to this risk, but it is not mentioned here, so I will give 4 points in this section.\n", "q0r": 4, "q1": "Through testing, I discovered that the group was made up of people with high skills, IT experience, and excellent pedagogical abilities.In addition, Mr. Tien is involved in the development of Cardano technology in Vietnam. With immediately preceding idea experience and a clear implementation plan, I am confident that the project will exceed expectations.\nHowever, I think the marketing budget is unclear in the budget section. I'm curious how the group will spend this money because the group will work directly with universities rather than spending money on advertising on the network like other projects.\nBecause the question above is based on my limited knowledge, I will award it 5 points in this section.", "q1r": 5, "q2": "The proposal specifies the indicators to be met in accordance with the requirements of this category's challenge.It would be preferable to propose more indicators of students' comprehension by administering a test after the course so that the quality of training can be understood. If it is not good, you can concentrate on developing content, a method of transmitting knowledge that is easier to understand in order to help students understand and apply it better in order to optimize the amount of funding and effort spent by the team for the sake . Because of the Blockchain technology as well as Cardano is a new and confusing technology. So I will give 4 points in this part.", "q2r": 4, "assessor": "z_assessor_3250", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11670, "q0": "The challenge requires growing the cardano ecosystem in an inclusive and supportive way by raising awareness of lectures and students in universities about cardano network and supporting them to become active participants with different roles such as PA, vPA, proposers, voters etc  of which I  believe the proposal has extensively addressed the challenge .furthermore, the proposer will have alot of impact to the cardano ecosystem if implemented successfully because the proposer has stated the target group as students in universities who have a knowledge in IT but are deficient in knowledge of the cardano ecosystem.  And I believe if awareness is created , many would be onboarded on the network promoting cardano ecosystem and blockchain technology in East Asia and the  world at large. The proposer even stated that there are about 55,000 IT students graduating each year from 153 universities and institutions and should this number be reached and onboarded,  it would be great impact to the cardano ecosystem should it funded and implemented. ", "q0r": 5, "q1": "The proposer presented a well outlined plan and standards have been set to measure and adjust to the successful completion of the proposal if implemented. Also for every proposal,  relevant skills and experiences are needed to make it a success and so the proposer clearly stated to be a lecturer with many years of teaching experience which is very vital because the proposal is employing both online and online methods to meet it's goals. Team members are equally IT specialist and this will be of great importance to the success of the project if funded and implemented. A detailed budget has been presented and broken down into identifiable items which are reasonable for the achievement of the project. Furthermore,  a realistic timetable  has been given to measure the progress of this project. Furthermore resources needed to implement the project and achieve its goals are clearly stated.  And the proposer has and team have also done so well by using community resources available to them and not just they resources the have provided for the proposal this makes the it easy for the achievement of the proposal and I believe should be funded fully. ", "q1r": 5, "q2": "The proposer has provided key metrics to be measured with as far as this proposal is concerned.  Numerical figures have been given under the KPIs to measure the success of the project comparing it with the key metrics outlined to know the know the impact it has brought to the cardano community.  Furthermore this KPIs with associated photos and videos would be presented on their website cardano2vn.io few days after the completion of the project.  Success for this proposal was also measured as 1000+ students from various universities became aware and part of the cardano community and blockchain technology. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"id": 11774, "q0": "The idea of “Catalyst Events 4 Vietnam Students” matches the goal of the challenge “Grow East Asia, Grow Cardano”. This is a proposal that has been funded at Fund 7. The content of the follow-up solution from Fund 7 to Fund 9 is to organize a series of virtual and on-site sharing events about Catalyst for students of universities in Vietnam. The purpose of the solution is still to approach lecturers and students to raise awareness about Cardano, helping students become Catalyst proposers/PAs. At Fund 7, the group successfully organized 16 online and offline sessions to share about Catalyst for 200 students from 2 universities: University of Transport and Nguyen Trai University. The successful results achieved after Fund 7 were detailed and clearly presented by the team, satisfying the previously set KPIs of the group, with attached documents and complete reference links. Following the success of the above series of events, at Fund 9 the group continued to propose to organize similar events and expand the scale with 3 universities. According to the cited group’s argument, after successful events at Fund 7, they “realized the need and potential of students in the blockchain field at universities.” Personally, I strongly believe in the ability of this solution to impact and raise awareness about Cardano and Catalyst among Vietnamese students. In our Vietnam, blockchain is creeping into many universities. A number of blockchain research faculties/academies have been established at a number of universities and enterprises in Vietnam such as FPT University, the University of Danang (https://www.udn.vn/tin-tuc/chi-tiet/trung-tam-phat-trien-phan-mem-dai-hoc-da-nang-hop-tac-voi-trung-tam-blockchain-chau-a-thanh-lap-ai-blockchain-lab). Even FPT University - one of the prestigious universities in Vietnam also requires all students to learn blockchain and metaverse (https://genk.vn/chu-tich-truong-gia-binh) -fpt-lam-metaverse-thuc-ao-la-mot-tat-ca-sinh-vien-fpt-deu-phai-hoc-blockchain-va-metaverse-20220410103333009.chn). The Vietnam Blockchain Association was also established in May 2022, demonstrating Vietnam's preference for blockchain technology in the coming years. Therefore, the group's solution aimed at dynamic Vietnamese technology students is completely appropriate. Personally, I have some suggestions for the group to consider to enhance the effectiveness of these activities. Specifically: Firstly, adding training and supporting content on Plutus and Haskell languages to encourage the establishment of groups of programming design students, who are also potential developers on the Cardano ecosystem. Second, establish a Facebook, Telegram group where students can easily participate in exchanges, share and learn about Cardano and Catalyst. Third, at each event at a university, it is advisable to connect with one or several technology lecturers as the regular contact point with the project team. The aim is to help popularize activities and train students on blockchain and Cardano without interruption even after the events have ended. Regarding the risk of the proposal, the team should consider setting aside a part of the reserve fund due to price fluctuations of ADA when the market is in a prolonged bearish phase. Overall, I rate 5 points for the impact of the solution because of its perfect fit in the context that blockchain is increasingly known and interested by Vietnamese students.", "q0r": 5, "q1": "In terms of feasibility, I have praise for the team. The roadmap and budget for the implementation of the proposal are presented in a very logical and clear manner by the team. I believe that if approved by the community, the group will continue to successfully carry out a series of events at the 3 universities in Fund 9. In the 11-month process, including 4 expected phases, the group is expected to organize 24 events, attracting 1000 participants. In it, there will be 40 sessions dedicated to 1-1 support. The targets proposed by the group for each item are consistent with the goals set out in the roadmap. Because the team has experience and skills in successfully organizing similar events at Fund 7, I have complete confidence in the ability of the team members. They have proven that they can successfully organize events on a larger and larger scale. I believe the solution is workable and can be successfully implemented, hence I rate 5 points in this section.", "q1r": 5, "q2": "From an audit perspective, I appreciate the team's effort in describing in detail, succinctly what success looks like. Successful KPIs are described by the team with specific data. However, regarding the success metrics, I have a few minor concerns. In Fund 7, the team attracted 200 students to the event at 2 Universities, with 10 proposals submitted. Proposal/student participation rate is 5%. However, at Fund 9 this rate is expected to reach only 2% (20 proposals/1000 students participating in the event). I want to understand the reason for this drop and wish the team to have more solutions to improve the conversion rate. I appreciated the auditability of the proposal, however I deducted -1 point because the KPIs given by the team were lower than Fund 7. My score is 4 points.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11844, "q0": "The project points out issues in the Vietnamese market and states its target audience is Vietnamese students. The research attached to the project contributes value to what they addressed the problem that students in Vietnam are still shorting information to access the blockchain, especially in Cardano. The advantage of bringing Cardano to Vietnam for a targeting market - Vietnamese students is a win-win solution for the blockchain and the students. The adoption rate of new technology from the younger generation is beneficial, and the Vietnam market is the country that has young population distribution. A tactic of the project is using universities to facilitate the opportunities for participating in Cardano from different opportunities such as PC, vPC, challenge team, voters, and support the project can submit on Catalyst. It could be the solution that strongly affects the target market for building awareness to take action in a very effective way. After the pandemic, working online situation makes the adoption rate of remoted learning in Vietnam could be an advantage for using the facility that they already built in Fund 7. It makes the project continuously spread. One more benefit of the team is most of them work in university. Therefore, the connection could make the events more accessible to students.", "q0r": 5, "q1": "The project schedule is well balanced, and coming up with the work in order from the first to the fifth month. The team focuses on strengths, for example, building the platform, connecting to the university, inviting guest speakers, and supporting the students. Third parties will take over other tasks such as marketing, content design, and event organising showing the experienced of the team. On the other hand, the first three universities that implemented the project contributed as a kick start to the success by drawing awareness from target audiences. Therefore, the picked university also needs to keep updated with the community and the reason for picking the three. The team could consider online meeting platforms by using Skype, Google meet, and MsTeam as an effective tools for live events. The reason is most of the students in Vietnam don't have a fixed timetable, and also have projects, part-time work, or reasons that could not participate in the events. The online survey could be an effective way to collect ideas from students as most of them have already gotten used to working online for the last two years. Therefore, the reach of the project could be better.", "q1r": 4, "q2": "The cost is decent in the Vietnamese market. The community involved in the project is also fairly distributed the fund if the project once funded. The team has experience in the IT and blockchain fields. A continuing project already funded from fund 7, making it trackable by the Cardano community. All of the links that the team provided are still accessible and updated. End of the project, building awareness for more than 1000 students bring the cost of building awareness to less than 33 US dollar per student. The cost could be used as a measurement to compare with the effectiveness of the same project that closes up on May 23, 2022. Other than that, the metric that comes along with the GitHub link delivers a tracking solution for the community transparently. ", "q2r": 5, "assessor": "z_assessor_3295", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 12076, "q0": " The \"Catalyst Events 4 Vietnam Students\" proposal identified one issue in the challenge and that was far-reaching. It presented a problem in the development of the Cardano community, the proposed problem that is most suitable for the challenge is suitable for developing the capacity of the young generation. Addressing an urgent problem that many Vietnamese university students do not know about Project Catalyst's funding campaigns and the opportunities available. The proposed idea is to organize virtual or on-site sharing events about the Cardano and Catalyst projects for students. Connecting, motivating and supporting students to participate in Catalyst.. With the growing number of proposals from catalytic funds, this helps Vietnamese students easily and quickly find and evaluate proposals or find your own direction. Please present the problem clearly and convincingly. It offered solutions to a problem in the growth of the Cardano community, which is the growth of the Vietnamese student community. The Proposal Specific Solution provides background information on the Cardano blockchain, introduces programming languages, shares opportunities in Project Catalyst, and how to get involved. Then will accompany faculty and students in writing, submitting ideas and applying for funding on Catalyst. Support them in project implementation and management after their project is funded. Thus, based on the recommendation engine, Viet Nam students increase their performance searching for opportunities in Project Catalyst, developing Sustainable development of the Cardano ecosystem. The team proposes to give specific examples in the presentation with feasible arguments, bringing high efficiency. Shows that the proposed team has carefully researched the advantages and abilities of Vietnamese students and their suitability with the Cardano ecosystem, answering the question: How to seize opportunities in Project Catalyst and participate It belongs to Vietnamese students? The specific goal of your proposed product is: reach out to faculty and students to raise awareness about Cardano and the opportunities that exist if they can work as diverse in Project Catalyst. The proposal identified a risk in the implementation process and provided solutions to overcome all of those risks. You have pointed out the risk of reaching fewer students than expected due to poor coverage. The proposed solution could host more events to get more students involved and submit proposals than expected. This action should be taken after having data from events within 2 months. However, I have suggestions for the team on the solution to overcome and limit the risk that you have pointed out. Firstly, at the risk you pointed out, I would like to come up with a more specialized solution such as combining a well-experienced teaching team combined with building trust and cooperation with the faculties in the two schools. They agreed to media, provide rooms and lecture halls to hold these events. In addition, you should consider the risk that ADA's price slippage also has a direct impact on the success of the project, so it is also necessary to have an additional plan. I rate 4 points", "q0r": 4, "q1": "The proposal has a clear and reasonable timeline associated with the beginning of the work together with detailed goals. Regarding the timeline, the proposed team presented a specific and feasible target plan for each month. The result in the implementation process is to commit to transparency internally and with the community by providing all the activities and costs of the project on \"https://github.com/cardano2vn\" when the project is approved. funding. The proposed budget is about 13.22% of the Challenge. The contingency plan is not specific and clear. The project consists of 5 members. Assign specific tasks to members.. Experience of suitable members are Lecturers, Deans with many years of experience in teaching and writing specialized IT textbooks. They are also full-stack developers, sponsored proponents, SPOs, and moderators of Eastern City HallHowever, an additional provision is needed in light of the sudden increase in student participation. variable than expected. I rate: 4 points.", "q1r": 4, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. The proposal has six metrics/KPIs to measure project performance and progress. Metrics/KPIs that are easy to measure and check (Total Events Delivered, Total Participants Attended, Total Surveys, Total Proposals Unlimited in range of ideas from universities ,The total number of recommended reviewers.\nTotal number of sessions supported). Can be accessed anytime, anywhere, clearly displaying the number and results of work on the website. The proposal has well-defined success and has been successfully tested in practice. The goal of the proposal is that by the end of the project, more than 1000 students from 3 universities will know about the Cardano blockchain, Catalyst's funding model. There will be dozens of projects submitted to the idea round, many of which are funded and put into operation. Furthermore, students can join Catalyst with different roles. They will experience the new reality of a DAO model.. This proposal is a continuation of a previously funded project in Fund 7. and it is related to 02 other proposals in Fund 9: Cardano developer learning materials in Uni and the Cardano developer club in Uni. I hope the project will be a great success because of the great impact on the young generation of Vietnamese students, from which thinking of development after laying a sustainable foundation for the Cardano ecosystem. The project is aligned with the United Nations SDG Sustainable Development Goals Goal 4 Quality educationEnsure quality, equitable, inclusive education and promote lifelong learning opportunities for all . If granted, the project is in the top 10% of the voted projects. I rate: 5 points.", "q2r": 5, "assessor": "z_assessor_3353", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12244, "q0": "Concentrating on universities is a wise approach when pursuing a community development and education strategy. I notice several major impacts on the proposal.Students are a valuable source of intelligence, health, and energy that must be acknowledged. As a reason, students are an excellent beginning point for achieving critical goals. In the future, Cardano will be able to be a main subject instead of supplementary courses. The majority of universities' curriculums still depend on knowledge that has not been updated, so this proposal can increase efficiency and does not have to cost a lot of time for application. Furthermore, education and community development are always major concerns. As a result, favourable conditions for education and community development have been created. The proposal is possible to attract not only the students, professional groups but also investors if the association of Cardano-Catalyst-University can prove its effectiveness. Finally, providing information to students through universities can develop a reputation for trustworthiness for the Cardano project because it is more difficult to convince and develop the community from outside the universities. The public now remains cautious about scams or Ponzi schemes that are usually held in coffee shops, restaurant workshops, hotels,...Thus, universities become a reliable and efficient environment to approach more people, especially students.\nI think the proposal deserves to get 5 points in terms of impact.", "q0r": 5, "q1": "Courses, discussion shows, and student activities are some of the most popular ways to develop a proposal. The proposal has several good points, in my perspective. Firstly, there is a good potential that the idea would be expanded to include additional universities. If the project develops in the proper direction, there is a good chance of educating the community and taking advantage of human resources in the future. Furthermore, many traditional organisations have successfully implemented this approach throughout the years, so there is no doubt about its usefulness, and we can put it into practice right away. The process might be shortened if we specifically select students who already have a basic understanding of technology, particularly those majoring in IT, technology, or digital marketing... Moreover, remote working and freelancing, which need high expertise and adequate remuneration, will grow popular in the future. This form of employment may close the gap between students and foreign jobs while also fostering the development of the Cardano Ecosystem, in which the entire community can contribute. However, the idea still has several drawbacks. The first issue is that most of the courses are not part of the university's compulsory curriculum, making it more difficult to convince students to participate. Aside from that, students nowadays lack self-motivation to learn. As a result, rather than a standard education session, I propose that we define clear goals for them, such as career opportunities and adequate remuneration, while enacting policies to support them. Furthermore, we may run online courses in parallel with offline courses and accept students from different institutions without restriction.\nI will score 4 points for the feasibility of the proposal.", "q1r": 4, "q2": "The indicators described in the proposal essentially satisfy the criteria that may be tracked by an education course. The proposal also included indicators, such as participants, interactions, and attractiveness level which are valuable in evaluating the courses. Fortunately, this method has been shown to be effective for students. When applying this proposal to universities, the team will face some difficulties in obtaining permission from these universities, but I believe the team in charge of this proposal will be able to deal with the problem due to their existing relationships, allowing the proposal to be implemented quickly. Furthermore, there is just a minor difference in expenditure between the online and offline forms of the proposal because the offline version enables us to use university facilities. Additionally, a proper selection of students with a clear aim and basic understanding at the beginning of the course can assist the courses to operate better. However, I believe the idea could include more specific indicators. More specifically, after a certain period of time, we should evaluate the output, such as the number of people who become Cardano programmers, supporters, or project analysts, or at least the number of participants who have a basic understanding of how a transparent community works after attending the courses.\nThe idea of the proposal is great. Besides that, we can actively evaluate the proposal by the indicators in both offline and online form. It would be better if the team had more specific goals. As a result, I will award the idea 4 points for auditability.", "q2r": 4, "assessor": "z_assessor_3368", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12409, "q0": "The issue brought up in this proposal is the lack of awareness from Vietnam university students of the Project Catalyst funding campaign as a method to raise capital for their projects. This proposal tries to address this issue by getting more university students in Vietnam to participate in Funds via organized online or offline sharing events about the Catalyst funding program.  The proposed solution can add value to the Cardano ecosystem by bringing more awareness to Cardano itself and also acting as a catalyst for bringing in new talents that can come up with new interesting ideas for Project Catalyst, as well as gaining students more experience working as developers which will grow the Cardano projects and the future adoption of the Cardano ecosystem. Based on the points above, it can be clearly seen how the issue and proposed solution brought up in this proposal is perfectly aligned with the primary objective of the “Grow East Asia, Grow Cardano” challenge setting which is “raising the awareness levels of regular people in East Asia about blockchain and the Cardano network should be a priority for the Catalyst community”", "q0r": 5, "q1": "The team working on this proposal is the same team members working on the “Catalyst Events 4 Vietnam Students” project from Fund7. Judging by the performance report of that project (provided in a google doc linked in the proposal), it seems too me that the team has managed to deliver past every targeted metrics except for one. For example, the number of event participants targeted was 500 but the project managed to reach 700 students, target of 60 onboarded students but the project managed to get 150 students, etc.. However, the number of proposals targeted was 12 meanwhile by the end of the project, it only manages 10 that were ready to be submitted to Fund9. Based on these points, I think the team members have the skill and experience needed to implement this project in this Fund.  \n\nThe budget of 33040 USD was requested for conducting 24 events on 3 universities (8 events per university) and has been broken down into details, such as expected workhours, the hourly rate, as well as the number of people working on each item that will be done. This detailed budget allocation has been provided in a google sheet that has been linked in the proposal. The budget went over key items, such as that event facility cost, host and guest fees, survey design and analysis, wages for supporting proposal writer, students incentive, and marketing. The budget has been clearly broken down into each identifiable item and seems reasonable in its justification except for the marketing budget since there were no details regarding it. I’d have liked if the proposer had expanded further on what goes into the marketing budget so that it can be judged more clearly (i.e. what kind of marketing will be done, through what medium will it be done? etc.).\n\nA detailed roadmap going over key milestones of this project has been provided in the proposal. The 1st month milestone will go over the preparation phase for the events (contacting the 3 universities to schedule and plan the content for the events, event logistics, invitations, etc.). The 2nd month milestone will be conducting the sharing events, conducting survey, and training on blockchain integration and creating token & NFT. The 3rd month milestone will be survey analysis and contacting students regarding their ideas for projects. Lastly, the 5th month milestone will be the proposal submission and applying for funding in Catalyst. Since the roadmap followed closely with the project’s past timeline, the key milestones seem feasible to be completed in a timely manner.   \n\nOverall, I’m in agreement with the feasibility aspect of this project since the team members involved have past experience on delivering this project with a successful KPIs, the budget allocations have been broken down in details, and the roadmap seems realistic.", "q1r": 5, "q2": "The KPIs chosen as the success target for this project include metrics such as 20 proposals submitted to Project Catalyst, 24 events held during implementation, 1000 students from 3 universities participating in the events, and 100 students onboarded to the proposal. However, I’d have liked if there was a metric measuring the number of funded proposal instead of just the number of proposals submitted to judge the quality of the proposals submitted. There were 10 proposals submitted in Fund9 coming from students participating in this project, and the quality of those proposal can be used as KPIs to judge the success of this project since this project will be applying again in future Funds. \n\nOverall, the proposal has provided relevant metrics and way to track their progress so that it will be transparent to the community. The metrics chosen by the proposer were well defined and relevant to measure the success of this project regarding the outreach of the sharing events and how effective it is in increasing the amount of proposal coming from students in Vietnam universities. These metrics and project documentation will also be reported via Github with links ([https://github.com/cardano2vn](https://github.com/cardano2vn)) provided in the proposal.", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1891, "q0": "Lectures and Students are knowledgeable, have research methods, easily accept new things. However, their understanding of blockchain is still limited. When this proposal is implemented, it will help a large number of students in all fields to know and research on blockchain deeply. With the leadership and support of blockchain experts, I believe these newcomers will be quality members of the Cardano ecosystem. It is these members who will research and apply blockchain in their own industry as well as in real life.", "q0r": 5, "q1": "This project is a continuation of the previously successfully proposed project. With my experience and detailed presentation plan, I believe that this project can succeed and bring good results. The team members are experts in blockchain and education. They have a method to teach, guide, and support newcomers about blockchain, Cardano ecosystem, Catalyst, etc. Projects like this need to be communicated more widely to students.", "q1r": 5, "q2": "The project is presented in detail. The proposer offers many methods to monitor and evaluate the implementation progress effectively. Team presentations should be recorded and posted on youtube for everyone to watch. Teams can use these videos to spread the word.", "q2r": 5, "assessor": "z_assessor_2286", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 12885, "q0": "I believe that it is a good idea to introduce and popularize the Cardano ecosystem. The purpose of the proposal is to familiarize students with Catalyst and Cardano, and this will be accomplished either through face-to-face meetings or through videos. This refers to the section of today's society that is comprised of students who are thought to be knowledgeable and to have a good awareness of their surroundings. Students will not only be able to acquire a more in-depth knowledge of Blockchain thanks to the dissemination of information about Project Catalyst by lecturers and students at the university, but they will also be able to earn additional income through PA work as well as create proposals.\n\nThe difficulty lies in the fact that you are concerned about \"organizing more events to attract more students to participate and submit proposals than expected,\" which is a component of the risk that you mentioned. In my opinion, that also has the potential to be an advantage. Therefore, it is common knowledge that you are very popular. There is a further possibility that I would like to discuss with you, and that is the possibility that as more teachers and students become familiar with Catalyst, they will also become more knowledgeable about ADA and the cryptocurrency market. This is something that is possible. Because there are a lot of things that are rumored to be on the negative side of cryptocurrencies for newcomers, it is absolutely necessary for you to be informed of the potential risks that are associated with the cryptocurrency market. However, as a rule, the solution you suggested is appropriate for the problem that was presented, and the likelihood of the proposition being implemented successfully is quite high. This impact still earns a score of 5 points from me.", "q0r": 5, "q1": "The road map for the project extends over a period of five months and contains information that is in line with the proposal. Additionally, all of the tasks and the progress that is being made on the implementation of the project are considered specific, and resources can be clearly divided for each milestone and phase. But I also have a question: the price for the first five months is $3,340, and it includes 24 discussion meetings. However, since your description mentioned sharing virtual meetings, I was wondering how many virtual meetings and how many face-to-face discussions will be included in this package of 24 events. And assuming that all 24 of these conversations take place in person, at what point in the process will your meetings be held virtually, and how much will it cost to pay the people who will be organizing those virtual meetings? times the total number of attended sessions).\n\nYour team, including members Nguyen Anh Tien and Nguyen Van Hieu, includes two people who are very knowledgeable about Cardano and have worked together, implemented many successful projects, and been funded in previous funds. The remaining three people on your team are also very knowledgeable about information technology, and all of them are successful and famous in the field of information technology in Vietnam. Because your team is such a good match for this project, there is an extremely good chance that it will be completed successfully. I still rate your feasibility at 5 points.", "q1r": 5, "q2": "The proponent has established objectives in order to ensure that these numbers can be attained following the completion of a successful project, that the KPI levels are understood, and that the possibility of successful implementation is not out of the question. It was a well-considered idea that would determine how fruitful the project was to have a total of 24 events, each of which attracted approximately one thousand people to participate. In addition, the proponent has provided us with clear links on both the project's website and on Github, which is an online repository, in order for us to track information and keep the project's roadmap up to date. The community is better able to judge whether a project is worthwhile and on the right path when there is more transparency. If you are determined to teach Catalyst and Cardano to students in Vietnam, I have no doubt that you will be successful with this project. If you are successful, you will help students gain access to new career opportunities and improve their long-term career prospects. Therefore, I give this auditability section a score of 5 points.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 12954, "q0": "The goal of the proposal is to inform Vietnamese students about the cardano eco system, project catalyst's campaigns, and opportunities that are available. The proposer has extensive experience and is a lecturer. The project attempts to communicate with professors and students to inform them of cardano and its prospects. The proposal explains in detail how it will enhance the Cardano ecosystem. The proposal also included a detailed road map for achieving the goal. Goals and metrics in the proposal are in line with the outlined challenge settings, and the concept can scale to deal with further issues in the future. I really believe that after considering the proposal, it successfully addresses the issue.", "q0r": 5, "q1": "The five-month schedule for the plan is described in great detail.\nThe proposal has also taken into account the risks and barriers to a successful implementation, and the proposer has provided evidence of the pertinent skills and experience needed to implement the idea. The proposal also has a very specific timeline, the team appears to be quite skilled, and references to earlier efforts are provided. The budget is detailed in detail and segmented into easily distinguishable items. Technical elements like architecture and technologies have also been mentioned by the proposer. Upon reviewing the the proposal i strongly agree that the proposal is highly likely to be implemented successfully ", "q1r": 5, "q2": "The total number of events provided, the total number of attendees at the events, and the total number of proposals submitted to Idea Scale from the universities can all be used to track the progress of a proposal. The plan included a timeline with precise timeframes for the achievement of milestones. The proposal's metrics/KPIs determine whether it is successful, The proposal includes a clear description of the relevant problem and a \nsolution that is both obvious and simple to \nunderstand. I firmly believe after reading the proposal that it gives me enough information to track the advancement of the stated objectives. The proposal provides the sufficient information to accesses the proposal", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 13051, "q0": "Students are the future generation of knowledge of the country, one of the core forces to build a rich, strong and developed country. Therefore, sharing and connecting these objects to participate in the Cardano community will help the community grow stronger and stronger. As the proposal shared, students have a lot of creative, unique and strange ideas but do not have the funds to implement. When participating in the cardano community and proposing ideas to Catalyst, it will help them solve both the funding problem as well as receive a lot of suggestions from the community. Students are also a large community, when students participate in Cardano and have achieved positive results, many more students will join the community. The proposed group are also experienced people who can lead and support students in knowledge and skills. Connecting students with the Cardano community will also help students gain more work experience and career development orientation.", "q0r": 5, "q1": "I read through the detailed project proposal and found the information on the team/Github pages to be exhaustive. The goal of the proposal is clear and the challenge posed is to expand the community. Reasonable and detailed membership fees. The members of the team are quite large and have experience in both cardano background and expertise. I can orient and guide students because I see that they are all faculty from major universities.", "q1r": 4, "q2": "The proposal detailed the content and implementation timelines for each month. The target metric for students participating in the Cardano Blockchain network is 1000+ very specific students. In addition, the progress of the proposal implementation, photos/videos of events, and events can be easily tracked on the team's website/github.", "q2r": 4, "assessor": "z_assessor_3550", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 13386, "q0": "This proposal effectively solved the challenge by sharing and connecting Students participating in Catalyst because this program brings a lot of value in terms of knowledge as well as earning more income for students. , earning extra income is what any student wants while sitting in school.\nThe income from the Catalyst program is a good and much better income than most outside jobs such as working at restaurants, handing out flyers, or even tutoring, and also avoids The multi-level fraud business has changed as much as it is today.\nStudents of finance, information technology, electronics and telecommunications, and engineering in Vietnam have a lot of creative ideas and are really good, and it is better to have someone to guide and support blockchain support and participate in meaningful work on Catalyst.\nThe most important thing when participating in Catalyst is still knowledge, students will learn foreign language skills, blockchain knowledge, knowledge of Cardano, how to present a plan, and how to write a project and raise capital.\nVietnam is a developed country in East Asia with abundant and quality IT human resources, these will be the seeds contributing to Cardano's strong development, helping Catalyst to have more proposals. novelty and quality, and growing the Catalyst community with different roles. I look forward to seeing this project approved and broadcast on the proposal team's Youtube channel.", "q0r": 5, "q1": "Your plan has 5 months to complete and the tasks are clearly allocated in each month, but in the 4th month, I don't quite understand because I have not seen you presented in the proposal description.\nI have watched your youtube channel and have seen you hold Zoom meetings with students and interview students at universities about the Catalyst program, so with the experience and plan proposed by the team, it is very maybe this proposal will be successfully implemented.\nThe budget you listed is $33040 and is broken down into categories with each specific and detailed job.\nThe team members have a lot of experience in the Blockchain field and have been with Cardano for a long time, so they will be an inspiration for students to tell their stories.\nIn the description of the plan sheet you said that you will approach 3 universities, if possible, you name those 3 universities in the proposal, it will be clearer and also for the community to verify your project.", "q1r": 4, "q2": "I found there was clarity in the problem description, the solution, and how the proposal aligns with the challenge.\nThe information provided on how the metrics are measured is sufficient to gauge the progress and success of the proposal.\nThe roadmap is systematically and scientifically designed, with target numbers and milestones to make the audit easier.\nGiven your organization's experience and metrics, the proposal's KPIs have been carefully selected and I believe they are good indicators of success as the selected outputs will clearly indicate the number of at least 24 events organized, 1000 event participants, 6 surveys ... and progression over time.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 13447, "q0": "The proposal aims at boosting the presence of Cardano in the Philippines, by increasing the knowledge and creating awareness of Cardano blockchain technology and Catalyst. More people will be brought on board, and many students entrepreneurs will be able to access funding for their projects and proposals that they will submit on Catalyst. This will expand the scope of Cardano in the Philippines and also contribute to a reduction in unemployment.", "q0r": 5, "q1": "This project is the continuation of a project that has already been successfully implemented, and drew massive response and great participation. The team that will implement this proposal consists of experts with the right skills and relevant experience which is key to the successful rolling out of the project. The breakdown of the procedure for achieving the objectives of the proposal in the feasibility and auditability categories of the proposal further cements the notion that it is highly likely that the project will be carried out successfully.", "q1r": 5, "q2": "The proposal includes a clear explanation of the recognized problem, as well as the proposed solution to said challenge. The strategy for carrying out the plan is clearly outlined and the proposal has a realistic timeframe which will ensure achievement of the project objectives. The stated budget is also feasible . Thus the information provided is enough to audit the development and success of the project. ", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 13696, "q0": "This proposal is truly exceptional and perfectly meets the requirements of the challenge. It talks about hosting virtual or onsite events to share information about Cardano and Catalyst with Vietnamese students in order to connect, motivate and support them to participate in Catalyst Funding. In my opinion, this idea is appropriate in several respects.Start with the fact that the proposer has already notified a very specific target audience. I noticed that many of the proposals are aimed at attracting non-professionals to the crypto world, which is certainly necessary for the growth and popularity of our community.However, it is also necessary to invest in an audience that is already a little more connected with specific aspects of computing, information technology of the host country, and the target audience of this proposal, I think, is doing well in this environment - Vietnamese IT students. I believe that our blockchain has a lot of potential, but it's not yet well known or widely adopted. \nI believe that our blockchain technology has a lot of potential, but it needs to be more widely known and adopted before it can truly take off. In doing so, these activities will help Cardano become more known and possibly used in some projects.Another positive is that these events will take place in Vietnam; We know that in some places like Europe and America blockchain technology is already more known and therefore accepted, however in East Asia Cardano is still in its infancy. In Vietnam, according to the proposers, there are about 55k IT students from 153 universities and institutes, they are the future leaders of the nation and the world, however they haven’t understood about blockchain and its career opportunities.The Vietnamese University students' unawareness slips away the opportunities for reaching the new evolution makes me wonder how it could be if they are helped to unleash their full potential on this innovation. They might be experts who have critical thinking about the blockchain field or experts who have excellent ideas which can improve the blockchain Cardano. Therefore,  the aim is to “raise the awareness levels of regular people in East Asia about blockchain and the Cardano network should be a priority for the Catalyst community\" starting from Vietnamese IT students. I believe the proposal could create more opportunities and new ideas for building the project from the target students. Their solution is reaching out to lecturers and students to raise the awareness of Cardano and creating more working opportunities which can spread to Vietnamese students and make them potential participants in Project Catalyst (Project as Proposers, Proposal assessors, Referrers, and Challenge team and voters.) The risks they state which occur during the progress is possible. I assume they do serious research about what they are doing. The solution for it is fully described so I have no doubt about the impact it could bring. I just suggest that the unforeseen slippage of ADA can lead to the shortage of budget therefore asking for a reserve fund is worth considering. The other risk is failing to connect with the expected amount of Universities and students so creating a backup list could be useful. In general, I am totally satisfied with this proposal’s solution to solve the challenge, 100% convinced and give it a maximum rate.\n", "q0r": 5, "q1": "The script is full of rich detail, with a sense of time and understanding the motivations behind the events. The steps involved in the process are outlined in detail, so that everyone involved will know exactly what needs to be done and how. These activities are related to the moment of the meeting and the pre-production, too.I could know when such things would happen, what would be done, in what way and when. The project is scheduled to last for five months, and tasks will be clearly divided: approaching universities, hosting events, collecting data for analysis, motivating students to join in the project, and submitting ideas for funding. However, the script states  there are 5 months of the project but I see no plan for the fourth month. I wonder if this is a mistake or if there is no plan for the fourth month actually. The objectives are described from general to detailed to make the reader easy to imagine fully about the whole process. The way they explain for me about how they manage the workload is convincing, I have no more doubt about their ability on this. Now let’s talk about the budget breakdown. The requested money is $33,040 accounting for more than 13% of the whole challenge. I think this is a big scale project, compared to the majority of other proposals of this challenge. However, it is very fair. Several meetings will be held, it's not just the onsite moment of the event, many things would have to be worked on before and some after just like what they show on the script, this generates a lot of expense. The way they calculate the expense for each is so reasonable and transparent. They list everything that needs to be paid clearly and logically. I just have one observation like this: they state they will hire more HR in the university they have selected but not mention this in the budget so I expect a reserve budget for cost incurred. In general, this part shows me well all about how the money is used in what categories. We continue with the project’s members. They are lecturer, researcher, Cardano members and experienced in Computer science with several years working in technology. We can confidently say that the professionals involved in this project are experienced and knowledgeable in their fields. Their LinkedIn and Facebook profiles are also attached, so you can verify all of the information that is being shared. There is a lot of faith in them,  mainly because they are from the computer, IT, blockchain community, which indicates that they would have a good idea of ​​how to dialogue with the target audience. That is, I believe that the feasibility is exceptional, with only a few points to make it clearer personally. \n", "q1r": 4, "q2": "\nThe proponents give us good indicators on how to audit the proposal, for example: Total number of the events, participants, surveys, proposals submitted to ideascale from universities, proposals assessors, 1 to 1 support sessions. I was expecting that in the progress measurement part, we could have a little more qualitative data as well and they did serve me with clear KPIs for each measurement (You guys are supreme). I just request them to show me how they measure the bove index via what platform or tools. From that, I recommend they research the reach of the university students on social media, additional sharing is requested more and more. One more point that I am impressed by is that this proposal is a continuation of the funded one in Fund 7 which is also related with the other 2 proposals in Fund 9. I found it wonderful as it shows the high commitment of the proponents with the project they are doing. Now talk about the successful scenario, they have a full image of how it is and I believe with the practical plan they’ve made, the following excerpt will be possible: “1000+ students from 03 universities became aware of the Cardano blockchain, Catalyst's funding model. Dozens of projects submitted to ideascale, diversify the ecosystem and ensure the sustainability of the platform”. I believe that this project’s success is also the success of the Cardano ecosystem- \"A broad spectrum of people across Asia and connected to Asia, coming together and forming teams to grow our ecosystem.\". \n", "q2r": 5, "assessor": "z_assessor_3750", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13752, "q0": "Yes, this proposal effectively meets the challenge. The problem presented in this proposal is very real and the proposed solution will affect a mass of students via the 3 target universities. Students being the important workforce in the expansion of technologies, they will contribute positively to the expansion of Cardano and its ecosystem in East Asia. These are themes that will be addressed by this proposal. Personally, I find that this proposal effectively meets the challenge that is appropriate to it.", "q0r": 5, "q1": "The plan is well detailed and well presented, it sufficiently proves that in the realization the activities will follow one another with coherence, a very good thing in the success of the proposal. However, a small problem arises. Personally, I find that raising students' awareness of a technology like blockchain requires not only theoretical knowledge of the issue, but also, and very importantly, technical knowledge. For this proposal there are many important skills however none has proposed a github link where we could check contributions on projects using the blockchain.", "q1r": 3, "q2": "The kpi are well chosen in my opinion, they will provide sufficient information to check the progress and success of the proposal. Additionally photos/videos of the event and other materials will be posted on their website (cardano2vn.io) and monthly reports on GitHub (https://github.com/cardano2vn) for the community. I fully agree that the information provided will make possible to follow the progress of the proposal and its success.", "q2r": 5, "assessor": "z_assessor_3778", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 13825, "q0": "Introducing Cardano Catalyst into Vietnamese students' environment can really enhance the East Asia Developer Ecosystem and our Cardano Catalyst Community. Raising awareness of Cardano and its opportunities will widen and open up our horizons. Drawing in this kind of newcomers, University students, graduates and undergraduates is a key milestone for our Catalyst Project. Young entrepreneurs and developers can enhance creativity in complex problem solving and level up our project and ideas calibre. This will lead into growing the Cardano ecosystem in an inclusive and supportive way by becoming active members and participants in the different roles our Community offers. This proposal effectively addresses the challenge of Growing East Asia and therefore, the Cardano Catalyst Community. ", "q0r": 5, "q1": "This experienced team and its consistent key milestone and timeline designed through a five month process can promise that this proposal will be implemented successfully. Although a strong social media campaign can do the heavy lifting. It is not necessary to limit Vietnamese students into a couple of universities. Opening up and reaching out to newcomers that are not only circumscribed into the selected Universities can surprise the project team. Students from all over Vietnam are potential newcomers. They just need to have their cell phone charged and run into Cardano social media content. This might be a more effective way to reach out to a wider audience.", "q1r": 4, "q2": "Weekly meetings with project managers is sufficient to audit the progress and the success of the proposal. Sharing data and information into clear and well organized information with the whole of the Community will be also of great help. Nevertheless feedback from attendees and sincere surveys might be more interesting for the Community auditability process. Sharing this kind of content might be of great help to get to know the Vietnamese student environment in depth. Event’s photos and audiovisual content might be also shared in a strong social media campaign for both auditability and the reaching out for a wider audience. ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 14104, "q0": "Yes , Proposal is effectively addressing the challenge .if talk about the education and spreading knowledge then students are great resources .When we educate them ,it gives great future as well as great economy on which we can relay trustworthy ,by educating students we can grow our community in developing manner and expand are vision and mission .   Proposal address the plan to expand the cardano community by Organize virtual or onsite sharing events about Cardano and Catalyst project for students. Connect, motivate and support students to participate in Catalyst. as an result with this proposal Vietnam Students will accompany other proposed topics in the university, supporting them to come up with ideas and implement ideas on the Cardano platform. with this With the end of the project, about 1000+ students from 03 universities became aware of the Cardano blockchain, Catalyst's funding model. There will be dozens of projects submitted to ideascale, many of which are funded and put into operation. Furthermore, students can participate in Catalyst in a variety of roles. They will experience the new reality of a DAO model.\n\n", "q0r": 5, "q1": "Yes , given plan is highly likely successful as plan is addressing the challenge and given experience of team is highly imprecisely .The way plan presented is step by step and easy to understand and auditable in each step to judge the process and result .  Plan also address the challenge and its also talk about how the engage students and university . Team having Nguyen Anh Tien, Do Ngoc Minh, Trinh Van Chung who having experience  Computer Science Researcher and Lecturer at the Information Technology Institute, Vietnam National University, Hanoi. Advisor for Open Educational Resources (OER) programs of UNESCO, ASIA and Vietnam, Dean of Faculty of Information Technology – Nguyen Trai University. founder of the VILAI stake pool, computer science experts, working in the Cardano/Crypto space since 2018.", "q1r": 5, "q2": "Provided plan is very easy to understand and absorb the basis of achieving success .Plan is working on functions which leads in step by step manner .We will track the success of this project by measuring the following metric :\n\nTotal number of the events we delivered\nTotal number of participants who attend the events\nTotal number of surveys\nTotal number of proposals summited to ideascale from universities\nTotal number of proposals assessors.\nTotal number of 1 to 1 support sessions\nSo we can say that The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3902", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11388, "q0": "Project catalyst is a series of events which seeks to generate the highest levels of community innovation. Catalyst is bringing onchain governance to the Cardano blockchain by allowing the community to self determine priorities for growth. It also let's participants deploy funding to proposals which tackle challenges and capitalise on opportunities that arise in the life cycle of Cardano.As many Vietnam university students unaware of opportunities and campaign of this project organising virtual or onsite sharing events will help them. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "For the successful implementation of project detailed plan is given which includes selection of universities, working with the university representatives to schedule events and organising them , conducting surveys for feedback from attendees and training to integrate with blochchain. Accompanying pioneers in writing and applying funding on catalyst and creating full list of projects and processes with the responsibility of members.The budget breakdown is feasible and acceptable. The team working with the proposal are computer science experts and have a working experience with cardano space. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The progress of the project can be successfully tracked by metrics such as total number of events delivered, participants who attended the events , surveys , proposal assessors and proposal submitted ideascale from universities. The KPIs include events delivered at universities and estimated participants attending events , students attending seminar and sharing session so on. The budget breakdown is feasible and impressive. As the students are workforce for cardano blockchain they will diversify ecosystem and ensure sustainable platform. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"id": 12680, "q0": " the problem to be solved here is that many Vietnamese university students are not aware of the Project Catalyst funding campaigns and the opportunities available. The proposal presents how it will add value to the Cardano ecosystem by Organizing virtual or on-site sharing events about the Cardano and Catalyst projects for students. Connect, motivate and support students participating in Catalyst. The measures proposed by the proponent are as follows: providing background information on the Cardano blockchain, introducing programming languages, sharing opportunities in Project Catalyst, and how to participate. Accompany faculty and students in writing, submitting ideas, and applying for funding on Catalyst.Support them in project implementation and management after their project is funded. If these projects can be implemented on Cardano it will help to diversify the project participants, Students get their project funding quickly and as a result will diversify the Cardano ecosystem, ensuring the integrity of the project sustainable in the future. And by raising the awareness of faculty and students in Universities about blockchain and the Cardano network, and supporting them to become active participants in Catalyst with different roles (Proposer, PA, vPA, Challenge Team, Vote) I believe the proposal can scale to address future challenges. I completely agree that this proposal will effectively solve the challenge, and I give 5* for the impact of the proposal.", "q0r": 5, "q1": "The proponent said that the team members to implement the proposal include Lecturers, Deans with many years of experience in teaching and writing IT-specialized textbooks. are also full-stack developers, sponsored proponents, SPOs, and moderators of Eastern City Hall, the proposal will also recruit additional team members at each college they chose to help them organize events, communicate with students, provide surveys and handle the community. The proponent came up with a reasonable budget estimated at $33040 with a share range at 3 colleges. which has been clearly outlined, broken down into specific definable headings including Event facility cost 4800.Event hosting, $8640 guest fee. Survey design and analysis survey data analysis results sharing $120.For everyone to support $12000, Incentive for students with qualified proposals, limited to IdeaScale:$2000. Project Management $1680. Budget for Marketing $2000. The proposer gives a realistic timetable to implement the project in 5 months, the specific work of each month is determined by the proponent. details. With this proposal, the proponent has also identified the risk and proposed specific measures for that risk. With the information given I agree that this proposal will be successfully implemented.", "q1r": 5, "q2": "The proponent has provided a 5-month implementation roadmap with specific milestones to be achieved, clearly stated, and the progress of the project can be checked. The proponent provided indicators to determine success: At least 24 events will be held at universities. An estimated 1000 people attended the event. At least 6 surveys. At least 20 proposals will be sent to the idea list at the end of the project, 150 students attending workshops and sharing sessions, 40 dedicated sessions for one-on-one support. And I believe those are reasonable indicators to determine the success of the proposal. The proponent clearly described the problem and also gave specific, clear, easy-to-understand solutions to solve the given problem. This proposal is a continuation of a previously funded project. in Foundation 7 I can see them working extremely seriously. That's a plus point of the group. I agree that this proposal provides me with sufficient information to assess progress towards goals and I agree with 5* and for the suitability of this proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 11297, "q0": "This project aims to reach out to faculty and students to raise awareness about Cardano. The challenge entails developing the Cardano ecosystem in a holistic and supportive manner. The team came up with a solution to raise awareness among Lecturers and students in Universities about blockchain and the Cardano network, helping them to become active participants in Catalyst with different roles. The proposal very clearly outlines the solution and how it will bring value to Cardano. Proposal indicators match the challenge, the success of the project will result in a large number of proposals originating from Universities in Project Catalyst. Overall, it's an effective challenge, and can be scaled up as it will increase the number of students and faculty involved in the Cardano community. They will become meaningful participants in Project Catalyst.\t  ", "q0r": 5, "q1": "The proposal seems very detailed to help ensure that it can be implemented smoothly, they have a detailed plan within 5 months. The tasks are clearly outlined for each month, making it easy for readers to grasp the information and how to do it. They selected 3 universities and organized events to share the overview potential with blockchain, Introduction to Cardano, and Catalyst. The team has successfully carried out a project to organize 16 Cardano awareness events at 2 universities in Fund 7 so I find them to be very experienced in this field. The project budget is clearly outlined and seems to provide an accurate forecast of future cash flows to help the project achieve its goals. The team has 5 main members who have a good understanding of the Cardano ecosystem from different angles and experiences.\t  ", "q1r": 5, "q2": " The proposal has a roadmap with specific timelines and measurable metrics. The community can easily track the progress of the project by measuring metrics: number of delivered events, number of participants, number of proposals, and number of reviewers of recommendations. The author mentions metrics/KPIs specific and is easy to follow. The success of this project is what I very much look forward to. When the project is over, about 1000 students will know about the Cardano blockchain, Catalyst's funding model, and they will diversify the ecosystem and ensure the sustainability of the platform. This proposal is a continuation of a project previously funded in Fund 7, and I see a continuation of this as very possible.\t  ", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 11146, "q0": "The IT students in Vietnam are the main target audience of this proposal. It is true that the IT students in Vietnam are young people full of creative ideas and flexible thinking. This makes them an extremely attractive human resource for businesses in general and Catalyst in particular. This proposal aims to reach out and raise awareness lectures and students about Cardano and guide them to participate in Catalyst. Their participation in Catalyst will be mutually beneficial. It could be explained that the IT students will seek out opportunities from Catalyst by demonstrating their capabilities and ideas. On the Cardano side, this will make the ecosystem more diverse, ensuring sustainable development. As a student and also a Proposal Assessor, I believe this section deserves 5 stars.", "q0r": 5, "q1": "This project has a high probability of being implemented successfully because it builds on the previous funded proposal in Fund 7. As can be seen from the previous funded proposal, the team is very experienced in the field of information technology and programming. Moreover, all the members resumes are clearly provided. The proposal to give a very specific development roadmap by month and the budget breakdown is very clear for each expense. However, there is no reserve funds. This funds is very necessary, especially in the current volatile market environment. The reserve funds can help against ADA slippage, avoid budget shortage.", "q1r": 4, "q2": "Fortunately, all the metrics of the project will be measured, tracked. In addition, the KPIs of the project will be published on a website which is belong to the team. It got even better when the team decided to make the monthly report on GitHub for the community. The proposed team makes it very clear when the metrics and the KPIs of the project can be easily checked through the website and GitHub. With the continuation project like this, there is no need to be cautious about the auditability of the project.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 2877, "q0": "From a PA perspective, it’s vital for Catalyst to be well-aware of students who seek opportunities to develop their ideas. The proposal has stated that said problem into the Vietnamese community. From the provided information towards the risk of abundant human resources in graduated students, the project demonstrates their impacts on a range of Cardano-ecosystem-related information that could potentially be participated by students. Speaking of the mutual benefits between communities, it’s easy to see that students, Catalyst and the Cardano blockchain are involved. By this, it’s a highly educational project that is appreciated by humanity to popularize knowledge among the youth. From SDG goals information the project is highly linked to the goal of “4. quality education” where informational access is freely available to students. However, one of the witnessable limitations as it could be inferred from the projects is that there are only 3 targeted universities while challenges are headed for ASEAN community. The project could consider explaining their chosen universities that would likely have the possibility of extending the network, bringing value to the ASEAN community. It’s clear for the project as they might exceed student capabilities and proposals; the proposers had their plan limited within 2 months after the data collection process. However the proposer should specify how the data collection is being executed just like the committed transparency below in their github platform. ", "q0r": 5, "q1": "The total duration of the project is 5 months with a sequential process of tasks. While it’s very detailed to comment on the listed task the proposers should also specify a variety of criteria that will be used when it comes to decision making. For example, when choosing universities what type of criteria should be taken into consideration (university size, credential, infrastructure, etc…) or optimization of hosting cost (why hosting offline will result in a better option?). An additional that need to be made is in the Fifth month as the project mention “Accompany pioneers in writing”, when it comes to transparency, the team should specify the term “pioneers” and make sure that the team is able prove their experience in the field and create credibility to students who want to submit their proposals. This also leads to the need for auditability of the writing process within the team. Besides, the project financial breakdown is clearly written and this true for the foundational background of the team’s profiles. The identified decision of the project to come back after funding due to students' demand needs to further extend what “demands” that could arise after the project is successfully implemented. ", "q1r": 4, "q2": "The numerical metrics to measure the progress is “total” and the project has also been very specific at the number they’re  heading to. The transparency of KPIs is also auditable when the proposers commit to publish the progress results into the website and Github. The project showed the linkage to other authorized proposals of the team that are funded and in progress while giving a good definition of what success looks like. ", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3078, "q0": "\"To solve the problem of the request challenge the proposal team provided a method to foster engagement with the Catalyst ecosystem, of IT students. helping them bring in great ideas. great for Catalyst, diversifying applications across our ecosystem, and also helping students get funding to start their own creative ideas. The main purpose of this idea to bring to the Catalyst ecosystem and the student community at the university is: share them opportunities in Catalyst funding rounds, introduce them to the terminology. and basic programming languages, assisting them in the submission of ideas and their implementation when funded. The group's proposed solution to the problem is by reaching the target audience and faculty of the targeted universities, organizing on-site or online events, * with funding experience from the previous round, in addition to seeing the impact from previous activities, so this supportive educational approach of the proposal, will have a huge impact on the ecosystem of us, and also drive the proliferation of talented developers in the future. the group mentioned the risk the group saw and had a method to overcome it, but I found that there are still possible risks that the group has not mentioned, which is ; price movement of ADA coin during the implementation of this proposal, if so, is there any way to hedge against this. \"", "q0r": 4, "q1": "The roadmap of steps is specifically determined for each month as an important milestone, and in each month, there are appropriate contents to be implemented in accordance with the required time, The budget table is also stated very specifically for each expenditure, especially seeing the boom from f7, so there is a plan to expand more universities, to 3 schools, 1 more than before, The members are mentioned in detail each person, related experience and in addition, the group also mentioned that they will use more selected members at universities to represent the event.", "q1r": 5, "q2": "There are many metrics mentioned for example : An estimated 1000 event participants. this is an impressive number that the proposal brings, these information technology students are really a future, of Blockchain technology, In addition, the team is also committed to providing all metrics to the proposal's website and will periodically report monthly to GitHub, for the community to monitor and verify. success is very well defined that all the participating students will know about Blockchain, not stopping there, but the number of members becoming developers in our ecosystem platform, in the future. hybrid", "q2r": 5, "assessor": "z_assessor_2396", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"id": 3617, "q0": "An open door, connecting IT students to Catalyst.\nThere are many unique creative ideas from talented IT students, but finding funding sources for projects to form and operate is very difficult. Funded projects are usually those that have already come into operation with revenue and profit. So introducing students to Catalyst is a great idea that will be well received.\nAs proposed, IT students are an abundant human resource for creative ideas. So connecting them with Project Catalyst will help develop a fast and strong Cardano ecosystem.\nNot only Cardano benefits, but these students themselves benefit, in addition to developing innovative ideas, they also receive blockchain-related information such as the Cardano blockchain, programming language.\nThey also have the opportunity to work in Project Catalyst as a Proposer, Proposal Reviewer, Referrer, Challenge team and voter.\nWithout being officially legalized, anything related to blockchain will be considered illegal, so organizing a public event may face legal problems.", "q0r": 5, "q1": "Regarding the detailed plan of the project that is expected to be held at 3 universities, the identities of those 3 schools are.\nAs for working with university representatives to schedule events, in my opinion it is not feasible because as everyone knows blockchain has not been officially accepted in any country. Therefore, holding an official university event will be difficult to accept from an agent.\nIn addition to the above reason, the detailed construction plan table is very clear for each job for each month, we can easily visualize the implementation steps.\nBudget allocation specific to each work item where the student design budget section has an IdeaScale eligible proposal, which will attract many newcomers to Cardano.\nTeam composition of 6 people are experts, lecturers from universities, with experience in Cardano and computer technology. Title public information for the community on authentication.\nWith such an experienced and enthusiastic team, I believe this project will be completed without any legal obstacles.", "q1r": 5, "q2": "With proposals to organize such events, it is easy for the community to measure project progress such as: the number of survey votes, the number of participants, the number of proposals submitted, this is also a predictive measurement index. judgment issued.\nKPIs with specific target numbers on the number of events, number of people, surveys, recommendations will be published on the web with photos/videos of the event.\nIn addition, detailed data will be provided monthly reports also show the transparency of the project.\nThis project's success is easily visualized as is the progress indicator with the number of students attending events, the number of people participating in Catalyst, the proposals submitted to Catalyst.", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 15, "ne": 0, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 3823, "q0": "This proposal has stated a clear problem about lack of awareness of Project Catalyst and its opportunities among Vietnam University students. Their solution is to organize online and on-site sharing events about Cardano and Catalyst project for students to connect and help them become participants in Catalyst. \nThe project seeks to get IT students who have creative ideas to participate meaningfully in Project Catalyst. They intend to have IT students to write up projects and get funding for their start up projects, thus Cardano will be diversified and ensure sustainability in the future.\nTheir expected impact is to reach out to Lecturers and students to raise the awareness of Cardano and the opportunities that exist if they could work as Proposers, Proposal Assessors, Referrers, Challenge Team Members and voters.\nThe challenge requires growing the Cardano ecosystem in an inclusive and supportive way. So this proposal by raising the awareness of Lecturers and students about blockchain and the Cardano network and supporting them to become active participants in catalyst has really addressed the challenge. \nThe proposer has mentioned risks and mitigation strategies in the proposal. Their main risk is the fear of getting a lot more students to submit more proposals than expected, but they will mitigate this risk by keeping track of all project activities and expenses. \nI believe this proposal has addressed the challenge effectively. Hence my 5 star rating. ", "q0r": 5, "q1": "The plan in this proposal is quite detailed, showing specific activities per specific month. It is seen in the proposal that during the first month, for instance, selection of universities will be done and work schedule with specific events listed, all the way to the fifth month with detailed schedule. \nThe requested budget in this proposal has a total of $33040 for 8 events in the Universities to be selected. This figure is reasonable for such a number of events. The budget is well broken down into detailed costs per each activity and very comprehensive. The highest cost of $8640 is allotted to events hosting and guest fees, which again is in order.\nThe team of five experts making up the team for the proposal is clearly stated with their names, skills , qualifications and LinkedIn reference links provided. The proposal knows the number of people needed and specific activities to be done by each. The team has various skills and experiences in computer science, stake pool, Plutus Pioneer, blockchain technology and others which make them likely to implement the project successfully. \nThe proposal has indicated that they will submit proposals again in next funds because they had previously implemented a funded project and will want to continue to promote Cardano. The members of the team are also working on other proposals in the challenge.\nWith the above facts, I have given this section of the proposal 5 star for their great work.", "q1r": 5, "q2": "This proposal has outlined enough information that will help easy auditing as follows:\nTo track their progress, they have stated that they will look at the number of events being delivered; total number of participants at events; the total number of surveys to be done; total number of proposals that will be submitted; the total number of people that will become PAs, etc. \nTheir KPIs are to have at least 24 events and estimated 1000+ participants, with at least 6 surveys, among others mentioned in the proposal. \nAll their videos and work will published in their website and monthly reports sent to GitHub for the community, as indicated in the proposal. \nAt the end of the project they want to see their success as about 1000+ students being aware of Cardano blockchain; many proposals would have been submitted on Ideascale, among others. These successes will scale Cardano and diversify the ecosystem to ensure sustainability of the platform. \nAll these information I believe are enough to audit the progress and the success of the proposal. So my rating is 5.", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4826, "q0": "This proposal is an interesting proposal since it aims to educate university students about Cardano and Catalyst, the given problem and the solution are clearly aligned with the challenges settings, which are to focus on East Asia to bring new members to Cardano and Catalyst. The proposed solution is clear but lacks a bit of details, consider adding details on the marketing/advertising, the universities that you will try contacting for this project, how many resources will be provided for the students ? Answering these questions would help the reader to understand your proposal the best way possible. The proposal clearly fits the challenge, but might need a bit more concentration on the challenge/risks part, which I advise you to be a bit more complete. Apart from this, really good.", "q0r": 4, "q1": "The timetable is clear and realistic, it gives us a complete overview of what is going to be done, but I advise you to give more details on how, with what products, who ? Concerning the budget, it is broken down clearly. The budget is reasonable to achieve the goals of the proposal. The team is also really complete and has experienced members, some of them are part of the community and already have some experience with Cardano.", "q1r": 4, "q2": "The auditability is nicely done, with well-thought-out success metrics and KPIs that define the success of the proposal and have a public website where they deliver monthly content for the community to check on their projects. The main objective is aligned with the challenge as well as all the side objectives.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5015, "q0": "The team wants to onboard IT students from Vietnam onto Catalyst. This includes the roles of Proposers, Proposal Assessors, vPAs, Challenge Team members & Voters.\nThey take on the responsibility of onboarding the students, training them, and guiding them through the process. They have training materials for the onboarding process and dedicated members helping students with proposals.\n\nThis is very impactful because it brings younger generations into the Catalyst ecosystem. The earlier we start, the better it is for the growth Catalyst. In my opinion, the onboarded members eventually become long-standing members of the Caradno ecosystem as a whole. Hence the rating of 5 for impact.\n\n", "q0r": 5, "q1": "The team consists of experienced stake pool operators, programmers, and educators. Based on this experience, they are extremely capable of implementing the proposal.\nThe process consists of identifying three universities, working with the administration, and organizing educational/onboarding events. Providing additional information if requested by students interested in participating, and collecting feedback from the faculty, administration & event attendees. Lastly, they provide guidance and support for student teams that are interested in submitting proposals. Note that some of the work, namely marketing, event organizing, surveys, content design, etc will be outsourced.\nThe budget is broken down based on the above tasks and seems very reasonable.\nBased on all the information provided, I believe that the proposal is highly likely to be implemented.\n\n", "q1r": 5, "q2": "Auditability during implementation: The monthly progress reports for the proposal would consist of proof of collaboration with universities, numbers of events organized, proof of attendance, surveys collected, and proof of support for aspiring proposers.\nKPIs after implementation include the number of proposals submitted, the number of attendees for townhall meetings (Asian Townhall if there is a strong audience for it), and overall participation in the Cardano ecosystem from the cohort.\nBased on the above-mentioned indicators and reportable events, I believe this proposal is highly auditable.\n", "q2r": 5, "assessor": "z_assessor_2663", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5236, "q0": "Catalyst is a very good funding program, especially for those with little experience and connections but still have a business idea as students. However, the current Catalyst program in Vietnam is limited to a small community of ADA cryptocurrency holders. Therefore, there is a great need for programs and events that can spread this program widely to students, especially students of information technology, because they will be potential people who can build projects on the Cardano Blockchain platform.\n\nThe team's proposal is to organize webinars and workshops for lecturers and students of information technology universities in Vietnam to introduce the basic contents of Catalyst such as \"Proposal, PA, vPA, challenge team\", voters” can access up to 55,000 IT students at 153 universities, with these numbers above the Catalyst program will grow quite strongly in the Vietnamese market.", "q0r": 5, "q1": "Your proposal is expected to be implemented within 05 months, with each month having a specific work schedule. And as described, a lot of the tasks on the event will use human resources from the community, and the project team members do the main management work, so it requires the ability to clear and specific work management, time management, and compensation mechanism. And in the proposal, the group also has a method to solve the above problem.\n\nThe team plans to organize 24 events in 05 months with a total budget of $33040. All work items, costs, and expenses for each item are given in detail by the team. I think the cost is reasonable.\n\nAbout the team members, there are 05 people, of which 03 are lecturers at universities of information technology and 02 experts in Blockchain, Cardano, and Catalyst. The project team is also operating the ADA staking pools which are VILAI and HADA. These things above help me fully believe that the team is capable of helping to widely spread the Catalyst program to the student community in Vietnam.", "q1r": 5, "q2": "The metrics that the proposal uses are reasonable for the goal of expanding the Catalyst program to the Vietnamese student community, such as the number of proposals submitted, and the number of PA participants,...\n\nWith the target number of +1000 students at 03 universities, Catalyst, as well as Blockchain Cardano, can be known as a significant number for the Cardano community in Vietnam. With this number, the number and quality of proposals on Catalyst from Vietnam will increase significantly in the near future.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 5764, "q0": "Students are the generational owners and developers of the blockchain ecosystem. Educating and onboarding both students and lecturers is a great deal for catalyst and the entire blockchain community. The proposal is addressing the challenge by onboarding, create awareness and prepare the next developers for  the cardano ecosystem. \n\nInterestingly, the target group is the IT students who already have interest and knowledge in computer and this will make easier to explain and participate in the opportunities of catalyst. \n\nThis proposal seems to have no risk looking at the ways to create awareness and the approach to solve the problem of blockchain literacy among students", "q0r": 5, "q1": "The detailed plan of implementation is clear for the proposal to take off. This is well explained on what to do in each month and at each point with expectations. The survey to be conducted for follow is important to measures success and equally a good tool for address challenges as the project enters into the next month\n\nThere exist a well experienced team who are close to the students. It is important to also note that, students, trust their lecturers and would surely have respect their opinions and attend conferences organized by their own lecturers. This is really a perfect way of ensuring a result-oriented project. The team are IT lecturers are may have the vast knowledge in blockchain and this makes the implementation of the project very easy. \n\nHosting 24 events in 5 months however is quite ambitious and may be done in haste. The proposers should reconsider and negotiate the timelines and the number of events in the timelines to reflect reality for implementation if the proposal win for funding. incentives are also important to encourage students to have more interest in the cardano ecosystem and the budget has that component. \n\nFinally, the budget for 24 events is reasonable but the timelines should be extended to register for great outcomes. This will make room to plan each event well and ensure the budget is able to foster the implementation of the project. ", "q1r": 4, "q2": "The KPIs are measurable and this is key to ensure easy auditing. These KPIs are achievable and could be monitored and evaluated by the community.\n\nHow success looks is realities for 1000 with a number of participants submitting proposals to project catalyst. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 6598, "q0": "Nowadays, many Vietnamese students are unaware of Project Catalyst and the whole world of possibilities and tools that this one can bring us. For this reason, the proposer provides the solution of making several events about Catalyst for motivating and connecting the students. The future vision of the proposal shows a significant improvement in the Cardano ecosystem because of the increase of people who will become active participants in Catalyst with different roles, growing the community around the world. This proposal addresses the challenge, I rate impact with a score of 4.    \n", "q0r": 4, "q1": "The proposer team provides several links and references to support their statements and I believe they have the necessary experience and skills to deal with the challenge. The proposal also offers a detailed timetable for the next 5 months with different topics to learn about. As far as the budget is concerned, this is a very detailed one and it is enough to consider it. I can rate the feasibility of this proposal with a score of 4.      \n", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. There are also several metrics and KPIs to track the success of the project over the months, looking for at least 24 events, 1000 participants who attend the events and a minimum of 20 new proposals will be submitted to ideascale as the result of the months of teaching. If the proposed solution is successfully implemented it will provide much value to the Cardano ecosystem. I rate auditability with a score of 4.\n\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 7113, "q0": "This proposal is a continuation of a funded proposal in F7, where the proposer hosted sharing events for university students. They taught the opportunities surrounding Project Catalyst, whether as a proposer, as a Community Advisor, or even as a voter. The proposer also teaches the students basic blockchain introduction and programming fundamentals. Clearly, the proposal would add value to the Cardano ecosystem, specifically Project Catalyst, because its primary mission is to educate new batches of proposers, CAs, and voters. Ultimately, this would increase the size of the Cardano community in East Asia and thus aligns with the challenge goals.\n\nFurthermore, because it is a reiteration of the previous proposal, the proposer applies new improvements in the program by facilitating more AMA for students and allocating specific time for guiding them when curating their proposal. It shows that the proposer can address future challenges by learning from previous implementations. Overall, I strongly agree with the proposal's impact as it’s already produced concrete results in the previous Fund 7.", "q0r": 5, "q1": "I tend to agree that the proposer could execute the proposed implementation from start to finish mainly because they have done the same activities before in Fund 7. The budget is broken down into identifiable items and the amount is reasonable albeit a bit excessive (for example the student incentives). I think the proposer could benefit from elaborating more of their budget items so they could convince us about their amount. For example, the third budget item “survey design and survey data analysis”, what does it mean? What data does the proposer refer to? Is it for internal usage? Is it for future improvements? In their previously F7 funded proposal outcome report there isn’t any data-backed points that would suggest the existence of a survey; thus more clarification is needed. The proposer mentioned one risk which is the possibility of more than 24 planned events, which might be dangerous as it increases the cost, but they haven’t mention anything in the proposal on how to mitigate that risk. In the end, there are a few missing details in the proposal that would benefit both the proposer and community. However, they have conducted similar events previously thus I tend to agree the proposal could be carried out.", "q1r": 4, "q2": "The proposer provided milestones per time horizon, and I could attest that it is appropriate with the timeline. The metrics they used (number of proposals, events, participants, onboarded students, 1 on 1 support sessions) are reflective of the proposed goals. I applaud that they put a higher target than their previous events in F7, showing signs of ambition. The proposer also plans to keep a record of their activities and expenses through Github; thus, convincing us this proposal would be easy to measure and track.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 7819, "q0": "The proposal has adequately addressed the challenge and it is in the right challenge as well. The idea of informing and training University students and lecturers, especially those who studied IT will most definitely create a greater awareness of the Cardano ecosystem to university students.  \nThe proposal has also included  the necessary solutions to tackle the knowledge deficit of the Cardano ecosystem in Asia. The proposal has provided a lot of experience and knowledge of the inherent problem in the challenge. When funded it will help in addressing the challenge. For this reason I gave this proposal a 5 star rating.", "q0r": 5, "q1": "The team behind this proposal plan to use both online and in-person training /education conferences and meet-ups to tackle the issue of ignorance among university students and lecturers about Cardano, project catalyst and blockchain technology.The proposal has provided a detailed plan to complete this  project which was started and  funded in Fund 7. \n\nLooking at the skills and current knowledge of the team behind this project  it is quite clear that the team behind this project are  experienced and up to the task. Going through the links it is quite obvious that the plan provided to execute this project is highly achievable. I therefore gave it a rating of a 5 star.", "q1r": 5, "q2": "The proposal contains  auditable tools which are easily accessible to measure the progress of the work. Avenues such as the teams website as well as their GitHub channels have all be provided.\n Additionally, key metrics and matching  milestones where included to enable the community know whether the project is on track. Adequate timelines are provided to measure success. For this reason I gave it a 4 star rating ", "q2r": 4, "assessor": "z_assessor_2924", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 8887, "q0": "As we have seen there are many IT students around the world who will be having excellent idea during academics but they'll fail to start or complete the project due to lack of monetary or other resources, these people are even of cardano eco system where they can raise fund for their for project to make their project a successful one , Hence to overcome such scenario, The proposer wants to reach upto 3 universities and introduce them about blockchain , He even wants to know students about different roles where they could work as Proposers, Proposal assessors, Referrers, and Challenge team and voters. So that students can contribute in blockchain development , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented task is not a difficult one to achieve where proposer has to select 3 universities and reach out to students and  create awareness about different roles that are present in cardano ecosystem and students of Vietnam can make maximum use out of these findings, to achieve this task one good speaker and who has worked in blockchain previously and 2 more members who can support him are needed, In the proposal proposer has mentioned his team consist of  Lecturers, Deans with many years of experience in teaching and writing specialized IT textbooks, and they have worked in funded projects of project catalyst , Hence with team already set up and minimal risk involved plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The goal in the audit is simple where proposer want students of Vietnam to know about cardano eco system and can make maximum benefit out of project catalyst without any barrier, proposal has explained how there are more than 55000 IT graduates every year In Vietnam alone and how cardano eco system can grow at vast rate in future of Vietnam.\nThe audit has even introduced the experience of proposer's team in cardano eco system. the audit has well planned road map to complete the project and has presented budget breaking idea in detailed manner so that project can be of still more efficient, With minimal risk involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 8987, "q0": "Proposal to effectively solve the challenge. The proposal is aimed at reaching students of information technology faculty of universities. The team offers a solution to introduce blockchain, Cadano, Catalyst to students. faculty and staff in universities in order to raise their awareness about Cadano and blockchain support them to become active members in Catalyst in various roles The team came up with a solution that could and benefit The benefits it brings to the Cadano ecosystem.The success of the project will attract a large number of students and lecturers to participate in the Cadano ecosystem.\n  expand this scale because it will increase quality members participating in Catalyst.", "q0r": 5, "q1": "The detailed and clear proposal is highly achievable. They give a very specific 5-month plan so that everyone can know what they do. They have successfully organized 16 events for students and lecturers of 2 universities in fun7 so they are experienced people in this field. In Fun9 the number of universities is 3 schools, and the number of projects increased to 24 events showing that they are very determined in raising awareness about Blockchain, Cardano, and Catalyst to universities The project budget is very detailed, broken down by item, with 24 events organized, the budget of $ 33040 is reasonable. The team of 5 members is knowledgeable and experienced in the Cardano ecosystem, so the possibility of successful implementation of this project is very high.", "q1r": 5, "q2": "The proposal has a clear and specific roadmap. The project's timelines and KPIs are measurable. The community can easily track the project's progress through the number of events held, and the number of people. participating in that event, the number of proposals, and the number of reviewers proposed after the end of this project I am looking forward to seeing this project successfully implemented. There will be about 1000 students participating in the system. Cardano's ecosystem, helps the ecosystem to grow. This proposal is a continuation of another proposal that was made in Fun7 and I see this as a possible continuation.", "q2r": 4, "assessor": "z_assessor_3011", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 10211, "q0": "The purpose of the project is to organize sharing events about Cardano and Catalyst for students, thereby bringing the Cardano community to lecturers and students, and thereby giving them the opportunity to be proponents and advocates. evaluate proposals and develop the growing Cardano community, and support to complete projects as well as help faculty and students when they need guidance and help when coming to Cardano.\n The project has also created a website for this project (https://cardano2vn.io), besides, the team has not realized the factors affecting the project as well as how to solve it, which is very important. If the project is important and wants the project to be successful, the team should pay more attention to this issue. For example, the person who conveys it to the students must be attractive when the information about Cardano is not popular in Vietnam today.", "q0r": 4, "q1": "The project has a very detailed and specific work plan when it states the plan of each month as well as how the team manages the funded projects, the costs for the items they set out are very reasonable with a full range of resources. detailed section, the members of the group are experienced people and have clear and complete link information (https://www.facebook.com/tiennguyena,..), in addition, the group can also add members when going to schools. This is a very good project. Just looking at the statistics of work and spending in the project, we can see that the project's probability of success is very high.", "q1r": 5, "q2": "with a good KPI and progress can be tracked on the team page, besides the project is a continuation of another project in Fund 7 (Catalyst 4 Vietnamese Student Event) and involves 2 projects other in Fund 9 (learn about Cardano developers in Uni, Cardano developer club in Uni), then this is a good project, promising and worth the investment.", "q2r": 5, "assessor": "z_assessor_3166", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 10342, "q0": "I think the idea of this proposal is fruitful for the challenge. Because it will attract a large number of participants who are the young talents with creative thinking, brainstorming awareness, together with passionation in IT industry. Their contribution will help to build the variety for catalyst project, make the cardano platform develop dramatically. The advantages that the proposer want to bring to us is the establishment for an environment of community where there are a lot of high experienced lecturers and good students meet together.", "q0r": 5, "q1": "The feasibility of this proposal is good. I can see the detail plan for  preparing the organization of each activity for the events. The timeline is devided mothly to review each task with realistic deadline. Regarding to the budget, as informed that the fund for this project given in fund 7 and 8, so now fund 9 the team analyzed and proposed the cost which is pretty high with the aim to expand the scope.but i agree with the proposer that the demand and potential from students in the blockchain field at university is high and we need to keep deploying it.", "q1r": 5, "q2": "i think that the progress of this project is quite simple to trace, accessing the information on channel that the team provides. Our expectation for KPIs of reaching up to 1000 plus studens from 3 universities becoming aware of the cardano blockchain as well as catalyst's funding model is high. The effectiveness must be measured by the proof number of project summitted after that.  ", "q2r": 4, "assessor": "z_assessor_3182", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 10412, "q0": "we all know that crypto is not very popular and well-known in Vietnam especially among the young generation. They still doubt that what is crypto? and these coins are real or not? I believe that this project along with its workshop and events in universities could give a clear vision to the students on crypto/ blockchain in general and deep knowledge for Catalyst and Cardano in specific.", "q0r": 5, "q1": "The project has shown a very wide and clear picture of what the proposers will do to make the students engage in compose and submit the projects as well as become the meaningful and valuable participants in the Cardano ecosystem.\nThe special thing in this project is that it focuses on the IT students to make the future funding be variety with different kind of projects. The plan is also understandable with a comprehensible budget and trustworthy proposers who can prove their ability by their jobs and experience. ", "q1r": 5, "q2": "The auditabilities will be based on the number of students who participate in, the number of events and this project also had a fund in Fund7 with a lot of data to follow up. If this project is successful, there will be a bunch of workforce for Cardano blockchain. ", "q2r": 5, "assessor": "z_assessor_3184", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 10681, "q0": "For me, the idea of ​​this \"Catalyst Events 4 Vietnam Students\" is perfectly suited to the challenge, it also has the link between the impact and the future human resources of the blockchain industry, which is Information Technology students. This idea will organize online/offline sharing events for students, students to connect to support this human resource to contribute to Catalyst. I completely agree that students are an abundant and potential human resource of the Blockchain industry, even Cardano supports creativity and creates a new technology era based on young human resources. (Clearly, Cardano plays a big part.)\n\nHowever, to be honest, there are more than 3 projects with the same idea like this that I have read and evaluated in fund 9, I will not evaluate because it is entirely possible to have the same idea, but maybe a different geographical area. Honestly, I think it's better to choose the proposal with the most potential, but I won't be against the idea of ​​overlap here.\n\nParticularly in this proposal, the author said that the fund has been obtained at fund 7 (18,000), and fund 9 (29,360) will be phase 2, I appreciate that this proposal idea has worked very clearly. and transparent through the videos of the students/team conferences updated in the media, of course, I have verified (twitter, youtube, facebook).\n\nThis is really a great idea when there is an abundance of young human resources they invest in research on technology and are supported by Catalyst, for me this proposal is completely suitable for the challenge. Recommendations based on my experience, which universities should the author update, plan an event schedule for students on a social networking app, and update throughout events, plans implemented there so that the proposal reviewers can easily check and track. In short, this is a potential proposal because they are taking it very seriously (through their activities).", "q0r": 5, "q1": "The feasibility of this proposal is completely high because the team has performed the activities as they have committed to fund 6 (as evidenced by their activities being public). I fully believe that this team that won at fund 6 can fully rejoin to expand and continue to develop this idea again for better results. With a little personal opinion as I mentioned above, the team should have a forum or fanpage to post all of their activities here, from conferences with students to social events, student ideas or teamwork with school officials, etc., this will make it easier for PAs to evaluate and monitor as well as recognition. In addition, sharing information about the group's journey as a coherent rail is also easy for other parties (such as other universities or non-year-old students in the 4 university teams to approach) is also accessible to the team.", "q1r": 4, "q2": "The impact of this proposal and its feasibility and auditability are completely determined by the team through the specific activities that the team has been implementing. In the audit measure to track project progress success section, although the numbers are given, the team has not yet planned the activities, so it is a bit difficult for the PAs to verify the data. The KPIs of this round are also quite relevant compared to the previous fund proposal, which is also a good sign that the team is very active in the community.", "q2r": 4, "assessor": "z_assessor_3191", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 10836, "q0": "The project will provide fundamental information about the Cardano blockchain, introduce the programming languages, share the opportunities in Project Catalyst, and how to participate. Organize events aimed at Vietnamese students. Education to improve knowledge about the Cardano ecosystem is always necessary. So the proposed idea will certainly contribute to solving the challenge. However, what we still do not understand here is how this event will play out? What special feature helps it attract students to participate? Does the content delivery method have any creative points? I think if the proponent could answer these questions this section would be perfect. ", "q0r": 4, "q1": "This topic is very well presented. A detailed planner for each month is provided. We have quite enough information about the activities that will take place each month, and the steps to complete the project. In addition, the team also has solutions to manage the workload most effectively, ensuring the success of the project. Another plus is a very detailed and clear project budget allocation table. I also highly appreciate the members who will carry out the project. They are all knowledgeable and experienced in the industry. In particular, their contact information and personal accounts are provided in full. One small suggestion is that the proponent should add specific roles of members in this project", "q1r": 5, "q2": "The success of the project will be measured based on the following metrics: Total number of the events we delivered, Total number of participants who attend the events, Total number of surveys, Total number of proposals summited to IdeaScale from universities, Total number of proposals assessors, Total number of 1 to 1 support sessions. They all have a specific goal (number) to be achieved. These goals not only measure project progress but also measure the positive impact on Project Catalyst. It's great that these KPIs along with the event's photos/videos and other materials will be published on our website (cardano2vn.io) a few days after the event is complete. A monthly report will also be made available to the community on GitHub (https://github.com/cardano2vn). The \"auditability\" of this project is very good.", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 11077, "q0": "Many Vietnamese university students, including IT students, do not know about Project Catalyst's funding campaigns and opportunities even though they have a lot of potential. Your recommendation: \"Organize virtual or on-site sharing events about the Cardano and Catalyst projects for students. Connect, motivate and support students to participate in Catalyst\". I find this to be a very good suggestion because startup projects of IT students often face challenges in writing projects and raising capital. If these projects can be implemented on Cardano, they will be a perfect combination: Cardano diversify project participants, Students receive project funding which will ensure future sustainability future. You choose information technology students is absolutely correct because every year, about 55,000 IT students graduate from 153 universities and institutes, this is quite a large number. As you describe it is not a risk. I think with this project there is almost nothing difficult. I support your suggestion.", "q0r": 5, "q1": "To solve the challenge that is to develop the Cardano ecosystem comprehensively and support participants, you have come up with two groups of solutions: firstly, raising the awareness of lecturers and students in the courses. College of Blockchain and Cardano Networks; the second supports them to become active participants in Catalyst with different roles (Proposer, PA, vPA, Challenge team, voter). In my opinion, in the first solution, you must pay attention to compiling the content of documents to ensure quality and should compile in an open manner to regularly update and supplement documents for perfection, choose the organizers of the event. The fact that those who have experience can choose students who have successfully started their businesses will have a wider spread. You need to innovate training methods in the direction of enhancing the design of learning activities through hands-on experiences to form skills for students. Make good use of the inspirational role model method that succeeds with the application of Cardano technology to motivate and support them to create their own projects by making calls, meeting face-to-face, group discussion (if possible). You have provided a complete plan and clearly articulated the project management mechanism, which is a plus for you. The detailed budget breakdown for the project is quite detailed and transparent.", "q1r": 5, "q2": "You have provided information to measure the results of the project, and if to measure the progress of the project, in my opinion, you should base on the timelines in the plan to control the progress of the project. than. Basically all the information in the project is very clear. Information technology students in particular and students in general are the potential workforce for Cardano blockchain, they will diversify the ecosystem and ensure the sustainability of the platform. Your proposal has chosen the right object to invest. Good luck.", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11367, "q0": "Students are smart, good self-study ability as well as quickly adapting. Information technology is hot in VietNam today, only candidates with the highest test scores can become information technology students. So IT students is potential Human Resources Cardano ecosystem.\nMany students have good ideas and eed budget support to turn ideas into reality. Howerver, it is very difficult for thier idea to get funding, so many good ideas do not implement. If Catalyst fund them then their project will be successful and will contribute well to the Cardano community.\nIn addition, there is a lot of students with difficult circumstances. They have to do manual work (washing dishes, carrying goods, loading goods, etc.) with relatively low remuneration to cover their living expenses and pay tuition fees. Due to a lot of working time, they have little time to study, so their academic results are not good, even they are forced to drop out of their university. If they know Catalyst and can earn money from Catalyst then they will have more time to reseach and create. That is the human value Catalyst brings to society.\nCurrently, the number of students who know about Catalyst is very limited. Your proposed project will be a bridge between IT students and Catalyst because your project will provide background on the Cardano blockchain, introduce programming languages, share opportunities in Project Catalyst and how to get involved; guide IT students to write and submit ideas and apply for funding on Catalyst, advise them in their project implementation and management after their project is funded.\nI rate this project as satisfying the requirements of this challenge. It has a very good spread because of the following two reasons:\nFirstly, the IT students in the Cadarno community that your project will be the one to introduce the Catalyst to other faculty students in the school through clubs (if they have difficulties, you will coordinate suit them to do it).\nSecond, these graduated students will introduce Catalyst to their colleagues.\nMy only concern about your project is that the specific object of the project is information technology students or Vietnamese students in general. ", "q0r": 4, "q1": "A small suggestion is that you can specifically name 2 universities that you have successfully implemented in fund7, and the names of 3 universities that you will implement in this project. How many months will your project be implemented? I don't see the plan for the 4th month, but the 5th month.", "q1r": 4, "q2": "The project's KPIs are clear including at least 24 events will be held at the university; 1000 people attended the event; at least 20 proposals; 150 students attended the workshop; sharing session\n40 sessions dedicated to 1-1 support. The results of working are published at the specific links. The testability of the project is good. If KPIs were built for each month, I suppose it would be easier to check.", "q2r": 4, "assessor": "z_assessor_3242", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 14434, "q0": "Given the proposal presented, I reckon that this project can bring many benefits to the table. Instead of searching for talents who already possess the knowledge about Blockchain or communities like Catalyst, reaching out to students in a country like Vietnam, where the IT community is growing stronger and bigger, is an excellent idea. As mentioned in the proposal, Vietnam has abundant human resources and lots of like-minded people. Therefore, making the Cardano community more well-known in Vietnam can gain unprecedented benefits for Cardano. However, the proposers need to convince supporters why Vietnam is a better place to market Cardano but not any other Asian countries such as Japan and Korea.", "q0r": 4, "q1": "I am quite disappointed with the 5 months plan presented by the team, which is quite sketchy. The plan is not clear about which universities they are going to present to or the level of IT knowledge of students at those universities. Although proposers can reach out to a variety of huge student communities, however, students’ level related to IT in different universities is largely different. Hosting 8 events per university, in my opinion, is quite excessive. If doing it the right way and marketing to the right target students, 3 events per university is enough to make Cardano’s reputation more widespread in Vietnam.", "q1r": 3, "q2": "The good point is that the budget is broken down quite clear and easy to keep track of. All key measurements and KPIs are undoubtedly identified. What I like more about the auditability of this project is that they vision their picture of success in detail so that supporters can assess whether the proposal’s team can do what they say. Monthly reports are publicized on Github for the community to keep track of. However, it would be better if the team can set up a channel to get feedback from the community and respond to any inquiries of supporters during this project. In addition, I feel like the team has not assessed every risk that they might have to face, which can greatly inhibit the success of this proposal. To sum up, the team need to work more on their auditability so that supporter can trust and invest capital into this project.  ", "q2r": 3, "assessor": "z_assessor_4052", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Organize virtual or onsite sharing events about Cardano and Catalyst project for students. Connect, motivate and support students to participate in Catalyst.", "experience": "We are Lecturers, Deans with many years of experience in teaching and writing specialized IT textbooks. Understand the process of creating and publishing textbooks in Universities. We are also full-stack developers, funded proposers, SPOs, and Eastern Townhall moderators."}