{"id": 418728, "author": "gorgasiagian1", "title": "Web ADA Info Community In Bahasa", "url": "https://cardano.ideascale.com/a/dtd/418728-48088", "category": 26602, "amount": 4350, "description": "How do Indonesians and the Cardano community find reliable and contributing Cardano information on the web?", "f6_no_assessments": 7, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1124, "q0": "This team is proposing creating a Website, a Forum and a Telegram channel dedicated to ADA and the Cardano ecosystem in Indonesian Bahasa language. I think they may also be planning to host Zoom meetings (according to their budget – but they may want to clarify or add this idea into the Impact section)\n\nThe website will provide reliable and easy to understand information on Cardano news, technology and projects in the ecosystem. It will be linked to a forum enabling the community to ask and answer questions and get support. Community members will be invited and encouraged to write articles and contribute to the website in an inclusive manner. Marketing campaigns offering rewards will be launched as incentives for members to participate. (again, I got this information from their budget, and they may want to clarify  or add this aspect into the impact section as well) \n\nWith English speakers being only 21% of Indonesia's 275 million population, introducing, educating and promoting the Cardano blockchain and ecosystem in Bahasa is definitely needed and therefore this proposal strongly aligns with the objectives of the challenge.\n\nI think creating a connected website, forum and telegram channel in Bahasa, each complementing the others, is a great idea to help the Indonesian Cardano community grow.\n\nAs a side note, it is worth noting too that although there are some differences in Indonesia Bahasa and Malaysian Bahasa, most people speaking Bahasa can understand both, so the proposed Website and Telegram channel have the potential to reach and help the Cardano community in Malaysia as well (with a population of 33 million). ", "q0r": 5, "q1": "The feasibility of the project provides a general plan for the first 3 months of the project but lacks detail in terms of how they will execute certain steps to be undertaken, specifically marketing and content creation. Marketing is the linchpin for this project's true success, simply creating a website and forum does not guarantee traffic. Simultaneously all of the content required to make an informative website will take time to create, more than the one month they have allotted themselves. It is possible they already have a lot of content but this was not presented. The budget itself is reasonable for making a website and forum, although it is not exactly clear if this is a 3 month or 6 month budget as both time frames are referenced. \n\nThe team members do have the qualification necessary for the successful implementation of creating a website with a forum having experience in graphic design, web development, software engineering, and social media applications.  My main concern is not whether the team can create a website with a forum but how they will drive traffic to this site. ", "q1r": 3, "q2": "Certain aspects of the project are easily auditable as the team will be sharing their test website and have a GitHub repository available to show progress for the website's and forum's development. However, the proposal lacks any other KPIs, specifically readership and participation metrics. \n\nYes the proposal presents a solution to the challenge of growing Cardano in East Asia by building a website, forum and operating a Telegram channel in Indonesian Bahasa but it does not provide any detail on what is considered good audience metrics or how they will achieve that audience. Perhaps the team has experience with SEO and advertising/marketing or networking but there is no clarity given on these essential aspects of success.", "q2r": 3, "assessor": "z_assessor_2207", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2016, "q0": "This proposal’s idea is to create a website/platform in Indonesian language to Indonesian people, sharing news, projects and educational ADA content, aiming to foment the development of ADA blockchain among them. The proposer objective is to address the problem stated of the absence of ADA materials and the difficulty to find them in Indonesian.\nThis proposal’s objective aligns with the challenge since its goals focus on increase the awareness and knowledge about ADA blockchain among Indonesian people. Not only removing the language barrier, but also creating a local to share relevant content and filter those that have not that much to add.\nUnfortunately, there were not added metrics in this proposal, meaning we can not really define if their measurements are congruent with the challenge.\nThere is indeed a plan to scale, if they are successful, inviting other writers to join the platform, contributing with news, blogs etc, which will increase the quantity and quality of the information shared. However, unfortunately there is no plan to self-sustain the project, meaning that the intention is to continue using this fund.\n", "q0r": 3, "q1": "To verify its feasibility, we shall focus on:\n1 – roadmap: The presented roadmap is quite general, not giving enough information about how each task will be delivered. The way it was presented is a time-frame with several tasks inside it. The proposal would gain if the proposal re-write it with simpler steps, adding information about how they intend to accomplish each of them, creating milestones for us to follow.\n\n2 – budget: it is also a general budget. The proposal would benefit from more information about the money allocation for each task. For example: the proposal asks for USD 1200 for marketing and rewards for article writers. However, there must be a division between these two allocations (marketing and rewards – probably not going into the same allocation). Furthermore, in this example, what media and strategies are going to be used to merchandise?  How much an article will pay? How are the proposer thinking to validate the content of the article? Etc. That being said, there are information that could be added that would detail more.\n\n3 – team: The team gave proof of knowledge and experience through a LinkedIn link. However, it would be nice to link the tasks to the team members to not leave any doubt, i.e., who is going to be responsible for the marketing, since there is no specialist in this field?\n\n4 – self-funding/scalability: There is an intention to scale, achieving lots of people, however there is no detailed plan to self-sustain and monetize this project, which is quite important to maintain its rewards and keep with finding people to write and publish. Since the proposal mentions future new sponsors, maybe adding a strategy to gather possible ones.\n\nThat being said, there are some information that could be added in order to allow us to better evaluate its possibility of success.\n", "q1r": 3, "q2": "As the feasibility, there are some important points to look into, such as:\n1 – own channel: there was provided a github repository in which they will post the development of the project and a web testnet. Therefore it is quite easy to follow its progress\n\n2 – roadmap and milestones: unfortunately, as mentioned, the roadmap is quite general, not subdividing the tasks to facilitate our monitoring of the proposal. Therefore, adding more detailed information and subdividing the tasks would be great.\n\n3 – Metrics and KPI: It’s implicit that they’ll measure traffic in their platform, but it was not said. There are also some KPI that should be followed, such as # articles viewed, # news accessed, # proposal accessed. Measuring these you will find out where to put more energy.\n", "q2r": 2, "assessor": "z_assessor_2298", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7114, "q0": "Currently, there is no benchmark website for Indonesians to look up in order to find news and updates regarding the Cardano ecosystem. The proposer is trying to tackle that problem by developing a site where users can find news, guides, articles, and a discussion forum to ask Cardano-related questions. The site is also going to be integrated with Telegram, so if there are any new articles or updates, members in the telegram group would get notified in real-time. Since the site targets Indonesians, the proposal also fits with the challenge setting.\n\nThat being said, there are two concerns regarding this idea. First, I can attest that informational websites about Cardano already exist (here is one example: easterntownhall.com/id/docs/seputar-cardano). I happened to stumble across that site when looking up Eastern Townhall Indonesia, so it’s clear to me that Indonesian Cardano guide websites are already out there, they are just not reaching many people. Sure, this website's content might be different and its reach might be larger due to the use of Telegram and SEO improvement (in the third month of development), but the addition of marketing and promotion is very needed and I would like to hear more from the proposer about this aspect in the proposal. The value would also significantly improve if they promoted it to people who were not into cryptocurrencies before, not just within the Indonesian Cardano community. The second concern is a bit minor; that is the problem of the small six-month runway for their article contributors. As we know, there is a lot of progress in the Cardano ecosystem in one year, so if the proposer only planned on supporting the contributors for six months, the site would get outdated pretty quickly. One of the viable approaches that doesn’t require any additional budget might be to spread out the number of articles from six months to twelve months or longer by making the content more compact.\n\nOverall, I agree with the solution offered in the proposal because the existence of a forum is actually unique, but I would also want the proposer to keep the above concerns in mind.", "q0r": 4, "q1": "I can’t entirely agree with the current proposed implementation plan because it lacks a bit of polish. I have to applaud the proposer initiative on providing their profiles, and based on their Github, I could verify that they are technically capable of developing a website on the current scale. The team is composed of a project manager, a back-end devops engineer, and a front-end mobile developer; this is a perfect three-team setup in small-medium software development. The total budget requested is 4350 USD and it is broken down into items. I advise the proposer to increase the 2000 USD allocation for website development because that amount might tempt them to restrain the server hosting user load capability if the manpower development cost isn’t enough. The 1150 USD allocated for Telegram admin and Zoom pro are hard to justify because, based on the current plan presented, there is no mention of Telegram group management and there are also no meetings or sessions held. The proposer allocated 1200USD for article contributions, but I can’t determine if that is enough because there are no details on how much the maximum articles would be contributed by the community nor the number of contributors onboard. I understand that those figures are not currently available, but it’s also hard for the community to decide if that amount is justified. My suggestion for this is to set a minimum and maximum approximate number of contributed articles and start calculating from there. Finally, the risk is not so much about obtaining hosting funding as it is about whether or not the website will serve its purpose. The proposer could have mentioned what if after six months the website's content is outdated, what if even after improving the site’s SEO it still doesn’t gain traction, etc. In conclusion, I don’t disagree with their plan because I truly believe the team is capable of pulling this off, but I do want improvements in the budget and risk mitigation section.", "q1r": 3, "q2": "The timeline for the three-month execution is already set; the website and its content will be completed in the first month, the discussion forum in the second, and SEO and article contributions in the third. We can track their development progress through the project’s Github and we can actually see their newly added features through their test domain. In the end, I think the currently provided information is enough to audit their work. One small thing: the proposer stated that in the third month they would measure monthly web visits and the number of articles, but it isn’t clear where we could publicly access those numbers. A simple solution is just to display it on the website directly.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10837, "q0": "This proposal is completely consistent with the challenge. A website to help connect people interested in technology in Indonesia with the Cardano ecosystem. We think that when this proposal succeeds will help many people know and participate in Cardano. The proposed person also saw the risks of the project. This creates more confidence in the success of the project. ", "q0r": 4, "q1": "The use of the money in the budget is also presented relatively well. However, it would be great if the author told us in detail the activities in each content required by the budget. The number of working hours of designers, admin? Which marketing method will be done? Similarly, the roadmap part left many desires. A 3 -month route was presented. We know the work will be done in 1 month. But, we do not know who will be responsible for writing and posting the content. How this content will be censored. Finally, about the team, we know their names, their roles, and their previous experiences through the links they have provided. ", "q1r": 3, "q2": "The proposal will be monitored through GitHub and it is interesting that the author creates an application to assess the development of web features. And some contents need to be clarified and more detailed about the content that will be posted on GitHub for the community to track. What KPI indicators will be measured? For example, the number of people who follow the website, the number of members, the number of posts, and the number of comments. In particular, how many people will come to Cardano through the website? I believe that the proposal will be more appreciated if it is more detailed about the issues stated. ", "q2r": 2, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you for the assessment, I really appreciate it for responding to the assessment from the auditability section, we are aware that it only includes auditability in general, because we have explained that to create a website like that requires a lot of money, because we still don't have the funds, while we create your own web testnet with our VPS for free, when the financing starts and our project proposal is financed we will fully document the development of the application project that we are developing through the listed Github and move it to a better premium hosting with a duration of hosting usage for 1 year. for the calculation itself you can see how many people subscribe to our website later and the number of subscribers on the telegram channel that we created with integration into the ADA blog website"}, {"id": 11006, "q0": "The proposal offers a solution for the Cardano community in Indonesia to be able to find reliable and contributing Cardano information on the web by creating a website to provide such contents. Such a problem statement and proposed solution has raised a big question if the proposer has actually been entangled with the Cardano community and has explored the ecosystem particularly in Indonesia.\n\nSimply by using Google search, people can look up the Cardano forum site which is available in Indonesian language as well as Emurgo Indonesia website. Most of the Cardano community in Indonesia already know that there is adakita.xyz, an informative website that was funded by previous Catalyst Fund. And then there is also the latest kitacardano.com, the website that was made by a bootstrapped Indonesian community.\n\nThe main challenge is how to provide good and reliable articles so that the readers will accept all articles as legit and trusted. In this respect, we have to understand that the proposed website, provided that this proposal gets funded, should not only be able to provide translated historical documentation but should also have the capability to publish any  translated information and upcoming news regarding the development of Cardano blockchain.\n\nFurthermore, the team has failed to identify the problem. We need to fully utilize these informative websites first before getting into the idea of creating another website to provide similar information and forum. Therefore, in my opinion, this proposal does not effectively address the challenge. \n", "q0r": 2, "q1": "The team does not convey any evidence to make this proposal feasible.\n\nFirst, the timeframe given to complete the project looks so complicated. Why does it take 3 months to build a website? If we take a look at the dummy website, it looks just like a simple blog site.\nThe team consists of 2 web developers without sound knowledge of the Cardano ecosystem and journalism as can be seen in the verifiable links given. In this respect, the budget outlines should prioritize recruiting content article writers.\n\nBuilding and hosting a web2 website nowadays is not as hard and expensive as it was 10 years ago. Having reliable articles regarding such new technology like Cardano blockchain and its latest updates in proper Indonesian language for content of the website will be the hardest part and will consume the most resources to get this proposal going.\n", "q1r": 2, "q2": "To be honest, I don't see any metrics that can be used to measure the success of this proposal. As mentioned on impact analysis, there are already several other websites offering the same type of information, thus the KPI should be how this proposed website will surpass the existing websites in terms of numbers of audience visiting and reading the site's articles.\n\nFinally, if this proposal gets funded, I would like to suggest for the website to provide permanent links to Cardano wallet download sites, so that the successful metrics can be monitored by how many of the site visitors are using the link to download the Cardano wallets.\n", "q2r": 2, "assessor": "z_assessor_3214", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you for the assessment, I really appreciate it for responding to the assessment from the auditability section, when this proposal project is financed you can track the progress in more detail via the github we linked, we will document everything through our github and will link the link for payments to new members who we will recruit for the development of this project\n\nCommunity Verified icon"}, {"id": 11786, "q0": "This proposal explain well the problem in the challenge and how to solve it. There are much potential since it will give a big impact in Indonesia Cardano ecosystem. With the Ada website, Indonesian will learn more about Ada in one web, with their own language and hoping to bring more awareness to the country.", "q0r": 5, "q1": "This proposal broke down the budget detail well, but the team is not clear. Who will work on the developer? The proposer or other new hired? And also, same as the other position, it need to be clearer. More over, this proposer need to elaborate it more detail, such as where the web be build in, is it template? what coding language they will use, how many article per month they’ll produce, how many hours worked to be done, etc. They have a website link the the proposal, but I’m not sure whether they’re going to used it since the last post is on November 2019. The proposer also lack of creadibility on his online presence. The linkedin is quite empty. It will be better to fill up the information.", "q1r": 4, "q2": "The proposal will utilise website as their community in Indonesia. It is a straight forward proposal that is easy to be done. The metric/ KPIs it clear from the GitHub repository to be tracked, only lacking the roadmap detail like the due date or start date of each proposal. ", "q2r": 4, "assessor": "z_assessor_3280", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13552, "q0": "This proposal address the challenge that Indonesians need more source of information related to Cardano. With this project, it will help to gain more people involve in Cardano Community especially to grow awareness towards Cardano in Indonesia. The plan to execute the project is there, but need detailed.", "q0r": 4, "q1": "\tIt seems like the proposer knows how to create a web. The only problem they face is they need funds to move the web that they already tested locally to paid hosting for releasing the web. The budget seems reasonable but needed to breakdown so that easy to audit furthurmore. Proposer also plan to colaborating with Indonesian Cardano community, which is good to enrich the topic that they plan to put it on the website. The timetable is also need to breakdown in detail, instead of crunch it all within a month. \n", "q1r": 4, "q2": "To track the progress of this project is easy. The proposer provide GitHub repository so that everyone can see the development of the features. But this proposal did not provide us with measurable KPIs which is a shame considering this project have a great potential. ", "q2r": 4, "assessor": "z_assessor_3688", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "On the ADA website, Indonesians and the Cardano community can view reliable information, have discussions on forums, and can write articles on our ADA website.", "experience": "Business & Development, Web Developer & Full Stack Developer, Eastern Hemisphere Town Hall Team Member, and Cardano Indonesia Community Member"}