{"id": 419938, "author": "vutuananh101190", "title": "Catalyst For Full-Time Speculators", "url": "https://cardano.ideascale.com/a/dtd/419938-48088", "category": 26602, "amount": 11484, "description": "A lot of speculators and freelancers they have a lot of time, but they don't know about Catalyst's Funding campaign and huge opportunities in technology platforms.", "f6_no_assessments": 17, "f6_rating": 4.705882352941177, "videos": [], "media": [], "f6_assessments": [{"id": 2094, "q0": "The proposal is not 100% suitable for the challenge as it is intended to introduce Cardano to speculators, and translators who are not aware of the Catalyst Funding campaign in Vietnam, and Vietnam is not exactly located in the region the geographic area we are targeting in this challenge. However, I think if we think about Asia in general and the need to bring the technologies of the Cardano ecosystem to different regions and people, I still think that it should be funded. The solution was to organize live sessions and create groups on social media platforms to exchange knowledge about Catalyst, penetrate speculative groups, and share them with risk-free opportunities risk across the Ecosystem. It can be seen that in recent funds, the number and quality of proposals from the Vietnamese community have increased and most of them are from familiar members. Expanding the Catalyst Sponsorship campaign will help more people know about the Cardano ecosystem, thereby increasing the number of members participating in the Catalyst community, and contributing to the development of our ecosystem. The target group of this proposal is also well defined which are talented investors with plenty of time, introduce them to Catalyst, assist with the Getting Started steps e.g. open a .ideascale account, permanent tutorials public consultation (PA), encourage participants to submit ideas in the Catalyst ecosystem, connecting them to online classes on Blockchain knowledge that the developer community in Vietnam is building there are some challenges The challenges and risks are listed and the proponent carefully lays out methods to address those risks, indicating a thorough preparation of the proponent for this project.", "q0r": 5, "q1": "The roadmap of the project is presented quite simply, which can be understood as divided into 2 phases. Phase 1 lasts for 1 month, this is a preparatory phase that includes tasks such as making a list of your target audience, sending invitations to their regular refreshment party, marketing on social media platforms their association, and starting a recurring meeting on the group. Phase 2 lasts from 2-8 months, this is the period to maintain and support members in participating in Catalyst. Overall, this is a pretty simple proposition, through the roadmap we can see what work will be done and thereby have a solid view of the process.\nNext is the budget, the proposal asks for $11,484 and is very well explained. We understand very clearly what the requested amount will be used for. And finally, about the project team, the person leading this project is Vu Quoc Tuan, and the group of 8 people he has guided to become a member of Catalyst. We are also described his experiences and relationship with Cardano and are also provided with his links such as telegrams and links to his development team this also strengthens our confidence in the team's ability to carry out the project.", "q1r": 5, "q2": "The testability of the proposal is very good, starting with the fact that we have a lot of detail about the process, what will have to be done, and the intended timeframe. With that, we know what to expect, and we can keep an eye on whether things don't go as planned. And this proposal provides us with KPIs that can easily be measured against what is done on the road map. The ability to check the project is also very transparent, the author will post the progress based on the social networking platforms such as Youtube, Telegram, and Facebook... this makes it easy for the community to follow the project judgment at any time. And finally, the success of the project is very clearly defined, in line with the original goal set out: attracting investors to invest within 50km, having many quality proposals submitted and developed on the ecosystem, and providing Catalyst with at least 5 specialized engineers. I think that based on all the information provided, this project is completely trackable in its progress, and deserves full marks.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "thank you very much"}, {"id": 11674, "q0": "The proposer has done well by outlining this key issues that effectively addresses the challenge.  There are many talented investors with so much entrepreneurial skills but adamant when it comes to cardano ecosystem and blockchain technology of which is the targeted group in this proposal.  Furthermore, if this group of targeted people are educated and awareness is created and the are onboarded onto the platform, it would be of great impact to the cardano ecosystem and blockchain technology as many wallets would be created, new PAs, vPAs ,voters etc would be onboarded if the project receives the required funding. Future challenges have been outlined and addressed by the proposer which makes it a no fail project if funded and implemented. ", "q0r": 5, "q1": "A plan has been derived by the proposer on how to achieve success and also be able to measure progress. Also a time line of 8months have been assigned to the plan in achieving  objectives  which is realistic and measurable.  A budget was provided and broken down into identifiable items needed for the project which is reasonable in achieving the goals of the proposal.  The proposer is an SPO, a member of the tiger view team specialising in oracle, 3 years of experience in blockchain research,  a member of the catalyst from fund4 and a community advisor from fund5. The above are relevant skills and experiences acquired by the proposer necessary for the proposal.  Furthermore team members are carefully selected with relevant skills and experiences as well to work on this project and make it a success.  With this relevant skills and experiences presented,  I believe the proposal will be successfully implemented. ", "q1r": 5, "q2": "The proposer has done a great job by outlining key metrics by which this proposal can measured interms of success and achievement. How success for this proposal would be if funded and implemented was outlined in that brilliant proposals would be submitted and many would be onboarded onto cardano ecosystem and blockchain technology instead of just being speculators. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 11394, "q0": "Catalyst innovation fund campaign  begins with the opportunity to receive  resources paid in ada from cardano treasury. Valuable resources to build, create and contribute to realise great ideas worthy of funding. A global community comes together to propose, evaluate, and ultimate decide which proposal submissions should be funded. Everything includes new decentralised finance applications to address  financial inclusions inequalities. Speculators and freelances have more time but due to less knowledge about catalyst funding campaign they don't know about the opportunities in the platform. Organising live sessions and creating groups on social media will increase the knowledge of catalyst. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The feasibility part has a detailed plan including list making of target audience , sending invitations to refreshment party, incorporating marketing on social media platforms and conducting regular meetings. Later face to face online meetings, providing catalyst for developers, submitting proposals to through membership. The budget breakdown is quite convincing and satisfying.The project team has a good experience and includes financial investor . Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress is tracked by recommending more members , developers to ecosystem, organising regular face to face online meetings. The project has talented investors to participate in development opportunities with catalyst ecosystem. The proposal has guaranteed appeal of cardano and generation of developers have practical experience  in business which turn into good projects to put practice in future. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 11300, "q0": "The proponent has a great idea regarding building a community and raising awareness among East Asians about Cardano. It addresses challenges by hosting live sessions and creating groups on social media platforms to exchange knowledge about Catalyst. Through this, they can share with the community the great opportunities in Catalyst's technology platform and Sponsorship campaign. The goal of the proponent is to introduce talented investors to Catalyst, guide account opening, community advisor (PA), and participate in submitting ideas. This is what people did well (directly supporting 8 PA members, vPA), and the proponent will do better in this project and will refer more people to Cardano. In online meetings, face-to-face meetings twice a week, the meeting time will take place for 3-4 hours, they will talk about the opportunities that Catalyst has, and explain all related questions. related to the Catalyst ecosystem. The group emphasized the risks and challenges when implementing the project. In my opinion, the most significant risk is that many people have not paid much attention to the introduction to Catalyst.\n", "q0r": 5, "q1": "The proponent provided a brief road map and milestones, as well as instructions on how to successfully execute the project. The plans are well executed. In the first month, the proponent makes a list of subjects, sends out invitations, and initiates online and face-to-face meetings. 2 months to 8 months the team will maintain members to attend regular face-to-face and online meetings, send elite members to advanced study, and start submitting ideas within 10. Budget divided. into hours, weeks, and months required to complete each milestone/task. I find the budget table very detailed, specific, and reasonable. In it, we have a complete look at how fund resources are used. The author is experienced in the community and has been a participant in previous challenges. To implement the mentioned project, the proponent combines with 8 members (PA, vPA) who have experience from previous Funds. Given the above factors, I find this proposal feasible and can be successfully implemented.\n", "q1r": 5, "q2": "The author indicates several KPIs that he intends to achieve as the project progresses. The community will measure the progress of the project through the increase in the number of core members, and the number of developers participating in the ecosystem. The above indicators can be measured through social networking platforms: Youtube, Telegram, and Facebook. The project's success matched the challenge. They attract all the talented investors to participate in the Catalyst ecosystem, have many quality proposals submitted, and grow in the ecosystem. The goal at the end of the project is to increase the number of people participating in the community to 1000 people, and at least 5 specialized engineers participate in Catalyst. These indicators will be displayed online, anyone can check them, so it is transparent, and clear.\n", "q2r": 4, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11150, "q0": "The project's main target audience is talented investors who not only have a lot of time but also experience in many different fields in Vietnam. The proposal aims to break down the barriers of motivated and entrepreneurial people by introducing and supporting them to Catalyst. Their investment ideas and experiences will be a great resource to promote Catalyst and the Cardano ecosystem. At the same time, the project will create a place to help connect members of the community. Face-to-face meeting is a great way to impart knowledge about the Cardano ecosystem and language platform Haskell / Plutus. The project promises to bring a lot of value to the Cardano ecosystem by providing a number of developers Proficient in the Haskell / Plutus language and a large number of developers to the ecosystem.", "q0r": 5, "q1": "In general, the proposer who will work on the project is a person with quite a bit of experience in the cryptocurrency space having joined and worked since 2019. Although the proposal did not provide information about the other 7 team members, they seem to have been working as PA, vPA. Therefore, in terms of the team's experience and capabilities, there's nothing to worry about. It is great that the proponent provided a detailed plan as well as a detailed budget breakdown. However, it is safer to raise the reserve fund level to 7-8% because the cryptocurrency market is a highly volatile market and the native token ADA is no exception. If the team plans to put this money into the proposal fund for the development of the Scaling proposal later, it will not be a problem to raise the reserve level. The proposed team also predicted many different risks, but the most commendable thing is that the team has their own specific solutions to deal those risks.", "q1r": 4, "q2": "The goals and KPIs will be measured, tracked. All the metrics will be reported and communicated to the community. Furthermore, Monthly Catalyst will be posted on the social networking platforms such as Youtube, Telegram, Facebook which are belong to the team. The proposed team makes it easy for everyone to track and verify the project. From my point of view, this project is very transparent, especially the audit aspect.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10507, "q0": " - When it comes to Cardano, we all know that Cardano is developing very well, not only in the country but also reaching out to the world. The successes they bring have been recognized and created a strong foothold in the market today. I believe that with the current development Cardano will continue to grow. However, at present, the knowledge about Cardano is endless, there are many speculators who still do not understand and are having difficulty when there is no one to guide, exchange knowledge and experience about Cardano. With a Catalyst idea for full-time speculators proposed by the topic, I find this to be a very cool and refreshing idea.\n\n    - The problem that the proposed topic raised was very clearly defined that is. There are a lot of speculators and freelancers they have a lot of time, but they don't know about the Catalyst Funding campaign and the huge opportunities in the tech platform. I found the problem the topic raised to be a great fit for the challenge. If the proposal is successful, it is possible to scale up the globalization to help uninformed communities passionate about learning and exchanging knowledge and experiences about the Cardano ecosystem.\n\n   - Here the solutions proposed by the topic are very specific to solve that problem. We will create communities on the most popular social networking platforms, such as Telegram, Youtube, Facebook to discuss and have regular meetings every Monday night organized by us. At the same time, we also organize face-to-face meetings at cafes, to discuss and plan and support each other to find ideas and collaborate on writing ideas. In addition, we will send 2 elite members to focus on learning Haskell / Plutus language, after they complete the course will bring the knowledge back and we will start to come up with in-depth ideas on Protocols and Coherence. smart co. I find the solutions proposed by the topic perfectly suitable to solve the problems of the challenge.\n\n    - Besides, the proposed topic has also foreseen 4 main risks that may be encountered, such as: Not much interest in our introduction to Catalyst ecosystem, Not confident in Catalyst reward mechanism yet, Documentation for technical and academic related development. Finally, the price of ADA may drop suddenly leading to a budget shortfall for the implementation of the proposal. However, I see that the proposed topic also outlines options to deal with those risks in a reasonable way. Hereby I feel very satisfied with the presentation of this proposal.", "q0r": 5, "q1": "\"  - With section providing a detailed plan, including progress and milestones. The proposed topic outlined specific milestones to complete all work within a period of 8 months. In my opinion, the timelines outlined in such a proposal are very reasonable to complete all the proposed work. Thereby, the goals have also been fully outlined by the group for each stage of the plan implementation.\n\n   - In the section provide detailed budget breakdown. With a total budget of $11,484 and has been broken down into 4 different expenses. In my opinion, such broken costs are completely reasonable. Most importantly, the team came up with a backup plan for the sudden price drop of ADA. I find that to be very good.\n\n    - With a section that provides detailed information about the people who will work on the project. I see the team that raised the topic is also the founder of the concept team for Cardano and with it there will be an 8 member team that has been linked and co-developed with the proposed theme. By finding out the members have been assigned, specific jobs for each person. The members are all experienced and capable quite well. The identity of the members is easily verified by the links so that the community can check and track.\"", "q1r": 5, "q2": "\"   - In the description of what you will measure to track project progress. The proposed topic has outlined 5 KPIs, the indicators are detailed and complete as presented in the project. I see the indicators are highly transparent, will be posted on social networking platforms such as Youtube, Telegram, Facebook for the community to easily measure and monitor.\n\n    - Besides, the success of the project has been described very clearly with many successes that are. Attracting all talented investors around a radius of 50km to participate in development opportunities with the ecosystem. In the Catalyst ecosystem, there will be a lot of quality proposals submitted and developed on the ecosystem with a number of participants up to 1000 people. The ultimate success is to provide Catalyst with at least 5 specialized engineers. I found the successes the team cited to be closely related to the challenge.\n   \n    - Regarding funding, because this is a new proposal, it has not been funded yet. However, I find this to be a very good and meaningful project for those new to PA like me who do not have much knowledge, but with a passion for technology, they can exchange and learn knowledge and experience. about the Cardano ecosystem. I highly appreciate this proposal, hope it will soon be approved and funded in this Fund. Wish the team's project more success than expected.''\n  ", "q2r": 5, "assessor": "z_assessor_3188", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 10145, "q0": " As the community knows Cardano is growing stronger and stronger. But along with it is a lack of information channels and teachers to guide people in the right direction. Specifically, here the idea team is trying to assemble an elite team to help speculators and investors navigate the way, beyond buying and selling ADA. Guide investors like us, who are having a lot of difficulty in integrating and catching up with the trends, Cardano ecosystem and the right path to sustainable development with. So the \"catalyst for full-time speculators\" is a panacea for this problem.\n\n    The solution you mentioned in the project will create communities on major social networking sites, such as Telegram, Youtube and Facebook. Members will be active on specific days, with weekly live discussions. To help members answer questions they are facing. Another thing I like about you guys is sending 2 elite members to focus on learning Haskell / Plutus languages, helping to bring the knowledge of the big team to develop together. The project is really interesting and I hope you soon complete the idea and achieve good results for the community.\n\n  In addition, the team also raised the risks that the proposal may face, which are: Maybe the community has not paid much attention to the group's recommendation, has joined but does not yet believe in Catalyst's reward mechanism. . and ADA Price may drop suddenly leading to a budget shortfall. But this was well resolved by the team. To reasonably reduce risk as stated in the proposal.", "q0r": 5, "q1": "  The proposal team provides a full eight-month roadmap of the proposed steps, within two specific timeframes. The team also provides access links to contact the proposed team leader via Gmail, telegram, and Facebook in a full way. But if suggested by the group, add the links of the remaining eight members to help the community identify them transparently.\n\n  Also a detailed budget breakdown of the idea. With a budget of $11,484 and subdivided by the team into various items such as the cost of the presenter, plus the cost of weekly and monthly meetings, the cost of two members going to an advanced school, and a contingency budget. I find the split budget above to be very reasonable. It can be said that the proposed topic has carefully calculated these items. Good thing, and good luck to you.", "q1r": 4, "q2": "The proponent provided adequate indicators of the future group membership of 30, and two members attended school to help bring knowledge to the team. With the proposed team indicators confirm there are step-by-step announcements via social media platforms and the team's transparent statement. I appreciate the idea group's transparent commitments. This will help a lot in tracking the proposal's progress.\n  If this proposal is successful, it will aim to fulfil the target in the area of ​​changing people's views around the catalyst ecosystem. The idea will be to bring developers voluntarily to the community. Help the catalyst come up with better ideas. Don't focus too much on their speculation. And wish the team soon complete a good idea.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11803, "q0": "I found the Catalyst For Full-Time Speculators proposal to align well with the Grow East Asia challenge, Grow Cardano. The proposal team intends to address the issue of introducing Catalyst's funding campaign and huge opportunities in the technology platform to speculators and freelancers. These people mostly have a lot of time but without knowing about these funding campaigns, they have inadvertently missed many opportunities in the very large cryptocurrency market. Once they have more access to Catalyst's sponsorship campaigns, it will help develop the Cardano ecosystem in our community in Vietnam in particular and in East Asia in general.\nI find this proposal very interesting in that it goes to the heart of the matter, directly introducing the community to Catalyst's sponsorship campaigns to give them the opportunity to step-by-step access to and learn new knowledge that they never knew existed. Myself as an example, I have been in the crypto market for more than 2 years but it was not until this fund 9, through a friend's recommendation, that I found out about Catalyst's funding campaign and joined as a member. As a PA, I really regret that I missed the previous 8 funds as well as lost many other opportunities in this campaign. And I also know that, in my Vietnam, the current situation is not only for me but also a lot of people who are participating in the crypto market but most of them don't know about Catalyst's sponsorship campaigns. So, I completely agree with the argument of the team that proposes to come up with solutions that aim to break down the barriers of motivated and entrepreneurial people, bring them into the ecosystem, introduce and help them have a right view of Catalyst, reach out to other issues of interest such as opening .ideascale accounts, guiding community advisors (PA), encouraging participants to submit ideas in the ecosystem Catalyst, connecting them to online classes on Blockchain knowledge that the developer community in Vietnam is building, not merely speculation, buying and selling repeated in the market.\nI completely agree with the author's way of posing the problem, so I give the impact of this proposal 4 points. This score for me is completely reasonable because this proposal is suitable for the challenge, but I consider it not really excellent to achieve a perfect score.", "q0r": 4, "q1": "The author group has outlined a specific timetable of 8 months to implement this proposal, I have seen the progress of the important milestones of the proposal on a weekly and monthly basis along with the implementation content specific implementation of each content. I see the detailed and reasonable calculation of the members in this proposal when the team has come up with a plan with complete data.\nRegarding the project budget of $ 11484, accounting for 4.5% of the total budget of the challenge is completely reasonable for the project implementation within 8 months. The amount is broken down for a detailed, complete explanation, this division is completely reasonable and I find it appropriate for each given category.\nThe team has pointed out 4 foreseeable risks and the solutions offered to address these risks are that many people have not paid much attention to the author's introduction to the Catalyst ecosystem, Not yet confident in Catalyst's reward mechanism, documentation for technical and academically relevant development and price of ADA may drop suddenly resulting in a budget shortfall for the implementation of the proposal. I find these risks have been fully anticipated by the author group, the solutions given are appropriate to help increase the success rate of the project more.\nThe main person in charge of this project is Vu Quoc Tuan, I know Tuan as a veteran member of the Tiger view community, a prestigious community in Vietnam that specializes in Oracle and introduces Catalyst campaigns to everyone. I have gained a lot of knowledge about funds from the clips shared by the Tiger view community on youtube and telegram, this information has helped me a lot when I participated as a PA at this fund 9. I see that Tuan is a person capable of implementing this proposal with his experience, qualifications and the help of the teams that Tuan is participating in. The proposal provides additional links to Telegram, Youtube so that the community can be completely verifiable.\nI will give this proposal a score of 5 for feasibility, which is a perfect score because I think it meets the requirements of the challenge well.", "q1r": 5, "q2": "For this project, I fully believe that the community can monitor the progress and success of the project continuously and closely based on the plan and budget presented fully through the project 2 parts I have evaluated.\nKPI has also been given by the team to measure the success of the project with 5 specific evaluation criteria on the content such as the increase in the number of 30 core members, and 2 excellent students performing the learning process advanced knowledge and applying them to the upcoming proposal, the number of developers bringing to the ecosystem, statistics public reporting to the community, scheduled in-person and online meetings frequent. In my opinion, all of the above indicators need more specific data as a reference for evaluating the success of the project in the future.\nThe success of the project will reap a lot of results when attracting talented investors to the project, there are many quality proposals to help the ecosystem grow, the number of people involved when this project ends up being 1000 people, providing Catalyst with at least 5 specialized engineers. I find this metric to be quite reasonable and if the project is funded, I trust the team to be qualified to grow the community to function at its best even at the end of this project.\nThis is a completely new and unfunded project, the community can fully track the team's project through monthly progress updates on the team's social platforms, and commitment is transparent to the project monitoring community through the links provided by the team in the proposal.\nI will give the transparency of this proposal 4 points because -1 point is needed to add information about specific reference indicators for the KPI section of the project.", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9408, "q0": "The proposer realizes that many speculators and freelancers have free time don't know about Catalyst's Funding campaign and huge opportunities in technology platforms. Therefore, the proposer organizes live sessions and creates groups on social media platforms to exchange knowledge about Catalyst, penetrate speculative groups, share them with risk-free opportunities across the Ecosystem. The target group will be talented investors with a lot of time. The author would introduce them to Catalyst, support the Initial steps eg: opening an Ideascale account, guiding the community advisor (PA) , encourage Participants to submit ideas in the Catalyst ecosystem, connecting them to online classes on Blockchain knowledge that the developer community in Vietnam is building. These activities help Cardano value increase a lot and the Cardano brand is more widely known in the Vietnamese community. This model could be broaden in scale. Generally, the project addresses effectively the challenge and have appropriate target to fulfil the requirement. I give mark 5 for this criteria.", "q0r": 5, "q1": "The budget is divided into detail costs, including costs for presenter, meetings, refreshment, elating members to study full time, contingency. The total estimated cost is 11,484 USD. Generally, this budget is described clearly and logically. Furthermore, the skill and experience of the team is proper to run this project. He is the founder of the idea team for Cardano, a financial investor, working with Crypto space Since 2019. He led consulting for the community of 8 people into PA, vPA. Thus, I believe the author could be competent for this project. Regarding the challenges, the author mentions 4 main risk he may face out. First, the target group may not pay much attention to introduction to the Catalyst ecosystem. Second, the target group do not trust Catalyst's reward mechanism. Third, the matter of material for technical and academic related development. Fourth, the price of ADA may drop suddenly leading to a budget shortfall for the implementation of the Proposal. The author has given out comprehensive solutions to all the above matters. In conclusion, I agree with the proposer's idea and give mark 5 for evaluation this criteria.", "q1r": 5, "q2": "This project is expected to last in 8 months. The first month is for warm-up activities (listing target member to invite to the meeting, marketing, maintaining regular online meeting every Monday night, holding a face-to-face meeting twice a week on Thursday and Saturday). For the last months, the author would maintain regular face-to-face and online meetings, send 2 elating members to participate in advanced online courses, within 3 months Learning and practicing fluently the programming language. I expect to learn more about how he choose the two elating members, basing on which criteria and after how many months for choosing them. The KPIs for evaluation includes providing Catalyst with at least 5 specialized engineers, a lot of quality proposals submitted and developed on the ecosystem, getting all the talented investors around 50km radius to participate in the Development opportunities with Catalyst ecosystem. As for me, the second and third KPIs are rather vague. The proposer could easily calculate and give out the specific number for these KPIs, so that the supervisors could follow the progress and success easily. Generally, the proposal is clear and the problem solving is easy to understand. I evaluate mark 4 for this criteria.", "q2r": 4, "assessor": "z_assessor_3052", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 8908, "q0": "We have seen lot of investors in stocks or even ADA who just by and sell tokens without knowing importance of it ,or even what these tokenization are meant for , this is one of the biggest reason why there is instability in ADA prices, Hence to overcome this the proposer's want to teach these youngsters on how project catalyst actually works and how they can participate in these events and grow economically and even they'll come to how to make use of these tokens and gain the atmost  profit out of it, Hence by making this the cardano society can get bigger and better , Therefore, this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The mentioned task easy to achieve where it needs to find speculators and freelancers who are idol ,and help them in learning and contributing towards cardano development project by attending workshops  , The proposer has  3 years of experience in Blockchain Research, and he has been member of Catalyst from fund 4, and worked as community advisor from fund 5.\nWith such experience provided conducting workshops over virtual meeting and explaining the importance of block chain is definitely achievable , hence with minimal risk involved and given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit should have involved how proposer wants to keep the students engaged upto 8 months of training ,since students usually tend to loose interest over the topic after several time, Excluding that the proposer has given proposed solution in very detailed manner which involves how the mentioned task can counter the social and economical problems that society is facing today, The audit contains clear picture on timeline of the project, the audit even contains decent budget breaking idea, Hence with mentioned task simple and easy to achieve which involves minimal risk involved in it, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 8444, "q0": "\"I'm so glad to have found such a great idea for a long time. The idea is like speaking to the hearts of PA or vPA people like us. The recent epidemic situation has had great consequences for the whole world. In the world in general and Vietnam in particular, many people are unemployed but have previous capital to invest, full-time they are self-employed, they have been looking for jobs but with unsatisfactory income or working environment. inappropriate work or nursing mothers who can't return to work after giving birth, if your project is funded and released to the Cardano community or disseminated in your locality and surrounding areas I am sure that it will attract a significant number of participants.The idea is completely suitable for the challenge posed.\n   The solution you describe is very realistic about the current situation of investors who do not understand deeply about the Cardano ecosystem community, most of them are just making transactions of investment channels to make a profit. Your desire to give them the implication that you want to help them not only with an investment but also for them to prove themselves making money through PA/vPA with their own knowledge learning about the Cardano Blockchain and Catalyst funding policies. Solving the solution is clearly presented in terms of goals and implementation plan, collaborating with team members as well as the advisory board to give those who do not know the opportunities to develop themselves as well as is a profession to earn extra income that simply uses the intelligence of the brain and a computer.\n    The idea that this is a new technology that has not been fully developed throughout Vietnam as well as the whole world, so it is understandable that the understanding is not much, people are still confused that it is What software? how to start? If you can do it, what will you get? whether it takes time and brains to be rewarded? This project is to explain to all those who do not understand how, you have solved those risks. It's smart to position yourself as a newbie to Catalyst, Cardano to tell us.\"", "q0r": 5, "q1": "\" we can start a feasibility analysis taking into account a favorable data for this project. As we see this is an ideal project for users to discover and also bring in significant income if like doing well, because the idea is inherently less complicated to convince people to join it.In fact, the general details of the actions taken are very detailed and describe well what needs to be done to get it done. Even in terms of budget details, we can see that the cost to the organization, creating opportunities for elite members to take a valuable course not only adds to their own knowledge. knowledge even uses them to guide others to participate, face-to-face meetings are very suitable. The time arrangement for the plan of Activity Ideas is not too long to implement them, The arrangement of each milestone and the work as well as the predetermined goals is also very orderly.\n   Concerning the experts involved in the proposal, all appear to be qualified and able to do the job, a positive also being the previous success in raising funds for the project in stages. earlier, increasing the credibility of the experts currently involved.\"", "q1r": 5, "q2": "The project's goals are also easily measurable through the given metrics. Ways to track the project are also described in detail. very pleased with the way the progress of the activities was tracked as well as the clear quantitative parameters that were introduced to measure the performance. Success Much more confidence because of the size of the number of participants up to about 1000 People, attractive policies create a significant source of attraction bringing unique ideas to turn them into good projects to apply to implementation in the distant future. Thank you for your ideas, hope to see good results in this funding round.", "q2r": 5, "assessor": "z_assessor_2984", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 7019, "q0": "\"    - As we all know the Cardano ecosystem today is being developed very strongly, the strides that Cardano has brought have been recorded specifically, just one more epoch before Cardano can be completely decentralized. although I know the benefits of Cardano are great, but the knowledge in Cardano is huge without the community of no instructors making it very difficult for investors like us to get along. Import and catch up with the trend, the Cardano ecosystem. with the idea Catalyst for full-time speculators. I think this is a very good proposition. will help me and many others connect together into a community to exchange and learn experiences.\n\n    - Here the proposed topic has raised the issues that are. there are a lot of speculators and freelancers they have a lot of time, they have passion and enthusiasm in investing and making money, but maybe not understanding all the problems makes them easy to encounter great risks. I think introducing them to the benefits of Catalyst will get them on the right track. I find the problems raised by the topic very suitable for the challenge, and especially suitable for those who do not have much knowledge like us.\n\n    - To solve the problems mentioned above, the proposed topic has given the solution to that problem. By the group will create communities on major social networking sites, such as Telegram, Youtube, Facebook The group will work together by holding weekly coffee shop meetings to exchange ideas. consciousness I have. In the group there have been many members who have joined the Catalyst for a long time who will be responsible for guiding the newcomers. In addition, the team sent two members to attend intensive classes and smart contract protocols. The aim is to guide the community with a lot of useful and in-depth knowledge. I found the solutions that the group proposed to be very reasonable, it is suitable to solve the difficulties in the challenge.\n\n   - Besides, the group also raised the risks that the proposal may face. maybe the community has not paid much attention to the group's referrals, and has joined but not yet trusting Catalyst's reward mechanism. and ADA Price may drop suddenly leading to budget shortfall. However, the group has come up with methods to reduce those risks in a very reasonable way as outlined in the proposal. And I have no further comments.\"", "q0r": 5, "q1": "  - With presentation on providing a detailed plan, including progress and milestones. I see the proposal team has identified a specific timeline. That will complete the plan in a period of 8 months. Has been divided into two phases to complete. I think the above timeline is completely reasonable to complete the tasks set out. Already have specific goals like Make a list of 30 target audiences. Start sending two members to advanced study. And there will be at least six proposals submitted to round 10. I find the progress of the project has been outlined very specific and complete.\n\n  - In the section provide detailed budget breakdown of the proposal. It has a budget of $11,484 and has been broken down into various sub-categories such as speaker fees, costs for weekly and monthly meetings, expenses for two members going to advanced school, and budget. backup book. I find the split budget above to be very reasonable. It can be said that the proposed topic has carefully calculated these items.\n\n   - About providing detailed information about the people who will work on the project. I found the proposed topic raised to a very large group of members. One of them is the founder. play a key role in this proposal. Through research, I found that the experience and working capacity of this member is very good. Members' identities are also easily verified by links to personal pages.", "q1r": 5, "q2": "  - In the description of what you will measure to track your project progress. I see the group has raised a lot of indicators. Among them are key indicators such as the number of members that will increase, the number of developers bringing to the ecosystem. All statistics will be declared transparently. I find the stats mentioned to be enough and I don't need to add any more.\n\n   - What does a successful presentation of this project look like? Here I see a few successes mentioned including the main ones like attracting all the talented investors within a 50km radius, there will be a lot of quality proposals submitted and developed. develop on the ecosystem, there will be at least 1000 people participating in the community, will provide at least 5 specialized engineers for the ecosystem. I see the above successes as closely related to the challenge. These successes have also contributed greatly to the development of the Cardano ecosystem.\n\n   - Regarding funding. This is a new proposal and has not yet been funded. However, as a direct evaluation PA for this publication, I find this proposal very good, bringing great humanitarian significance to the community, bringing useful knowledge to those who do not have much knowledge. like us and many others. I hope the community supports this proposal To make the proposal successful.", "q2r": 5, "assessor": "z_assessor_2856", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 5018, "q0": "The proposer wants to bring speculative traders and freelancers from Vietnam into the Catalyst ecosystem. This is done through regular virtual and in-person meetings. In these meetings, members are educated and onboarded into the Catalyst community as Proposers, PA, vPAs, and even programmers. There already seems to be tight-knit community formed around these meets. Two of the ‘elite’ members will be funded to develop their Haskel programming skills in three months time. It’s slightly unclear as to what elite means. Seniority was mentioned as consideration for being an elite member, but learning Haskel for a beginner would be a mountain of a task. Another important factor to truly scale this project would be to train some of the members to be community leaders and head meetings of their own. Currently, it seems that there is only one leader that runs the group and the rest support him. This proposal is quite impactful since there is a personalized onboarding process for the members and building strong community networks. The proposal would have been rated five stars if not for the scaling issue.\n", "q0r": 4, "q1": "The team is targeting a total of 30 audiences. They will be reaching out through email and social media posts. These meetings happen thrice every week, one online meeting and two in=person meetings. The duration of these meetings is four hours each and they continue these meetings for about eight months. The budget requested seems to be reasonable for such a huge time commitment. One of the issues is that targeting exactly 30 members will usually result in less than 30 members showing up. My suggestion is to target a larger number.  The community leader is a Stake pool operator and is technologically well versed. I believe this team is capable of seeing this proposal through. Based on the above rationale the rating has been awarded.", "q1r": 4, "q2": "The auditability of the proposal is based on the number of core team members that join through the meetings, two students being up-skilled into Haskel programming, the number of developers onboarded into the catalyst ecosystem, and lastly proof of meetings. Although these numbers can be provided to the community, it’d be best to have a metric that shows the proof of these numbers. For example, sharing the certification of the up-skilled students to the community, sharing video recordings of all the meetings, the number of proposals created by the meeting group members, etc.\n", "q2r": 4, "assessor": "z_assessor_2663", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4759, "q0": "I really love this idea and I think it fits the campaign challenge. The project owner has raised the problem to be solved, identified the goals to do, this is very beneficial for the growing Vietnamese community, knowing about the Catalyst ecosystem. therefore this proposal can scale to address future challenges. Talking about the solution description for the project, the project owner gave the initial steps of what to do, such as, open an account, guide the community, connect them to online classes on Blockchain knowledge, solutions will solve the problem of the challenge, by the project theme has created a community on the most popular social platforms such as youtube Telegram, facebook.as well as created face-to-face meetings to community cohesion and understanding more about knowledge , with the commitment of the proposed group I believe in what the project presented when it received the funding . The proposal has shown potential risks , and detailed solutions for each part have been proposed . In my personal opinion, in reality, jobs and income opportunities are certainly very promising, in the future the community knows more about the Catalyst ecosystem. that is definitely a top goal for me to learn . Good luck with the project!", "q0r": 5, "q1": "the feasibility of this proposal is very good , the proposal has identified the milestones . At the beginning of the proposal, we know exactly what activities will be launched each month, this way the community can see the project is safely built and develop on the right track what it needs. do . Specific goals and reasonable timelines for getting the job done . In my opinion the only point that could be better would be to break down the February to August period to know more specifically eg March, April, what activities will take place? How long does it take to complete the job? And who will do the maintenance work? however the presentation providing more details would be incremental but i find the scenario the project owner gave to be very good . Talking about the project budget, the project requires an amount of $ 11484 through the detailed budget table, it is found that with the required amount, the project owner has divided into clear items, thereby knowing the number of uses. money that the project owner actually spends. The proposal also has very detailed explanations, for example, the cost of the presenter is 15$ per hour per person, the meetings will last 4 hours, there will be 2 face-to-face meetings per week. What's even more amazing is that the team came up with a backup plan for a proposal that I've seen very few come up with. lastly talking about the team i found that the mentioned project topic was mentioned by the founder, their related experience .so this part the team has created confidence and is ready to carry out this project successfully with my personal opinion evaluate the feasibility of this project great .thank you", "q1r": 5, "q2": "This proposal identified a number of ways that the development process measures well, including an increase in the number of members requested by the 30 core members, the number of developers coming to the ecosystem, all of which These statistics will be reported to the community, holding regularly scheduled face-to-face and online meetings. this way we have information available on the progress of each phase so that we can Full tracking of the project's development progress. in fact no criticism is given here , the proposed team has come up with a monthly catalyst , which will be posted on social networking platforms such as youtube ,telegram , facebook committed to transparency for monitoring community through which we can verify everything that has been done in this project. the success of the project was described the results achieved , explained what opportunity to develop the targeted ecosystem , that is the specific target outcome of the team , attracting talented investors , When the project reaches 1000 people, the budget will be exhausted for this project. with this we have enough data to track if the project achieves its goals , implementing the possibility of a successful scenario . This is a brand new project so the community evaluates the possible funding proposal in detail, so that the perfect proposal can be put into practice soon, I trust this project with what it has come up with. . wish success .", "q2r": 5, "assessor": "z_assessor_2615", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4398, "q0": "As soon as I read the proposal, I saw the potential of this idea. If done well, it will mobilize a huge human resource from the community to develop the Cardano blockchain. Thus, does the proposal solve the goal set out in the Challenge \"Grow East Asia, Grow Cardano\"? The author has identified the problem of how to let speculators and freelancers know about Catalyst's funding campaign and the great opportunities in the technology platform. These people can have a lot of time, if they spend their spare time focusing on developing the Cardano ecosystem (including Catalyst) it will have a huge impact on East Asia and the entire Cardano ecosystem. These effects are direct and rapid. This is very beneficial for the development of the region, and can completely scale up and solve challenges in the future. I understand the success of your proposal is measured by your actions. It is using social media platforms to exchange knowledge about Catalyst, penetrate speculative groups, and share with them opportunities across the ecosystem. This proposal, this action is not new, I have encountered many other cases and I must admit it works very well to spread Cardano, Catalyst to everyone.\n", "q0r": 5, "q1": "5 stars. The author of the proposal elaborates on his own experience with work closely related to Cardano and Catalyst. These experiences are really valuable so that the author can boldly write a proposal, when I read the proposal, I can see the author's enthusiasm. The proposal clearly states that implementing members include the author and several other collaborators. It seems that this team has been working together for a long time (probably working together online because of geographical distance). In the proposal, you have included all relevant documents and videos about yourself and the team working with the public social network. I appreciate the feasibility and believe in the team members. I highly encourage you to do this especially to make the identities of all members public, because the more public the identities, the more visible the number of group members, and the more trust the community has. so much into the team. I read the budget analysis in quite a detail and was convinced by its meticulousness and specificity. Through this, I see that when you are trying to build a small group of people who are mainly investors, entrepreneurs have free time to campaign and pass on conceptual knowledge related to the Cardano blockchain and Catalyst. With a specific implementation plan, I believe the feasibility of this proposal will be appreciated and appreciated by the community. In terms of engineering and technology, I'm glad you applied 100% of the knowledge of the Cardano and Catalyst ecosystems (with self-research and learning from IOG, Charles Hoskinson, from Vietnam's Fimi group) to apply to your work (you spend all of your working time digging into Cardano, Catalyst). Along with that is the effort to bring knowledge to the community (friends who are entrepreneurs, and speculators near you with a geographical radius of 50km). I very much welcome these efforts. However, I have a question about the resources required to implement, and specifically the manpower. To introduce knowledge about the Cardano ecosystem to the community, besides you, is there any other member who will join you in doing this (organize and directly present at coffee dust meetings in Hai Duong city? )? My advice is to find and select readers who can organize knowledge sessions with you. Doing so will ensure feasibility (proposals are guaranteed to always be implemented), and reduce your workload. As for the risks and challenges of implementing the proposal, you have listed quite accurately the foreseeable risks, I completely agree with this. I particularly welcome the solution you have suggested, it seems satisfactory and hopefully will effectively limit the risks. I would like to ask more that you have a way to attract entrepreneurs, and investors to participate in the Cardano ecosystem strongly and regularly? Because I know the reality that many Vietnamese people have language barriers (English). Anyway, I find this to be a good, necessary idea, that will come to life. I rate 4 stars for the feasibility of the proposal. Because of this proposal, there are a few points that I feel need to be added as mentioned above.", "q1r": 5, "q2": "This is your first recommendation on Catalyst. I admire that with just the first time you join, you can write a proposal with all the elements of impact, feasibility, and auditability. In terms of audit, when implementing the proposal, although the roadmap and implementation milestones are not clearly stated, I can still see the clarity of the work in chronological order. I have a suggestion: If possible, write a clear roadmap for how to do the work to increase the transparency and auditability of the proposal. Perhaps the community will support your proposal if the transparency and accounting are clearer. Accompanied by that is the KPI to evaluate the performance of the job. Maybe some others will think that, when applied in practice, this proposal does not need to use KPIs, but I still think that the presence of KPIs will increase a lot of audit calculations, and help easily evaluate work performance. For the rest, you've done a great job of describing the problem and offering a solution. What I love about this proposal is that even for the smallest of risks, you have the right solution to solve it. Good luck with your first Catalyst proposal.\n", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9117, "q0": "The proposal will host live sessions and create groups on social media platforms to exchange knowledge about Catalyst. Target audience will be speculators and investors from other financial channels such as gold, stocks and real estate. They are people who have a lot of time, but most do not know anything about Catalyst's funding programs, do not understand anything about technology and projects. The project will introduce them to Catalyst, guide them, encourage them to do PAs, generate ideas in the Catalyst ecosystem, connect them to online classes on Blockchain knowledge that the developer community at Vietnam is under construction. The project will create communities on the most popular social networking platforms, such as Telegram, Youtube, Facebook to discuss and hold periodic meetings every Monday night to interact and help answer questions. In addition, they also hold face-to-face meetings at cafes to exchange, support, find ideas together and collaborate on writing ideas. They will also send 2 elite members to focus on learning Haskell/Plutus languages, then these 2 will give in-depth ideas on Protocols and Smart Contracts. As such, the Project will provide a number of Haskell/Plutus Proficient developers and a large number of developers to the ecosystem. I find the project to fit challege's goals.\n\tThe proposal also introduces a number of risks that may be encountered such as the target group's lack of interest in Catalyst, lack of confidence in Catalyst's reward mechanism, sudden drop in ADA price leading to budget shortfall... and they also come up with solutions to minimize it.\n", "q0r": 4, "q1": "The project is expected to be implemented in 8 months, with specific work for each phase such as: the first month of making a target audience list, sending invitations, marketing on social media platforms, regular online meetings, face-to-face meeting twice a week; From the 2nd to the 8th month, we will maintain face-to-face and online meetings, send 2 elite members to participate in an online advanced course... The project has a clear and specific roadmap so it can be implemented easily.\n\nThe proposal requires a budget of $11,484, of which the cost of the presenter is $3,840, the cost of the face-to-face meeting is $6,144, the bonus for 2 elite members is $1,000, and the ADA rebate provision is $500. I find the cost quite reasonable.\n\nThe main personnel of the project is Vu Quoc Tuan, the founder of the idea team for Cardano, working with the crypto space since 2019, a financial investor, a PA, vPA leader for the community. copper. He will collaborate with the group Excellent CA consisting of 8 people. It is proposed that the names, qualifications and experience of these 8 people be given to the community to assess whether they are suitable for the requirements of the project.\n", "q1r": 4, "q2": "The project offers several criteria to measure progress such as: Number of members, number of developers, 2 excellent students, holding regular scheduled face-to-face and online meetings. These figures they will report to the community. Meetings will be posted on our social networking platforms such as Youtube, Telegram, Facebook so the community can monitor.", "q2r": 4, "assessor": "z_assessor_3021", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 12634, "q0": "Yes the proposal fits the challenge setting, the target audience of the project are investors in Vietnam - a potential country for blockchain because the money flow from there into the coin market is very large, but most Most investors in this country are not interested in the potential of technology that it brings, they trade ignorantly just for the purpose of making quick profits. Those who really spend time in research and want to develop can't access this field.\nI think the audience of this project is not only investors in gold, stocks or real estate, but also young people like students, because Vietnamese students are very active, hard-working, passionating of learning and research, especially the bargains from Catalyst make them become an extremely potential community.\nI think the solution proposed by the proposer to solve the problem of the Catalyst introduction not having enough attraction is not the best solution because the community will grow stronger and then inviting each audience will be difficult. In my opinion, you should only apply this method at first and then focus on increasing interaction in the community.\nI have surveyed and found the prestige of Mr. Do Manh Hung's FIMI community and the TIGER View community mentioned by you, these two communities are always ready to provide enthusiastic materials and guidance for newbies.\nFinally, I very much welcome this potential project, if successful, it will attract a series of talented people to approach and build Cardano.\n", "q0r": 5, "q1": "The amount requested and the hours provided were reasonable to carry out the project as described. As for the schedule, the 2 face-to-face meetings on Thursday and Saturday are not entirely reasonable because most of the people who come to Catalyst have their own jobs and only consider PA as a side job, the meeting is on Thursday for some people it will be difficult to attend.\nThe information of the group members is still not specific and clear. I would recommend the proposer should add additional and organized versions of the 8 person group information and their experience in any related field.\nI have no further comment on this part of the proposal, as I think the information provided is satisfactory. Financially, I think the amount requested is reasonable for the scope of the project, and fairly straightforward to understand how it will be used.\n", "q1r": 4, "q2": "The proposer says very clearly and easily that the project if funded can be tracked and audited as progress is made via outube, Telegram, Facebook, committed to transparency for the monitoring community . I see the working group is willing to publish the work information so that the community can easily check the results. This helps the group work closer to the community and easily receive support. One small problem is that I don't understand if the number of members reaching 30 people is just the number of people who will attend the meeting in person. in the community the number will be higher. The remaining goals I see are reasonable.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "Organize live sessions and create groups on social media platforms to exchange knowledge about Catalyst, penetrate speculative groups, share them with risk-free opportunities across the Ecosystem.", "experience": "SPO, a member of the TIGER View team specializing in Oracle, 3 years of experience in Blockchain Research, a member of Catalyst from funding round 4, community advisor from fund 5."}