{"id": 420039, "author": "nhirayama", "title": "Quality Assurance of Organic Foods", "url": "https://cardano.ideascale.com/a/dtd/420039-48088", "category": 26602, "amount": 10462, "description": "Japan uses the most pesticides in the world, but these chemicals are used to increase the profits of the petrochemical industry. And the health hazards of these chemicals have not been disclosed.", "f6_no_assessments": 7, "f6_rating": 3.857142857142857, "videos": [], "media": [], "f6_assessments": [{"id": 11804, "q0": "I find the idea of ​​Quality Assurance of Organic Foods perfectly aligned with the goal of the Grow East Asia challenge, Grow Cardano. As a lover of green food and playing the role of preparing ingredients and food for my family every day, I was very interested and interested from the title to the content of the proposal on ensuring the quality of the food organic food through the Cardano ecosystem. This proposal has solved the challenge of applying the Cardano ecosystem to everyday life through food traceability.\nI noticed that, not only in Japan but also in my country Vietnam, the use of pesticides and chemicals in agriculture is increasingly popular. Manufacturers are aiming for profit, gradually forgetting about the dangers to human health that these chemicals bring. People now instead of buying products in markets and supermarkets, they prefer to choose clean and natural foods that can be grown by themselves or bought at organic supermarkets. However, as a housewife, when shopping for food, I find that the traceability of these organic foods in Vietnam is still not really guaranteed and reliable.\nThe unique and outstanding feature of the issue in this proposal is that the authors have emphasized the importance of health and the daily consumption habits of people in Japan to build this project. Before the alarming figures of the authorities in Japan about the number of pesticides being used for agriculture, the introduction of an agriculture that activates soil microorganisms without using pesticides and Using the Cardano blockchain to ensure food traceability anywhere, anytime is essential. I completely agree with the author's argument and solution to this reality in Japan and think that this is a concern that needs to be promoted by the Cardano community.\nWith the idea of ​​​​this proposal, I will give the authors 5 points because the content has satisfied me, satisfying the conditions for a green, sustainable and long-term development for the food industry in Japan in particular and Asia in general, parallel with it is the daily development of the Cardano community here.", "q0r": 5, "q1": "The project has provided very convincing arguments and evidence and a very detailed and clear implementation plan for each month and each task that needs to be done. Obviously, the planning and division of work were done very well by the team members. I also completely agree with the author team when I realize that this is a long-term project and this proposal is only the first stage of applying for funding for the project in the coming years.\nThe project budget of $10 462, accounting for 4.18% of the challenge's budget is a very reasonable number for this proposal. The content of the items to be spent and explained is already there, but for me, it's not really detailed, the authors should add more information, for example, the cost of Hirayama's business trip is 2000$/month (How many trips this month, each trip within a few days, what purpose do you go for, do you spend all of this money every month or does it change in the months?), same for expenditure items other fees. This interpretation will help the community to monitor and evaluate the project in more detail and closeness.\nThe project also identified 3 main risks that will likely prevent the success of the project: not subsidizing new farmers, the project is destroyed by pressure from JA, local banks and other stakeholders, consulting firms cannot cooperate with the project. Although the risks that will be encountered, the author's plan to deal with these risks has not yet convinced me.\nI see members of the team as capable of implementing this proposal, they have the capacity, qualifications, professional experience and have a clear identity. Unfortunately, I can't see a link to LinkedIn, Github, Twitter or any social history to verify. From the above comments, I give the authors 3 points in the feasibility part because -1 point for the budget part is not detailed and -1 point for the part of the plan to deal with the risk is not convinced.", "q1r": 3, "q2": "With the roadmap of the project, I find the project completely able to monitor the progress and success. However, for the community to have continuous and close monitoring, it is necessary to add a detailed description of the use of the budget. The author team should also make a monthly progress report on the implementation of the plan and use of the budget in an open and transparent manner to the community through the project's communication channels.\nThe authors have also come up with 4 KPIs to measure the success of the project, which are the number of an online seminars held, the number of jobs organized and the number of participants, the new number of farmers decided to cooperate in the project and successfully applied for the subsidy. In my opinion, these 4 indicators need to be updated by the author with specific quantifiable data to measure and must be updated regularly on a monthly basis during the course of the project and after. If the project is successful, it will be a pioneering step for a series of applications using blockchain technology in daily life in Japan.\nThis is a completely new project and has not been funded before, however, with this project, I see a future clean food technology for human health for sustainable development from Natural farming makes good use of plant and animal manure sources. This technology background is not only in Japan but also in Vietnam, we are also very interested in people and have gradually applied it to life. I find that extracting a clear food origin thanks to the Cardano ecosystem will create people's habit of using the ecosystem, over time this will become a community communication channel with a dizzying spread future.\nI will give the project transparency a score of 4 points because -1 point the authors are not really detailed when providing measurement information for the success of this project.", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 9, "ne": 6, "ng": 2, "nfo": 1, "vca_o": 2}, {"id": 217, "q0": "It is a proposal for food traceability in Japan, which is very appropriate for the purpose of the category.\n\nThe content of the proposal begins by pointing out the structural problem of Japan's extremely high use of pesticides, and then goes on to the method that will provide a clue to solving the problem, namely, the spread of \"soil microbial activation agriculture\" that does not use pesticides and the use of AtalaPrism to connect farmers and consumers to provide safe foodstuffs. The proposal has a very logical structure, from the problem statement to the solution, and we have the impression that it is highly complete as a proposal.\n\nIn addition, the implementation plan is divided into multiple phases in anticipation of a certain length of time, and the plan also takes into consideration the expansion of sales channels and incentives such as preferential sales to ADA holders, which is both unique and realistic. I feel that there are high expectations for the realization of this plan.", "q0r": 5, "q1": "The team composition is clear, and I have the impression that it is composed of people with very rich backgrounds, such as agricultural professionals, microbiology researchers, medical doctors, and chefs, who will be able to fully demonstrate their abilities in explaining to new farmers and holding seminars.\n\nHowever, there are no developers in the team for the development of solutions, including AtalaPrism, and there is no mention here of the specific direction of what kind of traceability technology will be installed. Therefore, even if the number of new farmers achieves the target, we have the impression that there is some uncertainty about the viability of the project in terms of ensuring its progress in the future.\n\nThe possibility of the project being abandoned due to pressure from JA, which is mentioned in the proposal, is also a serious risk factor. The proposal explains that the pesticide problem, which is the starting point of this project, is a major structural problem due to JA's involvement. However, if this is the case, it may be necessary to contact and negotiate with JA officials in advance regarding the feasibility and direction of the project. It seems to me that the JA staff may be concerned about these issues and may be reluctant to participate in the project.\n\nHowever, the fact that the proposer did not hide these concerns as risk factors and made them clear is a good sign, and in that sense, I think the structure of the proposal is very impressive.", "q1r": 3, "q2": "In this phase, the focus is on recruiting new farmers and applying for subsidies, and the number of seminars and workshops required for this purpose, as well as the target number of participants, are set in a simple manner, so in this sense, I think the settings are appropriate.\n\nHowever, if we look at this plan as a roadmap based on performance indicators, we feel that more detailed settings may be necessary.\nFor example, we have scheduled five online seminars at the beginning of the project, but we would like to see the outline of the seminars, including the expected number of participants, the areas where they will be held, and the content of the seminars, as well as the content of the workshops that are planned, and the expected points for each at this stage. I believe that this will enable us to make a qualitative evaluation of the content of implementation and link it to actual participation in the project, in addition to a quantitative evaluation that considers the project accomplished simply by the number of times it is held.\n\nAlso, although this may be an evaluation under the feasibility section, the ratio and amount of travel expenses to the budget appears to be somewhat excessive. \nIt is unclear whether these travel expenses are for holding the workshop or whether they include marketing expenses for recruiting new farmers before the workshop. \nIn any case, we would like to see an external indicator to evaluate the appropriateness of the $8,000 cost for 4 months.", "q2r": 4, "assessor": "z_assessor_2061", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 3976, "q0": "This proposal aims to create a traceability application for Japanese organic food produce by utilizing Cardano blockchain. If this proposal succeeds, it will definitely gives a real world use case for Cardano and onboard thousands of farmers and companies to utilize its application. Moreover, its use case is for the benefit of mankind, to ensure that people are consuming organic and healthy produce with the confidence that any repercussions faced by the consumers in the future will be held accountable by the producer. Therefore, this proposal effectively addresses the challenge.  ", "q0r": 5, "q1": "The proposer provided a list of team members with qualifications but are not verifiable since there are no links to any profile such as linked in. On your next proposal, please provide verifiable information of your team members such as linked in to make the process of due diligence easier for the community. For the phase 1 of their project, the proposer identifies the required manpower and resources to successfully implement the project. Since phase 1 is only holding seminars to educate farmers in their new way of farming, the required tools and specialist required in the proposal are practical and sensible. The budget outlined in the proposal are clearly broken down into identifiable terms. The proposer offers a realistic timeframe to complete the project. Also, the requested budget are reasonable to achieve the goals. Moreover, the proposers offers a conductible plan to successfully implement the project. However, the proposer mentioned a few risks and challenges that they might face during the implementation phase. The biggest concern is the intervention by JA. If they intervene, will the proposer abandon the project? Is there anyway to navigate around it? Authorities have the tendency to intervene anything that is against their policy. Please provide a plan to solve the issue or else all of the effort by the team and funding by catalyst will be wasted. It is best to meet the authorities first and resolve to a mutual agreement that there will be no intervention during the implementation phase. Therefore, I neither agree nor disagree that this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposer offers a clear time horizon to complete the project. Moreover, the KPI for their 1st phase of the project to expose and educate farmers are straight forward and well thought. However, as mentioned in the implementation section, it is best to get the approval from the authority first as one of the milestone to ensure that this project are able to continue without are intervention by the authorities. Without the approval, every effort made by the team will be wasted. Another point is, the proposer did not provide any channel for the community to receive updates on their progress. Please provide a link where the community can receive updates on the progress of your project. Therefore, I neither agree nor disagree that the information provided is sufficient to audit the progress and success of the proposal.", "q2r": 3, "assessor": "z_assessor_2503", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5019, "q0": "The grand plan of the proposers is to track the quality of Organic food in Japan using the Cardano blockchain/Atala prism. Although, the scope of this specific proposal is to conduct online and in-person meeting with Japanese farmers to convince them to use natural microorganisms and create an organic sustainable foodchain. To execute the grand plan, there are many moving parts. These include helping the onboarded farmers receive annual subsidiaries, educate and help them implement organic farming methods, Recording traceability on the blockchain, and finally receiving subsidy/loan from Super L fund. This can be highly impactful and bring a major adoption for Cardano in the future. The reason for the rating of three is because of the scope of this specific proposal. Even if this proposal is implemented successfully, it will not bring adoption or use of Cardano in any way.\n", "q0r": 3, "q1": "The budget requested will be used for equipment purchase, licenses, travel expenses and lecture incentives. In the first month five lectures will be conducted, onboarded farmers will have handholding and further education session in month two and in month three, the team will help the farmers apply for subsidies. Based on the experience of the team, the plan is highly likely to be implemented successfully. The reason for not being given a score of five is that there is no mention of how the lectures will be marketed to the farmers.\n", "q1r": 4, "q2": "Auditability of the proposal is straightforward. Reports on proof of number of lectures held, the number of attendees to the lectures, number of onboarded farmers and number of successful subsidy applications. It’d have been helpful for assessments if the proposers mention how these KPIs are tracked.\n", "q2r": 5, "assessor": "z_assessor_2663", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6037, "q0": "This idea is quite innovative. The proposed content is to propagate a solution for productive farming that does not use pesticides and uses blockchain technology for food traceability. Propagate the solution through various seminar to explain the benefits of applying new farming methods to farmers in Japan. At the same time, blockchain technology will be applied by storing measured values ​​of the environment soil where the vegetable is grown (eg soil fertility, the weak electric) on the blockchain to prove the source of that vegetable. The proposal will have a great impact on the Japanese community as well as the Asian community if the project has a plan to expand to other countries. Help people visualize how blockchain technology is applied to the real world instead of just being mentioned as a crypto market. Thereby improving the lives of the farmers who use Cardano in East Asia. Therefore, the proposal to effectively solve the challenges is given, which is very consistent with the impact of \"Grow East Asia, Grow Cardano", "q0r": 5, "q1": "The implementation of the idea of this project needs to go through 4 stages and this proposal is phase 1 in the implementation process. So I will focus my review around this phase 1 of the project. We will have 15 seminars held within the first three months, respectively we will have at least 1 session per week => Quite reasonable and very convincing, balanced time between meetings is enough to prepare the meeting to go as smoothly as possible.\nThe implementation cost for this phase 1 project is $10,462. Most of the cost will be spent on Hirayama's business trip ($8,000). However, to be more specific, I think the proposer should clarify in detail how the costs for this business trip are. For example, travel expenses, hotels, meals, business trips, etc.)\nThe professional experience of the team is very good, we have professors of Environmental Sciences / Marine Biosciences along with agricultural engineers involved in the project.\nTherefore, overall, I fully believe that the project can be most successfully implemented in phase 1 of the implementation roadmap.", "q1r": 5, "q2": "I agree with the project's KPIs to measure progress. I only have a small addition to the number of measurements, so I should specify the number of participants here for example 30 people/seminar, or the number of successful registrations or workshops is 20 farmer households. This number will serve as a benchmark to help us measure whether we have done well and where improvements are needed. \nA minus point for the project's auditability is that the project has not provided enough evidence about each member as well as their relevant experience. Evidence such as Twitter or LinkedIn links will be more convincing and make the project more transparent.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 9349, "q0": "\"I see a proposal to activate microorganisms in the soil, organic agricultural products can be grown without the use of chemicals, and by using blockchain, food traceability can be guaranteed. suitable problem solving. I have some suggested comments as follows:\nFirstly to convince people you should use the data from the most recent years for example 2019-2020-2021 and in the proposal is that according to the data released by the Ministry of Agriculture in 2016 it is too old. Besides the link to view the data I can't see.\nSecond, because in Japan, most people envision blockchain as a cryptocurrency technology. So I think this will be a big challenge for the project because it will have to convey information to everyone about how Blockchain can be applied in the real world, develop Japanese agriculture and improve the quality of food. quality of life of the people.\nOverall I agree with the proposal and hope your project will be successful.\"", "q0r": 5, "q1": "I found the plan in the proposal to be sketchy and general. After finishing. After completing the 4-month roadmap Moving on to ② of the project plan? So what are the 2 plans of the project? You should be specific. The budget sheet I feel is also not detailed with the to-dos, very sketchy compared to the amount of 10,462 dollars. The information about the group members is the same, you do not give the number of years of experience, there is no link, so it is difficult to verify the information is correct or not.", "q1r": 3, "q2": "With this proposal, I see here not described what you will measure to track your project progress how to measure progress? You can give weekly or monthly report using google sheet. Besides, you only gave criteria on KPIs without specific target numbers. For example: The number of new farmers who decided to cooperate was 100 people within 1 month... the numbers. This will increase people's confidence. Besides, it is necessary to explain clearly and specifically about the working mechanism of blockchain for food traceability for the first time in Japan. Give specific example demos and images of your website. Overall, I don't appreciate this recommendation for providing sketchy information.", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11707, "q0": "the summary of this proposal is that it wants to use atala prism on the cardano blockchain to track organic agricultural produce free from pesticides, because the JA: the Agricultural Cooperative Association is a big bully monopoly forcing every farmer to use their pesticides and chemical fertilizers or else they wont get support and funding. \n\nthis proposal was an interesting one and i can see how this idea can add tremendous value for the cardano blockchain, very much different from majority other proposals doing translations and media outreach. if the project can successfully spread the use of organic foodstuff, and the public in japan is educated more about it, and is assured that the food they consume is truly organic, i dont see why this might not have positive impact on the cardano ecosystem. considering that the focus country is japan where this problem is at, its aligned with the challenge setting and also the fund 9 strategic goals\n\nin my limited knowledge of agricultural science, i cannot vouch for the science behind this proposal, saying that in order to circumvent pesticides and chemical fertilizers, they want to popularize \"soil microbial activation agriculture\". i dont quite understand the science behind this so i'll take it with a grain of salt and level for other assessors to comment on the validity of this agricultural technology.\n\nwhile i love the potential impact this project may bring, i find the risks associated to this project as very significant. it seems like subsidies might be given to new farmers afterall, with a new bill being passed in japan, which negates the need for this project. if the support does not get thru, the project still faces hurdles from JA and the local banks and consulting companies. i find the risks to the project fairly huge and i cannot be comforatable seeing the project fighting an uphill battle for a slim chance to drive the impact they desire. \n\nalthough the proposal is fairly lengthy, i can comment that it provides just enough background about the problem at hand in a local context that readers from anywhere around the world can digest and understand. kudos to the team for writing a concise proposal.", "q0r": 3, "q1": "the project plan was somehow listed in the impact section, instead of this feasibility section. I would suggest the team to place it in the feasibility section for future proposals in line with the catalyst proposal structure. However, they did provide just enough details overall to understand what needs to be done over the span of 4 months.\n\nmy discomfort arises when looking at the budget. the proposal is asking only for a reasonable amount of funding at first sight, slightly above 10k. looking at the budget breakdown, i cannot say that i'm comfortable that 8k (80%) is to be spent just on Mr Hirayama's business trip expenses. i know food in japan is expensive when eating out (been there myself, and city centre, tokyo, mind you), and transport is...average as well. 2000 per month for 2 months sounds like he's living the lavish life probably eating a kobe beef steak every other week or so. \n\nand finally, the credibility of the team, i dont doubt they've probably got all the experience they need to execute this project. one thought that occured to me was that the team makeup is mostly of professors and engineers, with no connections to government agencies for lobbying or anything of that sort. just a point to highlight for voters to consider. on that note, it would be helpful if the proposers have some linkedin links they can share about their experiences in the past for more in depth review. ", "q1r": 3, "q2": "the measures provided by the team is greset for measuring the progress of the tasks they have in phase 1, in line with the funding that they're asking for. However, it would help if they can supplement it with where will they disclose these information, on what platform, and how frequently will it be updated.", "q2r": 2, "assessor": "z_assessor_3270", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The PA points out that the team's Hirayama business trip expenses are too high and that the team lacks the ability to lobby. Certainly, I should have added a little more explanation about these expenses. This is because Hirayama is mainly lobbying and requires a lot of business trip expenses. \nIn fact, Hirayama made more than five round trips between Tokyo and Sendai prefecture to exchange views with the governor, politicians, and officials of Sendai in last month. The cost is well over $ 20,000, but Hirayama paid it itself. The reason I didn't write this detail was lobbying in Sendai was unsuccessful and couldn't lead to a proposal. However, Hirayama also has connections with several other municipalities and will need these travel costs to continue negotiations with them in the future.\nConsequently, This assessment is not valid because the PA's view of travel costs is biased."}], "solution": "By activating microorganisms in the soil, organic agricultural products can be grown without using chemicals. And by utilizing the blockchain, the traceability of foodstuffs can be guaranteed.", "experience": "The proposer, Norihiko Hirayama, is a former nuclear plant engineer and has experience in treating exposed bodies with a diet. The team includes a university professor of microbiological research, a physician, a cook, and a Cardano ambassador who supports Catalyst's proposal."}