{"id": 420226, "author": "win", "title": "AI Blockchain Activity DApp 🚀", "url": "https://cardano.ideascale.com/a/dtd/420226-48088", "category": 26602, "amount": 90000, "description": "\nActivity, mobility & transportation companies are disconnected.\nServices are becoming more expensive, complicated, inefficient, unsafe.\nNegative impact on environment.\nSafety and security concerns.\n", "f6_no_assessments": 7, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 4400, "q0": "You mentioned a series of current problems in East Asia but did not specify which country the problem is most prevalent. I understand this proposal is heavily targeted at the global transportation and mobility industry. The proposal addresses the goal set out in the Challenge of \"East Asia growth, Cardano growth\". I agree with your suggestion that it has identified the problems that need to be solved, and of course, it adds value to the Cardano ecosystem. In terms of the long-term, if the proposal is funded and if it is feasible in practice, it can scale and solve the challenge thanks to AI technology on the Cardano blockchain platform. That is the combination of Artificial Intelligence and blockchain. This combination is quite popular today in the world's high-tech world, it is considered to be the current technology and flourishes in the future. Through the issues you raised, I see the potential for blockchain development and that is the premise for continuing to build a community that promotes Cardano blockchain adoption in East Asia and around the world. However, I still expect the team to be more detailed and clear to help the community better understand the impact when the team has set a goal to penetrate a trillion USD market (a market with a very large scale), instead of showing a somewhat generic impact in the proposal. In summary, I agree with the impact of the proposal. I vote 4 stars.", "q0r": 4, "q1": "Through the presentation on the proposal, I know that you have a lot of experience in project management, blockchain, distribution mechanism, auditing, etc... The experience has been from 22 years of working. But unfortunately, I can't identify you specifically through Linkedin, don't have your portrait, and have nothing more specific to identify the proponent. In addition, if the team members have not been identified (you write as being considered) then I am afraid that the community will have a lot of doubts about the credibility of the team. My advice is that you fully identify yourself and your team members before proposing to further affirm the credibility of the team and confirm the feasibility of the proposal before the public. copper. With such an international proposal, it is impossible not to disclose the number of team members and the identities of all members. Regarding the detailed budget analysis, you have divided it into 2 subsections (1) marketing specification, and (2) specification with respective required amount for each item. But I think the present representation is too sketchy for a proposal asking for $90,000. I recommend restructuring and reallocating in detail the items that need funding and specifying the amount needed to be based on each job in the proposal, not a rough representation as it is now. . If you look at other proposals, you can see that they list very carefully the items related to funding, this is also a way to confirm feasibility with the community. I hope you will do the same to increase the feasibility of your proposal to the Cardano community. One more thing I need you to prove, is that if you don't get funding from Catalyst, will you continue to implement the proposal or not? And do you want to find other sources of funding to maintain the implementation of the proposal? My last question is about budget research, it contributes to confirming the feasibility of your proposal. In terms of resources needed to implement, it is not clear at the moment how many people you plan to mobilize to implement this proposal because the other team members cannot be identified yet. The combination of Cardano blockchain and artificial intelligence technology is difficult, it requires team members to have high expertise and techniques, and to adapt to the current age of blockchain information technology and AI. They have to be as skilled as experts to be able to execute a difficult and continental proposal. I have not seen the team show this. This is the third piece of advice that I give you that is quickly add the necessary human resources to perform. In terms of technical aspects to implementing the proposal if it is funded, as I said above, this is a difficult technology, it is a combination of Cardano blockchain and artificial intelligence, although I have not seen it yet. Get your unambiguous analysis of the field of artificial intelligence. All are presented at a not very thorough, slightly sketchy level. I think this is very important to confirm the feasibility of the project for the community. My fourth piece of advice is that the team quickly deploy details on how to do it, and analyze the technical aspects that need to be applied to confirm its feasibility. The one thing I'm happy about in the feasibility that you didn't present is clearly stating the risks involved in implementing the proposal. Although the risks you mentioned are related to the macro-level (economic market downturn, technological innovation world, schedule risks, etc...) I can temporarily accept this. . In summary, regarding the feasibility of the proposal, I feel that the team needs to add many criteria to further confirm that this proposal can be implemented and applied in practice. Specifically, about the criteria that need to be added, I have clearly stated above. I look forward to the team considering my comments and seeing them as positive. All my comments and questions are only to contribute to the improvement of this proposal. I disagree with the feasibility of the proposal.", "q1r": 2, "q2": "The roadmap for milestones only outlines two phases without specifying the specific time to implement the stages. This does not make the transparency of the proposal clearer and makes it difficult for the community to audit, as well as making it difficult for the community to evaluate the project based on work progress. In my opinion, the team should do a more thorough analysis of the work roadmap and milestones, it is best to attach the tasks in chronological order (associate the tasks that need to be done with the weeks of the month or the tasks that need to be done). work in specific months of the year - eg January, February,...). The measurement of the project is shown through the indicators in a rather sketchy way without specific numbers. Unfortunately, I couldn't find KPIs or key metrics. The lack of these two indicators ((KPI); key metrics) makes the transparency and auditability of the proposal not clearly shown. The definition of project success is also not very thorough, very general, and not clear. So my advice is that you should add more metrics (KPIs) or key metrics and make it clearer what the definition of success looks like through specific numbers. Only in this way can the community recognize the transparency and auditability of the proposal. The positive I noticed here is that the team's problem description is quite clear, with several solutions. I disagree with the auditability of the proposal.", "q2r": 2, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6039, "q0": "The content of the proposal is to build a Dapp that combines artificial intelligence and blockchain to serve the transportation industry. A TRYP coin is created to encourage customers to use the application. Customers can earn TRYP by moving in a geographical area or maintaining their activity. TRYP will be used to exchange to known cryptocurrencies on exchanges. Besides this Dapp, partner will have access to market research and existing transport networks (such as airlines, taxis, self-driving cars). Overall this is good but they are not yet up to the challenge \"Grow East Asia, Grow Cardano\". The content of the challenge is to support proposals that increase the number of proposals originating from East Asia into Catalyst, increasing the engagement of the Cardano and Catalyst communities with East Asian residents. Proposal is not a good idea for these criteria. I think the proposal should be submitted to the \"Dapps, Products & Integrations\" challenge to receive funding because of the more consistent with this idea.", "q0r": 1, "q1": "As I mentioned in Impact, the proposal is not suitable for the challenge but here are a few criteria that we need to discuss when talking about the viability of the project if submitted to the right challenge:\nThe project has foreseen the risks and challenges involved. From there, prepare plans to reduce this risk. This is the careful preparation of the project in advance to ensure it can be implemented successfully. I agree with this information. However, for the project roadmap, the proposer did not specify the details of the steps to be taken. For example, at the product development stage, I have not seen specifically what time frame the proposed team will build the foundation for the DApp. That is, at what stage will the work including Dapp design, code writing, test run, audit be done? I think it would be more convincing if we could add this information. On the budget side: the proposal requires a total budget of $90,000. $10,000 for Marketing and $80,000 for Blockchain Development. However, I still wonder if $80,000 is reasonable? By jobs like:\n+Project management\n+Development and design\n+ Distribution mechanism\n+Reparation for audit\nThe above jobs have not yet specified how much the cost for each item. From there, a general number can be obtained to assess whether the cost is sufficient to implement or not. I suggest that there should be more detail in this expenditure.", "q1r": 3, "q2": "Although the proposal is not suitable for the challenge, in terms of the project's audit, I think that the proposal achieved is at a high level. Since we have the information to track the progress of the project, we include Acquisition Metrics, Engagement Metrics, Retention Metrics, Quality Metrics, Behavior Metrics. This information is retrieved from the website or Dapp to measure user activity, helping to evaluate the product that has brought value to the customer or not. They are very convincing to me. But I would like to comment on the transparency of the rest of the team. Members are still being reviewed however I think more information should be added later in the process. The review will be updated on any media page so that the community can easily check it.", "q2r": 4, "assessor": "z_assessor_2771", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8026, "q0": "The submitter has included several problem statements at the same time. (activity, mobility and transport companies are disconnected, services are becoming more expensive, more complicated, more inefficient, less safe. negative impact on the environment, safety and security concerns.)\nAs a solution to this, the submitter wants to build an AI Blockchain Dapp that will provide a solution to these problems. It will have a positive impact on the cardano ecosystem if enough people are aware of the existence of this application. The main goals in the proposal correspond to the outlined challenge setting. The proposal has been scaled up in future challenges. it is good that the submitter has divided these into different categories. The petitioner has also always provided a solution to these problems.", "q0r": 3, "q1": "The proposer has included his relevant experience and skills. You can check his experience on his Linkedin. The proposal does state that the team members are still under consideration. There is a description of the budget with recognizable items. (marketing specifications, blockchain development) The budget seems reasonable to implement the proposal. It would be useful to include the number of working hours in the proposal per team member. There is a timetable with associated milestones record. I think it would be better to divide this schedule by month and provide a document where you can keep track of the budget. A better description could be given of the technical aspects that are crucial for the implementation. It will be returned if another financing round is needed. The proposal has been scaled up in future challenges. it is good that the submitter has divided these into different categories. There are always a few possible options provided to make this run as smoothly as possible. I think that there is currently a little too little information in this proposal about implementation. I think it is important that the entire team is also described. At the moment you can hardly deduce where exactly the financing will go.", "q1r": 2, "q2": "A limited route map is available. The project is divided into 2 phases. I think this is very generally explained. The breakdown of the budget does include the number of weeks per milestone. It would be better to divide everything even better. (work per month) The submitter describes several problems. (activity, mobility and transport companies are disconnected, services are becoming more expensive, more complex, inefficient, less safe. negative impact on the environment, concerns about safety and security.) The submitter explains what this application will do. I think it's better to tackle 1 problem per fund instead of tackling all of them directly. A number of KPIs are included in the proposal. These are well chosen. ( engagement statistics, quality statistics,..) It would be good to share these KPIs via social media or via their website.", "q2r": 2, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8139, "q0": "Blockchain is a technology of the future that any industry needs to approach. Especially the transportation industry, which is worth trillions of dollars and is growing. I realize that the idea of ​​this proposal is very important for the Cardano ecosystem in particular and the transportation industry in general. The scale of the impact is relatively large, affecting the entire transportation industry around the world, the object of this proposal will be all companies operating in the transport sector and tourists. This proposal meets the challenge of creating a DApp for transportation by combining AI & Blockchain Technology. It's TRYPTO, TRYPTO focuses on developing AI DApp/MaaS developed on Cardano Protocol. Through self-executing smart contracts, TRYP DApp will ensure optimal autonomy, transparency, trust, speed and safety, thus minimizing any risks associated with manipulation.\nAs for the risk presentation, I found the proposer to have argued well and presented it in detail. By assuming and accepting risks, there are three aspects of risk: cost, schedule, and performance. The proponent gave 3 primary risks and 3 secondary risks. From anticipating these risks during project implementation, the team has prepared solutions to minimize those risks.", "q0r": 5, "q1": "The route is divided into two specific phases. The first phase is to develop a TRYP active Dapp for customers. Phase 2 is developing TRYP DApp for Enterprise. I found that the presentation plan was not detailed and lacked a specific timeline. This project I am very interested in, so I want to follow the project's token release plan. I hope the team can provide more information about the token release time and the project's tokenomics.\nThis proposed budget is for the early stages of development. This amount is only 18% of the total budget for Challenge. The team has allocated the budget to two specific expenses, which are marketing costs ($10,000) and blockchain development costs ($80,000). However, in order to be more detailed, the author should break down these expenses and add an explanation and calculation basis, it will be easier to evaluate.\nThe author has provided information about Alex - the founder of the project. He has 22 years of design and engineering experience such as software & application development, AI & machine learning, BIM & IoT applications..etc. I think his experience and competence are in line with the objective of the proposal. His identity is easily verified through the Linkedin profile the author provides.", "q1r": 3, "q2": "The proposer provided measurement indexes to track the project's progress, it's tracked on the project's Website and Dapp. Those metrics are: conversion metrics, engagement metrics, retention metrics, quality metrics and behavior metrics. For more completeness, the author should provide a link to the project's Website. Since this is a brand new project, the project has not received any funding in Catalyst before, so interacting with the community and increasing transparency is very important. My opinion is that the team should plan to update new information and progress regularly (weekly or monthly) on the project's communication channels such as website, twitter, disco, gibhut, youtube... copper can be checked and tracked more easily.\nThe success of the project is described by the author as expanding the Cardano ecosystem. TRYPTO will be an immersive and intuitive application. Empower people with rewarding experiences; TRYPTO will provide a transformative economic solution to communities/societies around the world; TRYPTO will be a solution to revolutionize transportation, mobility and self-driving.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 10076, "q0": "- Synthesize the information that this project wants to bring to the trucking and water transport industry with blockchain technology solutions and dapps through the cardano blockchain.\n- With a team of project members showing through 22 years of experience in the field of designing and engineering many blockchain methods and application software….\n- The problem solved by the project is developed through the cardano blockchain to reach customers and the transportation industry. Furthermore, the proposal to mobilize members to deploy Dapps products incorporating artificial intelligence into the cardano blockchain field will contribute to the e-commerce network platform and the global transportation industry. The main goal of the project is to develop the first cardano blockchain network platform to tourists, through smart contracts integrating efficient tools, increasing quality for customers.\n- Therefore, this project proposal is not an idea for the Grow East Asia, Grow Cardano theme. My sincere advice to you is to take this recommendation on top of other catalysis challenges for an easier chance of project development and funding.", "q0r": 1, "q1": "- when plans have a clear development path. Project members list in great detail for each phase to fully meet the timelines for the Trypto dapps project.\n- With a total investment capital of 90,000 USD. Also a lot of money, but the project showed up to the plan and the cost was worth it.\n- The personal information of each member of the project is too little, if it is possible to add more member information, it will probably increase transparency for a project.\n- I agree with this project proposal", "q1r": 4, "q2": "- For a project to be successful or not, it is necessary to have high transparency and fully respond to the information of each individual member of the project to attract the support of the Catalyst fund.\n- With measurable KPIs also updated by project members, clearly giving each item through specific parameters through the web and established dapps.\n- I firmly believe that if this project is completed, it will contribute to the further expansion of the cardano blockchain and that Trypto will play a leading role in the mobile and autonomous transportation industry.\n- I agree with this project proposal", "q2r": 4, "assessor": "z_assessor_3146", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11151, "q0": "To be honest, the proposal is not suitable for the Challenge  \" Grow East Asia, Grow Cardano \" at all as it aims to provide a solution and support for the mobility industry by combining Artificial Intelligence & blockchain technologies. It is worth noting that the target audience of the proposal is quite general and not specific. What I mean here is that where the community that the education portal will serve. Of course, it must be suitable for the Challenge. Moreover, the solution and goal of the proposal is very vague. As can be seen, the proposal aims to enter a multi-trillion-dollar market, increase competition in a great way for consumers by doing something important, meaningful and productive. What does \"doing something important, meaningful, and productive\" mean here and specifically? There are many things that the proposal needs to clarify so that voters can easily understand and approach the project.", "q0r": 1, "q1": "This section also has too many things to complain about. Firstly, the proposal should provide more information about project participants, especially those holding important positions. The only thing provided was a resume of the founder. Secondly, the project's development roadmap has no timeline and the project has no plans or solutions to attract customers and enterprises. In addition, the budget breakdown is even worse when the total budget requested by the project is up to 90000 USD, more than a third of the total budget for the Challenge \" Grow East Asia, Grow Cardano \". Expenditures in the proposal are also not described specifically and clearly. The proposer has foreseen the risks. However, it is worth noting that except for cost-related risks, schedule-related risks and performance-related risks, all from the project participants themselves, such as \" being overly optimistic about the timeline of the project \", \" inadequate design or poor team dynamics \". I strongly advise the proposed team to think more seriously about Catalyst. If you are really serious and passionate, the above risks will not exist.", "q1r": 1, "q2": "It is great that the metrics will be measured like acquisition metrics, engagement metrics, retention metrics, quality metrics and behavior metrics. However,  what i'm wondering is how do people see these metrics or how the team communicates the metrics to the community. The audit of the project is completely impossible if the above metrics cannot be viewed. Many other proponents find success in this section in various ways. For instance, the team can provide periodic reports. I think it would be helpful for the proposed team and the community. Furthermore, with proven track records from these reports, the team will more easily get support from voters in the following proposals.", "q2r": 1, "assessor": "z_assessor_3225", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Inaccurate feedback. Proposal provides sufficient information.  Keeping in mind this is a project startup and will require minor adjustments."}, {"id": 13501, "q0": "The beginning of the proposal states multiple challenges and addresses them to a different degree. \nIt is understandable how the proposal aims to better connect transportation companies by giving them access to the same shared data. Similarly, it makes sense, how the user feedback could help to increase security. \nOn the other side, it is less clear how this approach will bring more efficiency and reduce the negative impact on the environment. \nIt would much clearer if you could say more explicitly how you solve each of challenges individually. \nFurthermore, it is unclear how exactly Artificial Intelligence will be utilized. It would be helpful if you could clarify this in the proposal.", "q0r": 3, "q1": "For the first part of the proposal (website, documentation, marketing), it is likely to be implemented successfully as the plan is clear enough. However, except for the founder, it is unclear how many people will work on this project, and what their experience it is. This makes it difficult to evaluate how the project will continue after the first phase.", "q1r": 3, "q2": "The proposal includes a website (www.tryp.to) which currently shows no information. It would be helpful to include a banner stating something like \"Under construction\". Apart from that, the website can be helpful to audit the progress of the proposal. Additionally, it would be helpful to provide a social media platform like Twitter, which can be used to track the progress of the project.", "q2r": 3, "assessor": "z_assessor_3659", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "\nAI Blockchain DApp.\nTargeting the global mobility / transportation industry.\nTo provide a DApp solution for activity and mobility / transportation industry by combining AI & Blockchain Technology.\n", "experience": "22 years in design and engineering experience:\n\nAEC Engineering & Design.\nProject Management.\nSoftware & Application Development.\nBIM & IoT Applications.\nArtificial Intelligence & Machine Learning.\nFinTech.\nBlockchain & Digital Currency.\nUX & UI Design.\n"}