{"id": 420563, "author": "quintin", "title": "Onboarding Musicians From Asia", "url": "https://cardano.ideascale.com/a/dtd/420563-48088", "category": 26602, "amount": 25000, "description": "There is a major absence of users from East Asia on Cardano in the music community.", "f6_no_assessments": 9, "f6_rating": 4.296296296296296, "videos": [], "media": [], "f6_assessments": [{"id": 1926, "q0": "The proposer identifies an interesting view about the music industry that is still left behind in blockchain adoption, especially in East Asia, and picking an Indonesian artist as the ambassador could be a great idea - considering the crypto adoption in the country and the potential. Not just the Cardano East Asia community, if this proposal succeeds, it could bring good traction globally. As we know music brings people together by the end of the day, no matter which chain it is built on. This proposal is fully aligned with the Challenge campaign.", "q0r": 5, "q1": "The proposer brings many experienced teams and recognizable partners into the space, starting from technical NFTmaker.io and music platforms. The team detail is explained and presented thoroughly - just lacking who is leading (assuming it will be Quintin - but not mentioned in the proposal) - this is very important since the team consists of leaders (mostly founders and co-founders)\n\nThe budget was outlined clearly but not broken down in detail while keeping it still about <10% of the total budget challenge which is acceptable. \n\nAs for the timeline given, it was straightforward forward but it is quite tight - starting on 30 July 2022 and the marketplace plan to release on 28 Sept 2022. But the team has identified its risks and has a mitigation plan intact - including pre or self-finance of this project without Catalyst funding to keep going.", "q1r": 5, "q2": "The proposer gives the exact target date of the milestone including the final release date but did not share how the community can track the progress. I would suggest they can share the progress periodically in the Cardano Forum thread or in Github Project. \n\nThe KPI to measure is from the number of artists successfully contributing/joining the platform up to the end of Sep 2022 which seems achievable and easy to measure (x out of 5) by the community. ", "q2r": 5, "assessor": "z_assessor_2289", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3828, "q0": "This proposal is about onboarding musicians to the Cardano blockchain by developing a music marketplace. The problem statement is clear and precise which their solution is to help onboard new talent to Cardano, onto the music marketplace through collaboration with ambassadors from East Asia. \nThe challenge is about growing Cardano in East Asia, so with their aim of growing Cardano awareness through their ambassadors in East Asia to bring in musicians to Cardano, the Cardano community will increase as a whole, thus addressing the challenge.\nThe proposal has outlined 3 risks associated with the project which are the fear of not getting funded; the difficulty in attracting musicians and their fans; and the difficulty in  community/customer base. They outlined their mitigating factors against the risk as well. \nThe impactful factors that can address the challenge effectively could have been  a little more expanded in detail. Hence I am giving 4 star rating. In their next proposal, the team could try to give a little more details about how the project can be more impactful, aside getting them onboarded.", "q0r": 4, "q1": "The plan of the proposal is showing some points as the music NFT marketplace to be released in July and September and onboarding of 1 ambassador by July 30th and 5 musicians onboarded by September 28th. 2022. The timeline is clear but the contents of the plan could have been a little more detailed.\nThe budget total request of $15000 is reasonable and has been broken down into some details. But the bulk of $20000 going into the front end and back end designs could have been further broken down for more understanding. \nThe team for the project consists of 10 professionals of various experiences and skills in digital business, music, songwriter, programming, etc. who I think are capable in delivering. However, links such as LinkedIn profiles for the team were not provided for further checks.\nThe proposal stated that the team will need further support from Catalyst in the next funds since they want to continue to support the South Asian Country and build Cardano. The team again indicated that they are part of other proposals in Fund9 and are working on a previously funded proposal.\nthe facts above, both good and a few criticism, will attract a 4 star rating from me. ", "q1r": 4, "q2": "In this proposal, the progress of the project will be measured by reaching the launch date milestones and they are listed as music NFT Marketplace as indicated by the proposal. The proposer has not provided any KPI to measure the progress but has written the same plan as in the feasibility section. I think KPIs such as the number of meetings held, the number of participants could be have been listed. So in their next proposal, the team should take note. Thank you. \nHowever at the end of the project, the success of the project could be seen in the completion of the NFT Marketplace and 5 musicians onboarded from East Asia, and hoping to bring in 10 more and 900 more into the future to grow Cardano community. \nThis is a new proposal as indicated in the proposal. \nThis section of my assessment will attract 3 star rating since the information provided is not sufficient to audit the progress and success of the proposal, as depicted in the assessment.", "q2r": 3, "assessor": "z_assessor_2483", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3871, "q0": "The idea of ​​​​the proposal has identified many problems to be solved in this challenge, most of which meet the problems posed by the challenge, but the impact scale is small, with many limitations. limited, only within a certain area with certain conditions. Also, this is a good idea, it has the potential to bring value to the Cardano ecosystem, and the author can make it better, I look forward to seeing this project again in the next Foundations if The project is not Funded in this Fund. The author considers collaborating with future great artists/musicians who are influential and popular at the continental or international level.\n\nThe solution of this idea is good, it identifies some of the problems of the challenge, besides the author of the idea argues in a logical, neat, and creative way. The solution combines Humania as an ambassador in Indonesia, creating an NFT product based on the Cardano platform is a good solution. Through the lens of music and art, the rate of popularity to the public is very fast, especially in the music/art community.\n\n The project has a detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme is funded. In case the project doesn't run on schedule, the author has fallbacks for this, for example, the number of musicians participating in the network and the low understanding of Cardano. Listing more risks and options will keep the project on track and target, it's a good project.\n", "q0r": 4, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The author only gives release dates, which are milestones of a project, but they are not a blueprint, please provide a more detailed roadmap. , for example: after the 9th Fund cycle ends, the project is funded, what will be done in the first week, what will the second week do, ... and how long (from the date of IOG disbursement) will be achieved. the above milestones.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. A detailed budget should list hourly wages for workers in each locality, corresponding to the tasks of each person in the project team, the community needs to know, this helps to make the project transparent. better project.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are entirely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project is Quintin Bray-Stone, with collaborators Tobias Steffen, Sunny Basra, Nhan Nguyen, Tuan Pham, EQ Puradirezja, Heru Singgih, Darma Wardhana, Bangwin, and Timothy Vang, showing that this is a team that has, However, in implementing this project, the author please provide more reputable identification links such as LinkedIn, Facebook, Twitter, Discord, ... for the community to verify the correct identity. easy and practical.\n", "q1r": 3, "q2": "This project provides KPIs for accomplishing the project's goals, but some of the goals are difficult to measure compared to the information the project provides. The community can measure the Music NFT Minting Site and Music NFT Market from which channel or platform and how and where they are quantified, along with information to demonstrate that there are 5 musicians on board from East ASIAN.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. The author should also test this proposal with or without funding, in simulation or another form of course, so that the author can see the practicality of this project.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5682, "q0": "This a brilliant idea. The highlight here is the potentials to enroll more people from the music industry into the community. To do this, the proposer intends to leverage on his partnership with Indonesian ambassadors and homeland so as to provide the needed education to various artiste and attract the them into the catalyst community. Ultimately, the team intends to scale up the growth of the Cardano Network via this partnership and eventually allow musicians to exploit their potentials and also bring their fan bases into the community. Will this help grow Cardano and grow Asia? One key objective of the grow Cardano and grow Asia challenge setting is to increase participation within the Asia community. In that regard, I think the Objective of this project is well aligned with the criteria of the challenge setting. More importantly, the proposal presents a broad marketing mechanism to attract musicians from all spectrum and also offers a detailed solutions to the challenges the project is likely to face. In sum, I am convinced of the prospect of this project. ", "q0r": 5, "q1": "On the basis of the roadmap and team experience, I am confident that the project would be implemented. From the profile, we see a composition of team members with comprehensive and extensive field of knowledge within the NFT ecosystem and the field of music. Let’s consider Tobias Steffen, he brings onboard a huge working knowledge and understanding of the cardano NFT ecosystem, therefore his experience could be crucial in getting the project to a larger audience of musicians. Ideally, these are the personalities that fits project like this. Interestingly, almost all the team members have links that confirms their expertise and field of experience. On the budget allocation, it is obvious every single item required for the project is budgeted for. Apart from that, the proposer presents a detailed breakdown of the cost of each item. In my view, the cost are moderate.", "q1r": 5, "q2": "On the auditability of the project, despite the information presented, the team can improve the overall outlook of the project to be make it more suitable with the overall goal of the project. Per the project, the main KPIs here are, Music NFT Marketplace, Music NFT Minting Sit, Music NFT Marketplace and On-board 1 ambassador. My perspective on these parameters is that, they are in line with the overall objective of the project. Apart from that, the proposer presents specific milestones to guide the team along the path to final completion of the project. Therefore, the metrics presented for this project are accurate and more decisive in making any conclusion on the progress and success of the project and they would also provide a true reflection  on how well the project performs. However, is it possible the catalyst community get access to the information on the progress and success of the project? And how frequent would the team update the community on the performance of the project? I would entreat that the team brief us on these concerns. Great input. ", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7892, "q0": "I  agree this proposal does effectively address the challenge of growing Cardano in East Asia. The proposal does clearly outline the problem that we not only need to grow Cardano in East Asia, but can do so by onboarding musicians into the Ecosystem. We are already lacking a large music community on the Cardano blockchain. Thus growing the Cardano Community in east Asia would not only bring more people into Cardano, but also grow the music industry as well. With this in mind, the proposal does correctly address this challenge in a highly efficient way. The plan clearly indicates how the proposal will not only bring artists into the Cardano Ecosystem, but also support them to make sure they are successful; this will ensure that not only are more people coming into the Cardano ecosystem, they are also staying within the Ecosystem. I find the proposal is able to scale to address future challenges, The impact of onboarding musicians from East Asia goes beyond that of the artists themselves, this will also get the listeners and fans of these musicians interested in Cardano as well. The proposal could do better to articulate how it plans to stay sustainable so that the project not only is successfully implemented, but continues to operate over the years to come. My suggestion here would be to clearly outline the business model so the readers can make an informed decision over the sustainability of the proposed plan; no information is listed about pay rates for the team or exactly how the project will generate an income, this should also be communicated in some form so the reader has more information at their disposal to make an informed decision. ", "q0r": 4, "q1": "I  agree that taking into account the experience the team has this proposal looks like it will be implemented successfully; however there are some things that could be improved in the proposal presentation. The team that presented this proposal has had an extensive career in the music industry in various positions, with one team member already working intensively in the Indonesian music industry. Further examining the project, I concluded the proposer has taken into account the appropriate team size as well as type of team members needed for this proposal to be implemented effectively. The team has relevant experience in the NFT industry, coding, which will be needed to onboard musicians into the Cardano Ecosystem through Music NFT projects, as well as team members that have experience directly onboarding and supporting artists outside of blockchain.  Previous experience is listed for all members of the proposal team, however not every member has a link that provides evidence. My suggestion here would be to make sure there are links to the CVs or Linkedin profiles for all members. Technical aspects of the project that the development department would handle are clearly outlined After examining the projects budget, the concern I do have is that the cost for language support, should be bundled into the front and back end development portion of the budget.  Risks that the proposers project might encounter are also clearly outlined, so it appears the proposer clearly knows what can make the project succeed as well as fail. ", "q1r": 4, "q2": "The proposal gives clear metrics on which the progress of the project can be audited; even by investors who are not financially savvy. The proposal lists when the NFT Minting Site as well as the NFT Marketplace will become available. Another clear metric is the number of musicians that are onboarded through the project as this will directly imply if the project was successful or not, since the entire plan resolves around onboarding musicians within East Asia to the Cardano blockchain. ", "q2r": 5, "assessor": "z_assessor_2933", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11009, "q0": "As an Indonesian, I see Indonesia as a country with hundreds of local musicians seeking the best way to market their products amidst the weird centralized and not so pro-artist regulation regarding royalty distribution. The royalty paid through musical NFT sold on a smart contract integrated marketplace offers a solution in this respect.\n\nFurthermore, the ability for Indonesian musicians to mint and market their musical NFT on a smart contract based marketplace will also bring Cardano to the next level of mass adoption in a country with a population of 275 million.\n\nI also noticed that this project has appointed several prominent figures as Ambassadors to Indonesia. These well known artists from various genres with profound organizational backgrounds would be the main factor in creating a bigger impact for they all have solid fan bases from various demography, thus this proposal effectively addresses the challenge.\n\nAs the beginning of mass adoption, this is a great way to spread the word of how Cardano NFT can be used in a broader spectrum of utilities. In the future, the key metrics should pivot from having numbers of onboarded artists to numbers of platform users.\n\nNevertheless, I would like to take a few notes here as currently there are several competitors building quite similar music platforms on Cardano.\nThe first thing is that this proposed music platform should implement a user-friendly UI/UX that will allow more users to get onboard. And the second thing is there should be more workshops to grow a broader audience.\n", "q0r": 5, "q1": "Having read the plan and time frame given in the proposal, a few questions came into my mind. The first question is, why is the project aiming to have 5 East Asian musicians onboard at the point of launching the site? Are these musicians going to be endorsed by and to promote the platform? I have these questions because in my opinion, the key metric should be on how many varieties or genres of musical NFTs are being listed on the platform and the number of active wallets interacting with the platform, not merely by how many artists are being onboard.\n\nNow for the outline of the budget. Another question raised: Why are there still allocations in this proposal for (1) front-end design work (3 months) for $10,000, that is to update SoundRig.io to include Indonesian language support, and (2) back-end work  (3 months) for $10,000? In my opinion, this should be done along with all front-end and back-end work as a whole, not exclusively on Indonesian site pages. And I have learned that this has already been proposed under another challenge.\n\nSo, this budget breakdown has left me a bit vague. Nevertheless, Looking at the team's backgrounds and expertise, I have no doubt this project will be implemented successfully\n", "q1r": 4, "q2": "The proposal gives clear milestones as well as a time horizon for all achievements. Nevertheless, the proposal does not explicitly state what accessible tools or platforms will be utilized to monitor the development of this project publicly.\n\nFinally, if this proposal gets funded, I would like to suggest the team use all onboarded artists’ social media to deliver the progress updates as well as metrics of KPI, such as numbers of active wallets of platform users, and utilize Discord for more interactive audit of the project.\n", "q2r": 4, "assessor": "z_assessor_3214", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11152, "q0": "In general, the proposal aims to create a Music NFT Marketplace and bring East Asian musical talents to Cardano. This will allow independent musicians to flourish on Cardano while also attracting their fans from their respective countries to grow the Cardano community by growing awareness about Cardano via ambassadors in East Asia. Given the value the project will bring to the Cardano community and musicians in East Asia, this proposal is a great fit for the Challenge  \" Grow East Asia, Grow Cardano \" as it contributes significantly to making the Cardano ecosystem and community more diverse.", "q0r": 5, "q1": "At the first sight, there is no doubt about the ability of the members who will work on the project. Many in the team are experts in the field of technology and especially music so the project has a high probability of being implemented successfully. Moreover, the work and working history of the members are clearly stated. It is great that the project has a very specific roadmap. However, it seems that the budget breakdown is not detailed. I suggest that the proposed team should have a more specific description of each expense. Voters need to know this more specifically so they can know if the budget is properly allocated. It is commendable that the team has foreseen possible risks and actively planned to minimize those risks. Well done!", "q1r": 4, "q2": "Surprisingly, we can audit even before the Fund 9 vote takes place. The proposal provided information about the roadmap, including milestones so we just have to wait for the right time and  then check the project's progress based on that roadmap. From my point of view, the project has a transparent audit standard although there are no specific measurement indicators because of the project's intrinsic. This is a limitation that cannot be overcome at this stage but in later stages of the project more specific metrics will be needed such as number of NFT collections, number of transactions, etc.", "q2r": 4, "assessor": "z_assessor_3225", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11711, "q0": "their vision to drive value and impact to cardano is clear and targeted: using music where musicians publish songs on cardano, specifically in indonesia for now, and their fan bases will follow suit to understand more about cardano. The musicians thus functions like ambassadors. I find comfort knowing that the lean team is not starting off too big, where they intend to first start with indonesia as their home country, but i can see this solution scaling up to a regional and global level, if execution is a success. \n\nthey also have engaged a music duo band from indonesia - Humania - to be part of this. while this may not be the biggest band like BTS or something, i think its a small step in the right direction considering how early stage this project is. Understandably, there are many risks associated to the project in which the team has outlined. Risks like getting famous musicians to come on board, and to gather a sizable customer base, and of course, to fund their work till they reach critical mass. While these risks and valid and i would say very real in making the project unsuccessful, i appreciats the team's honesty in listing down their mitigating measures. having the ball rolling with humania is a good start and i think they deserve a round of funding to take it one step further. ", "q0r": 4, "q1": "the proposal states very specific dates of which they target to get certain tasks done, like onboard 5 musicians from east asia by sept 28, which is impressive, really, if they can deliver so. I work in partnerships myself and i can testify how fluid situations can be in negotiations, and i can only hope they stick to their commitments. \n\nthe bedget breakdown, however, was a little too simple to provide transparency to readers, voters. for example, out of the $5000 requested for indonesia ambassador marketing, how much goes to advertisements, and the workshops, and the translator? \"back end work 3 months\" for $10,000, what is the exact service that will be spent on? buying software, hiring peoeple, if yes, what software, how many people. \n\nat the very least, the team working on the project is credible with experience in the web3 space. i find it weird that the team included members of the band itself in the section \"people who will work on the project\", but i guess they wanted to provide transparency. my guess is that perhaps they provide consultancy services or advice to the developing team about the nuances of the music industry, if not for just making the music itself and passing over to the project team. ", "q1r": 4, "q2": "Auditability of the project here as the proposal states is to hold the team accountable to achieve the outlined milestones timeline. This, I suppose, will be transparent through their site https://www.nft-maker.io . Longer term vision is all about bringing more musicians on baord, to which i have no rebuttal on. a fair proposal indeed. ", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12683, "q0": "The suggestion to address the problem here is that the Music Community is missing users from East Asia on Cardano. This proposal will add value to the Cardano ecosystem by partnering with Humania to become an ambassador in Indonesia, introducing musicians to the Cardano blockchain by developing a music marketplace. The proponent offered the following solutions: work with ambassadors from East Asia to help bring new talent to Cardano into the SoundRig Music Market. launch the project on Cardano through the NFT Music Marketplace working with the Humania Band - Ambassador in Indonesia to ensure all the musicians successfully debut and attract more local musicians to join Cardano through the lens of music. I believe that with the above measure, the project can scale up to effectively solve the challenges posed in the future, with the impact of this proposal I give 5 *.", "q0r": 5, "q1": "The proponent provided evidence of the relevant skills and experience required to implement the project participants' proposals in great detail. The proponent has provided a reasonable and clearly outlined budget, breaking down the items so that they are identifiable and easily verifiable. Specifics: Proposer Estimated cost $25,000 in which Marketing Indonesian Ambassador $5,000, User Interface Design for 3 months $10,000, Closing for 3 months $10,000. For each expense, the proponent has also broken down each item corresponding to each specific job in it. The proponent provided a realistic timetable for project implementation by hitting the release date milestones: Music NFT Minting Site Release Date: July 30, 2022\nMusic NFT Market Release Date: September 28, 2022\nOn board 1 ambassador by July 30, 2022: There are 5 musicians on board from East Asia before September 28, 2022. The proponent has considered the risks and proposed specific measures to address those risks to successfully implement the project. With the information given I completely agree this proposal will be successfully implemented.", "q1r": 5, "q2": "The proponent has provided an implementation roadmap with the milestones to be achieved clearly stated, the progress of the project can be checked. The proponent will measure his or her project's progress by reaching the launch date milestones of the Music NFT Minting Site, Music NFT Marketplace, featuring 5 musicians from East Asia by September 28, 2022. Yes clarity and understanding in describing the problem, and the proponent also gave specific, clear, and understandable solutions to solve the given problem. I agree that this proposal provides me with sufficient information to assess progress towards goals and I agree with 5*  for the suitability of this proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We are onboarding musicians to the Cardano blockchain by developing a music marketplace. We've partnered with the music group Humania to be ambassadors to Indonesia.", "experience": "Tobias Steffen & Sunny Basra were Integration Partner and Client Relations Managers for NFT-MAKER.\nQuintin Bray-Stone is a founder of DaBand.io\nNhan Nguyen & Tuan Pham are Software Engineers for uac.edu.au & CEO/Backend Deb for NFTjam"}