{"id": 420774, "author": "ceviteam", "title": "CEVI - INFO HUB FOR VN (EN)", "url": "https://cardano.ideascale.com/a/dtd/420774-48088", "category": 26602, "amount": 10240, "description": "Continue to develop an information hub CEVI to provide basic knowledge,update and analyze information about Crypto in general,especially focusing on the Cardano platform for the Vietnamese community.", "f6_no_assessments": 10, "f6_rating": 4.9, "videos": [], "media": [], "f6_assessments": [{"id": 1183, "q0": "\"The solution is to develop CEVI information center to provide basic knowledge, update and analyze information about Crypto in general, especially focusing on Cardano platform for the Vietnamese community.\nWith the idea of ​​building intensive channels to update information in the mother tongue to serve the needs of the majority of Vietnamese people through communication channels such as facebook, telegram, youtube, discord, I found the project clearly stated its goals. and challenges as well as having clear implementation plans.\nThe risks mentioned are all common trends of the market that have been solved by reasonable methods of communication as well as bringing deeper and broader knowledge to the community.\nThrough the presentation, I agree with the development trend of the project, hope the project succeeds\"", "q0r": 5, "q1": "The project roadmap is organized in phases each month and the tasks in each phase are also clearly listed. Through the detailed budget analysis you mentioned, I find it quite reasonable and acceptable. Your group is also introduced to 1 main member and more than 10 members on the board of management with high expertise. In my opinion, your presentation is quite good and this project is viable, with high probability of success.", "q1r": 5, "q2": "I can plainly see how the project is progressing by using statistical methods of member data, the quantity of interactions, and the metrics that are tracked and assessed weekly. I think the initiative will be successful. firmly create and broadly and profoundly spread knowledge to the community.", "q2r": 5, "assessor": "z_assessor_2216", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 2590, "q0": "The issue raised by the CEVI team is to develop the CEVI center to provide basic knowledge, update news and analyze information about Crypto in general, especially focusing on the Cardano platform for the Vietnamese community by How to create short videos from 5-15 minutes on youtube. This proposal meets the impact of the challenge. However, as far as I know in Vietnam, some communities provide information and knowledge about Cardano from basic to advanced, such as FIMI, and Cardano2vn,... are two active groups and had many results. The team can be contacted so that they can cooperate with them for better support and development.", "q0r": 5, "q1": "The proponent claims to be an investor and community manager, he has 2 years of experience with the Cardano platform, and he has a CEVI community with more than 10 people on the team. he provided reference links to demonstrate his ability and experience with a lot of Cardano videos, a youtube channel with over 19920 views, in this fund 9 he and his team submitted 2 proposals, clearly about the experience he can meet this project. Regarding the plan, he expected the project to operate in 3 months with very specific and detailed work contents. unfortunately, I don't see an expected start date, it could be from the date of submission of the proposal because he has previous videos and said he will continue to do it with or without funding he will also still do that as a positive thing, or will it start after receiving fund 9 funding? on the budget, he asked for $10240 for 12 in-depth research papers, the cost of script writing and video editing, administration of social platforms, marketing, and possible risk costs. These costs are detailed and quite reasonable. In summary, the feasibility of the proposal is good but consider the improvement I suggest.", "q1r": 5, "q2": "The auditability of the proposal is adequate. I know the correct way to track project activity and progress. here they have specific data that can be measured with subscribers, views, and new members joining groups. I know the timelines for reaching those goals. they also have weekly work reports but I don't know if this is for the catalyst team or the community. with such information, the community can easily track the ongoing progress of the project. I completely agree this proposal will be fully audited.", "q2r": 5, "assessor": "z_assessor_2323", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2644, "q0": "Vietnam is second in terms of the popularity of cryptocurrencies and ninth in terms of the population's ownership of cryptocurrencies. With a focus on spreading information about the Cardano project and the Cardano ecosystem, the project offers Vietnamese people training and experience in the field of cryptography.\n\nThe initiative creates videos for YouTube that serve as both a resource and a top-notch learning environment. Share details on Cardano and the Cardano ecosystem's projects on social media sites like Discord, Facebook, Instagram, and YouTube. comprehensive examination of Cardano ecosystem initiatives. Make a Catalyst software to instruct in the growth of PA and dReps.\n\nI assess the initiative as fulfilling Cardano's objectives for Asian ecosystem development. I was given specific instructions and aims for the 5-star project.", "q0r": 5, "q1": "The project has a three-month implementation duration. The community will continue to be satisfied by the project's operational paradigm for a very long time. The initiative, in my opinion, will be an excellent conduit for Cardano's ecosystem expansion.\n\nA detailed plan is a requirement for the project to be finished effectively and on time because each month's elements have been specifically outlined. I enjoy projects like these that have definite objectives.\n\nThe team has also calculated particular costs for contingency expenses, in-depth research articles, script writing, filming, and video editing charges for YouTube, Facebook Admin, Discord, and Youtube. each thing.\n\nThe founding team for this initiative is made up of exceptionally motivated, competent, and experienced individuals.\nIn light of the aforementioned, I give this project 5 stars. I think the project will serve as one of the settings for the development of human resources necessary for the future growth of the Cardano ecosystem.", "q1r": 5, "q2": "The team's weekly work report is used to evaluate the project's progress. This is extremely great news, and I'll be following and taking part in the project's development frequently.\nThrough channels like Youtube, Facebook, and Discord, it is simple to check the number of subscribers, views, likes, messages, posts, and comments as well as reactions to particular research papers that are being targeted.\nI already emphasized how much I value what the project will do for the Vietnamese community. I think the project will have a beneficial impact on Cardano's community development throughout Asia, particularly in Vietnam.\nGiven the information above, I give this project a five-star rating.\nWishing you luck on the project.", "q2r": 5, "assessor": "z_assessor_2327", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7130, "q0": "The idea behind it is interesting. The Vietnamese are starting to gain interest in blockchain lately, including Cardano, and I can personally attest that it’s true based on the number of proposals coming from that region in this fund compared to the previous ones. This is a very good opportunity, and by offering them a hub through platforms such as Facebook, Discord, and Youtube, the proposer aims to provide basic knowledge to the Vietnamese community to get them onboard. That being said, I am a bit disappointed that the proposer has not explicitly mentioned the insights they gained during the previous four months of operation. What can be improved, what can be changed, and how can they engage with the community better? This is very important to analyze and explain because this proposal is targeting 62x their Facebook group size (from 161 to 10,000 members) and 17x their Discord server size (from 118 to 2000 members), so their feedback is crucial in order to successfully reach this huge target.", "q0r": 4, "q1": "When it comes to feasibility, the proposed implementation plan is provided with enough details except in the budget section. The proposer has listed their profiles, and after analyzing them, I saw that the proposer has enough experience talking about blockchain-related content on their Youtube channel. I applaud the proposer’s initiative on elaborating the milestones within their timetable and planning the requested budget based on those milestones. The budget item that revolves around article creation, Youtube video production, and community management is reasonable. However, the marketing campaign might need a lot more justification. Since the proposal’s target is very high, the three marketing campaigns would be vital to the success of the project. As a result, it would be advantageous if the proposer explained that aspect in greater detail, such as what type of medium they would use to promote it and to whom they would market it. As of now, the \"how\" regarding their marketing campaigns is still vague. I am sure the proposer has some ideas on how to implement it, but I want to heavily emphasize it since the current market situation is bearish, so it is going to be harder to find new members. Another thing that could be improved is the miscellaneous and contingency costs. 1000 USD might be excessive. I would advise the proposer to exhaustively list all their non-fundamental project-related needs, such as the internet data, buffer for ADA fluctuation, etc. It’s going to look more defendable if the budget section is filled with a list of those needs instead of one huge miscellaneous item. In the end, I tend to agree with the current plan mostly because none of it contains any potential significant blockers and the previous four months of operation serve as a good knowledge base for the proposer already.", "q1r": 4, "q2": "The provided information is enough for auditing since a lot of their metrics are publicly available. The roadmap milestones are clear enough and we can objectively determine if those milestones are achieved or not because the proposer provides us with the numbers of articles and videos that are going to be produced. The proposal target is very ambitious too; 5000 subscribers and 100,000 views on Youtube, 10,000 members on Facebook, and 2000 members on Discord. We could easily monitor these numbers, but it’s odd that the proposer targets those numbers after the sixth month because the marketing campaigns only last for three months. Theoretically, once the marketing campaign ends in the third month, the growth would stagnate. I would like to see the proposer's reasoning for this.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9261, "q0": "This proposal aims to provide knowledge about the Cardano platform to the Vietnamese community through the CEVI center. they will create videos from 5-15 minutes on youtube. I think it will have a positive impact on our platform. However, the basic and up-to-date knowledge as I know Vietnam has quite a few groups providing this content. If you want to go further, I recommend that proponents look for more in-depth content such as analysis of developing projects, or perhaps collaborate with other teams for stronger development.", "q0r": 5, "q1": "The proponent has experience in updating this information to the community. he provided a link to the picture's youtube channel currently it has quite a few videos about Cardano as well as the number of channel views up to nearly 20000 views. shows that it also has a certain impact. The implementation plan of the proposal is also quite detailed. The positive thing is that the proposed activities have already been implemented. Finally, a detailed and reasonable budget is allocated.", "q1r": 5, "q2": "with this proposal, I know how to track its progress through clear quantitative indicators, with specific timelines. they have weekly reports. so I completely agree with the auditability of this proposal.", "q2r": 5, "assessor": "z_assessor_3037", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9409, "q0": "The proposer suggests to continue developing an information hub CEVI to provide basic knowledge, update and analyze information about Crypto in general, especially focusing on the Cardano platform for the Vietnamese community. The particular ways to implement the project is to create short videos on Youtube, share blockchain & Crypto basic knowledge for newbies in Discord & Facebook, analyze investment opportunities and share crypto investment experiences. This project truly addresses the challenges helping Vietnamese community, who passionate about Blockchain and Crypto but face barriers in terms of language and skills, could access the useful information of Cardano. Through these activities, the Cardano values will surely be raised and broaden in scale. The writer has had a comprehensive survey of the population of Blockchain and Crypto in Vietnamese community as well as what is needed for this community to access Cardano value. I evaluate mark 5 for this criteria.", "q0r": 5, "q1": "This project has basis to believe that it will be successful. First, the key person running this project is an investor and community manager with more than 2 years of experience on the Cardano platform. He is the founder of an Youtube channel and many other language clubs, having experience in managing at a design company, having knowledge and ability to connect and work in a team. His skill and experiences are proper to the requirement of running an information hub sharing with Vietnamese Cardano community. Second, the budget is divided into logical items for running the project. The costs include in-depth research articles; scripting, recording, editing a video on Youtube; Admins for Facebook, Discord, Youtube; Marketing; Miscellaneous expenses and contingency costs. The total budget is 1024 USD. Referring the challenges, the author admits that due to the market downtrend, the attention from the community for crypto projects is significantly less. To solve this problem, the proposer suggests to build the information Hub for target community  to bring real value to them, actively promote  on platforms such as Telegram, Facebook, Discord, Twitter to attract more attention from the community. In general, I agree with what he has described. I give mark 5 for this criteria.", "q1r": 5, "q2": "The project has clear schedule to follow. It is estimated to last in 3 months, including: creating basic functions on the Discord channel; preparation for in-depth reviews of projects on the Cardano platform; publishing in-depth reviews for the community, observing community feedback and making appropriate adjustments if needed; opening a marketing campaign on different platforms; publishing videos on Youtube providing basic instructions to the new users or upon request and feedback from the community. The main KPIs for evaluation of success are the increase number of subscribers on Youtube channel, Facebook group and Discord channel. In conclusion, the proposal is clear and easy to understand. The problem solving is good. I evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10847, "q0": "This proposal fully meets the objective of the challenge. The proposed team describes in detail the solutions that the proposal will take to educate, build and develop the Cardano community in Vietnam. Moreover, the proponent also gave specific figures to explain the importance of Cardano development in Vietnam. Vietnamese is the 21st most popular language in the world, with hundreds of millions of people, ranked 9th in the proportion of the population holding cryptocurrencies and ranked 2nd in the popularity of cryptocurrencies (according to the author's research). From this, it can be seen that the development of Cardano in Vietnam will have a strong impact on the Cardano ecosystem. The description of how the proposed solution will solve the challenge is also presented clearly and easily. ", "q0r": 5, "q1": "I greatly appreciate this part of the project. The proposed team presented an extremely detailed plan. The project will be implemented in 3 months and the work content is planned for each month. In each month, we know what tasks will be done, what value the task will bring, and how many specific numbers need to be achieved. A special feature of this project is \"After each week, the whole team meets to summarize the work done, feedback from the community and from there learn from experience to implement the work for the new week better.\" I think this is very important to make the project a success. The $10240 requested for funding is clearly and properly allocated. Finally, talking about the project members, I don't have any more questions about the project leader_Mr. Pham Tung Lam. All information is provided in full. However, the members of \"Project Executive\" have almost no information about them.", "q1r": 5, "q2": "With a detailed plan presented in the previous section, I believe \"the auditability\" of the CEVI info hub is possible. Indicators to measure project progress are very clear for each platform (Youtube channel, Facebook, Discord). Targets to be achieved (specific numbers) are also set for 3 and 6 months. To measure project progress, the proposed team will have a weekly work report. ", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11153, "q0": "Vietnam ranks 9th in percentage of population holding cryptocurrency and 2nd in popularity of cryptocurrencies. This shows that Vietnamese people are very passionate about blockchain technologies and cyptocurrencies. However, language barriers make it difficult for Vietnamese people to receive formal information and education about the blockchain technologies in general and Cardano in particular. Hence, the knowledge of the blockchain technologies and cryptocurrencies of most Vietnamese is still very vague and immature. This proposal aims to provide high quality information and education about Cardano for the community in Vietnam by using social networking platforms, such as Youtube, Facebook and Discord. The proposal will address the Challenge \" Grow East Asia, Grow Cardano \" by educating, building and developing the Vietnamese community, thereby helping the Cardano community to improve in both quantity and quality.", "q0r": 5, "q1": "In general, the participants are all experienced but don't seem to excel. With a team of more than 10 members, the project will not be short in terms of personnel. This is a good thing for the project. As can be seen, the proposal has attached a detailed plan, which includes specific timelines and work targets to be completed. Moreover,  the budget breakdown is also clear when they have estimated the cost per product. It is true that the attention from the community for crypto projects will become less as the bear cycle progresses and I agree with the solution. We should only aim for enthusiasts and lovers, not speculators. ", "q1r": 5, "q2": "Fortunately, the project is very easy to track. It could be explained that the community is free to check and audit though the Youtube channel, Facebook group and Discord channel. They are belong to the team. All the metrics and KPIs of this project can be seen by visiting these platforms. In addition, the progress of the project will be measured and communicated via the team's weekly work reports. In my opinion, the auditability of the project has reached the standard.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11470, "q0": "The problem described in this proposal is consistent with the situation of the cryptocurrency market in Vietnam. Many Vietnamese face language barriers when accessing a new field like Blockchain.\nProposes to build a community to share information about crypto, and about the Cardano ecosystem on many platforms such as youtube, Facebook, Discord, and Twitter. For Cardano, this project will help expand Cardano's reputation in the Vietnamese market. It is very valuable to Cardano's reputation and lays the groundwork for future expansion. According to my research, the group is building a language community CEVI Language Club. If this is successful it will have a huge impact on Cardano, greatly increasing the size and number of Cardano community members because the language community is huge. For Catalyst, the project will have a theme dedicated to PAs and proposal writers. This will help Catalyst have more qualified personnel.\nThe proponent has recognized the risk of investor sentiment in the bear market and proposed an appropriate solution. I think the information shared should be selected to bring a lot of value to the community, the team can cooperate with experts in the field of Blockchain to share on the youtube channel.\nFrom the above observations, it is clear that this proposal solves the requirements of the challenge.", "q0r": 5, "q1": "The project has given specific implementation progress in 3 months, the results are reviewed weekly. The process is detailed, clear, and completely doable.\nThe budget is broken down into categories accordingly.\nProponent Mr. Pham Tung Lam has experience in Cardano research, community work, and team building. In terms of personnel, I would like to see detailed information about the key members of the team. However, when joining the Discord group, I found that the leader is coordinating the work for the team quite effectively. Up to now, the youtube channel has more than 30 videos sharing knowledge about Blockchain, other platforms like Facebook discord are growing rapidly, discord channel has raised funds to maintain itself. That is a clear demonstration of the feasibility of this proposal.", "q1r": 5, "q2": "The team has given the Kpi is the number of subscribers, views, interactive reactions on social networking platforms. These metrics are completely testable. Goals are broken down into specific 3 to 6 month milestones. I think the success of the proposal can be assessed based on community interaction, the monthly user experience survey will be more objective.\nIf the project is funded, I believe they can do well.", "q2r": 5, "assessor": "z_assessor_3249", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12684, "q0": "The problem raised by the proponent is that it is necessary to continue to develop the CEVI information center to provide basic knowledge, update, and analysis of information about Crypto in general, especially focusing on the Cardano platform for the Vietnamese community. The recommended way to add value to the cardano ecosystem is to create a short video of about 5-15 minutes on Youtube Share blockchain and crypto basics for newbies in Discord & Facebook, Basic Analytics investment association, and share crypto investment experiences. CEVI Center will be a good information channel for newcomers to gain knowledge and experience about Cardano and projects on Cardano ecosystem through social networks like Youtube, Facebook, and Discord. attract attention from the community and attract more new people to join the Cardano ecosystem thereby contributing to the promotion of the Cardano ecosystem and attracting users from other Blockchain platforms. therefore I completely agree that this proposal effectively solves the challenge. I agree with 5* for the impact of this proposal.", "q0r": 5, "q1": "The proponent said that the team members include: Project Leader - Mr. Pham Tung Lam Investor and a community manager with more than 2 years of experience on the Cardano platform. Founder of youtube channel working on blockchain knowledge. Having management experience at a design company in Japan. Founder of CEVI Group, CEVI Club, CEVI Language Club. has the Ability to connect and work in a team and 10+ members of executive team CEVI, has experience and knowledge (including information, administration, marketing, human resources, community governance, international relations, and training. PA, proposal writing training. also provided links to verify team members' experiences. Proponents have requested $10240 for the project, of which the cost of the Research Papers is 1440$, the Cost of scripting, shooting, and editing videos on Youtube $3000, the cost for Facebook Admin, Discord, Youtube $2400, Marketing $2400, Other expenses and contingencies: 1000$ These costs have all been broken down, clearly outlined and can be determined. The actual timetable for implementing the project is given by the proponent for 3 months. Specific working plans for each month are given in detail, look at them to be able to determine the progress of the project. After each week, the team members will meet to summarize the work done, Feedback from the community, and from there draw lessons to implement the work for the new week better. The proponent has also considered the possible risk and has a plan to deal with it, so I strongly agree that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proponent designs a 6-month implementation roadmap and identifies milestones and timelines for achievement to make it easier to audit the proposal. When the project is implemented, it will help the cardano community in Vietnam have one more useful and reliable information channel. the progress of the project is measured through the number of subscribers, the number of views, the number of likes on the youtube channel; the number of members, the number of posts & comments, and a number of reactions to in-depth research articles on Facebook. the number of members, the number of messages, and the number of reactions on the Discord channel on On Discord are good and suitable indicators to measure success. There is clarity in the description of the problem, the solution, and the way the proposal is presented which is appropriate and easy to understand. I fully agree that this recommendation provides me with enough information to gauge progress towards goals.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "\nCreate short videos about 5-15 minutes on Youtube.\nShare blockchain & Crypto basic knowledge for newbies in Discord & Facebook\nAnalyze investment opportunities and share crypto investment experiences\n", "experience": "\nCommunity manager and investor with 2+ years experience on the Cardano platform\nYoutuber 1 year+ experience sharing Crypto Investment Knowledge\nFounders CEVI group, operates on the Discord & Facebook platform.\n"}