{"id": 420823, "author": "sonny.dhamayana", "title": "Trust & Transparent News Portal", "url": "https://cardano.ideascale.com/a/dtd/420823-48088", "category": 26602, "amount": 15000, "description": "The main challenges come up and most facing by growth and development country are trust and transparent journalism information which free from propaganda, hatespeech, false information, etc.", "f6_no_assessments": 10, "f6_rating": 2.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2591, "q0": "\"The problem proposed by the proposed group reflects the current reality of non-transparent media information, bad information technology, misinformation, etc. going on in developing countries. There is too much unverified conflicting information, information can be misdirected.  Development of Trust, Transparent, and Hatespeech free News Portal with integration between AI-NLP Model and Blockchain Technology as part of Journalism Trust Initiative and Reporter Without Border Initiative can solve this problem, which increases the applicability of blockchain to life on the Cardano Ecosystem that will support help prevent the spread of misinformation to the news media for reliable information.\nMoreover, all authenticated news can be encrypted, reflecting the necessity of blockchain and enhancing its application in real life. this will have a positive effect on our blockchain platform by increasing engagement from the community. This proposal focuses on developing countries, in East Asia, there are many countries in this category. In addition, the Proposing Team is quite knowledgeable in this field, they have recognized the risks and have solutions to limit them. In short, the impact of the proposal is good, but if the proponent focuses on clarifying the central goal of the East Asia region, the proposal will be more perfect.\"", "q0r": 4, "q1": "\"The proposed group claims to have experience related to \"BSc in Industrial Technology\nPost Graduate in Artificial Intelligence and Deep Learning\nPost Graduate in Cloud Computing\nPost Graduate in Digital Marketing\nCertified Diploma Blockchain Technology Development\n5+ years Experience in AI Project & Blockchain Technology Development\" would be great if they leave links to products that prove their capabilities and experience in practice. Also with the information given I don't know what is their relationship with our Cardano blockchain? Why do they choose to develop and develop on our blockchain platform and not another platform for example they say they have experience with BSC? Project development is listed into 9 stages phase 1 through the fund 9 goals of this phase are \"Development of AI Validator Model for Text, Audio and Content Information Video\" it's pretty abstract to understand. If possible, I hope the proponent can explain more about the technical solution of this model. furthermore, I would like to have an estimated start date and what is their expected date of completion \"This phase will include through Fund 09\" which is very general. fund9 starts on June 1st and ends on August 31st? And finally about the budget they ask for $15000 for \" US $2,500 Text Validator\nThe US $5,000 Audio Authenticator\nVideo Content Validator US $7,500\" It should be more specifically defined as what a text validator does, how many people do it, how long it takes, per working hour or per How much is a research content corresponding to the amount of money. then it will determine whether the requested budget is reasonable, or even if the budget number meets the requirements of the project. Due to the lack of detailed information above, I advise the exporter to clarify it and return to the fund later to increase the feasibility of the project.\"", "q1r": 3, "q2": "Regarding the auditability as mentioned in the feasibility, this project has not provided specific timelines for the implementation of the proposal. the metrics to measure are \"AI NLP News Validator\nSmart contract development\nIntegrated system\nSystem check cycle\nFull live cycle\" should have quantitative analysis numbers to see if the project is working, how it is progressing, and whether it is meeting the original goals. Where can I check that progress through? in short, I ask the proponent to provide more clarity on how to audit this project sorry I disagree.", "q2r": 2, "assessor": "z_assessor_2323", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "thank you for the valueable feedback"}, {"id": 4449, "q0": "Personally I loved this proposal as an idea. But then, as PA I do need to cross check if this proposal will have a high impact in our Cardano Ecosystem. Since Proposer didn't mention any Cardano ecosystem and any region in East Asia, for me this proposal didn't aligned with the campaign brief. I think this proposal is better for \"Film + Media (FAM) Creatives Unite\" Challenge. We hope this proposal have a chance in Fund 10, if the FAM challenge approve by the community.", "q0r": 2, "q1": "Proposer provide their work stages (Stages 1-9), but it doesn't have any precise time. It will be better to add time in the stages. Example: Stage 1 will be done on 2 weeks, Stage 2 can be done on 1 month, etc. If proposer can provide detail time, we as community can predict if this proposal can be done in specific time. But anyway, those stages explanation in proposal are already great too!\n\nThe budgets are still just for stage 1. What about Stage 2-9? If proposer only ask for initial funding, Proposer can inform us too in the proposal. It will be nice if Proposer tell us the entire budget, then tell us (community) that \"Team will ask for another funding in next round.\"\n\nWe will not doubt the experience that the Proposer and team members have. But as we assess this proposal, We need to cross check your experience too. Any links or references such as LinkedIn profiles or Github will be nice. Next time try to complete your proposal with that.", "q1r": 2, "q2": "As a Project, it is good to have success metrics. So Team and outside communities can check the progress of this proposal. But the main thing in the Auditability are \"How community can check / audit the progress publicly.\" Next time, Proposer can create github and put it in the proposal. If the github are too detail for public, Proposer could create Google Spreadsheet and give the link in this proposal. That would be great!", "q2r": 3, "assessor": "z_assessor_2553", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Thank you for the highly resoucefull feedback. Basically 1st idea we want to go for Media Challenge, but since the initiative background not just only related the media but related inlined with SDG Goals Ensure especially  equal opportunity and reduce inequalities of outcome, including by eliminating discriminatory laws, policies and practices and promoting appropriate legislation, policies and action in information, we have changed it to \"Growth East Asia\". But Since this project divide in stages there are possibility some stages will go as relevant challenges including \"Governance Challenge\" when it come to Smart Contract Development which involved Governance, Trustee Validator, Trustee Auditor.\nMeanwhile for detail Work Breakdown Structures and detailed budget as briefly with current available resources our budget as below :\nPM     : US$ 24 /hr  \nAdvisor : US 23 /hr\nFull Stack Engineer : US$ 18 /hr\nAI Developer 1: US$ 15 /hr\nAI Developer 2 : US$ 15/hr\nDuration of AI Validator Development including Text Report, Audio, and Video will be approximate 8 - 12 weeks. \nFor our experiences related AI field can go through website  https://www.crisprsys.com/\nFor Auditability its good feedback, but we have the problem since some of algorithm has potential protected by copyright. And we will open our github specific for this project as public."}, {"id": 5521, "q0": "I like the idea of spreading free news to the people, moreover the news coming from the genuine source or transparent. From my point of view the intension to distant people from the false global journalism is very important and not in East Asia only but for all over the globe. \n\nThe effectivity of this idea is not align very well with the challenge brief. As far as i understand, the project here would consist the idea on growing up cardano in East Asia. For the same objective, i would suggest that the proposer to create or translate the News portal into the local language. For example in Malaysia most of them are using Malay and in Laos they use Lao. With this combination of idea the proposal would be good enough. ", "q0r": 2, "q1": "The Team provide us with stages of development in order to make this project success. What i missed was the roadmap time line. There is no indication or expected when the stages will get done. The only time stated is next fund. Why would the team has to wait for the next fund if you can asking for the total fund in this Fund 09, and focus to the News Portal. \n\nOne more thing to be added is the detail about the team members. I have go thru the website in the link provided in it was not very helpful finding your team members background and contacts. I would suggest that every team members provide the linkedin profile as it would be necessary in the future.\n\n", "q1r": 2, "q2": "The information is provided but was not sufficient. I have to google The team members in order to know their background. There is some of the members with linkedin but not provided in the proposal.\n\nAs i mention before the milestone is not stated clearly and we dont even know when is the stages is ready.", "q2r": 2, "assessor": "z_assessor_2706", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Thank you for very wonderfull feedback. Basically the idea mostly closed to the East Asia Challenges especially if we cross reference with the SDG Goals - educe inequality within and among countries especially related to the information. Why we bring it as part of East Asia Growth, since East Asia has very high potential of economic growth and most of the case has been disrupted with non productive activity due to false spread information. Further when the full live News Portal DAO, we will go further for each country as part of scale up the ecosystem. \nThe reason why we're not directly full funding due to complexity of the development activity and we need to ensure each part of the WBS has meet the minimum requirements before full system will be live. \nThe feed back for detailed team member will be part of our follow up.\n"}, {"id": 5683, "q0": "We understand from the onset the idea behind the project. A platform that would serve as a watchdog against propaganda, hate news and support prevention of viral spread of disinformation. Given the number of people who turn to media for information on almost all topics; and especially on blockchain, where there has been biases from the media against blockchain. Therefore, I foresee a lot of potential with this project, especially in supporting the advocacy for blockchain and ensuring that the information on blockchain and other topics  in the news media are accurate and reliable information. What’s the value preposition to the grow Cardano and grow Asia challenge setting ? The only value addition to the ecosystem is that, this project would improve the lives of people by ensuring that true and accurate news reportage on blockchain  is presented in a way that affect lives positively. Aside that, we also consider the development of a utility token on the Cardano ecosystem a plus in helping advance the adoption of the Cardano Network across Asia.", "q0r": 4, "q1": "The information presented here shows that more detail is required to improve the feasibility of the project. It is clear from the roadmap what the work structure is. With the detailed information presented on the roadmap, we know the appropriate activities to be done towards the overall project implementation. This comes with specified timeframe for the events mentioned. Considering the nature of the project, I think the roadmap is well designed to complement the expertise and effort of the team. Already all the appropriate relevant risks are outlined with the appropriate solutions to mitigate them. Again, my first observation about the budget is the absence of a team cost, miscellaneous expenses and any contingency amount. The team could consider including these items to enhance the framework of the project. Other than that, I am satisfied with the budget, very brief with the needed details of the various items. In my view, the amount allocation is consistent with the market prices and fairly moderate. The only positive with the team experience is the information specifying the roles for each team member in the implementation process. Apart from that , the proposer presents a team of  3 people without any significant work experience in the media space and other work field. In relation to the overall objective of this project, I am not convinced  that the proponents presented sufficient work expertise and experience relevant to the project. The proponent also failed to provide supporting documents that serve as sources to confirm their credentials. ", "q1r": 3, "q2": "Base on what’s presented on the project, it is possible to  audit the process, especially taking into account the extensive details made available on the feasibility of the activities to be done towards project completion. From the script, we know the KPIs here but in my opinion, these KPIs could be improved to include, the number of false reportage reported, the number of audience reached via the reportage and a few others. The proposer could have also assigned specific milestones to these KPIs to simplify the assessment of the project’s performance. The missing element here is mechanism to get information on these parameters. Aside that, I wish the proposer specified how the Cardano community could have access to such information. Just as providing the approach to monitoring the project, it is also required  that we know how to undertake the monitoring. ", "q2r": 3, "assessor": "z_assessor_2734", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the enlightened feed back. The value preposition as part of Grow Cardano and Grow East Asia not only related improve lives, since this ecosystem will go for DAO which will bring Watch-Enjoy-Reviewed-Owned experiences. More-over the development not just go for NFT Token distribution, we will go beyond that by raising Utility Token and Security Token as part of investment  platform. (detailed showcase will presented during Fund09 IdeaScale Fest).\nThank you for the feed back for improvement of KPI reporting, we will look furhter weather will go for github or our own platform as dashboard monitoring.\n"}, {"id": 9262, "q0": "The proposal talks about creating a free, trusted portal with the integration of Cardano's AI-NLP Model and Blockchain Technology. This proposal will enhance the applicability of Cardano to life. however, if the proposal focuses on showing its impact in East Asia, it would be more appropriate. Although the target audience in developing countries, there are many countries in this area in East Asia.", "q0r": 4, "q1": "The team says that they have a lot of blockchain-related experience. Unfortunately, I don't see any links or actual products that have been successfully implemented by them attached here to prove their competence. Other than that I don't see how they've had any experience with Cardano. about the roadmap they say that this proposal is for fund 9. however with the information provided it is quite abstract. I recommend the proponent should explain in more detail and it should have more specific milestones. Finally, the budget is divided into sections, but it cannot be evaluated for reasonableness. What is a text verifier, what is the content to be achieved, how many reports does it have for example a sheet of A4? and what the audio validator is about. it's a minute or 10-hour recording. same with video. it should be shown in more detail. In short, I am not sure if the project can be successfully implemented this project.", "q1r": 3, "q2": "The proposal does not have specific timelines for its implementation. In addition, the definition of success is quite general and there are no quantitative indicators to measure. furthermore there is no information on how it is done and where and through what people can check it. Proponents should provide a roadmap with milestones that more specifically define what the outcome should be. how will it be checked, where, do they have periodic reports with the IOG as well as the community?...", "q2r": 2, "assessor": "z_assessor_3037", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for kind feedback. Basically we have develop the text validator as part segmentation hatespeech, further scale up to identified and segment the text report for propaganda, negative contents, false information, etc. More challenge is related the audio segmentation, since there are news reporting which content with audio, so the AI model need to convert this to text before processing. More higher challenge will be content with audio and video which not required only segmentation thorugh text but also image analysis.\nThe feedback related the specific timelines and auditability will be shared through github or our web portal at https://www.crisprsys.com/"}, {"id": 9352, "q0": "\"AI can also make it easier for newsrooms to censor comments by readers by automatically reviewing non-infringing content and flagging content that violates editorial rules.\nBesides AI, Blockchain technology is being tested by some news agencies such as New York Times, Forbes, AP to authenticate content. This technology helps to store data in the form of Metadata including the time and location of the photo, video, post, who performed the action, how it was done, and when the information was edited and published.. ., thereby transparent information about copyright, recognition, thereby increasing the trust of readers and promoting the capacity of genuine journalists. Therefore, I strongly support the idea of ​​the project. However, I see that your solution description is not detailed, your mechanism of action is not described how. Hope the project will stay implemented is not just an idea.\"", "q0r": 4, "q1": "This part of your group is sketchy. In the proposal, 9 stages of development are outlined. The budget analysis is only for phase 1. In addition, the team members include 8 people, but not all information is listed. I rate 3 stars.", "q1r": 3, "q2": "It is proposed that there is no weekly or monthly work progress report. You have indicated only 5 project reporting progress measures. I have not seen your goals, clear roadmap to measure the success of the project. Overall, with my personal opinion this part is not appreciated, not convinced me yet.", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Thank you for informative feedback. As brief the stage 1 will be part of main trusted News Portal DAO which will not bring transparent information but also economic related to data information to community. \nAnd thank you for the hihlighting for sketchy group and budget analysis, we have accomodate the detail part as WBS under our current work planned development. "}, {"id": 11010, "q0": "This proposal, as the first part of other proposals in the future, is aiming at the success of making an audio, video, and text validator for a news portal which is free from propaganda, hate speech, and false information. And presumably, by having the news portal, it will add value to the Cardano ecosystem. At this point I still have no clue if the metrics or KPI that are going to be used to measure the success is aligned with the growth of the Cardano ecosystem in East Asia. \n\nThe solution presented in this proposal is basically just an idea of how reliable journalism should be by utilizing AI and blockchain technology. It is not clear how having a reliable news portal on the internet will bring a desirable impact in creating awareness about Cardano to the people living in East Asia simply because I do not see any evidence of participation from the Cardano community.\n\nWe need further explanation on how or what mechanism is going to be used to tokenize the validated news and why tokenizing the news will bring a solution to the problem given in this proposal.\n", "q0r": 2, "q1": "Unfortunately this proposal does not provide us with verifiable credentials of the team behind the project. There are no available links to any educational  backgrounds and working experiences, nor any links to portfolios and repositories on Github to prove the capability of the team.\n\nThis proposed project will be implementing highly sophisticated technologies from AI to blockchain developments, thus requiring specific technological and scientific expertise. There should be many portfolios and repositories of what the team members have achieved or built in the past. Why there is not any one of them presented in the proposal, is a big question for me. So, in this respect, I highly doubt this proposal will be implemented successfully.\n", "q1r": 1, "q2": "The proposal only indicates the plan as milestones to be audited without giving the clear time horizon for achievement and does not give any public channels for delivering regular updates to the community.\n\nFinally, the main consideration here is that this proposal does not not convey who and how qualified the people behind the project are, and how the deliverables and their metrics of KPI will add value to the Cardano community in East Asia.\n", "q2r": 1, "assessor": "z_assessor_3214", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thank you very much for the highlighting feedback. Its understandable that it will bring doubt related how the ecosystem will worked. This 1st stage basically will be part of trustee validator sidechain which will worked to validate any news reporting submit by registered reporter. The main outcome is Trustee News Portal Decentralized Autonomous Organization. The 2nd stage which will covered smart cotract development which involeved alot of party will bring more pictures where the proposal will going further. We will presented the main pictures including utilization of NFT, Utility Token and Security token as part of tokenomic under Cardano Ecosystem in Fund 09 IdeaScale Fest. Hopefully will bring the more pictures.\nAnd as AI technolgy having some copyright issue, we have try to limit our self not to exposed any related copyright during this stage, but we will exposed the  milestiones and KPI in our github or our public website. (https://www.crisprsys.com/) "}, {"id": 11154, "q0": "The proposal aims to support of prevention of viral spread of disinformation turn to the news media for reliable information by integrating development between AI-NLP model and blockchain technology as part of the borderless reporters and journalists trust initiative. This will prevent the spread of false information to the medias. To be honest, the proposal doesn't really fit the Challenge \" Grow East Asia, Grow Cardano \". The proposed team need to be more specific about who they will target and how the project will work to prevent miscommunication. The proposed solution the team provided is really vague and I don't really understand how it will solve the problem. ", "q0r": 2, "q1": "The proposal did not provide any information about the project participants other than their names and job positions. They didn't even include a resume. It will be more reliable if they provide a little information about their past experience and projects of each member. It's good that the team gives a whole project roadmap. However, the given plan is too vague because it does not clearly identify the deliverables at each stage in the roadmap. Moreover, the proposal didn't even provide a timeline for the first stage. Beside that, I suggest that the proponent should have a more specific description of the expenses because voters want to feel reassured that the proposed funds will be used appropriately.", "q1r": 1, "q2": "It is good that the proposed team provided a website which is belong to the team. For my part, this section is also too general and not specific. It could be explained that there is no specific metrics. The metrics are essential because they help voters know whether the project is well implemented or not. In addition, the proposal does not provide a timeline that makes the project even more difficult to track and audit. Overall, the auditability of the project needs to be improved if it wants to receive a lot of support from voters.", "q2r": 2, "assessor": "z_assessor_3225", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for the straighforward feedback. As principle this trust news portal not only going to eliminate spead of viral information bt also going to become bring the economic to the community (detailed will be presented during IdeaFest). Since any valuable report will get reward through watch-enjoyed-reviewed-owned/ earned. \nSince these stages is the 1st stages from main project as News Portal DAO, basically we still not showed the full capacity of the teams. During the 2nd stages mostly all the consolidated team will come up since development smart contract will involved multi trustee party.\nFor KPI metrics for AI Development basically as standard metrics but since some items have conflicting with copyright, we still working out to put as much simplified information as part auditable KPI in our portal or github."}, {"id": 11712, "q0": "The proposal addresses a well known problem that is journalism, which is especially relatable to the crypto industry. However, it is understood that the proposer specified that the focus is more on science news at first, and I believe that they will expand the scope out later on. Thinking wider and making further assumptions of how the project is aligned, it is unclear if this project will actually add value to the cardano ecosystem specifically, and i have reservations assuming that people using the up and coming news portal will understand what's going on backend, where the team is using cardano as a blockchain to ensure transparent journalism. I'm just not sure if the public will actually be educated on cardano and blockchains as a whole when consuming media off this transparent platform.\n\nAt first glance, it is difficult to relate this proposal to the overarching goals of this challenge as a whole, though it aligns with goal 3 of the fund 9 strategic goals. in the problem statement, i believe the proposer is trying to express that the problem of propaganda, hatespeech, false information is mostly faced by developing countries. the fact is arguable but that's not the point of the assessment. it's that, the solution proposed here seems to be intended to be use for a global audience, where the proposal hardly (in fact, never) mentioned Asia in this proposal. I would suggest for it to be placed under the challenge of dapps, products, and integrations instead. \n\nthe proposal mentions that \"development of integration between AI-NLP Model and Blockchain Technology will support of prevention of viral spread of disinformation\". \n1. it would be helpful to clarify and elaborate more on how this will happen with examples. what is this to-be-developed AI-natural language processing algorithem supposed to do? the proposal only says \"AI Validator for Image and Video contents\" and \"AI NLP News validator\". what would this mean in real terms? weed out keywords in relation to certain countries? create a narrative? correlate images to a source? as a layman, i cannot seem to understand how and what this AI will do.\n2. it would help to specify that NLP stands for natural language processing, if that really is the case, so that readers are able to google the term and understand it, rather than assuming everyone would know what NLP is. ", "q0r": 2, "q1": "I cannot say with confidence that I understand enough details to say this project is feasible. The proposal only provides very basic information, insufficient to make an assessment.\n1. they broke down development into 9 stages, with very little description to each. if the project was to use AI-NLP to deliver accurate news source, what is the development of smart contract going to be used for? what is the use case then, of tokenizing a news?  what does it mean then, if a news cannot be tampered with? OR... if the smart contract is to be used for their utility and security token, great. then in this case, do elaborate on why a transparent news portal requires these economics? is it for funding? governance? this should have been addressed in the impact section, but since they mentioned smart contracts only in the feasibility section, i'll just mention this comment here.\n2. budget breakdown was too vague to justify the amount as well. we do not know if its an individual or a team working on each validator described. neither were any tools used discussed, nor rates. i cannot find justification for the requested funding amount. \n3. the roles of the team involvement in the project is mentioned, but thats about it. it would be helpful to see the team's past track record to determine their credibility to assess if the project can be delivered. this was also addressed in a comment but not worked on by the proposer.", "q1r": 2, "q2": "again, this section is very vague. To track project progress, the proposal states only the desired stages of development milestones. This is not time bound. By when should these phases be completed? Also, lets say the AI NLP News validator is complete, how will they communicate this to the catalyst community? of course, writing it on a page or website to say \"its done\" is not enough for something as intangible and abstract as this. \n\nfor future funds, would suggest for the proposing team to time bound the goals, and to discover an appropriate medium to show that their algorithm is complete. typically, a github repo for the community to check through would be desirable as a basic means of auditability, but i'm not technical person, just my 2 cents.", "q2r": 2, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for the valuable input and feedback. Basically as the whole proposed ecosystem will going further as DAO. And previously we planned to registered as suggested, but after further discussion since this project has divide to several stages, the closest challenge of this 1st stages in under East Asia Goals, since this 1st AI Validator development stages will impact to the success of delivery outcome of Trustee Validator Party Sidechain as part of Trustee and Transparent News Portal DAO. \nIn AI Validator prespective, as brief further our internal research and observation that reporting content available currently in 3 mode : text format, audio format, and AV (Audio Video format). The outcome of this News portal not only accept news or information report in text format only, but also in audio and video format. Our target is this DAO can reach many audiences including \"Disabled Persons\", as our compliance to SDG Goals in equality of the information without bias. \nThe next development of Smart Contract is to develop the DAO Ecosystem, during this stage we will reviewed again in which challenge we will registered for funding. For detailing the AI Development basically we have the templated KPI report, but since for this project some items potential conflicting with copyright currently we still modified and will publish in our portal or github."}, {"id": 13838, "q0": "Integrating blockchain technology to journalism sounds interesting and appealing but it might hide an idealistic and naive approach to human communication. Blockchain is the transparency technology. Its assets were developed to improve and enhance human transactions. Imagining the possibility of integrating blockchain to journalism seems the reasonable next step, being journalism so questioned for their scarce transparency and questioned commitment. Nevertheless, believing that we can model and create somehow a “Real Journalism” that would be Transparent and True can be dangerous from a philosophical point of view. Fake news and politically engaged journalism has existed since time began. Only Democratic Republics have developed a system where Journalism is supposed to question the established power in order to make the democratic system work more efficiently. This evolution in human systems is amazing but is still human and flawfull. Intending to create a system where only Truth and Transparency are allowed sounds very much to fascists regimes that claim to have the Only and Real Truth. This idealism is super dangerous. It is preferable to leave the choice of believing whatever they want to believe to people. They have the real power to freely choose what they consider is true or not, and transparent or not. \n\nOn the other hand, this proposal does not fit into the Grow East Asia, Grow Cardano challenge. It would fit better in the Dapp, Products and Integration challenge as this might be a profitable product for the Cardano Catalyst. If it is achieved to produce a free hate speech as they claim to do, this would be appealing and attractive for many users that are looking for reliable information portals. This will certainly bring value and would bring newcomers and enhance dynamics and transactions within the Cardano Catalyst Community.\n", "q0r": 2, "q1": "Team members are experienced in software and blockchain development but there is no journalist integrated between them. This might be the biggest hurdle this team is facing in order to implement their proposal successfully. Having a journalist in their team will help them understand better journalist methods and procedures and will help them build the information portal they are aiming to build. Key milestones and budget breakdown are detailed and specified but there still is a philosophical problem with the first stage that would actually impact the proposal feasibility. How would the Content Validator? With which reference? This is at least problematic. Further work and investigation together with a journalism expert might be needed in order to this proposal be implemented successfully. ", "q1r": 3, "q2": "Milestones presented to sufficiently audit the progress and success of the proposal are enough although there is lacking a strong communication channel within the Cardano Catalyst in order to correctly share information. This was certainly overlooked and would need further planning for a compliant auditability process. ", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Thank you for valueable feedback, Basically if we just looking as part of application this project will go fordApps, but further our internal discussion since this platform is not just ordinary dApps and going further as DAO and this project also divide as stages, the closest challenges we get is East Asia Growth. With the reason that the 1st stage development as part of Trustee News Validator Agency within DAO (detailed will presented during IdeaFest). Further the problem with current traditional journalistic or reporting product, everything rely on to the maturity of reader, and the news portal still not mentioned fully information category of their reporting. The impact is sometimes the revised reporting has been too late to reduced the damage from the false information which has been spread. With this News DAO portal at least audience have option to get trust transparent news portal meanwhile in other terms they could go through journey watch/ listen - enjoyed - reviewed - owned/ earned experiences.  "}], "solution": "Development of Trust, Transparent and Hatespeech free News Portal with integration between AI-NLP Model and Blockchain Technology as part of Journalism Trust Initiative and Reporter Without Border.", "experience": "\nBSc in Industrial Technology\nPost Graduate in Artificial Intelligenced and Deep Learning\nPost Graduate in Cloud Computing\nPost Graduate in Digital Marketing\nCertified Diploma Blockchain Technology Development\n5+ years Experiences in AI Project & Blockchain Technology Development\n"}