{"id": 421654, "author": "xuanle.752020", "title": "Crypto Tik Tok Channel for Youth", "url": "https://cardano.ideascale.com/a/dtd/421654-48088", "category": 26602, "amount": 14700, "description": "Knowledge about Blockchain and Crypto is quite novel and confusing for young people. Build a TikTok channel to help them to easily access and participate in both Blockchain, Crypto as well as Cardano.", "f6_no_assessments": 17, "f6_rating": 4.6078431372549025, "videos": [], "media": [], "f6_assessments": [{"id": 4413, "q0": "The proposal is a way to introduce blockchain and crypto Cardano to young people, building on the Tik Tok channel makes people more interested in accessing Cardano blockchain knowledge (which is not easy to understand). The proposal to address the goal set in the Challenge is to grow and develop Cardano. Contributing to the knowledge of people in East Asia is indirectly contributing to the development of East Asia. Thus, the proposal is both beneficial for East Asia and adds value to the Cardano ecosystem. I support this interesting creative proposal. In addition, I also support that you broadcast a Livestream with the participation of experts in the field of cryptocurrency, although the idea of ​​live-streaming is not new, it still has a certain effect on the community. I'm thinking about being able to scale and address the future challenge of the proposal. Can you be more specific about this? Concretize for future expansion if the proposal is successfully applied in practice? If this point is clarified, the impact of the proposal will be very clear to the community and attract more attention. I hope you will seriously consider my positive feedback to make it more impactful. I vote 4 stars.", "q0r": 4, "q1": "You are a famous person in the literary and media world of Vietnam, especially young Vietnamese know a lot about you, you also have experience with the Cardano blockchain and Catalyst from Fund 8. Therefore. it is reasonable for you to build a Tik Tok channel with the topic of the Cardano blockchain. What I strongly agree with is making your link and website public to the community. It increases the community's credibility and trust in you and the feasibility of this thread. The number of team members I know for sure is more than one person (Ms. LengKeng) because you have a team behind that specializes in doing the same job (as stated in the proposal). It is a guarantee of the feasibility of the proposal when applied in practice. The budget is reasonably divided into the goals and stages to make Tik Tok videos and livestreams, which are very familiar jobs for you. I think the community will believe it when it sees you and your team working at their professional forte for so long. Regarding the budget, I have a question, if you have not received Catalyst funding in Fund 9, will you continue to implement the proposal? Or are there other sources of funding to implement this proposal? The plan, as well as the implementation method, has been fully stated in the proposal. Along with the necessary resources to perform, human resources seem to be adequate because you have a team to perform together. In terms of technology and technology, Cardano blockchain is knowledge about new technology appearing in the world compared to other technology platforms, you think you will be confident enough to deploy Tik Tok videos about Cardano blockchain? If you have a difficult technical problem, the team can invite experts to do a Livestream to better answer the technology. So is the content of these Q&A sessions similar or different from the content of Tik Tok videos? And how do make your Tik Tok videos stand out from other Tik Tok videos in the same market? I advise the team to promote more marketing and communication activities so that more and more people know about Ms. LengKeng's Tik Tok (not only thanks to KOLs). This is also in line with your knack for communication. These questions and suggestions of mine are for inquiry and constructive feedback. I would love to give suggestions to make the proposal more perfect. The team has outlined the possible risks in the implementation process - I find that reasonable especially given the solutions offered. I vote 4 stars.", "q1r": 4, "q2": "You've put in place milestones when you do. Hereby I would like to suggest that these milestones can be attached to the months of the year so that the community can easily monitor and evaluate transparency and auditability. What I find satisfying here is that you have mentioned the KPI performance indicator which is calculated by the number of viewers and participants. This is exactly because when a proposal requires high community interaction like yours, it requires the participation of everyone in the community. Only then can the success of the proposal be assessed. From the moment I first read the proposal, I found it to be quite practical, doable, and easy to come to life. However, if you can provide additional key metrics, it is great for the transparency of this proposal. Throughout the proposal, the problem was clearly and easily described, and the solution was attached. In short, I support you with this very implementation. I hope it will be successful to bring Vietnamese youth more knowledge about Cardano blockchain and cryptocurrency. Good luck. Based on the foregoing and additional comments, I agree with the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14347, "q0": "\nThe project focuses on young people, a large number of people, eager to learn and like new things. Involving them in the Cardano community is highly recommended. So that the next generation of Cardano will have more breakthroughs, more creativity and contribute more to the Cardano community. The proposal is also quite reasonable when raising the issue of blockchain or cardano documents, which are now quite lengthy and complicated, making young people hesitant to approach. So surely, if the content direction is short, easy to understand and fun, it will attract a lot of newcomers to the ecosystem. Moreover, the tiktok platform has many limitations, but it is growing fast, the viewership is large, so more and more meaningful content is being deployed, especially for young people. It is clear that to reach young people, you need content that they can easily absorb.", "q0r": 5, "q1": "Actually in my opinion this is a project that is not difficult to implement especially as I see the proponent is someone who already has quite a few channels of communication with more than 600,000 followers. She is also a longtime online content creator. Setting up a new channel about Blockchain and Cardano can certainly pull in the first number of followers. What's more interesting is that the person sharing on these channels is a girl who is also quite young and has a lot of support, which will attract more attention of the Cardano community both inside and out. Although I understand that she has already established some channels, her team will be very good, but if she showed more details about the other members' profiles, it would be more convincing. Especially, this is also the smart thing of the author when the channel solution is included, there will be other Cardano experts in Vietnam. That just helps the interesting channel to be less boring because of its prestige and ensures more professionalism.", "q1r": 5, "q2": " \nThe proposal gives some fairly easy to understand indicators to evaluate the success of the project such as the number of viewers, the number of followers increased. As a media person, I understand that the number of views may not reflect all, but the number of likes and comments can also show not only the quantity but also the quality of the product. The amount and KPI given are quite reasonable to evaluate the project.\nIn general, the numbers on social media are always transparent and accessible to anyone.\nI appreciate that the team took advantage of the their existing filming equipment for the project, it demonstrates the team's desire to contribute.", "q2r": 5, "assessor": "z_assessor_3994", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14082, "q0": "The proposal presents clearly but only partially meets Cardano's goal of increasing the ecosystem value of Cardano, which is only aimed at Gen Z youth (11 years old to 27 years old), but in fact the age of knowledgeable people and using digital currency a lot in the age of gen Y (28 years old to 42 years old) in the Vietnamese community. So in order to develop the community, it is necessary to expand the age of interaction", "q0r": 4, "q1": "The probability of success according to the proposed content is high because the proponent already has a personal page with a high following. However, the Telegram group of 1500 people is very small, it is necessary to increase the number of people on this application.\nThe content on the videos has not been specifically mentioned, in more detail, for example, how many videos talk about the approach, use, risks when participating in the digital market, how many videos introduce the ecosystem of the company. Cardano. Are the participants in writing and exchanging articles capable and qualified to convey the content and values that Cardano desires? Is the video content attractive enough to attract the community? More issues need to be clarified before deciding on funding.\nAdditional community bonus recommendations can be considered if you participate in learning about Cardano through a quiz with a score of 100/100, 10 ADA bonus will be transferred to an ADA-linked wallet account.", "q1r": 4, "q2": "The proposal is presented transparently, clearly, has a specific time frame and has an evaluation KPI over 12 weeks, in line with the stated challenge. However, the project has not mentioned how to maintain the community that has been built after 12 weeks? This will be very wasteful, so it is necessary to calculate the cost of maintaining and developing this community in the long run by paying the team to do it with a minimum amount of money.", "q2r": 4, "assessor": "z_assessor_3896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12687, "q0": "The problem raised by the proponent is that Blockchain and Crypto knowledge is still quite new and confusing for young people, The knowledge about cryptocurrency and blockchain is being given to the public in a rather lengthy way, theoretical and less attractive. Young people all have prejudices about speculation and scams of the crypto channels. The proposed way to add value to the Cardano ecosystem is to build a TikTok channel with videos with short content from 1-3 minutes. Using KOL's reputation as an investment specialist to easily reach the mass community. Host live streams with blockchain and crypto experts to make it easy for them to access and participate in both blockchains, Crypto is like Cardano. The measure proposed by the proponents is that they will provide knowledge about cryptocurrencies and blockchain in a simpler, more fun, more concise way, making it easier for young people to access and participate in both Blockchain, Crypto as well as Cardano. Take advantage of the Tik Tok boom with short, lively, accessible videos, in this project. making clips for the purpose of guiding, sharing information, career orientation, and supporting young people to avoid unnecessary risks. This project will provide high-quality information and education to break the stereotype of speculation and fraud that many young people are suffering from lack of knowledge, providing a healthy community to the audience. share knowledge and share career opportunities for young people. expanding the reach of Cardano to a large number of young Vietnamese in a more positive, fun, and comfortable direction. From the above information, I am confident that the scale of the project will be expanded and I completely agree. that this proposal effectively addresses future challenges.\n\n", "q0r": 5, "q1": "The proponent has provided detailed and specific information with an attached link about the relevant skills as well as the necessary experiences of the Project Leader & KOL: Ms. Lengkeng and the project manager. The budget proposed by the proponent as I see it is a project-appropriate budget of $14700 done over 12 weeks and clearly outlined, broken down into identifiable items including Budget for KOL & Project Leader $6000, 2-person Content Writer $2400 Videographer: $140, Video Editor $960, 2-person Community Manager $2400, Equipment rental cost and the video recording location uses Lengkeng team's existing equipment, so the cost is $0. In addition, the proponent also asked for an additional Contingency Cost: of $1500, equivalent to about 10% of the total cost of the project, I think it would be better if the proponent could give a specific plan for the project cost room. The actual timetable to complete the work is given by the proponent within 12 weeks with a specific, reasonable, and convenient plan for implementation. The proponent also took into account a number of risks when implementing the project and gave specific measures for each of those risks. I agree that it is very likely that this proposal will be implemented successfully. I give 4* for the feasibility of the project.", "q1r": 4, "q2": "The proponent gives a 12-week implementation roadmap, with important milestones and a specific time to achieve each milestone, namely Tik Tok Channel reaching 50,000 followers in 12 weeks, and 10,000,000 views after 12 weeks. The Facebook group reached 5000 people join after 12 weeks. Telegram group has 1500 participants after 12 weeks. Looking at those milestones can assess the progress of the project. when the project is successfully implemented attracting a large number of new users to the Cardano ecosystem; communication channels with a large number of participants. To measure the progress of the project, the proponents selected the following KPIs: Number of followers of the Tik Tok channel, Number of video likes, Number of video views, Number of Facebook group participants, Number of participants Join the Telegram channel and I think those are the right indicators to determine the success of the project. The proponent clearly describes the problem and has a solution to solve the problem in a clear, easy-to-understand way. I fully agree that this proposal provides me with sufficient information to gauge the progress of the project.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12152, "q0": "This proposal has a clear objective, using Tik Tok, a trending platform for Generation Z, as a simple, attractive, and fun way to deliver information about Cardano and its ecosystem while preventing misinformation and scams that occur in the Cardano community, especially those quite vague in understanding nature and knowledge in this field. Making young people much more aware of the importance of Blockchain, Crypto as well as Cardano. Also, it will help create a growing community that can be a place to share information and career opportunity with its member. Delivering short and simple information makes young audiences easy to understand and will be interested in seeing Cardano's potential. The impact of the proposal can expand the Vietnamese Community and bring many new young users to the Cardano ecosystem.", "q0r": 5, "q1": "Based on the project leader's resume, it's a solid start. The proposer is already a content creator on the Tik Tok platform and has a great engagement. They already have an experienced team and proper equipment to implement the idea. The budget breakdown is very detailed and has a breakdown with specific detail for this project. They have a realistic timetable to produce Tik Tok videos and grow the community through the online channel. The proposer knows how to do practical things to tackle several challenges in the online platform. ", "q1r": 5, "q2": "The proposal has KPI to measure their performance. The key metrics of this project proposal are focusing on growing the Cardano Community through Tik Tok and another online platform. Definitely, the Vietnamese community needs this kind of project. This proposal in all its detail will most likely achieve its intended deliverables. In the long term, this proposal also thinks about how to sustain the project through external funding sources such as project sponsorships.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11784, "q0": "The idea of “Crypto Tik Tok Channel for Youth” is in line with the requirements of the challenge. This is a new project that appeared at Fund 9. The team proposed a solution to popularize blockchain and Cardano knowledge for Vietnamese youth by creating Tik Tok Channel, a platform that is very popular with young audiences in Asia, in That includes Vietnam. The purpose of the idea is not to stop educating and developing the community, the group also wants through the Channel to be able to orient careers and support risk prevention for young people related to the cryptocurrency market. The highlight I see in this solution is that the team has found the key to attracting young people who love technology. That is, they will invite KOLs to collaborate on content production in a simple, fun, and easy-to-understand way. In Vietnam, Gen Z is very passionate about blockchain and is also very influenced by KOLs in consulting, investment orientation and market analysis. However, the reality is that there are many marketing KOLs for one or several token projects, PR speculative opportunities x10, x100 times. This entails many consequences: fraud, loss of money due to the mentality of just wanting to get rich quickly in a short time. Personally, I find that only when orienting young people to constantly learn, improve their knowledge and understand the nature of the market can they succeed in the cryptocurrency market. Therefore, I appreciate and support this proposed solution and way of doing things. The team has harmoniously resolved the relationship between turning dry, confusing blockchain knowledge into simple, accessible and suitable content for young people, through influencers. Regarding the risk of successful prevention, the team has proposed 2 risks that can be encountered, with solutions to overcome: first, some KOLs have PR for tokens to profit, causing the community to lose confidence; Second, extensive blockchain knowledge may be beyond the team's understanding. Personally, I think there are some other risks that the group needs to take into account. Firstly, the risk in attracting development of members is because in Vietnam, there are currently too many blockchain communities and groups. Young audiences themselves are people whose behavior is changeable: they quickly like it and also quickly get bored. This requires the team to have an effective marketing campaign, accompanied by impressive content creation activities to attract young audiences to stick with the channel. Unfortunately, I have not found any marketing related content in this proposal. Second, the risk of ADA slippage may affect the project budget. Overall, I still appreciate the impact of this solution. My score is 5.", "q0r": 5, "q1": "Regarding the feasibility of the solution, the progress and budget given by the team in my opinion are detailed, clear and reasonable. Specifically, the team proposed a 12-week implementation process. In particular, focusing on the following categories: video production, 3 live streams inviting blockchain experts to participate, building Telegram and Facebook community groups. Regarding the budget, the team had a detailed explanation of the items to be spent, the unit price given in my opinion is appropriate. About the team, Ms. Long label – the project owner is a content creator on the Tik Tok platform. According to my research, the group's Lengkeng channel on Tik Tok currently has more than 600K followers and more than 9.8M likes. I believe that the team has enough skills and experience to successfully implement the project. I only have a small suggestion, the team should consider adding some marketing and communication activities to the Blockchain Tik Tok Channel to increase the effectiveness of attracting the audience. These marketing activities can be implemented within the existing Lengkeng community itself. This in my opinion will contribute to the success of the solution. Overall, I believe the solution is workable. My rating is 5 score.", "q1r": 5, "q2": "They have provided full audit metrics, for each platform to grow: Tik Tok channel, Facebook group and Telegram group. The community completely has enough basis and data to fully evaluate what the success of the project will look like after 12 weeks of implementation. Specifically, the goal of Tik Tok Channel followers will reach 50,000 after 12 weeks, with 10 million views. The Facebook group and Telegram platforms will reach 5,000 and 1,500 members respectively. I do not have any criticism or suggestions. I believe, the community can completely audit this project easily. My score in this category is 5.", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11716, "q0": "Ever since the boom of Tiktok, it's been widely studied how short form content is becoming the preference especially for the younger generations. A simple google of the growing share of customer attention from tiktok will verify this - telling you how fast short form content is growing. This proposal specifically leverages on the trend, and to use it to educate the public. Personally, even i have followed such tiktok accounts with educational contents just for concise, self-enriching knowledge while i go through social media, and i think the proposal is truly valid and can be something that takes off if done well.\n\nLooking at the proposer's tiktok account, with a sizable follower base of 632k in the Vietnamese market, i believe that the proposers intent to spread cardano's knowledge there will be fruitful for the local market. Taking into account the sum requested of 14.7k USD, it is reasonable for her effort, as later elaborated in the feasibility section. As a cherry on top, the proposer knows clearly the demographic she intends to target, being the GenZ. A caveat here will be that i do not speak vietnamese personally to verify the quality of her past contents, but i would safely assume that she has a sizable audience that relates to her and her style, considering her follower base. \n\nThe idea also ties into the challenge it was submitted in, and is aligned to Goal #1 of the Fund 9 strategic goals. The proposer demonstrates knowledge of the target audience's pain points, knowing that the younger generation requires more guidance as her local market may be filled with speculative trading and scams. This assures me that she has a particular pain point she wishes to tackle.", "q0r": 5, "q1": "\"the activities listed and the timeframes provided are reasonable. credibility of the proposer is also good. It would have been a bonus If the proposer could list out some example names of local industry experts they have in mind to bring onto the channel as described in the proposal, but that's just a good to have. \n\nmost of the line items in the funding requested is reasonable, adding on that the content creator herself, lengkeng, will use her own existing equipments for recording. i cant help but to feel like her rate of $500 per week is pretty steep, which translates to $2000 a month. This is considering that the average pay in Vietnam is $262. Understood that the proposer herself may have many other expenses to pay for as a variable pay worker, i will not comment on this note. it is only something i wish to highlight for voters to consider. \"", "q1r": 4, "q2": "\"the metrics chosen is objective and verifiable, and also time-bound.\n\nHowever, there is ambiguity to the way the proposal was written. the proposal states that success is 50,000 followers on tiktok in 12 weeks, 5000 people in their facebook group in 12 weeks, and 1500 people in their telegram group after 12 weeks. \n1. the tik tok account currently already has 632k followers. why is it that the proposer states success is 50,000 followers? was this a typo?\n2. the facebook group is fine, though it was confusing at first. the proposer attached 3 links in her beacons, all of which points to facebook, 1 of which leads to a broken page. one led to a page with 16k followers, and a group with 1.1k followers. proposer intend to grow the group from 1.1k followers to 5k. if the proposer attached a link to her page with 16k followers, would she have considered a metric to see an increase in following of that page as well, in line with the growth expected from the facebook group?\n3. some metrics chosen like Telegram was not clearly explained as to how can success be measured. there was no attachements pointing to telegram to get a current count of the telegram group size.\n\nfinally, on top of all that, the numbers were not clear if it was expected to be an INCREMENTAL, or a TARGET. for example, the proposer states \"\"Facebook group: 5000 people after 12 weeks\"\". if the group currently has 1000 people, does she intend to get 4000 new followers in the next 12 weeks to reach the 5k mark? or is it that she expects a total of 5000 new followers, making the total Facebook group memebers amount to 6000. \"", "q2r": 2, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "In the feasibility section, this PA commented that an income of $ 500 / week is expensive for 1 KOL on Tik Tok with more than 600k followers and many videos with millions of views. This is a biased comment. PA should comment on the capacity and feasibility of the proposal.\nAs for Auditibility, this PA is confused about the existing channel of our team and the TikTok channel is ok for this project. We will set up a separate Tik Tok, Facebook and Telegram channel for the project."}, {"id": 14675, "q0": "This proposal is very suitable for Cardano's current goal when the communication and Marketing segment of our ecosystem is still limited. The author focuses on young GenZ people, who in many projects we often overlook. While it is clear that building the next generation is extremely important to Cardano or or any platform. It is they who will make our platform more vibrant and energetic. Proposals also emphasizes making unintelligible, technical content more user-friendly and accessible to young people, which is the first step for Cardano and blockchain to come closer to the mass community", "q0r": 5, "q1": "I am quite confident in the ability to complete this project because I have researched information about this girl. There are quite a few articles about her ability to make money, make content as well as Marketing, so I think she can be expected to be like a KOL for the Cardano platform on tiktok, the effect will be very good. She could be Vietnam's Bullish Dumpling. Furthermore, from the videos on her main channel, it can be seen that her team is doing very well both in terms of shooting, video editing and content creation. Her tiktok channel is quite famous in Vietnam in the field of finance and investment education.", "q1r": 5, "q2": "The author has given many numbers on the number of followers by stage, the number of likes and comments. The KPIs are clear and easy to follow because the social media platform is quite public and transparent. In addition, the amount is also clearly divided by working time and other parts of the team. The prices for the purchase of additional equipment in addition to the existing teams are also reasonable.", "q2r": 5, "assessor": "z_assessor_4082", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11402, "q0": "Cryptocurrency has become an increasingly popular mode of investing, and crypto owners are pushing for it to be used as a more mainstream type of currency to exchange. Tiktok is currently working on a program that will allow crypto companies to run ads on the platform. Many people are currently using cryptocurrency as a form of investments as their values change frequently. Tiktok allows crypto companies that are registered with an approved regulatory body to run ads promoting cryptocurrency. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "Feasibility contains milestones such as conducting live streams to interact with the community and experts in blockchain industry and publishing videos , building a community group on Facebook and telegram. The budget is outlined clearly and broken down into idenfiable items. The budget is reasonable to achieve set goals.The project leader who is working with this is a book writer and director of prestigious book company of youth with 10 years experience. He is also a content creator on tiktok platform and community advisor . Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The progress of the project can be measured by KPIs like followers of tiktok channel and number of likes of videos and people joining the Facebook group and number of participants in telegram channel. The proposal plan is detailed very clearly including the timeline of publishing videos and live conduction for the community and also creating groups in facebook and telegram. The proposal explains technical aspects. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11156, "q0": "Vietnam currently ranks 10th on the Global Cryptocurrency Acceptance Index. According to a survey by Finder, Vietnam is the country with the highest rate of cryptocurrency adoption. This shows that Vietnamese people are very open to Blockchain technologies. However, it is a fact that the majority of Vietnamese view the cryptocurrency market as a speculative tool or a gambling game. Knowledge about the blockchain technologies and cryptocurrencies in Vietnam is still very vague and difficult to reach everyone. This proposal aims to solve that problem by taking advantage of Tik Tok's boom with short, lively, accessible videos. With about 20 million users in Vietnam, the project will be closer to disseminating knowledge about the blockchain technologies, cryptocurrencies and Cardano to everyone, especially young people, who are extremely open to the blockchain technologies and cryptocurrencies.", "q0r": 5, "q1": "To be honest,  the Project Leader who will be working on the project looks very good and competent. She has many years of experience in the field of content and communication, along with more than 2 years of exposure to blockchain and crypto. However, with the plan already stated in the proposal, it would be nice if the proponent could provide a little more information about the other members involved in the project, such as the number of members, expertise and each person's job positions, etc. This is very important because the members participating in the project are one of the factors that the project will succeed or not. Therefore, it would be great if everyone could know these information. The team made a great decision in terms of saving on equipment rental and video locations by using Lengkeng team’s existing equipment. Fortunately, the proposer anticipated the most significant risk, it would be bad if people mistook educational videos for a PR video for projects. I think the team should come up with a more specific solution to this problem. For example, the contents will limit mention of tokens. ", "q1r": 4, "q2": "The goals and KPIs will be measured, tracked and the community is free to check and audit. Everyone can easily see the metrics like number of followers, number of views, likes of the videos,etc via the TikTok channel, Facebook group and Telegram group. The proposer makes it very clear and transparent so I believe that from an audit point of view, this project has nothing to worry about.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9804, "q0": "This is a very cool, fresh and creative idea. Firstly, this project is outstanding in the field of community building, increasing awareness because it is clear that the explosive level of Tik Tok  in Vietnam and East Asia markets is very strong. And obviously using Tik Tok  for promoting Blockchain as well as Cardano to young people is very appropriate because this platform is very young-friendly. The issue raised about technical barriers as well as English was also raised by the project author, it is a fairly obvious problem in a non-English speaking country. The fact that the team is able to create good, engaging content with easy to understand words is a good way for the knowledge of Blockchain as well as Cardano to be closer to newcomers. This is exactly a project of young people made for young people with a very youthful mindset. It's time we pay attention to the dissemination of knowledge about blockchain, metaverse, especially Cardano, to more young people. We have quite a few channels on Youtube, on Telegram but it is true that there is a shortage of one channel on the Tik Tok  platform that is most user-friendly for young users and especially short videos that are also suitable on this platform and also accessible to people. young. Moreover, the fact that the team has several strong investment Tik Tok  channels also makes the project quite easy to attract users with its own Tik Tok  channel for Crypto. Reading this project, I think the author should change the name a bit, for example: Blockchain Tik Tok  Chanel. As a whole as a Tik Tok  user, I will be more impressed with Blockchain on this platform because Crypto is often associated with many bad impressions. So changes to Blockchain will have a higher educational meaning. Such a small suggestion, but I still think this is a very good idea.", "q0r": 5, "q1": "This is a project that is not too difficult and is completely suitable for the background and experience of the proposed team, so I think it is not difficult to complete. As a person working in Marketing, I have surveyed through videos on stock investment as well as crypto on author Lengkeng's channel. I find that most of them have good knowledge and receive a lot of views and very positive reviews from viewers. I think the author chose a solution that is quite suitable for the team. However, the Team also mentioned the risk that the team's knowledge is not deep enough, meaning they are quite aware of the problem. So there is a plan to have the contribution of other experts when live streaming. This is also a smart solution and increases the prestige of the team. As I said above, given that the author is an influential person in the financial and investment sectors in Vietnam and has a relationship as well as an available PR channel, this project is not difficult to implement. These short pieces of content can also be used for other products, publications, and platforms. And if supported by the fund, hopefully they will deploy it soon to reach more people just on Tik Tok . Another part is that I don't know if the project is in English or Vietnamese. If it is English, it will be able to attract the East Asian community better, not just in Vietnam. There is a small problem worth noting that the Tik Tok  channel also relies on the distribution of videos of the Tik Tok  platform, maybe the content is good, but it has not been distributed. But anyway, the author shows that she is a person who understands very well about Content, Video as well as the tiktok platform, so she can handle it.", "q1r": 5, "q2": "The coherence in the proposed cost by item is quite understandable, showing that this is a familiar part of the proposer's team. It can be seen that there are quite a few parts to produce 1-3 minute videos on Tik Tok. In addition, the KPI is also very clear because it can be seen very clearly on the internet platform. There are enough followers, likes and comments or live views per livestream, so it's quite transparent here.", "q2r": 5, "assessor": "z_assessor_3099", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9710, "q0": "This proposal is directly responding to the need for expansion of exposure in Asia. It is a simple, yet effective way of spreading information about Cardano as Tik Tok is a platform that is already used by millions, especially the youth. This would have a positive impact on the Cardano community as it could increase knowledge about Cardano and potentially increase the user base. There is not very much information regarding content of videos to be made or any follow up incentives. Perhaps this could be considered? People flip through Tik Tok videos at an alarming rate without much thought or shift in thinking.  If the intended audience is youth already interested in Cryptocurrency then impact is smaller, but still meaningful. The fact that the proposer already has a significant following is definitely advantageous. It is also ", "q0r": 4, "q1": "The proposer does not provide information on who makes up the team. She does have experience and knowledge which will drive this initiative. The budget is broken down but the amount seems quite high considering what is involved. Actionable tasks involve making videos and putting them online but there is no information given on how viewership will be created or maintained, or on the quality or depth of the videos. To be of benefit to Cardano, it seems like these aspects do need to be explored and described.", "q1r": 3, "q2": "The KPIs are given and are based on viewership numbers and likes. This is how the youth determine popularity and it seems essential that Cardano is represented on Tik Tok as this audience are the generation who will develop a world which is more self and environmentally aware. They are the future. This is a simple but clear way to measure success and includes transparency and accountability. Action can be taken if anticipated numbers are not met. The Cardano community can follow and determine the quality of the channel. There is also much potential for collaboration.", "q2r": 5, "assessor": "z_assessor_3085", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The assessment is given from a biased perspective. PA said the proposed amount was high but did not give a reasonable explanation. In the proposal, the author also mentioned the work to build a video, which requires composing content, filming, and editing videos. The content given to reach young people needs to be short, easy to understand, and accessible to the masses. This needs experienced teams like the team that wrote this proposal.\nThe impact assessment has also not been completed."}, {"id": 9360, "q0": "Currently, in Vietnam, I see that the young generation called Gen Z is very fond of the social network Tiktok. All areas of life such as learning English, reviewing food, recommending products, clothes, health care services, cosmetics, etc., appear on Tiktok and are viewed by everyone. strongly known. TikTok is an extremely good marketing channel because it has short video effects along with catchy music that makes people spend more time on it. So I think your ideas are suitable for young people in Vietnam. Especially, I also find that the Crypto market has not been popularized in an orthodox way, which is very misleading, so there should be official tiktok channels that bring good information for you to understand better.", "q0r": 5, "q1": "The proposal is well documented with a specific schedule. You have divided by work done by week with a specific number of videos. The cost budget to perform the work is also clearly listed. I see that the team members are all experienced and members in the field of content and communication, creating content on the Tik Tok platform, sharing about education and investment for the young generation. However, you still need members who are experts in the blockchain field and have knowledge of Crypto. In general, the information you give is okay.", "q1r": 5, "q2": "As a suggestion I haven't seen any progress reporting by providing the community with some kind of progress report? Google sheets or google drive? That may be an example for you to have a demo for everyone to clearly visualize. In your group's proposal, you have given specific criteria and have KPIs to achieve. In general, this proposal is presented briefly and easy to understand. And this project I think is not too difficult to implement because it does not require too high technical skills like developing software. Good luck.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8369, "q0": "As we all know today social media has become one the most powerful means of communication. Social media attracts people towards it as people do not get bored of watching videos. Tik tok is a video sharing social media which has a lot of content in it. A lot of youth have been using tik tok and they are used to this social media and by creating contents in these channels will enable them to build more interest in the block chain and cardano, These videos can be made use of by providing informative videos about cardano to the people so that it reaches more number of people. The only thing the proposer has to take into consideration is making the videos more creative and interesting for the people. The proposer has given a very innovative idea of creating content videos based on cardano which will add more value to cardano system as many people will gain knowledge of cardano and more users will attracted towards it. The key metrics align with the outlined proposed goal and is more likely to be successful and can also be scaled for future challenges as social media is the future of communication and the proposer has effectively addressed the challenge", "q0r": 4, "q1": "The information provided in this proposal suggests that the members are well experienced in this field with an experience of 10+ years and they have also provided evidence by providing several reference links to support their proposal. The budget is outlined clearly and has been broken down into identifiable items and is very reasonable to complete the proposal successfully. The time schedule seems to be realistic is likely to be successfully completed in the mentioned time frame considering the challenges and risks relevant to successful implementation \n", "q1r": 4, "q2": "The proposer has provided a realistic time schedule and the flow of events to complete this proposal which also enables for the successful audit of the proposal from time to time and has provided the keymetrics which define the success of the proposal which will enable to audit the success of the proposal. as they are team of experienced social media content creators with experience in blockchain and cardano also they are more likely to make creative videos which will serve the purpose of spreading the knowledge of cardano to a larger community and the proposer has clear understanding of the proposal and has provided the solution for a successful implementation of the proposal.\nThis will enable more youth to be a part of cardano community through these videos.", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5246, "q0": "The current mainstream content marketing trend is to use short videos to convey content, some of the popular short video platforms today are Facebook Reels, Youtube Shorts, and Tiktok, but Tiktok is the most popular channel, with a large number of users. This is the reason why many KOLs in the Blockchain and Cryptocurrency field in Vietnam use the Tiktok channel to serve their fans. And if Cardano appears on Tiktok videos more and more, it will help Cardano's brand image become more popular for the community of crypto investors and those interested in this field in Vietnam. .\n\nFor this proposal, you choose the Vietnamese language for your Tiktok videos because this is a market of 100 million people with the majority is in working age, young and technology-loving. Vietnam is also a country with a very fast development in the field of Blockchain and Cryptocurrency, which has ranking top of the world recently. Therefore, young people here need to have access to Cardano through many media channels, including Tiktok.\n\nThe challenge that the project raises is \"most people will think that KOLs will PR for tokens just to profit from the community\", beside the solution that you guys have, I think before choosing a project or any information to use for Tiktok videos, please research carefully and verify the information clearly before sharing it with the community. Many KOLs have done it that way and still won the trust of fans for a long time, such as Thuan Capital channel, Coin68,...", "q0r": 5, "q1": "Your proposal is expected to complete for 12 weeks (03 months), but the timeline and specific tasks to do are still general, not specific. Especially the detailed content about the topic you use for the videos in the Tiktok channel has not been specified. For example, in Cardano videos, you can choose related topics such as IOHK, Cardano, and Charles Hoskinson news or technical content like Plutus, Marlow, Haskell. This makes your implementation plan clearer and more convincing.\n\nThe budget you proposed for the project is $14700 for a total of 36 videos (03 videos per week). The specific costs in the video production process are also specified by you according to each item. This part I find quite clear and the above cost is reasonable.\n\nYour group has only 01 member, Ms. Lengkeng, with more than 10 years of experience in the field of media and content creation. With the amount of work as described in the proposal, I think you will be able to complete it because most of the work will be outsourced and requires management skills.", "q1r": 4, "q2": "To evaluate the success of a Tiktok channel, the basic indicators we must have are the number of videos, the number of followers, the number of views and the number of hearts. All of these indicators are mentioned in your proposal.\n\nThe goal you set in 03 months to get 50,000 followers on the Tiktok channel is quite an ambitious number. In addition to the followers from the Tiktok channel, through this channel, you also want to increase the number of members on the Facebook Group or Telegram channel. I completely agree with these approaches because on today's social networks, it is better to use Multi-channel marketing, other communication channels will support your Tiktok channel soon to achieve the expected goal. ", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11361, "q0": "The problem raised by the proponent reflects reality\nKnowledge about Blockchain and Crypto is still quite new and confusing for young people.\nTik Tok channels are short videos of only 1-3 minutes with vivid and easy-to-understand content that catch up with current trends that are very attractive to young people.\nthey can also host live streams with blockchain and crypto experts\n\nBuild a TikTok channel to help users easily access and participate in both Blockchain, Crypto as well as Cardano.\nTaking advantage of the boom of Tik Tok with short, lively and accessible videos, this project makes clips for the purpose of instructing, sharing information, orienting careers, and supporting young people to properly understand Blockchain Crypto to avoid unnecessary risks.\nall videos of speeches on Tik Tok are free so users can access and learn.\n\nThis project focuses on short content, so this content can be flexibly modified for other platforms like Facebook, Youtube or book publishing.\nThe project will bring many new young users to the Cardano ecosystem.\nThe proponent has given the risks and solutions to reduce the risks as\nBlockchain & Cardano platform knowledge is vast, there will be many aspects, knowledge beyond the understanding of the team. and they will invite some other experts in the industry to join the livestream to exchange and answer questions with young people in the community.\nHowever, what I want to comment on is inviting this expert, what criteria does the proponent need to provide to ensure that they have the right knowledge of Blockchain, crypto, need to reveal their identity and how to censor them? Users have proper access to and understanding of the Blockchain platform and the Cadano ecosystem.", "q0r": 5, "q1": "The implementation progress of the proposed project is still general and not specific\nproposed to conduct 3 live streams to exchange with the community with guests who are experts in the field of Blockchain in Vietnam, but did not give specific information about the knowledge profile of the experts.\nThe issue of budget breakdown is 500 $ / week * 12 weeks = 6000 $ for the KOL and what the team leader is supposed to do here needs to be more clearly stated.\nAbout the team, I see information that only 1 person can find out and the rest I don't see relevant information.\nOne suggestion for the proponent is that it is possible to recruit more human resources from the Blockchain research community, especially those who study the cadano ecosystem, because the concept of Blockchain is for most people. in society is still quite vague and can misunderstand the concept. Therefore, if the selection of human resources without real experience, it is easy to create a large number of people who are misunderstood and have many consequences.", "q1r": 4, "q2": "The proposal has provided KPIs to measure specific projects clearly and has specific numbers so that the community can monitor the progress and success of the project.\n\nNumber of followers of Tik Tok channel: 50,000 followers in 12 weeks\nVideo Likes\nVideo views: 10,000,000 views after 12 weeks\nFacebook group joins: 5000 people in 12 weeks\nTelegram channel participants: 1500 people in 12 weeks\n\nIf the project is successful, it will be possible to attract a large number of new users to the Cardano ecosystem; communication channels have a large number of participants and have a larger part of users who are more knowledgeable about Blockchain as well as the Cadano ecosystem.\nthis is brand new suggestion i appreciate the suggestion of the proponent.\nThis proposal addresses the requirements of the challenge.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14682, "q0": "Proposal focuses on simple, funny content to bring about effective results that are very suitable for Tik Tok, Reels or Youtube Short platforms, they are the general trend of online content production. Especially, it is also easier to reach & more viral. Therefore, I am confident that this proposal completely solves the problem it poses as well as strongly promotes the image of Cardano. Obviously, besides building projects, applications in the Marketing ecosystem are extremely important. One of the limitations of Marketing for Blockchain is a lot of confusing information, many doubts about scams and cheating, leading to users not being able to overcome the hesitation when learning and participating in Cardano. This recommendation gives users the most basic look at Blockchain and Cardano", "q0r": 5, "q1": "Tik Tok is a platform that does not require too deep or technical knowledge, it focuses on content, so from the author's profile with more than 10 years of content and Marketing, the ability to complete this proposal is not difficult. Moreover, Vietnamese young people are eager to learn, adapt well to Blockchain or Crypto knowledge, choose the right expression for sure, the videos will be loved.", "q1r": 5, "q2": "The set of measurement KPIs is also quite complete in terms of quantity as well as quality when the author talks about views, likes as well as comments. I think sometimes the author can also create surveys for viewers to evaluate more deeply about the channel so that they can edit the content and reasonable quality. As for the allocated capital, the author clearly divides the initial cost and if it continues to be funded in the following months, the cost will certainly decrease.", "q2r": 5, "assessor": "z_assessor_4086", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Produce short content: Only 1-3 minute videos \nUse the reputation of a KOL specializing in investment to easily reach the mass community.\nOrganize livestreams with blockchain and crypto experts", "experience": "\nContent creator on the Tik Tok platform, sharing about finance and investment for the young\n10 years of experience in content and communication.Experience on Blockchain & Crypto.CA since Catalyst Fund 8\n10 years + Author, Magazine editor; Director of a Book company for the Youth\n"}