{"id": 422090, "author": "diarpii", "title": "Lotus Link: Eco-Farm Traceability", "url": "https://cardano.ideascale.com/a/dtd/422090-48088", "category": 26602, "amount": 39600, "description": "Village communities in Vietnam need infrastructure for sales of local goods—especially in agricultural & heritage-tourism contexts. Authenticity should be provable for eco-products & artisanal crafts.", "f6_no_assessments": 16, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 986, "q0": "## General\nBold and noble solution to a very real and impact full issue.\nThe presented relevant experience, covers all aspects of the proposal.\nTheAlexandriaProject (TAP) has been an impressive and incredible experiment from the start. It tells a lot about the commitment, diligence and expertise David is offering.\n\n# Impact\nIt seems as if the problem was deeply analysed and a custom tailored solution meditated on and designed for.\nQuite smart to leverage the hard problem of counterfeits and offer Cardano as a (economical & ecological) sustainable solution.\n\n(++) On site data collection & documentation by a well respected individual of the Cardano Community, known for his excellent documentation\nskills (The Alexandria Project).\n(-) Biggest liability: finding another person that can execute on that level, to scale and mitigate risk of work disability; this is being accounted for in the risk section! \n(++) Education seems a key element and if successfully teaching local communities how to mint native Cardano assets (and all that is entailed), is not the ultimate growth impact,\nI don't know what is.\n\n(?) how will QR codes be applied to products?\non what material will labels be printed? How to ensure they're tamper proof?\n\n(+) well thought out plan on how to document & educate also beyond local communities\n(++) extraordinary preliminary research into the local eco-farm economy is displayed in a great overview of different products and raw materials\n(++) a new DB explorer geared towards SCM/ product traceability is also within the scope of the project!\n(+) Successfully executing this proposal would raise awareness (of Cardano in first time participants) along the whole supply chain of eco-farm products. It could very well have a snowball effect if picked up by other local (national) communities.\n(+) By improving local communities, of non-industrialised and over bureaucratised, and\ntheir standard of living, this proposal is right along the lines of Cardano's impact mission\n(++) Additionally the focus is on sustainable & traditional cultivation and production\nmethods, again perfectly aligned with he overall mission of Cardano, to maximise the return of impact especially in areas abused by predatory capitalism.\n(+) Risks assessed thoroughly and prepared mitigation and contingencies \n(+) Technical, operational and travel risks are accommodated for", "q0r": 5, "q1": "# Feasibility \n\nIt's highly likely that the team will execute the project successfully. Even though the budget is very tight, the previous commitment and industriousness, displayed by the proposer  within the Cardano community, evokes confidence that it will get done even if budget runs out.\n\n(++) (team) experience and skill set required for execution are readily available,\n(+) Road map is articulated clearly and in enough detail \n(+) Plan is sensible and it's apparent a lot of thought went into it \n(++) activity on another F9 proposal is mentioned and accounted for in a mindful way!\n\n(-) The budget is calculated without a buffer and the remuneration is almost pro bono\nlevel (at least for dev work with 25$/h)\n\n(?) Why is the label design billed at 25 $ per design? isn't it same design a diff. QR?\n\n(+) Further funding opportunities are clearly expressed, seem logical and very reasonable. Additionally they would offer real world applications of future Cardano technology (such as Atala and Hydra).", "q1r": 5, "q2": "# Auditability\nThe Auditability of this project is well thought out and leaves ample room for the community to audit as the project develops. The KPIs can and often will be adjusted once the monthly reports come around.\n\n(+) short, mid & long term tracking will be made openly available\n(++) Includes weekly Twitter spaces for direct feedback loops and live updates, outstanding!\n\n(-) the KPls are a great start, however only take measure after the project is completed. Working the KPI's available into a \"leading and lagging\" model would allow for finer granularity and thus tracking", "q2r": 5, "assessor": "z_assessor_2170", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2880, "q0": "From a few words noted in “Grow East Asiam Grow Cardano'' challenge : “East Asia is fertile ground for the adoption of Cardano.” could be noticed. Despite the fact that not until Fund 10 that a specific challenge on the Agriculture side will be made, this proposal is considered to be one of the vanguard one on the topic. At the problem statement it occurs that there is an essential need of investment for Vietnamese local/village businesses to authentically prove their products. Following that they stated “product-traceability infrastructure using Cardano metadata” which is a good point of addressing the challenge hence the project will be done relying on Vietnam information, this is also relating to the problem of supply chain that could be enhanced by optimizing the use of Blockchain technology (in this proposal it’s implemented QR Codes). From a cultural perspective, this proposal is highly appreciated for its promotion to preserve the traditional business culture, protecting symbolic plant (lotus) by optimizing products-integration, localization. However as PA will proceed the fact that $39600 will be a considerably high budget (not mentioning about the budget break down section yet) for a micro project to support a small community of craftsman, farmer, there should be an explainable vision of how this small case of the project could be done in a more macro size through the integration of Blockchain. The proposer should also make a noteworthy point of how the proposed solution would impact the angle of sustainability more clearly. While the proposal stated “ local community members who want to implement Lotus Link for their own purposes using Cardano natve assets' ' seems to be easy but there aren’t encourageable ways to make sure that the community there understand the technology well. The proposal is well written to adapt with SDG goals. \n", "q0r": 5, "q1": "Looking at the feasibility in humans, the whole project is made to be international between the United States and VietNam. One compliment for the details section was the clearance in which they specify the role of each member per Phases which makes it clear who will be in charge for a particular task. The project also adapts the model of director, experienced lotus farm owner, developer and broadcaster but they should also specify the community of which they’ve been working for so it’s more measurable in terms of size. Breaking down the timeline, Lotus Link broke down the whole project into 3 phases with different purposes. As it could be seen, they have very detailed location, variety of products which are rich in cultural and medical value. When it comes to milestones, the proposal is broken down into months of execution, but as their project tends to follow a sequential process there are several types of risks that they need to deal with. The listed risk management are “International travel risks, operational risks, technical risks”, from PA perspective the proposer has carefully managed to deal with these risks through backup plans and building consensus with the local people. One additional point that would scale up the project in terms of Data Management was how decentralized the gathered data is, how they’ll deal with the human erroneous factors during the collection process (since the locals are also involved). If the project could demonstrate the said suggestion the decentralization characteristics would be a foundational point for traceability. Right now traceability has also been a great potential to connect to ATALA SCAN (the platform is built up on Cardano) and there are great applications of the project that can be done with the technology. \n", "q1r": 5, "q2": "The proposal had their points of measurement included in a very specific manner. Without comments on the goods of the success, the only points they need to specify here are “emerging markets in Southeast Asia” and “Local communities learning how to use Cardano solutions for the development of local business”. While it’s understandable that traceability will provide customers with more reliability, in order to extend the market there should be more aspects about marketing or promoting that characteristic to be commercialized. As this assessment has already noted the educational detail above, for a very particular rural area to actually be engaged into the Cardano blockchain, it’s another vital point for the group to invest in a good amount of knowledge for these people. By that, the local people won’t have to rely heavily on the third party to support them with the integration process. \n", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3626, "q0": "Thanks for the proposal, thanks to the information you give in this proposal, I know more about the unique culture and activities of the Cham community in Vietnam.\nThe preservation of traditional professions and the maintenance of long-standing unique cultures have always received the attention of the community and the state. The point is not each to maintain but also to develop to continue to exist.\nHandicraft products with sophistication take a lot of time and effort to make products, then they are easily and widely counterfeited, greatly affecting the existence of traditional industries. system.\nBlockchain adoption and traceability will help both consumers and producers reduce the negative effects of plagiarism.\nToday, when dirty food with many chemical residues is widely available, the search for safe agricultural products with clear origin is being welcomed by the community. The proposed solution will partly regain trust from consumers, besides, it will help Vietnamese people know more about blockchain, especially Cardano.\nThere are 3 potential risks raised with 3 possible solutions. Traditional industries, if properly developed, will attract a lot of domestic and foreign tourists. Therefore, the activities and techniques applied must be well implemented for the project to develop and take advantage of", "q0r": 5, "q1": "I was very surprised about the project team, made up of Americans and Vietnamese.\nReally from the bottom of my heart I would like to thank you for your ideas and contributions to the traditional culture of Vietnam, specifically the Cham community in Vietnam.\nWith the experience of experts on Vietnamese culture, blockchain technology and enthusiasm and efforts to revive the culture and traditional professions of the Cham people, I believe that the team will successfully complete this project.\nThe detailed budget is properly allocated and the detailed work table with 3 objectives: collection - construction - implementation helps readers easily visualize and check the project progress.\nI appreciate the feasibility of this project, above all I am Vietnamese, I always support you", "q1r": 5, "q2": "The community project progress measurement indicators can be checked:\n- Traditional product image information is updated on the web and recorded on Cardano\n- Number of people participating in the workshop about the release\n- Number of interactions and followers on social media.\nThe above-mentioned goals will be easily tracked and checked by the community.\nHandicraft products are traceable and documented using Cardano solutions.\nFrom the success of this project will be a typical model to apply to other traditional industries in other localities in Vietnam.\nA new step, a new direction to maintain and continue to develop Vietnamese traditional industries", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3842, "q0": "This proposal has a good idea but has not stated the problem clearly. The problem statement should read as 'Village communities in Vietnam does not have.....'. \nThe proposer is seeking to develop product traceability infrastructure by using Cardano metadata that is used for agricultural and cultural heritage products, and also implement QR codes containing quality assurance, cultural and historical information. \nIn addressing the challenge, the proposer has explained that the use of Lotus Link will help raise awareness of Cardano blockchain among local communities throughout Vietnam, and this is among the goals of the challenge and Fund9. It was mentioned in the proposal that first timers will be onboarded into the Cardano ecosystem, and the project will improve lives of people in the communities in Vietnam. Again the proposal will promote sustainable cultivation of farming and material production. The project will also help the local community members who want to implement Lotus Link for their own purposes using Cardano native assets. \nMain risk and mitigation strategy have been outlined in the proposal. I am giving 4 star rating because of my first observation that the problem statement is not clear and not emphatic. however the other factors have been addressed well.", "q0r": 4, "q1": "The plan presented in this proposal is quite detailed. The plan is divided into clear phases as Phase 1 to Phase 3 with specific schedules of activities to be performed by specific team members with specific timeline which is impressive. \nPhase 1 is about data collection and documentation from October to November 2022.; Phase 2 from December to February 2023 and it is about Database building & workshops and Phase 3 is about Project documentation from March to May 2023. The whole project will be completed within 8 months. \nThe budget amount requested is a total of $39600 which has been broken down into detailed costs for specific activities outlined in the proposal such as cost for QR code labels, data collection data base and website being the highest cost item at $10000\nThe team is made up of 4 experienced members with their names listed, their various skills listed with their qualifications. However links such as LinkedIn for further checks were not listed. Because of this reason, I will give this section a 4 star rating. \nThe proposal mentioned that they intend to seek further funding for future projects to ensure sustainability of the project in the future. The team is working on a previous funded proposal but do not have any other proposal in other challenges in Fund9.\nApart from the absence of links to check team experiences, I think the proposal can be successfully implemented based on the detailed plan and qualifications and experiences of team listed in the proposal.", "q1r": 4, "q2": "As indicated in the proposal, the team will measure the performance of the Lotus Linked , the workshop attendance and social media documentation. The Lotus Linked will be measured from the official project website where users will be able to see each product and cultural craft featured in the project; Workshop attendance measured through the number of workshop participants for each session; social media documentation from using twitter and others mentioned in the proposal. \nAll these progress and reports will be posted on their weekly twitter spaces and official project social media account for community reference. \nThe proposal outlined their success for the completion of the project as local communities in Vietnam would have been able to account for authentic local goods; local communities would be able to author and record narratives related to their cultural heritage, etc. \nIt was mentioned that this proposal is new, and SDG goals added also fit the proposal.\nWith the facts outlined above I think this section deserves a 5 star rating for providing sufficient information to audit the progress and success of this proposal. ", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3873, "q0": "The idea of ​​​​the proposal has identified many problems to be solved in this challenge, most of which meet the problems posed by the challenge, but the impact scale is small, with many limitations. limited, only within a certain area with certain conditions. Also, this is a good idea, it has the potential to bring value to the Cardano ecosystem, and the author can make it better, I look forward to seeing this project again in the next Foundations if The project is not Funded in this Fund. The idea was piloted in Ninh Thuan - Vietnam, where the weather is hot and the capital of the Champa ethnic community. If the idea is executed well, it can be replicated in other villages with similar agricultural and cultural conditions around the world. The impact of this project is quite large,\n\nThe solution of this proposed idea is excellent, it identifies almost all the problems that need to be solved in this challenge, and the author's argument through the description is logical and clear. clear and complete. However, the collection of information data such as names, physical properties, and proportions, history, cultural symbols, cosmetic manufacturing processes, traditional medicine, traditional foods, traditional ceramics, traditional textiles, etc. It's all posted on web3, so can the info be edited?, the author considers casting the above info under NFT, that's my opinion, here of course it's a very good idea and humanities.\n\nThe concept of this project has detailed some risks when implemented, the author of the idea also mentioned many solutions to all of those risks, which makes the risk management of the project very difficult. the project faced many difficulties. Projects from the community if Sponsored will be easier and clearer. In addition to international travel risks, operational risks, and technical risks, the author considers the risk of disease outbreaks, the risk of lack of manpower when implementing and the solutions to those risks, thus enhancing the project's impact.\n", "q0r": 4, "q1": "Very well, This Project provides clear and reasonable timelines for implementation and completion, relative to the information provided. This is workable, however, the goals are not specific to the information provided. the potential of the project. Also, if the project is funded other than that suggested by another author in fund9 is funded, I wonder if the project is on the right track as the creator of this idea is not directly running it?!.\n\nThe project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. Phan Rang is an area with a relatively low cost of living compared to the average in Vietnam, while the database and website part is the most important and budget-intensive part of the project. Very scientific and practical.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are entirely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project is Cardano Noodz, along with collaborators Rimaong Campa, ThisCrazyLife, and Ja Deng said that this is an experienced team to implement this project, but the author please provide more link information to identify reputable identities such as LinkedIn, Facebook, Twitter, Discord, ... for the community to verify identity easily and practically.\n", "q1r": 4, "q2": "This project provides KPIs for accomplishing the project's goals, but some of the goals are difficult to measure compared to the information the project provides. lotus links on the site should be fully measurable on updated products, hopefully, conference attendance and other updated materials should also be linked to easy-to-measure channels should help the community has better control over the project's roadmap. running.\n\n  The ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. The author should also let this proposal run a test whether sponsored or not, of course in simulation or the form of an online conference so that the author will see the practicality of this project.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5806, "q0": "Yes, This proposal very effectively meets the challenge of promoting Cardano in East Asia.\nThe proposer is planning on staying in Vietnam for over 6 months creating Cardano integrations with local communities.  This type of project is definitely valuable for Cardano ecosystem and will create a lot of engagement. The plan is very clearly laid out and easy to understand. ", "q0r": 5, "q1": "The proposer is a PHD student and fluent in both English and Vietnamese. This is a very good skill and will significantly increase the likelihood of success. The proposer is a well known personality in the Cardano ecosystem. The plan presented is very detailed and can definitely be implemented successfully. I gave this proposal a perfect score based on these findings. ", "q1r": 5, "q2": "The project can be audited in multiple ways including Social media, workshops and on the cardano blockchain itself. This would be highly accurate and auditable because the Blockchain is pubic and can be viewed on multiple tools. There is a very detailed budget breakdown so the money expenditures could also be traced and documented. I gave this a perfect score of 5 stars because this was very well though out and I think would be very clear win. ", "q2r": 5, "assessor": "z_assessor_2751", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7433, "q0": "The project addresses a very urgent issue today, helping to preserve ecological products, handicrafts, and heritage tourism. As society develops, people pay less attention to traditional issues. If the digital world can be combined to preserve and develop heritage, that is a great thing. Both help consumers verify the origin and correctness of the product.\nI agree that the project divides the solution into three specific phases: data collection, profile building, and QR-code creation. The project helps to raise awareness and preserve the traditional heritage of East Asians in general and Vietnamese people in particular.\nI appreciate the risks the project can anticipate and how to limit them. I would like to add there should be some quality risk. Does the project have a plan or plan to ensure or control the quality of input products in accordance with the proposed process? This is a core element to create loyal customers and promote the product widely. I think 4 points are appropriate for this part\n", "q0r": 4, "q1": "The stages and work items you list are quite detailed. The right time for you to complete. Your budget is reasonably balanced and fully covered, accounting for ~16% of the entire Challenge. At the same time with a strong team, diverse in fields, and knowledge about the country and people of Vietnam, I believe the project will launch smoothly. I only see one inconsistency, at the end of the “blueprint” section you are great for proactively providing the information “do you have a co-proposal with another project in F9”. However, in the section “[FEASIBILITY] Are you or any member of your team working on any other proposals in this Fund9?”, you answered “No”. This may have been a small mistake when presenting the project to Catalyst so I'm still happy to give it a 5, the project really deserves it.", "q1r": 5, "q2": "The project indicators raised are easy to quantify and check, and the update channels are fully reported, making it easy for the community to track the development of the project. I think the project should report more on the number of products sold and analyze the data increase or decrease compared to before. And especially customer feedback like? From the time of purchase to the time of using the product. This is a useful metric that is a powerful tool for promoting a product. I'm looking forward to the project getting funded and launched, hope my suggestions help the project. I rate this part 5 points", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7893, "q0": "After examining all information on the presented information, I strongly agree this proposal addresses the challenge of Growing East Asia and Cardano. Lotus Link will be helping to raise awareness about Cardano in the Agriculture sector. There will be workshops where locals can learn about Cardano, and Lotus Link will also bring awareness to consumers of the agriculture as well as the goods market where traceability initiatives are implemented. Lotus Link bringing quality assurance and traceability to the local Agriculture system as well as goods economy, will the economy and lives of locals and also gives them exposure to the Cardano Blockchain. This will lead to Vietnam having more prosperity while having Cardano integrated into its agricultural system via Lotus Links; this will grow both East Asia & Cardano. ", "q0r": 5, "q1": "After examining the proposal's plan and team experience, I believe that it is extremly likely that this proposal will be implemented successfully.  The team presents all experience and relavent skills, as well as evidence of these skills. The team has members that are very familiar with the local language, and also have someone with the technical skill, as well as someone familiar with the local agriculture and economy;  needed to carry out this proposal successfully. The proposal lists appropriate timelines as well as the resources which are required to carry out the tasks all the way from data collection to implementation of the proposal.  Technical aspects that are required for the team to collect data, create a database, and implement the proposal in the local agricultural and good economy for tracibility is also accounted for. The proposal also lists technical as well as operational risks it could face, and how it would potentially avoid those risks. This all leads me to strongly believe the proposal will be implemented successfully.", "q1r": 5, "q2": "From the information examined within the proposal, I strongly believe the project can be clearly audited in regards to what it is trying to achieve. There is a clear roadmap with milestones that the team will achieve all the way from data collection to implementation. The proposal clearly states the problem it is trying to solve within the agricultural and goods section within Vietnam and how that can be measure against the outcome of the proposal. The proposing team does have multiple social media outlets which they are already very active on, where they will be sharing updates on the progress of the project should they get funded. This all leads me to strongly believe the proposal can clearly and easily be audited.", "q2r": 5, "assessor": "z_assessor_2933", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8948, "q0": "As we see many agricultural goods fail to reach the consumers , as it is rejected by quality assurance team , this issue is seen allover the world, Hence to overcome such scenario in Vietnam proposer here wants to Develop product-traceability infrastructure using Cardano metadata for agricultural and cultural-heritage products, hence to make  to  members of the local community understand how to create their own native assets on Cardano and label their product with unique Qr code is a great idea , which helps as promotional aspects for farmers and it even helps in growing cardano community still more stronger, Hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task is moderate to achieve as it involves research and development of data,and later uploading the data over the meta . However Center for Vietnamese Philosophy, Culture & Society has been continuously doing research over Lotus from the past which displays research works is almost near the end phase, so conducting workshop for the local farmers and making them understand to make native asset can also be achieved without much difficulty, the last work of documentation and publishing with unique Qr code can also be achieved , with the code already provided and most of the research work is completed , With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly mentioned the each step that will be involved in completing project, that is from data collecting to data documenting, it even has displayed some of the research work that has already done by team towards lotus with the images which is definitely a great boost to the audit and as well as project , audit even contains a sample template for entries in the Lotus Link Database which shows the project is continuously on phase before funding.\nThe audit has introduced all the team member who'll be working on project from research team to documenting team, it contains detailed timeline to complete the project , audit even has well structured timeline to make the project still more efficient , Hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9364, "q0": "I appreciate your project. This is a great project. I will definitely rate you 5 stars. Because you have presented very specific and detailed problems. You have many beautiful, vivid pictures and videos. However, I realize that you are all not Vietnamese. Is it difficult to implement this project in Vietnam (Sen Caraih Farm, Ninh Thuan province, Vietnam)? The proposal covers the following areas in great detail: Cosmetics, Traditional Medicine, Traditional Food, Traditional Pottery, Traditional Textile. You guys need to spread the knowledge about Blockchain and Cardano for everyone to understand because I see in the proposal that it will be possible to create data entries for their local products, using the infrastructure. trusted for this information and increase their participation in the Web3 world powered by Cardano. Hope the project will be done well,", "q0r": 5, "q1": "You present this part very easy to see, with logic. The work schedule is also fine. Your budget breakdown gives the full information. The team has good and experienced members. However, you need a link to help people verify the information is correct or not.", "q1r": 5, "q2": "The proposal to provide clear insights on tracking your project's progress is Lotus Linked, Having its own website will make it easier for users to view each eco- and cultural craft featured in the project. judgment. Because They will contain the full range of entries related to these local products, as well as direct links to view their associated metadata recorded on Cardano. In the proposal, you also incorporate the use of social networks (Use Twitter) to measure the progress of the project. I completely agree with this.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10853, "q0": "EcoFarm Traceability. Develop product-traceability infrastructure using Cardano metadata for agricultural and cultural-heritage products. Implement QR Codes containing quality assurance, cultural, & historical information. I think the proposed goal more or less meets the challenge goal. I believe if the project is successful, it will contribute to raising awareness about the potential and opportunities that the Cardano ecosystem can bring. ", "q0r": 4, "q1": "The first thing that makes me believe in the feasibility of the project is the team of members. This is a project related to the agriculture and cultural heritage of Vietnam. LOTUS LINK is an international project team consisting of individuals from the United States and Vietnam. Although there are many foreign members, they have lived and have time to study Vietnamese culture. Besides, I think the team has a pretty clear plan. The plan is outlined for each month in each phase of the project. All months have a short and concise description that allows me to understand what activities to expect. Speaking of budget, I highly recommend this part. They are presented clearly and in detail. ", "q1r": 5, "q2": "This theme of the project is quite good. The publisher provides quite a number of ways to measure project progress. However, I think the success of the project would be more obvious if the author had more specific numbers. In the successful description of the project, it is mentioned \"Local communities learning how to use Cardano solutions for the development of local business; Cardano Catalyst Project contribute to the sustainable development of emerging markets in Southeast Asia\" How the Cardano community can these can be verified. ", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11101, "q0": "Vietnam's economy is developing rapidly towards modernization. In addition to genuine investors and manufacturers who are always innovating and creative in their work, wishing to bring the best products to society, there are still some for-profit manufacturers that defy the law. Counterfeiting, counterfeiting creates low-quality products, affecting consumers, causing significant damage to the country's economy. Faced with that situation, you have made a proposal: \"Development of infrastructure product traceability layer using Cardano metadata for agricultural products and cultural heritage. Implement QR Codes containing historical, cultural information and quality assurance\". I find this to be a very valuable proposition that directly contributes to the economic development of communities in Vietnam. With improved quality assurance and product traceability, they will be able to enhance the success of their agribusiness and local cultural heritage while finding ways to promote sustainable farming. sustainable and equitable local products based on traditional farming and material production methods. The proposal outlined the possible risks and provided an explanation to reduce the risks appropriately", "q0r": 5, "q1": "I have read very carefully your solution, I see in Vietnam the development of product traceability infrastructure has been applied in agricultural production, but you have renewed it by doing it very creatively. that is using Cardano metadata for agricultural products and cultural heritage. I see that you have developed a very detailed plan with specific actions to implement the proposal. From a good proposal, I want you to do well in communication and marketing to spread the value of the project to the Vietnamese community. I found the detailed budget analysis for the project quite detailed, the spending contents are appropriate. The members working in the project have a clear background, have good professional competence, I believe that you will succeed with your proposal.", "q1r": 5, "q2": "You have provided information to measure project progress, I find the information is still general, not specific. In my opinion you should perform project progress checks according to the timelines as in the plan for easy implementation. The success of the proposal is described quite clearly by you. This is a new but very potential project, if successful it will bring benefits to all three parties: Producers, consumers and the state. I support your project.", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11785, "q0": "Quite clearly, “Lotus Link: Eco-Farm Traceability” is a good idea, closely linked to the challenge setting. I appreciate the practical application of this idea because it has brought blockchain into agriculture - one of the vital areas of my country, Vietnam. The solution given by the authors is to use Cardano's blockchain metadata to deploy a database, and generate QR codes to help trace the origin of agricultural products and the cultural heritage of the Cham ethnic people in Vietnam. This QR code will contain historical, cultural, and quality assurance information. All of this data will be recorded on the blockchain and presented in a simple, visually accessible web3 format. The purpose of the solution is, to bring blockchain to life and raise awareness about Cardano and blockchain in the local community in Vietnam. In Vietnam, the application of technology in agricultural production is currently very interested and given special priority by the Government. In particular, the issue of traceability of agricultural products is gradually becoming one of the mandatory requirements to meet circulation and export standards. However, one of the leading difficulties in traceability is the lack of a complete database (who, where, when, and accompanying quality standards..). The authenticity of applications and traceability software is currently relatively low. Therefore, this solution opens up a great opportunity for Cardano to penetrate deeply and reach the Vietnamese community, thanks to its high applicability and timely response to the concerns of Vietnam's agricultural industry. Although this solution's impact scope is only in a small geographical area - selected by the group is Sen Caraih farm, located in Ninh Thuan province, Vietnam. However, I believe that if approved by the community, this solution will open the door for Cardano to penetrate deeply and widely into the agricultural and heritage sectors across Vietnam. In Vietnam, each locality has a number of unique agricultural products and outstanding cultural heritage. This is a huge database that can be collected and stored on Cardano's blockchain infrastructure. However, regarding the risk of preventing success, the team considered three main risks: frequent international travel (because the project owner lives in the US), the risk of delay in data collection data, and technical risks due to unforeseen loss of life in rural areas. Personally, I think another risk to take into account is that the depreciation of the ADA coin in the bear market can affect the project budget. Therefore, the group needs to set up a reserve fund of 10-15% of the total budget. Overall, I appreciate the solution information given directly, clearly, and specifically by the team. My score is 5.", "q0r": 5, "q1": "The project implementation process and budget were also presented in a very detailed and transparent manner by the team. The implementation plan is expected by the group in 7 months (from October 2022 to April 2023). In which, the data collection (product name, properties, origin, production process...) will be completed in 3 months. The full database will be completed in the 5th month. After that, complete the QR code and start advertising communication. Vietnamese and English languages will be used simultaneously in the database construction process. Personally, I am very impressed with the plan presented by the group that is very complete, concise, and clear. Regarding the implementation budget, most of the items have an explanation of the expected unit price and quantity. However, there are still some items that need additional information. For example, $4000 label printing cost, $1000 workshop material cost without unit price * expected quantity needed. Similarly, the $2000 web hosting and development section also need a more specific explanation, including the cost of the domain purchase, hosting/year, interface design... Regarding the team, Lotus Link consists of 3 members from the United States and Vietnam, who have experience in the field of blockchain technology and an understanding of Vietnamese cultural heritage. Reference links to individual profiles provided by the team are complete and unambiguous. I believe that the project is likely to be successfully implemented if it is funded by the community. My review score is 4 points, -1 point deduction has been made in the budget section due to some expenses that need further clarification.", "q1r": 4, "q2": "Regarding auditability, I think that the community completely has enough grounds to audit this project. Firstly, the output of the project is the Lotus Linked website - where the community can access to learn about agricultural products and cultural heritage. Second, the number of QR codes attached to the generated goods is also an important indicator to evaluate project results. In addition, a number of other success metrics were also mentioned by the team: the number of participants in the workshop, and the number of followers on Twitter of Lotus Link. Unfortunately, the team did not provide any specific KPIs. The community needs as detailed as possible KPIs to understand the success of the project. Due to the lack of KPIs, I made a -1 point deduction for this. My rating is 4.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11810, "q0": "I find the Lotus Link: Eco-Farm Traceability proposal to be a good one and closely linked to the Grow East challenge, Grow Cardano in raising people's awareness of the blockchain market and the Cardano network in the region of East Asia, especially here in Vietnam.\nThe uniqueness and outstandings of the proposal when applying the Cardano ecosystem to life by developing a product traceability infrastructure using Cardano metadata for agricultural products and cultural heritage. QR Code implementation contains historical, cultural and quality assurance information.\nI appreciate the impact and ideas of the proposal as it will provide tourist village communities in Vietnam with an infrastructure to sell local goods - especially in the context of agriculture and tourism heritage tourism is being promoted to promote traditional culture to consumers and visitors. In order for this form to be more and more developed and replicated, for each local commodity, it is necessary to ensure good quality, clear origin, reasonable price ... are the issues that are being given top priority for each locality. Therefore, the traceability for ecological products & crafts becomes even more urgent when customers need clarity, speed, accuracy and reliability of information when they follow. I consider this an interesting point, different from other proposals with the same challenge and a pressing concern of the Cardano community. Because the impact the proposal has on the community is so great, I'll give this project a score of 5. A perfect score on the rating scale.\n", "q0r": 5, "q1": "The project has provided a master plan consisting of 3 main phases with the work to be done to implement the accompanying implementation. Inside is a detailed plan for each month, I consider this plan to be very specific and reasonable, with a detailed and clear work schedule for each team member.\nThe project budget is $39600, which is 15.8% of the total budget allocated for this challenge. To me, this is a number that makes perfect sense. The authors have divided the budget used for the items very clearly, explaining in detail how that money is used. The breakdown of expenses I find appropriate for each category and expenditure is necessary.\nThere are 3 main risks identified by the team: international travel risks, operational risks and technical risks. The measures taken by the authors to overcome these risks are very necessary and satisfactory, proving that the project team has carefully researched when providing solutions to overcome risks to bring about risks to the success of the project when it is funded.\nI find the project's proposer entirely possible implementing this proposal. They are experienced, knowledgeable, qualified and have a long-term understanding and research on the local culture and people of Vietnam. I see a lot of accounts that link to community sites such as web, twitter, youtube... and the identity information of the author group has provided to the community. The information is clear and completely verifiable. The project includes collaborators from the United States and Vietnam, once the project is successfully funded, I see the scale of the project and the impact it brings to the community is very important great. I will give the feasibility of this project 5 points because the information provided by the author team is very complete to me.\n", "q1r": 5, "q2": "To me, this project is completely auditable, the community can monitor the implementation level and successful progress of the project through each month, each specific phase of the project. Since this is a project with a long implementation time and a large budget, the author team has also committed to the community to update the progress throughout the project period until completion for continuous and close monitoring.\nThe proposed measurement KPI is evaluated on 5 criteria such as lotus links, number of workshop attendees, social media materials, project space and social media. I find these criteria quite detailed and complete, covering the success of the project, but the author needs to include specific data for each evaluation criterion, this will help the community a more detailed view to evaluate the success and effectiveness of the project.\nThis is a new proposal, I will give the transparency of the proposal a score of 4 because more metrics are needed for the evaluation of the project's success. I hope the proposal will be funded at this 9 fund, thereby opening a new development for the application of the Cardano ecosystem in Vietnam and can be replicated throughout East Asia.\n", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12689, "q0": "The problem raised by the proponent is that village communities in Vietnam need the infrastructure to sell local goods - especially in the context of agriculture and heritage tourism. Authenticity must be demonstrated for eco products & crafts. The proposal presented how it would add value to the Cardano ecosystem by Developing a Product Traceability Infrastructure using Cardano metadata for agricultural products and cultural heritage. QR Code implementation contains historical, cultural, and quality assurance information. The solution of the project is EcoFarm Traceability which consists of 3 stages: Data Collection & Documentation. Database Construction & Workshop. Implementation & Filing. Each entry for local products will at a minimum contain NAME, PHYSICAL PROPERTIES & RATE, HISTORY, CULTURAL SIGNAL, and PRODUCTION PROCESS. Members from the community will be able to create data entries for their local products, use a reliable infrastructure for this information, and increase their participation in the Web3 world due to Cardano provides. Ensure quality, secure authentication, thereby expanding the scale of the project. I rate 5* for the impact of this project.", "q0r": 5, "q1": "The proponent identified the project participants as an international project team consisting of individuals from the United States and Vietnam and also provided specific and detailed evidence on the roles, and experiences of each member of the group implementing the proposal. The proponent requests funding for the project is 39,600 Which includes cost, International Transportation: $3000, Cost of Living in Vietnam: $5200, Data Collection: $7000, Database & Website: $10,000, Workshop: $4000, QR Code Label: $6500, Handbook: $1900, Project Video: $2000 with a clearly outlined budget by the proponent, broken down into the items corresponding to each specific cost look at which voters can identify. The actual project implementation timetable is given within 7 months with 3 phases and in each phase, the proponent has planned specific tasks and time for those works, look at project progress can be determined. In addition, the proponent has calculated the risk and offered a solution to solve that risk, from the above information I strongly agree that this proposal will be implemented successfully, I rate 5 * for the project feasibility.", "q1r": 5, "q2": "The proponent provides a specific roadmap within 7 months with 3 phases, important milestones and time for each milestone have also been provided by the proponent. When the project is successfully implemented, it will provide the fundamental traceability infrastructure needed for local products in Vietnam, especially agricultural and cultural-heritage products. Create a case study and guide for future application in agricultural and cultural-heritage contexts around the world. The proponent has also carefully selected metrics to measure and track his project's progress, and I think those are the right ones. The proponent clearly describes the problem Village communities in Vietnam need the infrastructure to sell local goods – especially in the context of heritage agriculture and tourism Authenticity must be demonstrated for eco products & crafts and provide a solution to the problem so I rate 5* for the auditability of the proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14105, "q0": "Yes, because as stated in the plan, Lotus Link will help to raise awareness of Cardano and blockchain among local communities throughout Vietnam. as the consumer of the local products will be invited in making of the product it will create awareness in the consumer. This project seeks to make a direct contribution to the economic livelihoods of communities in Vietnam. With improved quality assurance and product traceability, they will be able to improve the successes of local agricultural and cultural-heritage business.", "q0r": 5, "q1": "Yes, Because This project places the environment front-and-center with respect to importance, and seek to promote the sustainable and equitable cultivation of local goods based on traditional methods of farming and material production. Through the project's workshops, handbook, and promotional media, it is designed to be sustaining over time for local community members who want to implement Lotus Link for their own purposes using Cardano native assets. And also as the timeline is given we can say that the plan have high probablity of getting implemented", "q1r": 5, "q2": "Yes, because in the official project website, there will be a section called Lotus Linked where users will be able to see each eco-product and cultural craft featured in the project. These will contain the full entries related to these local products, as well as direct links to view their associated metadata recorded on Cardano. Moreover document the number of workshop participants for each minting session, noting those who have previously attended, as well as the assets that are created from these sessions. Using Twitter, metrics of project engagement will be regularly tracked and documented. Statistics such as number of impressions and attendance during live events will be incorporated, Hence proper monitoring of the plan can be done easily. \n\n\n\nSPACES\n\nI will host weekly twitter spaces live from Vietnam for members of the Cardano community to keep up-to-date with progress throughout the duration of the project until completion. These will be featured on my personal twitter account @CardanoNoodz", "q2r": 5, "assessor": "z_assessor_3902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Develop product-traceability infrastructure using Cardano metadata for agricultural and cultural-heritage products. Implement QR Codes containing quality-assurance, cultural, & historical information.", "experience": "Dave (@CardanoNoodz) Project Director\nAmbassador — Tokhun.io\nCo-Founder — The Alexandria Project\nStake Pool Operator — inFinite Possibilities Stake Pool\nResearch Fellow — Center for Vietnamese Philosophy, Culture & Society"}