{"id": 422510, "author": "jeffghome2020", "title": "Cardano Outreach - China Focus", "url": "https://cardano.ideascale.com/a/dtd/422510-48088", "category": 26602, "amount": 4500, "description": "Our funded project needs to hire local Chinese speaking developers to promote our educational program to Chinese university and college students.", "f6_no_assessments": 7, "f6_rating": 4.523809523809524, "videos": [], "media": [], "f6_assessments": [{"id": 5027, "q0": "The proposal team wants to hire two Mandarin-speaking developers/educators who will be presenting Cardano outreach’s educational content to Chinese students and professors. This is a test run to see the impact created through this process. The hired educators will be attending bi-weekly meetings, onboarding students and interested parties to either Cardano as a whole or the Catalyst ecosystem, and preparing the close-out reports. If successful, this proposal creates a moderate impact to the ecosystem. The success of the proposal depends on the quality of the hires and their ability to clearly explain the immense potential blockchain technology has. With these reasons in mind, the proposal has been rated a four for impact.\n", "q0r": 4, "q1": "The fund required is to pay a monthly salary for two of the recruited educators. They conduct bi-weekly onboarding meetings. Based on the experience of the proposers in the Catalyst ecosystem, I believe that the proposal has a very high chance of being implemented. It’d really have helped the proposal get a higher score if a brief explanation of how the team would go about finding these educators, and how the candidates are screened. This adds legibility to the proposal as a whole. Based on this rationale, a rating of four has been awarded for the feasibility section.\n", "q1r": 4, "q2": "Currently, the auditability metric is the number of students onboarded from each session conducted, and the total number of students attending each session. The team plans on measuring the numbers onboarded by counting the number of referrals in fund 10. Another way the team plans on creating an auditability feedback loop is by creating Tik-Tok channels and measuring engagement. I think it’d help if the team has a sign-up form and further meetings with interested students to create a more personalized onboarding experience. Based on the auditability criteria, the proposal has been awarded a rating of four.\n", "q2r": 4, "assessor": "z_assessor_2663", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7143, "q0": "This proposal is an extension of the Cardano Outreach educational program where the proposer held sessions for students (currently reached more than 3,400) in which they onboarded student talents to the Cardano ecosystem by introducing them to Project Catalyst, demonstrating projects such as Minswap, and more. The main purpose of this proposal is to request help by hiring two computer science or engineering students from Chinese universities who are passionate about blockchain in order to better facilitate the educational program for Chinese universities, professors, and students. I believe this aligns well with the challenge setting because, undoubtedly, having someone with native language fluency and also possessing the technical knowledge around Cardano would significantly help smooth the transfer of knowledge in that educational program. I applaud the proposer’s initiative to determine the continuity of the 2 new educators based on the two-month results. In the end, I strongly agree with the proposal's contribution because, as a student from a non-English-speaking country, the language barrier is definitely there and a lot of students are uncomfortable asking questions, which ultimately reduces their learning outcome.", "q0r": 5, "q1": "I don’t see anything that might hinder the proposal's implementation, especially considering the proposer’s experience in Project Catalyst. The proposal has allocated 3600USD as the salary for two educators for two months and 900USD to onboard, manage, and document the whole process. Those amounts are reasonable. However, the proposer could definitely elaborate more on what the educators are going to do (not just state \"assist with Twitch and Zoom streams\"), how much time will be spent on onboarding, how many sessions they will be involved in, etc. Another thing I should point out is the lack of mitigation on the challenge of finding the right educators. The proposer has already considered the challenge of finding students who are both fluent in Mandarin/Cantonese and English and have a decent understanding of blockchain technology, but there is no mitigation plan offered. However, I don’t think this is a huge problem because the proposer can reach out to the community and start from there. I think it's better to mention ways of mitigating the challenge in the proposal.", "q1r": 4, "q2": "There should be no problem with auditing because the proposer has been funded four times before, so they understand what kind of information they need to measure and how to provide it. In the proposal, the proposer plans on providing regular reporting through Coordinator and requiring the 2 new recruits to participate in the final report. The timeline for this project is two months, they target each presentation to reach 50 students and measure the engagement of the students as the metric. I really applaud the proposer’s initiative to create a separate wallet to ensure the budget allocation integrity. In the end, I am confident we could keep track and monitor the project's implementation smoothly.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9367, "q0": "With the proposal of the project, I see that you are not native Chinese, so finding and language disagreement is easy. You need to find more Chinese team members who are knowledgeable about Blockchain, from which this member will help you find talent to transfer your education program to students and professors in China. . This will be more convenient for you. I agree with your solution and find your difficulty is similar to my thinking that is when sourcing an educator who not only speaks the required languages but also shares the same passion. Passionate and knowledgeable about blockchain technology. But I think China is the most populous country in the world for sure you will find.", "q0r": 4, "q1": "I see that you have a lot of experience and success in previous funds. This also makes people trust you more. I find $900 per educator hired per month to be a reasonable amount. You should present each idea and have a total for everyone to easily follow. The detailed work plan in the project is also not clear, you should have a roadmap with specific timelines for example by day (10 days) or week by week...", "q1r": 4, "q2": "Those who have been successful in previous Funds, have organized lessons for 3,400 students, introduced 40 projects of which 3 have been funded. Since I have such prior experience, I think KPIs should be sufficient to provide Cardano stakeholders with student engagement, referrals to Catalyst, and feedback loops. That is proof that the usefulness of the project is creating. I also agree with the way you guys engage the community by introducing creative media channels like Tiktok. Because Tiktok is a Chinese social media and music video platform launched in 2017, people there I think love this. And the development on this social network is reasonable.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11199, "q0": "Yes, this proposal effectively addresses the challenge.  I also like that they are focusing on areas in Cardano that are lacking.  The areas of Computer Science, Business, and Law are extremely important areas for us to tap into.  They have already reached 3400 students, and I think they have a great foothold to keep going.", "q0r": 5, "q1": "Yes, they are Fund 4,6,7, and 8 winners.  They have a team of 5 people that are actively involved.  Management leads, Computer Science and IT leads.  All qualified to deliver on this proposal.  All of the content has already been created.  They are just looking to hire 2 professors to educate based on this content.  I like that they are using successful developments from their past experience to help this current proposal succeed.", "q1r": 5, "q2": "They are going to provide regular reporting to Catalyst via Coordinator.  They will measure the number of students involved and referrals to Catalyst.  I would like to see the students surveyed on their experience of the material presented.  Did they enjoy the content, and do they feel like they now have a good understanding of Cardano.  And they should also be asked if there is anything that could be improved or added to the coarse.  I would also like to see that every new student is shown how to create their own Cardano wallet.", "q2r": 5, "assessor": "z_assessor_3230", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11558, "q0": "The project seems to have a simple goal: to expand Cardano's reach in China by focusing on the local Chinese communities in their native languages by hiring two local Cardano team members who speak Mandarin/Cantonese. The project's intention is clearly aligned with both the challenge setting and the Cardano fundamental pillars because it would raise awareness about the Cardano blockchain, Catalyst community, onboard local talents, foster collaborations, and most likely result in increased adoption of the technology in the Asian continent. The impact described in the proposal is likely to be local, as this is one of the first pilots aiming to engage in later FUNDs and spread even farther to other regions, as it has in previous Cardano Outreache's.", "q0r": 5, "q1": "I believe the project will be successful because Cardano Outreach had already successfully organized meetings and workshops and reached over 3400 students over the years with a lot of ongoing social media activities with the goal of engaging with a fairly large audience. Furthermore, the proposer and team member have presentation skills, as well as an IT and management background, all of which are relevant to the project. Furthermore, they provide specifics on how they intend to reach out to the local Chinese communities and have already provided information on the lecturers they intend to hire, both of whom are Chinese students with an IT background.All of the roles and responsibilities are also described with the full-time commitment of one of the members. The proposal also includes contact information to further support the reliability of the information provided. The project's timetable is straightforward, as it aims to run a course for two months. The budget is also very simple, requiring only an incentive for educators for two months and some compensation for project leadership. In my opinion, the budget is modest, reflecting the lower cost in China. No other cost are being required as the coordination of the lecturers is planned to be online. ", "q1r": 5, "q2": "I believe the community will be able to easily monitor the project for a variety of reasons. First and foremost, the team intends to demonstrate to the Catalyst community regular reposts through a designated coordinator and to deliver a final report video. Furthermore, the team utilizes a number of social media channels to facilitate communication and feedback loops between the community and the team. The KPIs are likely to reflect well the scope of the outreach. On the other hand,  the proposal's delivery dates and milestones really aren't specific enough. For example, the date or timeframe when the final report video will be released is missing.  Overall, I believe there will be no issues with monitoring ongoing actions because the team previously shared multiple experiences on the Cardano outreach twitter account.", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11720, "q0": "The proposal is simple and concise. I believe that these 3 individuals, I think based in Canada, has a strong devotion to spreading the good word of cardano around the world, and this proposal particularly narrows down their scope to focus on China alone. They have had funding from several previous rounds of catalyst and is credible that the team is committed to growing their efforts, hopefully into the near medium term. For each time they raise a fund through catalyst, we see that they're expanding to reach to a different set of target audience. The past were university students, now its China, in a different language. I applaud their effort to contribute to this challenge, outside their native country where they are based at, and to put their knowledge to good use to drive further positive impact for cardano from untapped markets across the globe.\n\nIn terms of traction, after 4 rounds of funding, the attached youtube channel has garnered 1.6k followers, while twitter has 792 followers. These numbers are steady and reasonable growth when analysed over the timeframe of the last 4 funding rounds that they participated in. the risks stated in the proposal is an obvious one, but coming from the region myself and  am part of the target community speaking the languages of mandrin and catonese itself, i do not foresee great risks for this proposal to be successful. There is a small community of blockchain enthusiasts in the region (compared to the west), in the target segment that they're looking for. with some effort, i'm sure they'll find the educators they need.", "q0r": 5, "q1": "because the team has had a track record of successful funding  and the past execution based on the links and materials given, adding on the project catalyst tracker google sheet for funded projects, provides confidence that this proposal will more likely be executed well. \n- timeline provided is simple and clear, with assumptions stated. \n- budget breakdown is simple to understand as well, though it would have been better in bullet points rather than a paragraph.\n- credibility of team is established, adding on a successful track record from previous funding rounds, showing commitment of the team.\nlittle to no ambiguity here except for the disclosure of other projects in fund 9 the proposer is working on, but that is consistent accross the bulk of proposal in this fund not disclosing the other proposals they're working on. overall, 5 out of 5. ", "q1r": 5, "q2": "the method of reporting their KPI is well established, since this is an existing project. It will be done via Coordinator, and inclusive of a video. they have objective metrics defined with measurable numbers that are easy to track. the vision for project success is also clear to visualize.\n\nHowever, I would have expected to see an element of KPI involving the growth of their social media followings and traction in this section, apart from those mentioned like number of students they engaged, number of referral to catalyst. If there was a reason for this exclusion perhaps being not accurate as a measure of KPI, it would have been best to include it here for justification. ", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12427, "q0": "[Disclaimer: The proposer has submitted 2 proposals that are related to hiring local Cardano developers/community members (1 in Africa and 1 in China) to expand their past funded project’s scope. These proposals are very similar in their goal and structure. As a result, the assessments for this set of proposals will also be similar]\n\nThe premise of this proposal is quite simple. They have a project that has been funded in past Fund regarding raising the awareness of Cardano and they want to bring the project to China. To do this, they need to hire 2 educators that can speak Mandarin or Cantonese to deliver their program to students and professors in China. I think the idea is acceptable and aligned with the challenge brief which is to grow Cardano’s outreach and adoption in East Asia. However, one thing that is lacking from this proposal (in my view) is the discussion regarding the challenge of recruiting these local educators that not only can speak the specified language but also has the sufficient knowledge about Cardano. This challenge was touched upon in the proposal however, there were no further explanation on how this will be overcome (i.e. the sites or method they will use to recruit these talents). Regardless, I think the proposal is still acceptable and can add value to the previous project.", "q0r": 4, "q1": "The project is a continuation of a funded project so the team should have the ability to carry out a similar objective, just in a different area. The budget has been broken down well detailing the monthly salary for the educators as well as compensation for the project leader to coordinate the project. The roadmap was adequate in explaining the plan since it’s pretty simple in term of its implementation however, an explanation regarding the schedule and number of program that will be delivered by the hired educators in the span of 2 months would’ve been ideal. As mentioned before, the proposer’s plan for recruiting these educators should also be explained. ", "q1r": 4, "q2": "The KPIs chosen for the project are number of students participating on each presentation and number of referrals to Catalyst, which are relevant metrics to measure the project performance, as well as being quantitatively measurable. Additionally, the proposer will provide regular reports (note: frequency not mentioned) to Catalyst that will include the new recruits and a separate wallet will be made for this fund meaning that the project can be audited clearly.", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}], "solution": "Our funded project needs to hire local Chinese speaking developers to promote our educational program.", "experience": "We are a fund 4/6/7/8 Project Catalyst winner.  I manage a team of 5 people who deliver educational content to students and professors. Our MVP has introduced 3,400 students to the Cardano Ecosystem. I am a semi retired university grad with extensive management experience."}