{"id": 422586, "author": "jtrube", "title": "Local Japanese Government Strategy", "url": "https://cardano.ideascale.com/a/dtd/422586-48088", "category": 26602, "amount": 15000, "description": "Local governments in Japan are looking for new and innovative ways to revitalize depopulated areas and serve their aging communities. Cardano and blockchain tech are rarely considered as solutions.", "f6_no_assessments": 8, "f6_rating": 3.125, "videos": [], "media": [], "f6_assessments": [{"id": 1929, "q0": "The proposer highlights the problem of \"depopulated areas\" and \"aging communities\" in their proposal but unfortunately has not given the supporting or backup data on why this problem matters to them or for the Japanese government/people.  A very interesting topic to raise within the Cardano community, but as an assessor, I cannot see clearly how this proposal will fit into the blockchain space - how Cardano as an Innovation or as a blockchain technology provider can help to solve the problem? Is there any unsolved problem with the current technology?", "q0r": 3, "q1": "The proposer gives enough reference and detail of the team needed to make this project succeed - relevant background and experience with local presence in Japan. Proposer also clearly mentions a detailed plan with a budget breakdown that seems acceptable.\n\nUnfortunately, for risks, the proposer shares a general outlook/approach and is not specified in this proposal - for example, is there any risk of doing the sessions with the government in a timely manner - or is there any other risk that may happen during the project?\n\nThe proposer shares a 3 months timeline to deliver this project, but has not breakdown in detail - such as - how many sessions in the 1st month to complete? or how many workshops are planned for the 2nd month?", "q1r": 3, "q2": "The proposer gives enough reference and detail of the team needed to make this project succeed - relevant background and experience with local presence in Japan. Proposer also clearly mentions a detailed plan with a budget breakdown that seems acceptable.\n\nUnfortunately, for risks, the proposer shares a general outlook/approach and is not specified in this proposal - for example, is there any risk of doing the sessions with the government in a timely manner - or is there any other risk that may happen during the project?\n\nThe proposer shares a 3 months timeline to deliver this project, but has not breakdown in detail - such as - how many sessions in the 1st month to complete? or how many workshops are planned for the 2nd month?", "q2r": 2, "assessor": "z_assessor_2289", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 2950, "q0": "The proposal talks about leveraging the network of business strategists, executives, and researchers in Japan to provide local municipalities with the knowledge they need to consider Cardano for innovation, problem-solving \"Local governments in Japan are looking for new and innovative ways to revitalize residential areas and serve their aging communities\". The solution is analyzed in detail, with a large impact scale. The proposal outlines some of the key risks, but doesn't show how to reduce it at the start.", "q0r": 4, "q1": "The proposal provides an implementation plan for 3 months, but it will be more complete if the details of starting time, specific assignment of work for each member are added. Team members have a lot of experience related to the project. The proposal requires a budget of $ 15000 for the main expenditures, but if the group can provide a more detailed breakdown of each expense, it will be easier for the community to visualize.", "q1r": 3, "q2": "The proposal to provide information is to report monthly, but by any means of communication for the community to monitor, there is no mention of it. The project has a good vision but it would be difficult to audit and measure the growth of the project without KPIs with specific milestones for a new proposal.", "q2r": 2, "assessor": "z_assessor_2365", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3412, "q0": "As we know, the population in Japan is aging and many places, especially small cities and towns are depopulated. If in order to tackle some of these issues, the cardano ecosystem and blockchain may provide solution, this would be a great way to make cardano be part of various options of recourse.\nThis proposal suggests to hold workshops and sessions with elected officials and policy makers in municipalities in Japan with a goal to put in place alternative solutions to the issues of depopulation and aging communities. By doing this will help increase the participation of the Cardano community and Catalyst teams with East Asian residents, and make this be adopted by the Japanese officials.\nWhat aligns with the challenge goal and as different community are depopulated and aging, it would be possible to scale this initiative and to have it expand globally in other cities and regions beyond Japan.\nReason for my to rate the impact with a 5 star\n", "q0r": 5, "q1": "The goal of this proposal is to provide the local municipalities with knowledge on how would the cardano and blockchain would be useful to help communities with aging population and those depopulated.\nThe two companies involved in this proposal: the Eggworm with specialty in branding and the Neoculture that aim to create better businesses with specialists in technology, strategists and other fields, is a an asset for the success of this proposal since they'll would be able to collect people and officials ideas and transform those into potential actions/projects that may be carried out by the municipalities to propose some solutions to the issues of depopulation.\nHowever, the proposal would be more self explanatory if some information were detailed and clarifies. Among the project implementation, there will be sessions and workshops, but there's no mention on where those one's will take place, and how many of them. What part of Japan is targeted, which cities, regions?\nThe sessions have to be facilitated, but who will be the facilitators, especially what will be their field of work and background, since reflexion would around how cardano may be used to solve some issue faced by the above mentioned communities, but the proposers team doesn't contain any member involved in the catalyst community, or working around the cardano. What's, the plan about this situation?\nThe budget breakdown is general, for instance there's an amount of money allocated to the workshops, what does this amount covers? venue, Presenters, logistics...? details about those items would help proposal readers to better understand the implementation process.\nBased on what I have mentioned, I'll rate the feasibility with a 3 star, not because the project is not feasible, but is missing some key details that will explain more the implementation process.", "q1r": 3, "q2": "The proposal doesn't mention clearly how will the progress be followed by the community, even though the deliverables are well defined with a report containing ideas on possible actions to be implemented by the municipalities.\ni rate this with a 4.", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5028, "q0": "The proposers want to consult the local government on using Cardano and providing them with strategies to revitalize the depopulated areas and serve the aging communities. They claim to have connections with the local authorities. No specific solutions are suggested as to how Cardano can be used to serve aging communities and depopulated areas. There is no mention of what kind of research methodologies and strategies would be implemented to be able to create such solutions. Due to the vague nature of the proposal, it’s hard to make an assessment of the impact it creates. The rating reflects the rationale.\n", "q0r": 3, "q1": "The team plans on conducting consulting sessions and strategy workshops with the local government. Then they conduct market research, and surveys. The next step is to analyze the data. Based on the findings, they present technical documents with a strategy to use Cardano to solve the aforementioned issues. This section needs more details on the consulting and strategy sessions, the research methodology, etc. Then the budget needs to be broken down based on how the team plans to onboard the research pools, online/in-person research, etc. Due to a lack of detail in the plan, a rating of three has been awarded.\n", "q1r": 3, "q2": "The auditability criterion is pretty straightforward. It includes consulting reports, research insight reports, strategy reports, and a summary of meeting with the local government. It’s unclear how much information can be disclosed due to the sensitive nature of the reports. The auditability depends on the amount of information eventually disclosed. Due to the lack of information for making an educated assessment, a rating of three has been awarded.\n", "q2r": 3, "assessor": "z_assessor_2663", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 6054, "q0": "I think the impact of this proposal is relative. It is proposed to hold consultation sessions with Japanese merchants in applying Cardano blockchain to their solution to target the implementation of Japanese local government strategies. The proposal addresses one goal of this challenge, which is to improve the lives of Carano users in East Asia. However, it is not clear to me how the proposal will be extended to most business units in Japan. Or simply propose to only operate in a certain area in Japan (i.e. a local government of a particular prefecture)", "q0r": 4, "q1": "I consider the feasibility of the project to be average. The first is the project implementation plan, which is very general and does not specify what each work will be done. For example, in the first month, there will be initial consultation sessions, but how many sessions will we have? Will we do 1 counseling session/week? Likewise for the second and third months. In this respect, I recommend that the proposer should have specific work plans and elaborate further details.\nSecond, the implementation budget I think is not detailed and I think it is not reasonable. I take for example, $2,000 for market research (interviews). I don't know for sure how many interviews will be done and I can understand that just 1 interview will still be counted. And $2,000 for an interview is extremely unreasonable. Therefore, I recommend the proposer to detail these expenditures to properly assess the reasonableness of each item.", "q1r": 3, "q2": "The audit side of the project in my opinion is just average. We have not yet quantified it into numbers to measure accurately. I disagree with the idea that the success of the project is about communicating the message of Cardano and Catalyst to local governments. I also convey this meaning myself (with experience as a CA through 3 funds) but after conveying what value it creates and how can it be measured. For example it will increase that local income by 15-20% after successful adoption of Cardano blockchain technology, or create more # number of new jobs. That is, we must see concrete value rather than vague concepts with unknown results.\nBesides, providing evidence of each member's experience through their personal page link is also a plus. Create transparency for the project.", "q2r": 3, "assessor": "z_assessor_2771", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6391, "q0": "This project seems like a great longer-term approach for expanding Cardano, but maybe not so much in the short-term. As I understand the Proposal, it appears to more or less be Cardano marketing and brand advertisement, via consulting with Japanese officials. While it seems future-oriented, and aims to set up and lay the groundwork for Cardano adoption down the line, I do not foresee immediate results; rather, a better, lasting impact on expanding Cardano. \n\nTo be clear, this project absolutely shows strong impact, just more long-term. This is valuable for future scalability of the project! \nIt sets up for, as the Proposal explains, helping revitalize depopulated areas and/or serving aging communities in Japan. This partnership would therefore be phenomenal for meeting the Challenge Setting goals, of increasing participation in Catalyst, Cardano wallet activity, and stake pool operation. \n\nThis project may very well open doors and begin a partnership with the Japanese government and Cardano as valuable as the established Ethiopian partnership, therefore this proposal seems quite promising and valuable, and Impact is strong. \n\nThe reason I give this a 4 of 5 rating, is for not having much immediate utility/impact, as well as that I do not see a well-defined and clearly-articulated way in which the discussions for marketing Cardano and setting up the partnership will more directly revitalize those depopulated areas and serve the aging communities. That part could have been a bit more clearly spelled out. ", "q0r": 4, "q1": "All 5 members of the team seem both incredibly capable, and experienced, in their fields, as owners and founders of Eggworm and/or Neoculture. Looking at each member's LinkedIn, I see not just you each have a strong international experience base, but that 4 of 5 members have native (Haruna), professional (Corey, Sach), or at least elementary (Bruno) Japanese skills, which will undoubtedly be valuable when working with the Japanese government on this project. \n\nNot only that, but the team mentions already having a working relationship not just with one, but plural local governments seeking this partnership, which shows that the ball is already rolling/in motion. \n\nThe only shortcoming I foresee, which the team already seem well aware of, in that \"Public perception and its nuances play a major part in Japanese business, politics, and even everyday life. There may be participants in the project for whom appearance and reputation becomes a concern. Therefore, we may encounter challenges relating to the disclosure of information and/or identities.\" is that all 5 members appear to be non-Japanese natives. I can see this potentially causing issues. This is the only reason I have given a 4 instead of 5 on Feasibility, as by all other measures, the team is clearly well suited for this project. ", "q1r": 4, "q2": "This project's Auditability is surely it's weakest point. Although the Impact and Feasibility are very strong, I do not see much that could be considered a Key Performance Indicator (KPI) metric in numbers; only subjective things such as the team reporting that things are going well, as opposed to measurable by an outside entity or auditor. \n\nWhile you do break down what months 1, 2, and 3 would look like for auditing, I would have liked to have seen a lengthier, more in-depth breakdown of measurable metrics. While yes, it may be true that success for this project looks like \"articulately communicating the message of Cardano and Catalyst to local governments in Japan.\" that is not something that can be easily quantified or measured. ", "q2r": 2, "assessor": "z_assessor_2814", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8041, "q0": "The problem the petitioner aims to address is that local governments in Japan are looking for new and innovative ways to revitalize depopulated areas and serve their aging communities. This problem could be solved through Cardano and blockchain technology. The petitioner wants a report detailing the knowledge and resources needed by local Japanese governments to consider Cardano for innovation. An actionable strategy will be presented to implement Cardano and Blockchain technology in their effort. The submitter has included what will happen as a result. This project will have a positive impact on the Cardano ecosystem if local governments in Japan will use it to bring new ideas to depopulated areas. This message will be communicated directly to influential people in Japan. The intention is that local authorities will use the resources to innovate with Cardano. There are some challenges included in the proposal. (public perception, disclosure of information and/or identities, appearance and reputation) It would be useful to already provide a solution for these problems or to reduce this risk.", "q0r": 4, "q1": "The team's relevant experience and skills are included in the proposal. You can track the people through their linkedin. These people have enough experience to work out this project. You can also clearly see that all these people are needed to carry out the proposal. There is a breakdown of the budget with recognizable items. (strategy workshops, market research,...) It would be useful to include the number of working hours of the team members in this breakdown. The budget seems sufficient to me to carry out the work. As long as there is a Project Catalyst, this team will remain involved in the community. There is a timetable included for 3 months. Some milestones have been included. I think it would be even better to add more interim milestones to the proposal. Now the objective is very general. The proposal sets out the resources needed to implement the proposal. More technical aspects of the project that are crucial for implementation should be included. There are some risks included in the proposal. (public perception, disclosure of information) The proposer could already include possible solutions to reduce the risk.", "q1r": 4, "q2": "A road map with associated milestones has been included. The project would take 3 months to complete. It would be useful if more milestones were recorded per month. No KPIs are included to measure success. The intent of the success is to communicate clearly to local authorities in Japan. The petitioner has clearly described the problem that local governments in Japan are looking for new and innovative ways to revitalize depopulated areas and serve their aging communities. This project can help to solve these problems by raising awareness among locals that potential solutions exist through the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11561, "q0": "The proposal's concept was somewhat confusing to me. On the one hand, the proposal's main goal is to introduce the Cardano ecosystem and Catalyst to local Japan governments, which is clearly aligned with the challenge setting and would help with scaling the ecosystem by introducing the technology to East Asian decision-makers. On the other hand, the proposal does not provide any rationale or background on how the implementation of the Cardano ecosystem would help with the revitalization of aging communities. I find the proposed solution description to be unclear - for example, \"We will also provide them with an actionable strategy to begin implementing Cardano and Blockchain technology into their effort\" - there are no specific examples about what effort the government makes in such areas/demographics, or how blockchain solutions are related to this problem. Furthermore, after communicating with Cardano policymakers, there is a subsequent problem related to aging population - It is well known that the large percentage of crypto/blockhain adopters are young adults, so a detailed strategy on how to make Cardano appealing to these older population should be described as well. The proposal aims to have a more local than global impact by focusing on local governments - Another issue I found in the proposal is that I'm not sure what \"actionable strategy\" means precisely. Educating policymakers on how to write proposals in the Catalyst, or what?", "q0r": 3, "q1": "I believe the project can be completed successfully, but several key details are missing. While the team members' experience and background are highly relevant to the proposed solution, their role and responsibilities in this project are not specified. All team members can be found on LinkedIn, and their previous experience is easily traceable. They have extensive experience with similar projects, increasing the likelihood of delivering the proposed consulting sessions and business meetings.In my opinion, the timetable is lacking in details, only providing basic information on a monthly basis - I'm missing information on which specific governments will be contacted, and whether meetings will be held online, in person, or both. How will the market research be conducted? - interviews and surveys, but with whom, how many respondents do you hope to reach, and how what type of data analysis is aimed to perform, with what purpose? The budget is also poorly described, with no explanation of how the costs are calculated or justified. For example, will the market research be conducted using  online or paper-based surveys? How the data analysis will be done? - does it requires a statistical software purchase? What is the reasoning behind the cost of consulting sessions and strategy workshops? Is there a consulting cost per session or an office rental fee where the consulting will take place? ", "q1r": 2, "q2": "The proposal does not specify the exact KPIs used to track progress, only mentioning three main outcomes (reports) on a monthly basis and a final report after the project is completed. There is no information on where the reports will be disclosed, with the exception of one demonstration tothat is aimed to be presented to the  local governments. There is no information about how the Catalyst community will be able to audit the project. Furthermore, the roadmap and milestones are vague, only mentioning one sentence of what is planned to be done without any elaboration, such as: initial consulting session and outlining research to be done? - What kind of research are you doing? - Market or social? Who on the team would be in charge of disseminating ongoing progress and gathering feedback from the Catalyst community?Another issue I see with the auditing process is that the risks associated with not delivering the project are only mentioned with no explanation of how it would affect the monitoring of progress - for example, challenges with disclosing information are mentioned - how will they be mitigated? *", "q2r": 1, "assessor": "z_assessor_3256", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will leverage our network of business strategists, executives, and researchers in Japan in order to provide local municipalities with the knowledge needed to consider Cardano for innovation.", "experience": "Eggworm is a brand experience agency that has spent over a decade establishing valuable working relationships between brands, companies and communities in Japan.\nNeoculture is a collective of founders, strategists, and technologists working to create better businesses in Japan."}