{"id": 423080, "author": "huongdang186", "title": "Elevate Social Impacts via Cardano", "url": "https://cardano.ideascale.com/a/dtd/423080-48088", "category": 26602, "amount": 30500, "description": "There are over 20,000 social enterprises in Vietnam yet start-up social enterprises don't have much financial support to execute their work while Ada holders have lack of trusted platforms to donate.", "f6_no_assessments": 13, "f6_rating": 4.538461538461538, "videos": [], "media": [], "f6_assessments": [{"id": 3845, "q0": "The problem of this proposal is that the over 20000 social enterprises in Vietnam do not have financial support for their work and ADA holders lack trusted platforms to donate. Their solution is to engage ADA holders to stake their ADA to Stake pools. This proposal is about partnering with a funded project in Fund 8 to help nurture small pools, calculate and distribute tokens, and engage ADA holders/donors to stake their investment into small pools, host workshops to share with them about social impacts and how their investment could make a difference. \nTo address the challenge, this proposal seeks to propose that their innovative solution would offer all stakeholders a flexible and transparent platform that will engage both ADA holders/donors and social enterprises to understand each other and make the most of donations.\nThis gesture of raising awareness of both groups will promote Cardano and cryptocurrency, thus reflecting the goals of the challenge.\nThe proposer mentioned a few risks associated with this proposal, eg. market volatility.\nThis proposal has addressed the challenge to some extent. My rating is 4.", "q0r": 4, "q1": "The plan presented shows 4 months project duration starting from October 2022 to January 2023. These timelines have various tasks assigned that will be executed during the 4 months. \nKPIs have been provided such as to attract 50 small enterprises to join information sessions, etc. \nThe budget request is $30500 which is reasonable, and has been broken down into smaller budgets reflecting different costs as labor for marketing collaterals, labor to host the online workshop, etc. \nThe team comprises of 3 experts who are experienced in computer science, stake pools, telecommunications, etc. and their skills are relevant to the proposal.\nThe proposer has indicated that they will return to Catalyst for further funding to continue the work. The team is involved with other proposals and also working on previously funded proposal.\nI can conclude that given the plan provided and the experience of the team, it is highly likely this proposal will be implemented successfully. So my rating is 5.", "q1r": 5, "q2": "The progress of work will be posted on GitHub, according to the proposal, and all marketing materials updated.\nThe monthly work will be measured by the reports sent, such as the workshops.\nThe success of this proposal will be seen as social enterprises having access to potential funds; people who want to donate to impactful social enterprises have a trusted platform for donating and investing, etc. among others.\nThis is a new proposal. \nThe information provided can help auditing. My rating is 4.", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4428, "q0": "I am very impressed with your proposal because it directly addresses the goal set in the Challenge, which is to develop East Asia, to develop Cardano. The main audience here is social enterprises in Vietnam, at first when I read the proposal, I found the idea to be macro-sized but gradually realized that it would have a specific impact on many people in the society. society, not just people working in the business field. The proposal identifies the problem to be solved through business, enhancing social impact via the Cardano blockchain. This adds value to the Cardano ecosystem, and it can scale to the challenge in the future (provided the proposal works in practice). I found the proposal well-written and organized, with clear methodological intent. If successful, it will be a premise for continuing to build a community to promote the adoption of the Cardano blockchain in the region. I understand that this proposal helps struggling social enterprises and investors find each other - based on great trust. This is a very good job, beneficial for both parties and society in general. When I read about the specific action idea of ​​the team, I find that a very good way to do it is through education to improve knowledge and wisdom. I fully endorse this set of ideas, given its impactful overview - I vote 5 stars.", "q0r": 5, "q1": "Through the proposal, the team consists of 3 members with experience in the field: Cardano blockchain, communication, and strategy. These experiences are suitable for carrying out the project. Not only that, but the members also publicize their identities through social networks (Linkined). This is very convenient to demonstrate the transparency and feasibility of the proposal. However, I have a question about the resources to implement the proposal: When the workload is very large, with the number of members of 3 people and the staff supporting the team, will they be able to handle and complete the work? ? What if the number of people required to execute exceeds the number of people you have planned? My suggestion is that the team can use the help of dedicated community members to work together. This not only completes the job well but also increases interactivity and spreads and advertises the proposal in the large community. But to do so, the team needs to balance finances and allocate the budget appropriately. Your current budget allocation is quite granular with work hours calculated. I completely agree with this. Can you detail the mechanism by which Stake pool owners donate % of profits to social enterprises? Or will that be made clear at the Open ISPO proposal implementation seminars? I acknowledge that the challenges and risks associated with the implementation you have outlined are entirely true to the current state of social enterprise and blockchain. In my opinion, the feasibility of this proposal is quite clear, the ideas I have mentioned are for reference purposes so that the team can implement the proposal more perfectly. I vote 5 stars.", "q1r": 5, "q2": "I like the way you mentioned the roadmap and the planned milestones. Specifically, it is associated with the month of a year. It is very convenient for the community to monitor and evaluate. This is also a great way to demonstrate transparency and auditability. The proposal is quite detailed and professional, proving that you have invested a lot of attention. Taking a closer look at transparency, do social enterprises and ADA owners tie their interests together by contract? Is it a smart contract or a traditional contract? If there is a contract between two subjects, do you think about the role of legal in the contract? Are contracts made between social enterprises and ADA owners legally recognized? My advice is that the team should carefully study the law before applying the proposal in practice. Because as far as I know, the legal system does not have specific regulations on cryptocurrencies and blockchain in real life. With the KPIs stated by the team, I find it reasonable (provided it exists within the legal framework). The rest of the proposal is a clear and understandable problem description. Accompanied by a satisfactory solution. I wish the team every success!", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5255, "q0": "Charity and social responsibility activities in Vietnam faced many problems from the recipients, causing the trust of sponsors is seriously decreased, leading to the funding source will be lost, and can not go to places and people need help.\n\nThe project team proposes to create a platform to create a stable source of money to provide social enterprises be the ability to deploy their activities. This is a proposal in my opinion that is quite humane and has a lot of value for society\n\nThe team's solution is to use the SPO mechanism to deduct a certain percentage of the ADA obtained through staking to transfer to social enterprises. This is a fairly sustainable solution because as originally designed, the SPO will receive an average of 5% ADA per year, and this is stable over the lifetime of the Cardano Blockchain. Therefore, this can be a stable source of finance that social enterprises can rely on.\n\nEspecially the social enterprises chosen by the project are related to issues such as women, children, and mental health. These are vulnerable people and need to be supported by social enterprises. So if the project is put into operation, I believe it will make a huge impact. It also helps bring a better Cardano image to the crypto investor community in Vietnam.", "q0r": 5, "q1": "The proposal is expected to be implemented within 4 months from October 2022 to January 2023. At each milestone, the team also identified the main activities that need to be performed, along with the main KPIs. I consider this period time to be relatively feasible given the size of the proposal.\n\nAs for the budget, the group describes in detail the item with a total budget of $30,500, but in each category, the specific cost has not been indicated, so it is difficult for voters can assess whether the total budget is reasonable or not.\n\nRegarding the experience and the people who participated in this proposal, I am quite impressed because you have many years of experience in social activities as well as operating social enterprises. I believe that the project will be very successful with the capacity of the project members.", "q1r": 5, "q2": "The evaluation indicators used by the project team are very detailed and are stated specifically for each month. And all project activities are posted on the project's website and social networking sites for PA/Voters to check at any time. This demonstrates the reliability and transparency of project participants.\n\nHowever, to measure the final success of the project, we need to know the positive effects of funding through staking from the Pool. For example, how much is the total amount of funding, how many people receive funding from social enterprises, and the quality of life of the people targeted by the project (women, children, mental health) has improved over time through small surveys and interviews.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7445, "q0": "The problem raised in the project is very profound, an aspect that few people see. A successful project will help social enterprises feel secure about funding for development, ADA owners will feel secure to contribute to trusted businesses, and also help the ADA ecosystem to develop more, more decentralized, practical applications.\nThe project is aimed at ADA holders who are staking in pools with a large amount of ADA, switching to staking in smaller pools, in order to optimize rewards. However, the probability of closing the block in small pools is lower, the reward is also less, can you explain more clearly the arguments to convince ADA holders to move? And what is the percentage of reward contribution to social enterprises? I can't seem to find that information in the proposal, hope the team can help.\nAnd does the project have a method for measuring how much ADA is under-optimized? How to know who owns the ADA and how to approach it so that both parties are comfortable? I think these are two quite important factors to guide the success of this project.\nYou guys wrote the project very well. Hope my contributions will help to make the project more complete. I'm happy to give it 4\n", "q0r": 4, "q1": "Detailed progress and appropriate timelines. There is one thing I would like the team to clarify. Social enterprises need a relatively stable source of capital to be able to plan specifically and develop effectively. So now, does the project have any plans to quantify this number? This will help the project have a specific plan on how much ADA will raise from the owners. At the same time, the ADA price fluctuates continuously, with high frequency and intensity, what plan does the project have to limit this drawback? Please share for me and the community to know.\nI am really impressed with the experience and competence of the team members. Everything is very suitable for project implementation. I see that the project calculates the required budget by working hours, each hour is 50 $, a fairly high-income figure in Vietnam, so the total budget is 30,500 $, accounting for ~ 12.2% of the total amount of the Challenge. Not to mention the things that have not been listed such as conference venue rental, incidental fees… In total, funding will account for a large proportion of the Challenge. Hope the above suggestions help you adjust your budget more reasonably. I give 4 points in this section because your team has many strengths to complete the project, and the milestones are quite suitable.\n", "q1r": 4, "q2": "The topics covered are quite detailed, timed to complete, and easy to quantify. The community can monitor on the Github link you provide. I see the project mentions Facebook but I don't see the project's Facebook link but only the personal Facebook link. I think it is advisable to create separate Facebook for the project, the community is easy to follow, and comment on, and also easy to promote the project. Please update this.\nWith the 5 outcomes you listed, I fully believe the project will achieve results if all members and the community work together. Please give 5 points for this part\n", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7877, "q0": "The proposal address the dire need of improving the social enterprises and financial support to execute their work, hence, it is challenging for them to run the organization .They believe in the power of community and social impact. They are ready to utilise their experience, knowledge and skills for the better future of social enterprises. And also they work for social enterprises to build framework and diligence like child protection, harassment policies and such. This project would help for ada holders to have awareness about social issues and responsibility and also about cardano and crypto currency . The proposer is also aware of various risks involved and distributing the project prosperously to start up social enterprises. ", "q0r": 5, "q1": "The proposal comes with an detailed plan and they mentions a monthly wise goals and they provided step by step action plans with well defined KPIs. The team provided detailed budget breakdown is $30500. The holder nearly owns 2000 Ada. Given the team has already been funded and has compact plan and do not intend to return for more funds as they believe to complete the project in its entirety in just one go. The experience of the proposer is very brief role of the members are clearly identified. ", "q1r": 5, "q2": "The proposal along with its wonderfully laid out game plan, also comes with excellent metrics to measure it's progress and impact. Thr proposer provides tentative progress on monthly wise. Here, they provide monthly reports on github website and also their will be online workshop for ada holders. The prosperity of the project looks good. The success and acceptance metrics are also clearly defined. Social enterprises will be engaged with each other and creating a strong network it would help for social enterprises to startup a business. ", "q2r": 5, "assessor": "z_assessor_2929", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8045, "q0": "The problem is that social enterprises start-ups in Vietnam have little financial support to carry out their work. This could be resolved if Ada holders had trusted platforms to donate. The intent is to engage Ada holders by using their Ada for pools. Stake Pool owners then donate a portion of their profits to social enterprises. The intent is to help these companies build a reporting framework and due diligence documents. The advantage is that this project will collaborate with Open ISPO (funded project in Fund 8). This service will help feed small pools. The social start-ups that will be assisted are included and are very important for the growth of the country. ( Holistic education for street children, at-risk youth and underprivileged youth. Another great venture is healing services for people with mental health problems. The main goals and statistics are included and correspond to the challenge requested. This project will have a positive impact for the Cardano ecosystem If people all over the world discover this project it can also be implemented in other countries and this will increase the Cardano ecosystem.The main risks are included.A solution is also provided each time to limit this risk such as offering workshops for the grassroots of cryptocurrency.", "q0r": 5, "q1": "The proposer has included proof of the people who will be working on this project. The relevant experience is recorded and you can find most people on Linkedin, Twitter or Facebook. There are a few big names among those who have already completed major projects. (Tien Nguyen Anh, Huong Dang Thi) The team has enough experience to complete this project. There is a clear breakdown of the budget. The submitter has written down all working hours in detail. It might still be useful to ask for a little more financing if certain parts take a little longer. The budget seems sufficient to achieve the goals. The proposers will certainly come back in a later round for further funding to expand the project and thus create a greater impact. A realistic timetable has been offered to implement the proposal. (4 months) The proposal clearly explains everything that is crucial for a good implementation of the project.\n(create a transparent platform) The most important risks have been included and a solution has been provided for each time. (lack of knowledge, importance of long-term investments)", "q1r": 4, "q2": "A comprehensive roadmap with milestones is included. The project will last 4 months. It is good that this roadmap also clearly includes KPIs. The roadmap is very transparent. The milestones are certainly achievable. It might be useful to already share the location where the 2 workshops will take place. The KPIs that are included are well chosen and offer a clear indication of success. I think that the target should be higher than 20 applications received from social enterprises. (30+) There is a clear description of the problem of financing for social start-ups. The solution offered can have a big impact and give small social enterprises a chance to start more easily. I also think that if other countries start seeing this project, there is a good chance that it can be applied in even more countries.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8283, "q0": "This proposal has the potential of having a huge impact, not only on the Cardano ecosystem and its reputation but also on society. If successful, this project could change the life of many people in Vietnam, while teaching people about Cardano and cryptocurrency. It also fits the challenge, of using Cardano to make the world a better place. I do think that, because it is a big project, there could be more identified risks, for example, the dependency on the engagement of stakeholders could impact the whole project.", "q0r": 5, "q1": "The milestones give a clear idea of how the project will take place, and it seems reasonable. As for the budget, it is a bit high compared to the challenge's total budget, and I still think non-related personnel expenses are missing. Maybe it would be a good idea to scale down the project so it would require a smaller budget, and also add a portion to unexpected expenses. The proposer has a strong and relevant background, so I believe they are capable of carrying out the project.", "q1r": 4, "q2": "I really like how there are clear and measurable KPIs, this is an important part of the project's auditability, and it will help track the project while it is happening. Considering the milestone, there are also well-defined deliverables. I also like how they added the SDG goals.", "q2r": 5, "assessor": "z_assessor_2971", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 8971, "q0": "There are many ADA holders who do not use ADA coins effectively, and none of them will stake for small and medium enterprises, Even startups are finding hard to survive these days due lack of monetary support that they get from banks or other financial sectors, Hence to overcome such scenario, the proposer wants to conduct workshop for both ADA holders and social Enterprises, where ADA holders can invest their coins and enter enterprise can use these coins effectively and submit a % of profit to ADA holders again , hence this brings positive impact for society's growth, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented plan has severe positive impact in the society, conducting workshops among the ADA holders and Enterprises who need financial support can be achieved, but proposer hasn't mentioned how legal support will be added here to make the project still more effective, so that it can gain trust for ADA holders to stake their coins.\nThe proposer's team has already founded vilai pool and have been using the stake holders investment effectively, so this shows that proposer has proven experience in similar field , the proposer has  13 years experience working in social enterprise in Vietnam, Hence with provided experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal has one of the best impactful goal for the society to make Vietnam grow economically, The audit even contains the proven experience by developing Vilai stake pool and running the stake holders investment successfully.\nThe proposer should have come up with some solution on how to counter if there is slip up in ADA prices where it could affect both investors and social enterprises owners, The proposal contains detailed budget breaking idea to complete the project and it has presented well structured roadmap for month wise to make project successful, Hence with great goal ahead the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9390, "q0": "The proposed solution meets the requirements of the challenge. This is also one of the great and useful ideas for the Vietnamese community.\nIf the project is implemented, it will have positive impacts on Vietnamese society. In which, the most sensitive subjects in society are mentioned, including:\nEconomic empowerment of women to reduce problems of gender-based violence\nComprehensive education for street children, at-risk and disadvantaged youth\nHealing services for people experiencing mental health.\nThe project is evaluating these objects as \"the three vulnerable groups that need help the most, and they are even more affected by COVID-19\", showing their humanity and sharing with the community.\nIn addition, the project focuses on connecting two objects, namely donors and social enterprises (beneficiaries) to maximize efficiency and impact from both sides. The project also has an education – training segment, aiming to train social enterprise partners as well as sponsors to raise awareness about Cardano and cryptocurrencies in Vietnam. Moreover, the establishment of a policy system in enterprises plays an important role in creating transparency in enterprises, thereby creating trust for donors.", "q0r": 4, "q1": "The budget for the project is reasonable to effectively implement the proposed items. I have been involved in the construction of several projects as an executor, so I can evaluate the items mentioned in this project very reasonable, convincing and full of content intended to produce the above effects.\nIn addition, in this proposal, we see that the group of authors has experience in allocating budgets and resources because there are ideas that have been implemented before.\nThe provided human resources team is very qualified, their qualifications and experience, when combined in the project, will create good values ​​for the society.\nThe project lasts for 4 months, from October 2022 to January 2023, this is a very suitable period, especially for Vietnamese people, because this time is close to the Lunar New Year, the level of influence of the project when implemented will reach more people. In my opinion, the efficiency of the project will be enhanced and the project will be deployed more strongly in Fund 10.", "q1r": 4, "q2": "This is a new idea, but I can see the budget allocations are reasonable and well auditable. The metrics are presented and reported to the Community via https://github.com/cardano2vn , I understand this will help make the project transparent and well-received by the Community. In addition, monitoring from the community will help assess the success of this proposal.\nThe members of the proposed team are described as having an in-depth understanding of social enterprises, their utilization and use, as well as the rational allocation of resources, which can be seen through some of their previous projects and ideas at the Vietnam Catalyst Community.\nWhat will the success of the project look like? This is described specifically and in detail by the author group in the project. The positive points of the project, if implemented, are to bring a network of social enterprises and investors, in order to create a stable market. In addition, the biggest impact is bringing a positive influence to the Vietnamese community in particular and the world in general.\nIn short, the proposal brings many positive effects, meets the requirements of the proposed challenge and is completely auditable by the Community.", "q2r": 4, "assessor": "z_assessor_3049", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10353, "q0": "I think the idea is necessary and theoretically fits well with the objectives of this challenge. What we need is how to attract a direct investment in this part of the continent in order that it can develop economically and humanitarianly. Besides that, we also expect the cardano ecosystem to be popularized by taking advantage of this situation, to be aligned with the vision of cardano where ownerships should be decentralized. The problem that i identify here is that everything sounds good on the theoretical side but in practice,  it's difficult to convince the ada holders to invest in social enterprises for long term profit, and as the proponent promises they will organize workshop to help social enterprises, even when the title of meeting is about the basic blockchain/cryptocurrency, we are still unable to believe in the result of solution that you claimed. in my opinion, i think the idea is promising, but the impact is not well assured due to the lack of explanations and details", "q0r": 3, "q1": "Project roadmap is divided by monthly with specific objectives. But here we just receive the content of the delivery of task, I wonder what is details in workshop for ada holders ?. How to measure the feasibility level of this workshop?. what kind of information will be host in the session for social enterprises? how effective the session would be? i wonder whether ada holders commit to engage to stake in small pools or not?. And about the number of KPIs targets proposed which i feel quite not feasible, 90% of 50 social enterprises applied as beneficiaries?, 90% of 50 ada holders staking in small pools and understanding about the social enterprises concept? and only 5 social enterprises will be selected for giving funds? the number the team proposed i see it is not suitable. To assess the feasibility i think it does not make sense good. Finally, the budget breakdowns listed by multiplicating the number of hours and days of a labor for each tasks which is quite waste of money, i think, because the activities for each task is divided small and calculated every task with the single cost for 50$/hour. Although the resume of board of manager provided in details but i still assess the feasibility of this project is not carefully researched.", "q1r": 3, "q2": "I see the content of the auditability part is like the roadmap shared in feasibility part in different timeline. And it is said that the progress of project will be tracked on Github only, how about youtube videos, project catalyst presentation etc., we know that the number of participants, ada holders are indicative of how big the reach of these session is?. It is necessary that we know much more varied information about the development of the project than just numbers. Therefore, as well as feasibility, i believe that this topic of the proposal needs to be reviewed and improved more.", "q2r": 3, "assessor": "z_assessor_3182", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10414, "q0": "This project is really meaningful for the society due to what the proposers mentioned. They focused mainly on giving beneficials to 3 important objects in this modern life: reducing gender-based problems on women, education for children who are lack of love and nourishment, as well as helping post-Covid 19 patient recover their mental health. It also helps the community have a deep knowledge on crypto in general and Cardano ecosystem in specific. By doing the investment on the SEs (social entrepreneurs), this project will raise the awareness to social especially who hold the ADA but don't know how to use it wisdomly and usefully. Besides that, the SEs will also have some financial supports for their business. It can be seen as a win-win situation in the far future. Moreover, if this project makes a smooth progress, it can become a challenge and open more opportunities to bring Cardano to the social. ", "q0r": 5, "q1": "They give very clear vision on their budget by divided it into people who in charge for their responsibilities during the whole project and then the money for an hour of work. They also mentioned the stages of this project, and for each stages they raised the object that need to be done. All of the team members has shown and proved their ability to run this project to the last by their valuable experience in this blockchain. ", "q1r": 5, "q2": "Other people can track the project by the link that they provide and can easily to follow the project from the beginning till the end. We can see a clear milestone to get their achievement (the benefits that the women, the SEs, the children, the Cardano community will get). ", "q2r": 5, "assessor": "z_assessor_3184", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11103, "q0": "In Vietnam, social enterprises do not have the support of the Government, but they still have to pay taxes like normal businesses. As a result, it becomes even more difficult to run their organization. With such responsibilities, founders cannot focus on executing strategy and operations for the business, preventing them from expanding their model and increasing impact. Your Proposal: \"Get ada owners/sponsors to put their investment capital into small groups, organize workshops to share with them about their social impact and how their investments can be can make a difference\". I really like your proposal because it brings benefits to the stakeholders that are: The business will have access to potential sources of capital and continue to implement its innovative ideas; People who donate capital to businesses have a trusted platform to donate and invest. The community will gain a better understanding of the technology, the Cardano community, and what Cardano is doing to improve society. The proposal presented two possible risks and provided an explanation to reduce the risk, which I found to be reasonably basic.", "q0r": 5, "q1": "There is an ongoing situation that startups face difficulties in attracting capital and ada owners/sponsors lack the platform to help them access established social enterprises. tested that they feel safe to invest in. You are the bridge to help them find each other. I completely agree with your solution that is to do well in education and communication. In my opinion, in addition to helping them have a basic understanding of blockchain/cryptocurrency to help social enterprises participate in the program and use funds effectively, you need to support business partners. develop stronger systems and policies and frameworks, which will allow them to have the opportunity to receive long-term funding when investors trust them to be willing to invest. I would like you to clarify the solution. ensure the safety of both businesses and sponsors, especially in the current volatile market to create confidence and motivation for them to participate. In my opinion, it is necessary to organize meetings or face-to-face conversations between business owners and investors so that they understand each other better and are willing to share. I see you have a full plan, a detailed budget breakdown for the project. I completely trust you.", "q1r": 5, "q2": "You have given the information to measure the progress of the project I find quite specific. The success of the project is clear. This is a new but very valuable project, if successful, this model will be replicated, which will contribute to promoting the development of Vietnamese businesses and the Cardano community will be more stable due to a huge amount of Ada. from owner. I support you 100%.", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 12691, "q0": " the problem to be solved here is that there are more than 20,000 social enterprises in Vietnam but the newly established social enterprises do not have much financial support to carry out their work while the owners Ada owners lack a reliable platform to donate. The proponent clearly laid out how it will add value to the cardano ecosystem as follows: Attract Ada holders to stake their Ada in Stake Pools. Stake Pool owners will donate x% of profits to social enterprises (SEs), and the proponent will also help SEs build a reporting framework and due diligence documents. The proponent has proposed financial support measures to help social enterprises develop a reporting and appraisal framework. organizes cryptocurrency seminars, with a strong focus on Cardano, By doing this, social enterprises can access capital, and strengthen their organizational capacity. Ada owners/sponsors will learn more about social impacts and can make a difference without their financial contribution in a transparent and flexible way. small pool owners will be able to attract more stakeholders to the pools. As for the Cardano ecosystem, they will be more sustainable with a diversity of teams and owners, and more people will also learn about Cardano thereby helping to scale to address future challenges. I completely agree that this proposal will effectively address the challenge.", "q0r": 5, "q1": "The proponent said that the project participants include the proponent who has 13 years of experience working in the field of social enterprises in Vietnam, established his own social enterprise, has a Master's degree in Entrepreneurship & Innovation, and Two other team members with 2-20 years of experience in tech and social entrepreneurship, jointly founded Vilai Pool. The proponent provided a reasonable budget that was clearly outlined and broken down into definable and easily verifiable items. Specifically, the proponent requests a Budget:30500 spent for 610 hours of labor and 50$ per labor hour to implement the proposal. The proponent states the actual timetable for implementing the project in 4 months from October 2022 to January 2023, each month's work has been specifically and reasonably planned by the proponent. The proponent also considered the risks that prevent the successful implementation of the project and also provided specific measures to address that risks. With this proposal, I rate 5* and I strongly agree that this proposal will be successfully implemented", "q1r": 5, "q2": "The proponent has provided a 4-month implementation roadmap from October 2022 to January 2023 with specific milestones to be achieved, clearly stated, and the progress of the project can be checked. The proponent has selected reasonable indicators/KPIs to determine the success of the proposal. The applicant clearly described the problem that there are more than 20,000 social enterprises in Vietnam but the newly established social enterprises do not have much financial support to do their work while the Ada owners lack a reliable platform to donate. and the proponent also gave specific, clear, and understandable solutions to solve the given problem. I agree that this proposal provides me with sufficient information to assess progress towards goals and I agree 5* and for the suitability of this proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Engage Ada holders to stake their Ada to Stake Pools. Stake Pool owners will donate x% profit to social enterprises (SEs), we will also help SEs build reporting framework and due diligence documents.", "experience": "I have 13 years experience working in social enterprise in Vietnam, founded my own social enterprise, hold a Master of Entrepreneurship & Innovation\nTwo other team members have 2-20 years working in technology industry and social enterprise, and founded Vilai Pool."}