{"id": 423023, "author": "bd", "title": "Cardano pre-hub in Philippines", "url": "https://cardano.ideascale.com/a/dtd/423023-48088", "category": 26602, "amount": 35000, "description": "Cardano lacks strong representation in the Philippines while Goodwall has a strong community in the region.", "f6_no_assessments": 18, "f6_rating": 4.648148148148148, "videos": [], "media": [], "f6_assessments": [{"id": 1854, "q0": "This proposal addresses the challenge by growing the East Asia Cardano community using education of blockchain and Cardano via Goodwall mobile app. Goowall app is used globally by young talents and the proposal have a target audience in the Philippines. The proposer will produce educational videos that will be both in English and Tagalog. Since there is English content, they can scale slowly from Philippines to East Asia and globally to the young generations. By doing this, they will increase the participation of the Cardano community with East Asian residents. The team have provided a list of risks and their solutions to tackle them. They will use digital marketing to target their audience since many lack the awareness and education about blockchain. The team is also confident that Goodwall app have the necessary expertise to engage the young talents. ", "q0r": 5, "q1": "There is no information about the team members behind this project/proposal. Hence, it is difficult to evaluate their experience, skills, and expertise in education for blockchain & Cardano, video editing skills, digital marketing skills and project management. The project timeline is reasonable with all their plans to execute each task within 10 weeks. However, the budget requested is a lot and difficult to justify because 1) there is insufficient information on the number of people and number of hours to run this project 2) not clear whether they will be outsourcing people to produce the contents and marketing 3) the budget breakdown is unclear on which country the rate is based on. Therefore, the likelihood of success for this project is difficult to say with reason provided above. To improve this proposal, the team need to be more transparent by 1) introducing themselves 2) having their LinkedIn profiles with their experience and expertise 3) more precise with their timeline and milestones (Gantt chart is helpful to convey this) 4) be clearer by justifying their budget.", "q1r": 2, "q2": "The audibility on this team is quite easy as stated in their proposal. Since the team is leveraging the Goodwall app, it is easy for the Cardano community to audit and monitor the progress and success of this project. The community can audit based on number of impressions, engagements and challenge entries using the Goodwall app. The team also have a target for 65k users in the Philippines to use and learn from the Goodwall app. However, they did not state how long will they take to achieve this target of 65k users. It will be difficult for the team to achieve 65k users within the timeframe for their whole project of 16 weeks. Lastly, the team will provide a live dashboard to track the relevant data related to the survey and challenge and will be developing constant analysis of whether the results are reaching the targets.", "q2r": 4, "assessor": "z_assessor_2274", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11413, "q0": "Cardano is a blockchain platform that aims to be decentralised application development platform with a multi asset ledger and verifiable smart contacts. Cardano is being built in 5 stages: foundation, decentralisation, smart contacts, scaling and governance. It runs on the proof of stake ouroboros consensus protocol and developments are informed by scholarly academic research. The primary cryptocurrency of Cardano is ADA. Cardano oversight is decentralised and shared by the Cardano Foundation, IOHK, EMURGO. It lacks representation in philippines and goodwall has strong community which will educate Filipino youth through experimental learning programs. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal has a detailed plans including deliverables having social  media assets and co-branded content to promote cardano, survey to understand the youth , challenges on goodwall to stimulate youth. The programmes are planned in phases includes preparation of survey designs, promotion assets, educational series and execution of programs by analysing the content and monitoring group chats and responses and assessing the results. The budget breakdown is reasonable and achievable to conduct plan for implementation of the proposal. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by the analysing the results of programs and preparing debrief in 3-4 weeks with acceptable budget breakdown. The objectives include 5 ambassadors per theme video entries, impressions and participant feedback towards cardano blockchain . The aim of the project is to reach out community in the Philippines and acquire new users with paid promotional campaigns. Set up of love dashboards to track relevant data related to survey and constant analysis of results reaching targets . The information provided is sufficient to audit the progress and success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 10857, "q0": "This is a project to help young people in the Philippines have more access to blockchain technology, especially Cardano Blockchain. This project will be implemented based on existing members of the Goodwall platform. Goodwall will educate Filipino youth on the basics of blockchain through experiential learning programs, and encourage them to build a local Cardano hub connected to the Eastern Townhall. The proposed team has described quite clearly how they expose Goodwall members to knowledge related to blockchain technology. I also really appreciate the way they come up with solutions to deal with the risks. This shows that the proposed team has a very deep understanding of what they are doing.", "q0r": 4, "q1": "I think this part of the team did a very good job. I like the way the team planned the project. First, we get to know what goals will be accomplished in the project. Then we have the plan divided into phases: Program Preparation, Program Execution, and Program Results. The main contents and implementation time at each stage are provided in full. However, it would be perfect if the team provided more details about each of the small activities that will take place and the specific time for each of these activities. Talking about the budget, it is well allocated and very well explained. Example: For $3,000 for Networking management, it includes costs for Community management, moderation, engagement, and support. Team members are also provided with CVs so that we can know their names, education, experience, and role in the project.", "q1r": 5, "q2": "I believe that project progress can be measured through the specific goals and indicators that the proposed team has provided. The success of the project is also described very realistically. One thing that needs to be added in this section is how the community can keep up with this proposal and ensure that it is meeting its stated goals. The team should have a constantly updated report.", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10088, "q0": "- Proposal for a Filipino community-driven project with multiple educational goals and to share knowledge and potential about the future of cardano blockchain, through course programs. I am very interested in work. from this idea.\n- With the information mentioned by the project, it has been shown that the members of the project have many talents and they can together create a lot of knowledge and experience about blockchain. With 14 people on the team in the Philippines and more than 61,000 users based in the Philippines, it is enough to show that the members were very professional to complete this project.\n- The solutions that the project aims to with the Goodwall application on phones reach 35% of East Asia's population with many ages from 16-24 on the journey of education, knowledge and employment. Members will use what they already have to bring their knowledge of the cardano blockchain to the community in the Philippines. Not only that, project members create a lot of information with the aim of showcasing their professional skills and achievements to help users see and attract more potential.\n- The project has the same goal of bringing Cardano blockchain knowledge and education to East Asian youth so that they can confidently equip their future. The project also provides knowledge about Cardano blockchain through videos and organizes propaganda sessions on forums ..... v ... v ... with the goal of bringing cardano blockchain closer to people use. New. All content will be released by the project in 2 languages   Tagalog and English.\n- With rich relationship experience, the project will also link many partners to promote through communication channels to users faster, thereby increasing more potential users. that cardano provides. With an audience from the Philippines and East Asia, users will have more experience and skills, useful knowledge… be more motivated with attractive rewards that contribute to the growing community connection. participating in the cardano blockchain in the Philippines more and more.\n- With the risks that the project has to go through, project members have also come up with many criteria and ideas to reduce risks. With the plan to promote cardano through technology marketing, actively participate in discussions with the community, spread the knowledge of Cardano blockchain to users to understand. I am quite satisfied.\n- I completely agree with this project proposal.", "q0r": 5, "q1": "- a plan with a clear development roadmap. Shows the completed project members are the 3 phases listed for each stage in great detail to fully satisfy. It shows that this project member really wants to bring the knowledge of the Cardano blockchain to the entire Filipino and East Asian communities.\n- With a total investment capital of 35,000 USD.\nHas been divided into several parts to meet the appropriate fee for the project. The budget is very detailed and clear. I am quite satisfied.\n- The aggregated personal information of each member of the project has also provided full links and has very high transparency. Suffice it to say that the members are very professional in the field of community promotion in the Philippines for the cardano blockchain technology industry and completed this project the fastest.\n- I completely agree with this project proposal.", "q1r": 5, "q2": "With measurable KPIs, project members are also updated with specifics such as:\n   • 1,000 videos, 30,000 commits, 1 million impressions and especially 5 ambassadors for each related topic. Enough to see a project with the passion and vision to bring the cardano blockchain to the forefront.\n- I firmly believe that this project, if completed, will contribute to the increase of many talents from the Philippines and East Asia, new sources of knowledge in the field of cardano blockchain technology will quickly be spread and added more. . . . . . . . Staff. talent has contributed to the dedication to cardano.\n- I completely agree with this project proposal", "q2r": 5, "assessor": "z_assessor_3146", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 8969, "q0": "As we can see there is lack of awareness among the people of Asia, where they don't have idea on how impactful will be blockchain economy be in future, so to overcome such issue the proposer wants to conduct awareness program among the people of Philippines ,so that it can create positive impact over the society and  can help cardano eco system to grow stronger in the future, by covering such task it will help the youth's of the country to get more interest towards cardano ,hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented task is not a difficult one to achieve as proposer just wants to conduct awareness program, the proposer's team Goodwall’s mobile-first platform guides over 2 million youth aged 16 to 24 on their educational and career journeys, with 35% being in East Asia. with successfully helping youths from the past, The proposer has 14 teams and 61k  users already , with huge audience available already , this will cause great impact this will cause huge marketing for cardano eco system in the future, Later editing and submitting on social media  can also be done without any difficulties , Hence with minimal risk involved and great number of audience available plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit contains the proven experience of proposer's team where they have been helping the youth to improve their educational journeys, the proposer has even gained more than 2mn audience and has 61k audience alone in Philippines alone , which is big boost for the presented audit.\nThe audit contains proposed solution in very detailed manner to complete the project, the audit contains detailed timeline structure and detailed budget breaking to complete the project , The audit contains excellent key indicators where they want to gain 1mn impressions which is a great goal to achieve, Hence with ecosystem partners to help youth maximize their potential and impact society positively. The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 8042, "q0": "The problem that the petitioner wishes to address is that cardano lacks representation in the Philippines. Goodwall already has a strong community in this region.\nThrough Goodwall, the intent is to grow and leverage the Filipino community. At the same time, they want to educate this community about Blockchain. (Cardano specifically) Education and engagement are the primary goals of this program.\nCurrently, there are more than 61,000 users located in the Philippines. These people can benefit from this program. This project will thus have a positive impact on the Cardano ecosystem. As Goodwall, it can help convince even more people to work with the Cardano ecosystem. The main goals of this project correspond to the outlined challenge setting. The main risks that could prevent the project from being successful are listed. (fake news, lack of involvement, lack of involvement,... ) The submitter has already provided certain solutions that will reduce these risks.", "q0r": 5, "q1": "The management team that will be involved in this project is included by means of a google drive file. There is a list of these people included and if you click on it you will see their CV. The team members have relevant experience and skills that will be necessary to bring this proposal to a successful conclusion. No additional team members will need to be hired. A breakdown of the budget is available. There is an extensive description about the work packages and the useful items. It would also be useful to include the working hours of the team members in this package. The budget seems reasonable to me to achieve the stated goals. Applications will continue to be made in future funds with new ideas or continuations of funded projects. Two proposals have already been funded in Fund8. The proposal provides a realistic timetable to complete the work. Work will be carried out in program phases. The chosen deadlines per program phase seem to me to be sufficient to meet. Good milestones have been chosen in this regard. The plan states what and how everything will be carried out and within what time frame. The submitter has carefully considered the various risks that can prevent this project from being successful. ( Vague requirements, lack of involvement, budgeting problems,..) It is good that the submitter has already offered a solution for all these risks.", "q1r": 5, "q2": "A road map with associated milestones is available. Work will be carried out in 3 program phases and the project will last approximately 22 weeks. For each program phase, good milestones have been chosen that must be achieved. Goodwall will ensure transparency through comprehensive reporting based on projects and objectives. There are 5 important objectives of this program included. (Select 5 ambassadors per theme (total 20)\n(1 million impressions, 30,000 engagements, 1,000 video submissions and feedback from participants to be very positive about Cardano & blockchain) There are also a number of other important indicators that will be included. (Shows, involvement, challenge entries) The submitter has provided a clear description of the lack of strong representation in the Philippines. Goodwall can greatly increase this representation. Especially if the set objectives are achieved.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7876, "q0": "The submitted platform clearly understands the challenge at hand. The goodwalls platform guides over many youth about their vocation journey and they engender their unique profile to skills and cognizance. East Asia educate on blockchain technology for youth and they engaged with micro tasking. The intervention withal aims to bring more exposure to the cardano community and leverage and grow the community. The proposer is aware of various risks involved like lack of awareness and education, vague requirements, lack of engagement, budgeting users,fake news and also has required action plan to overcome them. ", "q0r": 5, "q1": "The proposal has provided detailed plan about delivering the project. The proposal shall organize program preparation, execution, results. The survey is needed to know how much youth in philippines ken about block chain. The team request total funding of $35000, and also provides the readers with a very close and pratical budget breakdown and they provided role of the member is clearly identified in their CVs. The members carry an abundance of experience and skills from their precedent years of working on block chain and other fields. ", "q1r": 5, "q2": "The proposal along with it's wonderfully laid out game plan, also come with excellent key indicators such as impression, engagement and challenge entries they are clearly defined. They selected 5 ambassadors per theme, 1millions impression and 30000 engagement. This is entirely a new project and the new Filipinos applying on cardano catalyst, live dashboard and help for education. They aim to reach our community of 65k users in the Philippines. The team shall assist the auditors in every way and provide all necessary report to make the auditing process profuse. ", "q2r": 5, "assessor": "z_assessor_2929", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7830, "q0": "The proposal has provided a useful strategy which effectively addresses the challenge. The Goodwill app which has quite a number of youthful audience in Philippines is certainly a good platform to educate people about project catalyst and the Cardano ecosystem. When this proposal is funded and implemented, it will create a lot of awareness of the Cardano ecosystem to the youth in Philippines. This proposal therefore deserves a 5 star rating.", "q0r": 5, "q1": "The plan in the proposal is highly likely to be implemented successfully. The Goodwall app, which has an audience of over 60k is the platform on which the team intends to use to embark on an aggressive educational campaign of what Cardano ecosystem and blockchain is all about. The platform will also serve as an incubator for fresh ideas which will be fine tuned and submitted for funding in Project Catalyst. The experience and skills of the team is reassuring.They have 2 projects in fund 8 which have been funded and being implemented. This implies that the team has what it takes to successfully implement this proposal. Due to these reasons I gave the proposal a 5 star rating.", "q1r": 5, "q2": "The proposal has provided sufficient and verifiable sites and links on which progress will be tracked. The breakdown of activities with key metrics and milestones makes it very easy to audit the progress and success of the project. Progress of this proposal can be viewed on their Goodwall app. I therefore agree that this proposal has provided sufficient information to audit progress and success. For that matter I gave it a 4 star rating.", "q2r": 4, "assessor": "z_assessor_2924", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7480, "q0": "Any program that is built to engage and deploy any age group is a boon to our ecosystem. This is how we grow to mass adoption, by teaching the youth the benefits and drawbacks of Blockchain technology. The fact that you are building to integrate into the Eastern Townhall excites me! I would love to see more projects take initiative to reaching across cultural lines in order to onboard more users that are excited to build something on Cardano, and have the skill sets taught to them that will help them along the way. A pool of 2 million users is an absolutely huge audience, and I think leveraging your platform is a great way to give people exposure that normally wouldn't have it.", "q0r": 5, "q1": "There are quite a few things I see wrong with this proposal. It worries me that no one in your google doc has linked-in profiles. It looks like each one just has a typed-up resume, which is easily forged. With so many scams out there nowadays, I hope you understand that we have to be cautious as PA's to where we rate to help send voters. I would like to see Linked-in profiles of the people working on this project with $35,000 on the line. You have some great ideas that could really be beneficial to us as an ecosystem, but you have to fully flesh out a proposal in order for me (personally) to feel comfortable telling people that this project will do what it states it is setting out to do. Your budget needs some work too. How many hours do you believe it is going to take in order to get all of this done? I see dollar amounts, but nowhere does it break down the time that will be involved in order to achieve your goals. I think this has a huge chance of getting funded, you just need to restructure your proposal a bit. I wish you guys the best, you are doing great work and projects like this are exactly what we need in the ecosystem!", "q1r": 2, "q2": "I think you are lacking too much information to be completely transparent about where these funds are going. For such a large team, I would think that 35,000 isn't going to even scratch the surface of what you are trying to achieve. I get that you are leveraging an audience that you already have engaged on your platform... but you have to understand too that your project isn't well known in the cardano ecosystem. If you were to reach out and connect through twitter and youtube, or on the catalyst/IOHK forums, and build awareness to your brand, you would likely get funded for what you are trying to achieve. The reports you are telling us you will submit can have numbers that are easily manipulated, so maybe you could have an independent auditor appointed in order to increase transparency. You also state that you had two proposals funded in fund 8 but provided no link, so I am not sure (without spending hours) if what you say is completely true. I would vote for this in a heartbeat if the information in the proposal was a bit more organized. Links, examples, and profiles help greatly with visibility and accountability. I really hope you guys continue the hard work, I just think your proposal needs a bit more information for me to feel safe rating it higher.", "q2r": 2, "assessor": "z_assessor_2895", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1}, {"id": 6265, "q0": "The problem is clearly stated: “Cardano lacks strong representation in the Philippines” and is within the frame of the Grow East Asia, Grow Cardano challenge.\nThe solution is clearly outlined: Goodwall has the user base and will educate it on the basics of blockchain and encourage them to build a local Cardano hub.\nSince Goodwall has more than 61K youth users based in the Philippines, the impact could be significant.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposal has a very well developed plan with timeline attached to it. The plan is very well explained in the impact section in great detail and concisely presented in the feasibility section.\nThe proposer considers a wide variety of problems that could be encountered, among them some unique ones, and presents mitigation strategies for them.\nThe budget is detailed and clear, only hourly rates are to be desired.\nThe management team is well presented with CV documentation. It is clear that the team is very experienced and could easily lead such project.\nThe proposer has total of 6 proposals in Fund 9, however as the proposer states: “We have a team of different people working on the different proposals (funded or to be funded) according to their expertises.”\nGoodwall with a user name” Goodwall” in ideascale has been funded on two proposals in fund 8, I have checked the progress of these projects, the projects are active and in development.\nThe proposer envisions a fund 10 proposal for tracking the level of understanding of the presented material and electing a Cardano Ambassador.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The Auditability section of this proposal is well developed. The key objectives to be achieved are outlined with concrete numbers. The data to be followed will be presented on live dashboards.\nThe success parameters are also well explained and the project has a continuation in fund 10.\nThe only thing I see missing is dates, but hopefully we could consider the end of the project as a date against we could evaluate if the success parameters are reached.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5789, "q0": "The proposal is addressing the challenge of educating and creating awareness of blockchain and cardano in East Asia. Another interesting thing is that, the proposal is leveraging on a platform that has a huge youth bloc, participating in different activities. \n\nIt means that, there is no need to build another system or platform from the scratch to educate the youth. The solution to create awareness sounds good and would be exciting for the youth to learn and onboard them into the catalyst ecosystem. ", "q0r": 5, "q1": "The plan of action is detailed, expressing what activities would be put in place to achieve the results. The survey report is a good way to understand the perception of the youth about blockchain and cryptocurrency. This will guide what kind of content to develop for first-timers and those with little knowledge about the blockchain ecosystem. The timelines are well calculated with having enough time to work on each activity for a successful implementation. \n\nLooking at the activities of the proposal, the budget is in line and detailed. \n\nThe team members for the proposal is quite huge in number. With a 14 team member would make much of the fund going into payment of allowances than the actual work itself. I could see, a community manager and a community moderator and then Head of product and product manager. Looking at the intervals of the timelines, it shows there's ample time to work on the activities with a few team member. \n\nShould the proposal win funding, the team members could be trimmed to have enough funds for the implementation of the project. ", "q1r": 4, "q2": "The information provided is sufficient to audit the results of the proposal. The expected outcomes are measurable and KPIs  showing how the results could be for the community to audit.\n\nThe post survey is also a good approach for a follow up to determine how the youth are demonstrating knowledge in catalyst ecosystem. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 4901, "q0": "The proposers are the Mobile App 'Student community & learning network: Meet people, improve skills & reach goals'  social media and skill App owner, Goodwall. The proposers have a strong students and youth community base (1 million downloads in Android Play Store)  that they can leverage on to help spur the youth interest in Cardano ecosystem in the Philippines. They propose to launch an education program on the basics of Blockchain through experiential learning. Also to encourage them to build a local Cardano hub to be connected to the Eastern Townhall. The program will be promoted through paid marketing channels, and it covers all aspects of the Blockchain technology, the use and its impacts on people's lives. Youths will be engaged in activities that revolve around the Blockchain. \n\nThe program is open source and both Philippines and the regional East Asia youths will benefit from it. \n\nThe program may take about 32 weeks in total from preparation to execution and to results debriefing.\n\nThe program, successfully implemented will have engagement of people in the ecosystem, increase job opportunity and business opportunity.\n\nI don't understand, though, why the inclusion of 'African Cardano community' and 'Youth in Africa' in the 'main risks that could prevent from delivering the project successfully...'.\n\nNotwithstanding the immediate foregoings, I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "First of all, I would like to point out that the total sum of the budget works out to be USD33,000 and not 35,000.\n\nThe detailed plan does seem to be in line with the proposed solution. It is also in line with the budget. I see that the project team is an organization with a full management team having sufficient resources for this program and the project from previous funds and of the current fund if so funded. The personnel are of the calibre and experience for the implementation of youth training, education, engagement and motivation projects.\n\nWith all the factors above (not taking the error sum calculation), I strongly agree that it is highly likely this proposal  will be implemented successfully.", "q1r": 5, "q2": "The proposal has selected 5 key objectives with targets based on 3 indicators namely impressions, engagement and challenge entries with each indicator being defined, to measure the progress. These results will be reported in the live dashboard, to be set up, constantly on the analysis and target results. \n\nFor the success, the proposal \nlooks at 65k users. \n'ambassador of the Philippines' proposal in fund 10. \n300 people interested in catalyst and 'many' submit proposals.\n\nI see that the proposers have considered all necessary factors to track progress and to measure success and therefore I strongly agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2631", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3928, "q0": "The problem being cardano not having good representation in the Philippines and goodwill has a good community in the region. Goodwill wants to use this community as a leverage to educate Philippines youth about the basics of blockchain and also encourage them to create a Cardano local hub connected to the Eastern Townhall. This will be helpful to reach new people hence helping cardano to onboard new members thus helping ADA ecosystem to grow. As the community of goodwill grows the targetable audiences will also grow hence this can be scaled. therefore the proposal effectively addresses the problem", "q0r": 5, "q1": "As per the proposal the goodwill does have the community and also the teams to execute the proposal. The proposer has given a plan to implement the proposal and also has the resources. They have given a rough timeline and Without clear budget breakdown of $35000 it would be hard to say if the fund asked for is justified or no. The proposer has taken in account of all possible risks and challenges that may effect the successful implementation of the proposal. it is possible that the proposal will be implemented successfully", "q1r": 4, "q2": "The proposal consist of a rough timeline without milestone based approach and also doesn't have clear budget breakdown these would have helped auditors. However the proposal do consists of key performance indicators and also regarding how success would look like all these will be helpful to measure the success of the proposal. Without the milestone based approach it is possible to track the development of the proposal therefore with the given information it is possible to audit the development and the successful implementation of the proposal ", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3756, "q0": "The Philippines is one of the countries with a huge participation of people, especially young people, in the Crypto market. However, the level of interest and participation in the Cardano ecosystem of the Crypto community here is not high. Proposing Cardano pre-hub in Philippines is a good idea to be able to attract a large number of Filipino Crypto community in general and attract more than 2 million youth of Goodwall platform to know Cardano and Catalyst ecosystem . Thereby contributing to the faster development of the Cardano ecosystem, attracting more people to participate in the development of the Cardano ecosystem in the Philippines and East Asia.", "q0r": 5, "q1": "The team of 14 people are all experienced and passionate about the Cardano ecosystem such as: Eugenio Donadio, Marcela Correa, Mariel Gascon,... I believe, with a team as large and enthusiastic as so surely the group will successfully implement this proposal. In addition, the information about the members is also very clear and complete. The community can easily find your information through social networking sites like Linkedin, ... I appreciate this very much. The risks that may affect the proposal are also proposed by you and have a plan to handle. This shows that you have prepared very carefully for the success of this proposal. I believe the community will also appreciate you very much.", "q1r": 5, "q2": "The roadmap given by you to implement the proposal is also very clear and complete. The KPIs you give such as 1 million impressions, 30,000 commitments, 1000 video items,... These are all measurable numbers so that the community can easily assess the success of the topic. export. I appreciate this very much. However, there is a small suggestion for you to be able to get even higher consent from the community that you need to be more transparent and detailed about financial expenses. For example, create a program document $6000, promotion $7000,... You need more details about these numbers so that the community can better understand how your finances are used. I believe, if you can do more of this, the community will appreciate you very much.", "q2r": 4, "assessor": "z_assessor_2476", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 3632, "q0": "A necessary proposal to develop the blockchain community in the Philippines.\nI imagine blockchain teambulding sessions will be held here, the participants are talented and enthusiastic young people who are eager to learn. Through the development of life skills combined with understanding blockchain will help young people have the opportunity to access and learn more about blockchain.\nI think there will be a lot of projects written and commented on by the participants.\nGenZ is considered as the potential generation of the world, converging new things, eager to learn will be potential members of the Philippine blockchain community.\nThe proposal is proposing to expand the community in the Philippines but in the risk section it is about the African community.\nAll in all, this proposal fits very well with the theme of Cardano development in East Asia.\nI and the young Filipinos look forward to your project working", "q0r": 5, "q1": "The surveys will show the level of understanding of blockchain among young Filipinos, thereby recommending appropriate content and activities to advertise and introduce Cardano.\nBecause blockchain in general and Cardano in particular is still very new, the preparation of article and video content must be easy to understand but creative and attractive to create excitement for participants.\nThe blueprint of the specific proposal, the items are clear, easy to understand.\nThe detailed budget table for each work item is reasonable. In the budget section with the distribution of challenge rewards, I think this section will be attractive and attract many young people to participate.\nThe team consists of 14 main members who are assigned specific tasks.\nWith the experience and qualifications of the members, I believe they will do well in this project", "q1r": 5, "q2": "Specific project progress metrics are verifiable numbers, impressions, video items, and community feedback that also show project performance. In addition, detailed reports sent weekly and monthly will assess the transparency and credibility of the project.\nThe biggest project success is the number of new people signing up on Cardano Catalyst: project proposals, reviewers.\nAll of these goals are easily assessable and verifiable by the community.\nThe proposal, in addition to the goal of increasing the value and expanding the Cardano market, also provides an opportunity to earn more for young people, projects will have the opportunity to raise funding, from idea to action. The final move is the result", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 1909, "q0": "Education of the youth is very important, especially in how technology like Cardano and Blockchain is going to help humans all over the world. \n\nThe collaboration with Goodwall really breaks down the barrier of being able to have outreach and access to the Fillipino youth. \n\nThe timeline of the project is ambitious but very doable, especially seeing the detailed breakdown and working with Goodwall. \n\nGaining skills and knowledge is important, and incentivizing it with rewards is a great idea to stay engaged. ", "q0r": 5, "q1": "The Goodwall platform and team already have an established network and are a great catalyst to educate and grow on Cardano. \n\nAs blockchain being the future, youth from all over the world need access to education tools and this seems to start here and have the potential of continued growth into all youth circles over the world. \n\nOne of the biggest challenges is education, and education that is made easy to access, but also easy to understand. \n\nThis will then grow the next level of adoption and usage around the world. \n\nThis could be a great case study to further grow knowledge and education of blockchain technology and how to interact with it far and wide. ", "q1r": 5, "q2": "All of the information provided is sufficient to audit the progress of the proposal. \n\nSome of the information about auditing could be elaborated on a little more, just to understand how those metrics will be fully tracked. \n\nI think using the impressions and click through's area  great indicator with ads and tracking, but also curious how else to track constant use and growth? \n\n300 new people on board via this project is a great number and very achievable. Over time I think this will really grow in the next 2 years and expand immensely, especially as educational offerings expand through the videos and content created with this proposal. ", "q2r": 5, "assessor": "z_assessor_2287", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13755, "q0": "Yes, I agree, this proposal meets the challenge. This proposal highlights \"Goodwall\", a platform that will allow them to promote educational content to their targets. \"Goodwall\" is full of users in the 16-24 age group, including 61,000 users living in the Philippines, a significant number of East Asian citizens who will be affected, an essential point among the challenges to be met. In addition, the educational content that will be offered will be tailor-made videos adapted around blockchain technology and the Cardano ecosystem. From this, personally I think that this proposal meets the challenge that is appropriate to it.", "q0r": 5, "q1": "Yes, I find it very likely that this proposal will be successfully implemented. On the one hand, the role that each member of the team will play, and the CVs presented of each member, sufficiently prove the competence of the team to carry out this proposal successfully. However, a small concern arises. The team is being funded on a proposal from the past fund so it obviously affects the realization of this proposal since part of the (human) resource will be used on the proposal already being funded... Finally the expertise of this team which is seen by the way it manages their \"goodwall\" platform and the detailed plan it provides which in my opinion I find realistic and reasonable especially in relation to the deadline of each stage suggests that she is professional, hence I think it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The team proposes: impression, engagement and challenge entries as the three key indicators for measuring the success and progress of this proposal. These three elements, clear and very easy to verify, provide sufficient information likely to verify the progress and success of this proposal. They define impressions like the number of times the branded content was viewed on screen, engagement like the number of times the branded content was liked/commented on Goodwall and a challenge entry is defined as a video or a downloaded image related to the program.", "q2r": 4, "assessor": "z_assessor_3778", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13864, "q0": "Focusing on educating and facilitating blockchain technology to young students and entrepreneurs in East Asia is fundamental for the correct and successful development of Cardano Catalyst Community. This is a fast growing region and Cardano Catalyst Community cannot stay behind in presenting itself to this wide audience as an interesting and inspirational blockchain environment where students and young entrepreneurs can learn and grow to achieve their goals. Connecting with the Goodwall platform will expand exponentially our capacity of drawing in newcomers. This proposal does effectively address the challenge of growing the East Asia Developer Ecosystem and Cardano Catalyst Community. Education and engagement in Cardano technology can be a really groundbreaking point for the Philippine youth and community.", "q0r": 5, "q1": "Connecting with the successful Goodwall platform is a guaranteed success. It is a highly experienced platform with a high calibre team. Having this strong alliance is always fruitful. Especially knowing that it has already been funded in previous funds with already funded projects and is looking forward to continuing working with Cardano Catalyst. The designed key milestones in the current time line are consistent and will provide interesting data for our Community. Surveying how much Philippine youth know about blockchain can be a good starting point for developing a good and strong strategy of Cardano blockchain technology education. Given experience and the plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "Goodwall has great experience in measuring and analyzing their KPIs. Live Dashboards will be enough to audit constant development and relevant data. Given the experience Goodwall has already gathered within Cardano Community it is to say that the information provided is sufficient to audit the progress and the success of the proposal. In this proposal, numbers are a key milestone. The estimation of 300 newcomers into Cardano Catalyst will be an interesting opportunity of drawing in new projects and ideas", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Goodwall will educate Filipino youth on the basics of blockchain through experiential learning programs, and encourage them to build a local Cardano hub connected to the Eastern Townhall. ", "experience": "Goodwall is a mobile-first platform helping 2M+ youth aged 16-24 in 150+ countries develop skills, showcase their talent and connect to each other and to opportunities. We have 14 Filipinos in the team and over 61k users based in the Philippines."}