{"id": 423225, "author": "jtrube", "title": "Maximize Value From Previous Funds", "url": "https://cardano.ideascale.com/a/dtd/423225-48088", "category": 26602, "amount": 5000, "description": "There is more value that could be extracted from the content we are creating from previous funds. With additional time and resources, content could be built upon and shared with a wider audience.", "f6_no_assessments": 9, "f6_rating": 3.4074074074074074, "videos": [], "media": [], "f6_assessments": [{"id": 2977, "q0": "This proposal loosely meets the goals of the Grow East Asia, Grow Cardano challenge setting. The challenge setting lists only one requirement: that the proposal focus on, or originates in East Asia. \n\nThis proposal intends to create evergreen content in both Japanese and in English. The proposal intends to make use of previously created content that is being used to complete previous funds.\n\nThe proposal falls short in this assessment because the problem statement does not define the audience well, and does not pose a problem to be solved for the Cardano community specifically. ", "q0r": 4, "q1": "The team appears to have excellent experience in Japan creating marketing and presentation materials for consumption. Their content appears to be of high quality. They list a wide variety of large companies as clients.\n\nI could not fully agree that this project will be successful. Two previous funds of work exist without completion. The Fund 7 proposal appears to be stalled. I cannot find any video or blog content that is directly related to Cardano from this proposal. The Fund 8 proposal has begun, and they have made some progress. \n\nI resisted a lower score because of the relatively simple nature of this proposal. I suggest the proposer ensures that links with content are included in the proposal, so that it helps PAs and voters to better judge the feasibility of future work.", "q1r": 4, "q2": "I agree that this proposal can provide additional useful content for the Cardano ecosystem. This content especially addresses the geography in question by this challenge setting. \n\nHowever, I do not feel that the open-ended nature of the request allows for users to see how much content they will be receiving. The proposal specifies that they will create blog posts, as well as new visual content. I cannot locate the website or services that these items are to be published. In the future, it would be helpful if the proposer’s metrics included a goal for a certain amount of content produced within the timeframes given. It will also help to provide links to the existing content that is created under previous funds. This will improve auditability metrics.", "q2r": 2, "assessor": "z_assessor_2376", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3025, "q0": "I always find it useful when someone decides to put together all the information scattered across the Cardano ecosystem and that's get even more useful when it gets translated from a language to another one, Japanese and English respectively, considering this proposal. The problem stated is a problem that has appeared in all Funds by now, in different ways and in different projects so it is something we are all familiar with. Among these lines, the solution stated is also pretty clear and addresses the problem within the challenge setting. It is not something that big that would make a change but for the money requested is pretty decent. Also, we should not forget the phrase \"One step at a time\". In that manner, i think that this proposal has something to add up to the whole Cardano ecosystem.", "q0r": 5, "q1": "There is a detailed plan and in my opinion a pretty realistic one with all the necessary details to know about the project. Refering to the team getting involved with this idea, there is only one person there, which is something not necesserily bad, but that one person is a professional marketer. Marketing is one part of the proposal and considers one part of the funds requested but web development is another big part of the project, considering for example that a blog will be made and visual media will be constructed. Should the proposer hire a web developer to do this kind of work, it is something that should be stated in a rather clearer way. In the same concept, who will be in charge of the copywriting task of the project and how did you calculate their salary? What resources will be needed there to do that and all tasks mentioned? ", "q1r": 4, "q2": "The roadmap and the milestones are all successfully there and are stated pretty clearly. Regarding the ways of observing the impact generated by the project, we found that quite reasonable ways of understanding this were chosen. We can highlight some indicators for example, the number of Git commits and also the number of blogs and articles. These indicators, though, were not accompanied by numerical targets that help to verify the result. This is something that will would help in understanding the results of each action. The proposer also needs to state some other key points as when the project will be considering a success. What exactly do you mean by with the statement gone into circulation? What does that entail? Should those be corrected, i believe that this project is auditable by the community. ", "q2r": 3, "assessor": "z_assessor_2385", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3652, "q0": "This proposal aims to bootstrap the content created by proposals in previous iterations of Project Catalyst. Creating written and visual media content in Japanese and English. A marketing agency called Eggworm is mentioned as the entity to carry out this proposal. This agency seems to have several years of experience with offices in Tokyo and Doha. In the proposed solution section, they mention to already have been creating original Cardano content in Japanese, although no examples are provided as reference. What lacks clarity regarding this proposal is how utilizing content from archived proposals of previous iterations will help with Cardano adoption in Japan. One might argue that Japan is already one of the countries with the highest Cardano adoption due to the ICO taking place in this country as well as Emurgo residing there. The idea of re-purposing information of previous proposals is a good one, but perhaps not for the goal of increasing awareness of Cardano to new users, since this new potential users will be more interested in the latest trend or topic in the cryptoverse. Is my opinion that this effort would be better directed to seasoned members of the community looking to work in new (forgotten) projects.", "q0r": 4, "q1": "Nick Clarke, the co-founder of Eggworm, appears as the person who will work on this project. Although very capable according to his CV, it’s not clear if he will do the tasks of web development, copywriting, photo and video editing. For this tasks it’s clear people will need to be hired or existing employees from Eggworm will work on them? Additional information regarding the execution of this proposal would be beneficial to make a complete assessment. \nAccording to the detailed budget breakdown one thousand will be allocated to web development. This amount seems very low to develop a website from scratch, or does the website already exist and this amount is to cover the expansion? How many hours of development are covered with this amount? Same thing for copywriting and photo/video editing with a budget of two thousand each. How many hours of work are covered? Who will do these tasks?", "q1r": 3, "q2": "The proposal should provide more accurate milestones and measurable KPIs to analyze its progress and success. For example during the first month of web development progress they will monitor git commits. Does this mean that the web site will be ready on the first month? How many git commits constitute a finished site? Same thing for number of blogs and articles written in the second month. There should be a goal set of how many posts they aim to have publish by this time frame. Success cannot be measured if there are not goals set at the beginning of the project.", "q2r": 2, "assessor": "z_assessor_2465", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5598, "q0": "This proposal addresses the \"Grow East Asia, Grow Cardano\" challenge correctly. \nThe intention to generate informative content to educate the Asian community on all things Cardano definitely seems like an opportunity that should be taken into account.", "q0r": 4, "q1": "While the proposing team has the appropriate drive and experience to generate the proposed strategy, the description of the format to be used is very vague and does not offer solid arguments as to why content in the form of blog posts is the most appropriate form of outreach to the Japanese community.\nIs there any data that would allow us to understand the impact and benefit that would be generated by creating written content or would there be a way to contrast with the impact that, if for example, would be generated by creating such content in video format?\nIt is mentioned that existing content about Cardano will be repurposed, but there is no mention of sources, topics or, as mentioned in the previous paragraph, the desired format.\nI believe that for this initiative it would help a lot to have a proof of concept of the publications that are sought to be created.", "q1r": 2, "q2": "The team provides clear milestones to track progress and the plan to achieve the desired outcomes can be easily understood and is reachable.  The provided break up of the budget seems to be down to earth and again, reachable, however the proposal's ultimate goal of increasing circulating information about Cardano and the impact on the level of knowledge that the Asian community will gain, can hardly be measured even if the plan is successfully implemented, which is why I give a rating of 3 out of 5.", "q2r": 3, "assessor": "z_assessor_2719", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9561, "q0": "For an incredibly low-risk proposal that has potential for relatively high-reward outcome, I rank this section a 4. I am a little more generous with this proposal because it’s so low-cost but I would raise some concerns with the details of this proposal if it had requested more funding above the $10k range. First of all, the development of the Japanese Cardano base is relatively new and growing, so I want to be seeing proposals like this that are dedicated to the cause. As a content creator myself, I’m well aware of the benefits of “evergreen” content that can always be returned to for years to come. This time of content helps media streams to secure long-term sustainability, consistent audience growth, and passively proliferating information that remains relevant. I’m also aware of the many impacts of repackaging content such as compounded ROI and reduced labor for growth. In the short bits of information that have been provided here, it does communicate a lot for greater impact. However, from an objective standpoint this proposal should be including a lot more information/justification of the post-proposal world.", "q0r": 4, "q1": "I rank this section a 4 because the tasks provided are not at all difficult to accomplish and the proposer has moderately sufficient skills to do so. A repackaging campaign is not difficult to accomplish, so my objective determination of feasibility is that this proposal can make it. Still, I would like to see improvements in every section of this proposal. The roadmap is a little light in what understanding it provides to voters about how much content is being reviewed, how many hours of labor each task requires, and bonus points for what each task would cost. The budget raises some concerns with it’s lack of detail because it includes expenses that are not discussed in any other parts of the proposal. It allocates web development as an expense but the website appears to be already built out and there’s no web developer cited for this job. It also allocates $2k to copywriting, which is confusing if all the content is created and produced solely by the proposer. Overall, this section seems entirely feasible and low-cost/risk but voters will definitely be wanting more detail if they are to vote favorably. ", "q1r": 4, "q2": "I rank this section a 4 because any features of this proposal that can be measured are being measured in a transparent and public way. I think the identified KPIs are appropriate for this proposal because it thoroughly tracks progress in multiple areas for each media medium. Where this section loses points for me is that it only identifies categories for KPIs and does not include targets. The best Catalyst proposals provide target metrics for the amounts of what they intend to produce, the engagement for what they produce, and the progressive development of what they produce. This proposal has plenty of room to add additional detail to how many blogs/articles will be written in a given period of time, how much new content will be produced at different milestones, and (most importantly) how may views/clicks/engagements each form of media receives. I rank positively for appropriate framing of auditiblity but I would expect voters to respond even more positively to these improvements. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11562, "q0": "The proposer and the company involved, \"Eggworm,\" previously delivered interesting creative work - an animated video covering blockchain fundamentals - and organized an online meetup for the Japanese audience, and this proposal aims to repurpose the created content by writing articles and creating visual media all related to promoting Blockchain and Cardano to the Japanese community. All of this, in my opinion, is in line with the challenge's goal of expanding the ecosystem in East Asia, as well as one of Cardano's main goals of enabling open participation in all regions. The project will have a local impact because its target population is the Japan Cardano community, which was already engaged in the previous funds. Furthermore, because the content will be available in both English and Japanese, I believe it has the potential to reach a global audience.", "q0r": 5, "q1": "Several factors point to the project's success. Most importantly, the content that is aimed to be repurposed already exists, so the majority of the work will be media editing, that's always easier than starting from scratch. Nick Clarke, the person involved in the project, has a decate long experience with creative work and marketing, indicating that the proposed work is likely to succeed. Furthermore, the timeline is reasonable, as it includes exploration and search of existing Cardano content in Japanese, as well as the writing/editing phase, with the final goal of sharing the created content on their websites and partner channels. While the budget in the proposal is simple, it covers all costs associated with this type of project. The only thing that is missing is how the costs were calculated - how many hours are required at what cost, and so on. The total budget appears to be typical for this type of work.", "q1r": 4, "q2": "The proposal includes details on the metrics that will be used to track progress throughout each project phase, and these KPIs were carefully chosen to reflect the success and reachability of the created media. Monthly delivery schedules are also established. However, the proposal does not specify where the community will be informed about these statistics or where the reports will be published. I assume on their websites or the Twitter account linked to the Eggworm website. Furthermore, one of the KPIs is the number of Git commits, but there is no link to the github repository. ", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11723, "q0": "the proposal centers around the idea of refreshing and repuposing past contents that they have put up in the past for the japanese cardano community.\n\nFor the relatively small funding size that the team is asking for, I think this is a fair proposal that could be supported. in terms of impact potential, i can see that it is indeed aligned with the challenge setting and can grow the japanese cardano community by refreshing content to the latest contents, new visuals, etc. having worked in the retail segment myself, i can attest that sometimes it's not neccessary to go out and keep creating and innovating new stuff. just refreshing old stuff is fine as well. and considering how fast the cardano ecosystem is evolving, with new projects, dapps to share, news and developments to be aware of, i think it is a fair proposal for the team to continue spreading the good word of cardano. it also helps that the team behind the idea had two previous proposals that were funded before in previous rounds, and we could see their work for other brands clearly on their website, proving an established track record. however, i cannot see any content on cardano itself. i cannot be sure if it was just not updated on their website, or is it that they only share physical events, while digital sharing is not included, or the reason behind the lack of cardano information on the site. it would be appreciated if they could attach links to their cardano specific work that has taken place to identify the sort of contents they intend to repurpose. \n\nthe proposal was indeed written in a concise manner with no unnecessary fluff, though, like mentioned above, some additional details like links to past cardano-related work would help. the risks associated with the project is fair, but that happens for the media industry as a whole, with silencing and cancel culture even in the west itself. i say, it's indeed a valid risk but an acceptable one. ", "q0r": 4, "q1": "the timeline provided is a fair one, considering that only one person will be working on this proposal, AND that he is working on other proposals in this fund 9 and also previous funds. I say fair as in, it is a realistic timeline, but not the best or fastest one. he would take a whole month, just to perform an inventory of existing content, who knows how much content is there since the links to previous cardano content were not shared. additionally, because of the lack of information, i cannot justify the budget the proposer is asking for. i understand that the cost of living in japan can be fairly high, and by no means am i saying that the amount requested is \"too expensive\". but the proposer would need to at least disclose the amount of work to be done, for us to fairly judge the funding amount and the timeline to be fair. \n\nalso, what does not help is that his linkedin is empty, having graduated in 2005 and no other details of his achievements from thereon. as passionate as he is, i cannot justify a good rating for this section", "q1r": 2, "q2": "as for auditability, I think the proposer did a decent job outlining how can his project be audited. It states the measures for his KPI month by month, the frequency is assumed to be a monthly update of his progress, and I believe the rest of the reports will be shared via github, as he points out for month 1. it would help if he explicitly indicates if the reports in month 2 and 3 will also be shared via github or elsewhere. for a simple proposal as such, i do not think we require any more complex measures for auditability.", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12365, "q0": "The need to add value to content from previous funds. The problem is an important area in tech which seeks to be addressed with innovations in the technology industry. The proposal outlines its solutions in a clear and detail way in addressing the problem. This is put into what the project will do, how it intends to carry its activities to bring solutions, who the said project will be engaging, what are the benefits the project seeks to bring to the community, how this brings about maximizing previous funds. The proposal gives information on how it could contribute to the Cardona ecosystem. The proposal considers some risk it could encounter in executing the project and has provided solutions to prevent these risk.", "q0r": 4, "q1": "The information provided on team members are mainly going to contract the services of experts in the area of tech and blockchain with just a member of the main team to be implemented. However the team lead of the said project has a different background experience other than technology and blockchain. There exist not a supporting team to the project only a contracted services of Eggworm. The budget is relatively small for the project and I'm not surehow this will scale up to meet a large number of users in the future. Furthermore, I'm a bit confused on what the intended purpose of the project since there is no part that shows a revenue stream and what it intends to achieve when the project is implemented. Also, there is instance of payment been made to the lead team as compensation.", "q1r": 2, "q2": "The proposal has given good information on how the stated problem can be addressed. However, I think there alot of information that seems not too clear per my understanding, to be implemented. The proposal has provided ways to which the progress of work can be measured. Examples are the reports detailing the number of blogs and articles written and the number of new visual media created. There is not part that shows how the project will be sustained with a relatively small asking budget to implement the project.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13023, "q0": "The company and the team live in Tokyo. Proof on the company website shows events and marketing, bringing international product/brand awareness to the Japanese community. Therefore, the proposal meets the requirement: “originate or focus on East Asia and include East Asian team members or focus on East Asian participants.” However, the problem statement does not address bringing Cardano to East Asia. A stronger problem statement would include what the problem is relative to the challenge settings for F9: Grow East Asia, Grow Cardano and what specific audience is affected. The problem presented is that the company needs more time and money to work on previous projects.", "q0r": 4, "q1": "The website of the company, the experience of the team, and their professional services and work look to be reputable and of high quality. However, after a review of previous funding rounds 7 and 8, successful completion of the project is questionable. Project goals for fund 7 are not complete. The team has not met its deadlines and has not received full fund 7 funding. It is too early to measure their success for fund 8. However, the report shared by the team shows that the only progress made is the hiring of an actor for their proposed blockchain & cryptocurrency master class video. In future funding rounds, trust in the successful completion of projects is likely to be gained with proof of content, reach, and community engagement.", "q1r": 3, "q2": "Audibility of the proposal may be challenging. There is no level of measurability. When is progress is expected? How much progress will be accomplished in that timeframe? In order to audit the project sufficiently, I suggest that the proposal includes timelines for completion dates and specific work products expected.", "q2r": 1, "assessor": "z_assessor_3540", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will remix and repurpose existing content to maximize its value and ensure it remains evergreen. We will create written content in the form of blog posts and articles, along with new visual media.", "experience": "Eggworm as an agency has spent over a decade establishing valuable working relationships between brands, companies and communities in Japan. We create experiences that empower our partners and bring their brand stories to life."}