{"id": 381392, "author": "dwayne", "title": "DAO-NET: Legal Defense DAO", "url": "https://cardano.ideascale.com/a/dtd/381392-48088", "category": 26235, "amount": 25000, "description": "La défense juridique nécessite le financement continu d'un effort coordonné par de nombreuses professions, alors que les efforts communautaires ne sont financés que sporadiquement.", "funded": 2, "upvotes": 185973774, "downvotes": 7022171, "votes_result": 178951603, "votes_cast": 1190, "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "This project would enable a more organised way of handling legal issues. By organising into a DAO, stakeholders can obtain a decentralised way of decision making and thus act more efficiently to potential legal threats. It would also create a way of funding legal actions. The executing faction would be stronger as it no longer relies on a single project to decide a direction, but many can cast their vote according to their stake and act as one, making legal action much more efficient. Creating a dashboard overview only adds to this efficiency. ", "q0r": 5, "q1": "The team is partially assembled. Profiles have been determined in order to attempt to complete this team. The budget allocation is set correctly to kickstart the project and has taken a way to fund itsself in the future into consideration.  As the project is aiming to be open-source, there is bound to be some enthusiasm within the legal community and this creates an easy gateway for future partnerships. ", "q1r": 4, "q2": "No auditable variables are lacking in this proposal. As it is a legislation-related proposal, the way the risk analysis has been elaborated in detail is impressive. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 28, "ne": 5, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "Great idea and a comprehensive proposal. It sounds great to have a DAO to provide continuous funding for legal defense for favorable crypto regulation. I look forward to seeing this proposal actualize. ", "q0r": 5, "q1": "Great strategy and specific initiatives to building DAO. I think this is achievable. I am not quite clear on how you intend to self-generate funds. I think this is great to consider as the community. Influencing policy isn't an event but a process. Great team experience as well.", "q1r": 4, "q2": "Great budget breakdown. A refine definition of success and a detailed road map. This is open and traceable. Overall, the proposal can be tracked for easy auditing. There proposal intends to provide a database of activities within a specific jurisdiction and provide an action plan making the team's commitment to transparency clear.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to start a DAO to help with legal issues regarding blockchain. By providing a dashboard with an overview of which legalizations are in place and which are pending you create a place where all information that is needed is provided. This dashboard is a surplus on the referral network for lawyers that the proposers plan on building. This completely fits within the challenge and uses blockchain perfectly.", "q0r": 5, "q1": "For feasibility, the team supplies us with many details. The team behind the proposal has the relevant experience and background for this. As stated they are searching for a web developer to help them with the dashboard, this would complete the team for this proposal. Speaking from experience the budget requested for the proposal is more than feasible.", "q1r": 5, "q2": "We are not missing anything for the audit. We get a proper roadmap that leaves no gaps for following the project. Reading through the proposal gives you the feeling of professionalism which makes it clear the proposers understand the problem and the challenge. What's even more impressive is how they handled the risk management of the proposal. To the proposers, I can only say: \"Well done!\".", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 23, "ne": 1, "ng": 19, "nfo": 3, "vca_o": 1}], "solution": "Créer une DAO, avec un financement durable, qui coordonne les efforts des avocats, des comptables et des lobbyistes pour se défendre contre les contestations juridiques.", "experience": "Une équipe expérimentée de développeurs Blockchain, de pionniers Plutus, d'opérateurs SPO, de conseillers communautaires et d'analystes de solutions."}