{"id": 384987, "author": "cargofe2", "title": "Study and Pilot in Colombia", "url": "https://cardano.ideascale.com/a/dtd/384987-48088", "category": 26235, "amount": 5000, "description": "La Colombie dans les crypto-monnaies, développe un pilote de l'autorité financière qui influencera le futur de Cardano dans ce pays.", "funded": 1, "upvotes": 40137061, "downvotes": 19022659, "votes_result": 21114402, "votes_cast": 276, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition de mener une analyse approfondie des résultats de la sandbox réglementaire d'un an promulguée par l'autorité de supervision financière de la Colombie concernant la mise en œuvre des crypto-monnaies est intéressante, et hautement réalisable. Cependant, étant donné que les objectifs du défi visent à créer un environnement de lois qui sont plus favorables ou moins nuisibles à l'espace crypto, avec un accent sur PoS et sur les particularités de Cardano, je pense qu'une future itération de cette proposition devrait se concentrer sur l'aspect lobbying et mise en réseau du défi, plutôt que de s'arrêter à l'analyse des expériences réglementaires, dont on peut comprendre, des mois après le lancement des tests, que le résultat le plus significatif est que les institutions financières et les plateformes de crypto-monnaies peuvent maintenir des alliances et fonctionner sans conflit, contrairement à ce qui s'est passé en Colombie dans le passé. Il convient également de souligner que, selon les informations disponibles en espagnol, la SFC n'a approuvé que 4 crypto-monnaies à coupler avec le peso colombien au cours de ce projet pilote / bac à sable réglementaire : bitcoin, ethereum, litecoin et bitcoin cash, ce qui signifie que ni Cardano ni une crypto-monnaie PoS ne participeront au pilote, avec l'absence simultanée de preuves dérivées du pilote pour les conséquences réglementaires que les spécifications PoS entraîneraient nécessairement par rapport à PoW.", "q0r": 2, "q1": "L'équipe est clairement très compétente et possède l'expérience nécessaire dans le secteur public en Colombie, avec un cabinet de conseil déjà en place pour développer l'analyse décrite, et le budget est clairement indiqué et ventilé. Cela dit, leur principal centre d'intérêt semble être le registre territorial/terrestre, sans expérience vérifiable dans le secteur de la crypto, ni dans la communauté Cardano avant Fund7 ; je recommanderais fortement d'incorporer cette information dans une itération future du projet. Bien que le document final proposé soit certainement réalisable pour l'équipe, il n'y a pas d'indicateurs clés de performance clairs qui tiennent compte du lobbying ou de la mise en réseau ; je suggérerais comme paramètres potentiels le nombre d'entretiens à mener, la spécification des organismes gouvernementaux à approcher (comme ceux qui composeront le comité d'évaluation, tels que la présidence de la République, la SFC, la Superintendencia de Sociedades et la Unidad de Información y Análisis Financiero, entre autres), etc.", "q1r": 3, "q2": "Les informations fournies montrent qu'il y aura un produit concis à la fin de la période de 3 mois stipulée, qui montrera le succès de la proposition. Cependant, comme indiqué ci-dessus, il n'y a pas d'indicateurs clés de performance clairs permettant de mesurer ou de vérifier l'avancement de l'analyse et du rapport. Dans ce cas, je recommanderais que l'analyse soit divisée en livrables qui peuvent être utilisés comme une indication mensuelle des progrès réalisés, que ce soit comme des chapitres indépendants (par exemple concernant la réglementation précédente ou les positions de la SFC envers la cryptoéconomie, les alliances participant au bac à sable réglementaire et les antécédents de leurs membres vis-à-vis de la crypto, etc) ou comme indiqué ci-dessus, comme le nombre d'entretiens tenus, avec leurs enregistrements / conclusions étant un livrable possible à des fins d'audit.", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposing team has filed 2 proposals that are complementary. By performing analytic research on what the Colombian government is intending to impose as legislation, the informational chart from the other proposal can be updated to conformity. By doing this, the chances of successfully influencing legislative decisions rises significanlty. Such an analytical documenbt could hold great value for future ventures in the cryptographic sphere on Colombian territory. ", "q0r": 5, "q1": "The proposal authors have relevant experience in the fields of law and government in Colombia and have provided evidence of this experience. By intending on making their research open-source, they are in a position of potentially helping a lot of projects. This increases feasibility significantly as cooperations will be desirable. ", "q1r": 5, "q2": "The proposal has a complete set of auditables. There is a clear roadmap with funding breakdown, definition of succes after 3/6/12 months, risk analysis and concrete prospected release date in place along with measurable KPIs. Very good work. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 4, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": "This is a proposal on researching and piloting the application of electronic money in real life to see how it is received by citizens in Colombia. The proponent has legal experience in Colombia. The project is needed at the present time, raising public awareness about blockchain technology and cryptocurrencies in the countries.", "q0r": 4, "q1": "Researching the community response as well as building a legal framework, a technology foundation for bringing cryptocurrency to life is absolutely necessary, and completely feasible at this stage of blockchain's development.", "q1r": 4, "q2": "After the process is completed, the results of the research will be made public, and recommendations for next steps to raise awareness and practical application of cryptocurrencies will be made. This is a necessary stepping stone, supporting the serious implementation of cryptocurrencies into life.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. However, the proposal does not give a clear indication of the campaign that would enable favorable regulation. I would be glad if the team create a framework to serve as a reference point for favorable legislation in Columbia.", "q0r": 4, "q1": "This team has experience lawyers and individuals in the public sector to achieve their goals. After reading the proposal, I am not getting a detailed plan and focus outcome for the project. I think the team should make their strategy clearer. What kind of specific benefit is the proposal aiming to measure.", "q1r": 3, "q2": "There should be detailed activities for which the budget would be used. Also, the proposal should show how activities would be documented. This would be helpful for tracking and auditing.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Nous étudierons le pilote en cours et obtiendrons les informations nécessaires pour déterminer les conséquences éventuelles.", "experience": "Quinze ans d'expérience dans le secteur public colombien dans des entités telles que le département de la planification nationale."}