{"id": 381885, "author": "gwendal.ledivechen", "title": "African Blockchain Centre for Devs", "url": "https://cardano.ideascale.com/a/dtd/381885-48088", "category": 26244, "amount": 30000, "description": "\nトレーニングを受けたカルダノ開発者が世界的に不足している\nアフリカの開発者の認知度・信頼度の高さ\nアフリカ人の頭脳は西欧諸国に流れる\n", "funded": 0, "upvotes": 18619246, "downvotes": 17974111, "votes_result": 645135, "votes_cast": 109, "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "この種の提案書を読むたびに、カルダノが多くの人に影響を与えていることにいつも驚かされます。今回、提案チームは、カルダノのために開発する熟練した開発者が不足しているという問題を提起しています。また、アフリカの事情も紹介されており、この問題を解決する必要性を強く感じました。ABCDのミッションは、5年間の戦略的計画で詳細に説明されているように、アフリカにおけるブロックチェーンソリューションのリーディングプロバイダーになることです。ABCDは、特に今回のCatalystサイクルへの資金提供を要請しています。それは、最初のコホートを立ち上げて、フォーマット、コンテンツ、受講レベルなどをテストするためです。これは、課題設定と完全に一致しています。成功指標については、非常によく定義されています。しかし、インパクトを見積もるために、各指標の目的を定義することは興味深いことです。\r\n", "q0r": 4, "q1": "JoshuaとGwendalは、CardanoとCatalystとともに誕生したABCDの創設者であるため、多くの価値観やビジョンを共有しています。提案書を読んで理解したところでは、彼らはすでに14人のブロックチェーン開発者の第一期生をリリースしているので、今回も期待されています。今回は、短期、中期、長期のビジョンを持った、より強固な提案がなされており、その点には拍手を送りたいと思います。チームは、主な目的、範囲、利害関係者、障壁、期待される結果などを優れた方法で明らかにしています。そうすることで、コミュニティは実現可能性について十分な情報を得た上で判断することができます。改善点を挙げるとすれば、予算の決め方でしょうか。最終的な数字に到達するために考えられた要素の正当性はありますが、このプロセスにもっと力を入れるべきだと思います。例えば、1人の開発者を育成するためのコストは約1500ドルとされていますが、25人の開発者を育成するためには合計37500ドルが必要とされています。そこでお聞きしたいのは、残りの資金をどこから捻出するのかということです。また、フォローアップやミーティング、ライセンスなどの事務的な問題にかかる費用も不明です。\r\n", "q1r": 3, "q2": "長期的なビジョンと年次計画を持っていることは評価できますが、この提案の監査可能性に関する情報が不足しています。特に、予算欄によると、トレーニングサイクルは一般的に4〜5ヶ月間であるという事実を考慮すると。年間計画の残りの月には何が起こるのでしょうか？成果物については、このコホートに25人を参加させることが重要な指標となっています。指標をよく見てみると、非常に明確に定義されているものの、それぞれに目的が示されていないため、監査可能性の観点からは評価できません。\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Developing developers in Africa is a great idea to develop blockchain and Cardano in Africa to solve current problems there. But I really haven't seen the proposal's difference in developing developers in Africa since developers in Africa can totally take Cardano courses for free. I'm a native of Southeast Asia but I can still learn Haskell and Plutus through Cardano's free courses. Meanwhile, the proposal needs funding for developers to learn. I still don't know if the purpose of developer funding is incentive money or course money.", "q0r": 2, "q1": "\"The experience of the team behind this proposal goes well with organizing events, building community, and making a website well suited to creating programs and courses. But this is a program and course for developers so I think they need someone with IT and blockchain skills.\r\n\r\nChắc sẽ thêm phần detailed plan sau\"", "q1r": 2, "q2": "\"Proposal still doesn't have a specific plan for how to attract developers to take courses, I only see the proposalr mentioning using money to teach developer courses. In my opinion, what attracts developers to develop careers with blockchain and Cardano is their own career opportunities and financial development. If the proposal focuses on telling them about these things, it would be better than just creating courses without giving them a reason why they have to become blockchain developers.\r\n\r\nBesides, the proposal also does not set a target of the number of developers who complete the course and are tested enough to be able to execute projects, it will be difficult to know if the project will be successfully implemented after being funded.\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "One of the key objectives of this challenge is to bring new developers into the Cardano ecosystem. This proposal meets this perfectly by training and supporting devs in Africa.\nThe initial cohort is visible on their website with bio's (https://www.abcdevs.com/hire-blockchain-developers). This should provide the voter with confidence that the proposer has proven capability. This proposal is to put another 24 devs through the programme.", "q0r": 5, "q1": "The people running ABCD and their role in delivering this proposal is made clear as is the role of their training parter, EMURGO.  Although LinkedIn profiles are not provided they are relatively simple to find so the claims in the proposal can be verified.\nThe costs involved are clearly set out and the course costs can be validated on the emurgo website (https://emurgo.io/education). A small overhead (c$5k) is retained for supporting devs over 5 months of training.\nA clear (multi-year) roadmap has been provided showing the ambition of this organisation.\nOverall a very transparent and honest proposal.", "q1r": 5, "q2": "The metrics have been well thought through. Not only does the proposer look at the short term metrics , ie how many developers have been training but they are also delivering additional value to the community by tracking post training activities ie employment of the devs, salaries, projects and partnerships initiated. This will allow the community to track the growth of ABCD aswell as the devs they are helping.", "q2r": 5, "assessor": "z_assessor_45", "no_vca": 20, "ne": 3, "ng": 17, "nfo": 0, "vca_o": 1}], "solution": "\nアフリカで精鋭のカルダノ開発者を育成\nアフリカで最高のカルダノソリューションプロバイダーを設立\n未来のアフリカの技術エリートを育成\n", "experience": "ジョシュアとグウェン、そしてABCDチームは、この取り組みを1年間にわたって運営し、すでに14人の有望なブロックチェーン開発者の第一次コホートを集めました。"}