{"id": 382370, "author": "huths0lo", "title": "Hive Mind cNFT Policy ID Validation", "url": "https://cardano.ideascale.com/a/dtd/382370-48088", "category": 26244, "amount": 2500, "description": "現在、cNFTポリシー検証のための重要なリソースは1つしかありません。  これがボトルネックになっていますが、簡単に修正することができます。", "funded": 0, "upvotes": 14660724, "downvotes": 20792701, "votes_result": 6131977, "votes_cast": 103, "f6_no_assessments": 5, "f6_rating": 1.5333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assess proposals in this challenge. The proposal adresses cNFT policies, which does not really have anything to do with community hubs. Thus, the solution presented does not really match the challenge. Key metrics are not presented, thus they don't metch the challenge either.\r\nWhile the proposers don't really talk about scalability, a system as described has the potential to be scalable. Feedback: Post your proposal in the correct challenge next time, e.G. for this fund it could be the Miscallaneous proposals.", "q0r": 2, "q1": "Judging from their github, the proposers seem to have worked with Cardano already. Other than that, they don't present any verifiable credentials, so it cannot be said for sure if they are up for the challenge. The proposers do not define the type and number of team members required to implement the proposal. \r\nThe budget is not outlined clearly or broken down into identifiable items, thus it is difficult to assess whether itis reasonable to achieve the set goals.\r\nThe proposal does not offer more than a very brief timetable and roadmap and now implementation plan apart from that. The resources used are not described and technical backgrounds are not explained either. Feedback: Make a detailed implementation plan, link some verifiable personal information, and break down your budget.", "q1r": 3, "q2": "No metrics, KPIs or milestones besides the very coarse-grained roadmap are presented. The problem statement however is clear. The solution could be explained in more detail in order to be auditable. Feedback: Make some detailed, comprehensible metrics and KPIs and explain your solution in a structured way.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This idea is necessary for the development of NFT industry, but this proposal is just a draft. If the team is seriously concerned about their idea and wants to be funded, they should provide much more info to show their plan. For making an impact with the challenge, the team should have some key metrics that align with the challenge given, they can refer to the tab \"about\" of the challenge, then write down some word to explain why their idea impact or bring value to Cardano ecosystem. This proposal has none of those. ", "q0r": 1, "q1": "This idea is not simple in just a few words and steps. For getting a high assessment on feasibility the team must show how good their ability on implementing the project. A detailed implementation plan with necessary activities, realistic timelines, key features, a high communication plan, effective marketing activities... is something that the team should consider and well explain to convince Catalyst community. \r\nFor more trust, the team should add some referral info like docs, articles, resources... that they already made, or ongoing. These infos when beside the team member info, will strongly affect the decision making of CA/ vCA. \r\nFor all of them, then make a detailed roadmap and breakdown detail the budget need for the plan into which activity it will be used for, in which field... that help CA/ vCA will assess whether the required budget is reasonable or not. \r\nThis proposal has non of the above. ", "q1r": 1, "q2": "Same as the previous comment, we can't audit this proposal because there is nothing. After funding, the team will have to report regularly to Catalyst their progress, hence, the team must provide a roadmap and key metrics for CA/ vCA assesses that is available to audit this project. The more detail in the roadmap the easier on audit and we love it more than a roadmap with just a few headlines without detail. Or the team can explain more about the roadmap in another part of the proposal then just summary it again. Of course, the key metrics must be fitted with the challenge given as first, if not it's failed from impact assessment. \r\nOne more thing is the team must describe how they are aware of the problem context by detailed explaining it, then detailing the solution that must address those problems. If not, it will be hard for everyone to understand what the team wants to do and is it helpful or not. This means the proposal can get a low scoring in all three-part: impact, feasibility, auditability.", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 20, "ne": 6, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The problem is within the challenge, but the proposal doesn't have basic things for assessing the impact: \r\n- Explanation about how it will add value to Cardano ecosystem, this help convince CA/ vCA and voter to easily clear the impact of the project on the ecosystem\r\n- Key metrics that align with the challenge setting, it will show how the project will affect the ecosystem by specific criteria. ", "q0r": 2, "q1": "This proposal lacks all basic things for assessing the feasibility. Include: \r\n- Detailed roadmap to help CA/ vCA know milestones and summary things to do or finish at this time. \r\n- Detail implementation plan with a detailed explanation about features, actions, activities of their plan. This will help to assess all other parts in the proposal is suitable or not. \r\n- Detailed budget that should be pointed which/ who it will be used for. Based on the plan, it will be assessed reasonable or not to be funded and help voters make decisions on voting. \r\nNot just those info only, for more trust the proposal must have: \r\n- Team info with background or ability, and which roles they are working for in this proposal\r\n- Some relevant risks and how the team will face them. To me, it helps to assess that the team has a well-preparation for their plan. \r\nAnd for getting the perfect score of feasibility, the proposal should attach some MVP, samples, evidence, resource... that the team is already done or on going doing it.", "q1r": 1, "q2": "The proposal doesn't have the basic things for auditing, including: \r\n- Roadmap with detail and realistic timeline. More detail will help Catalyst team easier on track and check the project regularly, currently, the project team has to report in biweek. \r\n- Key metrics that are clear and fittable with the plan and vision of the team, of course, must be aligned with the challenge setting. \r\nAnd 2 explanation to help Catalyst team easy understand what the proposal want to do: \r\n- Problem explanation, should be in case studies, context that the team has been aware and motivated to make the proposal.\r\n- Solution explanation, to explain detail about how the solution can help to solve the problem. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal has nothing except a poorly brief about what they want to do with their idea. It has no impact on the Cardano ecosystem because they have no info to tell that what value their project adds to the Cardano ecosystem, and key metrics to make sure that they are concerned about the challenge setting. ", "q0r": 1, "q1": "The proposer showed nothing in this proposal for assessing its feasibility. Technically, with this project, he has to show a lot of detailed info about how this project will connect and manage these communities in action, then detailed technology that use to manage those activities... \r\nThe only thing the proposer shows here is only ideas and useless for assessing the feasibility. ", "q1r": 1, "q2": "The proposer does provide not enough info that's sufficient to audit the progress and the success of this project. He has no roadmap and key metrics, that's the basic things for auditing the project. \r\nMoreover, because the content in the proposal is poorly explained about what they want only, so I can't understand in detail the problem that the team wants to solve and their solution can address it or not. Of course, there is no risk management that be included in this proposal also. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "I do not believe this proposal addresses the goal in the challenge, to build adoption and awareness.\r\nA public version of this proposal, to share trust levels of CNFT projects would surely provide benefit to the community. However, this is related to the challenge presented.\r\nI would recommend applying this challenge in a more affective category in the future.", "q0r": 2, "q1": "I am not able verify the experience provided from the proposer, and unable to find any information leading me to such a place to verify.\r\nTo the proposer: I would suggest providing items to help verify your experience. At a minimum, projects you have worked on. Or a profile of some nature.\r\nWhile the plan gives a structure of 2-3, 4-6, and beyond 6 months, there is also minimum detail on actionable items per phase.", "q1r": 2, "q2": "While the idea is a noble one, in the world of CNFTs, this proposal gives minimal detail to be able to extract meaningful metrics and measurements to help track progress over time.\r\nOne metric that could be extrapolated is how many members join the council, that would vet / provide trust levels to projects.", "q2r": 2, "assessor": "z_assessor_816", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "私の解決策は、信頼できる複数のコミュニティメンバーと協力して、コミュニティの信頼モデルを使って複数のリポジトリを作成することです。", "experience": "初期のcNFTクリエーター、カルダノ開発者、プリンシパルネットワークエンジニア、25年のIT経験者。"}