{"id": 383154, "author": "secretdecks", "title": "Catalyst Swarm & City Hub Playbooks", "url": "https://cardano.ideascale.com/a/dtd/383154-48088", "category": 26244, "amount": 45000, "description": "Catalyst Swarmは仮想空間に住んでいますが、ネットワークやExperienceを実環境に実装するためには、最初の経験が必要です。", "funded": 1, "upvotes": 37396300, "downvotes": 23264205, "votes_result": 14132095, "votes_cast": 115, "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "このプロジェクトでは、すでにバーチャルな状態にある既存のコミュニティを、最初のパイロット・コミュニティとして「現実」の世界へと導いていきます。これにより、他の都市で同様のコミュニティを展開するための青写真やプレイブックが作成されます。この提案は、比較的少ない人数でコミュニティを立ち上げるため、それ自体のインパクトは大きくないかもしれませんが、パイロットとしての役割を果たし、将来に向けた知識ベースの構築を開始するための基盤となります。チームは、プロジェクトに勢いをつけるためにも、今後の課題として新たな提案を提出する必要があるとしています。全体的には、資金の配分には賛成です。\r\n", "q0r": 5, "q1": "チームは、チームの各メンバーの資格と経験を説明していますが、各メンバーは相当な経験を持ち、Catalystコミュニティの中で評判になっています。実施計画はわかりやすく、チームが行おうとしているすべてのステップがよく理解できます。しかし、予算に関しては、構成する要素の内訳が非常に具体的に示されているものの、各項目にコストが関連付けられていません。そのため、要求された金額の正当性を正確に評価することができないのです。この提案を成功させるための潜在的なリスクに関するセクションがないにもかかわらず、チームが蓄積してきた経験から、この第一段階が成功することを確信しています。\r\n", "q1r": 4, "q2": "ロードマップの説明が非常に充実しており、3ヶ月間の構成になっていて、各月に何が行われるかの説明も充実しています。成功の基準が提案書に完全には記載されていないにもかかわらず、提案書を読んだ限りでは、主に2つの成果物、（1）ベルリンで20～30人のグループを形成すること、（2）地域コミュニティを構築するためのすべてのグッドプラクティスを集約したプレイブックを作成すること、を検出しました。\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 13, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "Catalyst swarmは成功したコンセプトであり、それを現実世界に導入することは素晴らしい効果をもたらします。Catalyst swarmの実世界での経験は、Cardanoのエコシステムに奇跡をもたらす多くの貢献をサポートすることになるでしょう。以上のような詳細な計画により、チームはこの提案に全幅の信頼を寄せています。ベルリンを主なターゲットとすることで、このスウォームがヨーロッパ中、ひいては世界中にその影響力を広げていくことができるでしょう。提案書の最後に書かれているコラボレーションの可能性により、エコシステムの新顔たちが質の高いガイダンスを得て、ネットワークへの貢献をサポートしてくれることは間違いありません。ワークショップやイベント、そして誰もが利用できるプレイブックによって、自信と才能に満ちた多くの人々がネットワークに参加するようになることは間違いありません。", "q0r": 5, "q1": "よく説明されたアクションプランと妥当な成果物があれば、この提案が成功する可能性は非常に高い。さらに、FelixやDanといったお馴染みの顔ぶれが揃っているので、チームが持つ専門性についてコミュニティはほとんど疑うことはないだろう。緻密な予算計画と実用的な資金は、この提案を完全に正当化している。また、チームが次のラウンドで追加資金を申請することを示唆していることは、チームの長期的な決意と情熱を示しています。以上のような理由から、この提案は、今回の課題の中でも注目すべきアイデアの一つであると確信しています。", "q1r": 5, "q2": "このような緻密なマニフェストを手にして、この提案に疑問を持つ人はほとんどいないだろう。監査役がプロジェクトの進捗状況を測るために使用できる明確な指標があります。プレイブックのオープンソース化、ミートアップやコミュニティでのイベントやディスカッションの継続、ネットワークトラフィックの増加、そして特にコラボレーションパートナーによる貢献などです。しかし、新規参入者の数やサービスのアクティブユーザーの数を把握するための定量的なKPIがないことで、より多くの知見が得られるかもしれません。まだ初期段階であり、人を中心とした提案であるため、このような指標を定義するのは非常に難しいことは理解できます。しかし、評価基準に関する情報をさらに充実させることで、この提案は完成度の高いものになると私は考えています。", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 19, "ne": 11, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This idea in this proposal is a good one. Creating a local community  hub in Berlin is in complete sync with the challenge problem. The proposer has properly articulated how this proposal will add value to the cardano ecosystem. In fact the local community hub will attract people with different profiles who can join the cardano community and help build the ecosystem up. The proposer has mentioned eventual additional funding in fund 8. Based on all the information provided in this proposal, it can have a pretty good impact.\r\n", "q0r": 5, "q1": "This proposal has some pretty notorious names known in the cardano  community who are part of the team. Although I would suggest to the proposer to add linkedin profiles or other resources to back his claims, I can give them a pass given that Victor corcino who is a member of the team is very credible in the cardano community, specially for those involved as CA and VCA. I would also suggest to the proposer the add a budget breakdown of the 45000 requested. The proposer planned to add a budget breakdown in fund 8, but my question is how did they calculate the actual budget. Apart from that, the proposer has provided a timetable until april 2022 with all the details and expectations. The plan is laid out with as many details about the proposal. The only thing remaining is a successful execution which is likely to happen based on the information given in this proposal.", "q1r": 5, "q2": "This project is auditable for me as there is all the information necessary to track its progress. The roadmap provided in the proposal is filled with as many details as it needs to be. The milestones are also clearly stated and the desired results are outlined as well. Metrics and KPIs are also in place. The problem has been described clearly and the solution as well. Based on this information, I think that this project will be easily auditable.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 16, "ne": 6, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "It was a pleasure to read your proposal. I think that your suggestion is not yet a bit of evidence or validation for your statements in this summary. will you be targeting individuals? like during the seminar, you just gave the main ideas in theory, but in reality, you haven't mentioned. Any problem has an idea to solve, but what I think you are What is missing is how do you prove to the community how your proposal has a strong impact on the community in the region and the world. Hope next time you will pay attention and add more.", "q0r": 2, "q1": "I believe the team makes claims without any specific evidence and documents to back up what you say in this proposal. about experience or any links to back up the experience claims. How about your strict? above all the concern is that you are requesting a capital of 45000 USD without showing us a clear funding sheet is it reasonable?. also you are missing the documents for community verification about your statements and the proposed team. You need to explain more clearly about the budget, the experience of the team clearly, the proposal will bring higher feasibility.", "q1r": 2, "q2": "The proposed team has come up with a specific roadmap in real time. But it has not provided enough information on how to use the specific capital, how much money to go to which item to implement this proposal. Whether the KPI is determined. The success of the project depends on what criteria? Hope you reply soon next time, as well as review the proposal and provide enough information and accompanying spirit to be appreciated by the community for the transparency of the proposal.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This is a very helpful proposal, it builds up a Catalyst Swarm Community in Berlin, build bridges and presence of Cardano and Berlin entrepreneurs and startups, initiatives and movements. Simultaneously releasing a Playbook, it documents the ways that proposers maintain and grow the community.", "q0r": 4, "q1": "The team includes many members with extensive experience and knowledge, but how to verify that information, it is necessary to add the personal profiles of the people involved (linked in,... ). It is also necessary to provide links to previous projects (here the proponent mentioned Eastern Town Hall, Catalyst School but did not give a specific link).\r\nThe proponent only provides a short-term roadmap (3 months), but it is analyzed in detail. It defines specifically what to do in the first 3 months.\r\nAsking for a budget of $45,000, should make it more clear what book this money was used for. I see a description of the budget allocation in the proposal, but no specific value has been provided.", "q1r": 3, "q2": "The information provided is certainly not enough, but we can still judge its success. In addition to the content I mentioned in the previous section, the proponent also needs to have a success evaluation criterion (playbook hits,...), clearly defining difficulties-challenges as well as solutions. overcome.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 19, "ne": 3, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "ベルリンでCatalyst Swarm Communityを構築することは、City Communitiesを作るためのBlueprintsやPlaybookを作成するための第一歩です。", "experience": "資金提供を受けた提案者、コミュニティ・アドバイザーとベテラン・コミュニティ・アドバイザー、提案のメンターと紹介者、チャレンジ・チームのメンバーとアンバサダー"}