{"id": 383475, "author": "twomin", "title": "2MinReview by Voice for Busy Voters", "url": "https://cardano.ideascale.com/a/dtd/383475-48088", "category": 26244, "amount": 12000, "description": "Cardanoコミュニティの発展に影響を与えるような、増え続ける提案の情報を、忙しい投票者がキャッチするのは大変なことです。", "funded": 1, "upvotes": 30215831, "downvotes": 22262799, "votes_result": 7953032, "votes_cast": 132, "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は興味深いもので、各ファンディング・ファンドのプロポーザルの25％を要約した短いビデオ／ポッドキャストを英語で作成するというものです。このようなプロジェクトの必要性についての著者の正当性は、多くのプロポーザルがあり、人々は一般的にすべてをフォローする時間がなく、このようなコンテンツのサマリーがあれば、人々はより実用的な方法でプロポーザルを知ることができるため、Catalystへの参加が促進されるだろう、というものです。少なくとも、ここで行われていることの一部です。この考えには同意しますし、非常に有益だと思います。また、新しい参加者をカルダノコミュニティに呼び込み、新しい開発者などを呼び込み、新しいハブを形成するなど、チャレンジの目的のいくつかに対応しているかもしれませんが、英語を話さない人のアクセスを民主化するという目的を考慮していないように思います。私は、そのようなコンテンツがアクセス可能になることで、ブロックチェーンの初心者から経験豊富な人まで、より一般的な英語圏の人々のCardanoへのアクセスを民主化すると思います。そのため、チャレンジで問われたことの部分的なインパクトは大きいと思います。この同じアイデアが他の言語にも適用されたら、非常に素晴らしいと思います。つまり、ポルトガル語、スペイン語、イタリア語、日本語、ベトナム語などで、資金調達ファンドの提案を要約／説明する短い視聴覚コンテンツを作成するのです。そうすれば、私たちが目指しているものが正鵠を得たものになると思います。", "q0r": 3, "q1": "このプロジェクトに参加しているチームからは、多くの安心感が伝わってきます。プロジェクトのかなりの部分を割いて、自分たちが何者であるか、名前、機能、これまでに行ってきたことを少しずつ説明し、さらに個人ページへのリンクを設けて、彼らをより深く知ることができるようになっています。メンバーのプレゼンテーションは完璧だったと思います。私にとって、これは誰が関わっているのかを説明するのに最も適した方法です。スクリプトも模範的な方法で作成されており、全体として達成すべきタスクが何であるか（非常に詳細に、ステップを理解しやすいように様々な数値データが含まれています）、また目標が何であるかが、ここでも数字を使って、達成しようとしていることを誤差なく明示しています。さらに、結論として、このプロジェクトに期待されるインパクトと実現可能性を描くことにも気を配りました。予算については、何をどれだけやるのか、どれだけの量をどれだけやるのかを表にして添付しているが、これも確立された理解と情報を完全かつ正確に提供している。", "q1r": 5, "q2": "同じ著者が説明しているように、このプロジェクトには非常に具体的な目標があり、予算は添付の表で非常に詳細に説明されており、コンテンツはyoutubeで確認でき、次の資金ですでに作業が開始されているので、監視は非常に簡単です。ですから、これからはコミュニティの側がこの監査を行う必要があると考えています。プロジェクトの進捗状況を監視し、様々なコミュニケーションチャンネル（タウンホール、ディスコードなど）を通じてコミュニティにフィードバックするメンバーを選出することができます。この提案のこの部分には、批判すべき点や採点すべき点はあまりなく、すべてが完璧だと思います。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "I believe this proposal is well suited to the objectives of the challenge. The proposal presents a very real problem that a lot of people are interested in Cardano but do not have the time to learn, making it difficult to grasp the increasing number of proposals, affecting the development of Cardano. Cardano community\r\nThe solution was to produce short-term videos and podcasts in English containing analyzed information for the proposed 25% in each Catalyst Fund. A clear and understandable solution was provided as per the proposal to clearly describe the problem targeted.", "q0r": 5, "q1": "We can easily check the group information based on the links the recommendation has provided. The proposed team consists of 3 members with experience in the Blockchain field and also accompanies Catalyst projects from Fund 4. At the same time, Duc Tiger is also the founder of Tiger View team, one of the core groups of the company. . Vietnam in the Cardano ecosystem. Besides, the team has also been funded in Fund 6, so I have full confidence that they can complete this proposal.\r\nWithout a doubt, the team of proponents has the right skill set, is highly motivated and is strongly committed to the Cardano ecosystem. With the experience of the CA and VCA teams, they easily realize the difficulty when voters have to absorb too many petitions while not having much time to evaluate them all. Take this suggestion as a matter of course. It saves voters a lot of time filtering out unworkable proposals. I believe that with the experience and planning presented here, it is very likely that this proposal will be successfully implemented\r\nInterestingly, the proposal's authors explain the idea by presenting the obstacles they will face next.", "q1r": 5, "q2": "Due to the properties of this proposal, no timeline is broken down. As stated, the proposed team will start work from the start of the Fund 8 and Fund 9 proposal. It takes about 2 months for them to complete 250 videos in Fund 8 and 2 months to complete 250 videos in Fund 9. .\r\nThe proposal is feasible because it has very specific goals, has key indicators, KPIs and timelines, and is easy to track and evaluate. The given budget of $12,000 is reasonable enough and it makes me completely agree that the team is competent enough to tackle the challenge.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 16, "ne": 4, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "I think this proposal makes a lot of sense, but not in this exact shape. Even as a CA, I find it impossible to stay up-to-date with most of the proposals in Project Catalyst. Having 2 minute videos, if properly done, would be of great benefit to the Cardano voters and community. Yet, at this iteration, I feel like the proposal could be very detrimental to the Catalyst experiment, due to the fact that it will make a selection of 250 proposals to be reviewed. That in itself is an influence on the voters and could become problematic for the entire eco-system. The only way to solve this would be to have either all proposals reviewed, or none. ", "q0r": 2, "q1": "The team’s experience confirms their aptitude towards delivering such a great task, the video for their proposal has also demonstrated the quality that we are to expect from each video. Yet what I didn’t find in their plan, is how will all those videos and articles be reviewed before publishing? Will there be a core team who will be reviewing them, will they review each other, and if so, how will they be able to verify and incentivise the quality of the videos?", "q1r": 3, "q2": "The proposal is well divided and contains all the needed information for its proper evaluation. The budget is well detailed, the KPIs are well explained, the roadmap is sound and comprehensive,  as such I can safely say that the proposal has clearly verifiable goals.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 3, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "In my opinion, the proposal is not well aligned with the challenge setting of onboarding new people and community hubs to the global Cardano ecosystem, particularly in the non-English speaking world. \n\nThat does not mean that I think this proposal will not have an impact. I think it is a good proposal, for many people the information written in Catalyst proposals is difficult to digest. Especially when voting, when a large amount of proposals should be evaluated. Having summaries in video form would be helpful. \n\nI believe this should be done with all proposals though, and not only 25% of them, as this will introduce a selection bias from the video creators. Therefore, I would prefer if they requested a larger budget so they could do this with 100% of Catalyst proposals before the voting period starts. ", "q0r": 2, "q1": "The video example provided shows that they can create a simple and easy to understand video explaining a proposal in 2 minutes. \n\nThe budget requested per video created seems low to me, which could affect the quality of the videos. For example, 2 dollars for editing per video, I don't know how feasible that is in the long term without affecting the quality.\n\nIt is good that the proposers are experienced in Catalyst, and reviewing proposals. The proposers seem committed and capable of following through on their promise to the community.", "q1r": 4, "q2": "The proposers have stated quite clearly what they will do with the funds, and how many video reviews they will create per funding round. This part of the project should be easy to assess for the community.\n\nThey have included some KPIs for watch time per video, I wish they also included some KPIs for how many viewers they hope to attract. And also elaborated further how they will make the videos accessible to more people, and let people know about them. There is little point in creating these videos if they have very few viewers.\n\nI believe it will also be difficult for the community to assess the quality of the videos, and whether they actually solve the problem of explaining proposals in a way that is easier to understand than the original proposal text.", "q2r": 3, "assessor": "z_assessor_73", "no_vca": 23, "ne": 5, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "This proposition could increase knowledge about our ecosystem alongside the perspective of wider adoption and participation, as it would make the process more inclusive. For example, people suffering from blindness would be able to be part of the community and be more involved in the decision-making process. The only flaw is that you can't do it for the majority of the good quality proposals, only a few, because there are just too many of them. This is why I can't give the perfect score !", "q0r": 4, "q1": "The team is known among the Catalyst community, they've already been funded once, during fund 6, one of them is running a stake pool [TIGER Pool] and being a community advisor for Catalyst. All of their social media channels and a Linkdn profile are set for more transparency, inspiring me confidence in the team.\n\nThe team have already made available a youtube video, as an example of their work, down the comment section: (https://www.youtube.com/watch?v=5Yagm40Wny8). The video is easy to understand and well made, but the robotic voice could be annoying for many people, including me. I kindly suggest recording them with real voices.\n\nThe budget is well detailed inside the google doc, alongside the plan. Everything looks reasonable.\n\n", "q1r": 5, "q2": "The roadmap is ok, pretty well explained, and spread over the duration of fund 8 and 9. Key metrics and KPIs are easy to track: Average view duration; New Subscribers...\nThey acknowledged some risks to the challenge, although there are not many of those.\n\nThe milestones could have been more detailed, accompanied by dates, but I'm not sure that it is essential for this kind of proposal, anyway.", "q2r": 5, "assessor": "z_assessor_146", "no_vca": 24, "ne": 3, "ng": 20, "nfo": 1, "vca_o": 1}], "solution": "各カタリスト・ファンドの25％の提案について、分析情報を含む2分程度の短い英語のビデオやポッドキャストを制作する。", "experience": "2Min Reviewのチームは、CA、vCA、コミュニティビルダー、リサーチャー、ビデオプロデューサーで構成されています。"}