{"id": 384293, "author": "larde.victor", "title": "(Close to) Free energy SPO by OST", "url": "https://cardano.ideascale.com/a/dtd/384293-48088", "category": 26245, "amount": 120000, "description": "PoSはエネルギー効率が高いですが、ゼロエネルギーではありません。   \nSPOを設置することは誰にでもできることではなく、分散化を望む人には手が届かない。", "funded": 0, "upvotes": 14616469, "downvotes": 31616506, "votes_result": 17000037, "votes_cast": 141, "f6_no_assessments": 3, "f6_rating": 1.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal offers to power SPO using a \"New Revolutionary Technology\" or NRT providing free energy.\r\nProviding free energy to SPO does not properly align with the challenge definition. The description of the problem and solution / goals does not enable a clear understanding of what is this key technology and how it could effectively impact SPO business.\r\nBased on the proposal brief, I strongly disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 1, "q1": "This proposal include a very long description of goals and solution. Unfortunately, it is all based on the existence of \"NRT : free green energy, clean water production and technology that removes toxic waste of legacy extraction operations.\"\r\nMost of the funds are supposed to be used to install a \"NRT\" valued 100k$, with no details about what it is. The proposal does not include any evidence that this tech does exist.\r\n3 team members are identified by their LinkedIN profile. None of them seem to have energy engineering experience, which I assume is needed to make free energy.\r\nBased on above, I strongly disagree that this proposal is likely to be implemented successfully.\r\n", "q1r": 1, "q2": "A broad roadmap is provided, but it is not very informative. \r\nNo details are given on how the community will be able to accurately monitor the progress of the project and the use of the 120k$ budget that is requested.\r\nI disagree that the community will be able to monitor the progress of the project if it gets funded.\r\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 18, "ne": 4, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The suggestion of the proposal, is that SPOs require power to run, and that the proposers have access to New Revolutionary Technology (NRT) that will provide free energy to SPOs, and even whole towns.  If this is meant to provide additional revenue, or reduce overhead for SPOs acting as power distribution centers, then it would indeed be a tremendous impact on Cardano, but... \r\n\r\nLook.  Can I be perfectly blunt?  New Revolutionary Technology, which provides free or \"close to free energy\", for which no description or evidence is provided, the installation costs of which total almost half of this challenge settings total budget, is a suspect claim, and that is being charitable.  As the foundation of this proposal, NRT just seems to be Not Really There.", "q0r": 1, "q1": "Without any idea of what constitutes their free energy solution for SPOs it is really hard to gauge how serious they are about any of this.  Are they referring to classic offgird systems like solar farms?  There are no specific clues, either in the proposal or their whitepaper.  They also don't seem to have much of an understanding of the technology involved in the SPOs themselves, and propose a budget for installing and operating an SPO that they found on a forum.  It is also worth noting that the whitepaper specifically mentions migrating their proposed system off of Cardano and onto their own blockchain at some point in the future, presumably transferring their Catalyst funded SPO infrastructure into a new proof of stake blockchain.  Given that they haven't included any details of the buildout of either the NRT or the SPO, it is highly unlikely that they understand all of the risks and requirements such an endeavor would involve.  The $120,000 proposed budget is barely iterated, and impossible to parse.", "q1r": 1, "q2": "Where to begin?  Is the roadmap clear or have specific milestones and their requirements?  No. Are there natural audit points presented to assess the 3 and 6 month snapshots they provided?  No.  Do all of the metrics and KPIs for success make sense?  You have to provide metrics and KPIs for them to make sense.  Will this proposal team be accountable to the community?  Here is where I offer the only piece of real advice I have for this proposal team after assessing 5 of their proposals in Fund7:  you cannot be honest with the Catalyst process, nor treat it with honor, if you are not first being honest with yourself.", "q2r": 1, "assessor": "z_assessor_811", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "I found myself looking for something much more concrete from this proposal. Having read it over twice, I'm still not exactly sure what this team is seeking to do, other than initiate new SPOs around this particular marketing strategy oriented towards some high ideals. Some of these ideals sound quite nice but from my perspective the proposer really needs to \"get down to brass tacks\" and deal with important details. How many of these communities already exist, and where precisely are they? Are they actual whole towns or much smaller communities in neighborhoods? How precisely does operating a stake pool harmonize with existing such communities? Without answers to questions like these, it's hard to see how the challenge's metrics are met.", "q0r": 1, "q1": "There's mention of concepts like \"contributionism\" and \"free energy city council\" but not much provided in the way of examples or evidence for these things in practice. This is especially true of this \"New Revolutionary Technology,\" which promises numerous public goods that I presume would be free at the point of service. But they don't explain how they accomplish this, and offer no evidence. As the Carl Sagan saying goes, \"Extraordinary claims require extraordinary evidence.\" I'd want more real-world examples. ", "q1r": 1, "q2": "The ask from this proposer is enormous, nearly half the budget for the challenge, the huge majority for which is for \"installing the NRT\" which we have insufficient details about. If I had any advice for the proposer, it would be to make this proposal more down to earth. But also to start smaller. It would be a more attractive proposal if it focused on specifically funding the stake-pool related aspects of the highly ambitious project they hope to build.", "q2r": 1, "assessor": "z_assessor_853", "no_vca": 20, "ne": 4, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "1つの小さな町が革新的な新技術にアクセスし、それぞれの町がフリーエネルギーのSPOになり、ネットワークの分散化を拡大します。", "experience": "研究者 - 科学者 - 作家 - 活動家 - 人道主義者。シニアファイナンシャルプランナー。ブロックチェーン＆暗号通貨のコーチ。ビジネスプランナー。"}