{"id": 384955, "author": "gargiulo.gianni", "title": "Beyond ISOs: SPO-driven Funding", "url": "https://cardano.ideascale.com/a/dtd/384955-48088", "category": 26245, "amount": 35300, "description": "現在のプロジェクト資金調達モデルでは、SPOがカルダノの財務およびセキュリティのバックボーンとしての役割を十分に果たせません。", "funded": 2, "upvotes": 162107576, "downvotes": 8788906, "votes_result": 153318670, "votes_cast": 726, "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=23919"], "media": [], "f6_assessments": [{"q0": "私は、FISO、ISO、ISPOから発生するステークの集中化の問題は、「良い問題」であり、Cardanoに特有のものだと考えています。ブロック作成の分散化を促進するために、定期的に稼働するプールの数を増やさざるを得ないプール飽和メカニズム（Kファクター）により、多数の「シート」が用意され、これが競争を促し、小規模なSPOの参加の可能性が他のブロックチェーンよりも具体的になります。\r\n\r\nFISO/ISO/ISPOのコンセプトを数ヶ月間テストした結果、この資金調達モデルは、プールのオーナーやデリゲーターにとって人気のある、非常に便利なツールであることが明らかになりました。このツールは重要ですが、委任者の集中化や規制上のリスクなど、それがもたらす問題もあります。本提案では、集中化の問題に取り組み、小規模なSPOやカルダノ自身の分散化のためにこのコンセプトをより持続可能なものにし、規制問題に役立つDIDsを通じた任意のKYC統合を可能にすることを意図しています。\r\n\r\nしたがって、取り組むべき問題が明確になり、提案書では、代表者とSPOの両方にとってより良いUI/UXを持つモデルを作ることを目的としたいくつかの改善を通じて、ISOの使用を活用することを目的としたモデルが説明されています。StakepadをStakeboardプラットフォームに統合することで、ISO、SPO、代表者間のコミュニケーションが向上し、マーケティング、キュレーション、フィルタリング（ISOと代表者は、異なる社会的大義を支援するSPOなど、希望する基準を満たすSPOを選択することができる）、資金調達プログラムでの協力のためのSPOの評価などが可能となり、ISOとSPOの認知度が高まり、代表者はより簡単にそれらを見つけることができるようになる。\r\n\r\n実際、プールをファンドレイジングのツールとして利用することはすでに現実となっており、それに磨きをかけることで、スポーツ振興機関にとっては経済的に持続可能なものとなり、代表者にとってはより実用的なものとなると思います。\r\n\r\n含まれている指標/KPIは、このチャレンジとカルダノのエコシステムにとっての成功とインパクトの良い指標です。", "q0r": 5, "q1": "このチームは、ソフトウェア開発、プロダクトマネジメント、ビジネスマネジメント、コミュニケーションマネジメント、ITなど、プロジェクトを遂行する上で重要な分野の専門知識を持っており、さらにPlutus Pioneers Programに参加したり、プールを運営したりしているメンバーもいます。この提案はStakeboardの一部門であり、数週間前から開発が進められていますが、資金調達の前にすでにいくつかの段階が完了しており、コミットメントと生産性を示しています。\r\n\r\n予算の内訳があります。フロントエンド＋銀行での開発作業量の割合は適切ですが、その他の項目については、UI/UX、DevOps、プロジェクト管理、マーケティングに必要な作業量が明確になっていないため、より詳細に記載する必要があります。\r\n\r\nロードマップとマイルストーンは、現実的で明確かつ客観的です。Stakepadの計画は妥当であり、実現可能性を示すのに十分な詳細が含まれている。\r\n\r\nStakestarterのコンセプトが提示されましたが、これは代替的な資金調達モデルを構築することを意図しており、オプションのMVPを作成することが意図されているように思えますが、Stakestarterがこの提案の成果物になるかどうかは明確ではありませんでした。ロードマップを見る限りではそのようには思えませんが、より明確にすることをお勧めします。", "q1r": 4, "q2": "問題点、解決策、そしてこの課題との整合性が明確になっています。\r\n\r\n記載されている指標やKPIは、パフォーマンスを監査し、提案の成功を確認するための良い指標であると思われます。\r\n\r\nロードマップやマイルストーンが明確かつ客観的であるため、成果物やパフォーマンスの確認が容易である。", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 18, "ne": 14, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Very strong and thorough assessment. And while I believe we did a strong job with the feasibility portion of the proposal, the CA's points of constructive criticism are valid points we'll consider in the future. "}, {"q0": "I am convinced that stakeboard will be a very successful platform and that the team is showing their skills and vision through the closed beta and this fund's Catalyst proposals. Stakepad will benefit from this success and potentially redefine the utility of ISO type funding for community type projects. The potential is huge. ", "q0r": 5, "q1": "The team has considered exhaustively the strengths and weaknesses of the ISO models we have seen thus far in Cardano. Their work on stakeboard shows their development talents. The roadmap for  stakepad is clearly broken down and I believe the team has all the skills and motivation necessary to achieve their goals. ", "q1r": 5, "q2": "There is a clear budget breakdown and road map for stakepad development. The given KPIs are meaningful and can be moitored from their stakeboard platform. It should be easy to judge the ROI of this project after 6 months. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 19, "ne": 3, "ng": 9, "nfo": 7, "vca_o": 1, "reply": "Succinct but helpful (and I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "There is a complete assessment of the problem statement and the current existing solutions around ISO models. In addition the scope of work is well described and thoroughly reviewed", "q0r": 5, "q1": "With several options provided and an in-depth review of the pros and cons. The team participating in this proposal illustrates strong knowledge and problem solving skills. \r\nThe scope of work or problem statement is a unique and highly in demand solution. ", "q1r": 5, "q2": "There are several key timeline and goals described. The team has laid out a detail roadmap. The key factors on the success of this project are easily quantifiable. \r\nEspecially that participating in 20 ISO. \r\nFinally the pricing or project is very conservative and seems within the appropriate needs of this project. I do think that there may be a need to increase the budget if issues arise ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "Succinct but helpful (and I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "This proposal absolutely addresses the challenge in providing a well-rounded and fair approach to making SPOs economically attractive and providing many of them more opportunities.\r\nThe main goal here is to take the existing ISO//FISO models (SundaeSwap/Minswap) and advancing the ideas and models by providing SPOs and delegators better opportunities. As well as providing everyone a central location for future ISO/FISO's.", "q0r": 5, "q1": "The team's information is public and accessible, as well as directly listed int the proposal. In reviewing that, they all show to have a diverse and solid experience portfolio. The plan has been well thought out and defined, with an extremely clear roadmap. There is a clear path laid out for the path forward.\r\nA piece of proof towards experience, is the Alice product the team already has launched.", "q1r": 5, "q2": "There is plenty of information to easily audit the goals and progress of this proposal. Within the body is a monthly roadmap as mentioned, along with KPIs that are understandable, and a cost breakdown that makes sense.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "This proposal clearly addresses the challenge, in a couple of areas, this includes:\r\nCardano scams and bad-faith players. In this particular case it is specific to SPOs.", "q0r": 5, "q1": "This team has demonstrated their capabilities in a very similar area with their 'Alice' project. I strongly believe that the team has the skills to accomplish the goals that they have outlined.", "q1r": 5, "q2": "The proposal clearly lists KPI's and timelines that are measurable. I would like to see a bit more of an explanation why Twitter impressions are a KPI when the proposal deliverable is a website (with Twitter integration).", "q2r": 4, "assessor": "z_assessor_977", "no_vca": 26, "ne": 4, "ng": 12, "nfo": 10, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}], "solution": "StakestarterとStakepad - proof-of-stakeコンセンサスに特化した新しい資金調達モデル - は、CardanoのSPO、デリゲーター、開発者により良いサービスを提供します。", "experience": "2 技術系リーダー。複数のスタートアップ企業を設立したCTO、SPO、Plutus Pioneers、Emurgo Academy\nシニアデザイナー\nビジネス開発リーダー"}