{"id": 385065, "author": "rcmorano", "title": "Grow Dandelion, Grow SPO businesses", "url": "https://cardano.ideascale.com/a/dtd/385065-48088", "category": 26245, "amount": 14400, "description": "SPOがプロのカルダノAPIのデプロイメントを行い、新たな収入源を得るためのソリューションはほとんどありません。", "funded": 2, "upvotes": 82514487, "downvotes": 19963960, "votes_result": 62550527, "votes_cast": 375, "f6_no_assessments": 7, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=27406"], "media": [], "f6_assessments": [{"q0": "Proposal is focused on increasing businesses opportunities for stake pool operators, Currently main source of rewards for SPO's are the rewards, With the implementation of this proposal it would create alternate source of revenue, doing so can attract more operators to run Cardano node. Along with this it might help developers with data for a fair price, which will increase the importance of the proposal.", "q0r": 5, "q1": "Proposer himself being a experienced devops engineer and maintaining many such tools shows enough skill and experience to implement the proposal. Given that the proposed already existing services have helped a lot projects on Cardano, it shows immense capabilities of the proposer in delivery such a solution also moving forward with maintaining such projects. Clear roadmap of the implementation of the proposal and clarity of how the proposal will be implemented, provides much for confidence in the proposal.", "q1r": 5, "q2": "Proposal has a clear roadmap about the implementation, and deliverables are mentioned clearly. Key performance indicators of the proposal align with the goals of the challenge, and the KPI's mentioned in the proposal also shows the importance of the implementation of this service to pool operators. Reasonable budget and budget breakdown provided in the proposal, community can track the progress of the proposal by the deliverables mentioned in the proposal.", "q2r": 5, "assessor": "z_assessor_208", "no_vca": 18, "ne": 4, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The tech here is quite impressive and expansive. The proposal did an excellent job detailing as well as demonstrating the impact of the Dandelion services, and that's only the stuff they know off, as they said usage \"is difficult to track.\" Not quite 5 stars from because there wasn't string emphasis and clarity on SPO incentives. The brief mention of the \"Incentivized Alpha Network\", and \"who will be rewarded with Dandelion network utility tokens whenever it reaches mainnet status\" could be have expanded upon. As the challenge aims to create \"business models\" and \"optional new services,\"  it is implied that proposal would aim to create sources of revenues for SPO.  The Dandelion API is currently free yes? Is a plan to move to a paid model? Perhaps paid tiers? The proposal does not make this clear. \"\r\n\r\nThe proposal's description of the use of the Dandelion network utility tokens to \"open\" up new ways to generate revenue or attract delegation to their stakepools, for example, by selling these utility tokens to third-parties (developers, projects) directly or via liquidity pools or by air-dropping these tokens\", doesn't quite meet the mark for clarity.", "q0r": 4, "q1": "The team running the current network is very qualified. Moreover, they already have a working sytems as well as a cohort of excellent SPOs testing the next generation of the sytems. There's ample description of technical details and execution plan. There's no doubt in my mind that if this proposal is funded they will not surpass the mark.", "q1r": 5, "q2": "The roadmap and budget breakdown provide ample metrics for auditing the return on intention. The proposal list of Key features provides plenty of binary yes or no metrics to check after the outline 6 months timeline. ie, can we access cardano-hasura via the new network? yes or no!.", "q2r": 5, "assessor": "z_assessor_336", "no_vca": 17, "ne": 4, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Keeping up and running the type of service described in the proposal is necessary for the ecosystem to function.  Moreover, it is already a running service, therefore, with respect to proof of concept it is something they already have covered.  \r\n\r\nAs clear as water, as clear as if it were carved in stone, the proposers must ensure:\r\n-permanent updating of the service (content and access).\r\n-No charge or restriction whatsoever for access to everything the service has to offer.", "q0r": 4, "q1": "- Please provide more external information about the team members.  Their academic background and experience. \r\n- Please provide more information on the activities outlined in the Budget and Roadmap section.  Your explanation is very general.\r\n- Please describe what kind of possible obstacles you see in the implementation of the proposal and what back-up plan you have to solve them.", "q1r": 3, "q2": "Very general KPIs.  Please develop KPIs that can be measurement tools. ", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "Dandelion hopes to become a decentralized network of operators offering cardano APIs and being compenstated with the dandelion token.  SPOs are not only well equipped to run such nodes but can derive benefit from the APIs themselves. This is a win-win for SPOs. ", "q0r": 5, "q1": "The dandelion community service is already live and being used by some projects. The lead dev is highly motivated to keep the system running and up to date, so that the ecosystem can continue to grow.  The requested funding should be sufficient to accomplish these goals. ", "q1r": 5, "q2": "The goal of the proposal is mainly to keep the community service running and up to date. KPIs include API statistics (requests/uptime). It should be easy to judge the ROI and growth of the dandelion community service in 6 months time. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 18, "ne": 3, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The team proposes a new income model for spo's to deploy cardano API solutions. This will provide extra income for small SPO's and provide a needed oracle services for the community. This fully aligns with the challenge of  providing new business models for SPO's, and a new needed service for the ecosystem by using SPO's there is no real limit to scalability.", "q0r": 5, "q1": "The developer  has 15 years of experience, Ex-Emurgo DevOps Lead. Gimbalabs Co-Founder. They have also been serving our ecosystem for close to 1 year now, helping developers to prototype and bootstrap new projects, they will be hiring one developer  to take care of the maintenance of the deployments and the updates to the OpenSource project . The budget will be used for Infrastructure costs to maintain the current 3 locations and the employment of one sytem ops / dev.", "q1r": 5, "q2": "The team is expanding on work that is already ongoing.  The projects that they will be providing these services to will do the auditing. We can measure success by the number of requests per month and number of new operators joining the network and number of new projects onboarded.\r\n", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement is well defined and addresses the challenge accurately. The goals  to continue their community services towards SPOs are well aligned within the challenge.", "q0r": 5, "q1": "Gimba Labs and dandelion are well known and respected for their work within the ecosystem and directly fo the community. The funds requested are reasonable and clearly broken down therefore I strongly agree the the feasibility of the project.", "q1r": 5, "q2": "The roadmap is very clearly defined and the KPIs expressed are useful metrics. It would be nice to see figures attached to the KPIs however to get a projected impact that can be measured against ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "To help to provide extra extra revenue streams in cardona, with using tatement :\r\nThere are few-to-none solutions for SPOs to do professional Cardano API deployments that can help,\r\nThis proposal effectively addresses the challenge.", "q0r": 5, "q1": "By providing our community service, which will provide SPOs with an option to be rewarded and to bootstrap new API hosting businessess,\r\nThere experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has given experience in DevOps advocate with over 15 years of experience. Ex-Emurgo DevOps Lead. Gimbalabs Co-Founder. Dandelion Founder and Operator. Has provided enough details on funds usage,\r\nProvided information provided is sufficient to audit the progress and the success of the proposal. information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 34, "ne": 3, "ng": 18, "nfo": 13, "vca_o": 1}], "solution": "私たちは、コミュニティサービスを維持することを提案します。これは、SPOに報酬を与え、新しいAPIホスティングビジネスを立ち上げるためのオプションを提供するものです。", "experience": "15年以上の経験を持つDevOpsの提唱者。元Emurgo社のDevOpsリーダー。Gimbalabsの共同設立者。Dandelionの設立者兼運営者。"}