{"id": 385124, "author": "adalywallet", "title": "Staking Pool as a Service", "url": "https://cardano.ideascale.com/a/dtd/385124-48088", "category": 26245, "amount": 17000, "description": "Setting up a staking pool is demanding. Even by doing everything by the book, you still need extensive knowledge and careful management.", "funded": 1, "upvotes": 59468404, "downvotes": 24753869, "votes_result": 34714535, "votes_cast": 317, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Stake pool offerings as a service as a service is a novel business idea since it provides a helping hand to those who don't have the technical expertise to set up a staking pool, but might want to set one up. Many businesses in the future will require a business such as Adaly.io if they want to provide a staking pool offering of their own, in this way it addresses the challenge of providing a decent offering in this space. \r\n\r\nIt does appear that in order to scale the project correctly in terms of a user base they need to have a strategy for engaging more with the Cardano community and other parts of the eco system. If this is done correctly then it will have a greater impact as a new stake pool offering. Several possible clients are outlined which is good, such as Youtubers, Cardano fans and Crypto whales. The audience for this offering appears to be quite niche and is not aiming to to target small to medium businesses which would have a greater real world impact. The campaign brief identifies that  high value is driven by hype in the Crypto space and the challenge wants to improve credibility and avoid hype, the target audiences in the proposal align with a hype mentality. The proposal would be improved if it outlined or had also thought of a a way to partner with a small / medium sized business to set up the stake pool offering it could hit the ground running and provide greater stability and professionalism once it is released. ", "q0r": 3, "q1": "The team has had 21 years of experience and already offers DevOps as a service. It's clear that the team have a good understanding of what's needed to provide a stake pool as a service offering, since it'll need to be highly scaleble and use Devo's services, such as Ansible scripting and reliable scaling with Kubernetes. No doubt this wealth of experience in this field will contribute to a successful implementation. \r\n\r\nThe plan outline shows how cash will be spent an how this is attributed to development workload, it is good that the team have thought this through and will improve chances of success for this. However the plan would be clearer if there were shorter milestones indicated. The definition of success has been outlined as a functional service being launched before 6 months, outlining the steps and in which order they need to be completed in a roadmap would make this clearer.  ", "q1r": 4, "q2": "It appears that the auditing of the product will be based upon the adoption of the possible clients identified or trialing the product upon its release which will be announced on Twitter which only has 1071 followers as it stands. Given that the last tweet was on the 21st of October it would be more beneficial to boost the profile and regularity of the Tweets if this is going to be the primary announcement channel. The auditing clarity of proposal could be better achieved by lining up a user base or trial program ahead of time to verify how well it performs. \r\n\r\nThe system could be trialed by a user on the released product to validated and audited to see if the results of the proposal is successful. ", "q2r": 3, "assessor": "z_assessor_332", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "An intriguing way to popularize the ability to run a stake pool. An excellent idea to extend adoption from ADA holders to delegators and delegating voters. This project can really impact on the community. Takes the tech almost out of the process of creating and managing a stakepool. Brilliant idea! Anticipated client base is broad and reasonable. \r\n\r\n\"Possible clients\r\n\"Popular YouTuber\"\r\nHas no time nor technical expertise to run a staking pool. Can easily promote the staking pool.\r\n\r\n\"Cardano fan\"\r\nHas no time nor technical expertise to run a staking pool. Has many friends willing to stake.\r\n\r\n\"Existing SPO (stake pool operator)\"\r\nHas the technical expertise, but might need more cost-effective solution or more free time.\r\n\r\n\"Crypto whale\"\r\nHas the funds to stake, can have his own staking pools.\"", "q0r": 5, "q1": "This team bases their technical approach on Kubernetes infrastructure. Their website reveals they have been working in the Kubernetes space for a long time. \r\n\r\n\"In its study of usage data from thousands of companies and more than 1.5 billion containers, the company found \"roughly 45% of Datadog customers running containers use Kubernetes, whether in self-managed clusters or through a cloud service.\"\r\n\r\n\"What's more telling though is that almost half of all Datadog container users have already turned to Kubernetes. \"\r\n\r\n\"Datadog also found that Kubernetes is very popular on the public cloud. In particular, managed Kubernetes services such as Google Kubernetes Engine (GKE) dominates the Google Cloud Platform (GCP). Since Kubernetes ancestry goes back to Google that comes as no surprise. \" Their approach seems excellent.", "q1r": 5, "q2": "The milestones are objective, clear and auditable. KPI's are straight forward. Both in work items and quality of performance.\r\n\r\n'KPIs\r\n- Website is up and running.\r\n- New pool deploys within 5-minute window.\r\n- A calculator can be used to estimate rewards and expenses.\r\n- Order form has been integrated with a wallet.\"", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "This project fits perfectly with the challenge it was submitted under, by creating a service with a template, it opens up the space (SPO) for people who are not as tech savvy or don't have the time, but still want to participate in running a SPO.   ", "q0r": 5, "q1": "After reading there roadmap and watching the video they provided, I'd say they're going to have a successful prototype up and going within the time they've stated. The only other thing I would've like to see, is who the team consists of and what each team member brings to the table, but I'm still rating this with 5 stars because of all the other items they've shown.", "q1r": 5, "q2": "I'm giving this area 5 stars as well, because a working website where a SPO can be created will be easy to follow and audit. I did notice a interesting comment about keeping their clients, or future clients in the loop with relevant news (MELD, SundaeSwap, ect).  ", "q2r": 5, "assessor": "z_assessor_418", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This proposal offers a great way to scale up Cardano decentralization, especially for non-technical users to join the movement by having their own stake pool. As the technicality portion of the Cardano blockchain becomes more complex, there must be a friendly way for common users to know how the stake pool works and how to contribute to the network from this role. And, this project can leverage Cardano DID technologies later in creating the stake pool.   ", "q0r": 5, "q1": "The budget plan and time frame are well planned from the technical side, but it doesn't have a concrete marketing plan. Using Adaly Twitter account only is not enough to engage with the community. Team members should be more active in the Cardano community to introduce the service. In terms of the proposer's background, they are a legit team with a legit business focused on dev ops services.  The success likelihood is very high with their expertise, but to give a broader impact on the Cardano ecosystem, they need a dedicated team to run this. ", "q1r": 4, "q2": "The audit aspect is not mentioned clearly in the proposal. There's no placeholder created either on the websites. Communities can only wait their Twitter announcement or manually check their website for any updates. ", "q2r": 3, "assessor": "z_assessor_647", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "As an active member of the Cardano community on Twitter, Discord, Telegram and YouTube I read lot of post that are looking for this type of service. Reaching out in the community for help with little to no replies. The proposer has effectively addressed the problem and offered an approach for all levels of SPO. This service is long past due with a viable process to grow the community and be a self sufficient business with a 1% share of Stake Pool rewards. The need for more SPO's is going to fill the demand for blocks and nodes once DeFi and Dex,s come online. There is much congestion on the block when cNFT drops occur. While waiting for IOHK to develop new solutions to the network this would be one way to grow the eco system and maybe help offset the congestion that does occur from time to time.", "q0r": 5, "q1": "The alignment between the proposer and utilizing devops.io to accelerate and meet time line and effectively automate the SPO system has the ability to implement the service indicated. My experience with business is many fail due the fact that many solo-prenuers ask the question how but not who. The proposer has effectively stated who can create and manage the process, and has done so for many other businesses. The front end expenses seem rather low for this type of project. So i wonder how much time and money the proposer currently has invested in this project out of pocket. Will the service fees from cloud service use be sustainable if there are no knew SPO's onboarded immediately. What will be the process of recruiting new SPOs to utilize service and grow ecosystem. This project outlines a clear path to success of meeting goals and viabilities. ", "q1r": 5, "q2": "The proposer has many measurable KPI's that will show Catalyst project will be able to demonstrate progression from preliminary idea to a scalable self sufficient service. The risk would be in outsourcing the project to a company that could not integrate with Cardano network.  Other than internal emails will there be a numerical way to measure the progress of development of the service? Overall i feel that this is one of the more needed services that can benefit all in the Cardano ecosystem.  With a website up and running the proposer will be able to measure new unique visitors and check for conversions to customers. There is many KPI's that can be used to measure the success of this project once it is up and running. ", "q2r": 5, "assessor": "z_assessor_954", "no_vca": 26, "ne": 12, "ng": 14, "nfo": 0, "vca_o": 1}], "solution": "We will offer a staking pool as a service, allowing community members to grow the Cardano ecosystem by running their own staking pool.", "experience": "Our DevOps engineers have 21+ years of experience automating various cloud infrastructure and application deployment flows."}