{"id": 382417, "author": "indigolabs", "title": "Cardano Multi-DEX SDK", "url": "https://cardano.ideascale.com/a/dtd/382417-48088", "category": 26233, "amount": 21900, "description": "開発者は、Cardano DEXとシームレスに連携するために、オープンソースのSDKが必要になります。", "funded": 2, "upvotes": 291551864, "downvotes": 1528877, "votes_result": 290022987, "votes_cast": 1650, "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=13275"], "media": [], "f6_assessments": [{"q0": "Proposal identifies the problem of developers needing an opensource SDK to interface with Cardano Dexs in a seamless manner. They mention a few possibilities that could be built using their SDK and how it will boost Cardano's Defi ecosystem. The goals of the proposal are aligned with the challenge as they will boost activity and interoperability on Dexs. Porposal is able to  scale well as it is open source and can be used by anyone in the community.", "q0r": 5, "q1": "Relevant experience and team has been provided with proof via linkedIn and github pages of previous work. Budget will go to  one single developer. They don't seek funds for themselves, just the one extra developer they need. 9 weeks to complete the project seems realistic. They explain the different stages in their development process and also state what is being built, like documentation, interfaces and models. They know what is needed to build this and even mention the type of testing they need to do. This project will be a typescript SDK that other developers can use for their projects. They don't mention any risks or challenges, but they added 2 extra weeks to development for the unexpected.", "q1r": 5, "q2": "Roadmap of 7 weeks with clear milestones have been provided. They have 4 measurable KPIs. One more KPI that comes to mind is how many people use your SDK and even how many commits or pull requests you get at certain points in time. The more KPIs you ad the easier it is to measure performance and progress of your project. It is clear that they want to solve the problem of an easy way for a developer to integrate their project with all the DEXs on Cardano. They solve this by building an open source SDK for developers to use. If implemented successfully this comes with a lot of extra benefits for the ecosystem as well as the developers. Like bot creation for arbitration that in turn again results in price stability between the DEXs.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 26, "ne": 13, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge. The proposal excellently identifies a problem within the challenge which needs to be solved and provides a solution for it that will add quite some value to the Cardano ecosystem, especially by increasing accessibility with an open source concept. The key metrics and goals of the proposal align with the outlined challenge settings really well and show the proposer has understood the challenge.\r\n The proposal is not just able to scale to address future challenges, it actually increases scalability in the whole area.", "q0r": 5, "q1": "The proposers are well-known in the Catalyst community and are competent and up to the task. They have already successfully delivered to other proposals and have shown that they are trustworthy and their proposals are deliverable. This shows without a doubt that they know, in an identifiable manner, the type and number of team members required to implement the proposal.\r\nThe budget is simple and reasonable to achieve the set goals.No plans regarding the need for additional funding are indicated, but since the organisation already has some other projects and thus most likely also liquidity, that should not be a problem.\r\nThe proposal offers a realistic and detailed timetable to complete the work.\r\nThe proposal provides a well-made plan for implementation that shows what exactly is being done and how.\r\n The plan describes the necessary resources as well as the technical aspects well, which shows the proposers have a good grasp of the subject. The only thing that might be improved is discussing the challenges that might occur with implementation. But still a very good job with that proposal.", "q1r": 5, "q2": "All the criteria are fulfilled very well. Milestones and metrics are explained in a clear and comprehensive manner, and the problem and solution statements are clear and auditable.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 9, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "For the next stage of application development on Cardano network, this Multi-DEX SDK is essential. Especially to NFT games, most of them need to build their own DEX for supporting their game. So I think this SDK development will help a lot to Cardano ecosystem. \r\nMoreover, the proposal also includes key metrics that super align with the challenge settings, and by those key metrics, I believe that this is a must-have project to help fasten scaling up the ecosystems. ", "q0r": 5, "q1": "The proposer showed us very clearly about what this project will be developed in 9 weeks, in addition, they also attach a functional web-app demo to visualize what will it become after that 9 weeks. More than that, from their team profiles and referral resource I believe that they can do this project easily. \r\nOne thing I am just concerned about is how they can reach and take some first partners because they have a key metric about that. ", "q1r": 5, "q2": "This proposal shows a very detailed roadmap to finish the project, moreover, their goals and key metrics also be very clear that can help Catalyst community audit the project in the future. \r\nAbout their explanation of the problem and their solution, I think it is very clear and easy to understand. Seem like this project is not a big deal with the team so I think that's reason why proposer don't put any risk in the proposal. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 14, "ne": 3, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "The proposal seeks to launch a typescript SDK that allows developers to interact with Cardano's DEXs, thus boosting the Cardano Defi ecosystem. The proposers want to fund an experienced web developer to build an open source SDK that can be used to build DEX interfaces seamlessly into any web/mobile application. The goal is clearly stated in the proposal that they want to allow developers seamless access to all DEX integrations and cross-pollination of Defi protocols on the Cardano blockchain. This addresses the challenge effectively.", "q0r": 4, "q1": "The team has experienced experts with haskell devs, web dev(Plutus) top Plutus repositary contributors, tech consultants who will be able to implement the proposal successfully. The detailed plan mentioned indigo protocol will utilize the SDK to implement depositing/withdrawing from liquidity pools from within the trading interface. Also mentioned that DEX aggregators source liquidity from different DEXs and thus offer users better token swap rates than they could get on any single DEX, among others. The detailed plan allows for successful implementation.", "q1r": 4, "q2": "The time line details a weekly planned tasks which make up 9 weeks of development. This helps auditing to be effective. The budget breakdown is understandable, that is, USD $90 per hour and can be audited effectively. Good proposal recommended.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Yes it does. We live in a mobile world. Providing SDK's that can be deployed by others is nothing short of amazing. ", "q0r": 5, "q1": "There is a demo that has been created already. This provides leverage in a way other proposals might not possess. Also the experience from the proposers is relevant to this project. It will be interesting to see what the project brings. ", "q1r": 5, "q2": "The information provided is sufficient. The mere fact of a product already in the works, it's going to create a space for confidence in the people following the projects. ", "q2r": 5, "assessor": "z_assessor_700", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "The proposal to submit a multi-DEX SDK is effectively addressing the challenge to boost Cardano DeFi.", "q0r": 5, "q1": "The team behind this proposal is building a Plutus DeFi protocol and has been successful in previous catalyst rounds. The team is highly experienced in building Cardano DeFi solutions and present a complete project plan to build a Typescript SDK to access multiple DEXs.", "q1r": 5, "q2": "The information provided in the proposal plan is sufficient to audit the progress. The team has built in the open since early 2022 and gone through previous catalyst rounds successfully. ", "q2r": 5, "assessor": "z_assessor_910", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "インディゴ・ラボは、開発者がCardano DEXと対話できるようなTypescript SDKを開発し、Cardano DeFiのエコシステムを後押ししていきます。", "experience": "Haskell開発者3名、Web開発者1名（Plutus経験者）、マーケティング担当者1名、技術コンサルタント2名のチーム。Plutusリポジトリへの貢献者トップ20。"}