{"id": 384557, "author": "travisjohn", "title": "Mint Home Equity as NFT", "url": "https://cardano.ideascale.com/a/dtd/384557-48088", "category": 26233, "amount": 25000, "description": "多くの住宅所有者は、未利用のエクイティを暗号化したいと考えていますが、その選択肢は限られています。", "funded": 0, "upvotes": 19884380, "downvotes": 22566973, "votes_result": 2682593, "votes_cast": 311, "f6_no_assessments": 5, "f6_rating": 2.8666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is well suited for this category as utilizing cardano NFTs to turn your home into a liquid investment vehicle. It remains unclear how the legal aspects of the custody of the ownership will work exactly, but pending some clarity on the orcale to be used, this could still be very promising.", "q0r": 4, "q1": "It looks like the team has done their research into KYC/Fraud protection and have presented a very compelling proposal but what I see lacking is a clear roadmap which makes it a little more difficult to make a clear judgement on whether the proposal will be successful or not. \r\n\r\nI still believe the team will successfully reach their goal of recording a lien and minting it as an NFT and for that reason I think 4 stars is appropriate for this proposal.", "q1r": 4, "q2": "I think what hurts this proposal the most is the lack of a roadmap with clear milestones and broken down into specific KPIs for each milestone on the roadmap. Generally that makes it very easy to audit successfully, even if we know the high-level goals of the proposal it makes it could go a long way.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This is a tool that helps mint NFT quite useful for the community. The proposal is presented in a concise, informative manner, with a clear plan. You should be able to channel official information, and outreach strategies how to help the community better access this tool.", "q0r": 4, "q1": "Working team has relevant experience. The proposal presents just enough content, clearly. The team has a clear plan. So I think this is a very viable proposition. However, it is necessary to limit the time according to more detailed stages to have clear and detailed KPIs in the short term, so it will be more effective.", "q1r": 3, "q2": "For NFT mint related projects it is quite easy to check through project website aggregators or gitbub code. However, in this proposal, it is not specified whether the website or github actually represents this project. Therefore, it will be a bit difficult in the process of verifying the quality of the deployed project.", "q2r": 3, "assessor": "z_assessor_652", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This project will help millions of homeowners around the world join and help DeFi grow faster. As the team wants to develop a system to help them mint home equity as an NFT collateralized the value onto the blockchain, the team has a detailed vision about what they gonna do. Moreover, as they explain, this project will boost Cardano's Defi a lot by adding more than a billion-dollar total value stocked in a short amount of time. \r\nUnfortunately, the team doesn't add any key metrics into the proposal to show that they're really concerned about what the challenge address.", "q0r": 2, "q1": "It's a big project that has a big vision with inspired numbers but the team doesn't have any detailed implementation plan for it. The thing they only have here is the technical info and economic of their native token CASA. All of them are not enough for assessing the feasibility of their proposal. \r\nMy recommendation for them to have a basic element for CA/ vCA assessing is a detailed plan that has summaries of how they will develop it, which features will be used, the way they make it public, or marketing activities... and some goals/ KPIs or key metrics will help Catalyst community can assess their idea. \r\n", "q1r": 1, "q2": "As I commented, lacking a roadmap and key metrics can't help to audit this project. \r\nMoreover, the team should consider the problem context and shows how much they can get it. It will help to measure how their solution can address that problem. Only providing features and technical solutions without understanding the problem is not good. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly addresses the challenge, aims to boost the DeFi and Oraculos market in cardano.\r\nThe proponent, although he expresses having extensive experience in technology and real estate, does not provide any type of information to contrast, for example, sharing his Linkedin or his website. If the proposal is materialized, the impact on the carding network would be significant.", "q0r": 4, "q1": "The plan presented should be more detailed, with short, medium and long term objectives and deadlines. The requested resources do not detail their destination, of the $ 25,000 how much would it be for legal advice, how much for investigation? Is there a team with Travis? ... if the resources were insufficient? I think the idea is super interesting but you need to improve your roadmap. And provide more references and links.", "q1r": 3, "q2": "I don't see a way to audit Travis's project, although the idea is great, with a good work plan, the right equipment, and a detailed, auditable work plan you have a good chance of success. Although I am concerned about the legal question, does the jurisdiction recognize the smart contract as valid? Because in some jurisdictions you could trade the smart contract in the crypto market and the mortgage in another market, what fraud prevention mechanisms do you plan to use?\r\nGreetings", "q2r": 2, "assessor": "z_assessor_743", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Edited (I had the wrong Campaign Brief up when I first assessed.)\r\n\r\nThis proposal has the potential to reach each person on every street, and that's very attractive.  I think the comments are illustrative of the technical and legal hurdles to be met, and such a big project will require funding from quite a number of sources.  I wish this were more specific as to which particular challenges will be met with the funding, but the key metrics of the campaign are very broad and so I'd expect proposals with similar scope, such as this to receive some funding to help move them forward. ", "q0r": 4, "q1": "It's difficult to tell whether the project itself can succeed based on this proposal.  If it succeeds, it will likely be with or without this funding.", "q1r": 3, "q2": "There are no metrics listed against which to audit progress.", "q2r": 2, "assessor": "z_assessor_975", "no_vca": 27, "ne": 1, "ng": 16, "nfo": 10, "vca_o": 1}], "solution": "ホームエクイティをNFTとして鋳造することで、その価値がブロックチェーンに担保され、DeFiの広い世界が開かれます。", "experience": "私は、技術に精通した起業家であり、カルダノのSPOであり、ローンオフィサーやタイトル＆エスクロー会社のオーナーとしての経験を持つ現役の不動産ブローカーです。"}