{"id": 413962, "author": "headelf", "title": "C4S - Cardano for Seniors Hub", "url": "https://cardano.ideascale.com/a/dtd/413962-48088", "category": 26595, "amount": 50000, "description": "You know, live with or are a Senior. How does Cardano attract, educate and onboard a 2 billion niche demographic, rich with talent & liquid assets, that spans all human parameters while doing good?", "f6_no_assessments": 12, "f6_rating": 4.250000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 1589, "q0": "The proposal is extremely interesting and addresses a very relevant subject. It is undeniable how the cryptographic universe is aimed at a younger audience, who understand or are interested in technology, investments, decentralization, etc. All of these concepts may seem predatory to an older audience. As the proponents claim, the elderly function differently, they learn and absorb knowledge in a different way, which is not necessarily inferior, but which requires a new approach. The project then aims to be able to welcome this audience, through various chats on the Clubhouse platform. These chats would be carried out using a methodology specially studied for the elderly public to learn about concepts of our ecosystem, so that they can fit into our community: either through Catalyst or even integrating teams from different projects (after all, the elderly are experienced professionals). It is very positive as the proponents have already been financed before, which indicates that they already have a good direction and understand what needs to be done and how, so that their objectives are achieved. They, for example, have already researched and found that the most used media by the elderly is facebook, so it is there that they intend to carry out a marketing campaign to attract new elderly people to the project. It is also positive that the chats that will be developed will have different focuses, from what I understand there will also be expansions to Spanish and Italian, which indicates that the project is trying to become as diverse as possible. I believe that the proposal is of high value and fits well with the objectives of the challenge, as it is focused on developing an interface that will bring a very valuable audience to Cardano; both in the sense of having a lot of knowledge, accumulated over the years, and in terms of the fact that the elderly generally have a considerable financial reserve, which would increase the liquidity of our ecosystem (which is necessary for it to remain stable, as the proponents point out). ). This audience will likely create digital wallets, delegate Ada, participate in pools, engage with Dapps (as they are introduced to the cryptographic universe), which will popularize Cardano, as is sought in this challenge. The public is also vast in terms of quantity: proponents point out that research has raised a figure of 2 billion elderly people in the world, a figure that will double in a few years. In other words, I totally agree that this proposal will generate a considerable and necessary impact for Cardano, and I believe that we need to make blockchain accessible to all types of audiences, including the elderly. In my view, the 3 main KPIs of the challenge summary would be met, because something that is already happening would be being continued and would give an opportunity for the emergence of new projects, these KPIs being: “increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community”.", "q0r": 5, "q1": "Talking about the roadmap, some parts are already being done (since the proposal has already been funded previously), while others are yet to start. The time is divided into quarters and what would happen in each of them is detailed, as we can see from the excerpt: “”Q4 2022: 1. Initiate targeted SM ads to attract and 'funnel' Seniors to the ''Cardano4Seniors” YouTube channel , the Cardano4Seniors.org website and the Cardano4Seniors Clubhouse + 2. Just prior to advertisements begin the moderators will begin their hourly 'Clubhouse social hours' to begin traction”. My suggestion for making the script even more suitable is that the division be made respecting a more specific timeline, for example, monthly. A series of activities will be developed in the fourth quarter of the year; but what specifically would happen in October? And in November, December? The level of detail of the actions is satisfactory, so for the degree of total adequacy to be increased, my only suggestion would be this, to divide the temporality and into shorter intervals. The requested financial amount is 50 thousand dollars; it is a considerable amount, but it is reasonably explained in the scope of feasibility: “Approximately 60% of the budget is for live talent to prepare and host the live chats. The other 40% is for marketing on Social Media to attract and funnel the target market to the chat rooms (…). Budget is $30 per hour for script writing and segment support; $40 per hour for Clubhouse moderators and $60 per hour for professional moderators e.g. the RN moderator. 1.5 hours are budgeted per hour segment, the extra half hour for preparation. No travel is included as the hosting is planned to be remote”. We understand that the money is distributed mainly to pay who would be carrying out the live chats and also for marketing. The script writing time value; of the working hours of moderators (professionals and amateurs) is established. I believe that for us to understand even better how the money would be used, perhaps the proponents could have detailed how the moderators would work and how paid advertising on social networks works. After all, not all readers work with the internet and understand what this type of marketing is like; and regarding the moderators' work, that was also kind of open, because we know that they will promote live debate, but what kind of work would they do before and after these sessions, for example? It would be very beneficial if these details were understood. When talking about the team, trust is automatically established in the team once they have been previously funded. However, in my view, people could have been presented in a little more detail, with more complete CVs. For example, in relation to Mark H., it is said that he worked as a chef and likes to communicate a lot: but what kind of relationship does he have with the Cardano ecosystem? Regarding Dianne, the same doubt is raised, as well as by Tom. I believe it would be important for everyone here to have a trajectory within our community that is more brought into question. In general, the proposal is viable, we have explanations about everything that is necessary, even if in a basic way. A little more detail, in my view, would raise the bar on this topic of analysis.", "q1r": 4, "q2": "Regarding the monitoring of the steps, the proponents raise several very useful KPIs regarding engagement: “We will be able to self-audit engagement, post sharing, clicks, click through, share, views and so much more. Their reports should provide a detailed ROI report on our Senior Community engagement + The team will also measure YouTube metrics. These will be based on viewers, likes and shares +”Website metrics will be measured. We will look at hits, click through, landing page hits and downloads”, etc. For example, we know that we can track whether the marketing part is being successful based on metrics provided by social media (since paid advertising would be doing). In the case of facebook specifically, the proponents point out how detailed reports on engagement would be provided. The relationship between engagement and the entry of new elderly members into the project would be the final measure, which would indicate whether what is being done is paying off, if the expected results are actually being achieved. However, it is necessary that an analysis is also made focused on the elderly, that is, would they actually be following the project? Were they learning the teachings passed in the chat sessions, at the expected pace? How can we measure the learning process? Another question would be: how can we analyze the work to be developed behind the scenes of these meetings? That is, the work routine of the team members; How will the script be followed up? What I noticed in relation to the auditability of the process is that the proponents focus a lot on the issue of social networks, but there are still other aspects of the project that need to be understood and monitored as well. Talking about the end results, he is defined as terms “community of seniors participating and lending their wisdom and years of experience to the Catalyst platform”, as well as “a large number of Lace and other wallets filled with Senior Investments, with them receiving a return fair bet for your old age” and also the success of the chat hours on the Clubhouse platform, like the elderly being educated about the cryptographic world and feeling welcomed in its context. Unfortunately, in my view, these definitions of success are still superficial. A more specific study would need to be developed. How would the elderly who participated in the project be active in the community? What paths did you trace through the ecosystem, after the chats? How can we prove the effects of this project for Cardano? In my view, it would be important that these data were also collected, analyzed and verified, and that the answers to such questions were made explicit to the Cardano community, whether through written reports, participation in Townhall and so on. I believe that auditability is the topic that left the most to be desired in the proposal, although it is good, it needs some improvements.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2047, "q0": "The target audience of this proposal is 2 billion elderly people around the world. This proposal wants to attract and train this group of people on our Blockchain. Because seniors don't adapt quickly to technology and learn differently. Cardano needs to start designing and building Dapps specifically for the needs of this vast niche. However, we need to establish the infrastructure to engage, educate and refer Seniors using tools that match their learning and socializing styles. The solution is Clubhouse, an interactive verbal social media platform that will be used with YouTube to host Age-friendly educational \"chat rooms\". This is a great way to engage seniors, especially those who are retired. The Cardano for Seniors Hub is a continuation and expansion of the C4S Community Platform sponsored in F8 to begin the development of an ELI65 language-based YouTube and education approach. The plan forward of this proposal is that C4S will initiate and moderate some hourly chats in the Seniors Clubhouse Platform for a safe place to join or just listen. The problem and solution are clear and fit the strategic scope of the challenge: Prepare a group of people willing and able to contribute to the ecosystem", "q0r": 5, "q1": "In terms of roadmap, we are presented with what will happen each quarter (from Q4/2022 to Q2-2023), and some of the activities listed. The quarter's activities are well presented. But it would be better if they split these tasks into months. What will happen each month, explain more about each activity, and who will be in charge of those activities? All we know here is what will happen, not how. The requested budget is $50,000 and is explained in great detail, we know exactly what the money will be used for. And finally, about the team, this part can also be described in more detail. We know who will be in charge of what works and know their experience, each person has a different field of activity. Besides that, the group also said that they are looking for someone who claims to be LGBTQBT and is an excellent communicator. It would be better to suggest attaching some personal links of members participating in this project such as Facebook. That gives us more real-life examples of their past experiences.", "q1r": 4, "q2": "Auditing is an essential part of assessing the success of a project. With this proposal, the proponent provided metrics and KPIs that were easy to measure and test. Audit Data is divided into three levels:\n1. Spend on Social Media (SM) Ads to Start to Engage with This Project 2. Spend Talent on Clubhouse Social Engagement\n3. Engagement and referral metrics.\nAt each level, proponents also outline ways they can easily track the project's progress. However, to increase the transparency and suitability of the project, I hope they will add an audit report plan to the project and the proponents need to better establish how the Cardano community can access this information.\nThe success of the project is also clearly defined\n-A community of Seniors join and lend their wisdom and years of experience to the Catalyst platform\n-Success looks like a large number of Lace wallets and others, integrated by Premium Investments, receive a fair stake for their money\nSuccess is having regular Club hours with Seniors around the globe, and teaching them about Risk Management in Cryptocurrencies.\nOverall, I think their proposal will effectively tackle the challenge.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3593, "q0": "In this Fund 9 I saw an article similar to the subject of the elderly-oriented proposal.\nFrom the bottom of my heart I thanked the idea of ​​the proposal. You will help the elderly to continue to work so that they feel more loving life, not being considered unhelpful to society.\nThe challenge is how to integrate them into the blockchain community with confusing terms, operations that can be too complicated for the elderly, change their thinking about blockchain.\nThe solution was: continue to develop the Fund8-funded proposal to begin developing our ELI65 language-based YouTube and education approach.\nIn the future, when the birth rate decreases, the opposite will be the aging population rate, which means the number of elderly people will increase.\nWhen society is increasingly developed, people have longer life expectancy, more durable health, so many elderly people even reach retirement age, but they still have the need to contribute brain health to society.\nWith the goal of educating them to participate in blockchain, specifically the Cardano ecosystem, will popularize and increase the value of Cardano in the elderly community. Developing C4S-Cardano4Seniors into a center for the elderly with a full range of topics related to the elderly.\nThe biggest risk proposed is not continuing to receive support in this Fund.\nI am very interested and support the project", "q0r": 5, "q1": "I saw a detailed budget breakdown for each job, giving 60% to the staff who organized the live chat sessions, the remaining 40% for marketing, advertising and scripting.\nThe work plan table is very detailed and specific, each milestone.\nThis is a continuation of the project funded in Fund 8, the timeline of Q1, 2, 3/2022 is the time to complete the project and prepare to put it into testing. Q4/2022 started running ads to attract elderly audiences to the project and experience the project.\nThe project extends the time to Q1, 2/2023, this timeline is the official project activity, feedback and number of interactive participation in the project of the elderly provided that the project continues to call successful capital in this Fund and the following fund.\nWhat I like very much about this project is the fact that the working team is all elderly, the same thinkers, the age of health will make an impression and confidence. This is a great advantage to attract older people.", "q1r": 5, "q2": "here are 3 levels to measure project progress: spend on advertising on fb, spend on staff involved in the project, and interaction metrics.\nOn level 1, detailed public reports will demonstrate the transparency of the project.\nLevel 3 interactions, the number of visits will be checked on the promotional video running on fb.\nLevel 2: detailed work report and confirmation of the team leader.\nThe most obvious measurement is the quality of the script's content and the response of the elderly, which will show that the effort, money and brainpower of the team spent is well compensated.\nThis is also considered a success of the project.\nMore elderly people will join the Cardano community, bringing many benefits to themselves in real life.\nWish the project will continue to successfully raise capital at this fund", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4511, "q0": "This proposal may deliver a decent impact by bringing a new group of participants to the Cardano ecosystem.  The proposer provided some metrics regarding the size of the potential untapped population of seniors globally., which is helpful to gauge the potential value-added of this initiative. I would suggest the proposer segment seniors by language, location, professions, or some other criteria so that the proposer could provide (1) more specific metrics of impact and (2) a clearer approach to scale the effort. At this current stage, although it is a very nice initiative, it is unclear to me what the expected value-added would be, i.e., if we should expect seniors to be aware of Cardano and blockchain in general? Should we expect seniors to build and conduct activities on Cardano? How would we know if their awareness or interest in Cardano would be sticky? I would love to have more clarity on this front.\n", "q0r": 4, "q1": "The team seems to have relevant experience and was funded in the previous fund for the same family of ideas. The proposal lists a reasonable timeline and realistic budget. What I would want to see is some go-to-market strategy, like which country/language / demographic the team would reach out to/address first. Seniors of different cultures and demographics may have very different behaviors and habits, just require a different approach in terms of attention acquisition. It sounds to me that the team cares a lot about the LGQBT seniors, and it'd be nice to see a focused proposal for this group before they expand. I would also suggest the proposer dive deeper into the risk and mitigation segment. The risk that \"the proposal is not funded\" is not very helpful to assess the feasibility of the project itself. I would expect to see more implementation risks. For example, seniors could be more susceptible to cyber risk and crypto scams, how would they go about mitigations.\n", "q1r": 4, "q2": "The auditability of this aspect is not clear to me. The proposer suggested three key metrics track the project's progress, two of them are social media ad spending and the cost for host on social media. While these metrics are helpful to see the disbursement of the funds, they are not highly relevant to the deliverables and results of the projects. I would recommend the team replace those two metrics with metrics that gauge the success of their social media campaign, such as the number of audiences, the number of questions asked, the acquisition cost per onboarded senior, etc.,\n", "q2r": 2, "assessor": "z_assessor_2558", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7455, "q0": "I think this is an absolutely brilliant approach to helping onboard a demographic that would normally be really tough to penetrate. You are bridging a gap that could potentially bring a very valuable resource in seniors with lifetime experience in life and decision making. I believe one of the main reasons Cardano is so mature is because we have people from the older generations here. Some of the most brilliant minds are quickly becoming pro-cardano, and want to build with us. To have the older generation to add their wealth of knowledge to that pool would be game changing in my opinion. I think you guys should continue being funded, and maybe even more so for the future, so we can see this program become a worldwide type of thing. The more people we educate, the better off our community will be as a whole. Giving you kudos for this idea!", "q0r": 5, "q1": "The fact you guys are already funded and have metrics shown that you are growing, I think you are on the road to success with this community. I want to see you continue to build and grow through funding in catalyst. Maybe expanding out would be a worthy next-fund goal for your team. Try reaching out to some more professionals in the community and see if they would be willing to run shows with your brand attached, and maybe even volunteer some time for you up to that point. You have a demographic targeted that truly should be tapped into, since I am not aware of any other chain that is attempting to do the same right now. We must start reaching outside of the box if we truly want to create decentralization, and power of the people. This very start of this is through education, and I really appreciate what you guys do for this ecosystem. Thank you.", "q1r": 5, "q2": "As a community ambassador for the project Chain Lobby, I think you are leaving the value of social media untapped for spreading your word far and wide. Facebook, tiktok, twitter, anywhere you think you could find your demographic and spread your idea to the public to help target said demographic. You have a very positive movement already gaining traction, you should follow through and grow your community in other ways too. You are reporting and showing positive success in your plans and goals up to this point, so I believe continued funding is warranted. Remember, if people do not know about it, they can't help you achieve your goals! Best of luck to you guys as a project!", "q2r": 5, "assessor": "z_assessor_2895", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9282, "q0": "With many of the advantages of seniors like you mentioned is that seniors have control over large amounts of wealth. Four Billion Seniors is definitely a market that can bring huge liquidity to Cardano or any other Ecosystem. This is in line with the SDGs and also with the goals indicated by the challenge your proposal indicates. I think if C4S is successful, Cardano's knowledge will be widely disseminated as the project serves as one of its premise which is to translate documents into several languages. In this way, we see a very positive impact on the Cardano ecosystem. In fact, the material that will be used I think will need to be easy to understand to be appropriate for seniors and I agree with you guys using social media as Facebook because I find that the seniors around I most people use facebook the most and most fluent. This will help you have initial advertising and interaction, as well as an effective Elderly attraction channel. The project also has a good creative feature, as most blockchain education projects focus on a younger audience, and many projects focus on students and neglect the elderly audience ( subjects are stable and have good economic status).", "q0r": 5, "q1": "Given YOUR CAPABILITY, I found the steps presented in the plan feasible, we found that the steps involved a very reasonable timeline. If you have a proposal to develop the ELI65 language , you should explain it there.\nIn terms of budget details, we found a clear explanation of the hours used in each period and the total cost of each period, even allowing for per-period cost information. hours. I really find your part very detailed and transparent.\nWith experienced members, I believe the viability of the project will be high. We suggest that if you expand, there are other talented individuals who speak several languages ​​including Spanish, Dutch and Italian. You can expand other talented seniors in Asian countries to expand the development environment. \"", "q1r": 4, "q2": "\"I noticed that specified ways to track the development of a project, using tools like reports should provide a detailed ROI report on your Senior Community engagement. But it would also be nice to present some goals to better understand how the project is performing in terms of adoption and visibility.\nIn addition, I think the progress of the project is also measured by the assessment of the knowledge, the translations that the seniors have access to, the positive feedback from the seniors. You can add a survey so you can test or measure whether seniors' participation is working.\"", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9465, "q0": "For an imbalance of rhetoric related to positive features and marketing strategies over an explanation of what will be done and how, I rank this section a 3. This section needs to be much more concise as it overwhelms the actual actions of what this proposal is aiming to accomplish, in favor of why seniors in Cardano would be a good thing. I think there’s a lot of good and important marketing research in that but I don’t actually get a comprehensive clear idea of what voters will be voting on until the feasibility section. What I gather is that this proposal is basically a marketing campaign to consolidate a community and connect with seniors through the Social media platform Clubhouse. I think this is a relatively well though plan by funneling seniors into a newer but easy to use social media platform where they can direct senior attention to other created resources (as outlined by C4S other 3 Catalyst Fund 9 proposals). While I’m relatively optimistic about the strategy here, there are some key risks in getting seniors to independently adopt a new social media platform that they are not familiar with in order to secure that attention. However, the market research about senior population and accumulated wealth provides a potentially high reward. This proposal is pretty forward thinking in the attempt to secure generational wealth into the Cardano ecosystem but I’m neutral on how effective it might be. ", "q0r": 3, "q1": "For efficiency in spending, a clear roadmap/marketing strategy, and establishing projected estimations of success, I rank this section a 4. Some voters may have a problem with a lack of verifiable information about any core team members because it prevents voter capability to judge the reliability of the team to deliver. Since they’ve been funded before, I assume they’ve been delivering on past approved proposals with periodic progress reports that are required to continue receiving funding. I think the spending is efficient AND demonstrates results that points to a successful outreach campaign, that will (hopefully) funnel senior communities into resources that are designed specifically for them. I think this roadmap shows promise to generate attention, encourage retention, and empower with education. I think it’s a smart strategy and I vote favorably on it. ", "q1r": 4, "q2": "As an outreach/advertising campaign, the only metrics for success here are social media engagement and Clubhouse community adoption, so I rank this section a 4 for hitting all those points. I do think there was a missed opportunity here to layout specific milestones that could be reached through this campaign for each social media platform. The previous section did cite 750k+ engagements in an unspecified timeframe. More of that specificity would’ve looked really good for voters to demonstrate that there is a targetable definition of success that this team is looking for. I vote positively but see a lot of room for major improvements that could secure more positive voter reaction. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10095, "q0": "The project aims to solve the problem that Seniors (over 50 years old) are now over 2 billion people and aim to 4 billion people in the next 10 years, these are talented generations and hold many assets. However, they have limitations with the technology and access to Cardano is very limited. This is the potential field that can join and make a great contribution to the Cardano ecosystem that we need to aim for.\nThis project fulfills Cardano's goal in Fund 9 to prepare a pool of people willing and able to contribute to the Cardano ecosystem, while also meeting the requirements of the challenge of Dapps, Products & Integrations when available. ability to attract a huge number of potential users.\nThe product of the project is Building Cardano4Seniors channels on YouTube, Website Cardano4Seniors.org and Cardano4Seniors Clubhouse. C4S's communication channels are built on Youtube, Website and Clubhouse platforms, showing the diversity of the project and focusing on the most popular and popular platforms today. I think it will be very successful in attracting significant numbers of seniors. These people they will have more time to learn and interact with the system.\nThe project is built to attract users who are mainly seniors over the age of 50, regardless of country or gender, any profession, but focus on what seniors are interested in and love.\nThe project aligns with SDG's 3 sustainability goals including number 4, 10 and 11. This is one of the important goals that Cardano aims to achieve.", "q0r": 5, "q1": "The project will build a community platform to engage, guide and encourage Seniors to join Cardano, and perform socially active activities using the Social Media Clubhouse\nThe project person has presented plans to expand into Spanish, Italian and other languages ​​but it is not clear what languages ​​​​are, need to be specific. As far as I know Japan is a very strong Cardano country and has a very high number of elderly population, they are also very eager to learn and have a lot of knowledge, and have a great need for conversation and exchange. If it can be expanded to Japanese, it will attract a large number of participants. I also welcome the inclusion of the LGBT community in a project that shows diversity and doesn't discriminate. This will make the project more successful and beautiful in user reviews.\nThe potential risks were wrote in great detail. Regarding the author's targeted promotion channel mainly via Facebook and the Cardano4Seniors YouTube program that can appeal to the majority of seniors, the project person may consider adding promotional channels such as broadcast television advertising, or run ads on Facebook - a very effective and unexpected advertising method that most people have to see because the number of users on Youtube is very large.\nThere are 3 key members in the project and are assigned the main responsibility in each area. However, there is very little information about the 3 members and there is no reliable contact information to exchange. The author should add more information about members to make it more transparent and reliable. In addition, the project needs to be assigned who is the main responsible person for the entire project and monitor the overall progress, if classified by item as it is currently.", "q1r": 4, "q2": "The project gives a detailed budget project, the total project for 5 projects is 337,000 USD, which is quite a large number. However, they are reasonably explained for each expenditure item. The project has not seen any mention of the token release and when it may be released\nThe project has not yet clarified whether there is any revenue from users. However, I believe that with the great influence of the project's communication channels, we can earn more from advertising when the number of participants reaches an impressive number.\nThe project has also clearly planned the project implementation plan by quarters starting from Q2/2022 to Q1/2023 with very specific and detailed work contents in each quarter. I believe that with careful preparation of the team and detailed planning, the project will achieve its original goals and even exceed expectations.\nThe success of the project is shown through the section. However, since I have not seen specific numbers, especially how many subscribers are expected to attract, viewing and joining new clubs is an important criterion to evaluate the success of the project.", "q2r": 4, "assessor": "z_assessor_3153", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13742, "q0": "C4S is referring to a part of the world, retired elderly people have free time, have certain knowledge and experiences in life. The creation of Clubhouse, an interactive verbal social media platform using Youtube, was a great idea when \"chat rooms\" were created, which were an opportunity to exchange and update information from different worlds. The elderly system has a lot of knowledge, which is an ideal learning environment. This makes a significant contribution to the Cardano ecosystem, creating a sustainable education ecosystem, providing a resource of experienced knowledge in life. This proposal is followed by C4S's proposal working at F8 (https://cardano.ideascale.com/c/idea/396845) making for a perfect project of seniors participating in Cardano. The proposal in accordance with the challenge setting stated that creating a social network for the elderly to participate is a necessary job, attracting idle resources and trained knowledge. It is proposed to divide into different career-related groups, the appropriate language for each group creates a way to expand the scope of activities, the appropriate exchange of knowledge. Fear of not receiving funding for the proposal is one of the risks C4S mentions this could affect the development of C4S's platform, the implementation of the proposal may be difficult due to the number of elderly people participating in the project. Insufficient engagement and engagement will affect the success of the proposal. The risk reduction is reasonable when C4S has had positive studies on the social network use habits of the elderly, from these data it is suggested that it can completely affect through advertising. Report SM to attract participants.\nRating: 5", "q0r": 5, "q1": "C4S has a Wedsite that showcases what they are doing on Defi, Cryptocurrency and Cardano seniors education platform, they have a certain success shown at F8. Team members do not have specific information, certificates about what they are doing, but their experience in practice and previous work shows us the ability to suit this proposal. The implementation plan of the proposal is clearly assigned to each team member, The Proposal looking for an LGBTQBT who is an excellent communicator will be implemented in the plan. With current human resources sufficient for the successful implementation of the proposal. As phase 2 of the project, this proposal provides us with a realistic timetable for logical completion of the work. Work is completed in 3 quarters of the year, the right amount of work to complete. Starting with SM ads that will be effective in attracting seniors to the ''Cardano4Seniors'' Youtube channel and C4S Wedsite. Already the first tests were done in Q4 2022, this is a sign. Positives of the proposal The proposed budget table is reasonable with 60% of the budget allocated for preparation and organization, the remaining 40% for marketing to attract the audience.$500,000 is enough for implementation, I believe it is reasonable for the money to be spent seeing the expenditures outlined in detail and very clearly.\nRating: 4", "q1r": 4, "q2": "C4S has come up with a detailed plan as well as important timelines to complete the work, which can clearly audit the results achieved. Metrics/KPIs that can be measured through C4S's Fackbook, YouTube, Wedsite, the number of SM news ads, the number of participants, professional talks, etc. are all trackable and auditable. Clubhouse is fully audited according to statistics, user interactions and reports.\n- Check the progress of the implementation of the project proposal. Looking forward to the success of the proposal we will see a large number of Lace wallets and others, which are covered by Premium Investments, Clubs, talks of the elderly. I would like C4S to show us how many participants there will be when the proposal is successful, how many groups will be made? I agree the proposal can be audited transparently.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3777", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14412, "q0": "The proposed solution made it clear that the elderly are the target customers and the way they attract the senior is by building a social hub to connect the elderly and also prepare them to adapt to new technologies such as cryptocurrencies. To be more convincing, they also gave some information about the potential of this target. For example, the number of old people in the next 10 years may reach 4 billion, the project can reach some rare targets such as LGBTQ seniors, many old people are wealthy so attracting them here will be advantageous to the Cardano ecosystem. They also highlighted that the important ambition of this project is to make a platform that engages and teaches the old to use technologies such as cryptocurrencies. In my opinion, this suits the object that the challenge is looking for. Also, the way they expressed their ideals was very convincing and they provided good facts to support their claims. Risks are clearly explained. They point out the problems with the trust of the seniors, the lack of data and algorithms. The solution they provide to solve each problem is viable. Using Facebook which has many premium users to advertise is a reasonable solution to reach this group of users.\nOverall, I like the clear, specific writing way of this proposal. I believe it will bring more users to the Cardano ecosystem, which is the object of this challenge.", "q0r": 5, "q1": "The roadmap is provided with enough detail. It has a clear date and time and a list of specific tasks to be performed at that time. For example, marketing activities on Youtube will start in Q4-2022 and last for 26 weeks. The proponent also includes tasks that were done in 2021 (previous challenge) to remind the reader of what was accomplished, and what this project will do next.\nThe budgets are provided transparently. It is divided into 2 parts, 60% for hosting live shows and 40% for social media advertising. Any specific costs associated with the project are listed very carefully. For example, $30 per hour to script for 5 sessions, 1.5 hours per session, for a total of 26 weeks, etc.\nThe background and relevant experience of each member who will work on the project are listed in full. In my opinion, these people are qualified for the project. Each member has decades of working experience. For example, Mark, host of Coffee Hour, has over 20 years as a Chef, and Diane, the host of Nurse Talk, has 45 years of nursing experience. But I still feel a bit lacking in the work experience of the two writers and planners, @tkolomi and Kevin. I think the part they are responsible for is also important for this project. And if their information is mentioned, the proposal would be better. In summary, I think this section is well prepared and has clear details.", "q1r": 5, "q2": "The project management methodology provided for this project was sufficient. They use the reporting data, and statistical functions of the social media platforms they use to track clicks, posts, shares, and more, to evaluate ROI. All other weekly reporting and administrative tasks are used online sheets for easy, transparent, and convenient inspection by others. And finally, they also mentioned the issue of tracking the growing number of user members. To me, I think their method of asking for voluntary input of user members' data is understandable in today's technological capabilities.\nThe picture of success is depicted for the reader that if the senior community participates in the Cardano ecosystem through this project, it will be a powerful catalyst to benefit the system. For example, elderly people can use their wisdom, years of experience, or charity money (because as the proponent mentioned some elderly people can be rich), etc. to support the Cardano community. In general, the presentation, and information content of this section have been provided clearly and concisely.", "q2r": 5, "assessor": "z_assessor_4045", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14439, "q0": "Seniors are usually left behind in the technological era due to the prejudice of their senility and back-forwardness. However, this project aims to make seniors their target audience; in particular, seniors with high quality life that ensures knowledge, experience and resources to boost the relevance of Cardano. As the old population tends to increase rapidly, this approach helps expand Cardano’s demography and cater for what could be the dominant population years to come. Targeting seniors - the population most likely to shy away from the new technology of blockchain - could be a great move for promotion and increase in brand awareness. The proposers manage to utilize other social platforms such as Facebook, Youtube for promotion which is reasonable as these are the most popular platforms to seniors.                                                                               However, there are several points that the proposers should clarify. The objective of C4S is to create a safe space that could “attract, educate and onboard” seniors, so there are parts of this proposal that are a bit convoluted regarding these three aspects. Firstly, how are traditional promotions with paid ads on Facebook/Youtube made to attract seniors that are experts, legal professionals, educators.. (by eye-catching visuals/by exciting features of C4S/concept/…?). Secondly, the proposers have also identified how seniors prefer platforms that are easier to adopt such as Facebook compared to Zoom, Telegram and apply this finding to create C4S clubhouse. Operation on Clubhouse claims to be simple (with only listen and talk) for higher utilization rate. However, this explanation still lacks conviction as Facebook (accounts, posts, newsfeed, share, livestream, groups,...) is more complex than Zoom (which only includes listening and talking). Then, what features could the proposers emphasize on Clubhouse so it could win over Zoom or Google Meet? Thirdly, the proposers should elaborate how chatrooms in Clubhouse could “funnel seniors into Cardano community” (the project Catalyst) and encourage them to take charge of other positions in the Cardano ecosystem (proposal assessment, mentor, governance). The topics provided in chatrooms (Sex after 60, Cooking on a Senior Budget, Activism, LGBT, …) are not clearly related to the education of technology and Risk Management of Cardano ecosystem. Therefore, how will these chatrooms with topics that may be found on Youtube, Google and other social media onboard seniors to Cardano? Finally, how will this C4S clubhouse affect other age groups/demography/the community in their attitudes about Cardano? Do the proposers have any consideration for the viral effect that may pass on from seniors to younger age groups?Regarding the main risks and mitigation, they are detailed and well-explained. Overall, the proposal does align with the problem.", "q0r": 3, "q1": "Regarding the timeline, it is detailed with clear timestamps and figures. There are clear objectives of what needs to be done throughout the timeline until 2023 with projected figures and time plans that are broken down into weeks. The budget breakdown is detailed and transparent, with 60% for live talents to host the chat and 40% for marketing. This is reasonable as both the hosts and marketing play equally important roles that determine the success of the project. The budget for these two areas is then broken down into each position (moderators/scriptwriting/…) and ads on Facebook/Pinterest/Instagram, with 75% of marketing budget will go to Facebook ads considering its popularity among seniors. But then, to increase feasibility, the proposers should elaborate with market research and figures about why they choose to promote on Pinterest and Instagram (which are heavily based on images and visuals and seemingly more popular among the youth instead of Youtube, Twitter…. For more transparency, the amount of 459 for miscellaneous purposes could be more specific about which areas will this money go to (technical problems, additional fees, overtime,...). The workforces that will organize and participate in the live chats are listed with names and specialization. However, it should be clearly stated whether the hosts (Mark, Dianne, Tom) are trained about Cardano and more information about their ability to convey this knowledge about Cardano in a relevant way in their live chats. It is assuring that the team includes seniors who speak Spanish, Dutch, Italian as this could actualize the aim to expand the chats to other non-English languages. However, the identity of the people working on these projects should be made clearer via their emails, full name, social media, channels for credentials and feasibility. The proposers manage to explain their need to return for further funding with a view to achieving self-sustainability. The team members also have experience due to previous rounds of proposals.", "q1r": 4, "q2": "This proposal has good auditability that is based on social media engagements which could clearly be provided by the media itself in the form of percentages/figures/peak time,.. This helps to manage data and assess the virality of the ads. Facebook and Youtube metrics are transparent and anyone could check the number of likes, shares, comments to assess its reception. The talents are also well-managed by time sheet, working in tandem with scriptwriter and team leader. The proposal also specifies there will be an external audit. Success will be based on the growth of Clubhouse, which is perceivable, therefore viable. SDG ratings are positive and well-aligned with what the proposal aims to achieve. In contrast, the KPI still needs to be worked on as the indices lack quantifiable data.", "q2r": 4, "assessor": "z_assessor_4055", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14909, "q0": "Firstly, I highly appreciate the proposer realizing the potential of the senior class in the Crypto platform (control of a great amount of wealth, the demographic of the first global environmental movement) and their disadvantage due to age (LGQBT, no support from children). Since then, they have set the goal of “set up the infrastructure to attract, educate and onboard Seniors using tools suitable to their style of learning and socializing” to create positive values in social aspects well-aligned to challenge settings and promise to enhance the quality of human resources contributing to the Cardano ecosystem. In the background of the C4S-Cardano4Seniors proposal in F8, the proposer would rather establish a Social Media Clubhouse with typical functions and activities (ex: a platform for seniors to have a safe place to participate or just listen) – a not new strategy but targets unexploited potential audiences. Besides, to bring the clubhouse closer to the target audiences and benefit for Cardano ecosystem, the proposer chose FB and Youtube as their priority tools in the marketing process base on notable study cases to increase the persuasion of their choice. However, although some of the advantages of Clubhouse have been mentioned (little distractions, new skills to learn), it would be better to explain why seniors will choose a new platform without many users and ratings in numerous other relevant social media (strength points) as well as more clearly state direct effects on target audiences and their reactions. Moreover, the positive impacts on the Cardano ecosystem are being described in a general way, so there should be more specific metrics to actualize them. Two challenges that the proposal mentions (not receiving funding for this continuation proposal, being insufficient traction with our target audience to achieve sufficient onboarding, and the beginning without a Prospect and Suspect list) are outlined briefly, but the second one is only based on their observations and references from Consensus 2022, so might not be reliable. SM solutions are analyzed thoroughly and aligned to the limitations and challenges that their team is facing. However, if robo-phone & email “marketing” approaches are considered “not trusted by Seniors”, might Clubhouse's dense appearance on social media platforms cause some negative effects? Therefore, I suppose that the proposer should have a marketing plan with appropriate frequency for the effective development strategy.", "q0r": 3, "q1": "The proposal has provided a long-term plan (2021-2023) with a clear timeline and quarterly breakdown. Furthermore, predicted achievements are shown on milestones, but personally, it would be better if the proposer could set an exact month-to-month timeline due to numerous goals in each quarter. The budget has been listed in detail, but the proposer can provide a predictive time for each product (ex: how much time/people does a script writing need) and make it closer to the roadmap. The project's HR are seniors with rich experience in several fields, profoundly understanding target audiences to attract them to participate and confide in diverse topics. In addition, the desire to employ seniors speaking different languages will boost the accessibility of seniors to expand their market. However, the team still does not have basic skills requirements for the employees whom they are looking for. Moreover, I realized that although the goal is to establish a large communication platform, the team still does not have staff in website design, and development... to operate it effectively.", "q1r": 4, "q2": "The proposer's team anticipated in detail tools to track and evaluate the project’s development across three areas (Social Media, talents, engagement and Onboarding metrics). However, I wonder if those documents are accessible to the entire community of the Cardano ecosystem or only the internal team. Moreover, the proposal still is short of metrics/KPIs (such as the number of users and traffic, time requirement of some vital milestones) and detailed goal criteria when it is now a bit general and theoretical without specific end-products to confirm actual development of the project. Consequently, the proposer’s team might provide some expected products/evidence at particular milestones to help our community gain a better overview of the project.", "q2r": 3, "assessor": "z_assessor_4110", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Seniors do not adapt quickly to technology and learn differently. Clubhouse, an interactive verbal social media platform will be used with YouTube to host Senior friendly educational “chat rooms” .", "experience": "This is phase II of C4S f8 funding. Our team experience, previously documented includes work with Seniors in the Risk Management, Insurance, Tax and Investment fields. Also, hosting a weekly radio call in show and Technology and Research experience. Combined team has +150 years."}