{"id": 413942, "author": "henokp50", "title": "Startup Launchpad & Crowdfunding", "url": "https://cardano.ideascale.com/a/dtd/413942-48088", "category": 26595, "amount": 55000, "description": "ICOs are a common way of funding projects in the blockchain industry. However, Africa is missing this opportunity due to the absence of a crowdfunding platform that focuses on Africa-based startups.", "f6_no_assessments": 15, "f6_rating": 4.022222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 4666, "q0": "The suggestion in question is to create an optimized Crowdfunding system. This way of fundraising has become quite popular in recent years, having been responsible for launching several successful projects, such as the game Knights of Hollow, which became a huge success. But it is also a fact that clearer and more trackable ways can be established to observe the progress of projects on these platforms. And so we see here that the project is very insightful in proposing the use of Cardano technologies, such as smart contracts, to promote a more equitable way to realize capital distribution. We see that the success of the project will bring more visibility for good ideas that need Crowdfunding, as well as more visibility with Cardano. The amount requested is consistent with the current state of the project and the planned steps to be taken. It is proposed to try to create a Crowdfunding platform with built KPIs (Key Performance Indicators) through mediation/conflict resolution and reputation credit rating algorithms to enhance the credibility of all users. Participation. I find the ideas very interesting and can add value to the Cardano ecosystem. The proposal also has a solid plan+ for how they will deliver on those ambitions through clear milestones and a roadmap. The team also offers potential risks from the marketing to the legal aspects. However, with thorough planning, the team I'm sure they can sort those challenges out. You wrote this part in detail, and it helped me to understand your proposed solution a lot. In addition, you also give me a closer look at your background when implementing real-life examples of how your DAPP will work, corresponding to each stage of development. Your target users are also clearly mentioned, and they seem to be very diverse, which will likely increase your chances of attracting Cardano farmers. Your key metrics seem to match the requirements of the test. Challenging, but I think you can put a lot of words into this to successfully convince yourself how your project can handle the challenge.", "q0r": 4, "q1": "The organization of the possible phases of the project is very well done, and we have found that the signs of several implementations are consistent with the innovation the project aims to deliver. For example, using an algorithm to check a contractor's reputation is a great idea and certainly one of the concepts that increase the viability of a project. Another very positive point is the gradual release of funds through a mediator, who will also be rewarded in the future. This has mitigated the problem existing in other existing platforms, which can often raise the necessary funds, but with no guarantees of continuity. We found that the proposal was able to make good use of blockchain advantages to creating a fairer process through decentralization. One of the biggest differences will be the complete harmonization between the requested budget ($10,000) and what is desired to be accomplished at that time, in addition to clearly defining the actions to be taken. do at different times this and the following year. We see that this money is being distributed well to implement the project in schools in the pilot phase. And in the budget breakdown, we can see that a significant amount of capital ($4,000) will be revealed, which makes a lot of sense at the early stages of implementation and validation. With this strategy, we realize that before the platform is effectively rolled out to a broader range, some risks will be mitigated and adjustments made. Regarding the project team, we found that the professionals involved were experienced in development (a fundamental attribute for this project) but also in marketing and project management. We also noticed that Gabriele's GitHub address was made available. The proposal has a clear roadmap and milestones, including phase one, phase two, and phase three. The team provides budget information and sound analysis of how they will use the proposed budget. However, I find the budget to be very small, especially in terms of development costing only 1k/year per backend and frontend, are those enough remuneration? Are there any server costs? I have a concern there will be an unexpected cost in addition to writing one of the proposals.\nTeams provide brief information about each team member's background. However, it would be better if they also provide a personal LinkedIn profile or GitHub account so that the community can easily verify the capabilities that a team member has.\n\nFirst and foremost, the work plan you provide in this proposal is very clear. The three stages of your project's progress are clearly laid out with adequate timeframes for reaching the milestones. Specifically, you attach every goal to a certain month, which is the period in which it will be achieved.\n\nSecond, your budget breakdown is kind of transparent and sticks to the plan for the first and second phases. However, there is one point on this list I can figure out, the marketing fee. The cost allocation list includes two marketing fees, shown in the third and last sentences. I wonder how it can be two charges for the same strategy? Please elaborate more on this so all voters can understand how your requested funds will be consumed throughout.\nMy final concern in this section is the details of your team members. According to your workgroup's written recommendation, I'm not sure it's detailed enough to convince the community that your team is qualified to develop the project. As some of your employees have had a few years of experience working in their primary occupation (namely 2+ and 3+), it would be better if you could describe more about their outstanding qualifications, background, and background. Related background and notable achievements for the purpose of proving they're eligible to help this project grow more. The same goes for the other members. In particular, it would be the best bet if you could show the community their LinkedIn profile to demonstrate everything you've covered in this section.\n", "q1r": 4, "q2": "Regarding the established ways to audit project progress, one of the positives is the division of tasks into phases 1 and 2. This facilitates understanding of the achievement of each. Stage.\nWe even found that the numerical parameters that were set help in monitoring this, in this case, the number of students registered in stages 1 and 2. Also, one of the ways to understand the success The goal of the project is to seek feedback on the Usability of the platform, and in this context, we observe that videos are being produced to teach how to use the platform. It will also be interesting to periodically publish results on how intuitive the platform is for students.\n\nThe team understands very well what the ultimate goal of the platform should be, based on the ideas exposed about the perceived success of the platform. We found this to be a very realistic proposition and that it seemed to have a good chance of succeeding, partly because of its organization.\n\nThe metrics/KPIs for measuring success are concise and well defined as the number of students enrolled in Phase 1 and Phase 2. However, some items could be more elaborate; for example, how much learning material in video format will be produced? Or is there a measurable way to determine a participant's knowledge after using the platform? How many project discussions on society does it take to be considered successful (and what constitutes discussion)? Et cetera.\n\nI really love the specific numbers you presented in this section based on success criteria. Sadly, on the technical topic, your team has already determined what measurement tools you will use to publish training videos/documents or subscription statistics for each phase of the project. Besides, undeniably, you managed to come up with some success metrics close to your project's original goals. But I think it could be more detailed. For example, instead of referring to increased participation in social discussion projects, People who participate in social discussion projects will be considered a success factor for your team.\n", "q2r": 4, "assessor": "z_assessor_2583", "no_vca": 3, "ne": 2, "ng": 0, "nfo": 1, "vca_o": 2}, {"id": 3587, "q0": "Are startups in Africa going to ICO on the exchange and start raising capital from the block community in the world?. The team's suggestions are great.\nThere is a problem I am wondering if the proposed exchange should use ADA as the main coin of the exchange or will issue a separate coin like today's platforms.\nUI/UX is also used in another proposal in fund 8.\nThe project is in beta for users to experience and evaluate, this information will be awaited by a lot of Startups in Africa, there will be a lot of new users here into Cardano.\nWith all the features of current electronic floors, it promises to create a promising land for startups.\nThe proposed challenge is suitable for solving the problem of the proposal.\nThe risks are also reasonable, predictable and associated with the solution.\nI and the blockchain community in Africa look forward to this project", "q0r": 5, "q1": "In addition to the legal issue as some countries in Africa do not have a legal basis to regulate cryptocurrencies, the subject matter of the proposal showed the feasibility of the project.\nThe blueprint helps the reader visualize an entire colorful picture with the first drawings until the finished picture is admired and appreciated by the audience.\nEach of the issues in the process raised has made it clear to us the need for a platform to help startups in Africa thrive.\nInvesting in UI/Ũ is not only for those who have blockchain experience, but beginners can also participate.\nThe specific timelines, activities and events show that the team has prepared and put a lot of effort into this project.\nTeam of talented and passionate friends, thank you for giving good ideas to the African blockchain community\nWe are waiting for a detailed budget finalization table to be released for public evaluation.", "q1r": 5, "q2": "Because the proposal has not yet developed and provided a detailed budget table to be supported by Project Catalyst. Therefore, I cannot assess the transparency of the proposal yet.\nI and the community are waiting for the return of the team to fill in the missing part of the project's criteria.\nI hope you come back soon and be successful.", "q2r": 4, "assessor": "z_assessor_2464", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4510, "q0": "I strongly agree that the proposal is potentially very impactful and could address multiple of Fund9's strategic goals: enable a large population to contribute to the Cardano ecosystem, attract more developers, and improve tooling to support human processes. It'd just be nice to have some numbers highlighting the size of the African crypto-economy so that new community members would have a sense of and appreciate why Africa is such important geography for Cardano. The proposal is a long-term one and will address the scalability in the future while highlighting goals and metrics for the next year.\n", "q0r": 5, "q1": "My overall assessment is that the project is feasible. The work has already been underway with some visible results. When it comes to the timeline budget,  one thing that stood out to me is the number of engineers. Based on my experience building blockchain DEX and launchpad, they may need more than two engineers. I also expect to see more technical documents on how they think about building the launchpad and crowdfunding (in terms of mechanism and infrastructure). Milestone for the 1st year, whitepaper. In addition, I would recommend the team consider risks and mitigation regarding the ICO assessment and approval process which has not been mentioned in the proposal.\n", "q1r": 4, "q2": "I strongly agree that The project is highly verifiable. The roadmap in 3-6-12 months is specific, easy to follow, track and verify. The team did a good job putting a clear problem statement and solution. My only comment is for one of the high-level's measurements: the number of successfully funded projects. If a project is not successfully funded, whether the reason is low liquidity in the marketplace or the project itself is falling short of quality. If it is the latter, it is not relevant to the usefulness of the Launchpad. Other than that point, I think the project has laid out a nice auditability trail.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6772, "q0": "The proposal focuses on providing a crowdfunding platform that allows African-based startups to raise funds in ADA for their projects. This is a great idea, if successful it will open a lot of opportunities for startups in Africa as it allows startups to take advantage of users of the exchange on Ennarea to raise funds and funded projects will also be able to list their tokens on Ennarea thereby expanding the potential for public outreach.\nThe proposal also provides suitable risk mitigation solutions for the risks that the project may face, including deposit and withdrawal mechanisms, regulations on cryptocurrency management, and local language barriers.\nThe goal-aligned proposal is set up in the challenge, and I also appreciate the benefits it will bring to the Cardano community.", "q0r": 5, "q1": "The proposal provides a very detailed roadmap that includes key activities and milestones to be achieved at each milestone with specific metrics. Not only that, but the proposal also provides additional information and provides analysis of outstanding services in each of its products. According to the information provided, the proposed products have been deployed and are in the process of development and completion; everything seems ready. That shows, that the group has prepared very carefully for their presentation and is very determined to implement the project.\nUnfortunately, the budget of the project was not analyzed in detail. I am told, that Ennarea Finance is asking for $350,000 for the first year of project development and management, and the team is asking for $55,000 in this funding round, the rest will be claimed in another funding challenge. However, the proposal does not provide a detailed budget breakdown, so that the community can understand how the funding will be distributed.\nThe implementation team consists of 5 engineers; the links provided indicate that they are experienced and skilled people relevant to the role they are undertaking in the project.\nAlthough the proposal lacks providing detailed budget analysis, with Team Ennarea's experience and determination, I believe this project will be successfully implemented.", "q1r": 4, "q2": "The indicators used as KIPs to measure development progress are described very concisely and are consistent with the project's development roadmap. The definition of project success is provided in detail and quantified for each specific goal in 3, 6, and 12-month intervals. Each project's progress will be publicly announced on Ennarea's social media platforms, blogs, and websites; however, it would be better to propose providing those links so that the community can easily access and track the progress of the project. With the measurement tools and a detailed, clear roadmap provided by the proposal, this project is fully auditable by the community. 5 is my score for recommendation transparency.", "q2r": 5, "assessor": "z_assessor_2829", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7521, "q0": "I found the proposal of this project very positive, ICO is a popular way to fund projects in the blockchain industry but Africa misses this opportunity because there is no background on fundraising here is a problem to be solved in this challenge and it is directly related to the challenge. This proposal aligns with the challenge Ennarea launchpad will crowdfunding supported by ADA allowing startups to raise capital for their projects. The research and development of this proposal can scale to address future problems and challenges, which is an urgent issue related to the challenge of this project. The output provided the risks and challenges that the team may face during project development. Interestingly, the authors of the proposal begin to explain the idea by presenting the obstacles they will face. The author listed the risks that could affect the proposal as Fait withdrawal and deposit gateways in Eritrea, Somalia, and Djibouti, regulatory approvals in Somalia, and Eritrea, and Communication difficulties in some non-English speaking areas. The author raises the risk and also outlines solutions to deal with that risk. The proposal identifies common problems that need to be addressed and that accessing legal financial and Defi solutions is an issue in some countries.", "q0r": 5, "q1": "A crowdfunding platform for startups and existing businesses that support funding with ADA. They have given a clear roadmap with detailed passages and with milestones, and the author has a clear vision and aims for the outlined goal. The action plan is explained in detail and it is expected that in the next few months, they have clearly outlined details for each of their milestones: Test and demo release (September 2021 – July 2022), Production Release, and Marketing Campaign (September 2022 - January 2023), Kickoff Board Launch and Crowdfunding Portal Release (February 2023 to June 2020). 2023), Cryptocurrency banking and payment processing service release (July 2023 - January 2024), Market expansion and penetration (Jan 2024 - Jan 2025). Based on the given information, I agree that this recommendation gives us enough information to review their progress. They acquire relevant skills in research to give confidence in their ability to achieve their proposed goals in the shortest possible time. Long-term goals are also clearly outlined by the author, by stating that the proposal is an ongoing process that spans years, and they also address continuity issues. related to Cardano. In my opinion, this proposal is very viable because the announcer detailing the members of Team Ennarea is a 5-member team whose authors seem to have diverse experience and a strong background of members. Members all have many different fields but things related to Blockchain. The author states their names, what each person has done, talk about their previous experiences, and lists their working relationships with Blockchain so we can better understand who they are. There are three high-tech engineers, a project manager, a communications director, and a marketing manager who are available to execute the project within the given time frame. The group includes: Henok Lapiso, Beza Yared, Frehiwot Samuel, Denys Tun, and Daniel Hawkins linked to LinkedIn and Gmail so we can follow their projects very easily. Interestingly, when the authors of the proposal begin to explain the idea by presenting the obstacles they will face, they address this challenge in the following ways: Startups can run a Smart contract and fundraising using the exchange user base, and successfully funded projects can be listed in the exchange with each other, Cardano blockchain mass adoption and projects. The project problem and solution are clear and within the scope of the challenge.", "q1r": 5, "q2": "KPIs measuring development progress are listed by the author into 4 stages: number of successfully funded projects, amount of money raised on the platform, number of users successfully participating, and number of users' daily activities. The relatively clear proposition of the concepts it wants to deliver with the above listing shows that the author's measurement makes it easy to check the progress of the project. The project is carried out with an elite team. Team Ennarea is a talented team of 5 members who are passionate about technology with a lot of experience and a strong background. The author states their names, what each person has done, talk about their previous experiences, they list their working relationships with Blockchain so we can better understand who they are. This team has a certain roadmap with three high-tech engineers, a project manager, a communication, and a marketing manager who are ready to execute the project within a certain period. The group includes: Henok Lapiso, Beza Yared, Frehiwot Samuel, Denys Tun, and Daniel Hawkins linked to LinkedIn and Gmail so we can follow their projects very easily. This team has proven their skills in building on Cardano and building projects in the blockchain industry. The funding applied for this project is $55,000 less than 20% of the total challenge budget. This budget is here, I need the author to list in detail the expenses to be spent so that the viewer can imagine what the expenditure of the budget is, About the budget I have not seen much transparency. It is helpful to have clear deliverables related to each budget milestone.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7807, "q0": "The proposal intends to set up a crowdfunding platform for start-ups which might have challenges with finances at the initial stage. This initiative when funded will boost the number of startups joining the Cardano ecosystem as well as project catalyst.\n\n This proposal has identified a problem which effectively addresses the challenge. The proposal has demonstrated that it understands the needs in Africa and as such crafted a suitable solution to tackle it. \nFor this reason I give it a 5 star rating ", "q0r": 5, "q1": "The number of piloting this proposal has gone through in Africa leaves no doubt that it is on the path of being implemented successfully when funded.\n\nThe team behind this proposal have demonstrated a lot of resilience to see to it becoming a reality. \n\nThe team have demonstrated that they are aware of the mountain of challenges up against them and their readiness to overcome them all. \n\nFor all these reasons I gave it a 5 star rating ", "q1r": 5, "q2": "My rating of 5 star is based on the fact that this  proposal contains key metrics with which progress and success of the project can be measured easily. Key metrics such as number of successfully funded proposals, number of wallets created among others, will serve as benchmarks to watch out for when measuring success of the project.\n\nThe proposer intends to post periodically the progress and successes made on its social media platforms as well as sending timely updates to the community.", "q2r": 5, "assessor": "z_assessor_2924", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8066, "q0": "Crowdfunding will greatly help startups with good ideas but lack of capital. In addition, the project also brings other practical utilities such as cryptocurrency exchange, list the token back to the very system that helped them raise capital from the community, etc. However, the proposal described as crowdfunding but at other times mentioned ICO makes me a bit confused whether the project members have or do not know the business that the system will provide? In addition, there are many countries that do not recognize cryptocurrencies as legal, how is the proposal handled?", "q0r": 3, "q1": "The features of the proposal are suitable for the challenge but no project member has enough experience in the field of developing products related to banking, finance or cryptocurrencies which is a major shortcoming to develop such projects. Asking only USD 55000 for the budget is also confusing because with that amount of capital will not be able to develop this project (even asking for $ 350000 for the Ennarea Finance feature is also something that needs to be reconsidered). The proposal includes a URL, but when I open it, there is nothing, that show the team has not made a thorough investment, the team may not need to provide the URL if it is not working well.", "q1r": 3, "q2": "In an audit that mentions KIP, I don't understand what it is but it is possible that the KPIs and parameters that the project provides will not be able to help the community to track during the development of the project (it will are parameters when operating the project and it is not included in this proposal). In the milestones of the project, I see somewhat unrealistic numbers like \"At least 50 thousand active users\" or \"Raise a $10 million startup fund using our platform\", etc. The lack of clear budget allocation also reduces auditability.", "q2r": 2, "assessor": "z_assessor_2945", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8192, "q0": "\"I feel like the description of the proposed solution here is a bit general. The team mostly presented the expected results or benefits that the solution might bring; however, they are clear about their target audiences. The proposers did provide details (which involve the current problems in Africa, the necessity or motives behind their project and some featured services they will have on their platform ) in the “feasibility” section, as I read on. I think it would be better if they highlighted these details in the description here (“impact” section). As they do that, the community will have a clear understanding of the project in the first place, thus better assessing whether the ideas and orientations are good or not. \nOverall, the solution described in the proposal is aligned with the challenge. The team’s proposal has a quite wide impact which enables startups to run a smart contract and raise funds, ultimately, increasing the mass adoption of the Canada Blockchain. \nThey did well in predicting all the possible risks during the project’s operation. However, they can work a bit more on solutions here. For example, dealing with fiat currency deposits and withdrawal, the team state that “we will manual deposit and withdrawal mechanism”. They can be more specific about how they can execute this technique, what resources (human/technology/…) need to be involved, do they have enough resources to manually address this, and what steps need to be done.\n\"", "q0r": 3, "q1": "\"The operation plan is detailed covering all the main activities and milestones within specific periods of time. Each phase will focus on one main goal (e.g. production release and marketing campaign - 8/2022-1/2023) and then be broken down into small tasks. This will enable the community to follow the action plan and keep track of the overall progress of the project. This detailed roadmap can also help the team identify any possible derivatives, therefore making proper adjustments. \nThe budget breakdown is transparent and detailed enough for the community to follow. The team has presented how and in which sections the fund would be allocated (e.g. office setup, talent acquisition,...). The numbers are very specific, which enables the community to double-check if necessary. Based on these information, the community can have an overview and evaluate the efficiency of their financial plan.\nThe team has already released the pilot project so I believe they have the full capacity to operate this project smoothly. They also have plans to recruit new members, which indicates the promising development of the project in general. \n\"", "q1r": 5, "q2": "The KPIs and metrics are well linked to the delivery plan and I think they are good measurements for the development of the project over time. The goals are also well set and suitable for challenges that the team is trying to solve. For example, with the KPI -  the number of active users, the team aims for at least 10,000 users in 3 months. Viewing these data, the community can access their progress and detect any delay happening during the life circle of the project. A small recommendation from me here is that the team also can offer how they can keep the community updated about these statistics. (e.g, public reports on the platform or using open source reporting tools)", "q2r": 5, "assessor": "z_assessor_2966", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8647, "q0": "I see the effort and investment in this project by providing essential information in great detail by the proposer. The goal of this proposal is to build and develop a crowdfunding platform focused on startups in the Africa region, contributing to the mass adoption of the Cardano blockchain. I think this proposal is closely linked to what this Challenge sets out to, if this project is on the right track, it will give Cardano many new users and interaction from the African market that the solutions of Blockchain are still limited there. To demonstrate the availability of the platform, the proposer did a very good job of market research, presenting the shortcomings of the African blockchain market that the project could strike heavily to develop and effectively address these shortcomings. I do not find any technical barriers in this project, the terms and concepts are explained quite easily even for non-technical people. Their platform has three main versions: basic, pro, and launchpad, operating structure, main functions, and user objects are mentioned by the author. The two biggest risks that transnational projects often face are foreign language barriers and legal issues, which is great that the proponent has focused on them and has the solutions deemed appropriate.", "q0r": 5, "q1": "This is a long-term project and in the process of testing and demo, as it is a long-term project the work to be done is quite a lot, which requires the proposer to present the development plan to convince investors and the community that they have the ability and the reliability to run this project well. Luckily, I have found a very detailed project sketch for what the proponent has done, is doing and will do at the medium and long-term milestones. Each milestone is attached with specific KPIs as a solid measure to review the project's impact on the Cardano ecosystem according to what this Challenge's key metrics cover. As for personnel, the information and records provided are enough to prove their team can do well on this project. However, in the budget section, as far as what they mentioned was the $ 350,000 budget for the first year of the project, and this proposal was used to call for funding in 3 different Fund9 Challenges ($ 150,000 per proposal per challenge). The question is if they don't successfully call for funding on all of the challenges, what plans do they have to fill the gap of $ 350,000 and whether this will affect the overall development of the Ennarea Finance? The budget is allocated according to the facilities and personnel needed to develop the project, and the running expense summary is quite complete. To further improve the auditing capabilities of the project, I hope that in the personnel pay section, besides the positions and the number of members, the proposer can estimate the number of hours worked/cost per hour worked and $ 1,200 for the other items mentioned is intended for which item.", "q1r": 3, "q2": "The proposer has built a clear project development roadmap, KPIs to measure the success of the project mainly revolve around estimating the number of users and the number of transactions of the platform in the first year of a project's development, these are the primary metrics for measuring success on building user platform projects like this. While there have been announcements on how the public can track project development (social media platform, blog post on the website), it does not include any possible links that can be accessed.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9463, "q0": "With a rough idea of what this proposal is trying to do, I think there’s a shortage of information that convinces me of the positive impact which leads me to rank this proposal a 3. Most Catalyst proposals could benefit from more quantifiable impacts that demonstrates how many lives would be impacted, to what degree it will improve the status quo, and a rationalization of how these impacts occur. Voters would be far more likely to respond positively if all of these areas are improved in this section. It might be rather confusing for many voters but I generally gather that this would be sort of like a CEX for new projects that are looking to build on Cardano specifically for those that have their base of operations in Africa. If this is the case, I think there are far more risks than what is listed at the end of this proposal such as lack of technical capabilities to enable these ICOs to be able to develop, a lack of investor interest to provide funding through this platform, or malicious actors using this platform to take from investors. I think these issues can be spoken to with more data of the status quo and elaboration on the safeguards/operation of this platform. I think voters would like to see clear justification and quantification of the “mass adoption” referenced as an impact of this proposal. \n", "q0r": 3, "q1": "Due to a perceived lack of direct software development experience, I rank this section a 2. As many voters may not take the additional effort to follow LinkedIn profiles, I think it would be beneficial to include some bullet points under each core team meber’s name regarding the individuals professional experience. Otherwise, they may be unable to obviously find the information that I was unable to locate (being the lack of any software development experience). If this is the case, voters may be left with the perception that this platform is vulnerable before it gets off the ground. Without proper technical skills, this platform may have security vulnerabilities that could cause a loss of both investor and catalyst funds. The lack of a budget may be an important factor for voters as there is no way to judge efficiency of spending or appropriate allocation of funds for essential operating expenses. A top of the line proposal would not only provide a breakdown of what different categories are allocated funds but also the amount of hours of labor is required and what the hourly rate is for the job. I do give this section some points for a long term roadmap with target milestones (that should probably be moved to the audibility section). There’s also some information at the beginning of this section that would be more appropriate for the impacts section. \n", "q1r": 2, "q2": "This section, combined with some information from the previous section, contains various targets and quantifiable definitions of success that leads me to rank this section a 4. There are a lot of elements here that are commonly found in top Catalyst proposals, such as specific metrics for the amount of users, trading pairs, funding milestones, and the number of projects onboarded/funded. They even take the extra step to further define success metrics at different timeframes in the life of a project, which is a big win for me. The only area where this section loses points from me is a lack of resources provided for public accountability. Some of these sources could be GitHub, social media, native website progress reports, or anywhere that voters can visit to follow up on the progress of this project. \n", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11428, "q0": "The proposer would like to platform called Ennarea which is the combination of a cryptocurrency exchange for their local currency, and crowdfunding which enable startups in blockchain to raise fund for their project within the African market. I think this is a good idea when Africa is a very promising blockchain market when many technology starts up find it hard to access funding, increase the Cardano transaction volume,... Startsup can take advantage of their exchange users to raise funs and the funded projects will also be able to list their tokens in their exchange. Therefore, this product will include 3 components: Ennarea for beginner traders, Ennarea Pro for professional traders, and Ennarea Launchpad for crowdfunding. As I know, this platform is under development, with proof of work on their website pilot.ennarea.com, I hope their project gets more support from community. ", "q0r": 4, "q1": "Well the proposer provides a very long term plan for their proposal since 2021 to 2025, in which the proposer clearly mentions about their major activities and milestone for each phrase. However, I'm confused because I do not know what plan is within the scope of this proposal for raising fund. As they said, they will return to Catalyst for further funding, and only request $55,000 for this round, but the proposer doesn't show their budget breakdown for this proposal, in which it is hard for me to assess this feasibility part. As I know, they have a very talented and qualified team members for carrying out this project well.  I think, they need to put more efforts on another funding round for better preparation of writing proposal script.", "q1r": 3, "q2": "Well, it is possible for community to follow their project development. Community could keep track of the project via their social media platforms and website blog posts. Besides, to monitor the project progress, community could based ont their KPIs such as the number of funded projects, the amount of money raised, the number of new users, the number of active users,... Besides, the proposer also provides the details of how their project success looks like after 3 month, 6 month and 1 year. In short, it is not hard to audit this project. ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11953, "q0": "This proposal effectively addresses the challenge, and it is a large project that have three main platform - a basic exchange, the pro version for traders and also a launchpad.  The team wants to target the African audience, which would be great for future adoption and points on their problem statement seems reasonable. I think there are some information that have not been clarified properly - such as its cash flow as a business, the budget allocation for hiring team members, revenue flow for significant growth of the project besides fund raising. Other than that, the featured services for each platform are great plus their milestones for market expansion.", "q0r": 3, "q1": "Based on both websites - Ennarea Basic & Pro, there seems to be much planning needed on its UI/UX. From the website (https://www.ennarea.com/), the team claims that it is on pilot release since September 2021, though the website is quite plain and there's not much interaction to be tested. But, the featured services and its milestones are interesting once released. Also, for the Pro version, I think that the whole trading interface is lacking usability and theme. I hope that the team could consider improving its branding and UI visually - as this is important for user functionality. The team has provided relevant links for contact and claims to also have experience to execute the project. From the proposal, the budget allocation is under progress, therefore, though the milestones and roadmap are detailed, it is difficult to fund the project if the budget information is lacking. Hiring UI/UX designers, researchers, graphic designers for marketing purposes, can be added to the team members. Overall, I think the project can be implemented successfully based on the given timeline, it seems reasonable for the project to be fully launched in 2023 - but again its missing its budget requirement breakdown.", "q1r": 3, "q2": "\nThe information provided is partially sufficient for auditability and the proposer have also claim that they will announce their progress on their social media platforms. The KPIs are clearly stated and the team have also provided its success over time would look like. What is missing from this is how does the project gain consistent revenue from the platform and support its future growth. If fees are used to pay revenue to the project, it would be helpful to list the information in the proposal. ", "q2r": 3, "assessor": "z_assessor_3320", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12320, "q0": "The proposal addresses the problem which is in line with the challenge settings. It outlines the need to bring on board crowdfunding platforms which will provide a platform to raise funds using ADA for startups. Furthermore, the development of cryptocurrency exchange could contribute to the cardano ecosystem. However, there is  rising demand of blockchain and crypto currency in the Africa market. Many are yet to adopt to blockchain and cryptocurrency in these communities in Africa. Some parts of Africa express the need for blockchain and cryptocurrency which more education and key ideas is to be regarded to ensure it's acceptance in this areas. A startup launch pad and crowdfunding platform will add value to the cardano ecosystem by the use the ADA. Also, the proposal has provided the key metrics and goals of the project which is aligned with the challenge settings. I believe if the proposal receives necessary funding it can be implemented. These platforms provide youths who show interest in blockchain and cryptocurrency access to learn. The problem falls in line with the challenge setting.\n\n", "q0r": 4, "q1": "The proposal provided a clear information of ideas. The proposer ( Ennarea) provides relevant team experience and skills needed to implement the project. The proposal details all team members within the project with their level of expertise. A project with a viable team shows a realiable team. Furthermore, the proposal offers a realistic timetable to carry outthe work. A detailed timetable is provided inorder to facilitate the smooth running of work. These as such was put in short periods together with underlying activities to be carried out. In addition, the plan describes resources necessary to implement the project. Despite certain risk that could hinder implementation of the in some countries in Africa. Examples of these risks the use of fiat currency deposit, withdrawal gateway, Regulatory approval and communication hardships in non-english speaking countries. These are short-term risk the proposal seeks to address.The proposal has provided a verifiable plan to this regard. I believe the proposal has provided the necessary information for its implementation.", "q1r": 4, "q2": " The proposal offers clarity in it's presentation. This provides a roadmap with milestones and a clear time horizon for achievement. The proposed has outlined a period of activities for the years of its implementation. This shows a timeline of activities on what is to be achieved in the first 3months, 6 months and 12 months during its first year of its implementation. The proposal tackles key milestones with identifiable measures of success which when achieved can be measured by the cardano community. In addition, the proposal addresses key metrics/KPI's that defines the success of the proposal. This in turn seeks to provide an Ennarea basic trading and investment platform. If the proposal receives the necessary funding, it will go along way to implement. The need for cardano adoption in the Africa community. The proposal has provided me with sufficient information.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12730, "q0": "The Project matches clearly the Fund 9 goals and the goals of the challenge. The Project wants to create infrastructure to fund new Projects more easily with a main focus on projects in Africa. This could accelerate the growth and adoption of the Cardano Blockchain by bringing in more projects/ developers and therefore more usecases, which brings more users . After the new projects are funded, they can be listed on the centralised exchange which increases the chance of success, because they can be actively traded. \nOverall the idea looks awesome but it is highly dependent on the acceptance and use from other projects. There is the risk that your launchpad and exchange isn´t used because for example there is missing understanding in Africa (because the current low adoption of crypto) or the marketing doesn´t work. That said, you can address these problems good with the skills of your team (marketing manager). I just wanted to point out that you are totally dependent on the work of other people. \nOverall this could have a great impact in Africa and on the Cardano community and your skills show that you can address the risks and can create a userbase through for example marketing and events. Therefore I give 5 Points, because the idea can have a great impact and you can address the risk of not being used. \n", "q0r": 5, "q1": "The proposers have provided their LinkedIn profiles and I am not sure whether they have enough programming skills to deliver a launchpad with an exchange of this size. In the CVs of the programmers have only a few programming jobs. (If you have theses programming skills, please provide more proof next time). On the other hand they have made a pilot website which is usable on the surface level. (I can´t determine the competence of the code, because I am from an economic field and not from programming) \nThey haven´t made an outline of the expenses, in this proposal therefore it´s untransparent how they will use the funds exactly. \nYou have no budget outline and no real proof for your programming skills, but you have a pilot exchange. Therefore I give you 2 points.\n", "q1r": 2, "q2": "The target problem is clearly defined and they have provided a clear roadmap with realistic goals. \nThe KPIs are clear and most measurable like “intense marketing to reach 25 thousand users”, “50 thousand active users”… But some goals seem unrealistic for example you release the Pilot of the crowdfunding platform after six months and have just 6 months to raise 10 million dollars for start up funds in a market where the crypto adoption is low. \n", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12938, "q0": "The Proposal is about the Ennarea launchpad that will provide ADA supported crowdfunding platform and will enable startups to raise \ncapital for their project. The proposal adds the value to the cardano eco-system .\nBy crowdfunding platform that enables \nstartups to raise funds using ADA which will be used to develop the projects on the \ncardano platform ,The proposal have couple of the set goals and the approach to find the solution is great . The Proposal is again a great way to educate and make aware about \ncardano eco-system. By This way the startups can take advantage, But the proposed plan is not that elaborative the idea is beautiful hope they work on that. The key metrices and the goals of the proposal align with the outlined challenge settings and the proposal is able to scale to the address future challenges, By accessing the proposal I agree that this proposal effectively addresses the \nchallenge .", "q0r": 4, "q1": "The Proposal has clearly mentioned the milestones, timeline and The budget broke down.\nThe proposer have provided evidence of the skills and  experience needed to implement the proposal ,The team looks very professional and have many years of experience. The proposer have properly broke down the timeline and Budget. The Budget is outlined properly nd the budget is somewhat high could be rechecked other then that everything looks fine . The proposal offers realistic timetable to complete the work and the plan describes the resources necessary to implement the proposal and the proposal have also considered the challenges and the risks relevant to a successful implementation. The team details and the links to their works have been given and looks perfect. By accessing the proposal I agree that it is highly likely that this proposal will be implemented successfully", "q1r": 4, "q2": "The proposal have mentioned Metrics/KPIs that define the success of the proposal and the clear solution/approach to the proposal is mentioned in the description . The progress of the proposal can be seen on the social media platforms . The proposal have mentioned in detailed description that how the flow of the project looks like . The Proposal is new and never been funded before by looking or accessing the proposal I agree that this proposal provides me with  sufficient information to access the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Ennarea launchpad will provide ADA supported crowdfunding platform and will enable startups to raise capital for their project.", "experience": "We are a team of 5 talented Engineers. 2 senior blockchain developers, 1 cloud solution architect, 1 marketing manager, and 1 business advisor. Our team experience is proven with a production-ready cryptocurrency exchange."}