{"id": 413992, "author": "ninhtran", "title": "500+ ₳Community Sent to Conferences", "url": "https://cardano.ideascale.com/a/dtd/413992-48088", "category": 26595, "amount": 420000, "description": "As a new Cardano dApp with a lot of hustle & desire to grow quickly, we lack go-to-market resources to send this community to conferences and 100x user adoption & revenue in the next couple of months.", "f6_no_assessments": 17, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 8107, "q0": "The proponent has raised an important issue for the Cardano ecosystem, the scope of impact is relatively large. The problem is that the new Dapps built on Cardano lack the market marketing resources to bring the community to the conferences and grow by 100x users. Community is one of the most valuable resources and also a resource that contributes to the rapid development of any project or ecosystem. The Cardano Community is a decentralized global community.\nThe solution of this proposal is described in detail and clear and the method of reasoning is rigorous. The solution is to exhibit at major industry conferences with free tickets for the Cardano community to share the Cardano gospel. The author used photographs, and evidence from previous successful events (such as Consensus) to demonstrate the importance of the exhibits. Apparently, the effects of the exhibits are great for Cardano. The author has also described the registration process and the selection process of the participants in great detail. Meeting in person at Cardano conferences, events, and exhibitions will be an extremely impactful Proof of Community for those inside and outside of Cardano.\nI found that the author's proposed solution met the challenge because it had enough things to join the challenge (\"Many others - Any other idea, product, or integration that someone thinks should be built into the Cardano ecosystem\") and solve the problems of the challenge (increasing number of users, number of meaningful interactions...)\nIn addition, the team has outlined the main risks that may be encountered when implementing this project and they also have appropriate solutions to minimize these risks.", "q0r": 5, "q1": "The proponent provided a detailed plan. Here's a schedule of upcoming exhibitions, conferences, hackathons and events with clear timelines and links for the community to easily sign up for. In addition, some other work was done such as: creating an exclusive Grow Cardano bonus at the Conference on Snapbrillia for the Cardano community to register for conference and event tickets and commit to representing Cardano; order 1000 shirts and upgrade Linktr.ee to access Special Analytics.\nThe proposed budget of $420,000 represents 5.35% of the total Challenge budget. This money is allocated for specific conferences as the author presented in the proposal and detailed allocation for other expenses such as: Sponsoring group tickets requested by the community, additional exhibitions supplement and sponsor; cNFTs minting fees; DID authentication fee; the cost of ordering 1,000 shirts; Linktr.ee upgrade fee. The author also explained the proposed amount and budget allocation.\nInformation about the members of the implementation group is described in full and in detail by the author. They are all experienced and competent in implementing AI and Blockchain solutions in Healthcare Tech, FinTech, E-Commerce, Legal, Non-Profit and HR Tech. They have run AI and Web3 startups. In addition to this proposal, they have a number of other proposals also submitted in Fund 9 and they also have proposals funded from previous Funds. In addition, the author has also provided a link to the members' personal profiles for the community to easily verify their identities.", "q1r": 5, "q2": "The team planned to handle the funding transparently and publicly by holding it in a DJED or a publicly available stablecoin wallet for the community to check at any time.\nThe author has provided metrics and KPIs to track the project's progress in 3 different aspects (tracking 100x revenue from conference exhibitions; tracking conference attendance and being an ambassador; tracking the impact of attending the conference and serving as a Cardano ambassador)\nThe author outlined how they increased transparency and increased engagement with the community. For example: hold a Snapbrillia & Progress Demo behind City Hall at least once to twice a month and attend most Catalyst Town Halls to capture community feedback and input. In addition, they will provide the latest information and updates on the project's Discord channel.\nThe team defined the success of the project very clearly. This project aims to empower the Cardano community to be an active Cardano ambassadors and help launch more dApps, projects, and strengthen the future of the entire Cardano ecosystem. Also help current Cardano Ambassadors nurture the next generation of superstar Cardano ambassadors to grow the community.", "q2r": 5, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 5, "ng": 2, "nfo": 2, "vca_o": 2, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 3601, "q0": "\nI was impressed with the sentence in the proposal \"share the gospel of Cardano\".\nI think of Cardano as a symphony that inspires the whole orchestra including the conductor and the members of the orchestra with different musical instruments that are inspiring the music community. .\n Proposing the content of organizing major conferences of all industries and giving free tickets to Cardano community members to promote Cardano themselves.\nThe solution offers each individual, each group is the representative of Cardano in each different industry to participate in conferences to exchange and build and develop more quality projects on Cardano. In addition, meetings at conferences will help unite the community to resolve conflicts of different opinions on how to build Cardano.\nThe vibrant atmosphere of the Cardano conference will spread and impress other communities, which will certainly bring a lot of value to Cardano. The risks are clearly stated and anticipated with the accompanying contingency solution", "q0r": 5, "q1": "A very detailed plan is built with specific timelines with events taking place in turn according to the expected time for the quna tam community to buy tickets or participate in exhibitions, register to participate in speeches. .\nMany events and exhibitions will take place from the end of August 2022 to 2023.\nThe number of events and exhibitions organized is very large, so the proposed support budget is also very large, at least $ 5,000, up to $20,000.\nI think the proposal needs to come up with a more detailed budget table for details of the budget allocated for each event, exhibition, and how many people.\nThe proposed budget source for reasonable contingency support because it is not possible to accurately measure the number of attendees, so there will be additional costs if the number of participants is larger.\nLarge team with many members, core members with a lot of personal information to talk about, all with blockchain technology and community experience, in different countries. It can be said that the proposal will create cultural interference in different countries. Proposing to have a strong team that will take on and execute the project well", "q1r": 5, "q2": "There are many proposed goals to measure project progress: track revenue, track attendance, drive conference attendance.\nDetailed reports that specifically record each spending item will be updated, archived and made public for the community to verify, in addition, monthly reports for Catalyst also demonstrate transparency.\nThe community can envision the success of the project clearly: the Cardano community is empowered to be active ambassadors, many dApp projects are launched, the future generation of Cardano ambassadors will be nurtured and developed.\nThe biggest success I have seen from the project is creating a dynamic, confident, friendly and equal Cardano community, geographical distance is removed, language barrier is gone, only community remains. solidarity, love", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 14327, "q0": "Having studied the proposal, I must say that this solution will resolve the current challenges. The ideal of reaching out to other community outside of Cardano is, in my opinion, brillant ideal, where we can meet like-minded people. There is no better way to increase engagement in the industry than exhibiting at well-known conferences such as Hackathon, Blockchain Expo North America, and etc. Being a part of these conferences can virally increase the reputation of Cardano. Regarding the viability of this planPrevious experience at Concensus can make sure these planned exhibits flourish. In addtion, proposal team has covered every adverse scenario that can happen. As a senior developer, being there in at least one of those conferences would be my pleasure.", "q0r": 5, "q1": "The provided roadmap and milestones were clearly listed by the proposal team so that anyone can keep track of the progress. Especially, the team is well prepared for any adverse scenarios that can happen while hosting these events. However, it would be better to know more about the details of what the team is going to do at these events to increase engagement besides giving out merchandise, such as what they will talk about with members, or what kind of bonding activities they will provide. I also really appreciate the information from people working on the project, where they can learn more about the team and build more trust in them. And the precedented experience from the Consensus can partially guarantee the success of this proposal.", "q1r": 5, "q2": " In terms of auditing the progress, the team has a solution that all funds will be kept in DJED or a comparable stablecoin wallet that is publicly accessible for the community to audit at any time. In addition, having a clear target is a vital point of any project, and this project is crystal clear about its two main targets. Transparency is another important thing to ensure that the project is on the right track for any investor, which the team does a wonderful job where they will host a meeting at least once to twice a month, and even receive feedback from the community. Good luck team!", "q2r": 5, "assessor": "z_assessor_3983", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 14133, "q0": "The challenge described is the lack of resources to send community members to conferences in an effort to increase user adoption of Cardano applications and revenue by 100x in the next few months. By asking for an amount close to 420000, this funding will go towards projects that are committed to representing Cardano at world-class conferences. It highlights the need for more community interaction beyond twitter spaces and other social media platforms. These enhanced interactions will promote networking, and increase the exposure many upcoming Cardano applications need, hence resulting in higher user adoption and revenue. Additionally, Snapbrillia plans on becoming self sustainable after launch, which means the need for more funding won’t be necessary. This proposal provides different examples and perspectives from developers and community members, like Charles Hoskin, to further address the importance of curating strong community involvement. \n", "q0r": 5, "q1": "The plan presented and risks acknowledged shows that the proposal is ready to be implemented successfully. The plan provides a clear process on how community members can apply for funding for different conferences, and the security processes that will be implemented by dedicated developers to ensure fairness and security. For example, ensuring transparency of the funds by storing it on a public wallet and presenting any ROI at the end to community members. Additionally, by using processes such as DID Verified Credentials and Verified cNFT on Snapbrillia’s Proof of Reputation System, it seems confident that bad actors can be limited via this screening process. Other risks have potential solutions, and the proposers are open to more community suggestions, which is a good sign. Furthermore, the proposers have a strong team ready to work on this proposal and ensure the community is updated timely. ", "q1r": 5, "q2": "I strongly believe that the information provided so far is strong and does relay the confidence of the proposers in the ability to succeed. I also feel comfortable, as a community member, to reach out and provide any other suggestions I have, mostly because of the number of different members working on this. I would also like to add that Snaprbillia has partnerships with different organizations around, such as Hidden Order and Rare Bloom, so it there is no dependence on one sole company with all the funding. The more involvement from different companies in the Cardano space, the more this will help the community grow even more. \n", "q2r": 5, "assessor": "z_assessor_3911", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 13558, "q0": "Hey ADA voters, please read this!  A project like this is what the entire Cardano Community needs and wants!  A life-changing experience for all who attend.  What better way to show off all of the great products on Cardano?  Just imagine a Cardano booth where all who got tickets could present their products to everyone at the conference!  The impact would be massive for all involved.  The ability to meet, collaborate and form partnerships within and outside the community.  I truly hope this gets funded, allowing everyone who gets tickets a chance to showcase their products in person.  In my opinion, the footprints the proposal can leave will set off the spread of Cardano across the world!", "q0r": 5, "q1": "This team has been making serious waves since they started with Cardano.  They periodically showcase their achievements at town halls and I have also viewed some of the work they open-source to the public.  The team has shown to have enough skills and experience in the field to bring this project live. The amount of research and work are already done by the team shows their passion and will to make this proposal a success.  The team also has put up a detailed plan of how they plan to get this done and the milestones look easily attainable.  The team has also made a note of the possible risks it could face with bad actors, travel, etc and they laid out a list of ways to mitigate each. The chances of the proposal being a success are quite high, hence, I justify the feasibility with a score of 5 out of 5.", "q1r": 5, "q2": "The team mentions the milestones one could use to track its progress.  A roadmap with clear deliverables, milestones, and timeframes is provided in the proposal.  Success indicators will be easily measurable due to the statistical nature of the survey, as will the analysis process.  Reading through the proposal, the team aims to share the results and process via bi-weekly town halls and channels, where many community members dwell.  The team shows a deep understanding of potential challenges by having a perspective on the past, present, and future development of the ecosystem. All in all, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_3689", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 13333, "q0": "WOW, Your proposal is one of the tops and requires an extremely strong team and a strong passion for blockchain and Cardano.\nAs you described in the description, Snapbrillia is just starting out, but the members are very good, and after learning about Cardano, the team is determined to spend a lot of time on Cardano.\nIn order for an ecosystem to be developed wide and deep in both quantity and quality, there must be a strong enough community and it is very necessary for presentations, exchanges and knowledge sharing about Cardano and answer questions about the useful values that Cardano brings.\n\"Cardano needs a thriving ecosystem of different Dapps, products, and integrations for community use, becoming increasingly a better alternative to the current centralized providers.\"\nSo your proposal is a perfect fit for this challenge of Fund 9, and I find it to be a bold and highly attention-grabbing proposition. You guys did a great job.\n\"At the end of this July, your team's Snapbrillia will launch the beta version of the Mentor-Mentee Bounties & eLearning platform and then the end of September will fix most of the bugs, integrate Metamask and more than 100 other crypto wallets, launched with ATALA Prism on Mainnet solidifying and readying infrastructure for developer bounty, hackathons, and early mass adoption\"\nI love the way your product commits that all community members benefiting from the fund actually attend the conference and represent Cardano based on maintaining their DID Proof of Reputation with Snapbrillia and wallet refund policy for Cardano members after the conference if they apply for the conference scholarship.\nI hope that your proposal will be sponsored with the great and good value that your team brings to the community and Cardano.", "q0r": 5, "q1": "The blueprint is detailed every day from August 2022 until the end of 2023 with dozens of conferences, hackathons, and events clearly laid out and with confirmation and search links. get more information about the event or conference. I appreciate this, showing that there was a thorough preparation for those events.\nYour team has a lot of experience in exhibiting, sponsoring, planning, and organizing hundreds of major events, experience in booking tickets at good prices, and booking rooms at the most optimal prices to send to member communities. attend conferences. Demonstrate professionalism and clarity with timetable and cost plans.\nAccompanying the plan description is a detailed budget for the conference that has also been clearly listed by your team for each specific item, you did a great job in this part.\nAlong with a big proposal, the budget is also very large, so you need to be more careful and close if your proposal is approved and funded.", "q1r": 5, "q2": "“All funds will be held in DJED or a similar stablecoin wallet that will be publicly available to the community for audit at any time according to the budget specified above” – this shows the cost of implementation Your proposal is completely transparent and the community can fully monitor how your team is using its funding.\nIn addition, the public sharing of revenue levels of exhibitors that received exhibition sponsorship at the conference showed the transparency of funded projects built from Catalyst and beyond. get exhibitor slots to launch their projects at conferences.\nThe KPIs on the number of community members sent to conferences, hackathons, events and after-party Cardano, cNFT KPIs, ATALA Prism validation are also numbered by the group of friends, I appreciate your KPI.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 12695, "q0": "This proposal is very straightforward in attempting to address the challenges regarding event attending and access to resources. Ninh Tran makes a very good point in emphasizing community involvement and conferences as a quick way to spread Cardano's influence as a whole. It may seem that Ninh refers to Charles' quotes a lot in terms of responding to many of the important questions, but it shows me how both their missions and passions are aligned. It is a quick way to refer to the current milestones/goals of the Cardano ecosystem as a whole to contribute and serve back to the community.\n\nWe may be able to advertise and do several marketing campaigns, but the quick surefire way to spread the word is from fellow human to another. That is why this proposal has gained so much traction as it is an important indicator of how mainstream Cardano has become. Overall, this proposal effectively delivers the constructive need for this challenge. It is something that is highly valuable to show the masses and interest others to encourage going to conferences and spreading the word.", "q0r": 5, "q1": "I have attended several of Snapbrillia's town hall breakout room sessions hosted by Ninh and his co-workers such as Frank. They have shown tremendous potential in research and their ability to explain complex topics such as SSI and conference knowledge. Even putting aside my own observation, the background of each teammate comes from the web 3 platforms with more than 2 of them currently researching within the Cardano community. Their goals seem to perfectly align with mass supporting Cardano at conferences.\n\nThe plan suggested is very defined. They have laid out all the potential conferences that they plan to provide support for with crucial price arrangements. Their ability in the web3 space with Snapbrillia having their own dedicated web3 team makes it even more likely that they will deliver on the ability to mint cNFTs and properly represent Cardano at conferences. Based on the background references and their extensive reviews, it is highly likely that this proposal can be implemented not only successfully but also efficiently.", "q1r": 5, "q2": "The ability to audit this project's timeline is described in a simple but detailed manner. Their use of the IOG-developed DJED stablecoin will definitely allow almost anyone to track their reserves. While this may seem to appear as a vulnerability, it encourages transparency from Snapbrillia's team to the community. Taking into account for today's market where several exchanges are collapsing, I believe transparency to the public is an important and highly valuable asset to consider when trusting anyone with crypto assets. Their choice of using cNFTs to track community received tickets is also another tremendous approach to visibility because they all are highly auditable in terms of tracking the funds and involvement of the community. \n\nOverall, both in terms of auditability and feasibility, the success of the proposal seems imminent. The ability to communicate and appreciate the community is what is most valuable from this team and they have successfully shown to depict that same mindset across this proposal.\n", "q2r": 5, "assessor": "z_assessor_3454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 11634, "q0": "The problem describe in the proposal is aligned with the challenge. The proposal team has done a great job by describing the proposal solution which indicates Cardano community and culture are one of the most valuable resource and products that the ecosystem has by empowering them to accelerate the growth of the Cardano for all including 10HK , Dapps NFT project and the whole crypto ecosystem.\n        The proposer also able to effectively addresses the precise challenge and it's potential of bringing values to the community through project Catalyst block chain in Cardano ecosystem such as focusing on building, doing more adoption, feedback growth and even more innovation etc which I strongly believe they will do a great job if they are granted or approved funds to execute their project.\n        The proposal team also capture important key metrics measures under the compaign brief on how it will bring increasment and benefits to the community and to Cardano ecosystem.", "q0r": 5, "q1": "The proposer is able to provide relevant links and details of team members who will help in the execution of the project and I strongly believe per reference they have the Desired Skills and experience to carry out the project should they be granted funds to execute their project.\n        Moreover, the team are able to outline the budget breakdown funds on how it will be used in their project which I think is COMMENDABLE for them to be granted funds to execute their project.\n     Furthermore, the proposal team provide details plan including timeline, key milestones and roadmap in delivering their project which I recommend them for a great job and I strongly believe they will do a great job should they be funded to execute their project.\n      In view of these, they are also able to outline some risk challenge that could prevent them from executing their project and are able to provide and navigate solution to overcome them in adopting their project execution successful. The proposal team is able indicate for more funds since they want to prolong their project to advance most communities in the Cardano ecosystem", "q1r": 5, "q2": "The team is able to describe measure to track their project progress which is well aligned with their challenge, the key metrics and KPIs are also well outline in aligned by answering the questions, the audibility of the project development and impact is clear through; Transparency and public handing of funds, Tracking 100X Revenue from conference Exhibit, Transparency and community involvement etc should they be funded to execute their project.\n         Furthermore, the proposal team indicate how their success for the project will look like by; Empower the Cardano community to become active Cardano ambassador and help launch more Dapps, Product and strengthen the future of Cardano ecosystem and to help current Cardano ambassador faster the next generation of superstore community growth Cardano ambassador.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 10516, "q0": "The author seeks to bring more impactful uses to cardano and drive more adoption by sending the cardano community to conferences, and holding events to speak about ada and the ecosystem. This proposal will help bring more community members by breaking out of the echo chambers, and reaching new interested people. The conventions picked are also full of people who are interested in and looking for innovation, and will be more likely to be interested in, and investboth time and ressources into the cardano ecosystem. Sending a lot different community members, of differing backgrounds and interests, will show the dynamism of the cardano community, and boost visibility. The conference speakers being very knowledgeable and successful, will allow the showcasing of caradanos full potential. The friendship and partnership bonds created during these events will make for a stronger community. Overall, I believe this proposal answers the challenge perfectly. ", "q0r": 5, "q1": "It is immediately obvious that the team working on this proposal is extremely skilled and experienced. They are not only experienced in the crypto world, but many other domains of work. Their collective experience and skill is extremely impressive and I have no doubt they will be able to successfully implement this project. The team is also very big, with over 100 members of varying backgrounds and skills, and this will help bring different viewpoints and ideas to successfully implement the proposal. The authors have already shown their commitment, passion and work ethic through past successful projects. The given timeline is very concise, and meticulously planned out, with a very reasonable budget for ticket buying, merch, sponsoring skilled speakers. The biggest challenge in my opinion, would be managing all the attendees, making sure they will represent the cardano community well. The team has extensive experience in community management and event coordination, so I believe they will fully be capable of negating any potential risks and solve problems regarding that. ", "q1r": 5, "q2": "The author offers a lot of transparency to audit the progress and success of this project, with full disclosure of fund handling, and revenue. With so many members planned to receive tickets to events, it will be extremely easy for the community to see the success of the project, either first-hand through attendance o the events, or through the very large amount of testimonies, pictures, videos, social media posts. The social media platforms linked will be extremely helpful. The author also offers a post-conference write-up to summarise what was said and done during the events. The link.tree analytics will help audit the impact this proposal has online. Overall, i believe this project is completely and easily auditable both online and offline. ", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 9997, "q0": "The idea was to organize major exhibitions and conferences for the Cardano community, the goal of which was to share the development product on Cardano. The issue is in line with the Challenge and has an impact on a lot of people who are interested. The solution that implements the proposed proposal is the answers of \"decentralization\", Cardano is one of the most valuable resources and products that empower the community to accelerate cardano's development for all IOHK projects, dApps, NFT and the entire cryptocurrency ecosystem are the right jobs. The project is the goal of future scale development, exhibitions and conferences are organized to bring the Cardano community closer together. Exhibitions and conferences are the place to meet the cardano community in person, bringing this community to conferences and increasing users and revenue by 100 times. It's great to join us easily sign up and the selection is very simple and clear. The solution helps drive the development of the Cardano ecosystem with Dapps and other products, all of which represent and support the Cardano ecosystem, dApps development, and projects. The project organized to give people a $1,800 composite consensus card for free, holding presentations at these events to communicate what Cardano was about to launch. The solution makes appropriate arguments for how to solve the stated problem. The proposal identifies 8 risks: There is not enough funding to meet demand. ADA and funding price fluctuations. Bad actors. Some conferences won't produce high ROI. International members will not be able to attend many of these conferences in the United States and vice versa due to restricted visas, travel costs, etc. Travel problems, illness such as Covid, and other complications. Not enough goods aka. SWAG to give. We can see that the project author has taken into account a lot of risks and has also taken appropriate mitigation measures. The preparation for mitigating risks is consistent with performance capacity, the project has a major impact on the community, and the risks shared by the community are appropriate.\n I rated: 5\n", "q0r": 5, "q1": "The plan for implementing the project has determined the timeline according to the number of organized sessions in the month. Reasonable organizing timeline, there is a specific time for each exhibition and hackathon contest. Organize exhibitions and Conferences with corresponding themes, create exclusive Grow Cardano bonuses at the Conference on Snapbrillia for the Cardano community to register conference and event tickets, fulfilling a commitment to represent Cardano. We were really impressed with such a complete and detailed plan, each event carried out has the evidence shown through the Wedsite. The preparation work has a specific plan: Fulfill four orders including 250 high-quality super-soft 100% cotton shirts with the Cardano Community logo and QR codes designed by the extremely talented Snapbrillia design team. Upgrade Linktr.ee to access Special Analysis. A lot of evidence is given, they can see the project is a combination of proposals on Ideascle (with attached links). Moreover, the project is supported and endorsed by the community through the images given. The project has identified the human resources: The group consists of 5 key members and members of the Dev group (6 members + 80 supporters). Based on the competence and experience of each team member who has assigned specific tasks to the members, the identities of all team members are authenticated on LinkedIn and have all the images of them on the https://www.snapbrillia.com/about. The project budget analysis gives details in accordance with the events held, each event given is intended to spend the appropriate amount. Total recommended amount: $420,000 more than 5% of the total fund budget for challenge suitable for the project. There is a very detailed budget spending plan for other items such as: funding for community-requested group tickets, additional exhibitions and sponsorships, Fees for verified cNFTs casting, DID Credentials Grant Fee, 1,000x 100x high-quality ultra-soft cotton shirts with cardano logo and QR codes, 2x Premium Linktr.ee Analytics. We recommend that the author in the process of implementation, the author should include more budget reports for each event held, this factor is suitable for transparency and evaluate the success of the project.\nI rated: 5\n", "q1r": 5, "q2": "The roadmap for the implementation of the project is full of timelines to implement, the determination of the progress of implementation is the success of an event. The objectives and indicators given by the project are suitable for auditing, easy to check on Discord. We can track the impact of attending conferences and being Cardano ambassadors, 100x revenue from The Conference Expo, indicators to measure: community lists that have been and will be involved in online spreadsheets. The project gives an index: 500 to 1,000 community members are sent to conferences, hackathons, events and parties after Cardano that can be seen in each event. The project kpis/KPIs that determine the success of the project, the events that have taken place and there are specific reports on GitHub. Snapbrillia has built a platform that attracts a million underrepresented people and self-taught about technology. There have been actual running products, have organized exhibitions and conferences that attract tens of thousands of people. The author has committed to making reports at least once a month on events that have been held. In general, the project is a gold standard for the audit, the implementation of the audit is easily carried out, the work is determined, the progress of the project is carried out.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 9277, "q0": "The proposal directly affects the Cardano community and makes use of Snapbrillia's Bounties dApp. Those who are already invested in the Cardano ecosystem, from having ADA to creating dApps to all areas in between, can express interest in attending Blockchain events and representing Cardano there. They get their ticket to attend free of charge. There are also checks in place that help prevent fraud or ticket scalping. Applicants are screened for Cardno involvement, and priority is given to those more deeply involved. Moreover, applicants use DID Verified Credentials and Verified cNFTs on Snapbrillia's Proof of Reputation system built on Hyperledger Aries and ATALA Prism (built on Cardano). It uses a first-come-first serve model, and their goal is to send 500-1000 people. This proposal expands the use of SSIs and DIDs, using infrastructure that is already in place. The free tickets allow people to have positive interactions with the Cardano community and help spread the word. They will also give out free merch in the form of 1,000 Cardano shirts. Receivers are asked to post testimonials and experiences to social media to further boost Cardano, and dApp creators who exhibit track their ROIs after conference.", "q0r": 5, "q1": "Most funds go directly to community-requested group tickets, and projected costs are broken down by event (not every event's ticket price is known at this time). The rest goes toward fees to mint Verified cNFTs ($600) and fees to issue DID Verified Credentials ($1,000), and to purchase 1,000x high-quality super soft 100% cotton shirts with Cardano Community logos & QR codes ($7,500). $400 also goes to 2 Premium Linktr.ee Analytics (used for part of the auditability). Other than funds, Snapbrillia has a dedicated team of 12+ members with impressive credentials and experience working in tech, including Google, Y-Combinator, TechStars, and TechFuturesGroup alumni. Snapbrillia has already implemented features connected to Atala Prism, and it's Bounties program is already set to roll out this month (July).", "q1r": 5, "q2": "The proposal's explicit KPI's are getting 500-1000 Cardano community members to blockchain events, and creating the same amount of cNFTs and ATALA Prism or Hyperledger Aries Verified Credentials for those members who attend. The funds are also held in a publically-available DJED or similar stablecoin wallet. So these figures are completely verifiable. For ROI metrics for attendees who exhibit their products, they will also share revenue growth, and any sales-qualified leads that result from the conferences. Impact is also tracked qualitatively with testimonials from the attendees and pictures or videos with Cardano swag. This is a Cardano marketing campaign waiting to happen. Full Linktr.ee analytics with conversion tracking through QR codes. Snapbrillia also hosts monthly townhall meetings to provide updates to milestones.", "q2r": 5, "assessor": "z_assessor_3045", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 8726, "q0": "Indeed, this is a great idea. That is reflected in your very detailed explanation. You clearly understand what Cardano has and what it needs. Your proposal promises to bring a strong development to our ecosystem. All solution information is provided in detail. In addition, the illustrations are also very vivid. How the proposal will address the challenge has also been detailed. Indeed, the benefits it brings to the community are very attractive. Obviously, the greater the benefit, the greater the risk exists. You also mentioned some risks and offered solutions to deal with. Overall, I am very impressed with this proposal. It can be said that this is the IMPACT part of the proposal that has been completed in terms of content and form. All information provided is complete and clear, easy to understand.", "q0r": 5, "q1": "The project's plan updates a lot of exhibitions lasting from August 2022 to September 2023, along with the theme of each exhibition. Besides, you also mentioned other implementation details of the project. Similarly, detailed budgets are updated based on the list of exhibitions and other work. Your team is introduced with 5 core members and a few other members. They are all people with long experience and a huge number of achievements. With such a team of members and thorough preparation, I think there is no reason for me to underestimate the feasibility of this project.", "q1r": 5, "q2": "Your audit section is excellently completed. The indicators of many aspects are provided very specifically, including Transparency and public handling of funding; Tracking 100x Revenue from Conference Exhibit; Tracking conference attendance and ambassadorship; Tracking impact of conference attendance and Cardano ambassadorship. The success of the project is also clearly described. The Cardano community will get a lot of value if this project is successful. In addition, the proposal also mentions Snapbrilia's long-term mission and goals. There is nothing to complain about such a presentation. I look forward to the outcome of this proposal.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 7959, "q0": "The problem is that many projects have the problem of not being able to grow sufficiently due to a lack of funding. In this project, it is intended that funding will go to Cardano Dapps and projects that are 100 percent committed to representing Cardano. Major Cardano events will also be organised. This project can certainly add value to the Cardano ecosystem. It aims to increase the cardano community and provide funding for revolutionary projects. The main goals are included and correspond to the requested challenge settings. These are included in the proposal and have a clear description of the goals of this project. A few testimonials have also been taken. The future challenges are included. The risks have clearly been considered. It is good that at least 3 solutions have already been provided for each risk. The project already has many partnerships that can support the project in case of unforeseen circumstances.", "q0r": 5, "q1": "A list of the people who will be working on this project is included. Their relevant experience can be found via their Linkedin. This is a very extensive team with a lot of experience in the field of development. It has been made clear which team members are needed to carry out this project. The budget is very clearly defined. You can clearly see where the funding will go. For some conferences the budget has yet to be discussed. A lot of money has already been saved because everyone will cover their own transport, plane tickets. The budget is certainly sufficient to carry out everything. It's good that the team is open to collaborating with other existing projects. No additional funding will be requested as snapbrillia will be completely self-sufficient and profitable. A realistic timetable has been included to conduct all conferences, hackathons and events. Each time a link has been added with additional information. There is a clear description of the resources needed to implement the proposal. The technical aspects that are crucial for the implementation of this project have been taken into account. The risks and challenges have clearly been considered. A few solutions have already been provided for these risks.", "q1r": 5, "q2": "A road map is available with the associated milestones that will be reached. The project development can be kept up to date in various ways. This is divided into 5 topics in the proposal. The most important thing will be as discussed in the proposal to be very transparent towards the community. The team has ensured that the community can keep a close eye on everything. (social media, conferences,.. ) The petitioner has given a clear description of how he will grow the Cardano community and help ongoing projects. The solution that has been offered will have a very large impact if the right projects are given extra help. I would certainly fund this project because the goals that will be achieved can be closely monitored.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 7080, "q0": "This proposal has clearly defined a problem that needs to be solved. Cardano is missing a resource to send community members to in-person conferences. This proposal aims to send Cardano community members to in-person conferences to accelerate the growth of Cardano. Many community members lack the funds needed to go to these events as prices for tickets can go upwards of 1000 dollars, \nThese large events offer more than just parties and drinks. It allows the Cardano network to grow. It can also be life-changing for individuals attending them. Conferences are great for making connections, and gaining knowledge, and gives you a general idea of where the industry is going. Some people even find jobs at these conferences!. These conferences also serve as great marketing for the Cardano community as a whole. For example, the Consensus conference this year had thousands of visitors. Having great community members at that conference shows the world what Cardano is up to.\nThe proposal also explained to us ways they will be able to scale in the future. They will find additional partnerships or sponsorships to fund this, participate in future catalysts funds, and as well as donations from community members. \n\tCommunity is what is going to drive Cardano forward and this proposal is all about community, I can’t really think of any other chain that has something similar to this. This proposal if funded will show people how much Cardano cares about its members. \n", "q0r": 5, "q1": "\tThis proposal has provided more than enough evidence that it can deliver the things it says it will. It is asking for 500,000 to purchase tickets for Cardano community members. They listed all the major events they plan to send them to alongside details on how much funds they are going to allocate to each individual event,\nThe team at Snapbrillia and the team at TheHIddenOrder will be working together on this. Both Snapbrillia and TheHiddenOrder have team members with years of industry experience. Snapbrillias Ceo/Co-Founder is Ninh Tran who previously co-founded the industry-leading ATS system HireEz. The founder of TheHiddenOrder is Timothy Vang who was previously a project manager working with organizations such as Lockheed Martin, Boeing, and Red Cross to bring vaccines to over 13 million people in Tokyo. \n\tThey also listed many potential challenges they might face and how to mitigate them. One major challenge they bought up was the potential of bad actors snatching up free tickets to sell or using a bot to take all the tickets. They are planning to launch this service on Snapbrillias bounty network that was previously funded in Fund 8. Their bounty network will have Atala Prisms DIDs incorporated in them for identity verification and have ticket recipients meet them before or at the conference to get their tickets. The team that is behind this proposal, the fact that they understand the challenges ahead of them and proposed solutions to them, and their proven record all give me confidence that the proposal will be implemented once it is funded. \n", "q1r": 5, "q2": "\tThis proposal has provided a sufficient number of ways for community members to audit its progress once it gets funded. They have clearly listed all the events they plan to send community members to as well as the major milestones they wish to achieve. Their major milestone is sending 500-1000 people to conferences. They also provided ways to prove that they actually gave those tickets out by having Video/Photo testimony as well as a write-up by all ticket recipients. \n\tThey are going to do demos and progress updates in After Town Halls bi-weekly or at least once per month. During the breakout rooms in the Town Hall meetings, community members can directly ask the co-founders and core team members any questions they have. They did this and are still doing this with their previously funded proposals. They are also super active in the Catalyst community. Their team members can always be seen in the Catalyst Town Hall meetings. \n\tThey are active on social media. In the proposal, they posted links to all of their social media channels. I am on their discord server and many of their core team members are active on it. Any community member at any time can hop onto their discord server and ask them about their progress. They are very transparent and open about where they are currently. \n", "q2r": 5, "assessor": "z_assessor_2873", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 5703, "q0": "The issue we face is that, as a brand-new Cardano dApp with a strong desire to expand quickly, we lack the go-to-market resources to send the Cardano dApp community to conferences and 100x user adoption and revenue in the coming few months. In order to address this, the proposal suggests that the Cardano community exhibit at significant industry conferences with free tickets in order to spread the word about the Cardano Ecosystem, get to know one another, and pitch the idea to decision-makers in order to get 100x user adoption and revenue. Although Cardano has a very strong technological foundation, we still need to improve our marketing efforts in order to reach more investors and users and provide them a better understanding of the Cardano ecosystem. This proposal is a start in the right direction. We will be able to attract more members and draw in new investors by being able to reach more people and investors, which will be incredibly beneficial to the expansion of the Cardano ecosystem. The proposal's main metrics and goals are aligned with the issue we are trying to solve. There have already been many events that have been a huge success in the past, so more events like these can be held in the future as well, so this proposal can be scaled to meet future requirements. It can be concluded from this that the proposal does, in fact, address the issue.", "q0r": 5, "q1": "The proposer and their team have knowledge of and experience with implementing blockchain and artificial intelligence (AI) solutions in the fields of healthcare technology, finance technology, e-commerce, legal technology, non-profit technology, and human resources technology. Additionally, they were successful in operating $60 million funded AI and Web3 startups. Being a well-known and involved community member, the proposer. It can be said that they possess the necessary expertise and experience to successfully carry out this proposal. The proposer is qualified to determine the kind and quantity of individuals needed to carry out the proposal successfully. The proposer has provided a very detailed budget breakdown, taking into account all possible expenses that may arise in order to successfully implement the proposal. Having gone through the budget breakdown with still few things to be determined. The requested budget appears reasonable given the work that needs to be done. The proposal does include a very clear realistic plan of events to carry out. The plan also includes event dates as well as relevant links related to the event that explain about the event and what to expect at the events. The proposer has identified all potential risks to the proposal and has provided solutions to mitigate those risks. There will also be dedicated Full-Time Teams in charge of managing this project. Based on the observations made above, it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal does include a very detailed timeline with events and their relevant links that explains the event. This would be very useful for tracking the project's progress. In order to make the project's development and impacts more audible, the proposer has also mentioned the following: funding handled in an open and transparent manner, monitoring conference exhibit revenue, keeping track of conference attendance, Cardano ambassadorship and their impact, as well as involvement of the community. All of this will be valuable for evaluating the project's progress.  The project's proposer has also outlined its objectives, which include empowering the Cardano community to become active Cardano ambassadors, supporting the launch of more dApps and projects, and securing the long-term viability of the entire Cardano ecosystem. The project also aims to assist current Cardano Ambassadors in developing the following generations of superstar community-grown Cardano ambassadors. The metrics for key performance indicators provided are very detailed and well thought out. The proposal includes a number of social media links where regular project updates will be posted and can be easily followed. The proposal also includes very detailed sustainable development goals and sub-goals. All of this information should be sufficient to audit the proposal's progress and success.", "q2r": 5, "assessor": "z_assessor_2736", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 14389, "q0": "Cardano’s community is in a rapid growth stage, where it is really in need of being more well-known and on the radar of the tech community. Therefore, investing capital in making Cardano’s name more widespread is a crucial step in the success of dApps at Cardano as well. This proposal, amazingly, hits the right spot and lists out a profound solution. The more people know about Cardano, the more popular dApps at Cardano can be. As I can see from the proposal, all challenges while conducting it are spotted. From the proposers are accurate about the future successful pictures of this project look like, I firmly believe that they are on the right track and solving the right problem, which is a vitally important point that, sometimes, other projects might overlook.", "q0r": 5, "q1": "In my opinion, although there is still some vague information that is needed to clarify, the project is real potential and can be successful. Their timeline is thoroughly broken down in terms of date and location. All the chosen places, moreover, are carefully picked by the team, and, to my knowledge, they are all leading conferences and summits in the tech world such as Blockchain Expo and Standford Science of Blockchain Conference. In addition, all proposers involved in this project are well-equipped with past successful experience in Consensus so that they can ensure that this time they can pull this off again. The positive feedback from the last conferences once again enhances my belief in the success of this proposal.  ", "q1r": 5, "q2": "Concerning auditing, every milestone and timeline is recognized. Furthermore, from my point of view, the proposers identified all key metrics and KPIs, which can enable the auditing process easier and smoother. What I like more is that the budget allocations are broken down into rough numbers so that supporters can know what the proposers zero in on for this project. Especially, more than 40% of invested capital is used for community funding, a good sign that proposers do what they preach about letting their community stronger and meeting like-minded people. And the stakeholders put real effort into transparency and community involvement, where they host a variety of online meetings to receive feedback and update their progress. The audit process for this project is crystal clear!", "q2r": 5, "assessor": "z_assessor_4025", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 14432, "q0": "This is a robust proposal that addresses the exact challenge of how to empower and make Cardano’s community more widespread. Some people overlook the imperative of community and cultures; however, in fact, it is the most crucial thing and stakeholders need to make it right and keep it on track. The proposal intends to solve the issue by exhibiting at selected famous and important conferences, where the community can meet like-minded people, which is a clever way. The plan is well-articulated by seasoned executives with rich experience hosting events and success in many. All key metrics and goals closely align with what the challenge requires, which is a necessary bonus point for this proposal. I do not doubt how effectively the team can solve this issue.", "q0r": 5, "q1": "First of all, I have heard of Consensus and it is solid proof that the team thoroughly understands what they have to do and achieve for these events. All stakeholders involved in this proposal are experienced and talented, which enhances the success of this project. Although the team still needs a full budget to plan ahead, the timeline is laid out and explained as much as they can, but it is quite obvious what they are going to do with the fund. In addition, in my opinion, almost all related risks and issues are identified and the solutions are given out by the team despite the shortage of information. I truly believe this proposal will achieve most of its targets.", "q1r": 5, "q2": "I believe that the metrics and KPIs picked are good indicators for evaluating the success and progress of this proposal. The roadmap and date are very well written, which can be easily understood and kept tracked by supporters. We can even know what success looks like for the proposal because the reason why is the most important and supporters can always be aware of the time when the team diverts from the original path. Snapbrillia Demo and Town halls are brilliant ideals so that there is a feedback loop among the community and proposers. There is also a discord server where everyone can discuss and keep posted regarding the project. Overall, the auditability of this proposal is excellent, in my opinion.", "q2r": 5, "assessor": "z_assessor_4052", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}], "solution": "Exhibit at major industry conferences with free tickets for the Cardano community to share the Cardano gospel, meet each other in person, and sell to decision-makers to 100x user adoption and revenue.", "experience": "We are a diverse team of four self-taught founders with over 97 years of combined experience learning and implementing AI and Blockchain solutions in Healthcare Tech, FinTech, E-Commerce, Legal, Non-Profit, and HR Tech. We successfully ran $60 million funded AI and Web3 startups."}