{"id": 413960, "author": "konmaorg", "title": "GameFan-Gaming & Esports Fandom", "url": "https://cardano.ideascale.com/a/dtd/413960-48088", "category": 26595, "amount": 500000, "description": "Fans do not necessarily have access to their idols, No revenue stream for Pro-athletes & teams other than sponsorships, Highlight content that hasn't been monetized , lack of gaming communities on ada", "f6_no_assessments": 8, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"id": 2381, "q0": "We observe that the central idea of the proposal captures a real need, since the gaming and esports ecosystem still does not take advantage of blockchain-related technologies on a large scale. In fact, it seems quite possible to develop new forms of monetization using NFT's and other ways to integrate players and fans. So we have that the proposal actually fits the objectives of the challenge in which it finds itself. However, we see that a very general plan is being implemented to try to create a new scenario. But given that this is a very innovative model and this idea will still be initially explored, we have that maybe the budget being requested is too big, as well as the ideas being planned seem too broad, which puts in doubt if this idea will be able to cause a positive impact.", "q0r": 2, "q1": "Given the vast technical characteristics of this project, it is interesting that the team of professionals involved also have good knowledge in this area. In this regard, we found a team with excellent technical skills, including CVs so that their professional experiences could be proven, which certainly counts as a positive point. However, the biggest source of concern about this project, as mentioned above, concerns the steps chosen to bring the proposal to life. It seems that building a marketplace, community utilities and the amount of licenses being acquired are all too grandiose for a project that still aims to establish a concept. We believe that it would be more viable to choose some of these actions so that the concept was initially validated. This would also lessen the costly $500,000 capital amount being required. We believe that the possible financing of this amount would remove the possibility of several other proposals being made viable.", "q1r": 2, "q2": "Regarding the metrics chosen to monitor the evolution of the project, we see that relevant parameters have been defined and that actually indicate the level of engagement that is being obtained by the platform. We also see, in relation to the perception of success, that goals were established to be achieved, that is, values were defined to be achieved by such parameters after 1 year. We believe that this is a good way to monitor the progress of the project, but we see that in general the goals set seem very grandiose for a first year, which once again enters the scenario of very large actions being taken.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3592, "q0": "Developing a Game platform for the game fan community of 2.7 billion gamers worldwide.\nGenerate revenue from the platform's operations, not dependent on the supporting budget.\nDeveloping the platform on the Cardano ecosystem helps to reduce future scams and hacks. The project will also help migrate 2.7 gamers to Cardano.\nThe proposed solution is as follows:\n- Provide all game & e-sports content for free\n- Just owning 1 of GameFan's NFTs will allow fans to access real-world benefits => grow the gameFan club\n- Developing GameFan Virtual City, this is the main source of virtual land sales of the project\n- Development of a common decentralized autonomous market game platform.\n=> The solutions have specific practical examples so that the community can imagine the benefits of participating in and GameFam.\nSpending a lot of money on owning a 4-year exclusive license, $ 300 million will be spent within 6 months, the number is too large and too risky if the platform does not develop as planned.\nPassive in technology, projects that are not active in technology still have to rely on other technology companies.\nCommunity acceptance, smaller competitors.\n=> Very very very real and problematic risks to the project,\nAnother risk in my opinion is that blockchain is still not allowed by law, so does developing it with traditional channels get approval from the media as well as the law?", "q0r": 3, "q1": "The capital applied for support from Catalyst for this project is $500k, a huge number. Most of the budget in the rounds is spent on licensing more than 50%, As already spending money on this license is very risky with 300 gaming licenses.\n A detailed plan with 6 stages of trying with the proposed solution has been outlined. The application for a permit is granted in parallel with the construction and development of the project. The question arises if the license is not received, what will the project be like, stop or continue.\nThis plan affects the feasibility of the project.\nWhat if there is a conflict with other developers, can the project team actively build the project to continue?\nThe experience of the team members is very impressive, rich in experience in the electronics market. This is an Indian project.\nBecause I am a bit confused in the problem of combining virtual and real utilities, I agree to rate the transparency of the proposal 50%", "q1r": 3, "q2": "The project KPIs are clearly set out for each item, and the community can check and measure the progress of the project, provided that the project publishes business results, ownership licenses, detailed reports of funds funded. disbursed aid.\nSpecific numbers demonstrate the success of the project. If the project is successful as proposed, then not depending on the request for funding support from Catalyst will be correct with the proposed problem.\nThe project detail tables given from the success measurement criteria, the spending measures to measure the project progress all show the transparency of the project. Good luck with your fundraising proposal", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7454, "q0": "After reading through your entire proposal, all I got the feeling for was you want to create an Esports company with an NFT attached to it. I don't think that will really take care of the problem of bringing people into the ecosystem of Cardano other than giving them \"loot boxes\" to buy in order to have any sort of perks. This type of project would not be healthy for our ecosystem, as it isn't sustainable without endless consumerism. Personally, I believe that we need to get as far away from that as we possibly can. You are also biting off way more than you can chew right off the bat. I think creating an ecosystem and starting to grow it with self funding first to have a platform to show for your hard work you would be better off. Brands take time to grow, and as an e-sport brand, you will have A LOT of competition. Twitch.tv is an absolute titan, and taking over that kind of space is going to prove damn near impossible without some time and effort into putting in your initial roots. Maybe focusing on building your DAO first will help your chances in getting funded. 500,000$ is a lot of money to ask for in this type of industry.", "q0r": 3, "q1": "Your team is not fully doxxed, which to me is an IMMEDIATE red flag when you are asking for the kind of money you are. I think your goals are way too lofty for how much funding you are asking for. Something like this would likely take hundreds of millions of dollars to even gain a small portion of the market share of a company like twitch. I value your aspirations, and I think you are able to achieve them. I just think you need to focus on building from the ground up for something this big if you plan on truly creating the titan you hope to create one day. Funding through NFT sales is simply not sustainable, especially as flooded as our markets are right now for the demand. The world is in a recession, and things like this will take a lot less priority for quite some time. I wish you the best and hope you come back and try again once you have established a good stable ground to springboard off of.", "q1r": 2, "q2": "The metrics you provided to track are actually spot on. I think a project like this would be easy to be transparent in showing where funding is going. The one thing I am worried about is the amount of payments delegating to paying workers. It is hard to show the work hours put into projects like this because of the nature of the work. This is why I think you would be better off starting with volunteers to work free on your dream and become a vested part of the interest of the company. That way, they are rewarded for the success, and driven to help you achieve your goal. Doxxing your team is SUPER important when you are asking for this amount of money. You have to understand that crypto is so full of shady characters trying to scam something for nothing. You could be completely legit, but because I cannot tie you to a real-life identity in some cases I do not feel comfortable granting this kind of money to you. I am a project ambassador for the blockchain website Chain Lobby that will be releasing soon, and having become a vested part of volunteering my time for the platform, the company has saved tens of thousands of dollars. You need to find people that are interested in your vision and inspired by your leadership if you want to build something truly world changing. I wish you the best and hope you come back!", "q2r": 2, "assessor": "z_assessor_2895", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7958, "q0": "The problem that this proposal will address is that fans will not be able to access their idols. There is also no revenue stream for Pro athletes and teams other than sponsorships. The solution to this problem is to create a community fan platform for fans to connect with their idols. A new income stream will be created. (+ sponsorships) The platform will serve 2.7 billion gamers worldwide (+ esport fans) So this project can add significant value to the cardano ecosystem. It is good that different revenue channels are included. ( NFT sales, virtual land sales, 5 percent commission from fans sales in the market) The website https://brieflink.com/v/aotc0 lists the statistics and goals of the proposal. These correspond to the challenge setting outlined. Key future challenges are included such as Capex, technical advancement, adoption community and smaller competitors. The authors of the proposal always offer a possible solution to this problem. There has clearly been thought about how these challenges can be solved.", "q0r": 5, "q1": "Evidence is included of the people who will be working on this project. The relevant experience of these people is included in the proposal. (Linkedin) All members of the team are listed on their website (https://brieflink.com/v/aotc0) The team receives support from external companies for all parts of this project. For example for Tech there will be support from Konma Labs and individual advisors. In this way, the submitter shows in a recognizable way that they receive support from all angles. The budget breakdown states that the money will be used for the team's salaries as well as other operating expenses for setting up the business. It might be helpful to break down the $500,000 budget a little more clearly. This financing will be part of the 1 million needed to start up the company (salary, operating costs, software,...) This budget seems to me certainly sufficient to start up this proposal. Second funding will be required once project milestones are reached. The proposal has a clear implementation plan that shows what will be done and how. The technical aspects are included for a good implementation of the project. The risks are included in the proposal with a possible solution. This has already been described in the particle impact. In order for this project to succeed, it will be very important to involve enough well-known gamers in this project. That way it will be possible to get this to the fans as well.", "q1r": 4, "q2": "A roadmap with milestones is included. Work will be done in 6 phases. There are clearly milestones included that are certainly achievable per phase. The project is very transparent. The KPIs that are included are tracked via GameFan platform Analytics. The KPIs that are included are very ambitious. The goal is to have a turnover of $1 billion in one year. Hopefully this is possible, but it seems like a lot. The project proposer has clearly defined the problem. (new revenue stream, bringing fans closer to their idol) This platform can provide a solution to this problem. It will be very important to involve as many famous gamers as possible. Proper marketing of this product will be very important. Their website already clearly describes how popular esports is. I am a gamer myself and will definitely be interested in the NFTs that will be made.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8759, "q0": "They talk about how there are scams in digital gaming but it seems like they are looking to start off with meeting expectations and then spiraling away from their original idea.\nSince they say that they will get outside help from technology companies which they have deals and licenses with, they believe that in the near future, these companies will still be relevant and will still be willing to cooperate even though maybe this idea will soon be forgotten. Or the opposite, more competitors will come up and those companies will want to work with them instead.\n\nOne of their revenue streams relies on NFT sales. They don’t talk about what kinds of NFT’s they are going to sell so how can we be sure that the sales even happen? There must be an incentive for gamers to buy and sell those NFTs. I understand that they have licenses and can create unique products but if their main goal is to help gamers communicate with their idols, getting them to trade NFT’s seems like a far-fetched plan. However, if this goes through and creates a new revenue stream for professional gamers, it would drastically change the outlook of the public view on esports. \n\nThe majority of gaming meet-ups occur with yearly conventions. Since the pandemic is close to over, people are more likely to fly out and go to physical conventions instead of join online events. A valid point stands for the use of these NFTs in which the holders will get VIP access to the events. But in reality, this is no different to classic events where attendees have to pay extra to get VIP access.\n", "q0r": 3, "q1": "The roadmap they explained seems confusing. The platform will launch at the end of 2022, but the licenses will not all be there. The more time they take, the more I believe their competitors will try to take over their users. They talk about a “Beta App”. Is this a mobile app or just the name of the online platform? They don’t specify this in their proposal.\n\nHow will they implement this idea while simultaneously working on their other Fund9 projects? There doesn’t seem to be a roadmap on how these projects will or won’t collide with each other. The funding they request probably will be split amongst these projects because the amount they ask seems too much for just one project. Their team size is 14 and they are asking for 500K$ which in my opinion is more than enough to pay for their salaries considering they have many other proposals. If they succeed in achieving their funding goals, it is likely that their project will be implemented.\n", "q1r": 2, "q2": "The most probable way that this project will generate revenue is if all the users that follow GameFan buy and sell the NFT’s that they create. All the stages go live within a year but their projected revenue in one year is 1B$. This doesn’t seem like a realistic number. Only the even top gaming distributors generate that much revenue in one year. The KPI’s they listed are logical but since their main goal is to make money, these trackers are just for show and nothing else.", "q2r": 1, "assessor": "z_assessor_2998", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11309, "q0": "Sports and gaming are two very big industries in todays world. Having a platform such as is presented herein would definitely help in getting people and projects over to the Cardano ecosystem. Iif only a part of this industry can be tapped, it would bring a lot of people and projects to the Cardano blockchain as well as add a lot of value.\n\nThe challenge category is Daaps, Products & integration and a couple metrics for this category are:\n- Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases.\n\n- Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products.\n\nGameFan club is a unique fan membership club, which give fans access to a plethora of utilities by merely owning one of GameFan’s NFT’s; some real world utilities examples are VIP access to esports events, meet & greets with gaming & esports celebrities, signed merchandise, access to GameFan club gatherings/parties.\n\nAlso keep in mind that GameFan is a fan platform for 2.7B gamers worldwide (including 400M esports fans) that lets these fans celebrate gaming & esports fandom in the most innovative, engaging and fun ways. \n\nThis would help enrich the Cardano ecosystem on the gaming/esports side of things and integrate real world with the digital world.\n\nThis proposal effectively addresses the challenge.", "q0r": 5, "q1": "Total gaming & esports industry experience - 30+ years\n\nOverall Total Team experience - 50+ years\n\nTotal Team Size - 14 (excluding partners)\n\nCurrent Full time colleagues - 4\n\nCurrent interns - 5\n\nCurrent advisors - 5\n\nCurrent partners - 5\n\nThe experience on the team alone would nearly guarantee its success, however it is also mentioned that they, given the scale of the project, we would need a second round of fund once we reach the milestones set out for this project. However, it is also important to understand this need for a second round of funding would only be needed \"after\" they have reached the milestones listed. The team also has partners that they can reach out should they ever have a need to.\n\nThe timeline/roadmap/plan of this proposal is very well detailed, broken down into milestones, timeframes are given, and the plan itself is achievable.\n\nThe budget is well thought through, broken down into cycles time horizons are provided, and the budget itself is reasonable to accomplish the proposals goals.", "q1r": 4, "q2": "Auditing this project would be easily done through their \"milestones\".  However the proposer went ahead and gave us metrics that they will be tracking to determine the progress of the proposal and its successes. \n\nThe proposer also gave us a clear picture of what the success of this proposal would look like when complete, but did not give us a way for the community itself to track the progress and success of the project. This is something the proposer should add to any future proposal.\n\nI agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12323, "q0": "I believe the proposal tackles the idea that is in line with cardano's objectives. The proposal seeks the need for a gaming community on ADA. Times have changed. Gone are the days when games where for the kids. Today games are played for entertainment and fan by both adults and kids. The gaming environment is used by many hence people pay to play games and use some game services. The proposal provided a solution to create community fan platform. The idea falls in line with project catalyst objectives and this will go along way lead to the adoption blockchain payment systems. The proposals provides information for gaming fans to access these platforms while using ADA. I think fans and game enthusiast using this platform will drive revenues for the project. The proposal provides key metrics and goals that gave first hand NFT sales and first hand land parcel sales. I believe the proposal addressess the problem and is aligned with cardona's objectives.", "q0r": 4, "q1": "The proposal provided the necessary information needed to its implementation. The proposal gave evidence(references, links) relevant skills and experience of team members on board.The team knows the team and the number of people needed to achieve its goals and objectives. The proposal also uses partnerships and industry stakeholders in order to implement. The proposal provides a budget that gives the necessary information. I think the team have shown details of items and further broken down into smaller items. Furthermore, the proposal has provided a laid down plan on how the project will kick start and resources will be allocated to the goal of the project. Its timelines has been put into phases and clearly shows what it intends to achieve at the end of each face. The proposal considers risk that could hinder the implementation of the project. However, the proposal gives how it intends to address these risk. I believe if the proppsal receives the needed funding, the project can be implemented.", "q1r": 5, "q2": "The proposal addresses the problem and has provided the information needed inorder to implement. The proposal is in line with project catalyst objectives.The proposal gave a clear roadmap on how the project activitiess are going to be laid out. These have been outlined into phases to be able to achieve its objectives. The proposal has provided key performance indicators (KPI's) such as revenue, investments, profits, registration, liscences,active users, NFT's minted, active users, NFT's pack sold, ecosystem liscence and transactions. I believe the proposal has provided the necessary information needed inorder to achieve its stated goal if implemented.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13159, "q0": "IMPACT  Rating of 5 (I strongly agree )\n\n\"The issue described in this Proposal is well suited to the challenge. Because GameFan is a fan platform for 2.7 billion gamers worldwide. The platform has received exclusive top 300 global esports and gaming licenses with less than 500k followers. It aggregates fans of these licenses on our platform and sells NFTs created on the privilege content to fans.\"\n\nThe Proposal for GameFan's NFTs aims to give fans access to many conveniences by owning an NFT. Some examples of real-world amenities are VIP access to e-sports events, meet and greets with celebrities in the gaming and e-gaming fields, and access to GameFan club gatherings/parties. Although GameFan is not yet a cutting-edge technology company, GameFan will rely on the Cardano Platform to build the best technology and a long-term partnership with Cardano to create the best products for the GameFan community. Moreover, Cardano can help GameFan's foundation for future hacking scams in the GameFan and Cardano communities.\n", "q0r": 5, "q1": "\"First of all, GameFan is already a fully developed project; GameFan is set up as an NFT aggregator in the gaming and eSports fields. The information about the team described in the Proposal is detailed, and the related experiences and the work done show that the team is fully capable of developing this work. The Platform Timeline is divided into 6 phases leading that the Proposal provides a logical and convenient plan for implementation, showing what is being done and how. The Proposal clearly explains technical aspects such as architecture, language, and technology if they are essential for execution.\n\n\"The information about the team described in the Proposal is detailed, the experiences described and the work done to show that the team is fully capable of developing this work. The budget analysis table with two rounds, the Pre-seed round and the Seed round, is very detailed and rigorous. The budget analysis has two more series: Series A: $152M (includes a token round) - Nov 2022 - to be used for preeminent for CAPEX, 80% to be used to sign 150/300 ecosystem licenses, the remainder 20% for platform development + open for next one year, Series B - $150M - Jan 2023 - 95% to be used to inscribe 300/300 ecosystem licenses 300/300 + remainder 5% assigned to a product development fund for Gamefan Metaverse. The project has a tight budget; the roadmap has been carefully prepared, clarity on time, goals/timelines to be implemented over time.\"\n", "q1r": 5, "q2": "AUDITABILITY  Rating of 4 (I agree)\nThere is clarity in problem descriptions, solutions, and how the Proposal fits into them. The roadmap is very well designed, with clear goals for the next month.\nThe indicators and KPIs have been carefully selected, and I believe they are good indicators of success, as the chosen outputs will indicate the number of GameFan users.", "q2r": 4, "assessor": "z_assessor_3582", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Creating a community fan platform for fans to be able to connect to their idols\nSponsorships will not be the only revenue stream\nCreating a new revenue stream by monetizing highlight content", "experience": "GameFan has a team of professional Esports athletes, game developers, marketing strategists, seasoned gaming industry experts teamed up with Konma Labz for technical support for building on Cardano Blockchain.\ndetailed info of team provided below"}