{"id": 414032, "author": "lpmaho", "title": "EternalSwap - Perpetual Swaps dApp", "url": "https://cardano.ideascale.com/a/dtd/414032-48088", "category": 26595, "amount": 66800, "description": "Cardano's DeFi ecosystem is rapidly growing. However, it lacks several advanced trading vehicles such as perpetual contracts.", "f6_no_assessments": 13, "f6_rating": 4.384615384615384, "videos": [], "media": [], "f6_assessments": [{"id": 1498, "q0": "It is common knowledge that the Vasil Hardfork will take place at the end of June. This event will mark a significant turning point in the rate at which transactions are processed on the Cardano network. In addition, make requests to support high-frequency trading in a timely manner. The proposal was also well received by the CAs in Fund 8, but it did not receive funding due to unforeseen circumstances; and now we find ourselves with you in Fund 9! Building a decentralized application (Dapp) that allows users to \"easily transact with their stablecoin collateral, forget about slippage and impermanent loss, apply leverage for efficiency, higher capital utilization, collateral protection through partial liquidation and insurance funds, participation in trading contests and other incentives\" is a very reasonable proposition, so that long-term investors as well as short-term investors can increase their assets. This is a large-scale proposition. The group has proposed a concept that they call \"perpetual contract.\" Although it may sound very novel, if they are successful in building Dapps, this may be a way to solve the issue of slippage as well as the loss of assets that occurs during trading. Building a Dapp with such outstanding advantages is not only necessary but also reasonable. Not only does it meet the requirements of the vast majority of investors with regard to transaction fees, as some existing DEX exchanges do, but it also reduces the likelihood of price slippage. The proposal also provides an in-depth analysis of the challenges that will be faced by the team, as well as reasonable suggestions for overcoming those challenges. This is a suggestion that I personally appreciate a great deal. Therefore, I give this effect a score of 5 points.", "q0r": 5, "q1": "This group discusses the challenges that existing decentralized applications (Dapps) are up against as well as ways to maximize the benefits for investors and businesses. Regarding the expense of developing a Dapp, I believe that the amount of $66,800 is an acceptable amount. Additional Comments: The group has provided the price ranges for each item; however, in my view, the group ought to divide each item so that it has a different price. The team has included the cost of all items in a single estimate, which includes the construction of the project's framework as well as the technical stage of the project, which you should break out separately. About the team working on the project: MLabs Public Simply being the most successful developer in the CARDANO ecosystem is sufficient evidence for us to acknowledge the high caliber of the members of this team. I have personally verified that each link leading to a member of the group's personal email address is accurate. Therefore, I will award this feasibility four points.", "q1r": 4, "q2": "All of the work that has been done and the progress that has been made on the project have been made public on the network platforms and on the project website. Most importantly, the project has had a significant impact on the community in terms of the effectiveness of its use, the community's ability to use it, and the community's participation in the project. I believe that it is essential for a project to be successful in order to have a timeline to measure the success of the project. And finally, once the project is finished and made available to users, it will most likely be well received and supported by users because Dapps will have powerful and superior features. In light of this, please give this AUDITABILITY section 5 points.", "q2r": 5, "assessor": "z_assessor_2254", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2134, "q0": "This is a well put proposal and voters should note that the meat of details can be found on a previous submission of \nthis proposal here https://cardano.ideascale.com/c/idea/396602.\nProviding a crypto alternatives to future trading while providing a solution to the vMMA for slipage and the lack of being permanent.\nIt is clear that the proposar knows lots about defi and finance but i would have loved to see that security was addressed as it can \nalso be a big problem with defi projects lately.\nLooking at the risk and challenges section, there seem to be a dependency of this project to the scalability of hydra (to support high-frequency trading) and though it is \nstated that the proposal engineering team are engaged with the Hydra team, still makes it difficult to put the success of this project completely in its hands\nand in turn will make this project unsuccessful if the hydra team don't scale quick enough.\nIt will also be good to highlight the engineering problem associated with achieving a scaled throughput with Hydra (being a curiours engineer/programmer).\n\nIt should be noted that this same team are currently working on a funded project and are submitting requests for more than one proposal in this fund also. \nIt will be important considering the above to highlight how the team intends to manage each project in a situation all are funded as it might be too much opened projects at once.\nAre the multiple projects co-dependent?\nThis is a very clear proposal which fits into this challenge and will increase the utility of cardano to its base and new ones.\nI will be giving a 4 star for impact as the risk and challenges section was not properly addressed.", "q0r": 4, "q1": "The proposal provided Engineering hours in the cost breakdown but fails to associate the provided information in the timeline sections with each activity which makes it \nconfusing to know if the provided engineering timelines is the total timeline for the proposal to be completed.\nThe proposal provided detailed list of team members with verifiable links to prove their expertice.\nConsidering there are no clear dates or timelines provided for delivering this proposal, i will be giving 3 stars as i cannot tell if the project is feasible or not due to unclear\ntimelines provided.\n\n** I will also like to point out to the proposers that it is always good to freshly write project submissions instead of copying and pasting them as it showed all over the various sections as \n\nmost questions asked where not correctly answered and i had to keep going back and forth between this proposal and its fund 8 counterpart.", "q1r": 3, "q2": "In all honesty, most of the responses for auditability did not match the provided questions in this challenge due to copy and paste by the proposer from previous funding application.\nThe lack of organisation of this proposal makes me worry but it provided the neccesarry information for it to be audited .\nI will be giving 4 stars as this project do not respond to the auditability questions 1 to 1 and i had to go back and forth other sections to retrieve answers to the questions myself.\nI wish the team good luck.", "q2r": 4, "assessor": "z_assessor_2301", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"id": 2737, "q0": "\" Proposal presents ideas for improvement, improvement and enhancement of limitations for AMM protocol, a working protocol for decentralized exchange (DEX). This proposal contributes to solving a number of problems. As far as the challenge is concerned, the future of protocol improvements when completed will greatly contribute to the user attraction for decentralized exchanges in Cardano.\n\n    The statements regarding this proposal all have examples and links to the mainnet Cardano development team, AMM is one of the leading protocols used by the decentralized exchange in anti-slipping. of the currencies traded on the exchange, however, there may still be a certain loss for investors when there is a loss of liquidity, so the proposed team has come up with solutions to optimize the unnecessary loss. this. the improvements the team made to the AMM protocol is to skip swapping between stablecoins and tokens, Instead, buyers and sellers come and go with stablecoins and are compensated accordingly performance of their asset's price at the time they left. The special thing is that the improved protocol vAMM does not require liquidity providers. When the idea is successful, it will bring capital leverage to investors and many other effects.\n\n   as required by this protocol, a large transaction speed is required and this is also mentioned in the risk section, but they worked with the Hydra development team (Hydra is an increasing blockchain extension protocol). transaction speed) to best understand the technical requirements of Hydra to avoid unfortunate errors when conducting testing. and according to the Cardano mainnet update, it will be possible for Hydra to integrate in October 2022, it is currently being tested, when the proposal is successful, it will likely be a highlight for DEXs in Cardano. \"", "q0r": 5, "q1": "\" this is an idea that has a lot to do with academia and engineering so it will probably take time, as it will likely have to work through a lot of possible technical problems, and also incorporate the aligning with the Cardano mainnet while waiting for Hydra to launch on the mainnet, it will take time to complete, but the proposed team already has a specific plan for the tasks that need to be done to implement the proposal.\n\n   The detailed budget table has been published fully and transparently, but given the performance and total amount of funding required by the team proposal, it is entirely possible to ask for more for backup purposes. It may take longer than the expected time because of the technical nature of the implementation process, there may be errors and delays, which are normal when it has not been officially put into operation.\n\n    I have seen the list of members of the group on your main page. there are pictures with positions according to each person in the group, also at the bottom of the main page it is said that still recruiting more members for those with expertise and enthusiasm who want to contribute, really great. \"", "q1r": 5, "q2": "\"The proposed team has committed to update the community as soon as possible on the progress of the work, in addition, there are also websites and social pages provided for the community to follow, better than that, we hope that the white paper will be updated on the main page of the group, if so we can spread and learn more research on this protocol.\n\n    The success of the project is a series of Dapps, products that can be integrated using safe and efficient protocols. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 4514, "q0": "I strongly agree that this idea of building a perpetual swap exchange on Cardano is highly impactful, as evident in the traditional financial market as well as in other protocols. This product is an essential infrastructure to enable more frequent transactions, better volume, and liquidity on Cardano DeFi. If it is built right, it will also become a highly sought-after product by institutions, judging from my own experience as an investment professional. This proposal, therefore, meets multiple goals of this challenge and of Fund9, and its potential impact will be expanded to not only the global Cardano community, but also to the institutions in traditional finance who are looking to gain their exposure in cryptocurrency.\n\n", "q0r": 5, "q1": "I believe the deliverables of this phase (i.e., whitepaper, technical specs, and branding work) are feasible with MLabs team. MLabs has proven its experience and commitment to the Cardano community through multiple products, many of which are exchange-related related products. The team provided a detailed and reasonable budget and timeline to deliver each part of the deliverables. Though I have no doubt that they could deliver for this phase, I wish to have more information to evaluate the possibility that they could deliver with good quality. For example, they could have highlighted what algorithms or mathematical mechanisms they are considering to build the vAMM in their whitepaper. As this is a highly technical product with serious implementation risk, I would also expect to see a team member with more direcly relevant experience in vAMM research or implementation. I would suggest that for the following phase, the team would come up with a way to audit their whitepaper.\n", "q1r": 4, "q2": "The deliverables should be well auditable, everyone can see their website, social media channels, technical specs, and whitepaper. Again, I would just like to highlight the importance of quality control for the proposed vAMM. I would suggest the team to further elaborate on \"how success will look like\" in a sense that how the community may know if the proposed whitepaper is the best solution the team could come up with for this product.\n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6773, "q0": "EternalSwap is a trading platform for perpetual contracts. Traders can apply leverage to their deposited collateral transactions, increasing capital efficiency and profitability. EternalSwap allows traders to trade on margin without a counterparty through vAMM. vAMM ensures liquidity & limits capital loss.\nAssets held in liquidity pools can be freely traded as long as their available funds preserve this price relationship. Traders simply lock up their collateral with EternalSwap and price discovery happens without the need for an underlying exchange.\nSince EternalSwap will be required to support high-frequency transactions, there is the potential for Layer 1 network congestion. However, the proposed team has identified this risk and several team members have been working closely with the Hydra team in expanding Cardano traffic and the technical awareness involved.\nThe proposal is described in great detail, persuasively, and in line with the objective of the challenge.", "q0r": 5, "q1": "The proposal mentions what deliverables will be provided if the project is successful, but does not provide a detailed timeline and blueprint for the solution. While the funding proposal at Fun 9 is just the beginning of this project's journey, the team could add a complete work plan so the community can better understand every section of the project.\nThe $66,800 budget is clearly described and broken down by the number of hours required to complete each specific task to deliver the initial building blocks of the EternalSwap platform.\nThe members of the team are all experienced professionals working in this field with the products that have been provided and developed in the Cardano ecosystem. I believe that, with their competence and skills, they will be able to offer the products within the scope of this proposal.", "q1r": 4, "q2": "The proposal mentions that project progress can be tracked through: Branded website, social channels, White Paper finalization, and product development V1. The proposal also briefly outlines the project's success for each timeline: 1 month, 3 months, and 6 months. It would be better to propose adding quantitative information on each measurement with specific metrics and timelines so that the community can easily track the progress of the project and evaluate its success of the project.", "q2r": 4, "assessor": "z_assessor_2829", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7575, "q0": "This proposal addresses a real market need for perpetual futures on Cardano blockchain. If successfully implemented and marketed, this proposal can increase Cardano blockchain usage in both transaction volume and active users. Existing holders may discover long-short strategies, which will increase transaction volume, while existing long-short traders may find additional venue for executing their strategies. Strongly support this proposal ", "q0r": 5, "q1": "First of all it's important to note that this proposal is not aimed at delivering a working prototype. It's aim is to deliver a technical specification for EternalSwap smart contract, branding materials and social media channels. Team has an active website and social media channels, which shows team ability to work with these tools and deliver webiste and social media channels.  Team members have an active github presence demonstrating technical ability sufficient to deliver a tehcnical specification and developers have Haskell experience. While team was involved in similar projects, it would be great to learn what was exactly delivered by team members for projects mentioned (Liqwid, SundaeSwap etc.), that would strengthen the proposal further.", "q1r": 4, "q2": "Team has presented a detailed list of activities with estimates and a high-level milestone plan. Ideally I would like to see a month-by month breakdown of activities. Specifically, technical specification is the biggest chunk of work, but progress will be presented at the end of the project - it would be great to see some interim milestones with interim progress.", "q2r": 4, "assessor": "z_assessor_2905", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7962, "q0": "The problem is that the Cardano ecosystem lacks several trading tools such as perpetual contracts. To create perpetual contracts, the creator of this proposal wants to work with the trading platform EternalSwap. The benefits are included such as flexibility and do not expire. This project will have a positive impact on the Cardano ecosystem. Many people will take advantage of these contracts because they do not expire. The main goals are included in the proposal. The project has already been considered to be financed in fund 8. Some improvements have already been included such as less budget, better controllability. Future challenges are included in the proposal. Scale solutions such as Hydra will be necessary for a successful implementation.", "q0r": 5, "q1": "The team will consist of MLabs. This is a very important development company in the Cardano ecosystem. The company already has a lot of experience with large projects. The core team that will participate in this project is present with associated links. The biggest name in this team is Mark Florisson (founder of MLabs). The types needed to work on this project are clearly shown. There is a clear breakdown of the budget. The budget will be used to pay the engineers. 835 hours seems sufficient to me to successfully deliver the project. The requested funding seems sufficient to me. It will come back for additional funding to become a full-fledged dApp. A timetable has been included. It would be useful to include a few deadlines in the proposal so that there is a little more transparency. There is a clear implementation plan. This will be done in collaboration with Hydra. The funds will be used to pay the engineers. The technical aspects are clearly described in the white paper of the project. The risks are also included with a solution. The main solution is through a partnership with Hydra for better implementation.", "q1r": 5, "q2": "There is a clear roadmap with well-chosen milestones. These milestones are on the project whitepaper. It would be useful to include more specific dates to get a better overview. A few KPIs have been included that will be displayed via social media. It's good that the community can also ask questions in the meantime. Other objectives are included such as capital efficiency, usability and involvement. The core features of EternalSwap are also included and well chosen. It is good that success will be measured on months 1,3 and 6. The proposal clearly describes the problem that perpetual contracts do not yet exist. Using EternalSwap to offer these perpetual contracts is an obvious solution. The most important thing will be to find enough funding and a good community.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8423, "q0": "This is an interesting and practical project for users, I read and found out that it is quite similar to the situation of some private disbursing banks providing loans without collateral too many simple procedures with State banks are complicated because of administrative procedures and collateral requirements that are larger than the capital that consumers need to borrow. Your ideas about the future will be very popular because it is a springboard for us to rely on to develop the financial economy in life as well as contribute to building a part of the country's economy. The experience of your group from formal economists and development groups working together is consistent with the requirements of the project, which mainly revolves around the liquidity economy of future capital loss. The project of my research group I see that I have applied for funding since round 8 but still have not been fully funded by investors, but you have learned from those failures to come to this round 9 perfect and more complete is a very important thing. Excellent in research projects. The solution you came up with is based on the reviews of round 8, so it's quite careful and reasonable after changing, there are still some problems that you are trying to improve. Of all the outstanding problems in the economy, I find that everywhere businesses are very heavy on costs, they have to spend a lot, they do not know what they will gain, but the costs are high, so businesses have to calculate it first. Your project has saved us a cost when entering a contract that wants to change or transfer and traders can apply leverage to transactions involving collateral their deposit, increasing capital efficiency and profit is really appropriate. Your risk is very important. Transactions that are blocked and pasted take time for consumers, but with the experience of your team members, the risk has been immediately overcome, we welcome this way. your quick work.", "q0r": 4, "q1": "Your project has presented all the work that needs to be done and needs to be completed, it will probably take a long time for this project, but I have not seen a specific timeline for you to proceed and do. those things? Can you provide it for users like us who know it takes a long time to complete? is there any problem? Because I find this project quite practical and important for us users, to avoid the long wait without predicting how long it will take for you to complete and put into operation, you can provide We see the finishing time so we can rely on it to prepare to explore and use it optimally. The project topic defines the goal of performing the analysis of each item that needs to be completed to complete the project topic very seriously, this project considers this proposal as a seed funding request. Reading the detailed budget analysis of my group of friends, I see that you take a lot of time to complete this project, especially the technical part requires a lot of time, flexible mind and understanding as well as experience. Only high experience can do them, I admire your group when you know so many technologies. However, I have a little question because I don't understand how \"Change the budget 110 *** \" of this topic? Project topic and members can help me explain?. The group provides full members with individual information and detailed tasks of each person. I hope the group will cooperate with each other to soon launch this project.", "q1r": 4, "q2": "Your idea promises to be as transparent as possible about progress, but I see that you clearly articulate goals, tasks, and budgets for us to see. The success of your project shows how each time you can enjoy and gain from the project's benefits if users participate, it is also a way for us to be attracted by seeing the results that we have achieved. How will it be received? Thank you for your team's dedication! I wish you success!", "q2r": 4, "assessor": "z_assessor_2984", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8558, "q0": "This proposal brings up an intriguing problem. Because several advanced trading vehicles, such as perpetual contracts, are lacking, the author of this develops EternalSwap, which allows traders to trade on margin without the necessity of counterparties using vAMMs. vAMMs ensure liquidity and limit capital loss. The proposal highlights a relevant problem connected to the challenge, and the solution is extremely clearly described, detailing how it solved the aforementioned problem appropriately. The team presented the key metrics clearly, which visibly resonated with the challenge. In addition to this, the whole team knows the possible problems very well and offers concrete solutions. It would be more advantageous to know more about how to avoid layer one congestion. All in all, I believe this proposal is successfully implemented would bring great impact to the Cardano ecosystem.", "q0r": 5, "q1": "As far as I recall, this proposal was in Fund 8. EternalSwap just missed funding despite excellent comments and high CA scores. I hope the team has already updated the plan in greater depth and supplied us with further information to analyze its viability. On the plus side, the team's whitepaper has a comprehensive technical explanation. MLabs definitely has a lot of experience in the ecosystem, having worked on some of the most important Cardano projects. Through their Github accounts, the developers behind this project have clearly proved their talents and offered a great deal of transparency about their skills and expertise. The budget is fair and modest for today's salary for each respective role. The team mentions the overall number of hours worked by the member as well as the hourly breakdown. However, it requires more detailed explanation, such as the number of persons participating in each role and the hourly rate for each individual. The project has a timeline. The phase-wise milestones and the time restriction by which they are to be achieved look to be reasonable as well. Making the progress more understandable. Based upon the evidence available, I am certain that this proposal is one of the noteworthy ideas under consideration for the challenge.", "q1r": 4, "q2": "The team's attempt to convey the concept in a readable manner for both tech and non-tech individuals is very commendable. The deliverables are well-organized, and key metrics are in line with what the challenge is looking for. However, there are no quantitative KPIs provided in the proposal to determine how effective this project is. The delivery dates are not specified either. Despite the downsides, there is a clear phase-wise success definition to measure the proposal's timely development, which is a benefit. There is a plan with simple yet readily comprehensible and verifiable milestones, as well as a clear description of the problem being tackled. I neither agree or disagree this proposal is auditable.", "q2r": 3, "assessor": "z_assessor_2992", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9599, "q0": "The proposal is highly aligned with the challenge settings itself. There are $600 trillion in the notional value of derivatives in 2021 (according to How Big Is the Derivatives Market? - investopedia.com), and demand for futures contracts is also very high even in the blockchain domain (including both CEX and DEX). So I believe the target product will bring useful financial tools for the users and increase Cardano's adoption. By providing the Perpetual Swaps functionality, the number of transactions and total value locked in-app will increase, which is what this challenge is all about. What I am concerned about is the purpose of the branded website, what is it for, is it a web3 where people actually swap on it in the future, or just a place to showcase the project. Because it is not clear for purpose of the website and this proposal only aims for the delivery of technical papers, not include a fully-functional dApp, so for these reasons, I will give 4 stars for the impact of this proposal.", "q0r": 4, "q1": "The MLabs team already has experience in working with several Cardano dApps before (e.g Liqwid, SundaeSwap, Optim e.x) and they are Haskell consultancy since 2018 so they have relevant skills and depth knowledge to implement this proposal. The budget is not broken down into each task. From what I see in the proposal, I only know the time spent on each task and the total budget. So it would be better if the proposer can write more details about how much per hour for each task. For this proposal, they only aim to create a technical specification, whitepaper, build a website, and other branding assets. There is no dApp launch in this step and they also have 110 hours of change budget. For this reason, the provided timetable is reasonable for their ability. The team also mentions the use of advanced vAMM model in their product for trading to prevent impermanent loss which is a big plus in the technology. About the risks, they have considered the scalability issue for a high-frequency trading perpetual swaps app and the provided solution for that is using Hydra to improve the throughput and avoid layer one congestion. But because users are required to lock their assets into smart contracts so another risk I can think of is errors in smart contracts. Maybe proposers need to consider doing peer-review for their technical specifications to achieve more assurance about the quality of their final product.", "q1r": 4, "q2": "Because the proposal aims to deliver technical papers, branded website, social channels and engagements. So there is quite straightforward for the community to check the project's progress. But the proposer needs to be more specific about which social channels they build and the metrics being used for identifying the engagements. Is this Youtube or Twitter or Discord? And what are the KPIs for a successful social channel? For the validation of success, it would be great for the community if the technical specification are peer-reviewed by the experts as evidence of the success of the project.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10327, "q0": "Cardano's DeFi ecosystem is growing rapidly. However, it lacks some advanced trading facilities like perpetual contracts.\nWith traditional contracts, investors can change the risk and return features of the portfolio. Futures contracts are cash-settled at expiration or renewed or transferred for a fee.\nWith smart contracts, EternalSwap is a trading platform for perpetual contracts that makes it unnecessary for investors to transfer expensive.\nThe resulting product is the EternalSwap platform that allows traders to trade on margin without a counterparty through vAMM. vAMM ensures liquidity & limits capital loss. With EternalSwap trading platform matching our Dapps, Products & Integrations challenge.\nThe suitable audience for DeFi investors and portfolio managers looking for a simple way to take long-term and short-term exposure to digital assets.\nThe risk in this challenge is that EternalSwap trades with a high frequency of congestion. Scaling solutions like Hydra for successful implementation, to address this risk the team worked closely with the Hydra team to scale Cardano's traffic.\nI agree with this challenge.", "q0r": 5, "q1": "In the presentation of the progress and the plan, I did not find specific planning information, including specific timelines for the implementation of the plan. In this section, it is proposed to present the ideas EternalSwap helps Cardano such as how, why smart software applications are important, and what the white paper will be covered in detail if proposed The team wants Fund 9 to mark the beginning of this journey to re-submit the proposal. This export is a seed funding request.\n\nThe required budget is $66,800. There is a detailed budget analysis table. This proposal follows on from the unfunded F8. With the idea of ​​​​supporting the community, the team continued to submit this proposal. With funding, there is a reduction in the initial proposal at F8 from $70,000 to $66,800 in which total budget and technical hours are reduced by ~5%. This funding source is used appropriately.\nSee F8 info: https://cardano.ideascale.com/c/idea/396602\n\nThe first team advantage is that Mlabs is one of the leading developers in the Cardano ecosystem, with the largest group of Haskell/Plutus developers in the community. The core team in charge of this project are Mr. Mark Florisson - Founder and CEO of MLabs, Mr. Ben Hart - Head of Cardano Operations, Mr. Maksymilian Brodowicz - Plutus Lead Developer, Mr. George Flerovsky - Delivery Manager, Mr. Luke Mahoney - DeFi and Business Development. They are the founders, managers, and developers...with the experience, techniques, and skills to ensure project completion. All members have clear profiles that can be viewed on github.com channels", "q1r": 3, "q2": "The Proposal with metrics and progress will be publicly communicated to the community through: Branded Websites, Social Channels and Engagement, Completed Official Reports, and Progress product development level V1. (Currently, there are no publicly linked channels in this proposal)\n\nThe desired success of this project is to create a complete, clear platform that helps the community use capital efficiently and promote many effective users for the Cardano ecosystem.\nSuccess with the goal in the next 6 months will be to build a specific website, actively interact with the community, and complete the EternalSwap DApp.\n\nThis is a new proposal. I agree with this proposal.", "q2r": 4, "assessor": "z_assessor_3181", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12737, "q0": "The project adresse the goals of Cardano and the Fund 9 Challenge “Dapps, Products & Integrations”. The team wants to create vAMMs to give traders the chance to trade on margin without having counterparties also vAMMS guarantee liquidity & limit capital loss. This gives traders the chance to buy or sell assets on margin. \nThe DeFi ecosystem in other blockchains is currently by far bigger the the Cardano DeFi ecosystem. By looking at other blockchains you see that there is demand for such products, so it is logical that this DeFi infrastructure could accelerate the growth of users and trading activity. \nBut this proposal doesn´t provide a functional dApp. This proposal make the work before the dApp like launch a website, make social channels, make the technical specification and creating the outline for the dApp. \nThe impact of the full dApp could be high because it there is a big demand from users. And the users want to trade their money on the best and safest website therefore the creation of a good outline is important too. Therefore I strongly agree with the impact.\n", "q0r": 5, "q1": "The Core Team has posted their relevant links, mostly GitHub to proof their skills and relevant experience in creating similar projects like Liqwid, SundaeSwap, Optim… Therefore the project team has the developing and economic/ DeFi skills to create this vAMM. \nThe Budget is outlined. 66800 $ / 835 hours = 80 $ per hour. Their experience explains the hourly pay so it seems fair to me. Therefore the budget is reasonable. The project needs additional funding to become a fully functional dApp. \nI strongly agree because if the skills of the team, the clear budget outline.\n", "q1r": 5, "q2": "The team has provided the timeplan for one, three and six months. The goals seem reasonable. It would be nice to have a bigger look into the future. Maybe some plans when you want to develop the dApp. Please provide some more infos on when you want to use the created knowledge from this fund.\nThe Metrics of success are easily observable but I would have liked to see some specific numbers. For example you could have specialized the engagement on social media like 500 Followers…. \nThey will post development milestones on a social media channel so the development and progress should be observable from the outside. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 14480, "q0": "The goal of the proposal is to create a DeFi solution for perpetual contracts, which are futures contracts without an expiration date or a requirement for rollover. This would be a significant advance for Cardano DeFi and might have a significant effect on the ecosystem as a whole. If implemented, the idea will add a number of really intriguing new characteristics to the landscape and is very convincingly detailed. Since the platform aims to be a viable choice for high-frequency trading, the concern of L1 network congestion is brought up; nevertheless, since the engineers on the proposal team are closely working with the development of Hydra, the product should be ready to launch as soon as scaling solutions are live. This proposal does effectively addresses the challenge", "q0r": 5, "q1": "The team's expertise and track record are sufficient to carry out this plan successfully. Additionally, each team member's github links have been supplied, which is great. The proposal makes a convincing case for the roadmap and the requirement for developing a comprehensive engineering document for technical specification. This proposal just serves as a seed for the product's development rather than serving as funding for the full project. As a result, the suggested budget of US$66,800 is adequate for the required work. All of the specified phases make sense in the context of the broader pre-production stage of the product, and the budget is clearly broken down according to the number of hours needed to perform each work. I am confident that MLabs will be able to deliver on the extent of this proposal given their track record in the Cardano arena. Given their expertise and skills, the deliverables listed on the roadmap have a very high probability of being accomplished. ", "q1r": 5, "q2": "The proposal is clearly quite audible. Their social media channels, which will publish development milestones, will allow you to keep up with the proposal's progress. They also gave information on the project's impact as well as critical KPIs that will be highly useful to the auditors. They have also included a list of EternalSwap's fundamental features and anticipated features. These alone are sufficient to gauge the proposal's development. The goals stated for one month, three months, and six months can be used to gauge how well the idea is working. These details should be enough to assess the proposal's success and progress.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "EternalSwap allows traders to trade on margin without the need for counterparties via vAMMs. vAMMs guarantee liquidity & limit capital loss.", "experience": "Finance and DeFi experts, formally trained economists, and a team of expert Haskell/Plutus developers."}