{"id": 414017, "author": "lpmaho", "title": "MLabs - Embedano (Embedded Devices)", "url": "https://cardano.ideascale.com/a/dtd/414017-48088", "category": 26595, "amount": 96000, "description": "To fully decentralize, the hardware needed to interact with Cardano should be minimal. Though some Cardano projects use embedded systems, best practices are underdeveloped.", "f6_no_assessments": 11, "f6_rating": 4.424242424242424, "videos": [], "media": [], "f6_assessments": [{"id": 82, "q0": "This proposal is very original and has the potential to be highly impactful for the Carano ecosystem. The key requirement for this challenge (Dapps, Products & Integrations) is to promote the development of products and integrations that could help drive greater adoption of the Cardano blockchain. The team behind this proposal desires to create a secure and open-source (extra points for this 😊 !) software platform that would allow for the embedding and integration of devices with the Cardano blockchain. This proposal is both well thought through and well presented with a meticulous attention to explaining in layman’s terms the key advance that the team intends to achieve. Love the Trezor Model T example – and if the voters have time to delve into the proposal – it is a valuable read. Effectively the team intends to develop an SDK for resource-constrained Cardano development that will provide required tools (and extensive documentation!) in Rust code for developers on the embedded systems side to work on high-assurance and enterprise-ready software. The team is planning on following up this proposal later with additional projects to expand the security of the platform and audit it. I think that the proposed impact of the project could probably have been a small notch higher if the team had contacted several hardware developers of production embedded applications to check for some preliminary feedback about their needs – beforehand, so that these needs could be incorporated into the scope of this proposal. ", "q0r": 5, "q1": "The team behind this proposal is an experienced team that has provided links about the competencies of their key members taking part in implementation of the proposals. The company MLabs is well known inside the Cardano world for contributions to developing out components of the Cardano infrastructure and they have submitted proof of their competencies in terms of working with Haskell, Plutus and other programming languages. MLabs works with dozens of developers and has partnered with many key Cardano community projects, including Dexes, NFT minting services and DeFi hubs. The team has broken down the required work for the project into 1200 hours total, with 600 hours going for engineering work and documentation, plus 600 hours of the time dedicated to “change”. The team has addressed the use of the change budget as there is always uncertainty regarding the extent to which Cardano can be transposed to resource-constrained hardware systems. I think it is great that the team has set aside and been transparent about the need to plan for this contingency/risk – especially as MLabs is heavily involved in software-level R&D in the blockchain world. The required $96,000 budget works out to $80/hour for the budgeted 1,200 hours of work. As regards the planning, the team has been clear about explaining their intentions – as this team is clearly competent in terms of the required technical requirements for implementation – including the required technologies and programming languages. I have no doubts that there is a clear feasible path to realization as the team has taken the precautions of budgeting for R&D, and I applaud the team for thinking about how to further decentralize the entire Cardano ecosystem. ", "q1r": 5, "q2": "I would commend the proposing team for making a very good presentation of the problem that they want to address and for explaining even to a layman how they intend to approach the solution. This does not mean the explanation was simplistic, in fact the team has provided such a nuanced and gradual presentation of the problem - that it enabled me to learn more about this aspect of blockchain (Cardano-specific) integration level that I was not really even aware of previously. The proposers have included a list of deliverables that they intend to produce and three-month, six-month and twelve-month milestones. The delivery of the wallet SDK, compatible with the ARM Cortex-M series of processors, is a clear and auditable deliverable. The stretch goal (HW prototype, relying on, e.g., a Nordic nRF52840 development board, that uses the SDK) – seems to remain up in the air as it is defined as a stretch goal – as I am not completely clear on whether it will be delivered – but it probably depends on the outcome of the R&D phase. Overall, the metrics correspond to the projects aims. The way that this proposal is written inspires confidence that the team is very well aware of the new ground that it is treading with the proposed venture into the realm of embedded devices. Special commendation for planning ahead and for laying out a roadmap (not covered by this specific proposal) for further advancing the security of the platform through audit and formal verification, as well as plans for exploring the possibility of running a HW and a cardano-node/mithril-node) on the same device. Can’t wait to see the results. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 4842, "q0": "Well, I think the proposer has an ambious goal about developing blockchain-based authentication for software services for individuals without having to relying on third-party cloud providers. \nHowever, in this proposal, I understand that for the first phrase of the long-term goal, the proposer want to focus on the development of the Cardano Embedded Rust SDK, an open-source platform for resource-constrained systems to interact with the Cardano blockchain. The inspiration came from the current problem that projects using embedded systems are subject to resource-constrained settings such as network band-width...\nFirst, the proposer states the problem very deeply with a case study of how individuals and organization can custody funds so that only authorized users can assess them. By suggesting some current solutions such as Trezor or Ledger and analysizing their limitations of Trezor at the softwware level, the proposer gives an idea of building a HW designed from the ground up for Cardano community, but the proposed scope of the project could be expanded in the future. They seek to help developers overcome the hurdle of  poorly-defined pratices and enable them to use Cardano everywhere even with the smallest and most resource-constrained system. This shows that the proposer has a very good understanding of the technical issues and the current problems. \nTherefore, for the first phrase, the proposer plans to develop a wallet SDK - a tool that can be used by developers to design their own HWs. I think this tool can have high chance of applicability for developers and individuals and this is a very promising project which could increase the utilization of embedded systems on Cardano as the existing tools stated by the proposer are not accessible for individuals and smaller organizations.\nMy concern is that this proposal is the first phrase of a bigger and long-term goal of the proposer and we could see that there are many risks or unanswered questions stated by the proposer for this project. I understand that these risks are unexpected and I would like the proposer to explain more how to mitigate each risk. This show that they have a good preparation for carring out their project in the future and make a good move before turning to the another phrase.  After all,  I fully support this proposal and hope it successfully. ", "q0r": 5, "q1": "Well, the proposer gives all the basic information regarding the plan, budget and the team which shows the feasiability of carrying out this project. However, I believe they could have done better by adding more details in some parts, in order to generate a better understanding of the whole development process of the project, the use of the budget and the team ability. I suggest the proposer should make plan more visually by infographics for community better understanding and following your project easier. Starting with the plan, the proposer devides plan into 3-month period within one year, but I'm not sure when the project will start and finish (from which month/year to which month/year for each period), I mean, the proposer could do it more clearly about the timeline. Moreover, the proposer should give each task more detailed for each period. For example, the proposer said they will begin to develop features for wallet SDK and it is possible to build the code, but I wonder what kind of features they will develop for the wallet? And who will be in charge of building the code? How will they do that?. Also, I think the proposer should have detailed marketing strategy for project when the platform is ready for use. I am not clear about who will be in charge of documentation and blog posts?. Regarding the project's expenses, the proposer claims a total cost and total engineering hours, and gives total hours for each main task which I am appreciated. But I would like the proposer to show clearly how much dollars for each hour. Of course, I could calculate it myself ($80/hour) which is quite fair for professionals. Also, I would like the proposer to explain a little more about total hours for \"Change budget\". I'm not sure what the proposer mean by change budget?. And finally, speaking of them, the team all belong to the MLabs- a development firm in the Cardano ecosystem in helping many community projects. In the early stage of the projects, it is good to make use of developers resources in the community. As far as I know, the core team includes 3 members, and the proposer introduces briefly about each person. I know their name, their roles in MLabs, their brief history of what they have done so far and give Github link for reference. My suggesstions are: provide some means for us to contact them, for example Linkedin profiles if they have one; if necessary, provide some evidence of their CVs. After all, with all the basic feasiablility information, it would be better if they could explain a litte more detail. ", "q1r": 4, "q2": "Well, the auditability of the process of this project is based on some several metrics: the number of completed deliverables, the number of resolved issues in the codebase, feedback from community, the number of projects incorporating their embedded systems tool and possibly a working prototype... These metrics are essential to know, but the proposer could also go further and explain a litte more about how and where the Cardano community could check these indicators. Also, as I mentioned before, if community know exact person who is in charge of which task in the project, it is easier for them to follow up. For example, to measure the community interest, how would feedback be measure and which channel will be used to measure? Will a survey be carried out or which marketing channels for community to update about this project? For other metrics too, I think, the information is quite general from the author but not give detailed on how these metrics will be measured and where the community could check it. Regarding the success outlook of the project, it is quite simple. It would be better if the author could give their expected qualitative number about each indicator. For instance, how many people from community getting interested in the project will be a success? how many developers want to use their wallet tool?  After all, the auditability of this project is possible, but it can be presented deeper with some more qualitative analysis from the author. ", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2051, "q0": "I find this proposal quite promising as it provides a secure and open-source software platform for embedded devices on the Cardano blockchain. The team will begin the development of the Cardano Embedded Rust SDK, an open-source platform for resource-constrained systems to interact with the Cardano blockchain. This software system will provide developers on the embedded system side with tools to develop highly secure and enterprise-ready software across a wide range of hardware platforms. In this proposal for the first stage of platform development, products such as:\n- A wallet SDK, compatible with ARM Cortex-M series of processors, minimally CIP-21 compliant, and ideally equivalent to a Cardano wallet\n- A well-defined design pattern for resource-constrained applications based on the Cardano blockchain: Plutus scaffolding\n- Stretch target: An HW prototype, e.g. based on the Nordic nRF52840 development board, using the SDK. The prototype will likely rely on VacuumLabs Cardano-hw-cli and will NOT have a screen to view transaction data exactly as signed by HW\n- Rich documentation and blog posts detailing best practices findings for highly assured resource-constrained applications interacting with Cardano\nThis proposal is perfectly suited to the \"dApps, Products and Integrations\" challenge because if it is successfully implemented, it will contribute to Increasing the number of dApps and products available for the community to use to help make enrich the ecosystem with new use cases, Increase the number of integrations and enhance the quality of existing products and integrations through suggested enhancements. The minus point in this part is that the authors have given some challenges and risks that may be encountered, however, it is an open question because they have not found a convincing solution to be able to do this. mitigate those challenges.", "q0r": 4, "q1": "Regarding the feasibility of the project, I think it is average. Speaking of the roadmap, the proposal offers us 3 milestones: what works to be done in 3,6, and 12 months. However, in my opinion, the proponent should update the roadmap in more detail such as breaking down the activities that will take place by the month so that it is easier for us to understand time and space. More details about the activities will be needed, would also be great if you understand how long these activities will take to complete? Who will be responsible for each activity? I think the information the author gives is good, but it is not enough to explain to me exactly what is going to happen.\nSpeaking of budget, the project asked for $96,000 and announced that the total time for this project was 1200 engineering hours or $80 for 1 work hour. However, I think the budget justification could be better explained. That is, the proposal lists some key work to be done along with hours to complete such as \"Design, architecture, specification, initialization/scaffolding: 120 hours; Implement and superficially test core features: 240 hours\". Since this is a very technical project, I think the author needs to explain in more detail about these activities, besides how many members will be involved in each category. Also, the budget asking for an extra 600 hours (I understand it's difficult to repeat the exact time given but asking for an extra 600 hours (= $48,000 for a $96,000 project) is not a small deal. a small number, your explanation that the budget change is due to \"uncertainty about how we can get Cardano into resource-constrained hardware systems\" I think it's a bit vague. it would be more convincing if you explain what extra items it will be used for, why don't you add time for those items in the first place but ask for such an estimate?\nAnd finally, about the team, we know that the members working on this project are mainly members of MLabs, the main network, and development contributor to the Cardano ecosystem. The three main members of the project are Hari Amoor (Systems Engineer and Programmer), Michael Hollister (Embedded Systems), and George Flerovsky (Delivery Manager). Arguably the team is the part that best describes the viability of the project. We know their names, and their role in the project, and a small text is also attached to reveal the history of those involved. It's good that they include links to each member's GitHub, that way we can have actual proof of the work they say they do. So my suggestion is to explain in more detail both the roadmap and the use of funds, the presentation of the team looks good.", "q1r": 3, "q2": "Testability is current, but could be more detailed. The roadmap is forecast for 3, 6 and 12 months, where it is briefly explained what will happen during that period. However, such a roadmap seems to be a very long time, I would like to understand on a smaller scale what progress will be made. Proposal to provide several metrics by which the community can measure project progress, such as Developer productivity (Commitment to open source GitHub repo)\n-Quality and usability: (Documentation and ease of use, Blog posts about design and discovery options, Benchmarks and test suites)\n- Interested Developers: (Github Repos uses our platform, Social Visibility) However, since the project's roadmap is not explained in detail, it is difficult to add a community know when these KPIs will be delivered.\nNow in terms of results, the proponents provide a very detailed picture of what success should look like, and this is good because it gives us insight into what needs to be achieved. In short, in my objective assessment, this is a potential project, but some details need to be improved so that the community has a more comprehensive view of this project.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2735, "q0": "\"The problem and solution outlined in the summary of this proposal are closely related to the setting of the challenge. In the off-chain world, embedded devices also contribute greatly to daily life and production. So we all understand that embedded devices are very important to any platform, it has great potential for development to the on-chain and off-chain world in general, the technology world.\n   \n     one of the main goals of this idea is to create an embedded system using methods that are better than those being implemented by other projects in Cardano, through very thorough explanations of the solution I saw the team The proposal has studied this system very carefully, the group has also provided specific examples, valid arguments.\n \n     since the main network platform is Cardano and the Plutus language is far superior to the second generation Blockchain due to the lack of scalability and full decentralization, so this is an advantage for this idea to realize its full potential. it, you guys have chosen the right place to build\n    there are more than 2 possible future limited issues that the team providing I believe the team can fix in the future\"", "q0r": 5, "q1": "\" a project before being implemented will need to go through steps such as ideation, evaluation and evaluation from the community, and being voted as a funding for implementation and this project has fully provided. details of the step-by-step implementation roadmap and milestones from 3 months to 12 months, goals for when it is reasonable to do so\n\n      The team recommends providing a detailed budget table detailing how many hours of work each subgoal takes, but if possible, how many dollars more per hour of work would be more transparent. more, and the community can also be easier to understand when looking at it\n      the particularity of this idea required a great deal of engineering and expertise to execute, and the team successfully responded to the community's curiosity, as the team were all background experts with experience in project development, like\n   -Liqwid\n   -SundaeSwap\n   -PlayerMint\nand many more characters, especially SundaeSwap, are very close to the community when recently there was a token release for the community to trust in the designated spo, with this team almost seeing the success of the problem. Only time left to implement and fix\"", "q1r": 5, "q2": "\"Because I haven't seen the White Book on the main page of the group, let me ask a little: It is a group that has a plan to issue a notification code for this project when it succeeds in operation, if any, please also Grading tokenomics, and when we can buy them as soon as possible, there are 7 indicators provided to serve the measurement of work progress, but there is no claim to have short -term reports of supply Issued to the community to serve the monitoring easier. But the group has a website, so this is not difficult\n\n    The success of the project is when we see the perfect development in DAPT, and the acceptance of the Cardano community with features in this idea, the project will have a competitive advantage with competitors. Later because the group will be in the top pioneer, \"", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 2872, "q0": "From the very first statement, it’s witnessed that the project aimed to extend Cardano interaction by developing embedded systems that are open-source and on-chain applications. As the challenge listed the type of proposals that could be included one of them is “Hardware” which fit the scenario of this project. The problem spotted out the initial need to run Cardano in multi-location and resource-subjective contexts with the need of specifying access to users. By comparing the cons of resource-usage and accessibility of current technologies (Amazon S3, FIDO2) following the missing layout of Cardano Hardware wallets, the project has listed out the potential of embedding their applications through compatible features (in programming languages, extensibility, etc …)  as well as bringing the Embedded Cardano SDK  design through references towards cryptographic primitives, hashing, transaction scalability and prototype of Mithril (envision development to security verification). From this point, the complexity of technological impact is pretty impressive. The community impact to reduce the centrality of huge competitors (Microsoft, Google) is well depicted in the use-case of login authentication. The foreseen vision of connecting Cardano wallets through a decentralized process (resource-constrained setting, remote server protocols) could have a very massive impact that would enhance the power of Cardano scalability. The description on the proposed solution is well explained towards the widespread use of the SDK development process through persuasion on processors compatibility, prototype and publicity of their research. Future challenges are also noted below which relate to security and device enhancement with specific solutions of expanding knowledge into the community. However, in risk management it seems that the project has repeated the part above from “We aim to start … later phases of development” except the fact that the bold section “Limitations and Future Areas for Development”. By analyzing the mentioned unanswered questions of the project it’s possible to spot out that power-memory-optimization and expansibility of running hardware. There aren’t enough solution configurations for the question that the team should be working on and it’s suggestively good for the project to have a formal research to evaluate the risks toward running the project with multiple cases so PA could have a clearer understanding of the team’s technical issue while building the platform. \n", "q0r": 5, "q1": "The broken down timeline is durated for 21 months with three challenge-addressed statements that verify the goals to increase the numerical and qualitative value of the product and the community. The sequential process of the milestones is well written; the only thing when finishing the project is that it should be broadcast into the community. Throughout the detailed plan it seems that the project should include a target community (like developers or students) to be included with the criteria of giving what value to that target. Promotion strategy should be creating instruction of usage to users (for example : Youtube tutorial) since the technological amount behind the product is considered huge. MLabs provided profiles with qualified profiles of team members and reliability of being in the development of some of the vanguard projects in the Cardano ecosystem. Confirmation of the project to return on Catalyst is clear with specified phases. However the project should be clear about which phase will be done in fund 9 so it’s easier to trace the process. \n", "q1r": 5, "q2": "The listed KPI metrics are well classified into categories and with measurable key words and publication of the tracking process. The general statement on the success of the project seems to be the ability of deliverables to multiple communities within the Cardano and corporating builders. The team can also increase the auditability rate by adding the SDG goal at the end of the proposal. Some of the suggested SDG goals here are “9. Industry, innovation and infrastructure”, “17.Partnerships for the goals”. This is highly recommended that the project will be oriented to solve realistic challenges on a global scale and increase credential auditability. ", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6637, "q0": "This proposal fits very well within the challenge. Remember that our goal here is to build products that will increase the possible real use cases within the Cardano ecosystem and increase adoption amongst the general population. The value proposition is to develop an open source platform that can streamline the embedding process of the Cardano blockchain into hardware devices, in principal hardware wallets. So while the project will not deliver a hardware wallet itself, it will enable other developers / manufacturers to produce in an easier fashion Cardano compliant wallets by using the modules developed by MLabs. \n\nThis is certainly a very niched project, without a very obvious end product in mind that the general Cardano user can relate to, but it can definitely turn into a backbone piece of enabling software that can boost competition on the market for hardware wallets. For instance we can think of mobile-specific implementations where the software can be deployed to turn the phone into a light hardware wallet, with certain functionalities similar to authenticator apps. Or, as the proposers mention as a strong use case, capture the demand from developers to run applications that already collect data from IOT devices that have to be published on chain, like for instance Adosia or Veritree. \n\nThere is definitely a strong case to be made for funding such a software development project, while at the same time being mindful that it will not be easy for general ADA holders to cut through the proposal’s complexity and observe the potential behind it. ", "q0r": 5, "q1": "The project’s timeline is slow and methodical, just like any exciting Cardano project. MLabs promises to deliver the results within a year’s time from the start of the project. The first three months would be used for an initial exploration phase and for developing the wallet’s SDK. Six months from start the platform should be already emerging with most of the features live, and at this point signing transactions on prototype hardware should be possible. For real techies this would imply for instance starting with an STM32 board and loading the software onto it. The end of the year would see a fully functional product ready to be used by any developer that wishes to embed the software into various hardware pieces. As the technology possibilities are still not 100% known, the scope might be slightly variable, for example it is not clear if such implementations will only be able to run a wallet exclusively or perhaps they will be capable of running an entire Cardano node. \n\nThe MLabs team is very extensively presented into the proposal, and let me offer just a flavor of their competencies and background: with a team of over 80 devs and as a company that are an IOG Plutus partner, they have already been involved in plenty of Cardano projects, with the most known ones perhaps being  Sundae swap and Liqwid. An excellent point of the proposal is that the core team for this specific proposal is extensively presented within the proposal itself, including links to their github pages, thus making it easy to verify certain things and generally obtain a better view of the team’s skills and background. \n\nThe budget is very reasonable in my opinion, since they are asking for a modest amount considering the highly skilled competencies required for the development phase and the rather unknown complications that might emerge during the process. The entire project is estimated to take around 1200 engineering hours, split between research, architecture building, implementation, testing and documentation. There is also a significant “change budget” of 600 hours (so 50% of the total) included which accounts for the extent to which the team will be capable of bringing Cardano to hardware which is more resource-constrained than the systems currently being connected to the ecosystem. .   \n\nOverall a very solid proposal with excellent feasibility prospects. ", "q1r": 5, "q2": "The team seems to be committed to ensuring full transparency with regards to the project’s development, and they state that progress will be measured by using a comprehensive list of metrics, including the actual deliverables, number of contributors, code resolved issues, feedback received from community and number of commits. But of course, the best success metric will be the delivery of a fully functional prototype - which is however not fully endorsed by the team, it is rather presented as a possibility.\n\nBeing a rather technical team, it is perhaps understandable that opening up communication channels is not their greatest strength - neither the proposal nor their website offer any indication that dedicated Twitter / Telegram / Discord channels exist for the enthusiasts to get in touch with them more easily than to send an email, but perhaps this aspect will be improved in the future if enough demand emerges from the Community. This is just a noteworthy point, but definitely not one that can by itself detract us from the clear message that the proposal has a five star auditability potential. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7960, "q0": "The problem that this proposal aims to tackle is minimizing the hardware to allow Cardano to communicate. The creators of this proposal want a secure and open-source software platform for embedded devices on the Cardano blockchain. This also applies to hardware wallets and other devices that work with Cardano. The people who often work with the Cardano ecosystem will benefit from this solution. Future challenges that may come their way have been taken into account. The makers of this proposal have already thought carefully about the various problems such as: how are they going to test the code?, functionality cardano-wallet?,...", "q0r": 5, "q1": "The project will be carried out by MLabs. MLabs is a major development company in the Cardano ecosystem. The project will certainly be feasible as the team consists of more than 80 developers and has already set up many community projects. The core team consists of Hari Amoor (software engineer), Michael Hollister (software generalist) and George Flerovski (developer). A clear budget has been provided with a breakdown of the technical hours so that there is a clear picture of how the financing will be spent. With this team and with the financing, this project can certainly be carried out well. A realistic timetable has been included with associated milestones. The creator of the proposal has included 3 milestones ( 3,6 and 12 months) The milestones have been realistically chosen and are certainly sufficient to complete it. Additional funding will be requested in the future. An implementation plan has been included that clearly states how and what will be done. The entire budget will be used to pay for the engineers' working hours. The technical aspects and architecture are included in the budget breakdown. A few challenges are included for a successful implementation ( testing code? functionality?,..). It would be helpful to provide a few possible solutions for each given risk.", "q1r": 4, "q2": "The timeline and milestones are included in the proposal. It is good that the starting point is always the challenge. The objectives to be achieved have been taken into account and they are also listed. The project will take 12 months to complete. It would be useful to place more interim evaluations in which there is an even larger division of milestones. Good KPIs are included to measure the process and progress of the project (number of contributors, problems solved, number of deliverables,..). The project will be successful if enough developers include the libraries in their projects.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8480, "q0": "Thank you, team, for introducing such a well-articulated idea. In this proposal, the team has explained very clearly how the solution will address the challenge. They have chosen a safe and smart way to do study from Trezor – one of the most popular open-source HWs on Cardano. That way, the team has shown us the limitation of an existed experience and brought in a new solution. They have done a very good comparison with the current system, to highlight the strength of their promised solution but at the same time, they’re still having their feet on the ground to acknowledge that there are a lot of problems to work with in the future. The promised software system is supposed to provide developers on the embedded systems side with the tools to develop high-assurance and enterprise-ready software over a large breadth of hardware platforms. I understand that the proposers aim for better security but there’s still space for developers and so much independence for users. With these advantages, I believe that it will definitely help attract users and enrich the Cardano ecosystem. For the above reasons, I strongly agree that this proposal is aligned with this challenge and completely shares the same key metrics with its proposed challenge. Of course, the risks will be there. The team has so many questions that they will have to find answers for but I could see for all the questions there, they also have at least some ideas that might lead to the solution and to see how it works, I guess that we all will have to wait and see. But for now, I think the team has done a pretty great job. ", "q0r": 5, "q1": "For the feasibility, the team has provided quite detailed milestones for this proposal. And I could see that it totally aligns with the project and its outcome. However, I want to suggest the team build a more informative timeline or maybe stick your engineering hours closely to your proposal’s timeline. It’s easier to follow the plan’s progress, not only for the team but also for the community. The budget breakdown is not very well explained since I don’t find it following the engineering hours closely. If you can actually break it down to each section of your working progress, it’ll be more helpful to the community to give your requested fund a fair justification. On the bright side, I really appreciate the team for giving us a brief introduction of your team with their background and skills and through that, I’m very confident to say that the proposers have sufficient potential to make this project work. ", "q1r": 3, "q2": "In term of audibility, there are key metrics but KPIs is missing. To audit this project in the future, I’m almost certain that the community will need to see your specific KPIs. KPIs should stick with your milestone and different period of time while launching this project. For instance, the number of deliverables, listed above, completed, the number of resolved issues in the codebase, the number of contributors and their extent of contribution, the number of projects incorporating your promised embedded systems tool… What is your goal for those numbers after a certain amount of time (3 months, 6 months, a year?) We can only measure the success of your key metrics through numbers. Hence, the team should work on building short-term and long-term KPIs. It will also help the team themselves follow closely with their work’s results. ", "q2r": 2, "assessor": "z_assessor_2989", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8557, "q0": "The problem statement is written in a manner that is both simple to comprehend and relevant to the challenge, and the solution is straightforward. To fully decentralize, the hardware required to communicate with Cardano should be as simple as feasible, according to the proposer. Although embedded systems are used in certain Cardano projects, best practices are still being developed. To address this issue, the solution proposes a secure and open-source software platform for embedded devices on the Cardano blockchain, applicable to hardware wallets and other devices buildable using our primitives, which aligns with the aims of the challenge. The team gave us important information about the project and how it would be developed? How will it meet the demands of Cardano users? And what benefits would the proposal bring to the ecosystem? A dedicated session showcasing impact is also extremely appreciated because it clarifies the value proposition. The proposed team includes plans for scaling up the project, as well as some potential difficulties and solutions that I believe are appropriate. I highly believe that this idea not only handles the difficulty successfully, but also identifies a significant need within the community and for future growth throughout the Cardano Ecosystem.", "q0r": 5, "q1": "MLabs definitely has a lot of expertise in the ecosystem, having worked on some of the most important Cardano projects. This proposal demonstrated an experienced and outstanding team, as seen by their Github respiratory profile. Not only is the team role well defined and described, but each member has years of prior expertise in their respective field. All of these elements give assurance that the proposer will be able to carry out the idea. Budget-wise, the proposal's key components are broken down in budget with the number of working hours necessary for each that produces the final budget total where the cost per hour is $80. While the total working hours of each position are specified, it would be important to know who and how many individuals do what role, as well as extra information on their tasks (whether the workloads of each are equivalent?). It is also vital to know 800 hrs in total referring to what time-frame (in 3 months, 6 months or 12 months) as it is not stated in the proposal. As a result, an accurate assessment of the explanation for the required amount is difficult. Despite an imprecise budget breakdown, the team provides a well-defined timetable with milestones of 3, 6, and 12 months, allowing us to observe what happens at each step and what tasks will be completed over time. Furthermore, milestones are practical and reasonable. If the team considers my recommendation, it will be more advantageous to the project.", "q1r": 4, "q2": "In terms of traceability and auditability, the team performed an excellent job; we have clear timelines and milestones for auditing the proposal. With the team's capabilities and commitment, I believe the roadmap and targets within 12 months are feasible. Key metrics are mentioned, however I'd like to understand how you plan to achieve some of these metrics and why they are important. Another aspect that could be addressed is that there is no mention or real links to whatever channel or platform the community will be able to audit the project. As such, I neither agree or disagree that this plan gives enough information for the community to assess future development.", "q2r": 3, "assessor": "z_assessor_2992", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8649, "q0": "The main aim of this project is to develop an open-source platform for resource-constrained systems to interact with the Cardano blockchain, wishing to reduce users' dependence on centralized providers. The proponent had technical explanations of their main product such as how it works, design rationale, core features, etc, and made comparisons to show which features stand out of their growing platform will assist with the problems developers are having while working on current popular platforms. In general, the proposer's goal is clear and consistent with the Challenge key metric.", "q0r": 5, "q1": "There was a clear commitment to platform completion time and availability for developers to use found in the project execution plan description. Presenting the plan includes two important pieces of information, the stages of development and the tasks at each stage, making it ideal for proponents and the community to be able to manage and track progress. Presenting a concise but effective budget for the audit, we can clearly define the direction of the cash flow to be allocated to which items, and it is built on the main project tasks and the number of items working hours of each task. There is no reason to doubt the viability of the project, as it comes from MLaps, a reliable and efficient team that has made many outstanding initiatives and contributions to Cardano and Catalyst. The members selected to carry out the project also have experience and knowledge relevant to the main field of this project.", "q1r": 5, "q2": "MLabs always repeats one problem in any of their proposals, which is not building a complete audit roadmap for the project. The KPIs that they give are always carefully selected and suitable for the output of each project, and the same goes for this project. But just defining KPI is not enough to get an overview of the success of this project. A complete audit roadmap should include 3 components: KPIs, achievements to be achieved according to each KPIs, and milestones to achieve achievements.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11430, "q0": "I think this is a very promising project as the proposer want to develop a wallet SDK which is a tool that can be used by developers to design their own HWs, especially for resource-constrained systems to interact on Cardano blockchain. If successfully, this tool could overcome the limitations of existing tools which is only available for large organizations, but not individuals and small organizations. I am appreciated by the author's deep analysis of the problem and understanding of the current market and how he got inspired to solve this case. My concern is that this is a new idea and there are quite many risks that the team have to solve in the process of carrying out this project, my suggesstion is that they should have some idea on how to deal with the foreseen issues.  After all, I support his idea and hope it could get funded. ", "q0r": 5, "q1": "Well, I think the feasiability of this project is possible. The proposer has one year plan and it is devided into 3-month period each. The plan for carrying out this proposal is quite simple but it seems that the proposer know what need to be done for each period. However, I would like the proposer to give more detail regarding the timeline for executing each period and the whole project. Regarding the project's cost, I think it is enough for me as it includes information about the total cost and hours for the whole project and the number of needed hours for each main task. Finally, I think, from the team background from MLabs, I think they are qualified enough to carry out this project. But I would be appreciated if the author could give Linkedin, if possible, for community contact. After all, it would be better if the proposer could make go a little more deeper regarding plan, budget and their team. ", "q1r": 4, "q2": "It is possible to measure the development of this project based on some metrics given by the proposer such as the number of deliverables, contributors, resolved code issues, community feeback, the number of projects working on embeddled systems,...However I would like the proposer to mention it more clearly on how they will measure these indicators, where (which website, or project's channel) Cardano community could follow up their work. For example, I suggest, by publishing weekly report or holding some livestream or small talk to share about their project,..by which they could get community interest and the community could follow up their project too. Finally, I think it is easier if the author could give more detailed information for better auditability from community.  ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We are developing a secure and open-source software platform for embedded devices on Cardano blockchain. This applies to hardware wallets and other devices buildable using our primitives.", "experience": "The MLabs folk specialize in blockchain R&D, particularly in computer security through formal methods in logic and type theory; the developers who will be working on this project have a background in embedded systems and low-level computing abstraction."}