{"id": 414068, "author": "bgordon", "title": "Tangent - Redeemable NFTs Launchpad", "url": "https://cardano.ideascale.com/a/dtd/414068-48088", "category": 26595, "amount": 69500, "description": "Using NFTs to tokenize assets is an exciting new area of NFT utility. However in Cardano there exists no dapp that specializes in funding and most importantly the process of redeeming such NFTs.", "f6_no_assessments": 10, "f6_rating": 4.466666666666668, "videos": [], "media": [], "f6_assessments": [{"id": 1594, "q0": "The idea is focused on a very current and relevant problem in the community today: the lack of interfaces and valuable projects that are related to NFTs. The problem, according to the proponents, is that there is no “dedicated launchpad to support the marketing and launch of these innovative NFT offerings, many projects will fail to gain traction and awareness within the Cardano community and receive funding and technical support.” The proposed solution then would be precisely to create this platform, whose one of the pillars would be to support digital assets, as mentioned: PwE games, virtual metaverse products, etc.; in real-world assets such as tokenized properties, luxury items, etc. Therefore, the creation of this platform would support the launch of physical products that merge the real world with the digital, according to the proponents, allowing artists, creators and organizations to tokenize assets. A positive point mentioned here is that no coding knowledge would be required for the projects to be carried out. There would also be initial funding, I believe, to drive the development of projects, partnership with NFT Minting services, such as NFT-Marker.io Pro, taking advantage of tested and scalable APIs, so that such functionalities can be incorporated into Dapps programmed from from there. The idea is quite complex, and in order for us to have a better understanding of what would be developed, the proponents report an example of craft beer token creation, which is very positive for the proposal's readers to have a better understanding of the what is being thought. Proponents are still aware of what risks they may face in product development, such as security traps, prohibited items, and logistics. With this, a lot of maturity and preparation is demonstrated to face the difficulties of the project. Overall, I believe that the proposal is highly aligned with the objectives of the challenge, as it will provide new functionality for minting NFTs, perhaps thus attracting new users to the Cardano ecosystem, artists, companies that wish to create digital assets from their products. and etc; at the same time, a new type of support will be provided for those already running this coinage on the Cardano blockchain. That is, the number of active community members can certainly increase, and perhaps even the amount of Ada in circulation, along with new smart contracts, can be intensified. And, finally, I believe that the points that will be better addressed and that are present in the summary of the challenge are those about integrations that improve what already exists, that is: “increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + increased quality of existing products & integrations through suggested improvements that are supported by customer feedback or increased usage by the community”.", "q0r": 5, "q1": "When we analyze the proposal script, we notice that the temporality is divided into quarters, each of which has a series of activities listed, as can be seen in the example: “2022 Q4: (development): Final release details of first NFT offering on Launchpad + Deploy NFT Launchpad on Testnet + Open NFT Launchpad Testnet platform for Alpha testers + Gather feedback from testers and improve”. From the way this script is presented, we can have a good understanding of what would be done, but we don't quite understand how or when. For example, in Q3 2022, we know that the web app and UI would be created; as well as launchpad backend development; communication with the craft beer company would also be established (the first item in which they would generate a digital token), details would be defined such as the flavor and composition of the beer on which the NFTs would be supported for their creation... that is, we have many and many activities defined for these 3 months. I think a little more detail would be interesting. For example, what exactly would happen in October, within these various activities? What would the web application development process look like, who would work here, and for how many hours per week? How would the characteristics of beer be defined? Would there be any public surveys? I think it would be interesting if more detail had been given for each of the actions to be taken. The project is complex and involves several stages, several initiatives, but even so it is necessary that everything is well explained. Talking about the costs, now, they are asking for approximately 70 thousand dollars. The value is explained a bit superficially, in my opinion. We know that for example, $30k would be earmarked for Launchpad backend development (10k per month). But as I mentioned earlier in the script analysis, it is not clear what would be the work routine of the programmers who would be involved here. Thus, we do not know the value of your working hour, so we are not able to define whether the chosen values ​​would be fair or not. 8 thousand dollars are set aside for marketing, however, how would this campaign be carried out? At no time is it said which strategies would be launched, how advertisers, designers and all those involved in this campaign would act. The team, in turn, is the part that is most suited to viability, in my opinion. We know a lot of information about those involved, such as their names, linkedin profiles, which areas of professional activity and very detailed biographies about what they have done so far in their careers. All this information conveys a lot of confidence in preparing the team to successfully execute the project. Therefore, I believe that the proposal is viable, with only a few improvements to be made.", "q1r": 4, "q2": "The partial results can be measured through some achievements defined by the bidders, the first being “the completion of the first tokenized NFT initial offering and the level of engagement it receives from the community”; after “number of physical assets that were tokenized on the Cardano blockchain using our service and also the response from the Cardano community (if they were well received, all were sold, was the redemption process easy etc)”; and finally by the “variety and number of companies, creators and artists issuing NFTs on our launch pad will also be another measure of success”. Proponents aim to encourage traditional companies to generate digital tokens from their products. I believe that these indicators are excellent for realizing if the partial results were being achieved, but apart from that, it would also be important, in my view, for us to know how the process of development of the phases would be. In other words, were the steps being carried out as planned? The activities delegated for each quarter would be happening in the expected time, how could we ascertain what would be behind such partial results? I believe that it would be very important for us to have these concepts very well defined and explained, so my suggestion is for the team to provide some kind of monitoring of work routines for the Cardano community. Some projects use gitbook sprints, but social media updates could also be provided, for example. The important thing is to maintain an active communication channel with the members of our ecosystem. Speaking of end-results and the success scenario, that would be when there is a “well-adopted and engaging platform with dozens of successful NFT offerings completed and also an active community built around Discord and social media that is engaged and engaged.” using Dapp’s funding and redemption features to support exciting NFT launches and redemption of cool physical assets and items.” I believe what was left pending here would really be a more direct and sensitive analysis of the impacts of the project on the Cardano community. How can we prove that this platform has increased the number of active members of our community, such as companies that decided to generate tokens on Cardano? How did our blockchain become better known and respected, how did people come to understand the possibilities that the cryptographic world can offer from this campaign? In my opinion, auditability is not bad, but it is still very focused on results, and not on monitoring the processes, and important issues were absent here, so some reformulations are accurate.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 6640, "q0": "The value proposition behind this proposal is very straightforward - building a platform tailored for artists, and generally creators, that can support them in the process of launching and redeeming asset backed NFTs. The first experiment will be a partnership with a craft beer enterprise in launching a tokenized beer NFTs backed by the actual bottles. \n\nThe subject of NFTs is definitely a polarizing one within crypto enthousiast communities, and the technology gets its fair share of both love and hate. Nevertheless, you don’t have to be an NFT maximalist to realize that, from an ecosystem perspective, there are no downsides to building such a platform, on the contrary, the development costs can be perceived as purchasing a “call option” on the NFT ecosystem and betting on its development. \n\nThere is also fairly low competition within the Cardano ecosystem for such a tailored service, and being amongst the first to capitalize on the area can be a great business move, and I believe the proposal definitely has a strong merit and connects very well with the challenge.", "q0r": 5, "q1": "The proposers have done a good job at describing the roadmap of the entire project. The work is already underway (applying for funding, liaising with potential breweries). The team behind the proposal seem to be well positioned to deliver on such a project. They have extensive bios presented in the relevant section, and it would take a significant amount of time for anybody wishing to go through their entire list of past projects, gitbook libraries and general background checks. The technical team is also complemented by a compliance advisor who can most likely keep them out of trouble.  \n\nAn excellent point of the proposal is that they have done an absolutely solid piece of work in identifying and planning for risks that can affect their development. It is by far the most extensive work in this area from all the Fund 9 proposals that I have read, and can definitely be used as a good practice model by other teams. So at least from this point of view, there are very few areas where the team can get blind-spotted by external developments beyond their control.\n\nThe team has also set aside a significant portion of the budget for a third party audit (13k USD, performed by Certik), and this is a very good tactical decision. Let me explain why, while offering a bit of context. In case you don’t know, IOG has recently released a video outlining the future of Cardano dapps, especially offering details regarding how their security would influence the way in which the dapps will be displayed on the upcoming dapp store. This highlights Cardano’s increased focus towards greater security, and the fact that this proposal sets aside a very significant portion of the budget for a third party certification is definitely an advantage over other dapps which will soon have to compete for “prime space” within a dapps marketplace where being certified will matter a great deal. \n\nI perceive the budget as a rather weak spot of the proposal, and let me tell you why. The majority of the budget (with few exceptions) is constructed per person (for instance 2 x 15k USD for a back end dev, 18k USD for a full stack dev). The budget would have been greatly improved if we had at least a rough estimation of the hours necessary for the most important tasks, as well as hourly rates applicable. In the given circumstances, the information we have (total budget per person and period of time for which it is applicable) is not sufficient to assess the reasonableness of the budget, since we do not know whether the team members will be working full time or not exclusively for this proposal.  \n\nThe proposers also expect the project to be financially sustainable following launch through exclusively the fees generated. A great addition to the budgetary details would have been the inclusion of some simple financial models to back up this claim, or at least a brief explanation in words to offer us a flavor on how the fee model will work. Will it be a flat fee, percentage based, success based? Will the partners be sensitive to the pricing considering they can also decide to internalize this NFT launch competency? Any kind of information exploring these topics would have been very informative to argue for the project’s financial future.\n\nOverall a well deserved five star feasibility rating, with minor(ish) improvement points in the budget section and demonstrating long term financial sustainability.", "q1r": 5, "q2": "The team behind the proposal is well positioned to keep the Cardano community informed. They already have Telegram / Discord / Medium / Twitter own channels, and they have pledged within the proposal to offer non-tech updates via these mediums, while the tech updates would come via bi-monthly reports.\n\nThey are also doing a good job at defining relevant performance indicators and what success looks like for the project. The project’s short term success will be measured through the community’s response to the initial NFT launch (completion levels, engagement levels, redeemed NFT levels and trading volumes following launch) while the long term success will be gauged through their partners’ desire to opt for additional token offerings and number of physical assets tokenized. \n\nSo again, five stars, since I am sure that the team can deliver great transparency for the Cardano community when implementing this project. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2743, "q0": "hi project, i saw another idea from the same team in this chellenge, and the great thing is that both are in the puzzle of DEFI , moreover the team proposed to separate LAUNCHPAD and FARMING into two ideas for a more concrete and understandable presentation, describing fully understandable solutions, with examples that apply to a physical product that merges with the digital world, but with One small problem that the project team may not have updated in the link to the Whitepaper is that I have not found the plan as described in the summary: Launchpad (funding) in the Whitepaper, but only seen the general part. This : Providing a platform for Artists , but the project team is committed to the idea (NFT Farming on Cardano with Tangent) that Q4 2022 will Launch Whitepaper V2, I hope it will be full by then, the team mentioned 3 risks Major risks can happen and are all under the control of the team, however the team may consider influencing the artists to be responsible for the logistics. n (after sale) in order to avoid damage to the buyer of those NFTs but with possible delays in delivery, or damage, I am very much looking forward to the project being successful soon, as I also plan to code these NFTs. agricultural products in my hometown to everyone,", "q0r": 4, "q1": "The time to complete the project's goals has been clearly and specifically established, with the experience of each person in the team, and the specificity of the idea will not be difficult in technical terms, so I think the team can complete the tasks. Timely target set, detailed budget is still my input on the idea (NFT Farming on Cardano with Tangent) of the budget team, however the team could elaborate more on the marketing of the two. The idea I see is the same person in charge that is Mr. Ben Gordon, the time may be shorter to complete the idea but less than the above idea what I am concerned may not be enough for marketing thanks, at The team section I read very carefully in the Whitepaper on page 14 is great when the experience and identity are fully updated and transparent, and the work assignment is organized.", "q1r": 4, "q2": "The team provides metrics that are easily verifiable by the community such as initial NFT token completions and buyer interaction with the artist and many more metrics provided by the team. However, there is a small problem that the group has not satisfied for the community that is in the process of implementing the project, if possible, there are weekly and monthly progress updates on the social networking sites of the community. groups like telegram would be great. if it is possible to update daily it would be really great Cardano mainnet they can update the progress by the hour i like that very much, it makes the community feel admired for the team for their hard work and their responsibility, in the future look forward to collaborating with the group", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 7968, "q0": "The intention is to use new NFT projects backed by real world assets (products) The creators want to create a Launchpad for this to support the marketing and launch of these innovative NFT offerings. It's interesting to narrow the line between the physical and digital worlds. This will also involve new people in the Cardano ecosystem.\nThe community that will benefit from this project are companies that have existing products and logistics supply chains, but are not versed in the technology behind NFTs or even Cardano. The question here is of course how many people are interested in using this project. Future challenges (The Security Trap, The Prohibited Item Trap, The Logistic Trap) have been taken into account. A solution is also provided for these three challenges.", "q0r": 4, "q1": "The team is described in detail in the proposal and on their website. The team includes people with relevant experience to bring this project to a successful conclusion. A breakdown of the budget is available. It would perhaps be useful to note the number of working hours, so that there is an even better picture of how the financing will be spent. The budget seems sufficient to me. If this project is funded, this team will have the opportunity to develop even more innovative projects later on. In the proposal and on their website there is a clear timeline with the future objectives clearly defined. Obviously, Tangent has a clear plan to get this all done. The proposal provides a sensible and feasible implementation plan. It shows how everything will be done and what will be done. The proposal also states what is needed in terms of resources. The technical aspects necessary for a successful implementation are also included in the proposal. An extensive risk analysis has been done, each time with a possible solution. It has been thought down to the last detail how this project can be successfully implemented.", "q1r": 5, "q2": "There is a clear roadmap with the milestones that must be achieved. Several KPIs are included to measure success. The KPIs are well chosen and show a clear picture of whether the project is a success or not. As described it will be very important to build an active community around this project so that there is greater integration by several large companies. This project offers a clear solution to the requested problem. The challenges and risks have been extensively considered in the proposal. There is also a lot of information to be found on their website with the accompanying roadmap.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8427, "q0": "The challenge states what dapps, products, and integrations can be deployed to deliver effective use cases for the Cardano ecosystem to help drive more adoption. This project showed me that it has an interesting new area of ​​NFT utility, and reading the summary of the project I see that it will be much more attractive in the future because it creates every opportunity for users completely across all circumstances and purposes and abilities in the project. With experience in developing and implementing blockchain & NFT related projects since 2019, this project is convincing enough to enter the Cardano ecosystem. arguments, demonstrations of clear, specific and attractive solutions with different methods make participants see many benefits when using them. The risk is that there is no project that is not available and how is the solution of each project reasonable? Then I found that the project topic clearly stated the risk of my project and how to overcome and verify that risk to clarify the problem. Your project is so helpful that if it goes live and succeeds I find it will create a platform for creators, artists and organizations and support more than just launching and funding NFT with the issuer-backed asset but also assists the end-user in the redemption of the underlying assets.", "q0r": 5, "q1": "Actually, I'm really satisfied with your project, you detailed each item of steps along with a clear timeline that makes it easy for participants to read and understand, each quarterly timeline is divided. clear programming steps to complete the job in how long? At the same time, the project's goals and objectives are specifically determined to be completed on schedule in accordance with the set time. The table provides a clear and specific budget so that the participants do not need to calculate too much but immediately understand the cost of each item? The amount of money the desired project topic requires to be funded to implement this project is very appropriate and reasonable. Implementing the idea with an experienced team, I think this project will be noticed and attract a large number of community participation, adding more search links on social networks will prove even better. shows that the team is very attentive so that it is easy for users to access without spending a lot of time searching.", "q1r": 5, "q2": "The NFT project fully supports all the needs of the users, the project has mentioned a lot of dapp parameters and the useful products that NFT brings, that is the process that reviewers like me see. Realized that in this idea, when reading the measurement index of the whole collaborative team, but the topic of the project has many limitations that have not been handled yet, it takes time to perfect them, our community understands these things. . Thank you for providing us with addresses and links so that we can easily access and search for your project. Success in this project, when implemented and put into operation, will be very successful and at the same time stick to the problem that the idea poses. And this is a new but very viable project for the community. I hope that you will approve the project and put it into operation so that users can use and explore it. Thank you for all your hard work!", "q2r": 4, "assessor": "z_assessor_2984", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8561, "q0": "The way the proposer described the problem and the solution is rather valuable. The proposer stated that NFTs backed by assets is an exciting new area of NFT utility. However in Cardano there exists no Dapp that specializes in funding and more importantly the process of redeeming such NFTs. This results in many projects failing to gain traction, awareness within the Cardano community and receive funding as well as technical support. As much as I agree with the hypothesis, I believe the solution is relevant and adequately addresses the challenge. In detail, the team intends to develop an NFT Launchpad Dapp that handles all of the aforementioned issues while also adding value to the Cardano ecosystem's existing infrastructure and tech stack. The concept is intriguing, and it is followed by a section devoted to a detailed step-by-step plan for carrying out such a project. The author discusses the impacts of this concept, so we understand how it works and how it contributes to the growth of the ecosystem. Overall, I strongly believe that this solution effectively addresses this issue.", "q0r": 5, "q1": "Based on the information provided, it appears that this plan will be implemented successfully. The proposer has experience in backend and frontend development, software, etc. All of this would provide the team with strong fundamentals for carrying out the project. There is a timeline that explains the steps that will be taken, which I agree is realistic. I believe it covers the capacity required for the stated goals; they have also defined quarterly milestones that are reasonable and clear. The proposer also goes into great depth to describe the technical aspects of his idea, and he does it admirably. The team and effort are carefully defined, and they are in line with the required budget. The requested budget is comprehensive, explaining how capital will be spent. It is apparent that development costs will be focused. I would have preferred to have additional details presented to make it clearer the budget and the proposal in general. For example, how many hours per month will be devoted to Dapp marketing, and how many individuals will be committed to this role? How many developers will work on the backend and frontend, and will they be paid the same hourly rate? How many individuals are included in the budget in total? A $500 team expense is also a concern to me. It would be helpful to be given more information about this element, namely what tasks it covers. Similarly, I anticipate that certain costs will be higher than those mentioned in the plan. For example, the team estimates that Staking Platform Interface / Graphics professionals would earn roughly $3000 in two months. To the best of my knowledge, the market compensation for this job now is around $3300 per month. With a particular working hour, I could have evaluated whether or not the wage is appropriate. If the proposer can fill the void stated above, I am convinced that the project will be completed.", "q1r": 4, "q2": "The proposer appears to recognize the risks and obstacles associated with developing the project. The risk management section is quite well done, with the major risks identified and a mitigation strategy in place; most of them make sense to me. Furthermore, the proposers have offered a clear timeline for the project's rollout (Q2 2022-Q2 2023) and budget outline, which would improve the proposal even more if the estimated working hours and number of specialists enrolled were included. Most crucially, the team lays out precisely what the success measures would be. Such information is provided in great depth, corresponds to the challenge's objectives, and helps us to understand what outcomes may be expected in general. My only recommendation is that the team establish communication in order to keep in touch with the community. Overall, I agree that this proposal provides me with enough information to assess the proposal's progress toward its stated goals.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9602, "q0": "This proposal effectively addresses the presented challenge. It makes NFT have many more utilities, not only used to represent digital photos but also can be exchanged for real-life items. It is really an innovation for NFT space. From now on, users can buy physical products directly with crypto currency without having to convert to fiat currency, which helps users protect their privacy. Enterprises also have an additional potential product marketing channel when they list their tokenized products on launchpad. This benefits both customers and businesses. And ofcourse, when businesses tokenize their products and sell them to customers, that will contribute to an increase in the number of Cardano users as well as an increase in the number of transactions on the blockchain. Mapping physical assets to the NFT and allowing customers to redeem for real wold products makes people realize the true value of the NFT, not just inflated virtual assets. The metrics and goals they give are also very clear and inline with the challenge. I have a suggestion to add an auction feature auction feature to help limited quantity products sell for better prices. I really believe that the ability to redeem NFTs for physical assets such as consumables will bring new use cases to the Cardano ecosystem.", "q0r": 5, "q1": "They have a clear roadmap and they prepare very detailed for this proposal, they really know what they need to do to bring this proposal to success. The budget of $69,500 they asked for was quite reasonable to develop the second phase of the project, which lasted for 3 months, this cost also included marketing and code audit. The team has a lot of experience in implementing projects on blockchain, especially the two blockchain developers Benjamin and Sydney. They have foreseen the risks and challenges of implementing the project including regulation risks related to which assets are allowed to be tokenized in different countries, which products are prohibited and illegal to import into countries, as well as the risk of shipping the goods to NFT holders when they want to redeem their tokens. They also have a legal advisor to prepare for those risks, it can be seen that they are very well prepared for this project. They have a good strategy when partnering with NFT-Marker.io Pro and leverage their NFT API to embed mint functionality into the dApp, leaving them with more time and resources to focus on marketing and crowdfunding aspects of the launchpad. This project can be done successfully by their team.", "q1r": 5, "q2": "The proposal set out clear metrics to measure the success of the project, such as the number of traditional businesses trying Cardano and mint NFTs in the launchpad, did all the tokenized beer sell out, how many have been redeemed, does the company want to make a second tokenized offering, etc ... and these are completely measurable by the community. I would suggest to the proposer that they can add detailed KPIs like 2 businesses will come to their launchpad and 10,000 NFTs will be minted so that the voter knows what the project's goals are, leading to a more transparent measurement of the project's success.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11421, "q0": "Propose an idea to build an NFT Launchpad Dapp that supports trading NFT real world assets and digital assets. In addition, they want to apply NFT technology to track and manage goods and ensure product traceability, ensuring real goods reach consumers.\nThis idea proposal is a perfect fit for this challenge.\nThey intend to partner with NFT-Marker.io - which makes sense since it is a channel for trading NFTs with a steady number of users.\nThey also anticipated a number of risks when implementing this project, related to legal issues in the countries they deploy, as well as preventing counterfeit and counterfeit products that cause loss to consumers.\nOverall I agree with the comments made by this working group.", "q0r": 5, "q1": "In this piece of content, they gave the full roadmap for their project. (plan is written until Q2-2023)\nI am quite satisfied with this piece of content because it is detailed enough for me to grasp what they will do each quarter, and the order of work is logical and reasonable.\nEspecially, they cooperate with artists as well as handle legal issues for the NFT market.\nRegarding the budget they proposed, it is not a small amount ($75,000) but worth it if the project is successful.\nHowever, they need to be more detailed about the expenses and have full information such as: number of working hours, who deploys, time for each task. This will be very decisive to the vote of the community.\nIn short, this piece of content can't get my full score yet, but it's still very encouraging.", "q1r": 4, "q2": "In this regard, what we need most is a way in which the working group will report their work, publicizing the progress of the work. But this is not clearly demonstrated here.\nIn addition, they do not have the metrics to track the success of this project.\nThey only state a few parameters that they are committed to measuring such as: number of encrypted beer, number of transactions on the website, number of partner companies that will participate... This is reasonable, but also necessary pointed out the target numbers to convince the community, especially the group of PAs.\nIn short, their recommendation gets the majority of my points, but needs more improvement if it wants to get the maximum score.", "q2r": 4, "assessor": "z_assessor_3244", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14530, "q0": "On the flip side, there are two risks that the proposal has proposed. The first is the complication of coding due to the fact that that will have to build the farming smart contract from scratch. The second one is the construction of a new DAO in order to foster NFT creation. These are two realistic problems that the project is facing but thankfully, they have already executed the solution. As for the latter, they connected to DAO makers to address the problem as soon as possible and they also mention that if the process of creating the DAO is delayed, there will still be no impact on the development of the project. Their reaction toward risks means that that are fully aware of their situation and is doing their best to tackle the problems.", "q0r": 4, "q1": "As it appears in the timeline of the project. For the next four quarters, the project will focus on successfully launching the first NFT project- Tokenized Craft Beer. They have a clear vision of what has to be done in order to make it come true and some of the work has already been executed. From contacting other partnerships to opening the NFT Launchpad for the public with the first NFT offering and receiving feedback. As for the second quarter of 2023, they also conduct research and prepare for the next INO. The budget breakdown is logically distributed to different tasks. However the budget of $500 for team expenses is rather vague and it is advised that they should explain it in detail. Lastly, the team members are listed quite specifically. Each with a LINKED IN profile and an overview of background. They are all experts in their expertises and have great experience working in the technological site. However, there are another 2 programmers for staking platform development that they do not introduce. Even in their website, the team also has no information about these two.", "q1r": 4, "q2": "The proposal does a fine job in the Audibility. In order to track the project’s development, firstly, they will measure the impact of the first tokenized initial NFT offering. Secondly, several KPIs are also introduced to measure the growth such as the number of physical assets that have been tokenized, the range and number of companies, creators, artists who issue NFTs on the launchpad. The success of this project is closely aligned with that of the challenge. However, they should put in more details about the statistics such as the number of transactions and new wallets on Cardano blockchain. This brings a quantitative measurement for the community to make clear judgments.", "q2r": 5, "assessor": "z_assessor_4071", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14612, "q0": "Proposal has discovered a potential problem in NFT technology that has not yet been exploited and developed by anyone. Tangent provided a solution to the exchange-related problems to support the marketing and launch of real-world assets and digital assets while complementing the Cardano ecosystem infrastructure. Proposal describes in great detail the potential audience they are targeting, which is extremely important for developers to focus on the project. Proposer mentions that Cardano is currently the third-largest NFT blockchain by volume, which will be a potential market as more and more people are interested in it, especially those institutions and creators who want to launch innovative NFT startups project. The proposal provided an easy-to-understand NFT Offering case study: Tokenized Craft Beer. Case studies have clear figures. At the same time, Tangent NFT Launchpad also provides detailed step-by-step instructions on how to use their Tokenized in exchange for a real asset (Craft Beer). I appreciate this description, it helps someone who doesn't know anything about NFT Launchpad to understand how it works and the benefits it brings. The proposal refers to Tangent having a good financial plan for long-term future growth from the fees generated from launching NFTs on the platform. Tangent NFT Launchpad ensures more safety in the Cardano ecosystem because before being offered for sale, the token is always tested and listed for trading by Launchpad-enabled exchanges and audited by reputable companies.\nIn the risk analysis and solutions to overcome it. I appreciate the proposer's view of the problem from a macro perspective and knowledge. The risk analysis in this project required a large multidisciplinary knowledge of security; Political Economy; logistics manager – transport… and proposer did a great job.\nProposer has raised risks that reasonably prevent the project from succeeding, but the solution to overcome the risks has not been described in detail. For example, in the prohibited item trap, the proposal mentioned that some items are prohibited from being imported into the countries (It is prohibited to transport alcohol to a Middle Eastern nation). It would be perfect if the proposer could provide a list of prohibited items and/or countries with import restrictions. This is an essential document for Tangent NFT Launchpad partners.\nIn addition, the proposal addresses the issue of Tangent, is not a logistics firm and do not wish to operate a distribution center with the related overhead expenses. That would probably inadvertently limit the huge number of Cardano users. I suggest that the proposer might consider working with a third-party shipping partner that will solve the problem if organizations/creators/artists can't provide “after sale” logistical support.", "q0r": 4, "q1": "Proposal provides a detailed plan, including timelines and milestones that are clear and logical. The actions marked done/doing are all important documents for future work. The work planning every three months helps to have a basis for assessing the progress of completion. Proposal also mentioned how it will accomplish those things including technology issues, programming, and cooperation with related partners.\nIn budget analysis, the team highlights the costs in a specific period for each of the different expenditures. The costs listed in the proposal are reasonable and closely linked to the detailed plan. However, for the marketing expense part, it would probably be more perfect if the proposer provided an additional advertising plan to go with it.\nProposal has provided an impressive list of Tangent NFT Launchpad participants. The members have a perfect academic background. All have many years of experience working in technology companies (for positions requiring technical expertise such as Technologist/ Software Engineer/ Coder/ Developer ...)\nIn particular, the team has a Financial Lawyer, which is a necessity for projects related to finance - technology, which other projects often ignore.", "q1r": 5, "q2": "Proposer does a good job of listing the criteria to evaluate the project, these criteria also come with specific examples that show the team has a logical connection between plan and action.\nHowever, the proposal does not have an expected number of objects in the project. If the proposer can provide more specific plans on the range and number of companies, creators, and artists who issue NFTs on Tangent/ the number of crypto assets that can be achieved in the future will increase the persuasion of the development of the project.\nIn addition, the team has given the project management plan and specific timeline above. I suggest using task management software like JIRA which may be necessary for tracking progress.", "q2r": 4, "assessor": "z_assessor_4076", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a platform for creators, artists and enterprises. that supports not only the launch and funding of asset backed NFTs by the issuer but also the redeeming of underlying assets by the end user. ", "experience": "The team have helped create multiple NFT platforms on other chains (Eth, BSC, Matic) & have experience in the coding and deployment of DeFi (liquidity pool farming, etc) & NFT related projects (gallery, marketplace) since 2019. Refer to github & team experience for more info."}