{"id": 414067, "author": "migamake", "title": "AdaStamp: signing, workflows", "url": "https://cardano.ideascale.com/a/dtd/414067-48088", "category": 26595, "amount": 660000, "description": "We need an easy way to upload legal documents in a distributed, decentralized way, sign them by involved parties in a controlled and secure manner, and then store them and share with involved parties.", "f6_no_assessments": 21, "f6_rating": 4.5396825396825395, "videos": [], "media": [], "f6_assessments": [{"id": 1593, "q0": "The proposal is certainly aligned with the objectives of the challenge, because the idea here is to create a platform called AdaStamp that will be a kind of environment in which a smart contract, which manages document signatures, can be shared, signed and verified by several users. . The proponents explain to us in great detail what this application would be and what its advantages would be. In short, Dapp would support any type of document, storing it on the blockchain, so that multiple users would sign it. This signature would include some basic data of the signatories, as mentioned by the authors: name, surname, date of birth, etc. There would be the possibility of some special conditions being linked to the contracts, for example, from a certain value, the contract would also need the signature of the company's CEO and so on. Proponents are very successful in explaining how the solution would simplify the bureaucracy involved in signing and developing legal documents, clarifying which bureaucracies would be excluded from the processes and how certain types of users would benefit (e.g. large companies that make several similar documents) . So I think Dapp has high value, and in relation to Cardano, it would be interesting for our blockchain since this kind of solution already happens but only on Ethereum, and as the fees are lower on Cardano maybe this is a very good way. assertive way of attracting new users to our blockchain. I believe that it is also a good idea because it would not be creating a technology for a new activity, but something that already exists, it is already a necessity, a demand from companies, and where Cardano could act so that the advantages of our blockchain would reach to the knowledge of such customers. The only observation that needs to be made here, in my view, is the total price of the project. The asking value, around 630k, is quite high. From what I understand, the authors justify such an investment because, in addition to the salaries of the technology professionals who would work on the development of the application, a lot of publicity would be necessary, so that the tool could stand out in relation to the competition that already exists. It is a very consistent amount, however the amount requested still corresponds to a considerable portion of the funds allocated to the challenge. Other than that, I think Dapp is in a position to be a great leap forward for the adoption of the use of our blockchain and it aligns very well with the desired conditions in the challenge.", "q0r": 5, "q1": "The script presented is not as accurate as it should be. We know what would happen in certain phases and how long they would last, however, the activities mentioned could be better located within each phase. For example, in the second phase (M1 - 3 months after M0), “document storage in IFPS, document retrieval, document signing and email notifications” would be done. What of these things would happen in the first month, and in the second, and in the third? It would also be interesting if each of these activities were more detailed and if we knew the professionals assigned to each stage, respectively. So, my impression is that, yes, we have a general idea of ​​what the development process of this project would be like, but without the ideal level of depth. Turning now to the budget explanation, I believe that the situation is similar to that of the roadmap. We know how the total money would be shared out, generally speaking. But the level of detail could be greater. The marketing and promotion subtotal is said to be 191K, and this part is broken down into various parts such as “project website, speeches at 9 conferences (dedicated to cryptography or document management industry), content marketing, etc. ”. It is also said how much each of these parts would cost in relation to the 191k share, but still the values ​​are high and could be better broken down. Another observation would be that the proponent explains how much each part of the technical development would cost, but we don't know exactly the salary of the professionals involved in the team nor the amount of monthly hours they would dedicate to the project, so our understanding of this part also is a little impaired. And finally, analyzing the team presentation, I think this part is very good because we know the names, a small resume and the professional contact (of some) of the team members. It's just not perfect because the amount of information about the team members is irregular, that is, we know a lot about some and less about others (for example, very little is said about Muhammad Hassan and Vismay\n Raj), some have provided their linkedin profiles and others have not, so we don't have the same degree of knowledge of each involved. I would like to suggest that everyone attach some kind of contact, whether linkedin or another platform. Therefore, I believe that the proposal is viable, with only a few points to be improved.", "q1r": 4, "q2": "Proponents are concerned with providing many KPIs, so we have material to ascertain whether or not the expected partial results are being achieved. They promise that there will be an open source GitHub repository, which is a pretty straightforward way for us to see how the work is being done in practice. There would also be sprint management, task assignment, problem solving, documentation publication - that is, we can conclude that basically the entire development process would be possible for direct monitoring by the Cardano community. I think, however, that it would be interesting if these professionals involved in the projects made reports summarizing this collection of information, in a more general way, so that the community could have faster and more direct access to what has been done, when, how and what results suggest therefrom. I believe it is important to verify not only the numerical information but also whether the tasks planned for each month were being fulfilled. Regarding the final results, we also have some numerical data, such as the numbers of signatures made, documents stored, registered users, etc. They also outline what the success scenario would look like after 1 month and 3 months. But after these breaks, what can we expect? I think it would be important to carry out a deeper study of the real impacts of all this for our blockchain, to understand if Cardano has become considerably more adopted in the legal sector and by large companies, if the number of smart contracts has actually jumped, if new people have been coerced into actively participate in our community, in short, if the most direct objectives of the challenge were observed in practice. This data can be analyzed and taken to the Cardano community directly, also through a report, or perhaps through some participation in Townhall, for example. Therefore, I think that the proposal is auditable, but not fully and with the desired level of understanding. It is necessary that a more detailed study be done, mainly in the second part of the auditability - of the final results - I believe that a very valid way of doing this is through a direct contact with the companies, to understand how the solution would have changed their functioning and what are the main changes noticed (one idea is to bring some representatives to a future meeting between this team and some members of our community, this would be a very interesting way to see the results generated by the project in practice).", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 12, "ne": 11, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 6639, "q0": "This proposal has an excellent fit within the challenge. Its aim is to develop a solution that allows for seamless upload of encrypted legal documentation on a distributed storage solution and signing such documents by participants. The signing of such documents can be then stored onto the Cardano blockchain (through a hash function).  \n\nThere is an obvious demand for such a service, since there are, or will be, many Web3 businesses searching for solutions that offer cryptographic certainty and encryption when interacting with one another. The scalability potential of such a product is also high, since once the development costs are done, there should not be any significant maintenance costs to keep the solution functioning. The only caveat to my previous assertion is that over time, the cost of decentralized storage (IPFS-like) should remain low in order for the cost of such a service to remain below the perceived value of singing / storing contracts in a decentralized manner. But with the marginal cost of an additional signature being exponentially lower, as for any automated solution, the prospects of having a viable long term solution seem pretty high.  \n\nThe proposal gains extra points from my point of view also for tackling KYC and smart contracts integration in the development phase. I believe these two aspects are very important: KYC being crucial of bridging Web3 solutions to real life applications / businesses that are bound by their regulatory regimes to perform KYC producers, while smart contracts being of course instrumental in terms of positioning the Adastamp application as the natural solution for digital natives interacting exclusively through blockchain technologies in the future. \n\nWith a good implementation this project can deliver a staple and ubiquitous application that can be used extensively both by individuals and organizations. Amazing potential.  ", "q0r": 5, "q1": "An excellent point of the proposal is that they have kept the description of the roadmap very simple, and it is very easy to be followed, even by people with less than ideal knowledge of the development environment and the jargon normally used within the industry. And the milestones make perfect sense to me. Here is a brief version of them: stage 1 would bring to life a technology teaser, a very simple proof of concept, but not fully functional: signing, storing and verifying signatures. A minimum viable product would take shape in stage 2 (M1 in the text), with real document storage, document signing, email notification. From stage 3 onwards we would see constant features being added (pdf and Google sheets integration, smart contract calling, pay as you sign, etcetera). I think that this agile methodology is an excellent choice for this product and any negative aspects can be quickly discovered and corrected since the product will be out in the open (and on-chain) very quickly after funding starts.      \n \nLet’s talk about the team building this product. MigaMake is the company behind this proposal. They are a Singapore based company launched in 2017. They are doing an excellent job at presenting the entire team on their company website (and even better in the proposal itself!), so another excellent point highlighting their commitment to openness.  \n\nAnother point I would like to highlight is that timing makes a lot of sense in how they are organizing the delivery of their products. Here is why. They already have an ongoing Catalyst project funded in Fund 8, StreamCardano, a serverless SAAS for building Dapps. They have a dedicated web page for it, but it’s still rather empty and too early to judge the quality of their products based on it. The app is expected to be live at the end of July, with a wallet available in September. But from their comments we understand that Adastamp is scheduled to enter development in stages considering their existing workload and dependencies - and that is just another key piece of information that we are dealing with a solid team that takes into account many aspects when planning their future activities\n\nAt the first glance the budget looks significantly on the high side, since they are asking for a big chunk for building the product. I have to give them credit for sticking to budget descriptions again in a simple manner (just like with the roadmap) and captions that are easy to understand and relate to. Each development stage is accompanied by its own budget, with relevant subsections populated with bullet points. There are two points which I would like to highlight for voters looking to judge the value for money proposal. The first one is that we are not being offered at any point in time hourly rates or estimations of time necessary to build each of the modules / features - doing that would have offered an excellent chance of diving deeper into the budgetary proposal and judging its quality and reasonability. The second point is that there are two points capturing a significant part of the budget (30%, a bit over 200k USD in total) for which I feel that more explanations are necessary as to their relevance for the success of the project: speeches at conferences (crypto or document management industry) and “producing and sharing viral” which I suppose refers to (video?) content but we are not being told exactly what it is all about. ", "q1r": 5, "q2": "Auditability scores again very high and the team is doing an excellent job in outlining how the Cardano community can track the development of the project. A first point worth noting is that they intend to work within an open source environment, with commits to open-source GitHub repositories for both the libraries used but also the main app build through an own repository. They are also promising to publish the documentation behind the project and to track its health via the FreshPing application. \n\nThe team also does a very good job at offering performance indicators to be used, which are very relevant given the nature of the product: number of signatures, documents stored, registered users and smart contracts engaged. A fairly classical manner of tracking success of the product. They are also proposing two key ways to measure success in a more concrete way: individuals and organizations using the solution after stage 2, and at least an implementation by a large organization to automate its workflows after stage 3 is complete. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1501, "q0": "The problem that is brought up by the proposal is quite extensive and extensive, and it is related to the processes that are followed by each group of industries and by different countries. Because the administrative and working procedures, as well as the laws, of each country are distinct from one another, I believe that this presents a significant challenge to the successful execution of the project. The necessity of storing data and the requirement to utilize smart contracts in order to validate the signatures of various stakeholders is something that, in my opinion, has a significant effect on the community. And in my opinion, it is not a dream that governments of other countries will be able to use the group's platform in the not too distant future due to the development of the network and the CARDANO ecosystem as it is now. Be confident. I rate the impact of this event as a 4.", "q0r": 4, "q1": "Regarding the route that has been suggested, I believe that the group has harmoniously distributed the work involved among each member of the group. With the members of the team who have had success with the StreamCardano project ever since Fund 8, I believe that the capacity of the team means that we don't need to talk too much about the project's ability to develop and make it successful. However, when it comes to the cost of each item, it has come to my attention that you guys have provided me with a cost that is neither clear nor specific for each item in each month. You guys come in at $319,000 for the subtotal of the software production and maintenance costs. You are only able to provide the total cost in this manner, but you have not mentioned the specifics of each component, including the work that goes into each item, the price for each item, or the total cost for each month. In addition, the total amount spent on marketing and promotion was $191,000 USD. The sum of $629,250 does not seem to match the costs that you have listed, and that is a significant amount of money for a proposal of this nature. It contributes more than 8% toward the overall difficulty of the challenge. I think it would be a good idea for you guys to recalculate. Therefore, I will award this impact four points.", "q1r": 4, "q2": "Because it is necessary for the project's roadmap to be supervised and monitored by the community, it is necessary for you to publicize the project issues on Github, and it is also necessary for me to follow the Github links of the members. If you are granted funding, you will be in the subsequent process. Concerning key performance indicators (KPIs), the community requires precise numbers as well as particular metrics for each item that you've mentioned, such as the following: How many signatures do you collect? How many users post?\n\nThe completion of the project is judged to have been successful after passing through three stages. However, the team only mentioned two of these stages. The team also mentioned that this is a project that has been linked to a proposed project in Fund 8, demonstrating that the project is open and accessible to the public. Because the project's goals and how it's supposed to move forward are described in great detail, I'm giving this part of its auditability 4 points.", "q2r": 4, "assessor": "z_assessor_2254", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "The assessment on Feasibilty refers to Impact, and overall assessor seems confused."}, {"id": 12478, "q0": "The proposals wants to create a dApp that has the main functionality to allow users to upload and sign documents stored in the IPFS service. The proposal provides a detailed background problem and solver which has big potential. The proposal provides main potential risks such as acquiring customers and competitors. However, they provide a good mitigation plan to overcome those risks. I have huge confidence that it will be successfully implemented regarding the competitor's solution's lack of distributed non-propriety storage which will be the advantage of the project dApp. Not to mention, it will also have a massive impact on the Cardano ecosystem.", "q0r": 5, "q1": "The proposal write a clear and specific milestone divided into 8 phase from M0 to M5 in a total time of 13 months. The proposal gives a budget breakdown for each phase consisting of software production and marketing which will consume an immense budget with a total of 660.000 USD (it is well fair because it will have a huge impact on the Cardano ecosystem). However, it will be better if they provide a cost ratio per hour for engineers, and cost per item for service or hardware such as cloud and devices so it will be fairly justified with the high cost.  The proposal provide detailed information about team member's background, experience, and relevant skills. They also give LinkedIn profile for each team member so the community can easily verify the credibility of each member.", "q1r": 5, "q2": "The proposal provides a GitHub repo so the community easy to track the project progress and also can see their documentation. The proposal uses 4 measurable KPIs to determine the success of the project one of them is the number of documents stored. However, it will be better if they state the exact number of each KPI for example more than 2000 documents stored.", "q2r": 5, "assessor": "z_assessor_3422", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11922, "q0": "The proposal tries to create a dApp that will allow its users to upload sign documents with digital signatures for the specified participant in a decentralized setup, manifesting IPFS storage as its main aspect. The project has a very clear objective and plan to transform the legal and tamperproof permanent record on documents approval system. By having this project done, the value in Cardano network will immensely improve, increasing its usability for general and business purposes, resulting in even more users joined the system. The most crucial risks assessed is the risk of competition, since the currently existing features of document signation has already quite many. However, the proposal has brilliantly outlined that other digital signature solution mostly lacking on open-source solution and distributed non-propriety storage, making advantage for proposed project.", "q0r": 5, "q1": "Project milestones have been written decently and clearly, as the project will be run 8 months long, the proposal provided their targets on each month. Budget breakdown has also done quite well, mentioning various items and action with their cost attached, yet most of the action from Months 0 (M0) to M8 is recapped in total of each, resulting on unclear breakdown per item. They should also provide the workhour and manpower that will be needed for the project development, including the required technical resources that will be utilized and their cost too. Members information is concisely provided including their background, experience, and skills. Linkedin url for verification is also included.", "q1r": 5, "q2": "The project is auditable easily by accessing their provided GitHub repository. Defined KPIs are also clear enough with quantifiable target, which are the number of signatures made, numbers of new users registered, and many more. However, defined success should include a quantifiable measures too, such as the “one large organization used the solution” or “solutions is used by small organizations” can have the number of that organization member specified.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10518, "q0": "\"This proposal addresses the challenge of bringing impactful use cases to cardano perfectly. All sectors of business need paper signing. Traditional ways to sign papers (physical signing or sending the file through email) is very slow and ineffective, and usually not secure. They are also often lost and not stored efficiently. The proposed identity verifications will allow for secure transactions. The integration of PDF support is extremely relevant and will push many businesses to try the service out, as PDFs are already the most commonly used format currently. It will be easy for current businesses to integrate this system into their already built system. The signing workflow is very efficient as well, it will help the signing process to be done much faster and with fewer hiccups as it is partially automated. This proposal touches on an important and fundamental aspect of business, that is often neglected.\nThe team seems to have studied the market of similar services that are offered, and are aware of the pros and cons of each. \"", "q0r": 5, "q1": "The developers involved seem very competent. The timeline seems realistic, considering the number of members on the team, as well as their experience in coding.However, it would be better if the team explained how each person's experiences will be used individually, and who will be doing what in the project. I would prefer if the budget breakdown was more detailed, detailing the different hourly wages and salaries of each involved party, rather than just a general budget for each stage. It is indicated that they used the Cosmic Sizing method to calculate the budget, but no further details are shown.", "q1r": 4, "q2": "\"\"\"The most interesting tool in monitoring progress here would be their open-source GitHub repo. I would like the team to elaborate on what documentation they mean when they say they will \"\"Publish documentation\"\". \nTo monitor the success of this project, the author proposes the publishing of number of documents signed and number of customers, but we have no way to know if the customers that used the service are satisfied with it or not. I think it would be important to implement a dedicated page for customer reviews. It will also help attract new customers, as real reviews will help everyone have more faith in the service.\"\"\"", "q2r": 3, "assessor": "z_assessor_3189", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Given that the well documented open source repository always needs additional documentation, it is unknown why assessor picks on publishing the documentation. Is it that auditor believes that we do not need documentation for large open source project can function without?"}, {"id": 10261, "q0": "I think this is a pretty good idea proposed by the team, the solution to upload legal documents in distributed, decentralized way, sign them by involved parties in a controlled and secure manner, store them and share to involved parties based on the  IPFS platform. We know that Digital signatures are a fundamental building block in blockchains, used mainly to authenticate transactions. When users submit transactions, they must prove to every node in the system that they are authorized to spend those funds, while preventing other users from spending them. For this proposal, I was impressed with the functionality that allows parties to sign off the document simultaneously. In addition, this dApp strictly controls the legal validity of a signature through verification, validation, and face match procedures. Obviously, this proposal adds to the Cardano ecosystem a dApp that is very realistic and highly applicable in the real world. Contribute to promoting the application of Blockchain technology to the community on a global scale. As the author has presented, the proposal has its own strengths that traditional technologies do not have, that is uploading a document of any format on IPFS framework...so it can be completely competitive and scale up in the future.", "q0r": 5, "q1": "The team members involved in the project are all people with many years of experience in the field of software developer with a background in functional programming, logic, data analytics, and agile software development. In particular, Michal has participated in some previous Funds and was funded at Fund 8 with the StreamCardano project, which is an important part of this project. Therefore, I believe in your ability and success in this proposal. You have also provided very detailed key milestones to implement the project in a total of 11 months as well as KPIs are provided. However, I would like you to elaborate on how to encrypt the digital signature before storing the signature on Cardano blockchain? At M4 - 3 months after M3, by mentioning “pay as you sign” I want you to give an estimate of the required cost from users? How is the competition with the existing platforms, because as you mentioned, there are quite a few tools like Adobe Acrobat's, DocuSign, HelloSign, Scrive... very competitive applications in this field. Of course, in your proposal you've listed the pros and cons of each application and outlined the superiority of your solution, which I find it pretty convincing. Another point I would like to point out is If funds, planned budget and the methodology for solution advertising needs to be covered in more detail. Requested fund is 660000 is huge, you need to add detailed budget explained for each item.", "q1r": 3, "q2": "I quite agree with the content you presented about SGG goals. Certainly decentralized IPFS storage of encrypted documents will surely decrease resource consumption per signed contract, need to print, copy, and scan documents will be eliminated. The author has provided a plan and roadmap which includes KPI's. I believe that your proposal will be successful if your solution attracts a number of reputable organizations to use and evaluate its effectiveness. I'd advise the proponent to take a moment to come up with an approach to providing updates. It is important for the community to be informed that the project is underway, to confirm that the funds are used for good.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "The rationale does not match the score. Feasibility score is positive in general, the assessor points out lack of some details that do not have to be decided in the proposal, and can be established during the project (for example 'elaborate on how to encrypt the digital signature before storing the signature on Cardano blockchain'). The assessor worries about competition with existing platforms, but then says that the comparison given in the proposal was convincing. No reason for such a low feasibility score. There is also no rationale for removing 1 point from the Auditability score, since the assessment is purely positive."}, {"id": 10000, "q0": "The proposal has the idea that implementing digital signature storage in the IPFS environment, implementing Dapp building for the community using Cardano wallets that can store and use its signatures on the Blockchain is in line with the challenge. Signatures saved as Hash codes in IPFS ensure security. We can see the intended proposal on commercializing digital signatures with high security, safe convenient use when signing contracts online. The product created has a direct impact on the Cardano community, the digital signature needed for smart contracts can be used by many large businesses. AdaStamp is a Dapp that can be widely used in the Cardano ecosystem. The convenience AdaStamp generates from the process of signing contracts, signing on PDF, there are reasonable verifications for signatures through Blockpass, the legal value of the signature is guaranteed. With commercialization We may consider paying for this service because digital signatures are what the future is aiming for. The fact that each person's signature can be connected to a Cardano wallet and stored on the Blockchain, will create an increase in the value of the ADA, attracting users to join the Cardano ecosystem. The implementation risk of the proposal is that \"the attraction and competition\" There have been studies on competitive applications and offered a better highlight than the competition. Minimizing the risk due to being taken is taking place in accordance with the challenge. The implementation of StreamCardano in F8 is not completed which may affect the proposal as risk the author needs to take care of. The author needs to distribute resources to 2 proposals, Offering a reasonable mitigation solution is what we want.\nRating: 4\n", "q0r": 4, "q1": "The implementation plan proposes to set a specific implementation timeline, the work completed with the set goal is appropriate. Signatures were able to be saved on the Cardano block chain, documents that have been stored on ÌFPS for 4 months of implementation are positive signs. Reasonable plans to implement, however the structures that form Dapp have not been proposed, is SmartContract written in Haskell? How to pay using Fiat or ADA money? Is bringing the product to the user given specific instructions? We would like to propose a clearer explanation of the technical aspects, programming language to determine the possibility of success of the proposal. The resources necessary to implement the plan set out in accordance with the objectives of the proposal, have clear information about the ability and assignment of each member. In the F9 proposed funding, the implementation of additional proposals in F8 will be difficult. We have an opinion on the author's consideration of adding appropriate resources to the implementation of the proposal. The recommended amount is 8% of the F9 budget fund, the amount spent: $418,000 for Dapp creation and $242,000 for Maketing, which is divided by the stages of making Dapp creation quite reasonable. It would be great for the author to share more details, How much does the work hours perform, how much does the use of IFPS storage use? How much does KYC verification with Blockpass require? This will help us see how much money is being used in detail.\nRating: 4\n", "q1r": 4, "q2": "The implementation of the roadmap set when proposing completion has shown that after only 8 months, it is possible to evaluate the success of the idea. The indicators/KPIs of the proposed proposal are detailed and in line with the proposal. The author is committed to bringing the metrics done with the GitHub Repository, the tracking of the AdaStamp Saas app with the tracking app FreshPing is carried out. Reports need to be done more often, clearly showing the work completed month by month and assessing the progress of completion. Indicators of the number of signatures, documents stored, the number of users, and smartContract created are enough for the audit work. However, this number of registered users should be transparent by having been identified by KYC as the real user. The proposal matches the rating (SDG) with goals 8 and 9.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1, "reply": "Feedback is too short, indicating that assessor made only cursory look at the proposal."}, {"id": 9601, "q0": "This proposal truly fits with what the challenge is about. Billions of people sign contracts at least several times in their life: from a new job, a new house to new services. This product allows users to sign and store contracts in a decentralized and secure way. When the document is signed, the signature is stored on blockchain and the document is stored on IFPS, both storages are decentralized and no one can modify the signature. Participants with granted access can check and verify the signers of that document. It also helps companies reduce the paper works and eventually contributes to environmental protection. Beside that, the addition of workflow and automation features makes it more convenient to apply to large organizations, which is a big plus for the adoption. In fact, there are already several similar products in this area like DocuSign in Ethereum but I believe when this proposal success, it will make Cardano more and more competitive and people will have more reasons to use Cardano", "q0r": 5, "q1": "The proposer has a very detailed plan to deliver this project to its goal, not what to do but also how to do it. They know they need to authenticate signers and they choose Blockpass to do it, they know they need to keep the document off chain but still be decentralized and they choose IPFS for it. The team members include 5 people, one is a professional software developer, one is a DevOps, one is a software designer and the other two are junior Haskell developers. The budget has been broken down for each milestone but has not been broken down for each specific task. I would recommend the proposer add details about the number of people needed to complete each milestone, the number of hours worked, and the hourly wage to make spending the budget clear. In addition, spending 152,000 USD to attend 9 conferences should also be detailed, what are the names of the conferences, what are the size of the conferences, and what is the goal of your speeches? That's why I can't give 5 stars for feasibility.", "q1r": 4, "q2": "In this proposal, they mentioned the use of commits on GitHub to track the progress of the project, which is also quite reasonable. The milestones they set out are also very specific. Only thing is that their KPIs are not very detailed, the proposer gives their KPIs as the number of signatures made, the number of documents stored, and the number of registered users, but what is the specific number is not yet in the proposal.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8727, "q0": "You explain the proposed solution in great detail (Signing and storing documents, KYC procedure, Signing PDF documents, Document templates, Signing workflows, The building blocks of the solution). This preparation impressed me very much. The elements combine to form a very logical process. Indeed, I appreciate your suggestion. Moreover, the project promises to bring many benefits to Cardano and users, helping the ecosystem reach billions of individuals while providing users with a smart and secure method. In the proposal, 2 risks that the project may face are also mentioned. Direct competitors were also reviewed and compared. It will be better if you do more research on how to attract customers for the project. Overall, I rate this as a potential project. Your thorough preparation is the reason why I rate this section 5*.", "q0r": 5, "q1": "The roadmap provided in this proposal is very good. It is divided into 5 milestones with specific timelines. The tasks in each milestone are also mentioned in detail. I have absolutely no complaints about this roadmap. Similarly, detailed budgets are also provided in a transparent and clear manner. Through two parts, the feasibility of the project is highly appreciated. Furthermore, members of the project are developers, development engineers,... very talented and experienced. Besides, your team of advisors is also very talented.", "q1r": 5, "q2": "In this section, project development progress and KPIs have been provided to enable project audit. You have described the success of the project after the milestones (M1 and M3). The benefits that the project brings to users and the community are once again mentioned. Besides, the project also helps to reduce resource consumption and inequality between countries. With the figures provided, I believe this project is auditable.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8426, "q0": "\"   The scheme offers full challenge given. A project that allows turning the bureaucracy of organizations into a blockchain with a permanent tamper-proof record and cloud storage of signed documents. This will completely simplify the administrative apparatus by allowing the signing and storage of legal documents in a distributed and remote environment, in compliance with legal regulations. The project solves all the cumbersome administrative procedures and shortens the user's time and is all safely controlled. In the near future, this project is likely to attract a lot of attention from users because of the fact that nowadays, if we want to settle documents or sign a contract, it takes a lot of time to prepare them. Travel time and waiting is exhausting for those who sign for approval or sometimes it is lost because there are too many other documents that come later but are inserted. But I think if your group uses this project outside not only about smart contracts but also about many other areas related to identification documents or dealing with countless administrative procedures, it is really cool. is great? And non-tech-savvy middle-aged people like us are known for when you guys optimize it that's fine. I do not give a 5-point scale because I would like that if you are not funded, please amend and add as I mentioned above.\n    If you visit the web, you give your group data, I see that most of your group members are related to information technology as well as modern popular software today, then surely you have implemented this project. Verry good. The proposed solution is quite good because it provides a way to log in (e-mail address - connect to cardano wallet - store blockchain), and the project allows to upload a document in any format application. The project solves a very good solution when the most important thing for each user is time, your group has saved us a lot of that and the administrative apparatus involved.\n   The biggest risk of this project is that it has not been able to link up with large companies or administrative apparatuses to widely implement and develop this project so that users and businesses know it better. If you come up with a plan that you want to buy back those organizations or businesses with a pre-prepared budget, I think you will achieve what you want and will soon submit the project. just go into action.\"", "q0r": 4, "q1": "\"   The plan laid out in this project is quite meticulous, showing us that your operation is professional since the operator is a professional software developer with a background in programming. functionality, logic, data analysis, and agile software development to other team members with machine learning experience from prototyping to deployment to production and having worked on multiple contracts publicity about software design, specification, and planning.\n   The timeline set for achieving the goal is not too long and the budget clearly set out each item shows that the chances of your team's idea being reviewed are high.\"", "q1r": 5, "q2": "\"  A proposed idea up to about 11 months will accomplish its goals along with measurable data explaining development progress to be audited, open source GitHub repositories, project repositories Besides, the KPI is being detailed, according to my observation and research about your project, it will definitely be noticed and attract users.\n    Success in the project aims to give us a new technology to diversify, upgrade technology, innovate, grow and develop sustainably, eliminating time to save doing many other things. higher efficiency.\"", "q2r": 5, "assessor": "z_assessor_2984", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8194, "q0": "\"The description of the proposed solution is adequate enough for the community to assess the viability of the project. The team has illustrated what they are doing and all the services they offer in a clear manner. Some technical terms are also embedded in external links for further explanation, which enables the community to have a thorough understanding of the project. The project is also expected to encourage businesses to adopt blockchain technology in their business model. \nThe main risks during the operation of the project are well predicted. The team also offers some solutions to mitigate the loss, which indicates their good risk management. They have analyzed the strengths and weaknesses of other competitors in the market, thus suggesting how they can leapfrog them and gain trust from customers. From this point, the community can see the potential of their project and have well-informed decisions. My suggestion here is that the team can also mention the regulation concerns (any difficulties while working with the different regulatory regimes and how they can deal with them).\n\"", "q0r": 5, "q1": "\"In their delivery plans, the team has included 5 main milestones with specific periods of time. Each phase has smaller deliverables that need to be accomplished (e.g signing a local file with Cardano CLI in the first month), all of which closely correspond to the expected outcomes of the project. Although their requested amount is reasonable based on the activities involved, some of the details in the financial breakdown seem a bit obscure. For example, the expense of software production and maintenance in M0 (technology teaser) is $21,000, so how much for analysis, how much for testing,..., are there any extra costs in this phase? However, they use calculating tools to estimate the cost so that the community can identify the transparency of the team’s spending. \nI believe they are a strong team that is reliable and productive given the information provided in the proposal. The experiences, solid background of members, collaborators, and advisors are well described, allowing the community to easily consider the capability of the team to run the project effectively. \n\"", "q1r": 4, "q2": "There is a cohesion between different parts of the proposal (the solution, delivery plan and budget breakdown) that makes the project easily traceable. The KPIs and metrics are well aligned with the overview and main goals of the project. I think these are good indicators that the community can use to evaluate the progress or development of this project. However, to clearly visualize the success, the team can be more specific. For example, after M1 they can aim for 3000 users (both individuals and small organizations). By looking at these numbers, the community can easily evaluate whether the operation process falls behind the plan or not and also the practicality of the solution. ", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8109, "q0": "AdaStamp is a proposal very close to reality that meets the needs of the majority of users worldwide. They want to quickly upload legal documents in a distributed, decentralized way, gated and securely signed by stakeholders, and then store and share them among stakeholders. I found that the proposal met the challenge and was massive in scope. The proposal created a Dapp on top of the Cardano ecosystem that solves those problems and will expose Cardano to billions of users.\nThe proponent describes the solutions in detail and specifically, providing evidence and strong arguments. The key here is: \"build a DApp that allows uploading any document, store it in a distributed environment (decentralized IPFS stores encrypted documents) and sign it digitally by identified participants\". The audience is broad because most people trade through contracts. This app will use StreamCardano for notifications. StreamCardano is a serverless infrastructure that was funded in Fund 8. I read the proposal and was also worried because the team plans to complete the public beta within four months and officially release it within six months from the start, so it will not be in time to implement this project in Fund9. However, in the comments, I read the team's reply that they are almost ready to distribute the closed beta key to StreamCardano by the end of June, and they will be able to execute the project as planned. I appreciate the way you guys work.\nThe legality of the signature is a fundamental and concerning matter. The proponent states that the signature's legal validity will be established if the signing wallet has passed the KYC process provided by the Blockpass solution. Blockpass is the pioneer of On-chain KYC, a comprehensive, fast KYC & AML screening software - as a service for blockchains, Crypto, Defi, and other regulated industries. In addition, Blockpass has partnered with EMURGO to provide internal KYC for the Cardano blockchain ecosystem.\nWhen implementing this project, the team also anticipated several risks that might be encountered and, from there, came up with appropriate solutions to minimize those risks. Here, the proponent points to two main risks: attracting customers and competing with other document signing solutions.", "q0r": 5, "q1": "The proponent provided a detailed, time-bound plan with specific goals. The budget breakdown provided by the proponent is precise and clear, with explanations for expenses. The budget for this proposal represents 8,41% of the total challenge budget. The proponent divided the budget into two parts: software production (including analysis, development, testing, deployment, documentation, and project management) and maintenance of $418.000; Marketing and promotion expenses of $242.000. Each part is broken down according to the required route and cost. The scale and cost of software products were estimated using the COSMIC Function Score method. However, the team should be more detailed in the budget from M0 to M5 to make it easier for the community to visualize the expenses for each specific period. \nTheir team consists of members with the experience and expertise to meet the proposal's objectives. Identity is easily verified through the profile link provided by the proposer. Each member is assigned specific work by their capacity and experience. In addition to this proposal, some group members have submitted many other proposals in Fund 9. They have had proposals funded from previous Funds. They are people who are actively learning and participating in the Cardono community, contributing to outstanding projects that help promote the development of the Cardano ecosystem.", "q1r": 4, "q2": "To measure and track the project's progress, the proponent has provided important KPIs for the community to follow. That is the number of signatures made, the number of documents stored, the number of registered users, number of intelligent contracts created to execute specialized workflows. Development progress will also be updated on GitHub, AdaStamp SaaS application, FreshPing... \nThe success of the project is determined when individuals and small organizations use the following M1 solution to initialize and store legal documents. The signature is recognized as compliant with legal regulations and (with KYC passed) equivalent to AES or QES. Post-M3: solution successfully used by at least one large organization to automate their standard document workflows. My opinion is that from the KPIs identified above; the team should set a specific number of goals; the project's success is to achieve those goals. It will also be easier for the community to gauge the success of this project.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8056, "q0": "\"The AdaStamp is needed for Cardano Ecosystem for the faster workflow, this proposal effectively addresses the challenge, making a variety of actual applications on Cardano Ecosystem. The electronic document is not only focused on large organizations but also the citizen managerment maybe. The electronic document for citizen governance brings many-valued. \nIn spite of the document is encrypted but the information security will be always on top.\n The proposal divided the section clearly to address, it will be easy to deploy.\n There is no mention about customer cost for using service except 1$ for KYC so how much estimated for someone who want to use services. \nAt the comment section Migamake said that the KYC part will be called funding at Fund10, so what are we going to do if the the proposal for decentralized KYC is not funded next Fund, so the proposal will use centralized KYC instead.\"\n", "q0r": 5, "q1": "\"The proposal divided  into 5 phases clearly to deploy. About the project budget and human resources are pretty enough for the proposal implementation. The key point of proposal is to attract customer and proposal have the quite clear marketing and promotion campaign. \nThe risk of lack of customer because of well-know competior \nThe marketing strategy focus on decision-maker is absolutely right way but also need to focus more harder into employee who will offer their idea for their superior. The proposal performer have alot of experiences in this field so that with clear step and experienced team I believed that the proposal will make it great.\n\"\n", "q1r": 5, "q2": "With goals and implementation step clearly each phases the ability to reach KIP of number of signatures made, documents stored, registered users, generated smart contracts that realize specialized workflows is feasibility and easy to quantitative finished volume. The success after M3 difined by at least one large organization used is pretty vague, how do we difined what is large organization and is it enough if just only one large organization used Adastamp.\n", "q2r": 5, "assessor": "z_assessor_2943", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7967, "q0": "The problem addressed in this proposal is finding an easier way to upload legal documents in a distributed manner. They must be able to be signed by both parties in a controlled and secure manner. The solution that the submitter offers is an application where any format of a document can be uploaded. If these documents need to be signed, people will be notified by the Stream Cardano notification service. This service can then be used to sign almost all legal documents easily and securely. This proposal can have a positive impact on the cardano ecosystem if this project can differentiate itself from the other competitors. The most important statistics and goals that the application should be able to be included in the proposal. The challenges and risks are included in the proposal. The risks are mainly to acquire customers. It will be important to find a way to ensure great integration. The proposal already compares different solutions. The maker is very honest if an existing solution cannot be surpassed. It will be important to ensure that AdaStamp can distinguish itself from the existing solutions.", "q0r": 4, "q1": "The relevant skills and experience of the people who will be involved in the project are included. Links are provided through which you are referred to the website that contains their experience. The submitter clearly shows which team members are needed to complete this project. A breakdown of the budget is included. It would be useful to make a subdivision in terms of financing per module. The salary of the team could be withdrawn. It is good a large part of the budget will be used for marketing and promotion. This part will be very important to make this project a success. The budget will certainly be sufficient to achieve the goals. If necessary, additional financing can be requested for the competitiveness of the project. The timetable that has been included seems realistic to me. (13 months) A clear implementation plan has been included stating how and what will be implemented. The plan describes the resources needed. For software production, it could be a bit more extensive. The technical aspects are included that will be crucial for implementation. The risks and challenges have been included. The most important thing will be to make sure that AdaStamp is better than the competitors.", "q1r": 4, "q2": "There is a road map with the most important milestones. The project will last approximately 13 months. The chosen objectives are certainly achievable to complete per milestone. A number of clear KPIs have been included. (number of signatures signed, number of documents saved, registered users, number of smart contracts) It is good that these KPIs will be published and people can follow the progress of this project. The submitter makes a clear description of the problem. It is good that the submitter takes into account the possible competition that will be there. The problem that is can certainly be addressed by AdaStamp. The most important thing will be to make people aware that this application exists. For many people, this app will be a great leap in the dark.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5981, "q0": "The proposal wants to enter the large market of signing and storing documents. As mentioned in the proposal, almost everybody comes in contact with signing and storing documents yearly, mainly corporate corporations who work with contracts daily. In this regard, I find that the proposal meets what the challenge seeks. The adaption of such Dapp in large companies would be a great success for the Cardano Blockchain project. Moreover, the project is adaptable because of the many features combined in one platform. \n\nThe many features are also needed because they will need some significant advantages against existing competitors in the space to convince corporate decision-makers to switch to a new service. The proposal describes all the different features very well. Still, I would advise including some hypothetical practical examples to attract the support of people with less experience dealing with contracts and corporate workflows. The project also mentions the platform can be used for individuals but is mainly focused on organisations. \n\nBecause the project's goal is to enter an existing market and the main focus is on organisations and corporations, I will rate it four stars on the impact criteria. ", "q0r": 4, "q1": "First of all, I appreciate the research in the proposal about the existing competitors in the market. I already have first-hand experience using Adobe Acrobat's built-in functionality to sign PDF documents. I believe the extra features stated in the proposal would make AdaStamp a better alternative to Adobe Acrobat. The comparison table between the leading competitors and AdaStamp in the attachment makes it easy to see the main advantages of AdaStamp. The proposal could be even better if the community could compare the cost of AdaStamp against the existing competitors. Would it cost more, the same or more than other applications? \n\nThe team consist of established professionals with skills that complement each other. After reading the proposal, I was not surprised an experienced business analyst with two decades of experience was involved in this proposal. Also, the allocation of funds to ensure the Ed25519 signature will be included in the following ISO standard is an excellent example of the team's professionalism. The phases of software production are clear and chosen with the COSMIC Function Points method. The Software stages and budget are also linked. The Sustainable development goals stated in the proposal also indicate that the team knows what they stand for.  \n\nThe platform's main challenge is entering an existing market where corporate people make the decision-making. As active participants of Project Catalyst, we are familiar with blockchain technology, but this is unfortunately not the case in corporate institutions. The project acknowledges the need for a good marketing strategy to address these problems and will do this on multiple levels. \n\nThe funds asked in this proposal are considerably high but are in line to make a platform that can compete in the existing market. If AdaStamp can penetrate this market, the growth could be exponential and will be an excellent adoption on the Cardano Blockchain. ", "q1r": 4, "q2": "The audibility regarding the development stage is adequate, and I appreciate including a monitoring app for the health of the AdaStamp Saas application. This will give the community a clear view of the status of the application in real-time. In addition, the KPIs are clear and are outstanding benchmarks to evaluate the adaption of the platform.\nAnother means of giving information directly to the community would be to include monthly reports describing the project's progress. \n\nThe goals are realistic, not over-ambitious, and linked to a development phase. However, I'm still missing a goal to measure success after M5 + The six months of maintenance software stated in the budget breakdown.  \n\nThe proponent could also specify the goals to measure success more empirical, for example, instead of stating the intent as \"individuals and small organizations use the solution to sign off and store legal documents.\" Instead, the proponent could give the number of individual users and the number of small organizations. \n", "q2r": 4, "assessor": "z_assessor_2767", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5122, "q0": "The proposal tries to create a dApp that can allow the user to upload documents and sign them with a digital signature by the selected participant in a decentralized manner (using IPFS storage). The project wants to tackle the serious issue and has very big potential. The proposal is well written and the team has a thorough plan, even though the budget suggested is immense, but is appropriate with their massive impact on the Cardano ecosystem if implemented successfully. The proposal provides potential risks of competition. However, the current other digital signature solution lacks distributed non-propriety storage thus the project has an advantage.", "q0r": 5, "q1": "Milestones are written are specific and very clear that consisting from M0 to M8. There is information on how they will use the proposed budget, but due to high expense, some items can be written in more detail. For example, each milestone from M0 to M8 can state how much they cost. Also, it will be better if they provide work hours for each developer on each M0-M8, and the cloud service/device used so the high cost can be easily justified. The proposal provides very detailed information about the member's background, experience, and relevant skills. Not to mention they give a LinkedIn profile for each team member so the community can easily verify they giving funding to legitimate persons.", "q1r": 5, "q2": "The project progress is easy to track by the community with the provided GitHub repository. KPIs used to determine the scale of success of the project have been clear with the number of signatures made, numbers of users registered, etc. However, defined success can be written more explicitly, for example, the proposal state that after M3 at least one large organization used the solution can be written as used by an organization with more than 500 members.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 2874, "q0": "Documentation is considered as one of the important fields but the major problem in this field right now is the involvement of too many central parties that could potentially manipulate the storage and distribution mechanism. Therefore the proposal has spotted these issues and taken decentralization key terms to be the main point of the process. While the project success defined on their dApp that allowed uploaded documents to be stored in a distributed manner. The description of the solution includes 6 stages. One of the very first technologies that they mentioned was the  IPFS Pinning Service (BETA version) to store data and StreamCardano (the team got funded in fund 8). Secondly they’ll have an AML-less KYC policy to legally validate the signature of customers. As it could be seen for the impact note, the project connects with a wallet on the customer side which enhances another aspect of technological integration but the proposer should also specify how they’ll likely to utilize the current wallet that is running on Cardano. For several next stages, when looking at the signing process and templates, scalability of the dApp is highly appreciated when it allows users to use multi-type of digital signatures which are stored on-chain. The scalability features are also depicted in their templates design for that would easily be delivered to individuals. Not only that, the extended feature to sign for workflows is also noteworthy toward automatic-customizable options for organizations with integration in Google Sheet to view workflow across parties. While the proposal stated that Escrow deposit and automatic-release of deposit will be involved during the process of document signing it’s also feasible to comment that the project utilizes the power of smart contract into the platform. PA would highly recommend this project to take advantage of Plutus and Marlowe to increase the impact into technical development. Considering the value of advancement in the system design that better the privacy and automation process, it’s a compliment for the team.  Moving into the identification of risks in the project it’s true that the decrease of customers and competitiveness in the market will somewhat affect the project in general. The listed solutions responding to the risks aren’t enough to ensure sustainability growth. It’s important to prove that the project has chief partnership for several companies that would be in need for the products by that extending the market would be a great idea. Another thing that would likely resolve the problem is to give attractive policies of using the product, including price, user experience, etc,... \n", "q0r": 5, "q1": "The road map for the project is written in detail with 5 stages in the total of 44 months (over 3 and a half years). All of the listed tasks are considered relatable for the title of the stage. The additional software maintenance budget should be transparent with the listed category and state what platform will the dApp be deployed when finished. The team is qualified in technical and business background. For the part where the Software is estimated using COSMIC Function Points method, there should be additional information on how the sufficiency of the method will orient the project in a good direction. However, provided that the method is based on numerical value which fits the category of quantity, it still fits the context of measurement. The marketing activities are clear in goal and target of speech, the combination of using Google AdWords is also a great way to run advertisements. It’s fundamental that the project indicates itself to come back to resolve the competitiveness problem between other listed competitors. ", "q1r": 5, "q2": "The auditability section is clear as its statement on the audited side will be open to the public in Git Hub, documentation publishment, monitoring apps. The numeric KPI is clear to target product, users and smart contracts involvement. The written SDG goals are cleared and visionary for futuristic achievement. ", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2742, "q0": "\"The goal of the proposal is to establish a distributed (decentralized) Dapp to serve the contracts of businesses, or certain organizations that need the signature of a third party or a member of the company, which This contributes to completing an important link in the Dapp development puzzle piece of the challenge.\n  This idea has been in the Cardano mainnet's ambition to be a decentralized, distributed document peer-to-peer for a certain group of employees or community of organizations, it will be an indispensable tool for an organized activity. Since the very beginning, the Cardano mainnet is aimed at, so this idea will not stop there, it can evolve and upgrade to be able to serve the government with tasks such as elections and many other activities that bring peer-to-peer decentralization, the team being able to unleash the full potential of this idea would be a great thing.\n   \n  The solutions mentioned in the proposal group's presentation are all related with each other with clear examples and explanations, the legal value of the signature is recognized when going through the KYC process of the company. system, the system also has the particularly interesting feature of being able to determine the order of the signers, and allowing the signers to decide for themselves before signing whether to approve or reject, and another great thing. Also great is that people in the organization will receive notifications via Cardano wallet address or e-mail, the team's experience is worth it when there are people who have developed high-performance Haskell.\n\n     Many risks are seen before the team is ready for the risks if they come, but the competitor risk can also be an opportunity for this proposition to assert itself with customers and assert itself with competitors. competition, the team needs continuous upgrading and further development towards more than just a goal in which companies can improve it so that it can be applied to government meetings and applied to elections, if this is the case. That's established and with perseverance you will eventually be the winner of your opponent in the field of evolution.\"", "q0r": 4, "q1": "\"The plan has been established for each task and milestones are also mentioned, the first milestone will be M0: 1 month after the project starts, and then the important milestones behind.\n  \n   The budget statement of the proposal is detailed, however there is a small mistake that can be confused by the project team as the total required budget at the top of the presentation and the total budget at the bottom. The bottom of the budget details don't seem to match, maybe this is a text error. the time to implement the proposal is about a year and that equates to what the team asked for is software maintenance which will cost 319k, here I understand $319k there might be something unusual about this part the team can provide more or explain a little about it\n\n   I found documentation about each member of the team on the proposal's landing page, and in one word you're powerful, with social media links like:\n  -Facebook\n  -Twitter\nincluding e-mail to receive information from the proposal group, \"", "q1r": 4, "q2": "\"There are many KPIs published from the proposal team to monitor the success of the proposal, the indicators include:\n  - the number of signatures made.\n  -Number of documents stored.\n  -Number of registered users.\n  -Number of smart contracts created to execute specialized workflows.\nall of these metrics will be audited on GitHub, the proposed team has committed to providing open source code for this audit. and even while in the process of implementing the proposal.\n\n    success has been clearly established one by one, the success of the proposal will pave the way for the blockchain to come to life in our real world around the world, helping to accelerate the legal recognition of Blockchain platform.\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 12738, "q0": "The problem of the proposal is clearly articulate. Currently there isn´t a way to to upload and sign legal documents to the blockchain. This proposal create the chance to do this. \nThe team has clearly articulated how they will develop and implement the proposal. The implementation seems useful and it has well thought through features like signing the document per E-Mail. The KYC solution seems reasonable and the same mechanism is used widely by for example online banks therefore it is a accepted mechanism. The signing process is well explained and seems simple and useful. Document templates are also a good feature to make it easier for many transactions, this makes the project easier to scale. And the signing workflow combines traditional processes with the IT. \nIn addition there is the chance to make contracts more secure by locking the money in the Smart Contract until the other side has fulfilled their promise.\nOverall it could be a great solution for legal documents, because is has many advantages like being transparent, automatically digitalized, unchangeable and undestroyable. ", "q0r": 5, "q1": "The team has written some text about themselves and linked relevant websites. Overall they are experienced and look competent. \nThe budget in combination with the timeplan is easy to understand. The development takes 13 months and the fund are enough for 6 months more maintenance. Overall this costs 418.000. For the scope of the project this is reasonable. The marketing and promotion takes 242.000 $. The biggest part are speeches for 152.000$. With the details below it seems reasonable. \nThe timeplan is thought through and makes sense. It´s split into 6 parts. Each part is important and describes important development steps. \nAlso the risks and competition have been analyzed in detail. \nOverall the proposal seems strongly feasible. ", "q1r": 5, "q2": "The auditing of the development process seems reasonable. They project operates transparent by having an open source code which is published on GitHub. \nThe KPIs are reasonable. They describe the goals well and are easy to measure. \nThe roadmap is well described and even in early developmentstages it can be used by costumers. \nThe success goal clearly solves the stated problem. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 14712, "q0": "\"Nowadays, the problem of signing offline is obvious: cumbersome procedures, easy-to-be-fake signatures. The AdaStamp creating opportunities for users to sign online (cut off the travelling costs), and the signatures can neither be faked nor changed thanks to the blockchain technology. Apart from signing, this application also allowed some significant features such as KYC, smart contracts, etc. The advanced features also allow users to sign a large number of documents, saving tons of time for large companies. If this Dapp is successful, a great number of people will pay attention to and join the Cardano ecosystem, and this aligns perfectly with the challenge setting.\nThe proposers clearly described the signing procedures, making the procedures easy to understand. \nThe proposers addressed well the risks. The major risk of this app is that there are numerous competitors in terms of electronic signatures. The proposers analyzed the advantages and disadvantages of competitors compared to AdaStamp. The major advantage of AdaStamp is that AdaStamp support storing and sharing/transferring the document, blockchain-integrated.\"", "q0r": 5, "q1": "\"The detailed project roadmap was proposed. The proposers divided the project into six main phases. In each phase, the proposers divide the phase into several smaller subtasks. The feasibility could become clearer if the proposers provided the due dates for each subtask as well as its execution method. For example, for the subtask “storing the signature on Cardano blockchain” (in M0). What is the due date (for example 3 weeks after project launching), and how do the proposers store the signatures? \nOn the bright side, the proposers allocated the budget according to the roadmap (from M0 to M6), the marketing and promotion were calculated in-detail. The proposers estimated the budget by using the Cosmic Function Point Method. It could be more specific if the proposers attached the financial analysis for the sub-tasks. For example, in M0, what are the cost breakdown of the three smaller subtasks? Tackling to these questions will help to increase the feasibility of the project.\nThe human resources included high-quality, experienced programmers, engineers and business analysts, etc. These backgrounds are necessary for the project to function properly. The projects also have open-source collaborators and advisors to help whenever the project is in stuck, showing great potential that this project could be accomplished. \"", "q1r": 5, "q2": "\"The source code will be audited in the open source such as Github, indicating good integrity of the developer team. The set KPIs such as number of signatures, documents, contracts, users in the app system were well align with the goal of this project. However, to increase the auditability of the project to the community, I recommend the proposers to specify the target KPIs/metrics achieved, and when to achieve them. For example, after one month of officially launching, there are 1000 signatures made. The success scenario (after M1 or M3) was drawn, showing high ambition of the core team. \nMoreover, the project aimed to reach the Sustainable Development Goals (SDG) since the environment could be beneficial from this project, by cutting the amount of paperwork. \"", "q2r": 5, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "The dApp allows uploading any document, storing it in a distributed environment (decentralized IPFS storage of encrypted documents), and signing it with a digital signature by defined participants.", "experience": "Migamake performs high-performance Haskell projects, including parsing, data summarization, and blockchain services.\nSome our devs participated Cardano development.\nThe StreamCardano.com project was accepted in Fund8."}