{"id": 414059, "author": "williamteddy", "title": "Adacheems:Optimize the value of NFT", "url": "https://cardano.ideascale.com/a/dtd/414059-48088", "category": 26595, "amount": 50000, "description": "The other NFTs on the Market is too wasteful to just be on display. We bring an NFT world that includes economy, real-world connectivity, and stronger interactions for owners.", "f6_no_assessments": 19, "f6_rating": 3.6491228070175445, "videos": [], "media": [], "f6_assessments": [{"id": 1592, "q0": "I believe that this proposal adds to the main projects proposed to the challenge, the very objective attendants described in the dam summary: Existing users that improve user usage more broad options and/or broader protocols of experience to use that broader and more comprehensive users use the protocol”. I say this because the proposal intends to work on a current problem that is very present in the community: the misuse of CNFTs. Proponents define the problematic situation very well as “the NFT projects in Cardano are not built on Dapps, but just a few paintings or a collection. So there are NFT projects, but not many long-term investments. Items are primarily of value and are traded on an emotional basis.” In this sense, the idea here is to build a Dapp platform that helps CNFT creators and those members of the Cardano community who somehow trade these active tokens. The components refer to various problems, such as the lack of use of CNFTs, the lack of use of the asset configuration practice, the lack of direct use of the interaction between users and users - which generates a lack of use of the unity in the community. these problems are directly solved by the proposed initiatives, being for “example NFTSSS NFT” are used to generate “passive for os:Staking in the income-only wallet” all Custom NFT: helps users own NFT items according to their changes and creations\" and \"Evolution and creations\" In addition to technical solutions, the proponent proposes examples of contests with some interactive events in the works, voting for and receiving works - as a kind of contest or works to generate engagement, by. proposal makes a lot of sense with the scope of the challenge, as it will work on a very relevant problem for our community. We know the role of CNFTs for popularization and good establishment of Cardano in the cryptographic market, which creates the need for investments that improve this practice. In addition, the proponents disclosed how some would be mitigated. We know that there is a certain limitation between Card's cross-chains year with other blockchains, so much so that we have a challenge focused on improving scalability and connectivity between Cardano and other blockchains (cross cross chain). The problem would be the lack of other people to other Cardano NFTs, but I believe that with all the work that will be developed here, this will be solved.", "q0r": 5, "q1": "Now analyzing the feasibility of the project, we see that the roadmap is well defined in the sense of punctuating what would happen and when. We know that in the first quarter of 2023, for example, some activities would be developed, such as “air launches, $CHEEMS token listing, charity events, marketing…”. The view we have about the processes is a bit superficial, however. What would happen in the first month of the year? It's on February? And March? There was also a little more detail about each activity mentioned above, in the order they happen. They have a detailed plan that explores some things better, such as how the product design would be done (\"we will finalize the NFT collection, so far we have designed 580/4000 NFTs and once the collection is complete, we will open the registration of the list of permissions. for the first NFT sale. We plan to launch the launch pad on Marketplace platforms, etc etc”). But not all activities have a well-defined duration and so many details unraveled. For example, what would these charity events look like, how would they contribute to the project, what would they do, exactly? In general, I think the script is good, it is satisfactory as it allows us to understand what would be done, but it could be richer in explanations about each activity, individually. A similar thing happens with the explanation of costs, the total amount is divided into less installments (eg expenses with technology personnel, with designers, project manager and etc). But for example, we know how much would be the salary of each, but we don't know how much time each professional would dedicate to the project (example: 20 hours per week). It would be very interesting if we had that understanding. $6,000 is set aside for community building with real-life activities - this part deserved a little more attention. What would these activities be, perhaps the CNFT contests cited in impact? The marketing part is very detailed (marketing Personnel: 1 Project Manager 3500$/ 3 months + 1 Advisor 1000$/ 3 months + 1 Lead Marketing: 2500$/ 3 months + 2 Digital Marketing: $2400/ 3 months); but even so, it is not ideal, because, once again, we do not know the hourly value of the professionals involved. The team presented, in turn, conveys good confidence, but I do not believe that it is an impeccable part of the proposal, again due to the lack of detail. We know, for example, the name of the members, their roles in the project and their linkedin profiles (for example: with the members Mr.TianRen - Artis, Mr. Peter - CTO, Mr.Teddy - CEO... in fact the only person who has all information that is accurate is from Mrs. Du Oanh – Advisor). We lacked a detailed curriculum on each, which would allow us to analyze their trajectories so far. Of course, through linkedin we can have a more practical knowledge about this, but it would be interesting if more details were included in the proposal as well. Also a little worrying is the fact that apparently no one has experience with Cardano's specific technologies, and in my view at least one team member would need to be active in our community and convey peace of mind. So I think the topic is fine, but overall more explanation of each part would be very positive.", "q1r": 4, "q2": "Finally, we will analyze how we can audit both the development of the phases and the final results. In my opinion, this was the part that left the most to be desired in the proposal, because we don't have as much detail as in the first two topics of analysis. We know that progress would be measured following the phases and activities reported in the roadmap; but as I mentioned in terms of feasibility, some activities are very detailed, others not so much, we don't know exactly how long each activity should take, in practice. The suggested KPIs are quite interesting, the proponents claim that the process would be monitored by Github tools, weekly reports (where would they be made available?) and dissemination of results in media channels (which ones? Twitter, discord, telegram?). Through the information that is passed, it is possible to have a good understanding of how the phases will be monitored, but some more details could increase the security in this monitoring process - such as a greater detail of the activities and the exact definition of the channels communication tools used to maintain contact with the community. Talking about the final success, this is defined as “the popularity of NFT Adacheems and the acceptance and love of the community, even greater is the image of a dog. The Adacheems have become a phenomenon in global NFT circles. Users and artists involved in the project also have a better life with earnings from Staking NFT or participation in the Metaverse Art Gallery. And so help attract new users to the Cardano ecosystem.” In fact, this is our main goal. But how can we find this out in practice? I think the proponents could have suggested KPIs, as they did for part of the auditability of progress, that would be useful for us to see what could be done about the end results, how they could be substantiated. With this in mind, an idea would be to do a direct survey with Dapp users, to understand how their relationship with CNFTs has been improved; Are they making more money from their digital assets? Has the number of mints on our blockchain really increased exponentially? Has Cardano's relationship with other blockchains been made easier? How did this project achieve the specific objectives of the challenge? It would be important that such issues were better defined and reached the community in a very direct way. That said, the auditability is good, but it could still be better, especially in terms of understanding the final consequences of the project.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 4332, "q0": "The idea that was evident in the team's proposal was the Adacheems dog NFT. I guess this is a creation based on the symbol of Dogecoin? This proposal aligns with Challenge's goal of Dapps & Integrations. Through NFT Adachems, you define a problem to be solved that generates economic benefits and interacts with the community. Of course, applying to the Cardano platform will add value to the Cardano ecosystem. However, the future scaling and challenges need to be looked at more closely, as I don't see a clear prominence. And I hope the team can do more than what it has, not just as it is now. I think the capacity of the team far exceeds what you are doing. Why don't you think it is possible to create a Metaverse platform for many products in many other fields. For example, agriculture - agricultural shows, cars, etc... will take the team and its products further. Then Adacheems will be shown on your Metaverse platform as a specific example. The team can build a platform for everyone who wants to work on Metaverse, NFT… They will create NFT on your Metaverse platform. Then calculate the impact of the project will be millions of people, not just the current number… That's my suggestion for the team. Also, I have a further question of impact: What is the actual use value of the NFT Adacheems here besides buying and selling value. You can explain what personalization of user preferences is like in addition to selecting the Adacheems images according to each person's preferences. I would like to comment that for this project to exist for a long time, I should aim for the real value of NFT Adacheems, not trading or other good factors. To increase the attractiveness, the team can change the logo image to be richer. I understand you want to take advantage of the existing community of dog images that have been on the market for a long time. So, the proposal is impactful because it represents the goal set, adds value to the Cardano ecosystem, and can scale and challenge in the future if the team approaches the proposal deeply. more colorful. I am happy to hear that the proposal is the brainchild of the young generation Z. I encourage you to continue promoting the spirit of youth to do useful things for the community through the Cardano blockchain. I vote 4 stars.", "q0r": 4, "q1": "Through the proposal, we see that the team is all experienced in the field of blockchain and cryptocurrencies. There are also members working in the field of communication, which is very beneficial in promoting products to the community. The number of group members is 5 who have been publicly identified via social networks (Linked). I find this very good because it builds trust in the community. List to be broken down by items and logical to the goal. Through the presentation of the budget, we can see that the team has shown a very serious attitude when implementing the proposal, along with the thoroughness of the plan and the implementation method. If the proposal is not funded by Catalyst as a result, will the team continue to work on it?\nI would like to take a closer look at the technical aspect: Adachems is a token created on the Cardano platform. But not every native token on the Cardano platform can participate in the staking process. The essence of staking is that the token must participate in the consensus mechanism power process to validate data - that's called staking. Does your token have the right to participate in Cardano's consensus mechanism validation? Is this team staking confused with lending? In addition, when the team has to decide a lot of things, is the nature of the NFT proposal to be decentralized? Or is it still centralized?\nI realize the applicability is not much, can the team explain more about the staking payout ratio? If the staking payout ratio is high (30-40%), it will make the community doubt the feasibility and transparency of the proposal (some previous projects with high payout ratios are scam projects). . I recommend you review the rules and payout ratio (maybe 15% or less).\nIn terms of resources needed to implement, if the request to create NFT from the community is very high, how will the team do with the existing staff? Hereby, I suggest that the team can cooperate with everyone in the community to implement the proposal as this helps both transparency and the implementation of the proposal without the limitation of resources.\nRegarding the challenges and risks of the project, the team mentioned the fact that NFT holders are not yet popular on the Cardano platform. I have an opinion about increasing the number of NFT Adachems owners, it is the team looking for ways to increase the visual appeal of NFT users. How to NFT to make Adacheems more beautiful and richer. I realized the fact that it has appealed to the young generation Z, the rest of the generations (older people) it is less attractive. So let's think of a way for generations to love NFT Adachems. To do this, it is not only an improvement in the image but also an improvement in the quality and usefulness of Adachems in life. One more opinion about the risk that the image of Adachems when applied for commercial purposes is considered copyright infringement? In my opinion, you should do thorough research on the legality and get permission from the person who created the image of the dog and find a legal guardian (legal advice). In summary, in terms of feasibility, I think that some issues need to be calculated more carefully, the rest, the release of NFT Adachems is likely to be supported by young people. I both agree and disagree with this proposal. I vote 3 stars.", "q1r": 3, "q2": "I am pleased with the roadmap of the milestones the team has set to implement the proposal. It is quite detailed and professional, showing that you have invested a lot in the proposal. The professionalism and sequence are shown quarterly so that the community can easily monitor and evaluate the implementation progress. You have also stated the KPI for performance evaluation. To me, that's when it's important because any proposal needs this indicator, which highlights the transparency and auditability of the proposal. It would be much better if the team provided key metrics, to be able to fully clarify the transparency of the proposal. Did the team clearly state what the success of the project looks like? I think the criteria of success as you say are difficult to implement? My suggestion is that you can view success with a smaller, more achievable goal: becoming familiar with the Southeast Asian NFT world, making it more feasible and beneficial for the team when audited. Throughout the proposal writing process, the problem is described in an easy-to-understand and clear manner, and there are implementation solutions and solutions to overcome challenges. I am very pleased with this. A significant investment by the team brings spiritual value to the community (especially for Generation Z) and certain economic value for those who care. I hope that no matter what, the team will continue to promote their youth to contribute to the ever-growing Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 6, "ng": 1, "nfo": 2, "vca_o": 2}, {"id": 829, "q0": "Although this project is a \"dapp\"  and therefore fitting the category, it is relatively closed off with only 4000 NFTs planned to mint thus only 4000 people will be able to participate in the staking rewards. everyone else who would want to use the system would be forced to pay to display their artwork on the Dapp with no compensation outside of visibility to those small number of NFT holders (which could be done for free on many other metaverse or web2 sites). By limiting the NFTs to a single 4,000 mint it creates no incentive for anyone else to become apart of this community. ", "q0r": 2, "q1": "The linkedIn profiles shown only 1 person has experience with blockchain developlment, which is not expanded on. the others seem to have have no connected work experience or knowledge listed in the field of blockchain, coding, art(unless you count deviant art), NFT, or really any related concepts.\n\nThe team have degrees and experience in Business, law, marketing and some webdev. \n\nAll the money requested seems to be going to blockchain developers, web front end developers, artists and content creators, customer support and marketing leaders. which makes me ask the question - what exactly is this team contributing to the project other than the initial idea?\n\nThe budget has things listed such as $2000 for an AMA that lasts 3 months? and $2000 for discord games? $5000 to promote their social networking sites - rather than $5000 to promote their project itself. They may also struggle to hire a Haskell developer for $150 a week.", "q1r": 2, "q2": "There is no mention of any external audits for security or development. The roadmap is 15 dot-points with no further details. \n\nhowever git-hub updates and social media outreach may be enough to keep the community informed, as it will be a small community. ", "q2r": 3, "assessor": "z_assessor_2137", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10358, "q0": "The team wants to build a project to help users earn passive income by staking their NFTs. In the team’s roadmap, they just focus on Adacheems (a meme coin project) and build a Metaverse. So, i think that they actually want to build a metaverse and staking Nfts is one of the parts of  Adacheems. $ACHEEMS is just a coin meme and has no current value. If users buy and stake nfts, they will get $ACHEEMS without guarantee of profit. How do they make sure that users get benefits from Nfts of Adacheems? ", "q0r": 3, "q1": "If the team wants to build a metaverse, I think they can do it. Their team have experience about Nfts,  blockchain, smart contract. However, their main purpose in this project is to build a system to help optimize the value of users’ NFTs, they didn’t concentrate on their real purpose. Most estimated Budget is just for Metaverse. they don't mention any costs to build the system for staking Nfts. They also have road map but most of the milestone only focus on buiding Metaverse. They don’t explain what will they plan for staking Nfts? ", "q1r": 2, "q2": "Their plan for auditability assessment aren't not good enough because they don't focus on building tools for staking Nfts. They just focus on Metaverse. Their KPI isn't clear. They will have weekly KPI report but what will be covered in their KPI? They should detail their KPI. They should suggest phases with obtainable achievements. In each phase, they should provide solutions to evaluate the calculation results of their project.", "q2r": 2, "assessor": "z_assessor_3183", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9999, "q0": "The idea is showing us that building a Wed3 appeals to the community that makes up NFT's. Wed3 building and creating its own token is suitable in creating the incentive of a Dapp. Open source has not been mentioned in the proposal this is an important factor in the community's access to surveillance and research. Creating NFTs may be a hobby for many people when earning extra income but also a concern about the long-term existence of the application. Investing an initial amount of NFT ownership for Stacking to receive a bonus seems to be the form that is attracting the initial source of money, just like the current NFT game projects after only a period of time the value of NFT and Token decreased resulting in a decrease in the number of users. $ACHEEMS can impact the current user because of its value, but in the future the expansion development will be very difficult. Stacking NFT to have the $ACHEEMS as intended on your Wed will be able to cause inflation to affect the value of the Token. The use of cheems dog images to create NFT is creative, which attracts Cheems lovers who have a significant impact on the expansion of the user community. The risk of the proposal is not just what the author gives. We find the inflation of the token issued, the attraction of participants, the decline in the value of NFT/ TOKEN is worrying. I look forward to proposing ways to solve this problem.\nRating: 3 \n", "q0r": 3, "q1": "The project roadmap is possible, there are preparations for Wedsite and NFT that have been launched in the third quarter of 2022. We haven't seen the technical aspects of Dapp built, which open source author uses? Some open source code such as WordPress, Joomla, Magento, etc. Choosing the appropriate open source code can create high security for your Wedsite. The project is focusing on creating NFT and Tokens for future commercialization, how would we like to see the Consensus Protocol? it is important to show evidence of the value of the project. The number of people attracted through the Maketing strategy needs to have a specific number, the way to attract users through twitter, Facebook, Instagram, Discord, Telegram channels is reasonable. For the project to be able to implement we suggest that the author should come up with a way to retain users from the possible inflation of the token has created. What factors does the token value create? Project members have the necessary experience and skills to complete according to the stated plan, Assign each member's work according to the set plan is appropriate, information members are provided on LinkedIn. The budget is well defined, allocating the budget for specific jobs is reasonable $50000 is enough money for the project during this period.\nRating: 3\n", "q1r": 3, "q2": "The implementation of the project tracking lacks significant specific information, how much profit does the project attract? The roadmap for implementation with important milestones has not been given by the project. The management measures the progress ofgithub's work. Jira, weekly project progress KPI reports are needed, but this information is general compared to what the project is doing. Would it be better to have many quantitative indicators of the project, what is the number of commercial tokens?, the value of NFT created by the project? The time for organizing the exhibitions is carried out. Determining the success of the project is difficult.\nRating: 2\n", "q2r": 2, "assessor": "z_assessor_3144", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9600, "q0": "NFT is a hot area in blockchain and attracts a lot of capital as well as community interest. The idea of NFT staking and NFT personalization gives more value to NFT holders, besides owning NFT, they can also profit from it, making NFT ownership more attractive, which leads to more people participating in Cardano. The only thing is that the project has not given specific metrics so there is not enough information to determine if the project aligns with the challenge setting or not.", "q0r": 4, "q1": "Regarding the team, they have given information about each team member including each person's experience and skills. The skills and experience of the team members are appropriate to complete the work. As for the risk, do they realize the difficulty of programming on the Cardano blockchain. But in my opinion for NFT projects the biggest risk is related to building the community, because without the community that loves your NFTs no one will buy those NFTs, so the marketing part and community building will be the decisive factor to the success of the project and also the biggest risk of the project. Regarding the budget, they have divided the budget for each role and in a specific period, they spend 60% of the budget on marketing and community building, which is reasonable because it is very important for an NFT project", "q1r": 5, "q2": "The proposal has a specific roadmap and milestone, the milestone can be measured by the community by checking the number of NFTs minted. The KPIs that the project put in place to determine the success of the project is reaching 30,000 community members. However, the solution for staking NFT also needs to be clearer. According to my research on their website, they spend 40% of the total supply of tokens as a reward for staking, what I am wondering is when the number of reward tokens for staking has been used up, is there any way to refill more tokens for staking or NFT holder will not receive any more rewards from staking", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9468, "q0": "I rank this section a 2 because it doesn’t thoroughly solve the given problem statement and it doesn’t provide enough definition to this project’s utility. This proposal creates a bigger problem for itself than it can reasonably solve as a single project. While it might be true that many NFT assets are wasteful, this single NFT collection is only 1 out of 6200+ that have built on Cardano. I expect voters will not want to approve a $50k price tag for such a minimal impact on the given problem statement. The attempt in this framing is to help Adacheems stick out from the competition but this proposal also needs additional justification and definition to accomplish that as well. The proposals solution to this problem is by providing the native token $ACHEEMS to holders that stake their Adacheems NFTs but provides common utilities for this token that many other NFT projects provide. Catalyst voters will be aware of other NFT projects that provide users with tokens like $DING, $YUMMI, $MUTANT, $CLAY, $NINJAZ, and so many more that create utilities that exceed the list of utilities provided in this proposal. I think this section could benefit from either reframing the problem to impact, or adding additional utilities that appear more competitive in the NFT space. I think this is a very well written proposal that needs more substance to uphold Catalysts mission statement to generate the highest levels of community innovation. ", "q0r": 2, "q1": "My impression of this feasibility section is that it appears there is relative favor in the projects chance on delivering what is outlined, so I rank this section a 4. The first section I look at is the core development team, to determine if the proposal has access to the capability to accomplish the plan at hand. I have no doubts that this team could reasonably accomplish it but I would suggest including education in each of the member’s proposal bios because it may appear to many voters that this is just a team of crypto/NFT enthusiasts rather than a team of entrepreneurial professionals. The roadmap looks completely fine as it’s outlined with perfectly reasonably achievable tasks. The budget definitely needs some further clarification as I think there are essential details missing that voters will be looking for. The outline and list of categories is perfect but I think it would greatly benefit the proposal to further breakdown the hours of labor needed, the specific costs of each of these categories (especially marketing/events), and some brief descriptions of some of the roles that have been mentioned for the first time here (like why there is a need for customer care reps and what kind of content creators). Overall, I think this section of the proposal does it’s job to positively demonstrate capability to reach completion but there is a lot of work that could improve it for voter confidence. \n", "q1r": 4, "q2": "As an auditibility section that provides some measurement of success I rank this section a 3. As much as I appreciate this section providing channels for public accountability and explanation of community sentiment that they would like to see, the only quantifiable measure of success that this section provides is reaching 30k members by the end of this year. If you breakdown the cost of that metric (or what results this proposal is asking Catalyst to pay for), each member costs $1.66. This section is an opportunity for a proposal to prove to voters that they are holding themselves to an ambitious standard of success that is measurable and quantifiable. The best proposals set targets for various milestones in the life of the project, and that can include additional metrics like social media following/engagement, secondary market sales of NFTs, percentage of NFTs staked, percentage of NFTs sold. I’m neutral on this section because there’s not a lot of performance that I expect from an NFT project but there does need to be something here for voters to evaluate. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8650, "q0": "Through the idea of ​​building an integrated NFT value-optimized ecosystem on Cardano by NFT trading, NFT personalization, the practical application allows NFT holders to participate in the real and virtual interactive events (exhibitions, mementos, draws, ...), the proponent's prospect is to create lasting value for users to further foster interaction and adoption Cardano, I think the idea somewhat fits the Challenge key metrics.\nTechnically, the concepts and explanations of how the platform works are easy to understand, as this idea is relatively common in other blockchain platforms and the provider has also provided us with a link illustrating their operating model. To demonstrate the usefulness of the idea, the proponent analyzed the shortcomings of the NFT projects built on Cardano.\nI think using Cheems image to develop NFTs can only attract users in the period where this Meme is popular, you know if it is a trend it will be a downtrend, and what if the user is not interested in it in the future? In my opinion, only using the Cheems image as the main theme for building the NFT somewhat limits diversity and creativity in the ecosystem. As far as I know, in other Blockchain platforms, NFT Cheems is also very popular, the proponent mentioned how to solve this problem is to try to promote users to see the competitive advantage of holding and investing in NFT on Cardano, this seems to be the only and effective method right now.\nHowever, the outlines of the project's success and what it brings to Cardano are quite vague, the proponent could add in key predictors such as the number of users, the number of NFT transactions, etc. are expected in the timelines after the platform is put into use.", "q0r": 4, "q1": "The project development plan is clear and straightforward with milestones and the work to be done within them. Because of the nature of the project, marketing is seen as central to the development of the user base, fortunately, I have found their marketing policies. However, they mentioned that the work items and targets have been completed in Q3 / 2022, meaning that the marketing and community building work is already in progress, so the proponent can share access links to their social media and community group here as a basis for a project feasibility reference. The expense allocation sheet includes the amount paid for the required facilities / activities / personnel. I just have a little advice that the cost for personnel can be further detailed, the proponent can estimate the members' 3-month working hours, which increases the audit ability of the proposal. However this budget table is not the cost for the entire project, if the proponent has other budget plans for the next quarters (e.g. continue calling for funding at the next Fund, self-financing, call for funding from outside, etc.) can be mentioned in this section. The working experience of the main members in this project shows that they can do this job well, their reliability is also enhanced through the links to the profiles of the personnel.", "q1r": 3, "q2": "The proponent came up with various ways for the community to track the progress of the project (Github, weekly KPI report, media announcements), I personally love these tools because it is quite convenient and easy to follow. However, this is a project that has been completed in 1 phase (Q3/2022), it would be great if proponents can provide links to these metrics for past as well as future work performance tracking. On the other hand, this project has not given specific KPIs to depict future success, what they mention is only at the level of their concept and expectations. KPIs should be shown in specific numbers, for example, the number of people joining their community, the number of NFT transactions, the number of new users entering the Cardano ecosystem, etc after the proposal is officially put on the market.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8560, "q0": "According to the proposal, the other NFTs on the Market are too wasteful to just be on display. This proposal speaks very well with the objective of the challenge, as it seeks to bring an NFT world that includes economy, real-world connectivity, and stronger interactions for owners. There comes the ADACHEEMS NFT. The idea itself corresponds to the challenge's objectives. It is clear that the objective is to further drive real value for NFTs. It is encouraging that the author describes the activities that would be included on the Dapp platform, providing us with a more precise picture of how it would function and how the project could benefit the Cardano ecosystem. It's quite promising how the author identifies precisely who the project's target audience will be, demonstrating a crucial sense of reality: he understands what he's going to accomplish and for whom he's going to do it. Also, I thought it was really helpful how they explain why they chose the image of the Cheems dog, so that individuals who are unfamiliar with it may completely comprehend their proposal. Overall, I don't have anything negative to say about the proposal's impact; it's exactly what we're looking for in this challenge. So I think it's a very intriguing, unique idea that may tremendously improve the Cardano ecosystem in a variety of ways.", "q0r": 5, "q1": "The attached whitepaper is a useful resource that holds the reader's hand as it details not just the problem and solution, but also excellent graphics to demonstrate how they will achieve their objectives. In terms of team members, the proposers give proof for their work, including useful references, and have already completed the work items and targets in the third quarter of 2022. This is a very encouraging sign, and it appears that the team has the necessary abilities and expertise to carry out the project. Furthermore, they have a defined roadmap with specific and attainable near-term targets and clearly envisioned long-term targets. Given the actions to be carried out and a time frame of a quarter in the roadmap (particularly, Q4/2022), the proposed amount of $50,000 is reasonable. It is also clearly divided. The budget is acceptable for each role's today's salary and includes sufficient information about how much the item would cost. One point of concern is that the requested financing only covers three months of a 12-month project. This project will require continued financing to continue beyond the next six months (the first 3 months has been completed). I would advise the team to evaluate it as a possible risk. Overall, the proposal definitely has the potential to become a very powerful project, which will drive adoption and attract new people into the ecosystem.", "q1r": 5, "q2": "Fortunately, there is enough information to assess the proposal's progress. The team appears to be well-versed on the problem at hand, including the time horizon for achieving the proposed goal as well as reasonable milestones for the community to track its progress. The proposal team included a list of features as well as a budget adequately covering how long it will take to finish. There is also an action plan outlining potential risks and drawbacks, as well as a sense of how success would look and how much value it may contribute to the Cardano ecosystem and, in particular, NFTs. It's a pity they haven't given out the potential metrics for measuring the quality or contentment of users with the ADACHEEMS NFT. However, progress can be audited based on quarterly milestones, and I believe such milestones would provide valuable information to the community related to a major, scalable challenge while the budget is very reasonable. In addition, I would expect to see a direct link to the media channel where the project's results will be updated. Overall, I believe this proposal is comprehensive and covers all of the necessary aspects that must be considered when creating an efficient proposal.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8425, "q0": "\"The proposal that aims to revamp the NFT platform in the Cardano marketplace bringing the NFTs to restart the economy is not just for show. The project will help the community of Cardano participants to explore the possibilities NFT has to offer and for them. We have a concrete operational plan. This fits the challenge setting. The future vision and mission of the project brings an economic NFT that connects the real world and increases interactivity for the future. Users around NFT and $ACHEEMS tokens.You proposed a solution that will optimize the use value and build the economy of the project with NFT with a team of long experience, we have convinced them. I have more faith in this project, but looking deeply into the project, the project has many points to solve because in the past, NFTs were basically just for display, so you need to renovate and start anew, it helps users. Use it to earn extra passive income or receive significant rewards. Because the project has not appeared in the Dapp yet, the long-term investment capital is not available, so it is very important that you carefully build each step and think carefully before you can be funded.\nThe project that adds value by not being popular on Cardano takes advantage of that to develop the project avoiding the existing risk. Can't give you a maximum of 5 because we think it's completely new, so it's a bit ambiguous, we need you to show more specific proofs in detail.\"", "q0r": 4, "q1": "\"The proponent is very determined to build this project from the details of the plan outlined for the progress and goals of the project. The proponent tries to bring it to completion when it is funded in the fourth quarter and submits it to the public. They spread throughout the current popular social network, along with specific budget estimates when implementing a roadmap to find employees and making strides in marketing and communication into advertising.\n   In regards to rebuilding the entire NFT in the Cardano engine, it takes a lot of experienced people to build them, your team has about 5 people, the designers for NFT have experience in developing the NFT. cryptocurrency, and dedicated mentoring to projects that have been done in the past, it is likely that the team will design an Adachems that brings a lot of value to the community.\"", "q1r": 4, "q2": "\" It is suggested that the progress made in the roadmap will be measured using Github.Jira and weekly KPI progress reports when the results have been achieved will be received from the media, besides that I have not seen your forecast yet. What is the method if we receive the weekly report?If the results are not as expected, will the media announcement make the community confused about this project? need more than clever methods to control. Wouldn't it be nice if the community would be able to see and judge through more specific data instead of being so general?\n   Successfully creating a valuable NFT world when loved by the community and there is good interaction between users and artists when participating in order to improve the life of income from Staking NFT or from participating in Metaverse Art Gallery that the project expects. But we look forward to this project growing further on the Cardano community of many amnrgs and bringing many intangible benefits to users.\"", "q2r": 4, "assessor": "z_assessor_2984", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8193, "q0": "\"The proposed solution is closely aligned with the challenge. The team has analyzed the “pain points” of most NFT projects now on the Cardano ecosystem; thus, the community can see the reasonability and urgency of the project. All the expected outcomes and benefits of their project have been mentioned. They clearly understand what they do and also have some strong points using the image of Cheems dog that is already recognized around the world. This will support their marketing plan at a certain level. \nThe team has a good risk prediction where they can point out the main challenges during the life cycle of the project. However, the offered solutions seem a bit general to me. The team stated that they did their best to promote their project but how can they define “best”, what marketing strategy will be conducted, which channels will be involved, and how can they approach the target audience…And, regarding the technological obstacles, the solutions are not mentioned. If the team can work a bit more on these aspects, I think the proposal would be more complete. \n\"", "q0r": 5, "q1": "\"The timelines are fully provided and the action plan has been well split into 4 phases (from Q3/2022). All the promised deliverables are relevant to the ultimate goal of the project. However, I believe the community expects a bit more from the execution plan. Let’s look at the marketing plan, how many Facebook posts are planned (e.g. 5 posts/week), what is the expected engagement (how many likes/comments per post), and what kinds of content are used… I think if the team can answer these questions, their proposal will be better in ensuring the feasibility of the project. \nThe reasonable budget allocations have been provided according to the action plan given the expenses for staff and other marketing campaigns. There is clarity in the financial plan so the community can easily track and see the efficiency of their spending. \nBased on all the information and experiences of team members, I believe they are fully capable of developing this project. The community can also check their career backgrounds through their LinkedIn accounts included. The information is transparent and adequate. \n\"", "q1r": 4, "q2": "The measurement of the project’s progress is verifiable by weekly report KPIs and announcing the social media achievements.  The team can mention specifically the KPIs (e.g. numbers of users or numbers of artworks sold by artists) so that the community can use it as a base to access the success of the project. The team has carefully visualized their goals by creating a valuable NFT world. They claim that Adacheems will become a phenomenon in the future so I expect some solid proof here. Since the project has been launched and received positive responses, the team can update the current status or some data (e.g. the number of media followers) to better support their claim.", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7965, "q0": "The intention is to build the AdaCheems NFT project. The intention is to build the economy of the NFT. The problem is that many NFTs do not have their own economy. I don't think this project will add value because there are already many similar projects that want to achieve the same thing. Only 4000 NFTs will be sold, 1000 of which are in presale. So some people will have more than 1 NFT from this collection. The goal is to provide the NFT with staking, making it interesting for people to buy it. A number of risks are included in the proposal. It would be useful to include in the proposal how to ensure that the tokens created by the NFTs remain high in value. If the creator of this proposal can ensure that the value of the tokens remains high, this will have a greater success.", "q0r": 2, "q1": "The proposal contains the linkedin's of the various members who will be working on this project. The proposal describes the number of team members needed to bring the project to a successful conclusion. There is a breakdown of the budget that clearly states where the funding will go. It is good that a lot of money goes into advertising the NFTs. I think it would be better to take a longer time frame to complete this part of the project. It would be interesting to include a more detailed implementation plan in the proposal. The plan describes the financial means to make the project a success. There are a few technical aspects included in the proposal such as product design, technical design and marketing. A few risks and challenges have been taken into account. I think an important risk is still missing. How are they going to ensure that the value of the tokens will remain high. The higher the strikes, the more interest there will be in the NFTs. There will also be a lot of competition if a few more similar projects come out. How do they ensure that the project is more unique than another.", "q1r": 4, "q2": "A roadmap with milestones is available. There are no clear dates included in the proposal. This would give the community a better picture of the implementation of this project. A few KPIs are included in the proposal. It's good that transparency is offered with Github, a weekly KPI report and by showing the results of the project through media channels. I don't think there will be a real problem with starting an NFT collection like that. Sufficient similar projects will be started up in the future, such as those that already exist at Solana.", "q2r": 3, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5627, "q0": "I think the identified problems are aligned with the challenge. In order to bring about more value to enrich the Cardano ecosystem, bringing in NFTs with use-cases that have benefits to a wider community must be the primary goal for most NFT projects. On a side note, as the proposal addresses NFT value optimization, the proposal will be better off by acknowledging the distinctions between utility-based NFTs and fine art NFTs. As a community moderator of a CNFT fine art project, fine art projects are not well-positioned to be assumed under the same umbrella as utility-based NFTs as artists would want the art as the primary focus. \n\nBut, I find the impact of the solution given as minimal. The value of its entire ecosystem seems to be founded on the use-cases of Metaverse Art Exhibition (MAE), which determines the value of its governance tokens, hence staking rewards and NFTs. Yet, I fail to see how MAE stands out from several other projects with similar use-cases such as Pavia and Cornucopias in their use-cases due to the brief descriptions of its functions. What sort of art events MAE would organise, what kind of artists it seeks to attract, what is Adacheems target audience to make MAE a success? These questions are not addressed inside the proposal. Without addressing these problems, it is impossible to ascertain the future scalability and potential contributions of Adacheems in the Cardano ecosystem. \n\nBesides, I find this proposal to be confusing. There is a brief mention of Dapp, which is a primary focus of this Challenge. Yet, the proposal does not address what the Dapp would be for. My guess is the proposed MAE would be the Dapp. Should that be the case, the proposal fails to address how the MAE is a Dapp. \n", "q0r": 2, "q1": "The proposal does not provide a detailed explanation of the team. For instance, the proposal does not address each member’s professional experiences, responsibilities within the team and how their knowledge is useful for this project and Cardano, more specially, this challenge. This does not convey much confidence in carrying out Adacheems successfully. Besides, professional experiences written in this proposal and LinkedIn have huge discrepancy which leads to further confusion on their actual capabilities. For instance. Mr. Robinson is said to have 5 years of experience in communication and content creation in the proposal. Yet, his LinkedIn shows he has only 1 year of experience in relevant fields. More clarity must be given to convey confidence. \n\nCoupled by the team’s unverifiable experiences and roles in this project, their non-existent track record further dampens the feasibility of this proposal. \n\nRegarding budget, the proposal gives very few details on how the fund allocated would be spent. To illustrate further, under the marketing department, “1 project manager $3500 / 3 months”. This is a little too vague. What are the supposed project manager’s delegated tasks? Without specifying the team’s roles, there is no way the Catalyst community can ascertain if the fund allocated would do justice for the personnel’s responsibilities. \n\nThe timeline is very ill-prepared as there is insufficient information (milestone, target) that determines the progress of this project over time. This brings about an impression of a team that does not have foresight for the future. Besides, it is said work/targets for Q3 have been completed. After further investigation, I found out the project has extremely lacklustre Discord development and Twitter activities, which are said to be at  completion stage. The dissonance found is deeply concerning as the team does not practise proper communication. \n\nFinally, the challenges identified in this proposal apply to the NFT scene of all chains. There are no project-specific challenges. Besides, the proposal does not address the potential challenges for Dapp development. More details are needed to understand what is happening or might happen to the project. \n", "q1r": 1, "q2": "The roadmap provided is very vague and does not give enough measures to evaluate the project’s success from its inception to implementation. The established KPIs are also insufficient as the proposal states the KPIs are reflected in the roadmap. Besides, what constitutes its weekly project progress report and results on media channels? What leaves me unconvinced by its KPI is its notion of “being loved by the community”. I do not see a direct correlation/causation between community loyalty and its contribution to this challenge. Furthermore, achieving 30,000 members within 3 months (from now to Q4 2022) for any CNFT project at the moment is a huge feat, this might be a little too far-fetched and unrealistic. ", "q2r": 1, "assessor": "z_assessor_2729", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3196, "q0": "The proposal uses the same part of the text in the problem statement and the summarized solution fields, while they could have invested the problem field in backing up their statement of why the NFTs are too wasteful, or at least explaining who are the “other” NFTs. \nThey explain later: NFTs built to display are wasteful because they have no practical application. So, basically, if doesn’t have a practical application, the art seems to be useless in the view of the proposers – and this leads to the question of who decides what is wasteful and who doesn’t. In any cases, as an artist and researcher, I can say that the proposal seems to have missed the whole point of art, which is to be displayed. This is the purpose of art (at least one of the many other purposes). Therefore, this can be understood as some internal contradiction in the proposal. If they are building a solution to artists, why to say that displaying NFT is wasteful? They might be referring to the issue that there’s too much hype or too much art that they don’t like (which is fair, I’d agree).  But to say that it’s wasteful goes against the principle of creating spaces and technologies that allow art to be created and distributed, either good or bad art (a definition that is always subjective). It can be that the proposal just applied a bad way of formulating the issue of too much hype in the NFT market, but then the proposal should demonstrate more awareness and choose proper arguments to defend this point and still show that they are bringing a solution to all artists, either the good or the bad ones. Either the art that has practical utility and the one that hasn’t. ", "q0r": 3, "q1": "The proposal provides information about team members and they have experience with the field of NFTs. However, the project presents a “Budget to complete each Quarter 4/2022”, however their roadmap goes until Q2 2023. This creates a bit of confusion to the reader trying to understand where and when exactly the items in the budget will be spent. With this issue, it’s difficult to assure with certainty that the proposal is feasible on its budget plan. And there are items in the budget that weren’t well explained in the proposal “Building community with real-life activities” or “ Events for users” – these, for example, should have more details for the community to assess how exactly they will contribute to the budget plan and proposal’s success. ", "q1r": 4, "q2": "The proposal does not clarify what will be measured specifically, they are using their own roadmap as metric, but the roadmap has a few issues on its clarity, as I detail more below. In addition, they are using their KPI report as a metric. However, their KPIs have also issues (explained below) and they do not let the project to be auditable during its execution, only after its concluded. To summarize, the proposal needs to be better designed to have a clear metric and a compatible explanation of how this metric will be tracked during the project execution.  \nThe roadmap is not well detailed. One that reads the proposal’s roadmap can’t be sure of why those items are presented in that order, based on what is described in the other sessions. One example among other possibilities: what are the charity events or the personalization events? How these events are related to the proposal. And they don’t clarify what are the key milestones, as it’s asked in the section. More clarity in that part would make the auditability easier when it’s made from people external in the proposal. \nTheir KPIs are presented in the description of the solution, but they are actually action items, and not Key Performance Indicators. They don’t reflect the performance, but the characteristics of their solution. Ex: “2) Personalize NFT according to user preferences”\nConsidering all these issues above, a score of 3 is appropriate in this parameter.\n", "q2r": 3, "assessor": "z_assessor_2409", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3082, "q0": "NFT responds very well what is the search challenge. The idea is to optimize the value of use and build the economy of NFT. Bringing a NFT world including the economy, connecting the real world and more powerful interaction for NFT holders. If the project is successful, it will solve the optimization of NFT's use value, helping users to earn more passive income, personalize NFT according to the preferences of users, organize interactive events. between artists and users. It is also sure to increase the number of notification codes and are traded in many NFT trading platforms.", "q0r": 5, "q1": "The team seems very competent, they have developed the whole concept of image identification that we can learn through the website attached and also through the image of a character provided. Directly in the proposal. They also provide a short description of their people, including their role and some past jobs, so they can reassure you about their experience. And they really seem quite experienced, for example, according to the description given, Teddy is very smart with the position of project executives, has participated in the cryptocurrency market and blockchain for more than 5 years, Research and collect NFT from other platforms and construction hours at the Cardano ecosystem platform. As for financial division, it is good that they have determined exactly how to use the total sponsorship (quite high, but reasonable). These two parts of the project account for a high proportion of money, which makes us need to better understand what is happening. In marketing, the proposal explained how the spreading campaign will take place, what channels are done, how to approach the objects? But it is important to understand exactly how this will happen. Talking about development in each stage, I think this part of the project is quite detailed so that we have a fairly accurate picture of what will happen, when and how, the way it must happen . So I think this topic here is very good, I just offered to dig deeper details in some quoted parts. The project is completely new with the desire to optimize the application of NFT and build the economy in Adacheems.", "q1r": 4, "q2": "Excellent testing ability, the group determined how successful in detail would be like, so we have a lot of content to monitor. In addition to the special topic created to understand the KPIs, we can go further during the monitoring process because they also detail the stages will be like, that is, we know what will happen and When, to be able to check what is happening as promised. That said, I believe that the audit of the project is being carried out very well, it only needs to be implemented by the community.\nThe management of the project progress through GitHub, Jira, the KPI report on the week progress and notify the results achieved through the communication channel proves the proposal is very focused on the community, wanting information soonest to come soonest. Community to attract the attention of the community. Thereby the community grasped the project progress as soon as possible and had faith for the project to be successful.\nThe budget analysis table of the proposal is quite detailed with the salary allocation to the HR department, the art department, marketing staff, marketing and communication budget. With the total budget for funding of $ 50,000, I think such budget is reasonable for the project to be able to implement smoothly and bring success to the project.", "q2r": 4, "assessor": "z_assessor_2397", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2382, "q0": "According to the ideas conveyed by the proposal, it is possible to notice that its objectives are in fact aligned with the goal of the challenge in which it finds itself. In addition, the main objective is to bring more value and attention to NFTs, and we know that in fact today their use is not used to the fullest. With this, a future success of the project would help bring greater visibility to the Cardano ecosystem in the long term, when the NFT market is more developed. But, it seems that a negative point about the impact of the proposal lies precisely in this fact. Perhaps the market has not yet reached a sufficient level of adoption in relation to the acquisition and use of NFT's for the ambitious goals of this proposal to take effect. We noticed the request for an amount of funding that is consistent with what is planned to be done, but we are in doubt whether this is the best to carry out the activities presented in the proposal. In short, it may be that there is still not enough engagement in this market for the desired features to be achieved.", "q0r": 3, "q1": "Regarding the activities foreseen in the project timeline, we noticed a good general organization, with cohesive actions that evolve gradually. It is also good to see that there is already work developed in previous quarters. The professionals involved in the project also belong to different areas of knowledge, creating a comprehensive work ecosystem. In addition, we noticed in several quotes throughout the proposal a concern with the marketing of the project, a factor that would be fundamental in this case. But again, it seems valid to mention the existence of the possibility that the ideas being transmitted as new features for the NFT's do not find a sufficient target audience to maintain the necessary traction that makes this project sustainable in the medium and long term. A possible concern would be the initial attraction of a number of users that ended up not being maintained, something that occurs today with many initiatives involving NFT's. Regarding the budget distribution, we see a consistent division of expenses, it is also interesting to have internal team members focused on the development area, helping to mitigate expenses. We were also able to find a very considerable amount of $15,000 going towards advertising campaigns. Another beneficial point is that the professionals involved made their CVs available so that their experiences could be proven. In general, the project seems to have solid concepts and to understand well where it wants to go, but considering the previously mentioned reservations, perhaps a more adequate strategy would be to centralize efforts to create a new functionality for the NFT's, instead of trying to form a very complex.", "q1r": 3, "q2": "We have that this proposal has fundamentals linked to technology, and in fact we were able to find auditability metrics related to this fact. That is, there is a quote here that tools like GitHub and Jira will be used so that the development and goals being achieved are easily visualized. Measuring weekly KPIs is also a great practice when it comes to software development. We noticed that the perception of success developed by the team matches well with the whole development of the idea. Additionally, more numerical targets to be achieved over time could have been mentioned. For example, it seems interesting to establish a certain number of shares to be reached about the idea on social networks or a certain volume of native tokens to be traded.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1500, "q0": "It is proposed that a decentralized application (Dapp) with the name ADACHEEM be developed with prominent features for NFT that the Cardano ecosystem does not really have at the moment. These features include staking NFT, creating NFT according to personal preferences, and staking NTF to earn additional passive income. Additionally, it can assist users and artists in interacting with one another through the Metaverse art gallery. By creating a token known as $ACHEEMS, which is an intermediary coin that can be generated from your NFT staking, lending, and staking and that is tradable on DEX exchanges, you will be contributing to the growth of the industry. As a result, the project improves, and the team is able to acquire additional operating funding. In the long term, if you build a strong community, it is likely that the decentralized applications (Dapps) you develop will alter the perspectives of a large number of people regarding NFT. This will make it possible for users and people who are familiar with blockchain to understand. Cardano more.\n\nConcerning risk, you outline two primary risks, and your advice on how to address them is straightforward and effective. However, there is a third risk that you should take into consideration, and that is the possibility that the price of ACHEEMS and the ADA coin will drop precipitously in a bear market. As a result, you should make preparations for the value of your ACHEEMS coin to drop significantly as a result of a sell-off. And one more thing is that if the price of the ADA coin drops in accordance with the current cycle, then with the funding level, as you ask for $50,000, you will take into account the level of the coin. This will happen whether the price of the ADA coin goes up or down. ADA Slippage or Not? This is a matter that the author intends to pay attention to, particularly the current price of ADA, because it is an issue. Despite this, I will continue to give this aspect of the impact 5 points.", "q0r": 5, "q1": "As for the development roadmap of the project over the course of four quarters, with the first phase occurring in Q3/2022, you have completed it with your own team and ability. There is no need to get funding from the fund first or not, and this is the stage where you have spent your own money to implement it. You should have a list of the work you will perform by the time you reach the second phase, which is the fourth quarter of 2022 (this is the period during which you apply for funding). This list should include product design, technical design, and introduction. introduced to the community, which I believe is fairly comprehensive. Having a look at the breakdown of costs that you provide in the proposal, I can see that you have spent a total of $44,000 on advertising, marketing, and communication, whereas your road map consists of three primary components: product design, equipment engineering, and marketing communications. I see that there is a distribution of funds that is not really reasonable, or you guys have tilted the project more towards the media part to attract the community; could I hear your group's explanation of this part of the situation?\n\nYour team is comprised of five individuals, each of whom has a link to a personal page that can be verified as being specific and accurate. Furthermore, your capability has been demonstrated through the experiences that you have gone through, all of which come from four to five years of experience in the field that is required by the project. In light of the foregoing, it is my opinion that your team is more than capable of carrying out the successful implementation of this project, regardless of whether it is funded by this fund or not. If it is not funded in this fund, please make every effort to fund additional funds. follows As a result, I will give this potential piece a score of 4 points.", "q1r": 4, "q2": "That you have the determination to show transparency and clarity to the community by providing a weekly update on the status of the project through the communication channel that the group uses also demonstrates that you have that determination. And because this is going to be a lengthy and extensive project, it is essential that information be updated on a consistent basis so that the community can keep track of it as rapidly and accurately as possible. And after the end of the fourth quarter, were you able to come up with a number of 30,000 people participating in your Dapps? This is a positive number that can be achieved with the help of the benefits of staking NFT that you mentioned earlier. This will result in the Cardano ecosystem and user base growing to even greater proportions. As a result, I will award five points for the auditability section.", "q2r": 5, "assessor": "z_assessor_2254", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12943, "q0": "The proposal is about to bring economic value and to optimize the application of NFT and build an economy of Adacheems and making the nfts the long term investment.\nBy building the projects around it and optimize their values. The Proposal also has a good approach in which plan have mentioned some of the things like Staking , Personalized NFT ,integration of products that drive the real value of the nfts .\n The Proposal have mentioned each and every thing in very elaborated way .\nThe proposal clearly explains how the proposal can add value to the cardano \necosystems. By looking at the proposal and approach to the plan is Explained very clearly, BY this I strongly agree that the proposal clearly addresses the challenge .", "q0r": 5, "q1": "The proposal have provided the detailed plan which includes Timeline, Budget Breakdown, and the information of the team .The development of the project and its target works is mentioned very elaboratively and which helps to assess. The Proposal was previously funded and looks like the funds were utilized in perfect way . \nThe team looks very professional and have a lot of experience .The Plan involves the Product design, Technical Design( Which involves the programming ,Database, Designing )and the last is marketing which involves the building the community on social networking sites like twitter, Discord ,Facebook.\nThe Budget breakdown is great , everything mentioned on the proposal looks like sensible .The proposal offers a very sensible timeline to complete the goal,\nThe budget is reasonable to achieve the set of goals .\nI strongly agree that it is highly likely that this proposal will be implemented\nsuccessfully", "q1r": 5, "q2": "The Proposal is monitored weekly because the every update will be posted onto the github. Users and artists involved in the project also have a better life with income from Staking NFT or from participating in the Metaverse Art Exhibition. And thus help attract new users to the Cardano ecosystem . The roadmap/approach to the solution of the proposal is a very clear and by looking at the progress until now we can say that the team is very much dedicated to achieve the set of goals.\nBy this I can say that this proposal provides me the sufficient information to access the progress in attaining the stated goals\n\n", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13339, "q0": "This is an innovative project about NFT, I believe that if the project is successful, it will attract a lot of individuals and organizations to use NFT in the Cardano network and the real investment in the long run, not in the long run. Surfing speculation like other platforms at the moment.\nThis project has many very practical utilities such as Staking NFT to create a passive collection, artists and users can interact with each other through the Metaverse art gallery, Personalization according to user preferences, and other features. Security and the project's $ACHEEMS governance token are the differences between managing NFTs on other blockchains and other projects.\nIn addition, the selection of a picture of a Cheems dog is also quite good and unique, I also like dogs.\nAll in all, I appreciate your suggestion and look forward to seeing the project succeed, thank you for giving the community a great idea.", "q0r": 5, "q1": "The project development plan is distributed by the team in phases from the third quarter of 2022 to the second quarter of 2023 with clear timelines for each work such as product design, engineering design, and marketing.\nCorresponding to each work item, the budget table has also been broken down according to those jobs in the fourth quarter of 2022 after being funded for this roadmap, the costs are optimized in detail and reasonable with the average number of programmers today.\nThe team members are also described in detail about their skills and working experience in the blockchain and programming fields so that the success of the project is only a matter of time.", "q1r": 5, "q2": "The presentation of the problem and solution as well as the clearly described and detailed work path, and the specific deliverables/milestones make the audit easier, the team also publishes the KPI results in weekly progress on media channels, so there is very high transparency.\nHowever, if it is better, the team should make available links to those progress report items so that the community can easily click on them to view them more quickly, such as website links or reports on Google Sheets.\nI believe that with your enthusiasm, passion, and creativity, the project will be successful and thereby attract more users to the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "AdaCheems NFT Project - Optimizing Use Values and Building the Economy of the NFT. We bring an NFT world that includes economy, real-world connectivity, and stronger interactions for owners.", "experience": "Development team experience:\nArtis: Mr.TianRen\n4 years of experience in the field of NFT design\nCTO: Mr.Peter\n5 years of Developer experience in BlockChain (Smart Contract)\nCEO: Mr. Teddy\n5 years of experience in crypto and NFT investment"}