{"id": 414140, "author": "alex.pipo", "title": "ADABET.iO | Cardano Betting DApp", "url": "https://cardano.ideascale.com/a/dtd/414140-48088", "category": 26595, "amount": 125005, "description": "Currently, most of the profits belong to the bookmaker and there is a lack of transparency, the rights, assets of the bettors are violated by the unreliable centralized traditional betting platforms.", "f6_no_assessments": 6, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 5324, "q0": "The authors have proposed betting on popular sports competitions in the world, professional sports tournaments such as football, basketball, tennis, racing, and golf ... They are sports with added value. very large and global.\nThe proposal focuses on building a betting platform based on the features of WEB3 and allowing it to work on the Cardano blockchain. An excellent idea and solves a lot of problems such as incorporating blockchain into a traditional betting platform, making betting transactions transparent through specific blockchain transactions on ADA cryptocurrency, Increasing identity security for players, and ensuring ownership of player assets on the blockchain and is a decentralized platform for betting players.\nThis is a bold proposition and will impact a wide range of participants in this ADABET.iO platform. I can see ahead of time: ADA holders can participate in playing on this platform, people who like to bet on sports, people who want to experience Cardano's DApp ecosystem, or simply traders investors can be objects when the project is implemented. The proponent has a very broad market view and observes the size of the market and the most natural approach to this project.\nI can quote a few important pieces of information about the market that the author team mentioned: the proposal aims at a betting market with a value of 100 billion dollars per year, in 2021 the global value is $76.75 billion and will continue to increase 10% each year after that. That is a very impressive statistic about this industry that the author gives. Even better when a part of that value is converted or participated in ADA coins on the Cardano platform, ADABET.iO is a pioneering project, maybe it is officially from the launchpad of the Cardano ecosystem to participate in the market. global betting market.\nI congratulate the author team for having a good and intelligent idea when combining many elements for their project from Technology to markets and players. If you need some advice I hope you implement it as soon as possible.", "q0r": 5, "q1": "I have looked through the list of members participating in this project. They are really technology lovers, experienced or more precisely they are creators of digital content creation products on the internet platform. They have experienced many jobs such as mobile application development, game development, and entertainment contents, applications on mobile platforms. In addition, they are also IT specialists of large companies in Japan and they have worked together at some point. With an average of more than 10 years of working experience of the members, some of whom have participated in the proposals from fund8 before, I think that the author team is completely capable of implementing the project. based on their previous experience.\n\nThe roadmap of proposal is really detailed and given each small item only those who write the project and think carefully can do such details, they understand very well what the ADABET project needs to do. A variety of tasks are listed such as system design, front-end programming, backend, computer graphics, software testing, or blockchain programming...\nIn a short time of 3-6 months, the team launched the MVP version of ADABET dApp which is completely achieved.\nThe details of disbursements are mentioned in full by sections and teams: here the proponent presents sub-teams and tasks to them (System Design, Blockchain dev, Frontend, Backend, Graphics Design, Marketing). ...)\nwith a total project budget of $12,5005 including a 10% provision for risk management in it, this is a very modest number for the development of such a large Betting platform. I understand that you have estimated costs in the most reasonable way to compete with projects up to $ 400000 or up to $ 800000. Really, you have a team that works and completely evaluates the exact capital needed for the project. Not many projects have as detailed a budget allocation as the team that wrote this proposal.\nI believe that you are doing a good job, and look forward to being the first customer to experience your project.", "q1r": 5, "q2": "I have read very carefully the audit and tracking section of this ADABET platform proposal. You have come up with the necessary indicators to measure the success of the project such as:\nThe number of functions of programmed platforms.\nThe number of accounts registered to the ADABET platform.\nThe number of people participating in ADABET's community channels.\nThe number of ADA wallets connected to the platform.\nAttached is the GitHub for the project as well as the management team and chat community for this project.\nThese are absolute indicators that the community can easily see and track throughout the project's formation and development.\nThe most intuitive is that the success of the project will be implemented directly on the main website of the ADABET.iO project, which is great and ensures transparency for those interested in your project.\nThe proposed team has extensive experience in developing software projects and learned to apply scrum workflow for this project, which is a modern and fast process for solving software projects that need many participants. They define the main tasks and the small tasks that need to be completed that not all teams are aware of.\nFurthermore, the definition for the successful nature of the proposal is also mentioned as:\n\nBuild the platform with servers that connect and operate the Cardano node directly, Cardano-DB-sync for project development; Complete data communication APIs in the system; Build a wallet of the ADABET platform that serves customers to create and manage their assets; Fully built betting features of the platform; Build smart contracts in staking transactions; Build ADABET's community channels; Design tokenomics for the platform and release $ABE for games in ADABET.\nThese success criteria are very important in the project and you guys have focused on them. You guys are doing the most meticulous work in each stage of the project, which is very good and makes ADA holders like me feel secure about these Cardano-based projects. Let's enrich the Cardano DApp ecosystem.", "q2r": 5, "assessor": "z_assessor_2691", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 6085, "q0": "Sports betting - it's a very interesting topic, I'm a sports fan and watch TV channels and live matches at the end of every week. Usually, we bet through our live tickets with the bookie. Compared to your idea, this is a very useful and convenient proposition for bettors like us. It is true that traditional betting platforms are often limited by many things, be it rates, payouts, systems, and security all potentially unsafe and lack transparency.\nCentralized systems can be subjectively compromised by these restrictive properties.\nWhen I read your project carefully, I see that ADABET has great potential to replace traditional betting platforms like we are participating in. The features you mentioned like live bet, prediction bet, pear -to-pear bet finds that very attractive. Especially when your proposal allows you to bet in crypto without the need for a credit card, which will be more accessible to customers due to fewer barriers from traditional methods. You incorporate many techniques into this project such as Cardano Blockchain Technology to ensure the decentralization of the platform, and Web3 technology features to ensure the ownership of customer assets on the platform, they are all suitable technologies and can realize your project.\nI am envisioning a scenario where players own ADA coins and play sports betting games on this ADABET platform, they will have exciting and completely new experiences, fast trading, and asset management. 24/7 full time. It has a strong impact on betting enthusiasts as well as those interested in crypto transactions. Given the size of the crypto market and the sports betting market, it's an overwhelming resonance beyond the Cardano community in particular.\nIn this proposal, the KPIs are mentioned as The number of accounts registered in ADABET; The number of regular players on the platform.\nThese indicators are easy to measure and define, you are in the right direction with the target and the market size is good enough to develop this proposal.", "q0r": 5, "q1": "This is one of the most well-thought-out proposals I've seen on this Fund9, the sections are clearly written and all elements are clear. The first thing to mention is the roadmap, the proponent mentioned every small detail to do with the timeline for completing those tasks. Here you are divided by quarter with accompanying tasks, in addition to listing the teams involved in developing the listed tasks. I very much agree with the way you guys do the roadmap for such a project, it always ensures that all work is not left behind. The short-term and long-term successful goals in the proposal such as Complete the functions of the ADABET platform, releasing the PC version, integrating the ADA wallet into the system, and programming the betting transactions. Those are the core of the project that the proponent has laid out and are very well timed with the original roadmap. I tried contacting the team that developed this project, it happened to be an excel file they shared and needed to request access. I contacted them and got a response from them a few minutes later. This shows the member’s Team members are very active and always ready for their project. \nA good point in this proposal team is that they have listed the participants in their proposals, I see there are nearly 20 members and they are divided into project teams to make proposals in this Fund 9. The human resources that the team has used have many skills related to the work in the proposal, they are people with extensive experience in software development and smartphone applications. With the achievements they have achieved in previous funds I believe they will develop this ADABET platform well. The required budget for the project is listed with the task and the team performing that task. Real-time work with hourly rates is very reasonable, with $40/hour for the software QA department or $55/hr for the graphic design team as a low price according to our survey. For me, it's usually around $100/hr. Also mentioned is the tax =0% for your jurisdiction, which is a good opportunity to develop potential projects. Please make good use of the opportunity and implement your project. I support this proposal.", "q1r": 5, "q2": "The resources of this project are very easy to access, the proposed team has provided a website, source-code link, and community group.\nhttps://github.com/adaboys/adabet\nwww.adabet.io\nhttps://t.me/adabetdapp\nThe information mentioned is easy to track your progress and work. In this audit, the project success metrics are listed such as the number of subscribers to the ADABET platform, the number of people integrating the ADA wallet, and the number of players and betting transactions on the platform. Those are numbers that are easy to measure and know the evolution of this proposal. The proponent of the SCRUM process for project management, task management, and my team, I find it feasible because the scrum process is very useful for developing technology projects. It defines work items clearly, continuously, and seamlessly from design implementation to product deployment.\nThe success of the project is determined by replacing the traditional betting platform with the ADABET platform that the proposed team wants to build, creating a new and useful experience for the end-users. The proposal will bring more investors as well as sports betting enthusiasts to trade in ADA tokens in our Cardano ecosystem. This is a very laudable prospect and it is open to many communities to participate.\nFinally, this is a very good proposal that I assess in this Fund 9. You can widely promote your proposal, I will vote for you soon.", "q2r": 5, "assessor": "z_assessor_2784", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 6074, "q0": "This project is special for sports betting lovers. ADA BET is the platform for integrating ADA cryptocurrency for bet trading. Players do not need many procedures to register with the house like current platforms, with the ADAbet platform you only need an ADA cryptocurrency wallet, like Yoroi, or NAMI .. Connecting to the system, you can trade translate with your bets. According to the report proposal notes, The Sports Betting Market Share is expected to increase by USD 106.25 billion from 2020 to 2025, according to the recent market study by Technavio. The report provides a detailed analysis of drivers & opportunities, top winning strategies, competitive scenarios, future market trends, market size & estimations, and major investment pockets. A very potential market for the Cardano dApp ecosystem to enter. The proposal opens up a huge opportunity for the liquidity of ADA cryptocurrency, as a channel to attract investors to the Cardano blockchain. Regarding the solution to the ideas, the proposer explains in detail each option very logically, there are not many problems in the way they come up with it. The underlying risks are addressed and are not of concern. The project is an expectation of the Cardano community as well as the expectation of betting lovers on the blockchain platform.", "q0r": 5, "q1": "It is the proposal to go into detail about the members of the development team who are experts in the field of software products with many years of experience. I believe that with the management and development experience of 10 team members and a great passion for software development, this proposal will definitely succeed. I really appreciate that your team information is very complete, which will help the community understand you more deeply. In addition, the risks you raise may affect the development of your proposal and your solutions are also very creative. I think the community will agree more with you. The team has shown a good track record by providing their Linkedin, telegram, skype, and Github profiles and skills needed for this project. The team also provides a reasonable budget with a detailed explanation. The project development roadmap is very reasonable, each quarter you complete a huge piece of work, and the listings are complete and reliable with the smallest things they mention. Besides, the budget is good enough to carry out this project.", "q1r": 5, "q2": "The documents and links are provided fully for the project tracking, the management and the internal teamwork process are very good. Not many teams have a perfect workflow and workflow like you, I appreciate the effort in explaining the roles and key functions in this proposal management. Above all, this is a very impressive project that I was fortunate to have the opportunity to review, everything here is perfect and as clear as possible. From detailed road maps, and clear budget allocations, to team identity verification, it's easy and keeps the Catalyst fund community on track. The project has seen great success and has a positive influence on DApps co-developed on Cardano.", "q2r": 5, "assessor": "z_assessor_2779", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12591, "q0": "There are many major platforms when applying the Cardano blockchain, which has solved the problem of lack of transparency about bookmakers or intermediaries earning unreasonable profits, typically auction activities. And this is completely applicable to sports betting, so I very much welcome this project.\nSports betting is extremely popular everywhere, even though it involves legal issues. Their participants still accept huge risks when participating on web2 platforms, the number of winners is very small but the loss rate is very high, which is due to the lack of transparency in the management of bookmakers. WEB3 technology I believe will completely solve this problem.\nPlayers can bet using ADA, which has a huge impact on the development of the ecosystem because the features of the project are capable of attracting a large number of participants. It is recommended that you explain these features in more detail to get a better understanding of the betting mechanics. ADABET also mentioned the issuance of tokens, I think this is really necessary as it can become the main source of the project's budget in the future. In the end, I think the amount of information on how it works, problems and solutions you give is detailed and clear, to the point of satisfying me.", "q0r": 5, "q1": "I have read a number of other suggestions from the group, all of which give extremely detailed and specific information about the roadmap, budget and member experience information, and this proposal is the same. The roadmap of the project is arranged according to actual timelines, the workload and experts who will participate in the implementation in each stage are determined, detailed information on the budget is provided, and it is quite easy to understand what will be used for what, clear hourly rates and job categories. The team's resume information is complete, it is clear that the team has a lot of experience related to dApp development, Cardano experts and related fields. The project has said to return in the next funding round, if funded, not only the funding is funded but the token release will bring a sufficient budget for the project to survive. All of the above makes me completely confident in the viability of the project and looking forward to some of the successes you will mention when you return to the next fund.", "q1r": 5, "q2": "The team did a great job at the audit stage. Here, we want to see if proponents should be willing to collect data on specific metrics, what goals they intend to achieve, and how they will communicate that progress back to the Cardano community, rather than let the community ask first, and the project has met all of the above. The project success goals are fully presented, your ambition that ADABET will replace the entire existing betting platform, this is completely achievable as the player community will soon see the advantages potential, transparent difficulties that it is effectively solving. In summary, the audit process of the project is satisfactory. I am not asking for anything more.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14684, "q0": "I have little understanding of betting software, especially sports betting software that is now very popular and has a large market. In Europe every week we use the bookie's software and choose the odds of winning that we predict. This dApp caught my attention because there is a part of my knowledge, as I observe in the market, there are few betting platforms combined with blockchain like this ADABET.iO Betting dApp platform. Your proposal is a pioneering platform to apply the best features of both blockchain to traditional systems, especially it is developed on Cardano with the best security and the most decentralized nodes compared to other systems. current blockchain technologies. Every week in the market billions of dollars of betting transactions still trade on credit cards and old centralized systems. The ADABET platform has many of the coolest new features integrated I have ever seen, (Security on the blockchain of player assets and identities, connection to your crypto wallet, allowing bets with Unlimited live matches, fast transactions, and easy cash receipts 24 hours a day real-time. Some initially worried me about the formalities, but I have seen the attachments for the licenses of the leading bookies, this is sure you have taken the right steps to solve the problems. project topic. In addition to the solutions to the risks that the proposer offers to explain the solutions, I find them completely convincing. The proposal focuses on the main goals, creating a completely new betting platform that integrates Web 3.0 technology and Cardano blockchain, the main KPIs are set up such as (the number of players betting on the platform, and the number of betting transactions). bets, number of ADA transactions, number of dealers, etc.) If invested and developed, this will be a pioneering platform to replace the current traditional platforms because everything is focused on the centralized system of the bookie. I respect your project, a brave and revolutionary project in the field of cryptocurrency and betting.\n“The brave respect the brave”, wish you success.", "q0r": 5, "q1": "I don't know if you're an expert accountant, but this proposals list of budget items is very clear. Things like license funds, tax funds, hedge funds, and tax funds in addition to the main work expenditures of the project. Few proposals have a balance sheet as good as yours. With a total request for the entire project of $125,000 compared to the total budget of the Dapps challenge, Products & Integrations ($7,850,000) represents a very small 1.59%. Combined with this budget sheet is a work schedule packed with listed items, the details of which are related to the accountability in the budget section. Project from Q3/2022 to Q1/2022 with extensions and marketing programs for the product when completed. Proposing to implement many necessary items such as (System design, platform content development, player functions programming, Cardano blockchain integration, smart-contract programming, and product quality assurance). I think that's important work for the development of a large software platform like ADABET.io Dapp. The team that develops this proposal are people who have worked in the software development industry for many years, developing games and applications on iOS and Android platforms. I went through their profiles, their LinkedIn, and the positions and companies they worked for. It is a team of talented people with skills in programming, networking, blockchain, UI design, and cloud computing. In short, with many years of working together on previous projects, they have the ability to execute this proposal in the best way. I fully believe in the feasibility of this project.", "q1r": 5, "q2": "This is a very structured development project, the project team members are software developers, and they use specialized processes to develop and manage the project's progress. The tasks in the scrum process are clearly defined by them, and the roles of the member, product manager, and product owner are assigned full responsibility in their process.\nWith a team of almost 10 members developing the project, this is the process in my opinion that is suitable for a team of the same background. In addition, they provide complete documents and links so that the community can follow the progress of this project. I don't see any problem with these documents, the members are doing great. The success of the proposal is to bring a new experience to the betting platform on the blockchain, promoting the ADA cryptocurrency market as well as the sports betting community.\nNow after every sports match, after each bet you will immediately see the ADA number in your account, a very interesting and entertaining part of this ADABET.iO dApp platform. I will test this betting platform of yours in the near future.", "q2r": 5, "assessor": "z_assessor_4091", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14848, "q0": "There are 3 things I would like to present the insights and feasibility studies of this Adabet.io proposal.\nFirstly: The project has a large market size including the combination of the ADA cryptocurrency market and the sports betting player market. Several reports are quoted from the websites provided by the proponent, in 2020 alone the global market for betting is worth nearly 80 billion dollars. If this is combined with an open and dynamic cryptocurrency market like the ADA community, the market cap of the betting market is even larger in value. So this is a proposal that impacts a wide range of participants and communities beyond Cardano.\nThe second: ADABet is an advanced technology platform, it is built with the best features that Web3 is forming, in addition to a Cardano blockchain platform famous for its decentralization and security. These technologies and techniques make the ADAbet dApp platform somewhat superior to conventional betting systems.\nThe third: The goals and implementation solutions are carefully calculated and there is no contradiction, the risks are all hedged (in terms of development team, technology, or ADA coin price). The license and legal procedures mentioned help investors or those who vote for this project more confidence. Those are some of the things found in this proposal, which, as observed with other proposals, have a very high degree of completeness.", "q0r": 5, "q1": "The roadmap and work plan in this project are really convincing, it is detailed and surprised me compared to the sketchy proposals of dc spark or some other new proposals. Here the tasks are presented as lines of text, the to-dos, and in a certain chronological order. Starting from Q3 ADA bet will build a system with a Cardano-DB-sync node for API connection directly to the chain. Q4 designs the functionality of the platform and develops the content on it, along with integrating the ADA wallet into the platform. Q4 programming the software has designed and built the MVP trial version, And there are many related task items in this roadmap. The entire required budget for this platform is not much, about $125,005 to spend on all the development work of the project (smart-contract programming, dev-frontend, dev-backend, system, design, QA, marketing ...)\nThe members of the proposal are programmers, founders, and content designers. All of them have a long career in digital content and mobile applications. These members also work on other projects and they share reasonable roles and times and duties. This proposal is true to the skill and experience of the development team, a clear path of work that is likely to be successfully implemented in my opinion.", "q1r": 5, "q2": "With the proposed team's statements, building a completely new betting platform capable of replacing the current operating systems is completely justified. They have experience in Cardano blockchain, web3.0, mobile apps... Those things helped them succeed in many previous projects (like ironsky, bworks, cbilling dapp ..that I found). The community can follow the development of the project according to the website they have, and the links provided in this proposal.\nThe proposal is completely transparent about the tracking tool, development roadmap, and financial disbursement table for each item. This is a project where I see all the ingredients to success: Having a development team with technical expertise, a large customer market, easy access to new users, and high costs. well-controlled consumption. I support an out-of-the-box technology platform like this ADABet Cardano Betting dApp.", "q2r": 5, "assessor": "z_assessor_4105", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We build the ADABET.iO platform applying Defi to ensure property rights and increase the benefits for bettors. With the WEB3, &Cardano's tech apply to ADABET to change the traditional betting platform", "experience": "We are IT experts, software developers with 15years+ startups in the field of Mobile App, Mobile Game and internet entertainment content. Our team also has experts in Security, Cloud computing, AI, Blockchain. Besides, there is cooperation with online digital marketing partners."}