{"id": 414127, "author": "shirah", "title": "Impact Staking: STaaS for Good", "url": "https://cardano.ideascale.com/a/dtd/414127-48088", "category": 26595, "amount": 39250, "description": "How can Cardano help businesses meet social and environmental impact goals?", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 8112, "q0": "As far as I know, STaaS is an acronym for Staking-as-a-service, which means Staking is a business service. This is one of the safe ways of staking so that you can avoid many of the potential risks associated with staking on regular Defi platforms. This proposal aims to create an impact-focused STaaS for Good and Stake Pool Operator (SPO) network to help businesses achieve and maintain corporate social responsibility, regulatory compliance, and private investors. This successful project will drive more projects to Cardano and further growth in Cardano mainnet and testnet activity. As such, the proposal met the challenge of creating a product on Cardano and positively impacting the ecosystem. The author and well-argued have detailed the solution of the proposal. By partnering with Cardano stake community operators (SPOs), businesses can make big, positive impacts to create goodwill with the public and offset any negative impact caused by their business model. By partnering with B1G1 - Business for Good to provide accountability. Total environmental impact = Cardano's energy-efficient PoS consensus + B1G1 carbon offsetting initiatives. Total social impact = Cardano's holistic approach to commerce and governance + B1G1's education and social justice initiatives.\nThe proposer presented three main risks they may face when implementing the project. All 3 risks are 3 different aspects and are all very important. The risks are: the business lacks \"quickness\" in re-authorization; the ESG method is not strong enough for some companies; The solution is too early to achieve a good product/market fit. The proponent explained each risk in detail and offered a solution to reduce that risk.", "q0r": 5, "q1": "The plan is presented in quite a detail. The roadmap is divided into 3 phases; each phase is implemented within two months and has specific goals.\nThe project's budget accounts for only 0.5% of the Challenge's total budget. Has been allocated to expenses such as cloud hosting, B1G1 membership, UI/UX design, software development, project management, system administration, and business development. But the team should explain more about those costs and provide a basis for calculation.\nThe team implementing the project I found out in their other proposals (Besides this proposal, there are two different proposals submitted to Fund 9). They are all experienced and capable people. There is also Fluid 7 (a member of B1G1). They have built applications specifically for small businesses and NGOs specializing in system integration and commercial applications. So I think they fit the goal of the proposal.", "q1r": 4, "q2": "The proposer provides transparent public KPIs for each stage and gives specific target numbers. I agree with the author's presentation: easy to test and measure. \nThe project's success is determined when most Cardano-based companies achieve and maintain ESG compliance. Projects and companies choose to launch on Cardano partly because of the superiority of Cardano's staking ecosystem - Cardano's delegators emphasize diversity, inclusion, and several options for achieving staking ESG-compliant bets. SPOs in the ESG-focused stakeholder network.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 15016, "q0": "This proposal has some mixed reactions to the desires and goals and the ultimate implication of generating a large scale STaaS setup.  While they are targeting more mission driven pools with an Staking as a Service solution available, the question needs to be asked at what cost.  This will create a centralizing entity that is ultimately going to create a more negative impact than supporting mission driven pools will.  For that reason, the impact of this project is very low (if not negative for the centralizing aspect of it).", "q0r": 1, "q1": "Besides the glaring issue with incurring a centralizing stake pool entity, this project does sound highly feasible and would be able to handle the scaling of building an empire of mission driven pools.  The team is composed of highly skilled folks in both IT and finance side enabling this project to be managed smoothly.", "q1r": 4, "q2": "A basic roadmap is provided for auditability with various metrics and is adequate for tracking progress and development of this proposal.  The key focus of  the metrics revolve around contracting Cardano projects as well as mission-driven pool targets.", "q2r": 4, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15099, "q0": "The proposal aims to provide a service to the Cardano based projects and businesses which enables them to become or meet Environmental and Social Development Goals (ESG). Being an ESG Compliant business or project is more than possible with the Cardano Staking algorithm and as such Cardano ecosystem and related projects or business can meet these standards by delegating to  selected network of mission driven Stakepool operators within the ecosystem organised and monitored to meet specified ESG Goals Attainment of Environmental and Social Developmental Goals are standards and/or prerequisite for most companies in the World and mostly to meet potential ESG related regulatory standards and regulations by most governments and international bodies. In general, this proposal poses the ecosystem as forefront in the achievement of these goals and thus increased adoption and popularity of the ecosystem.", "q0r": 5, "q1": "The proposal seems to have a well articulated and elaborate process of achieving its set goals. The Milestones were explicitly elaborate within the specified timeframe. The team provided insufficient information to support that they have requisite skill and competence to deliver the project because there are no links to confirm their assertions of their capability.Inaddition, the budget estimates seem vague with no basis of arriving at the values. From the foregoing, am convinced that the proposal can be  implemented.", "q1r": 3, "q2": "The proposal has provided adequate and relevant information and/or quantifiable metrics on how to track and assess the progress and development of the proposal and in conjunction with the Milestones/Roadmap provided. Am of the opinion that the community have sufficient information to audit the project if eventually funded.", "q2r": 5, "assessor": "z_assessor_2292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15195, "q0": "The proposers aim to create an impact-focused, “STaaS for Good” consultancy and Stake Pool Operator (SPO) network. The target customer are businesses that wish to stake their ADA while achieving ESG goals. The proposers cite the huge trend into responsible investing as the main driver of their business. It is a valid direction for the Dapps category, which embraces SPOs and all sorts of possible end user focused ideas. However, I see impact for Cardano in the short to medium term as low. The proposers Stake Pool has only 220K ADA staked with it at the time of my assessment, and I do not see businesses holding huge amounts of ADA as a “thing” (yet). Recently, the Economist magazine ran a cover story “Why ESG won’t save the planet”. This might be a great idea for the fairly distant web3 future when ADA has a much larger market cap, lower volatility and ESG investment has slain its demons.", "q0r": 3, "q1": "It would have been nice to see the profiles of the team linked inside the proposal. The milestones and the budget breakdown could have more detail. Otherwise, this is a solid team with a well-known community member and a 11 year company history. Most of the proposal deals with the issue of impact and appeal of ESG invesment without discussing the downside and headwinds. The proposers identity under risk #3 “Our solution is too early to achieve good product/market fit”. Instead of proposing real mitigation, they say this is a strength not a liability. Maybe for the team, but not necessarily for the voter.", "q1r": 4, "q2": "This proposal has an impressive Auditability section with a timeline and success goals broken down in more detail than the business plan itself. 5 mission driven SPOs might not be ambitious for the budget requested, but all goals are sensible and well aligned with project success. This is community reporting and goal setting at its best. Great effort!", "q2r": 5, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15302, "q0": "This proposal is about creating an impact-focused STaaS for Good network and Stake Pool Operator (SPO) to help businesses achieve and maintain corporate social responsibility, regulatory compliance and investors. this will obviously drive more projects to Cardano and on-chain activities. so no doubt anyf proposal meets the requirement of the challenge", "q0r": 5, "q1": "this proposed group is FLUID 7 they have 11 years of experience in building enterprise applications. The team has also identified the members and they have been assigned tasks in this proposal. about the roadmap they develop a plan in 6 months and have work content for the months. however I don't know when the project will start. I ask the proponent to provide this specific timeline. About the budget it has been listed in small items, but to be able to evaluate the reasonableness I ask more for the content of the work on how many people they need and how long to do it from there. How much money will be paid per hour of work? In summary, with the available information, the feasibility of the project is there, but it could be more complete. Proposers can refer to my suggestions. with the feasibility of this proposal I rate 4 stars.", "q1r": 4, "q2": "With the information provided at the transparency test of this project is complete I have the quantitative and qualitative information to test. In addition, information about the success of the project is also clearly defined. however I ask the proponent to provide this information where the community can check for example the group's social media pages. or reports to the IOG should also be listed here, although it is mandatory. In summary, I rate the auditability of this proposal 4 stars", "q2r": 4, "assessor": "z_assessor_2323", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create an impact-focused, STaaS for Good consultancy and Stake Pool Operator (SPO) network to help businesses attain and maintain corporate social responsibility, regulatory and investor compliance.", "experience": "Project Director - Managing Director of B2B web development company serving SMEs; SPO, Prism pioneer, Dandelion IA Network.\nBusiness Development Lead - Attorney; marketing and business strategies consultant; experienced community impact producer."}