{"id": 414185, "author": "marksuch007", "title": "Cardano Sharks", "url": "https://cardano.ideascale.com/a/dtd/414185-48088", "category": 26595, "amount": 40000, "description": "There are few real world utilities that can be directly impacted by the blockchain. There are projects online, however when it comes to businesses that operate in the physical world we are lacking.", "f6_no_assessments": 9, "f6_rating": 2.814814814814815, "videos": [], "media": [], "f6_assessments": [{"id": 1503, "q0": "To use NFTs as members of a company that owns real world assets, or to own shares in a company that does so, is the objective of this project, which is geared toward the use of Blockchain technology. I believe that this is an excellent concept. However, in order to implement NFTs in the real world, one would need a sizable group of people. However, whenever you bring up the subject of teams and related experiences, I can't help but notice that you do so. You have all had experience with the electronic market since 2014, but I have not seen a link to your profile and you have not informed people of your achievements in this market. I will use the example of when your project is successful and you are able to build it by yourself as an illustration. How does the process work? How do you handle it when your order has a lot and you don't have it? As for teammates, I believe it will be challenging to accomplish if we do not have the support of the community. This is probably a good idea. However, when it comes to the construction of the project, you should think again.\n\nYou have made a wise decision to focus on the North American and East Asian regions, both of which are experiencing robust growth in the cryptocurrency market. You are aware, however, that the reception of blockchain technology and particularly cryptocurrency in certain nations is not particularly favorable. Therefore, it is necessary to give careful consideration to the legal issue that you mentioned. Therefore, I will award this impact four points.", "q0r": 4, "q1": "Regarding the project's roadmap as well as the project's cost, I noticed that you mentioned in the proposal that there is an attachment; however, when I searched the actual proposal from the beginning to the end, I did not find any attached file. This is despite the fact that you mentioned that there is an attachment. So you can keep an eye on both your route and your budget.\n\nRegarding the capability of the team, I do not see any links to your individual pages that would allow me to follow and learn about the work that your team is doing. As a result, it is very challenging to make an accurate assessment of the team's progress, particular costs, and overall capacity. Therefore, I believe you require additional time to add the aforementioned information; perhaps the next fund will be more successful. This feasibility earns two points from me.", "q1r": 2, "q2": "KPIs, or key performance indicators, are numbers that are nearly exact and specific to a project. These numbers represent milestones that you can meet and even surpass as you work through the project. However, I did not find any mention of that in your suggestion. You mentioned tracking the members joining Twitter and the \"server membership count during the first phase,\" but in all honesty, I don't see the link to the server or your Twitter link anywhere in your post. It is therefore very challenging for the community to keep track of your roadmap, the costs associated with it, and the KPIs for the various stages of completion. Therefore, I will award this aspect of auditability two points.", "q2r": 2, "assessor": "z_assessor_2254", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3420, "q0": "The proposal works with 2 main ideas of business, a car rental/property business and the fitness membership, both using NFT to real life applications. The first one would work as a ladder, to get money to invest on the second. While I liked both of these real life applications, it's kind of difficult to see they working in a logical sequence, from a business perspectives. They are completely different type of business and the capabilities/knowledge and customers gained with the first one will hardly be used in the second. it would make more sense to start with a more alike business (if fitness clubs are the final goal) to leverage more than just the money and have more sinergeis. Or maybe proposer could clarify better here why they have chosen these two business (maybe there's a very fair reason but the connection/motivation between them is not clear).\nHaving said that, the proposal, for this fund at least, seems to be mostly focused on the car rental/property business. The idea is valid and is aligned with challenge as it focus on \"Physical products (Tokenised housing as a Cardano native asset, International crypto headquarters and liason office on every continent, etc)\", very clearly stated in challenge description as one of the key examples of proposals. It will help people to see more utility on NFT and possibly attract new ADA holders. An attached presentation helps to illustrate how the project is strucutred and the business would work. As further suggestions, it would be nice more on how the advertising/marketing of the NFT is going to happen. The risk correctly identified is also a big point of attention and proposer should work hard mitigate, specially considering the natural beurocracy involving properties purchases/ownership/rentals.", "q0r": 4, "q1": "There's a fair timeline in the plan but the first part is not defined yet (it will depend on funding, apparently) and there's a gap between mid-july and early september. Probably some acitivies from july will carry on until there, but it could be clear what exactly will be happing in this period. also, it would be nice to see these activites broken doen weeks or their duration besided each bullet/line. I liked though that the findinds in legal and tax implciations will be made public. In addition from the proposal timeline, some not so detailed schedule for the whole business could also be provided, to understand when it is intended to start the first fitness club, even though outisde the scope of the proposal. Even if its a initial guess, it would help to assess better the feasibility of this business model as a whole.\nThe budget breakdown is well done and matches project scope and timeline. Imporant to highlight the the budget will be used to generate the NFTs and their arts, which is the scope of the proposal for this fund, and not to purchase assets. These purchases will be made with the money generated by the NFT commerce aftewards and the project will be self sustainable. It is very appreciated that this is clear in the proposal.\nRegarding the project team, there's only 1 person committed - the proposer. He seems to have experience in the proposed business and in crypto, which are essential to run this company/start up. However, 5 more people still need to be hired as team is not complete", "q1r": 4, "q2": "There are some kpis proposed involving NFT sales, social media engagement and profit. However, there could be some targets for them, relating how much is needed to make the business self sustainable and profitable, leading to the final goal (fitness club). It is possible to get some milestone from timeline also. This project progress should be made public both in social media and in some repository so everyone can access.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4522, "q0": "This proposal did not present an impactful use case, I would suggest several ideas to improve it in my comment. First, the idea of using NFT to represent real-world services and assets has been around for a while. The implementation has been limited so far, as we only NFT represents some event tickets only (similar to how a QR code would do). The main reason for that limited implementation is a legal complication (e.g. dispute mechanism) and I don't think the proposer has identified an impactful way to address this key challenge. The proposed business model for the first phase (i.e. car rental) is very unclear to me to assess the impact. For example, which specific location does the proposer plan to implement the car rental business, and what could convince the community that this car rental business is better/cheaper/faster than other existing solutions in the market that could support car rental users to buy the NFT? If the NFT holders are treated as \"shareholders\" who will benefit from the rental businesses down the road, what does the governance look like? Overall, the proposal is not clear to me how it would deliver an impact on the Cardano community and help meet the strategic goals.\n", "q0r": 2, "q1": "I disagree that this project is feasible. This proposal of creating a rental car business for NFT buyers (the current phase) is not feasible on multiple fronts: the ability to address the problem to solve, the assessment of critical capabilities to build/acquire, lack of relevant skill sets, and budget not planned carefully. I would suggest the proposer really focus on creating a good solution that solves a real-world pain point before thinking about NFT as a gamified feature on top of it. At this moment, the proposer focused a great deal on designing and creating an NFT theme, which I don't think would be value-added to real-world business solutions. If I want to rent a car, I won't just make a decision based on a fun NFT; the car rental business itself must have better value versus other service providers in the market. Car rental is also capital intensive, geography constrained which the proposer did not demonstrate how it would address. The proposer also mentioned house purchases using NFT and my experience suggests that the legal complication to user NFT to represent real estate ownership is heavy-loaded. The proposer touched on legal and tax complications but I don't think they have a clear sense of its complexity, evident in their underestimation of the legal fee ($5000 is a very low budget for the expected legal scope of this project). It is also still a one-person team who has some experience in crypto but not in the car rental business or real estate business. In another scenario, if NFT holders are more similar to shareholders in the traditional finance world, we would need a stronger governance system (e.g. smart contract, voting rights, governance design) than just fun-themed NFTs. I would strongly suggest the proposer to further develop a reasonable business model, gather more team members with relevant experience, and break the project down into achievable smaller goals.\n", "q1r": 2, "q2": "I strongly disagree that this project is auditable. The proposal is not verifiable and the main reason is it unclear description of the problem and solution. The proposer is asking for funds to execute this particular phase which is a car rental business using NFT, but the success is about a health and fitness chain. The roadmap is very high level with no specific milestones beyond designing and distributing the NFTs and is not coherent. Please consider more milestones in evaluating and running a real business if the proposer could successfully raise funds from selling the NFTs.\n", "q2r": 1, "assessor": "z_assessor_2558", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7978, "q0": "The intention is to use NFTs in the real world. Their goal is to use the NFTs as memberships or ownership interests in a company that owns real assets. It will be interesting for Cardano to expand the range of NFTs and already use them in the real world. This project will have a positive impact for all people interested in NFTs and it will attract new people who will use them as memberships. The main challenge will be the legal implications of the business in running things. The creator of this proposal has already contacted you to mitigate these risks. This project could provide a major expansion of people who will be introduced to the Cardano ecosystem.", "q0r": 4, "q1": "Mark Suchevits will become project manager, director and CEO of the project. It states in the proposal that he has more than 8 years of experience in the crypto space. It would be better to link relevant experience to the project he wants to start. A number of people will also be recruited to steer the project in the right direction. It might be useful to use pre-existing NFTs for the project. In this way, a certain cost could already be reduced. A lot of time has already gone into making a sensible plan and budgeting for the project. Instead of taking a milestone every 2 weeks, it might be better to choose to take a longer period of time. The project is certainly feasible if there is sufficient support from chains that want to use their product. No additional financing will be required in the future. This project is intended to be self-sustaining after the launch of the NFTs. There is a white paper available in which a realistic timetable is included with an implementation plan. It also lists the resources needed to make this proposal a success. The technical aspects are also discussed herein. The challenges included are legal and tax matters. Part of the requested budget will be used to ensure that this will not be a stumbling block.", "q1r": 5, "q2": "A very comprehensive roadmap with associated milestones has been added to the attached proposal. Clear KPIs are also included to measure whether the project is a success or not. With the funding, it might be better to spend a few months building a community behind the project first. There is a clear description of the solution that the project will provide. The project will be a success once their health and fitness club chains are launched and are fully functional with the cNFTs as membership and tracking, including ADA's acceptance of the services in the club.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8482, "q0": "\"Firstly, I have to say that this idea is a very ambitious idea. The proposer wants to take the influence of Cardano further so that it can involve in real business (in this case, they want to launch a health and fitness club chain that is fully functional with cNFTs as memberships and tracking as well as accepting $ADA for services), and that definitely matches some criteria of this challenge. I can see that the intention of this proposal is increasing Cardano's influence in real life and make it a reason to attract more people to come to Cardano. Moreover, it can be a huge boost for the value of Cardano and ADA. In terms of an idea, I agree that this idea aligns with the challenge. \nHowever, through the proposal presentation, the proposer has only shown us the idea and a very vague vision of how this idea works but not the building process. I have no idea whatsoever how the team going to make this idea come true. How are they going to create a cNFT, using which resources, and how to blend it into our ecosystem? How are they going to bring a marketing campaign in to achieve their purpose of using NFT technology to empower individuals to start using the blockchain in the real world? Which Cardano resources are they going to use and what another tool will they use or need to build in? The team wants to connect the users, but how? I don’t find this information in this proposal. \nThe team doesn’t have a piece of strong evidence to show us how this challenge will affect the Cardano ecosystem such ask clear key metrics, or KPIs, … So, in terms of the outcome, I don’t see much impact being shown here. The team still has a lot of work to do with this part, I think it would be better if we can see a brief introduction of the current problem that you want to solve (like how much Cardano is involved in businesses in real life or if ADA is accepted anywhere as a payment method for services), it can be through numbers, demographic or any kind of more detailed picture, then you can put your solution in the picture to show us how it’s going to solve each problem and specific what you’re building on Cardano. That will help the community have a better understanding of your idea. \nOtherwise, I agree with the risk that the team points out for this proposal, and I really appreciate that they’re getting to work out a solution for it. \n\"", "q0r": 2, "q1": "\"With such a vague idea of this proposal, I found that it’s very difficult to give out a thorough timeline with clear milestones. I don’t see the highlight of the work that has to be done. There’s not really something there to back the requested fund. What I can suggest the team does here is to build some milestones that you want to achieve, then build a timeline around those milestones (What work is needed to be done to achieve those milestones, how many hours are needed, and so on,) better do break it down into multiple periods of time. The budget breakdown should strongly stick to it. \nFor the human resources aspect, I’m certain that the proposer has sufficient skills and experience to run this idea. The idea for the team is there but it would be better to have more details of the requirements for each position so that we can see if it’s suitable for progressing the plan. \n\"", "q1r": 1, "q2": "I see a couple of random key metrics such as where the community members are coming from, followers on social media, the sales of initial NFTs, asset performance, and profits. The problem here is the key metrics are too random, they’re not sticking to any roadmap or KPIs. Hence, I suggest the team work on it – building a clear roadmap with key metrics and KPIs that stick to your roadmap. It’ll not only help the community audit your idea in the future but also help the team themselves to follow up with the idea promptly and make adjustments when it’s needed. ", "q2r": 1, "assessor": "z_assessor_2989", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9471, "q0": "For a rather unclear association with action from this proposal to the described impacts, I rank this section a 1. First, voters are looking to this section to be told how this proposal is going to change the status quo. That impact should appeal to increased adoption of the Cardano ecosystem (which also needs to be quantifiable) or it can point to an increase in user experience within the Cardano ecosystem to make it more advanced/innovative. This section of the proposal describes general possibilities of use cases (and intention of fulfilling some of those utilities) but it does explain how this utility is logistically implemented. I think it would be much easier for voters to focus on car rentals (as the proposal says will be the starting place) and more thoroughly explain the logistics of that utility. The voters will want to see something unique and innovative that provides an appeal that traditional utilities (car rentals for example) have a disadvantage over. In this section, I’m not certain if this collection of NFTs is meant to compete with other NFTs (and perhaps solve the problem of NFTs lacking utility) or if it’s aiming to compete with traditional investments (like a car rental company). I think it would benefit this proposal a lot to narrow the focus of impacts to what exactly is going to be done and what it will improve. ", "q0r": 1, "q1": "While I wouldn’t think it infeasible for anyone involved in crypto to be able to produce an NFT collection, I end up scoring this section a 1 because I can’t appropriately weigh the feasibility of any other actions beyond that with the information that we are given. Since voters often view feasibility through the lens of core team experience, it is of the utmost importance that resumes and pictures - preferably in the form of a LinkedIn page - are provided in the proposal resources (especially for one of this price tag). One of the areas where the proposal is  missing some key information is in the rhetoric about smart contracts. Beyond what the smart contracts will do and why they are needed, the proposal needs to list the individual who will be building it because the capability to produce such a thing is not a common skill. Voters will vote negatively if they cannot clearly see that they are approving funds to someone that is capable building. For the budget and roadmap, I would suggest explicitly showing this information in the proposal, rather than having the voters reference attached documentation. They’re more likely to vote favorably if they have all the information easily available to them. Specifically for the roadmap, I would suggest finding a developer first so that someone that is qualified to do that portion of the work can write a roadmap with all the step-by-step tasks and how many hours of labor it would take to build it out. This proposal appears to be still just an idea that requires more expertise to develop into something that voters might have confidence in. ", "q1r": 1, "q2": "For identifying metrics that will be monitored, without indicating specific targets for those metrics, I end up ranking this section a 2. I think the laid out metrics to track are a good starting framework but I think there is a lot of room to add additional metrics that can assure voters that there is a planned definition of success. I think this section could include NFTs listed on secondary markets, number of NFTs that are actively using the built utilities, and perhaps the average amount of rewards a single NFT has earned (post proposal). Some of the better Catalyst proposals take the extra step to further define target metrics for all of these areas and establish progressive milestone based metrics for different timeframes of the life of the project. These types of auditiblity strategies will show voters that there is a specific plan for success and that the proposer intends to achieve objective targets of performance. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12740, "q0": "The Idea looks intriguing but I don´t really see the connection on why you start with rental cars, than move up to franchises and properties. And than the endgoal is to create a health and fitness club where you can pay with ADA. Surely rental cars are cheaper and easier to start but I don’t see many connections between the different assets and businesses. If your endgoal is to create a fitnesschain where you can pay with ADA and share the ownership with other people, you could create a business for that specific goal. It´s not clear to me why you take the steps to make it to your endgoal.\nOverall this project addresses the challenge by creating a new usecase of shared investment options on smaller assets like cars, rental houses or a fitness/ health chain business but the implementation looks unstructured. They could make a great project, it just needs some more calculations and specific data. \n", "q0r": 4, "q1": "The proposer has experience in crypto and worked in a business-related space. There is no proof for these experiences. The positions of rest are clearly structured but the members of the team are TBD. In the proposal is money allocated to them. So the project can pay for them. \nOne problem of the economy is that the NFT Buyers pay a lot of “fees”. You sell 5000 Nfts for 100 $ therefore you get 500.000$. From this 500.000$ ten percent (50.000$) are spend on (Management, artists and developers). This is pretty high “fee” compared with other alternatives. You could mitigate this by trying to get a bigger funding and having the same expenses. For example you try to sell NFTs for 5.000.000$ and spend 50.000$ on Management.. There would only be a “fee” of 1 %. \nThe calculated volume seems unlikely, too. The aquafarmer NFT or the Cornucopias GTI Javelin (Just as a reference because they are well known, but they have different usecases) have a volume of between 2.27 and 2.77 million dollar. Therefore it´s very unlikely that a NFT which represents cars and other assets with a value of around 450.000$ make it to a total volume of 2.6 million dollar. \nThe Timeline starts on June 1st before there is funding from catalyst and ends on July 15th. Than the next date is September 1st to 15th. What happens between these days and what happens afterward? I would be great if you go further into the details \n", "q1r": 2, "q2": "The overall roadmap is unclear. How do you want to archive the endgoal of lauching the fitness club? Please provide more infos. From the data you just have planned just to the 15th september. It would be great to have additional infos like when do you plan to buy more assets, when do you want to implement the plan with the fitness chain. If this is unclear you could have set some goals, which adress these things.  \nThere are only a few metrics like buying the first cars. You could have made specific metrics about you social media/ your overall community (You are dependent on the people that support you. So KPIs on Social Media followers and activity would be good.  \nThe target problem is clear but your implementation looks unstructured\n", "q2r": 2, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14713, "q0": "\"NFT is popular nowadays. However, most forms of NFTs are in digital form. Recently, real-world usage of NFTs is increasing, building a link between real world and crypto world. Thus, the proposer wanted to use the NFT technology for the real physical world assets. Proposer have the long-term vision for NFT usage (for example fitness use). Currently, this project focused on rental cars, then moved up to properties such as houses, cars, buildings, franchises, etc. If this project succeeds, the great number of people will join Cardano ecosystem for purchasing, thus this project is well aligned with the problem setting.\nThe proposer stated the major risk: tax and legal implications, especially with expensive property such as houses or cars. The proposer did not give the exact solution (partly due to currently there is no specific case to solve), but the proposer had already contacted with the accountants and legal.\nI would like to add one more risk/question is that for the buyers, do they willing to buy property with NFT-based? Or they just buy property e.g., cars, houses just like conventional ways?\"", "q0r": 4, "q1": "\"The proposer’s vision is that: the project started with car rental, then came up with properties (houses, cars, etc.), and the main goal is the health and fitness chain for NFTs. However, the timescale proposed just stopped at “first asset purchase”. It would be better if there were more plans regarding to what to do with that “first asset”. I expected to see a detailed plan in terms of selling houses or cars in the future. \nIn terms of the budget breakdown, the proposer provided quite detail how to use the money. Regarding to the human resources, the core team only included the proposer (which is an experienced man in crypto and business for years). Other team members will be recruited (as described in the budget breakdown). There will be a risk of not finding appropriate employees. For a clearer proposal and to increase the feasibility, I recommend the proposer to allocate the money and human resources needed in each phase of the project. \"", "q1r": 3, "q2": "I agreed with the metrics provided here, starting small with members from Discord, then followers on Twitter, then moving to the sales of NFTs (the initial and the secondary), and finally the asset performance and profits. However, to increase the auditability score, I believe that the proposer should specify the target number of these KPIs/metrics he wants to achieve in a certain time length. For example, in a “community member building” task, after one month, the project fanpage on Twitter will have 5000 followers. ", "q2r": 5, "assessor": "z_assessor_4098", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14910, "q0": "First, the proposal outlines the factual phenomenon that blockchain is facing: “Few real-world utilities that can be directly related by the blockchain”. Then, the proposer provides a new potential solution to address the root of the problem statement: “NFT technology to empower individuals to start using the blockchain in the real world” well-aligned to challenge settings (physical products destination). It is described in detail and step by step, starting from rental cars and moving up to franchises and properties and ending at creating a chain of health and fitness clubs. On the bright side, “tracking software that allows the members of the club to earn $ADA rewards for positive progress” not only grows the community awareness in places (such as east Asia as well as in North America and other places) but also associates profit with personal development so that, in turn, motivate consumers to use positive ones. Moreover, besides positive impacts on individuals using crypto in general as target users, it also contributes to the Cardano ecosystem attracting more users to the space. However, it would be better if the proposal explained why people would switch from traditional physical products and payment destination to the blockchain (user reaction) and provided some case studies demonstrating its effects and feasibility. Regarded the main risks, the proposal has claimed tax and legal implications for this business, but I have not yet clearly realized the impacts and difficulties that this issue brings. Contacting accountants and legal is suggested as a solution to the challenge without clear and realistic steps. I believe the proposal should mention the profound problem of “the feds pass the new goods and services that treat crypto as a currency for smaller transactions as opposed to a commodity which triggers the taxable event for the user”. Because it is just a prediction and assuming if this situation does not turn out as expected, what alternatives the proposal will suggest when developing the plan on that basis and the ability to pass “as many are on board with this idea” is not convincing to me.", "q0r": 3, "q1": "I am having trouble finding the attachment mentioned in the proposal making it impossible to evaluate the timeline and budget categories. Therefore, it would be better if the proposal refers to them directly with the proposal to make it easier to monitor and evaluate the feasibility of the proposal and avoid cases like mine. Nevertheless, the timeline summary gave an overview process to be well-aligned with proposed solutions. In the team member destination, the proposal provides a brief overview of the necessary departments and personnel in several project areas (Marketing, Community Manager and Admin for Social Media, Developer). Additionally, information about the experience (8-10 years) of the proposer (project manager, director, and CEO) in the crypto space and commercial wholesale insurance business, which I firmly believe will also contribute to future success. However, I think it would be better if the proposal gives voters some detailed profiles (qualification, experience, and educational background) of TBD teams to enhance their confidence in the project. In addition, the staff structure is still unclear to me when besides five departments, \"members proposer have met in the cNFT community\" and some job descriptions in each field, I still have not had a look in-depth information on the number of members and the duties of each person (might have been provided in the attachment but I cannot rate it because of the problem mentioned above). Therefore, those factors should be considered to increase the feasibility and convince the Cardano community. Besides, as the proposal mentioned, the proposer will take on TBD-Community Manager and Admin for Social Media until he finds someone to fill the role. Though, I wonder if his workload is overwhelming when he has to hold four positions in the project. Moreover, I believe it would be better if the proposer could add the qualifications and skills that the person is looking for in that position.", "q1r": 3, "q2": "I highly appreciate the proposal in terms of ​​tracking project progress through the source of community members from using metatags in the discord server; followers on Twitter, and server members; asset performance, and profits. Furthermore, sales of initial NFTs and secondary market sales through a game reveal the prospects and provide a financial running budget. However, I suppose the proposal should mention realistic numbers for each assessment item (number of followers, asset performance, and profits at each milestone and a well-aligned blueprint) and timelines for completion into the \"beginning stages\" to make the assessment process easy and smooth. Moreover, the proposal still does not touch on the issue the community is aiming for after project funding: tracking progress as to whether the above documents and measurements are made public to the community or kept in the internal team. Secondly, even though the proposal has succeeded in providing results, and an overview of the future project, the successful description of the proposal has not gone into detail when only mentioning launching their health and fitness club chain and the $ADA for services offered in the clubs without some metrics/KPIs (like the number of clubs and number of members) which could convince the community and get better funding.", "q2r": 3, "assessor": "z_assessor_4110", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "I want to use NFT technology to empower individuals to start using the blockchain in the real world. Using NFTs as memberships or ownership stake in a company that owns real world assets is my goal. ", "experience": "I started exploring the crypto space back in 2014. I have experience with mining, cloud mining, smart contracts, staking, NFTs, leverage day trading, community building and collaborations. I also have a keen eye for scammers in the space and know how to spot and avoid. "}