{"id": 414246, "author": "synaxx", "title": "Job board cardajobs", "url": "https://cardano.ideascale.com/a/dtd/414246-48088", "category": 26595, "amount": 87018, "description": "There are many open positions in the world that cannot be filled. In addition, many people who are unemployed are looking for the right job.", "f6_no_assessments": 17, "f6_rating": 2.8235294117647065, "videos": [], "media": [], "f6_assessments": [{"id": 1599, "q0": "The idea aligns with the objectives of the challenge, because it intends to create a network that connects candidates to employers, having the information of those involved stored on the blockchain network through active tokens. This would increase the number of users on Cardano, from what I understood the transactions would take place as smart contracts, making it much easier for companies, since the bureaucracy would be greatly simplified. However, I found the tool's explanation a bit confusing. At certain points, it is implied that the tool can be used in both Web 2 and Web 3 (at least I understand that). It is not so clear how the electronic identity would be created and the data stored. What kind of data are we referring to? Could clients attach some sort of résumé to their corporate accounts? I thought it was positive how the proponent makes it very clear what the benefits would be for customers and companies, and especially the effects of this platform for the Cardano ecosystem; but some points here could have been made clearer, more fully explained. How would Atala Prism DIDs be involved in the project? Could it be that in order to make purchases and transactions, customers would necessarily need digital wallets from Cardano? What transactions would take place in Ada? A very important point that I think should be addressed here would be how to educate people about the functioning of the mentioned technologies. For example, let's say that a legal professional is looking for a job and wants to use this Dapp, but doesn't know much about blockchain, doesn't know how to create an electronic identity, etc. Would the interface be simple and ergonomic for him to perform these actions, would there be some kind of tutorial explaining the first steps? In general, my opinion about the impact of the proposal is that yes, this idea is quite relevant and interesting, however the explanations that make up the proposal still leave some doubts about the functioning of Dapp, even though the proposer has dictated a “ path” that would be followed by a client, and citing an example, I still had some very pertinent questions to be answered. A very positive point in the proposal is that the proposer is quite assertive when it comes to marketing. He already has an idea of ​​several places where he intends to promote his Dapp, being aware of the importance of this facet of his project. He is also quite aware of possible challenges, already outlining ways to overcome them. In summary, I liked the idea, I think it is a very practical way to bring new members to the Cardano ecosystem, since the lack of opportunities and job vacancies is a reality for a large part of the population; but it would be necessary for everything to be explained very clearly, so that we could have a full understanding of the project to be done.", "q0r": 4, "q1": "Regarding the feasibility of the project, we have some issues to be improved here. Starting with the script, the author's temporal and task division is quite abstract. It divides the temporality very sparsely into quarters, delegating some tasks that would be done in each of these. However, they are a bit abstract. Ideally, he would have divided the time into smaller intervals, and these were more detailed. For example, in the first quarter we have the activity of founding the company. Certainly, a series of measures must be taken for this to occur, it is a complex activity and full of facets. So I believe it should have been better detailed. Another example would be the last quarter of this year, the self states that it will do “project outline, break the project into viable tasks”. I think it would be more appropriate if this division had already been made and presented in the details of the proposal. The impression I have is that the proponent explains very richly what would be done, but not how, as the script part could be better explained. When we go to the budget division, a very high amount is requested, most of it being delegated to the construction of the company (32 thousand dollars). This value would need to be more detailed, explained, divided into smaller parts that were adequately justified. Within the construction of the company, small actions would be made and each of them would cost a portion, which added together would give this total amount. How much would they cost, and what parts would those be? It is also calculated a monthly value of 777 dollars for 1 person, but certainly more professionals would have to be added to the project, so how would the payment of those who would arrive? And how many hours a week would that person work, so that we could understand the value of their work hour? Overall, the financial part of the project still seems quite uncertain, which is worrying, especially given the scale of complexity of this project. Talking about the team, finally, we only have the proponent as a defined member of the team, he claims to have developed the idea but he cannot be responsible for the technical part. This is quite serious because we don't have a team already defined, we don't know who the professionals involved would be, so there's no way we can trust their preparation to successfully carry out the project. So, in many ways, the feasibility here needs to improve.", "q1r": 2, "q2": "Regarding process auditability, very little is suggested. All we know is that it could be done via the “Platform Tracking / Business User and Project Management: Site Roadmap”. does not provide safe and detailed means for us to follow the development of the phases. What is said is not enough for a careful and complete monitoring. I suggest that he define some means of communication with the community, first, be it a discord channel, some website, some online tool like Notion and Miro, for example. And then, with the communication established, he could constantly update us on the advances, what has been done each month, for example, who would be the professionals who would to add to the team, what their work routines would be like. Anyway, keeping us abreast of all advances, this is always necessary, but especially when it comes to such a complex proposal. exa, which requires a company to be created, professionals from various technical branches to get involved and etc. Unfortunately, security is not conveyed in the way in which the bidder suggests that we do this follow-up. Regarding the final results, the proponent suggests very interesting information (\"the success of the platform from business points of view: high user and company traffic on the platform, high turnover, high interaction with the platform, etc +the definition of success From user points of view find a Job they love, find the right candidates, easy operation of the platform, etc”). That is, what would be considered a success with regard to the platform, or even for customers. There are several indications, and that can give us a good idea if the desired fruits are being harvested. I have two suggestions to make, in light of what has been said 1) it would be interesting for us to understand how these customers would be using the technologies learned, have they become active members of the community? 2) it is not very clear which means of communication would be used here. How does the proponent intend to make the Cardano community aware of this information? Sure, reports would be created, but would these be sent to us? If yes, how often and through which channel? I think the auditability is average, I see some hits and points that need real improvement - of course, especially the first part, which deals with monitoring the phases and small advances.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1504, "q0": "As the COVID-19 pandemic draws to a close, there will be an increased demand for people to be able to find work from home and work online. As a result, it will be necessary (and it will be possible) to develop an application that will allow job seekers and employers from around the world to locate each other on the internet. This is a sizable market that contains a significant number of people looking for work as well as businesses. You brought up a payment token, which is significant. In addition, I have a question for you: what will the token be called, and will it be deliverable? Translate them on the existing DEXs and tell us about your plans and the steps you'll take to generate the code and bring it to the community.\n\nYou have also mentioned three major risks associated with the implementation of the project. There are solutions to these problems, but in the risk section of your post, I did not see you mention the possibility of ADA violations occurring after you have been funded. We are all aware that the current market is experiencing a significant decline, and the ADA coin has also followed that trend. Because of this, I would recommend that you mention the slippage of approximately 5 percent of the project's cost, as we are experiencing this issue as well. It is not possible to predict accurately in advance what the price of ADA will be in the future. And finally, I believe that if this proposal is able to be implemented successfully, it will be of great assistance to businesses that are looking for employees as well as individuals who are looking for work. Therefore, I give this effect a score of 4 points.", "q0r": 4, "q1": "The project's plan of action has been in place for the past three quarters, and now we are in phase 2 of the project. In phase 1 of the project, the proponent has outlined what steps to take when beginning to focus on this project: You should quit your job, finish writing the white paper, and then start a business. And as of the current stage, which is Q3 2022, your work is being completed, but I am unable to locate a link to either your company's website or the project that you are working on. In addition to this, the project's development roadmap is not really distinct and accurate. In my opinion, you need to provide additional details regarding the project's roadmap.\n\nConcerning the cost of the construction of the project: all of the amounts that you have mentioned are on a broad scale and are not specific. For instance, the establishment of a company, what costs are required, and software development (this is the most important step), are not specifically mentioned by you, such as the cost of hiring people, how much time it takes, and how much it costs to finish the steps of writing software.\n\nYou mentioned finding a technical person to develop the project with you as one of the features of the proposal, and you stated that you have experience in product development, marketing, and platform building; however, I haven't seen a link to a web page that leads to your personal page. This raises a question about the veracity of your claims. You should add to it, and you should keep your fingers crossed that Fund  will be able to see you later. It's not easy to prove your ability. Therefore, I will award three points for this feasibility.", "q1r": 3, "q2": "The information that you provide in the section that measures the progress of the project is very basic and doesn't really convince anyone. The community needs the most accurate numbers, links, and websites that lead to the development of the project. your judgment. For instance, how much money do you make and what kind of a commission do you get based on the stages of the project, the number of people who follow you, the number of people who are able to find jobs, and the number of businesses that will find employees? yourself in the application you submit. When the project is finally finished, you will be required to check out those things at some point in the future.\nAnd from what I can tell, you will probably end up having to make a lot of changes to the project in order to have it approved by the Fund in the future. This section's auditability earns a score of two points from me.", "q2r": 2, "assessor": "z_assessor_2254", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14646, "q0": "In general, this proposal is just a specific idea, but it is not clear and detailed. I quite like how the proposer breaks down the impact structure of the proposal into smaller sections so that the information is presented clearly. The proposal has easy-to-understand process examples. There are specific features that should be classified to avoid clutter. There is a specific audience and the proposal clearly states the effects and benefits for each target audience. The proposal is great for articulating the platform's effects on the Cardano community, but I think it's important to detail the expansion in the Cardano ecosystem with a real-world use case.\n\nAs for the solution, the proposal presented quite well. You have presented accurate and specific measurements of the world's labor situation as a basis for the development of the platform, but you need to attach more references and sources of information for higher reliability. The proposer should be more clear about how the platform's functions will solve users' problems, if possible, specific examples will make it easier for investors to access the project. The proposal aligns with the key metrics of the challenge and was fine as it outlined the project's communication strategy and success when the communication was successful.\n\nThe proposal has outlined the risks and solutions. However, the solutions do not have a clear treatment plan (except for the last risk), and the first 2 risks proposed by the proposer should clearly state how to find human resources and how to find investors.", "q0r": 4, "q1": "In my opinion, not only should the activities be listed, but the proposer should show how those tasks will be carried out. The timeline is not clear about the time, the timelines are too general, and the proposer should be more specific. The idea is too sketchy and has not defined technical aspects such as architecture and technology that the platform will use.\n\nThe budget table is not detailed, for example, for project management costs the proposer should clearly state the activities and the costs for those activities. The proposal does not have a specific number of people who will develop the project and also the personal and professional capacity of each person.", "q1r": 2, "q2": "The good news is that the proposal shows the success of the project in many ways. But as mentioned above, the proposal needs to have specific numbers to measure the success that the proponent has proposed. In addition, the proposal lacks a section that provides information on whether the proposal is a continuation of a previously funded project in Catalyst or an entirely new project.", "q2r": 3, "assessor": "z_assessor_4078", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14025, "q0": "The team is proposing to create, from scratch, a global decentralized job board, allowing companies to search for personnel and to applicants to apply for jobs, worldwide. The plan is to make use of SSI (E-Identity), possibly using Atala Prisma, in order to store the companies and applicants’ information, what is good for data protection, and also would increase adoption into Cardano ecosystem, increasing the activity on the blockchain in case of success.\nThe team has provided detailed information about their proposed solution, in a didactic way, showing what they intend to implement in case they get funded, being this a proposal that addresses the challenge, by expanding Cardano ecosystem by proposing a decentralized job board.\nIn regards to the risk mapping, the team has indicated money related risks, also lack of technical staff (what led me to realize the team is composed by only one person for such enormous project), and also a lack of users on their system, what I believe is a great risk (it would not be an easy task make people give up on LinkedIn and others to embrace this new system). I see some strong barriers for this project to succeed.\n", "q0r": 4, "q1": "The team has provided a plan that does not really matches with what was promised on the impact section (a worldwide job board that uses SSI for their registrations). The last milestone of the project is “Expect the project to be funded and start development”. I would expect some development with a budget of $87,018, but what I saw was a milestone “Quit my job!” in the beginning of the project.\nOn the budget breakdown, the main spending is $32,000 on building a company. Not sure it is the proper way to start this project. I would see it starting with some research and a MVP or something. Things seems to be out of context to me, what is a pity as the idea has a good potential. On the budget breakdown I also missed more detailed information by listing the necessary budget for inner tasks and not only for the macro-ones.\nOn the details of people who will work on the project there is only one person listed, who does not have technical knowledge to implement the idea, neither has a team backing it up. If the proposal had some good insights on the impact section, it is not doing the same job on the feasibility one. The plan just does not link with the promises done. Difficult to see it being implemented (in a good manner).\n", "q1r": 1, "q2": "The way the team sees the success of the project is listed from both points of view, business and users, being aligned to what we should expect from such platform (if succeeded). They mentioned they would measure the project progress by a roadmap on their website, however they did not explain any indicators they could use to really measure their advance and success.", "q2r": 3, "assessor": "z_assessor_3872", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11425, "q0": "This is an idea proposal to develop a decentralized job search application. I know quite a few such platforms in different countries, but most of them are centralized applications. If such a platform is born, it is possible to pay workers directly without national border restrictions, and the cost will be much more saved. Information about employers and employment records will be more transparent. This proposal fits the challenge presented.\nThe project also targets global customers, but the proponent has not given a detailed plan and strategy to implement it. And has not yet presented a media plan for it. Because I see this as important for the project to be successful. So I like the idea but can't give it a top score yet.", "q0r": 4, "q1": "The writer proposes to present the work plan according to the quarterly milestones. But the job duties he wrote that were rather sketchy. I don't know exactly what his goal (target number) is and how long it will take to achieve it.\nHe also doesn't have any detailed research or technical documentation for his website what technology will use to create a decentralized job search website for workers.\nAs for the budget, he only generalizes one big task, not specifically how long the small tasks are done, how many people do it, and how much time it takes for it. Although the outline is reasonable, it is not detailed enough.\nRegarding personnel, he does not have a team ready to work, but it will take time to recruit more.", "q1r": 3, "q2": "I'm sorry this is a great idea, but in the description of the project's goals and success he only gives a few rough bullet points and no concrete numbers to measure that.\nRegarding the reporting method, he just said that his website will show it. However, specifically on that website he has information and statistics on how to measure the progress of the project as well as show us the website is of interest from employers as well as the interest of those looking for a job.\nI hope he will refer to well-written and funded projects to gain more experience for himself if he wants to receive support and votes for the project from the community.", "q2r": 3, "assessor": "z_assessor_3244", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11118, "q0": "First, let me start by saying that I like the idea behind the app, the proposal is very good and fits perfectly with the goal of the challenge. The title of the proposal is \"Job board cardajobs\" which also gives us some idea of ​​the problem of the proposal. According to the author, currently, many unemployed people are looking for suitable jobs, besides there are many vacant positions that cannot find suitable people => and supply and demand cannot meet each other. The solution is to create a job board based on a global decentralized platform that provides electronic identities for employers and employees, allowing companies to search for employees worldwide and apply for jobs. job applicants worldwide. The proponent has estimated that currently there are about 220 million unemployed people, and about 50% are unable to work/do not want to work, this number will be 110 million people looking for work, this is a number huge. If this solution is successfully implemented, it will give people around the world the opportunity to develop themselves and apply for jobs they are qualified for and love, as well as companies around the world the opportunity to find Find the right candidate. Both the applicant and the company benefit from this proposal, it is easier for people to find each other anywhere in the world, and of course, Cardano also benefits from this because it will become more and more popular with more and more users on the Cardano network. Regarding the risks that may be encountered in the project, the proponent has given 3 main risks and measures to reduce them.", "q0r": 5, "q1": "\"Regarding the roadmap of the project, I think the proposal can be explained better. According to the presentation, this roadmap is divided into 3 phases by quarter from Q2/2022- Q4/2022, however, I don't know exactly when the steps will be taken, and how long will it take in months or weeks? Each month will take place, who will work at which step. Although they explain the basic operations to be performed, without placing us in what time and space (and who will do each task), we cannot fully understand the development of the project judgment. For example, in the second quarter of 2022, the author said that he would quit his current job, but did not mention what month he would leave, then when he would establish a company, or what would be the size of the company? As the risk section presented by the author is a lack of technical staff, how many employees do you plan to hire, how many co-founders are needed and what are the criteria you need? I think when you make it clear, it will attract a lot of people to you through other projects on Cardano.\nAs for the budget, the total request is $87,018, I know this money will be spent on expenses such as company establishment, business idea, software development, project management costs, and expenses. legal fees. However, this part of the cost can be analyzed in more detail, for example, the cost of building a company is $ 32,000, what size will your company build, and the cost of construction materials should be listed. List in more detail, as well as which city in Germany will the company be located? The same goes for the other expenses you listed such as \"\"Software Development / Project Management Cost: + Homepage: 20000-30000$\"\" how many real members will there be. In this section, how many hours will they spend as well as what is the hourly rate? I think the more detailed it is, the more beneficial it will be for your project.\nAnd finally, about the team, as mentioned above, I know that he is going to form the team, looking for good technical members as well as project co-founders, this is highly recommended because it is an important factor for the successful implementation of the project. Although the project is currently only a proponent, I hope he can reveal his identity, we know he will be the leader of this project, but we don't have enough information to believe about him. Regarding relevant experience, we are told that he is a person with more than 3 years of product experience, process experience, industry experience, customer experience, and candidate. However, we do not know how this person is related to the Cardano ecosystem or blockchain experience, so there is not enough basis to know if he is capable of successfully implementing the proposal. So unfortunately all parts of the feasibility are superficial and in need of a complete overhaul.\"", "q1r": 2, "q2": "\"In my opinion, this proposal is difficult to audit because there is no detailed roadmap, it has not provided any KPIs to determine the success of the project and an implementation roadmap is not convincing, at the same time, it is also lacking completed milestones. Therefore, the first thing that needs to be done to overcome this problem is to establish a detailed roadmap and then a detailed explanation of how to allocate funds by piece. Second, the proponent should prepare reports, at least monthly, with project updates, and share them directly with the community. The proponent mentioned that the project will be web-based, but I'm not sure if the web updates will be internal to the project team or public to the community?\nAnd finally, the successful outcome of the project is divided into 2 parts, one part from a business point of view (including High user and company traffic on the platform; High revenue; High interaction with the platform; High number of apps and ads on the platform) and partly from a consumer point of view (including Find a job they love; Find the right candidate; Easy operation of the platform; Easy money transfer ) but how can we believe this has been achieved? I would like the proponent to be more explicit about how this objective can be audited, such information must reach the members of the Cardano community transparently.\"", "q2r": 2, "assessor": "z_assessor_3223", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10522, "q0": "This proposal wants to connect job seekers and employers through an app on the cardano platform. I think two features of this app have potential to answer the challenge of furthering cardano uses. The first one, the usage of an e-identity, that can be used on other cardano apps. This will facilitate users within the cadano ecosystem. The second interesting feature, is the possibility of connecting people all around the world, touching a large number of people and possibly introducing them to blockchain technology and cardano. However, aside from these 2 aspects, i struggle to find how this project will be meaningful in creating more impactful usages for cardano. This project could entirely be done on any other platform aside from cardano, and lacks any meaningful innovation. Furthermore, it uses very little cardano technology: no cryptocurrency usage, no blockchain usage. Furthermore, the people who will use this platform (jobseekers and employers) will have very little incentive to leave the job seeking platform, to look at any other apps in the cardano ecosystem. They will only need to post their offers, and never look at the platform again, as they can contact each other through email. I do not think this project is very relevant to the challenge. I believe it will do very little for cardano adoption, as it does not showcase any meaningful uses for the crypto space. ", "q0r": 2, "q1": "\"I have 3 big issues with this project that I think will hinder its success. The first problem, is the experience of the author. Despite this being a very programming-heavy project, the author has no coding or technical experience. Furthermore, the other qualifications mentioned are very questionable. The author states 3 years of experience in \"\"product, process and industries experience\"\", this is extremely vague, and tells us nothing conclusive about what skills the author has. The aforementioned experience is also not particularly relevant to the project. Having only one team member with very vague qualifications does not give me faith that this project will be done successfully. The second point that is problematic, is the very vague budget breakdown. The budget states 32k$ for \"\"Building company\"\", this could encompass the entire budget, and gives us no details on how the funds will be used. The software and development costs show no hourly rates or planned number of coding hours. The author having no coding experience, I do not believe this part of the budget is correctly assessed. The final problem I foresee for this project, is the lack of interested users that will use the platform. What are incentives for companies to register on this platform, as opposed to the thousands of other well-established job posting platforms? Companies usually prefer to hire localemployees, with whom they can set up a face-to-face interview. There are very few jobs currently that is suited for remote working or working from home, as many companies believe productivity much higher at the office. Furthermore, connecting people all around the world will pose several issues: language barrier, working culture difference, timezone issues, difference in labour laws. What solutions can the author offer for these issues? Lastly, the author offers no system to ensure authenticity of job offers and employees. What will. be the vetting requirements for a company to post? For all the aforementioned reasons, I do not believe this project will, at this stage, find much success in implementation. \"", "q1r": 1, "q2": "The author offers a metrics to track progress and success: number of users and a roadmap post for progress tracking. While this is sufficient to get a vague understanding of the success of the app, the impact that the app will bring to the cardano platform will not be auditable. As many people will only use the platform to post job offers and have no incentive to contribute to the cardano ecosystem otherwise, it is likely the target audience for this project will not match that of the other cardano apps. The author offers no metrics to measure this. While this project is auditable partially, the things that can be audited are not particularly interesting to the cardano community as a whole, only to the owner of the project. ", "q2r": 2, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10359, "q0": "The proposal is to create global decentralized platform (job board). It will help job seekers to find jobs and employers find suitable candidates. The proposal mentions participants on the platform. It also mentions benefits which participants can receive from the platform. This idea is good for everybody. The information is clear and understandable. Building global decentralized platform about job is good for Cardano. More and more users will work on the Cardano network. ", "q0r": 4, "q1": "There is only one person on the team. The proposer needs more staff members. Although he has experience with customers and candidates, this project needs more people having experience with blockchain, human resources, and marketing. The budget which he suggests is $87018. But, I can’t agree some points in his budget. For example, in first phase, if he wants to build job board platform, it’s not essential to build a company. If he builds a company, he has to register his business and pays taxes every year. The costs are expensive. He should focus on human resources recruitment and project development. He has a road map for his project; however, the road map needs to be more detailed at each milestone.", "q1r": 3, "q2": "They have key metrics to help everyone track the effectiveness of the project. They offer risks which they will face on the project. They also have solutions for those risks. They need to step up the marketing and advertising process for the project “Job board cardajobs”. It will let more users reach the project.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9290, "q0": "In my opinion, I find this suggestion not so new but useful. I think the influence of future Tech talent will be very high. There are many people who have difficulty finding work, especially with the ongoing Covid-19 epidemic, unemployment in many parts of the world is inevitable. So I fully support projects like this being done. With a job board that provides an electronic identity to employers and employees, allowing companies to search for employees worldwide and apply for jobs worldwide, I find it very convenient. This also saves costs and companies can find many human resources from many parts of the world, which will help diversify the culture and work well for companies. There are also a lot of talented people who have not found a suitable place to work and thanks to projects like this, companies will find talent, and talent will be able to work in a satisfactory environment. That's great.", "q0r": 5, "q1": "With your suggestions in this section, I don't find them very convincing. The work plan has been divided by you by quarter of the year but in my opinion it is not too detailed. I see this project has only one member and the amount of work to be done on the project is a lot. I'm afraid you won't be able to do all the work that needs to be done. With little experience and no support team, I am very interested in this project although it is a good idea but its feasibility is in doubt. There is a saying: \"If you want to go fast, go alone; if you want to go far, go together\". So I think you need to create your own team of many good and experienced people to implement this idea.", "q1r": 3, "q2": "I find this part of your suggestion not so good. The rest is sketchy and short. I think maybe analyzing KPI tools could be better. This output will grow better. When you see these numbers, you will gain the effect to accomplish your goal. Overall I see your projects need more improvement. Hope you will find teammates and be able to develop the project further. Hopefully the project is not just an idea but will be implemented in practice.", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8483, "q0": "The idea of this proposal is very well articulated. The problem here is stated very clearly, and enough to show why we need this idea to be run. This idea, in my opinion, will save so much effort, time, and money for a lot of companies and applicants. I used to work in the HR field and I understand the frustration when it comes to posting a new job, we usually have to discuss which platform is the best one and if the cost is reasonable. However, most of the time, the result is still not satisfactory. Hence, I find that if this idea can actually gather a certain number of users, then it will become a great solution. With the example of different aspects and some key metrics, I agree that the idea aligns with our challenge. We can see a vision of the idea in real life and how it will benefit the users and Cardano. I also agree with all the risks that the team pointed out; however, I don’t find that the team has a solid direction to solve them. For instance, with the risk of the lack of technical staff, the team says that they will find people who want to tackle this challenge. Isn’t it too obvious? I think it’s better to tell us more about what you expect in your dream team, which positions you are looking for in your team, and which skills you expect them to have. Otherwise, I don’t see the solution idea here.  Besides, I have a question to ask the team which is: “How is your job platform different and outstanding from the other similar platform?” I get that it will create some impact, but how your marketing campaign will make it different and really attract users, it’ll be better if we can read more of that information in the proposal. ", "q0r": 2, "q1": "\"\nThe timeline of this proposal is still very vague. The team has only shown us a bare minimum detail of how the work will be done. And apparently, it’s also not a completed roadmap when we can only see the preparation but not a promised time for actually launching the developed product. In my opinion, it’ll be better if the team can show us a timeline that has all the tasks and deadlines to finish them. That way we can see how your idea is doable. And also maybe a long-term and short-term roadmap to show the potential of the project in the long run. The budget breakdown somehow closely follows your roadmap (which is a good thing) but it’s better to have a clearer cost explanation. For instance, which fee will the 32000$ that will be spent to open a company in Germany cover (documents, legal, …?) or the explanation for that item 1 person (9month 777.78$). Otherwise, it’s very difficult to give the requested the fairest justification. Regarding the team members, I get that this idea is still at its very early stage and the proposer might not have a full team to work with but it’s way more informative if they can show us which positions, they want to look for to fill in the team and which sort of skills and experiences this project requires. Hence, I hope that the proposer can do more research to give this idea stronger feasibility. \n\"", "q1r": 2, "q2": "For auditability, I don’t find clear key metrics and KPIs provided clearly in this section. The proposer expects to have high user and company traffic, but how high? How high is the turnover that you expect and define it as a success? There is not really any item available for the community to keep track of and audit the project in the future. So, I want to suggest the proposer work on more specific key metrics and their KPIs. For instance, how many applications do you expect to be posted on the platform after the first month of launching the program? How many companies want to involve? How many e-identities will be created on Cardano after a certain amount of time? And so on… ", "q2r": 1, "assessor": "z_assessor_2989", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7982, "q0": "The creator of this proposal wants to create a global decentralized platform that gives employers and employees an e-identity. This would serve for companies to recruit globally for personnel and to allow applicants to apply worldwide. I think this project will have little impact on the Cardano ecosystem as platforms to apply for jobs already exist. According to the author of the proposal, 220 million people would benefit from the implementation. It does not say how, for example, the language barrier can be solved. A number of challenges are included in the proposal. It would be good to offer a few solutions beforehand. There is currently only the problem statement without a solution.", "q0r": 2, "q1": "I cannot find the relevant experience of the creator of the proposal on the internet. A few experiences are included in the proposal such as product experience, industry experience, customer and candidate experience (+ 3 years). At first sight, the creator of the proposal does not seem to have sufficient experience. The proposal also states that a team has yet to be established. It would be better to find enough candidates in advance to work with. There is a breakdown of the budget in the proposal. I find it all rather unclear how everything will be implemented. It should be split up better. It could include how long a part can take (per month) and how many hours each part will be worked on. The implementation plan is described too narrowly. The timetable is insufficiently worked out. What is the purpose of the construction company division in Germany? (budget breakdown) The technical aspects are insufficiently described for a good implementation.\nThe proposal includes several challenges that can influence a successful implementation. I think it is important to do an extensive risk analysis before applying for financing.", "q1r": 2, "q2": "There is a road map with a few milestones. The roadmap is too abstract and should include more targeted objectives. It should be more clearly defined when each part has to be finished. A number of KPIs have been included to measure success. There is no indication of how this data will be made public and people will be able to monitor the success of this project. This project is a solution to the unemployment problem. I don't think this project will really have a big impact on the Cardano ecosystem. A few risks and challenges have been considered. I'm missing one more important factor. The biggest factor I think will be the global language barrier that will make it unusable for a lot of people.", "q2r": 2, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6646, "q0": "This proposal wishes to develop a decentralized platform for job seekers and employers to interact with one another with the aid of an e-identity. Indeed, there are great frictions on the employment market, and many economists have studied this phenomenon very closely and tried to understand the mechanism behind this fact. But we also have to recognize that the topic received of course extensively the attention of the business sector, and there are many solutions already developed throughout the world that activate in this niche: many national platforms, many international recruiting platforms, company specific ones, recruitment agencies, and a plethora of other mechanisms that make sure that the demand meets the supply on the employment market around the world. I even dare to say that we are already having a perfectly functioning market and there is little added value, and little potential rents to be extracted, by yet another recruitment platform.  \n\nI also find the proposal not well connected to the challenge, whose role is to foster the development of dapps and to increase adoption rates amongst the Cardano ecosystem. What we have here is a rather classical idea of a job board, and there are very few concrete connections to the features that web3 technologies can enable, except for the e-identity concept, which is only vaguely described and we are not being offered too many details regarding it. \n\nConsidering all of the above, I can only offer three stars since I am not convinced that the proposal would be a great addition to the Cardano ecosystem if implemented. ", "q0r": 3, "q1": "The feasibility of this proposal is questionable at best. Let me offer a few points of view as to why. First, the budget split does not look feasible. Almost half of the budget would be spent on incorporating a company in Germany - which to my mind is an excessive amount and not a good use of funds. Second, the software development, project management are bundled together for a rough estimation of 20-30 k USD required, without any split according to the actual tasks, applicable hourly rates or any description as to who exactly will be actually building the platform. On top of this, there is another 7k USD caption to include another project management, but we are not being told what is the difference between the two. \n\nWe have a similar problem when it comes to the team behind the proposal - sadly there isn’t one. The proposer simply says that he will ask around for people interested in building the platform with him. One sentence later he tells us however that “he is the visionary with the idea but that he cannot implement this from the technical side”. So a bit contradictory even between two sentences.\n\nA similar experience hits us when looking at the roadmap. The project would be split in three quarters. A big surprise comes in the Q1, when the proposer informs us that the necessary steps of the project will be to (1) quit his job, (2) finish the whitepaper and (3) incorporate the company. So in other words one third of the project would involve offering time for the proposer to cut his existing attachments and finish the idea behind this proposal. Needless to say that this is very unconvincing. A similar poor experience exists when going into the details of Q2 or Q3, but I shall spare you of the details. \n \nAll in all there are extremely high chances that it will not be feasible to finish this project according to the existing plan. This is the first time I am offering one star to any of the projects, but it is the only mark deemed correct in this case. ", "q1r": 1, "q2": "If you’ve made it this far, it probably comes as no surprise that the auditability section is weak as well. We are offered a few bullet points on how the project will be tracked, but they are not very informative: platform will be tracked by users and company. What does that mean exactly? We are not being told. A moderately good news is that the proposer offers a few definitions of what success will mean for the project, but they are less than ideal and could have been a bit more applied. For example “the definition of success for a user is to find a job it loves”. How will you measure this love? Through user surveys after being employed for x/y/z months or years? Again, the proposal does not go into these details. \n\nSo far the team is a one-man-show, so there are of course no communication channels open for the Cardano community to interact with the project, if funded (Telegram Twitter, etcetera). Given all the above information we cannot really trust that the project will be easy to audit / interact with, hence three stars I deem as sufficient. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5972, "q0": "I agree that the proposed idea which is a decentralized job board platform would have a positive impact on Cardano Ecosystem in term of adding a value-added service for Cardano users who are looking to find jobs in the market in the future. Engaging Cardano with such real live business case (companies looking for qualified candidates and people using the platform to find their dream jobs) with benefits of e-Identity, smart contracts, secure payment transactions would look like a nice vision to study and explore. On the other, I would think of the existing job board platforms and how mature they are in term of usability and number of users like LinkedIn and others, and I would think of also exploring the options of possible integrations projects with the existing platform to benefit what they already established and leveraging Cardano technologies in cooperation with the existing job board platforms!", "q0r": 3, "q1": "Looking into the feasibility of this visionary proposal, the main output that will be used to decide the future of this project is the “Business Idea/Whitepaper: 7500$”. I would say that this item is crucial to make decision whether this project continue or not. So before spending money on establishing the company for example (Build Company: 32000$ In Germany), it makes since to see whether this project worth to be implemented or not based on the business study and plan. I wish that this proposal included a small business study as an initial step to justify the other expenses needed to start this visionary project.", "q1r": 2, "q2": "As the proposal suggests implementing this decentralized job board vision in phases: \nPhase 1: is the target of this proposal and it includes business study and prove of concept as main deliverables) and this will finish by end of 2022.  \nPhase 2: is the actual implementation of the decentralized job board project in future after completion of phase 1. \nThe metrics and KPIs defined for the success of this project (such as user and company traffic on the platform, turnover, interaction with the platform, number of applications and advertisements on the platform…) are mainly related to the Phase 2 of this project which is not the target of this proposal. It might be more practical to see more details about the metrics and KPIs that are related to phase 1 main deliverables which are the business study and POC. ", "q2r": 2, "assessor": "z_assessor_2765", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5039, "q0": "The proposal fits well with the objectives of the challenge, as it proposes the creation of a platform that is intended to facilitate the connection between employee and employer, in an easy and fast way, using only a CV as personal documentation for those looking to find a job. And although there are already several platforms with similar goals, such as: Job Offers - Work in Estonia, Indeed.com, We Work Remotely among others, the Cardano ecosystem still lacks such a resource, and with the world being increasingly connected, and remote work being increasingly frequent, cardano's job board proposal has the ability to attract many new users to the cardano ecosystem and expand its influence in the world (depending on the quality of the final product, and the number of companies that join to the project). And in case of lack of initiative from external people, such as companies and applicants from outside, the project still has the ability to make life easier for users already present in the ecosystem, and speed up the process of finding applicants with the necessary qualifications for a given proposal. , increasing the chance of realization and the quality of the same, ironically, cardajobs would facilitate the fulfillment of its own proposal, because unfortunately, it still lacks a qualified team for such service.", "q0r": 5, "q1": "In terms of planning, unfortunately, only 3 milestones are available, in separate periods in 3 quarters, and the last one is where a proof of concept will begin, which gives the idea that the project is still very aimless, and uncertain. . Regarding the division and amount of funding, we also find the same simplicity, and uncertainty, that is seen in work planning, having somewhat strange values, such as “Build Company: 32000$ In germany”, wich sits right between 26,060.25 US $ and 52,060.00 US$, which are the amounts to create a limited liability company and a business in Germany as a joint stock company or a limited partnership, respectively. On the other hand, the amount charged is very reasonable for the scope of the project, and totally in line with the total invested in the catalyst challenge, although the costs should vary with the size of the team involved, and that's where the next problem comes in. The proposal still does not have anyone qualified to make the proposed product a reality, and with that, as much as the idea is very fruitful to the Cardan ecosystem, any possibility of fulfilling it is frozen until the appearance of qualified people for such service.", "q1r": 2, "q2": "In terms of audibility, it will not be difficult to follow the progress and measure the success of the product, once made available to the public, since it is something whose objective is to be adopted by the greatest possible number of people, from inside or outside the Cardan ecosystem, a simple check of active users, customers and applicants, to know the adherence rate. Unfortunately, about monitoring before the product is ready for use is still uncertain, and no way has been made available where updates on the progress and progress made in the production process will be made available, so it will be difficult for the public to know whether the investment received, if the proposal is funded, has been put to good use.", "q2r": 4, "assessor": "z_assessor_2665", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4242, "q0": "Cardajobs offers a decentralized global platform that offers an electronic identity to employers and employees, allowing companies to search for staff and candidates to apply for a job.\nI believe that the proposal could lead to a high-impact use case in the Cardano ecosystem, constituting a valid alternative to the current centralized providers such as Indeed, infojobs, etc ..\nAccording to Gooogle Analytics estimates, Indeed's number of unique visitors was 250m in September 2018. Bringing even 0.1% of these people to use the platform would bring about 250,000 people a month to get closer and get to know Cardano.\n(https://it.indeed.com/recruiting/v Advantages?cc=IT&hl=it)\nFrom what is indicated in the proposal, the platform should provide for the use of a token for the publication of advertisements.\nI suggest that you take into account that there are free centralized solutions that offer the possibility of posting job vacancies for free. Adding a publication fee can reduce the impact of the proposal as it could lead companies to look for another application to rely on (e.g. Index).\nRather, the token could be used for additional perks like sponsoring one's job postings to attract more candidates.", "q0r": 4, "q1": "The proposer is aware that he does not have all the skills necessary to implement the proposal, so he is looking for people who want to collaborate on the project, however he does not precisely define the number of team members required to implement the proposal.\nAt first glance, the budget outlined is high.\n$ 32,000 are required for the construction of a company in Germany, however from what I was able to find online the cost for opening a GmbH in Germany is 25,000 euros or 50,000 for the AG\n(https://www.eurotrendagency.com/quanto-costa-apendere-una-societa-in-germania/)\nThe hours of work and the hourly cost for software development are not indicated.\nThere is no evidence of an estimate for the costs of legal advice, I suggest attaching this document or evaluating an initial consultation to get a detailed idea of ​​the costs.\n(You can get a first consultation with a fee of only 200 euros (https://barba-legal.com/it/colloquio-con-un-avvocato-in-germania/)\nAt present the process indicated in the proposal is very concise and does not offer a complete view of the recruitment process in the centralized real world.\nAfter receiving a CV, the employer may have an interest in having an interview with the employee, or use surveys to evaluate particular skills.\nYou might consider offering these solutions in exchange for a small token payment from the platform.\nI suggest greater clarity regarding the signing of contracts between the two parties.\nIn the proposal it is simply said “contracts and applications are executed through the token”.\nI rate the idea of ​​using a native token to pay for contracts as a big risk.\nAn employer wishing to open a job position would have to exchange their currency to buy ADA and therefore the platform token, then deposit in the platform smart contract to guarantee the payment of those who will be hired. For various reasons it could happen that the price of the token starts to fall (especially considering the high volatility), it could therefore find itself in a condition in which it has not yet found an employee, however it has exposed itself to an unnecessary loss.\nPerhaps it would be better to use stablecoin in the drafting of contracts / opening job positions, or to use overcoralized positions with ADA in order to further increase the value locked in cardano.\nFinally, there is no description of the technical aspects such as the architecture, language and technologies necessary for implementation", "q1r": 2, "q2": "The proposer identifies very general KPI metrics capable of defining the success of the proposal but I suggest greater specificity. For example:\n-High traffic of users and companies on the platform-->number of new registered users, number of new registered companies\n-High turnover --> total value blocked in open job positions. Total value of peer-to-peer contracts signed\n-High interaction with the platform-->number of unique monthly visitors\n-High number of applications and advertisements on the platform\nThe proponent provides a very concise roadmap with verifiable success measures which, however, include almost only the \"embryonic\" phases of the project, there are no technical milestones that can be reached and measured by the community.\nI suggest finding collaborators from the early stages of development and defining a more technical and detailed roadmap.", "q2r": 3, "assessor": "z_assessor_2531", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14716, "q0": "\"Globalization has made the world into the connected, interdependent place. The job market is being globalized now. This project allowed the job searching in a global scale and thanks to blockchain technology, the work contract is based on smart contract, increasing the integrity between the job employees and employers. Thanks to the global scale and AI searching tools, employees may have large opportunities to find the jobs that they need without being missed out.\nThe proposers clearly described how the platform worked, and the benefits when using this platform. Some significant features included E-identity, token pay, smart contracts. In terms of the risks, the proposers focused on the lack of staff, money and some general solutions were given. I would like to add one more point is that: I wonder if there was/were any other blockchain based job searching tool(s) like this? And what is/are the unique selling point(s) of this search engine?\nIf this project gain great interests in the job market, a large number of applicants and companies will join the project, thus boosting the users of the Cardano ecosystem. I think this solution is well aligned with the challenge setting.\"", "q0r": 4, "q1": "\"The roadmap just included to the end of this year – and stop at the “start development”. I would like to recommend the proposers to write more clearly about the future, for example, after being funded, what will the roadmap look like? Some crucial processes in this project e.g., the app/web page development, launching, and marketing were not mentioned in the roadmap of this proposal.\nThe budget breakdown was given. However, I recommend the proposers to give detailed calculations for easy fund-raising. For example, the “software development/project management” costs $20000-$30000, how do the proposers get these numbers? Moreover, it would be more clarifying to me if the proposers allocated the money in accordance with the roadmap task processes.  For example, the task “Create a home page”, how does it cost? The more detailed and clarified calculations & explanations, the easier the feasibility of the project. \nIn terms of the human resources, there is only one man (the proposer), and other team members just being “asked”, so I am not sure about the human resources were sufficient to accomplish this project.\"", "q1r": 2, "q2": "\"The metric terms used here were “user”, “companies” which were quite vague to me. To increase the auditability, the metrics used could be more specific, for example, the number of employees, companies joined, the number of jobs found, the number of contracts signed, etc. \nNext, the proposers should specify the wanted KPIs/metrics in a given period. For example, 1 month from the platform launching, 5000 job applicants join the platform. In terms of the success scenarios, it was quite clear for the community to follow up the projects.\"", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14818, "q0": "The proposal, in general, has prepared very well what is required as a product directed at the job market, assisting both recruiters and job searchers in achieving their goals. We have procedure examples on the platform and application registries to enable users to perceive and understand the specific actions that must be completed. Furthermore, the project's layout is presented extremely methodically and with excellent cohesiveness. We definitely perceive 12 characteristics as well as a big number of platform participants. Instead of just mentioning the advantages to users, as many other projects do, the proposer has highlighted a very precise understanding of the benefits that the project would provide to Cardano, which I admire. Because it not only provides investors with a clear picture of the benefits that the proposal offers, but it also demonstrates one of the project's key objectives. Furthermore, the author's method will comparatively tackle the difficulties that are still generating suffering in terms of restricting the unemployment rate. The project specifically emphasizes expanding the Cardano network and leading to an increase in wallets, transactions, and e-identities on Cardano, and it is, in my perspective, entirely aligned with Challenge. However, the author's approach to future difficulties remains too hazy and narrow. In particular, it appears to me that the project does not yet have a complete lineup to work on and is merely looking for people who wish to join in the project. This will present significant problems for the project since it will take a long time to determine who is the greatest fit. Furthermore, the project in general lacks distinguishing qualities when compared to other job search websites. There are already many platforms that assist both businesses and individuals, therefore if there is no distinction, the project is likely to be neglected by users since it lacks long-term client confidence.", "q0r": 3, "q1": "First, let's look at the project's budget. The budget plan is $87,018 and this is not a tiny sum. We have 6 funds to spend, and there is an item named 1 Person (9Month 777.78$) that I'm not sure what it accomplishes. Also, for $32,000 for a corporate construct, it's a little hazy. The proposer should specify when construction will commence and which departments will be involved. Next, for the project plan, the proposer then expects to proceed with the project plan in the last three quarters of 2022. Every three months, the number of particular activities to be completed ranges from four to five, and the tasks are typically aligned with the project's objectives. However, the proposer indicated a second-quarter move that was to form a corporation, but we do not know whose firm it is. The third quarter of 2022 has already begun, indicating that the firm has been formed but that no company introduction, website, or company name has been linked to the article. In particular, at present, the project does not have a member except the proposer. It is clear that the proposer is searching for technical professionals because the author can only be in charge of areas such as products, marketing, clients, and platform development. However, rather than just listing your abilities, the author should strive to include information about your experience while working at the previous firm, as well as your education and credentials. The lack of such crucial facts will make the proposal difficult to launch and will not be well received by voters.", "q1r": 3, "q2": "The proposer offers us with two project success orientations: the success of the platform from a commercial standpoint and the definition of success from a user standpoint. Both are written succinctly but convey pretty important information. However, it would be preferable if the author specified how many people would use the product or how much income will be generated. It does not have to be a particular figure, but rather a range to allow voters to fairly judge the project's performance. Furthermore, there is very little information available to assess the status of this initiative. For the development process of the project, specific timelines for each completion of a task are extremely important, because it is the only measure to accurately assess the work progress of the entire team as expected or not?", "q2r": 3, "assessor": "z_assessor_4104", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Global decentralized platform (job board) that offers an e-identity for employers and employees, allowing companies to search for personnel worldwide and applicants to apply for jobs worldwide.", "experience": "Product experience, process experience, industries experience , customers and candidates experience\n(3+ years)"}