{"id": 414238, "author": "cryptoloops", "title": "Bringing MMORPG Gaming to Cardano!", "url": "https://cardano.ideascale.com/a/dtd/414238-48088", "category": 26595, "amount": 25000, "description": "Currently, there are no large scale blockchain games that target non-crypto users within the MMORPG genre. This is a large market of digital natives that are not being brought into the Cardano space.", "f6_no_assessments": 13, "f6_rating": 4.615384615384616, "videos": [], "media": [], "f6_assessments": [{"id": 8298, "q0": "Overall, I must admit that this is one of the best written, organized and detailed proposals I have come into contact with. The methodology is consistently diligent and the intention is clearly demonstrated and immediately addresses the objective of this Challenge. And it’s even more exciting to know that having an NFT to get access to the game will not be mandatory, but those who do have NFTs will still be able to make the best out of them. \nPersonally, I’m quite intrigued by the overview of gameplay and mechanics of the game, as it not only covers some of the essential elements but also introduces some pretty new and fascinating things as well. From what I’m given to understand, Flooftopia will be set in a 3D open world where players will be able to move, interact with others and go on quests, etc. And the fact that the game doesn’t feature heavily on combat for ranking up but instead there will be other simpler options, it’s definitely a welcoming bonus for those with a low-skill level or just looking for an enjoyable time scouring the game, and those who choose a less hardcore way to grind through the game (i.e. fishing, woodcutting, etc.) will still have the same benefits and abilities as those who fight their way up the tiers, thus ensuring equality amongst players. There are also multiple professions to pick or switch among, each of which will bring forth different values and properties to the players’ community, and of course, the more advanced the professions are, the higher the requirements to get them are, guaranteeing a nonstop fun gameplay experience. And as their community gets more and more thriving, players will get to have more and more benefits. All in all, as stated in the proposal, players can choose to explore the game on their own with the help of various NPC-led guilds or work together as an ever-growing community to conquer the game. Hence, bringing in a positive number of players to the game sounds really promising.\nThanks to the minimized barrier of entry and an unique gameplay mechanism, along with the determination to warrant a stable and long-lasting user experience, I have high hopes that the team shall achieve what they set out to do with this game, which is to convert gamers, the already digital natives, to blockchain natives. The proposal has also listed down 6 different key metrics to measure their initial success of the game (though I would love to see some estimated figures), all of which make perfect sense regarding the aim of this Challenge. And I’m even more confident in the future of the project with the team’s promise of delivering new metrics to monitor once the game is launched. \nAnother impressive feature of this section is the main obstacles of this project, which the proposer is claiming to already deal with. And a substantial amount of their own funding has been put towards the realization of this game, hence, getting the funding from Catalyst is not a primary concern, which is a first for me. The team is also working with the creator behind AdaQuest, Red Potion Studios, whose expertise and past experiences should be able to help Flooftopia avoid any downfalls, all the more guaranteeing for a steady future.", "q0r": 5, "q1": "As far as feasibility is concerned, I am once again amazed by the display of information. The roadmap and milestones, while seemingly brief and simple, are sufficient and efficient to me, and it appears that the team is expecting to deliver this game in one year’s time as well. The most fascinating detail, personally, in this section is the integration of the Unreal Engine itself. I’m aware that I have shown my interest in the Unreal Engine in my past assessments of other proposals, but I remain optimistic whenever I see it being utilized. The Unreal Engine is arguably one of, if not the best, the most powerful and effective tools responsible for the creation of hundreds of realistically looking 3D, AAA and competitive games ever since its introduction to the world in 1998. Combined with the content of gameplay mechanics in the above Impact section, the hype just gets higher and higher. \nAs for the detailed budget breakdown, it is allocated to different segments of the game, from the initial stages to the final steps of marketing and legalization, all of which seem quite reasonable, though I would want to have more details to have a more conclusive saying. \nThe list of involved team members in the project is also another highlight of the proposal. Every single individual comes with names, relevant expertise and past experiences, along with respective LinkedIn profiles to further verify them all. As I glance through this area, I notice that some members have worked for big names in the gaming industry, such as Unity, Ubisoft and Rockstar Games, which is the creator of the worldwide sensation Grand Theft Auto franchise. All the more reason to hope for a bright future.", "q1r": 5, "q2": "I would argue that the team has succeeded in achieving a certain positive level of clarity as they choose to stick to the timeline and milestones provided in the Feasibility section, and any changes or updates to the project will be posted on their website and litepaper to be released. \nThe envisioned success of the project aligns perfectly with what the proposer set out accomplish, which is a fully functional, fun and appealing game, paving way for the increased player base monthly or annually and gradually, the establishment of new Cardano wallets for the blockchain integration within the game, all of which fall into perspective of this Challenge requirements. All in all, a well-composed proposal for a potential hit in the future.", "q2r": 5, "assessor": "z_assessor_2974", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Now! This is someone who read the proposal! 10/10 would recommend!"}, {"id": 14533, "q0": "The project ambition is to combine the interesting gameplay experience of MMORPG with the innovative site of blockchain. However, several factors related to tts impact must be discussed before any funding. First of all, the proposal offers a unique approach that aims both at driving Cardano acceptance and building a sustainable NFT related game. As stated, they target both crypto gamers and non-crypto gamers by giving access to the game without required NFTs. This is a wise choice since it not only increases the number of players but also minimizes the negative impacts of the market on the game. A strong example of this is Axie Infinity. They once were the leading in play-to-earn game during the bull market but when the market went down, the number of players also dropped significantly because gamers join the game only to seek profit rather than joyful gameplay experience. Realizing their mistake, Axie is allowing people to join the game without the initial NFTs. This move is exactly what this MMORPG project is going to do. Another strong point of the proposal is the key metrics it listed to measure the project development such as NFT sale, increase in the number of wallets connected to the Cardano blockchain. With reference to the gameplay, it is also mentioned with great details. Following their saying, the uniqueness of the game lies in it emphasizes to promote players to play together in a social/ cooperative manner and also the non combat-center factor. However, to give examples of other successful games with the same approach, they should list out a specific case study instead of “other games have proven”. More than that, the link between this MMORPG project and Cardano ecosystem is the NFTs. Agreed that the main focus of the project is gameplay development but NFTs are what directly drive the Cardano acceptance among the community. Despite its importance, NFTs in this project have little information about. With a view to improve the proposal, they should discuss more on what are the game assets they NFTs represent, what special about it that can draw gamers attention and encourage them to purchase for it. Lastly, in the “describe the risk” part, they have pointed out any specific problems. All they did is announce that these problems have already been mitigated. However, it is advised that the proposal should mention the detailed problems that they are facing. This will allow the community to evaluate how big the problems are and how they can affect the project. Besides that, the proposal should also mention the specific solution for the community to know whether those solutions are effective or not.", "q0r": 5, "q1": "Thanks to the clear plan, budget breakdown, and member list, the project shows a strong sense of feasibility. First, the plan is thoroughly scheduled for the next 4 quarters from completing the game in the rest of 2022s to releasing the Alpha version for testing in the first half of 2023s. However, in the previous part, the proposal has already mentioned several key metrics that will be calculated as soon as the game is released. But the plan failed to point this out. As for the budget, the proposal logically distributes it to different sectors and the team member list also has no problem. Each member are mentioned with an overview of their capabilities and a LINKED IN profile for any further research.", "q1r": 4, "q2": "The proposal proposes two ways to track the project development; the first is through the progress of the timeline which will soon be published on websites and white papers. This is a great way for the community to follow the project development. The second one is through the NFT statistic. To measure it precisely, several key metrics have been introduced earlier in the proposal. The project successful vision is closely align with the challenge. Both aims to promote the acceptance of Cardano ecosystem and enlarge the Cardano community. The project also shows its strong detail by pointing out the specific targeted numbers like 1000 Floofsminthed in the pre-game phrase and several MMORPG KPIs such as daily active users (DAU),…", "q2r": 5, "assessor": "z_assessor_4071", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1598, "q0": "The idea is very good and certainly fits with the objectives of the challenge. More specifically in the points: “Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases” and “Creation or improvement of different Dapps, products, and integrations that provide value to the Cardano community and wider ecosystem”, present in the summary of the challenge. Flooftopia is a different game from the others found in the cryptographic universe, due to several factors. For example, the proponents already make it clear how it is not necessary for users to have any NFT to start playing. This is very important to give access to those people who do not have much knowledge about blockchain. New audiences would be attracted by the type of game, which is not focused on combat, but on developing the lives of NPCs. It's a very characteristic game for a niche that likes to build villages, evolve their characters, interact with the environment, etc., apart from the fact that some images attached to the proposal already demonstrate what the 3d interface would look like, quite attractive. The playability as a whole is very clear, we know what players would do and how, and it is super relevant that proponents are concerned with including people with a low degree of player skills, so that it is not a game so specific for those who already are experienced players. That is, I think it is a project that can be a gateway to a different audience, both those who are not experienced with blockchain technologies and those who are not experienced with games themselves. It also seems to me to be a game that will appeal not only to adults, but also teenagers and maybe even slightly older children, because of its attractive design and its apparently simple and enjoyable gameplay. Speaking of the specific objectives of the challenge, these will certainly be achieved. For example, by what is understood each character would be a unique NFT coined on the Cardano blockchain, therefore, a CNFT. I believe that the transactions carried out here would be smart contracts, which would increase the number of those in circulation on our blockchain. One of the main goals of the challenge is to attract new users to our community, which would most likely happen due to the characteristics already described earlier in this analysis topic. In addition, so that new NFTs can be minted, new digital wallets would be created, also meeting one of the requirements of the challenge. Therefore, I believe that the project actually deserves the highest score in terms of impact.", "q0r": 5, "q1": "The proposal roadmap only allows us to have a general idea of ​​what will happen, as the proposers divide the timeline into quarters, each of which is composed of a few activities. Ideally, this timeline should indicate what would happen at least monthly, in my opinion. The level of detail of each activity could also be better explored. For example in the fourth quarter of 2022, we know that there would be the development of the Flooftopia 3D world, addition of Floofs customizations and etc. Right, but how would these processes be done? Which professionals would work here? And what would your workdays be like? What milestones are they aiming to hit in the first month on the job, or the second? I think each of the phases could be better broken down, so that we could have a more solid view of the whole. This project is certainly not starting from scratch, so it would also be very interesting if there was a small retrospective of what has been achieved so far. Regarding the budget division, I think this part of the proposal is well explained. The asking value makes sense with the complexity of the project and also with the stage of development it is in. The requested values ​​correspond to the market value of each activity, and the more expensive ones (such as approximately 13k for coding) are better explained, we know the hourly price of that activity. Therefore, I think that in relation to this topic there are no criticisms to be punctuated. Finally, talking about the team involved, this part is by far the best part of the feasibility topic. We know in great detail who are the professionals involved in the game, from designers, developers, advisors, etc. We know their names, their CVs and we have access to linkedin profiles, so a lot of confidence is transmitted in relation to their preparedness to carry out this proposal with complete security. We know that this is not their first project, besides all they mention that they are developing Flooftopia in the same studio as AdaQuest, which conveys a lot of security, since this is one of the main game projects developed at Cardano. With that, this topic is almost perfect, deserving just a little more attention in the detailing part of the script. The more detail we have of the script, it is also simpler for us to perform optimal auditability, since we would know exactly what needed to be done, how, when, by whom and why. Therefore an increase in this part would be beneficial for both analysis topics (script and feasibility).", "q1r": 4, "q2": "This was the topic that left a lot to be desired, because we don't have a good level of detail on how the project's auditability would take place. For example, it is mentioned that they can be followed on the project's website. However, this follow-up is very superficial, consisting of very brief updates on what has been done. But we don't know exactly how such things were being done, for how long and by whom. Even through the script provided, which is quarterly, this follow-up is somewhat limited. With that, I would like the script to be better detailed first. That we knew in great detail what would be happening each month, who would do what, how and why, as I explained in the previous topic. Also, I would like the project team to provide us with more detailed updates on a periodic basis, for example every month. As it is a game and games are complex projects that involve several professionals, the ideal would be meetings, even if brief, with some members of the Cardano community who are very interested, they could be held at the end of each quarter for example, in addition to the updates of the website the paper they intend to create. In this way, we could more carefully monitor how the project was developing, since more information would be passed on and monitored. Now, speaking in relation to the final impacts, I think this can be measured from the reflections made on the impact topic, which would mainly be aimed at: did the game bring new users to Cardano? Has the number of NFTs and digital wallets relevant to our blockchain increased? Proponents explain the success scenario based on the growth of the game itself, the number of daily active players, floof customization and evolution, village formation, community growth, etc. But I think there was a lack of a more careful look at the impacts of all this on our blockchain, specifically. It would be necessary to understand how Flooftopoia players would be relating to the Cardano ecosystem, if they have become active members of the community, so this can be proven and so on. Such information should be made known to everyone, as I mentioned, a meeting could be held with players, team members and this meeting could be open to everyone who wanted to participate in our community. Or else a written survey could be developed, for example, that would allow us to have both a quantitative and qualitative understanding of how all this was reflected in Cardano. Thus, in my view, the proponents only mentioned a few things about auditability, I feel that this part of the proposal needs to be reviewed and better developed, deepened, giving us more assurance that it is an easy-to-monitor project.\n", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 5, "ng": 4, "nfo": 4, "vca_o": 1, "reply": "Again, a ton of information is made available in the litepaper, but we wrote a proposal with enough detail for the average user. If we went into the detail that they are requesting, it would be far too long for the average reader."}, {"id": 1998, "q0": "This proposal consists in creating a MMORPG genre game with NFT possibilities in ADA blockchain – creating the appearance of the characters. Therefore, this idea aligns with the challenge because its success draws attention and users to ADA blockchain.\n\nTo measure its possible impact within this challenge, first we need to understand the game market. The game market size is growing each year. The expected revenue in 2028 is almost USD 0.5T (https://www.prnewswire.com/news-releases/gaming-market-size-worth-usd-435-billion-by-2028--cagr-12-1-zion-market-research-301481456.html). Therefore, this is a mandatory area to put an eye on if we desire to grow as a community.\n\nThe proposal’s idea consists in creating a strong game (story and playability) before focusing only on NFT which is quite important to make the game gain strength and people start to play just for the game, avoiding the possibility of people migrating blockchain based games because of its changing revenue.\n\nBesides that, the NFT market is also growing each day and the possibility of changing the character skin by minting NFT and having a market inside the game is amazing. There are several non-blockchain based games that explores this feature and makes lot of money.\n\nThe expected floofs minted in the pre-phase game is around 10K, which if it’s completed it’ll be amazing to the project. Therefore, the success metrics also align with the challenge.\n", "q0r": 5, "q1": "In order to create a game, at first, you need people who understands how to create a game and it was provided. It was provided a game’s website link and even in the proposals description It was provided a proof of knowledge and experience. Therefore, the gaming part, which is crucial to the project, its covered. Complementing the programming, designing and story part of the game, there’s also a marketing part, which can disclose the game, also a major part in the project.\n\nSaid that, being the gaming part covered, it was also said that there would be a NFT part with ADA blockchain integration (a major part of its impact on the catalyst project). However, I’ve not seen a ADA dev in the team and there is not a bit of the budget arranged for it. Therefore, this part should be more detailed.\n\nBesides that, since the team has quite an experience with gaming making, the roadmap seems clear, objective and direct. It seems that the team know what they’re doing (of course it does not include the NFT integration part, which is a shame).\n\nFinishing, it is missing just the integration part, which is quite feasible if we think that is just a case of hiring a ADA dev. Furthermore, the project seems neat. \n", "q1r": 4, "q2": "The roadmap is nice but it has some ‘unsure’ arguments such as “>10% of dev in…” or “at least 50%”, which is not that good to verify and follow the results. It should be more certain.\n\nThe KPI are good. Measuring the game activity (daily and monthly) is quite nice, and having this projection of minted NFT pregame (10K) its good.\n\nIt would be nice to add a survey to have feedback and to get the gamer perception (which is always different and also has something to give).\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2389, "q0": "We note that the proposal aims to launch a game that uses Cardano technologies. As we know, the games industry is now one of the largest in the world, with a wide spectrum of visibility. With this, we see that a possible success of this game would certainly bring great visibility to the Cardano ecosystem. Thus, we can say that this proposal is in accordance with the objectives of the challenge. Furthermore, given the projection that can be achieved by the game, we have that the budget being requested of $25,000 seems quite coherent, as we will comment further below. Additionally, in addition to the high visibility that games naturally already have, we also have the factor that the project is planned to be translated into several languages (as we can find in other proposals from this fund), which increases its visibility even more.", "q0r": 5, "q1": "One of the most influential factors in a game's success is its ability to get the audience's attention. In this context, a mistake commonly made by other games is the excessive focus on features such as the sale of NFT's. But here we can see that this mistake is not being made, since at various times there was a concern with the creation of the game's storytelling. In short, the concern with gameplay in the first place seems to be one of the strong differentials of the project, and we see that several actions about this were planned, such as the possibility of carrying out different activities within the game (professions), building houses and participating in guilds. The sale and customization of NFT's is presented as a complementary tool to the game, and not the main focus. In addition, when we look at the project's action plan, we see that the planned actions are coherent, as it is good to see that QuestLines are already being developed. Another good point is the plan to have 50% of the game world already developed this year with an alpha version being released in early 2023. Regarding the budget breakdown, we found a good allocation of expenses with the highest amount (about 50 % of the total) being earmarked for development, which is perfectly compatible given the focus of the proposal. However, other spheres of the project were not overlooked, given that we also found capital allocation for marketing, a fundamental area to generate engagement around the game. And with regard to the professionals involved in the project, we have an excellent theoretical foundation, having a deep experience in the area of ​​games, when we notice the work of some of them in companies like Ubisoft. However, it is worth mentioning that the team also has knowledge in other areas such as writing, illustration, marketing and sales.", "q1r": 5, "q2": "We see that the main way chosen to follow the project seems quite correct, as the goals described on the website are very clear and easily followed by the community. Additionally, such targets have already been made available with an indication of when they should be achieved. Regarding the team's perception of success, we note that the scenario described is very consistent with the game's purpose of causing new players to join the blockchain space. On top of that, great tracking parameters such as created wallets and sold cosmetics were indicated, as well as traditional indicators of a game's success. It is also interesting to note the establishment of a target of NFTs being minted.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7285, "q0": "This proposal effectively addresses the challenge. With the creation of a large MMORPG called Flooftopia in a 3D environment with engaging, unique, community-oriented content that integrates the Cardano blockchain, because it does not require NFT to access the game, there is no fee. should make it easier to attract new players, for Web 3.0 connectivity that makes games easy to expand and use such as NFT and more for those who want to use that functionality, making the game more enjoyable and long-term, stable, so it is impactful and brings lasting value to the cardano ecosystem.", "q0r": 5, "q1": "Detailed explanation of the stages, of the project, information about the project, partners working with Red Potion Studios, participants, work experience provided through LinkedIn, is really accurate and seems to have been carefully written. The proponent provides voters with a detailed overview and mechanics of the game, the proponent team is spending their own money developing the game, seeing enough research done, and the determination to make it happen. project success to the end of the proponent. The budget is close to reality, very well explained and detailed, the plan clearly states the resources needed to implement the proposal, clearly explains the technical and technological aspects. Although the proposal does not specify the risks that the project may face, in return the proponent has worked with an experienced partner to reduce the risk to a low level. So I think the project will most likely be implemented successfully", "q1r": 5, "q2": "The proponent offers a step-by-step plan for implementation with clear and defined timelines. However, the indicators to measure the success of the project are still vague, not specific, for a more accurate audit, I recommend adding KPIs and measurable results, like the number of players participating in the game for specific time periods, or the number of new Cardano wallets created when players join Flooftopia, the proceeds of which are obtained through the sale of NFTs. The proposed implementation solutions are clear, detailed and easy to understand, making it easy for the community to follow. The first project to apply for capital, the budget is outlined in each item, corresponding to the timelines, should be confirmed. The project has a lot of work to do, so in my opinion the required budget is reasonable.", "q2r": 4, "assessor": "z_assessor_2886", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8564, "q0": "This proposal, as described, appropriately addresses the challenge and has the potential to have a major impact. The problem statement is clear, there are currently no large-scale blockchain games aimed at non-crypto users within the MMORPG genre which is a large market of digital natives that are not being brought into the Cardano ecosystem. In order to address this problem, the author of this introduces Flooftopia, a community-driven NFT MMO game that caters to all demographics while implementing Cardano Blockchain Integrations. I like the general concept and the relevant solution. I believe it is excellent that the writers provide us with an understanding of the project's essential components as well as some complementary ones. The key metrics are defined and in accordance with the challenge settings. This solution, in my opinion, not only efficiently addresses the challenge, but it also has the potential to bring significant adoption in markets that are extremely popular, such as the MMORPG genre. I have no doubt that if this project is successful, it will be a game changer.", "q0r": 5, "q1": "The project will run from Q3 in 2022 to Q1-2 of 2023, which seems reasonable given the number of tasks involved. The proposers split the project's development into three parts, each with details of what will be accomplished to achieve the stated goal. Such descriptions provide us with a solid understanding of the activities that will be developed, as well as how long each of these parts will last. That said, there isn't much to question, other than the fact that as much information as possible is always a positive thing. It would be really helpful if more specifics on who would do what was provided. The team involved appears to be extremely skilled. We have details about who they are in an individual way; this is important for building confidence, and with such justifications, we are certain that they have the expertise to properly implement the project. It is really encouraging that they attach LinkedIn profiles, allowing us to get to know them further than the information in the proposal. We also know what role each of them will engage, which is a benefit in my opinion. In terms of the budget, this part of the proposal is not that detailed, but I believe what was presented is sufficient to build a clear understanding here though. We know how much each component of the project will cost, and the variable costs of game design, 3D modeling/animation, and coding are extremely well estimated, broken down, and described so that we understand precisely what will happen here. After doing some research on the current market value of expertise, I believe the hourly rates included in the proposal are realistic, with the exception of the one for a coder. $100/hr is higher than the hourly wage for coders (which is approximately $35 to $51 on average) so it is necessary to outline detail of the role in order to justify the high rate. However, as I said, more information would be better, how would the marketing campaign happen within a total of $2,000 as well as the budget allocation for the legal component should be more detailed. As a result, this part left a little to be desired in terms of detail; if there had been additional explanations, we would have a clearer picture of what would happen with the requested funds.", "q1r": 4, "q2": "The proposers certainly have a team of talented people who can help the project succeed. The precise problem description, creative solution, and plan for achieving it are simple to understand and follow. The budget is broken down into a few spending categories that are clearly related to the project strategy and goals. Success metrics such as customizable minting of the Floofs is presented and fits in with the project scope. Also the definition of success of an excess of 10,000 Floofs minted with the entire process being problem free or seamless is sensible and realistic. With a decent roadmap and clear milestones voters have a sense of when and how the work will be completed. I would have liked to see the roadmap expanded upon and clarified when and how the Cardano community would be notified of success, as well as some more concrete KPIs for voters to understand how the project's success will be assessed. I appreciate how the team makes it apparent that the community can follow the project's progress on their website. Overall, based on the evidence presented above, I am confident that this plan is auditable.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9289, "q0": "I completely agree with your suggestion. Because this is an interesting and attractive project especially for today's tech-savvy young generation. This model will help people access the ecosystem quickly and without causing boredom. Applying Blockchain to games is a problem that Game developers take into account. Recently, Whydah company officially cooperated with 7 major Game Studio in Vietnam (Topebox, Wolffun Game, Imba Game, Hiker Games, Divmob, 1B Game Studio, KEIG Studio) announced the orientation to become one of the companies. The leading Blockchain application for traditional Stuido Games. The above proof shows that your Flooftopia project will have high potential, following the worldwide development trend because Flooftopia is the ideal project to make the Cardano Ecosystem the leading blockchain for gaming. . I was also impressed with the suggestion your team made to ensure a high skill ceiling and a low skill tier to minimize barriers to entry. This is necessary. You have also assessed the risks and come up with ways to deal with the risks. I see this project with potential.", "q0r": 5, "q1": "I am very impressed with your team. You build a team with full members in each step to implement the project. This makes the project easy to develop and deploy on schedule. At the same time, the team members also have good experience, you have the full link. You have also given a detailed plan according to each specific time period. However, it is necessary to include more game demos or video illustrations for the project to make it easier for people to understand. Costs are public, concise and easy to understand. The possibility of Flooftopia will be successful if taken seriously. I am very impressed.", "q1r": 5, "q2": "You suggest that it is possible to measure the progress of your team's project by being able to keep up with your timeline (on our website and soon to be published) then you should leave the website at the suggestion for people to follow easily. You already have KPIs, DAUs, MAUs... to measure the success of the project. And I think your success is not only measured by the number of stable players, but also by the percentage of players growing or the number of players investing their money increasing by many percentages.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9474, "q0": "For thorough display of gaming uniqueness and designed accessibility, I rank this project a 4. While I do think that’s a little overpresumptuous to claim that this one game (that doesn’t maintain most of the features of any of the biggest games on the planet) is going to make Cardano the premier blockchain for gaming, I do think it contributes in a unique way. Flooftopia taps a major gaming audience that enjoys causal games like animal crossing, as an example. I’m not aware of anyone designing this style of game in the Cardano ecosystem, or anywhere in the cryptocurrency space for that matter. I think the concept of making a game openly accessible (hoefully F2P), but still NFT compatible, is a brilliant idea for encouraging adoption by introducing those capabilities to people that might just come to play games. To provide some additional assurance, they identify (by name) a reputable partnership that will be helping them along the way. I do think that there’s some room for some improvements in this section that would appeal to voters, such as market research about MMORPG gaming and populations for the casual gaming genre. I also think there could be more effort put into the risks section, to demonstrate to voters that the proposers are well aware of all the possible risks and are prepared for a variety of outcomes and curveballs. ", "q0r": 4, "q1": "For a surprisingly well rounded and highly skilled team with a very simple roadmap, I rank this section a 5. It’s not often that I criticize a proposal for not asking for enough funding but I do think they need more. It might very well be possible that they’ve got a large portion of additional funding from an outside source but the given budget is much lower than most other Catalyst proposals. Voters may vote favorably for a proposal that appears to spend far more efficiently than other proposals (which is only partly true given some of the roles budgeting a pay rate that is on the much higher end of industry standards). Beyond the budget, the team is undeniably capable of creating a top of the line game as many of these individuals have worked for industry leading companies and have years of relevant experience. I always acknowledge LinkedIn profiles (much appreciated). The roadmap might seem rather small and maybe too simple but this team has been working on this project independently of Catalyst funding, so I’m entirely certain of the feasibility of their success. ", "q1r": 5, "q2": "For a good starting framework of what different KPIs are to be measured, I rank this section a 4. This section demonstrates a common simplicity in identifying different metrics to pay attention to and including product completing in their definition of success. The auditibility sections that go above an beyond are the ones that establish objective target metrics for where they want to be at different timeframes in the life of the project. There’s also a lot of room to add additional metrics to the list, such as social media following/engagement, website traffic, total hours spent in play, average hours spent in play, server uptime, and any other metrics that can creatively display that the team is thoroughly paying attention to a variety of different factors AND has a clear objective definition of success for every milestone that comes along. Voters will respond very positively to that level of commitment to performance. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Again, we didn't write a whitepaper over the project. We wrote a proposal to provide a condensed but adequate amount of information for the readers of our proposal. \n\nSecondly, instead of looking at the proposal for what it aims to bring, the reviewer is being a bit biases, \"While I do think that’s a little overpresumptuous to claim that this one game (that doesn’t maintain most of the features of any of the biggest games on the planet) is going to make Cardano the premier blockchain for gaming, I do think it contributes in a unique way.\""}, {"id": 10521, "q0": "This proposal is extremely interesting in bringing impactful uses to cardano. MMORG games have a very dedicated and long-term playerbase, as the game offers a lot to do, this will ensure a sustainable amount of engagement and interest. The game-first, NFT second approach makes me believe that the team has game quality as their first priority,and a good quality game that shows passion will definitely attract more users. The features and gaming mechanics seem engaging and I have high hopes for what this project can become.", "q0r": 5, "q1": "The team seems competent, and their skills are very well displayed with their social. media links available, where we can see their past works and portfolio. I am particularly drawn in by the quality of the artwork,it looks fun and engaging, and very dynamic.I believe it will play a huge role in bringing more players and helping the game be a success. The team seems very confident in their ability to deliver on this project, but I would like to see a more detailed analysis of potential risks and problems that could arise. What potential problems has the team thought about? The timeline and workload seems very reasonable with the team size and experience. The budgetalso seems very reasonable.I believe they will have no problems delivering the product they are presenting. A lot of work seems to already have been done on the game. ", "q1r": 5, "q2": "This project is very auditable. The development team has a strong social media presence, where they can post regular updates and a clear timeline. The website is very clean and easy to read, and will be a valuable ressource for progress tracking. The success of the project will be shown through community engagement on their linked social media platforms, and the game has a discord server, where players can leave feedback and interact with the development team. ", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11117, "q0": "\"I think this proposal fits the goal of the challenge, which is a game project. According to the author, Cardano has yet to see a major MMORPG with blockchain integration going live. As far as I know, MMORPG (Massively Multiplayer Online Role-Playing Game) or role-playing game is a combination of multiplayer online games in which players will interact with each other in a virtual world. The solution is Flooftopia (Flooftopia is an NFT MMO game) which will bring this much-loved genre to Cardano, and by doing so bring more new users to the Cardano Ecosystem. Regarding the mechanics of Flooftopia, this is not a typical battle-focused game but it is a 3D environment where players will be able to jump, run, walk, craft, talk to NPCs, trade, and walk. on quests..... Players can upgrade by increasing their skills. In this game, players will have many different professions, and each profession will bring value to the players and other players in the same group, clan, or village. In short, this is a game where players work together in a social/cooperative manner. Whether it's the elements or the bosses that the player will have to overcome, there are benefits to the players working together. According to the author, in addition to focusing on game psychology, it also creates NFT, but I don't understand very well the player's profit. How will they profit from selling NFT directly?? In other words, is there a market here? And to join the game, does the player have to pay a fee?\nThe proponent also said that a lot of money was invested to start and operate this project. Therefore, if they do not receive funding, they will still produce Flooftopia. This shows that this is a project that the team is passionate about, and it's great that the team has also provided a link to a related website (https://flooftopia.org/) which further strengthens our belief in the potential of this proposal.\"", "q0r": 5, "q1": "\"Regarding the roadmap, we are presented with what will happen each quarter from Q3 2022 to Q2 2023, some activities are listed. The quarter period is well done. But it would be better if they break these tasks down into months or weeks. What will happen in the month, explain more about each activity, because all we know will be what will happen, not how. Although it is not easy to complete the work according to the plan, dividing the work into a certain period of time makes it easier for us to visualize and understand what is about to happen.\nAs for the budget, the proposal asks for $25,000 and explains the cost ranges very well. We have been briefed on how the budget will be divided, we know what work will be done and how long it will take, and a suitable salary will be offered. So, in my opinion, the detailed budget division is reasonable.\nFinally, about the team, this section is very exhaustive, as all members are very well informed, we know who they are, what their experience is, and possible links to prove what they say. All 8 people involved in the project have the necessary experience to carry out the project, and the great thing is that we know each member's role in this project well. So about the team, everything is almost perfect. So I think the feasibility of this project is high, the only problem is that the roadmap can be improved a bit is to breaking down the activities into smaller timelines, so that the community has a clearer view of the project procedure.\"", "q1r": 4, "q2": "The ability to measure project progress is referred to as \"We will be able to measure the progress of our project development by being able to closely monitor our timeline (on our website). me and will soon be releasing a pamphlet)\" however I don't know if this is a site that will be internally for the project or will be open to the public. Besides, the project also mentioned that there will be a small newspaper, so I will consider that this information will be made public to the community. It would be more interesting if the proposal should specify more clearly what content will be made available on this site and how often it should be updated. And finally, the success of the project is divided into 2 phases. The pre-game/mint phase will be in excess of 10,000 Floofs minted with the whole process being problem-free or seamless and a successful live play phase supposed to be a steady player count for months or more years, stable development, sustainable business model to create favorable conditions for Flooftopia in the future. I believe this is the right direction, however the proponent should outline how they will verify this data and transmit it to the Cardano community. In my opinion, a survey and report should be developed and then published in the media of Cardano. Therefore, I think the audit is well underway, but it needs more detail and clarity on how we as members of this ecosystem will keep abreast of all the updates and information on the results final fruit.", "q2r": 4, "assessor": "z_assessor_3223", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11206, "q0": "The MMORPG is an important part of the videogames industry and could attract a good amount of players to CARDANO. And being a little different to the normal options in the market is allways a good idea. And this game not centered in the combat as animal crossing, a game of huge success on the nintendo consoles. With its latest version breaking all records in 2020. I mention it because it is the style of game to which they aim with attractive graphics of animals and more relaxed activities that appeal to a casual audience, where realice activities such as fishing, woodcutting, which you can go improving as you use them. \nAll mechanics that have been very successful in MMORPG games and that few games implement. By focusing too much on the more traditional elements such as combat.\nFor all these reasons I believe that the project will have a very positive impact to attract users to CARDANO.", "q0r": 5, "q1": "The team has 9 members with their respective photos and linkedin profiles. Something that is always desirable to demonstrate that the experience they claim is real. \nSeeing the different members of the team the only thing that I consider a problem is that they should have 1 extra programmer, as having only a programmer and a coder is little and could make progress slower than it should.\nAlthough most of the requested budget is for coding, so they should be able to cover this deficit. They should specify if it is only 1 person or 2 that they would hire. \nThey also have the support of the team Red Potion Studios (the studio behind AdaQues). That is good to avoid unnecessary delays due to errors due to lack of experience. \nTheir webpage shows a lot of work, and they started the project with their own funding. So they are very committed to the development of the project. ", "q1r": 5, "q2": "Unfortunately everything that shines in the previous 2 points in terms of impact and feasibility is more opaque in terms of auditibility. They have a roadmap, although somewhat brief. This information does not appear in the proposal (the roadmap info) But you can access it in the webpage that they provided in the proposal. But as I was saying, it is a little brief. There are dates of Floof NFT minting, closed alpha testing and alpha release date. But they don't include important information about what features that alpha release will have. This kind of games usually have activities released in successive versions. At least they should detail which are the activities that will be available in this alpha version or when they intend to have the final version available. \nThe KPI they provide are the correct and normal ones in MMORPG games such as daily active users and monthly active users. Additionaly to new wallet address created and linked with the game.", "q2r": 3, "assessor": "z_assessor_3231", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11424, "q0": "The idea team wanted to develop a game associated with gaming and an activity like jump, run, walk, craft, speak with NPCs, trade, go questing. This game called Flooftopia is a type of MMORPG game.\nThe idea is to match the requirements of the challenge.\nAn MMORPG both entertains players and learns or experiences through an activity, so it's fun.\nIn the game, players will play a role no different from reality, can participate in groups and guilds. So in addition to gaming and experience, it has social interactions, so players are made friends and kept longer in the game.\nA game like this will help connect more gaming communities and game developers to cardano. So this idea deserves full marks in this idea section.", "q0r": 5, "q1": "I have carefully looked at the roadmap of the project built to 2023-Q2. This is a detailed presentation, the work steps in each quarter is detailed enough to see how they are building their game.\nI just ask for more comments, your team needs to have more target numbers for their work plan: for example, how many people will participate, when will it be reached.\nThis makes the plan more realistic and convincing.\nRegarding the proposed group's budget, each cost is reasonable, but it needs to be presented in more detail, how many working hours are needed for each plan such as marketing, legal, risks encountered and solutions. ..\nAs for the personnel, this is the part I'm satisfied with, because they have a very detailed profile for each member, and a link to the linkedin profile.", "q1r": 4, "q2": "They will periodically report work progress through a separate website, as well as publish a litepaper for the community to view.\nSeveral parameters are also given to measure the success of the project: number of players, number of new ada wallets and integration into their gaming platform. I think that is transparent enough information to be trusted.\nHopefully they will soon launch before the litepaper so we can have a better picture of their game mechanics, as well as the benefits that players can participate in this game platform, as well as see the shape. about the style of game they will create.\nAlthough this piece of content is quite short, I still give it full marks.", "q2r": 5, "assessor": "z_assessor_3244", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Cardano has yet to see a large MMORPG with blockchain integrations go live. Flooftopia will bring this well-beloved genre to Cardano, and, in doing so, bring many new users to the Cardano Ecosystem!", "experience": "Coding: Dirk\nGame Programmer: Simon\nArt: Christian\nStory: Chris\nMarketing: Conward\nGame Design: Alex\n2D-3D Artist/Animator: Oleg\nLighting Artist: Lena\nStrategic Advisor: Marcin\n(Additional Team Detail Below)"}