{"id": 414227, "author": "mybrandt", "title": "OMIMIMO - The Pure Water Game", "url": "https://cardano.ideascale.com/a/dtd/414227-48088", "category": 26595, "amount": 19000, "description": "We all need pure water to survive and the OMIMIMO game protects nature and pure water while gaining knowledge and having fun through NFT's. To protect the wildlife biome and create awareness on earth.", "f6_no_assessments": 12, "f6_rating": 3.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1597, "q0": "The idea of ​​the game is good, but I found the proposal written in a somewhat abstract way. We know that the intention here is to create a survival game, in which we would have a piece of land, through an active token, from what I could understand it would be a simulation of real wild life in which animals and plants would be NFTs. The goals of the game seem to be to explore the environment and evolve, however the matches themselves are not so clear. What would the gameplay look like in practice? It is said that some activities would be \"find hidden treasures in the wild, collect families and earn mystery boxes with rankings\", but that's a pretty short description of the whole. What would we do in this wild environment? It is said that we would learn about biomes, species, etc., but the scenario is a bit abstract. How would face-to-face camp, in the Nordic environment, enrich this experience and relate to the game? Why would the adopted currency be Omimimo, and not Ada? It is said that players would form a DAO that would later make their own decisions, but what kind of decisions are we talking about? Are they related to the real world or the game experience? How could we be sure that nature would be preserved through the game, in addition to, for example, live measurement of water purity? It is said that “through the Omimimo game you will gain knowledge and connect point by point how the ecosystem works and why exactly all species are needed”. How would this knowledge be gained? They mention having an NGO, but which NGO is this and how does it operate? In general, I think that several aspects are said in which the game would form, but without us being able to visualize the whole in a solid way. I think that for this to be clearer, it would be interesting if the team had, for example, attached a video with a simulation of the game, even if short, so that we could know what it would be like. Regarding the impact of the project on Cardano, unfortunately the authors focus much more on how the game would be beneficial in the sustainable bias than how it would contribute to popularizing and wide adoption of our blockchain. I would like to be more assertive about how the game would appeal, for example, to an audience that was not necessarily active in the cryptographic community. How to make players who participate in projects on other blockchains, for example, become interested in Cardano, realize its differentials. What kind of transactions would be minted on our blockchain, for example? You can understand that information aimed at animals and plant species, but some purchases would be made, NFTs would be acquired, would there be what kind of financial transactions involving Ada and smart contracts, for example? So, even if the idea itself is interesting, unfortunately the proposal is not so clearly aligned with the objectives of the challenge and its whole scenario is a little abstract in the face of such diverse information, but that is not well-detailed.", "q0r": 3, "q1": "The script presented is satisfactory, although not ideal. The timeline is divided into quarters, each of which is detailed in activities. I would like to suggest specifying what would happen each month within the quarters, and also that each activity be better detailed, as they are only mentioned, not broken down. For example, in the fourth quarter of 2022 the “design improvement for in-game customization” would be made, but what would this improvement constitute? How would designers work with the pre-existing material, making it more attractive to the public? Regarding the game mechanics, it is also said that it would be improved at this stage of development. But how, what kind of changes would be made and who would work here? Therefore, I think the script deserved a better depth of parts, so that we had a more complete view of the whole. Similarly, the budget explanation exists, but it is superficial. For example, we know that the development of the game itself would cost 12k. But why? Who would work, developing what tasks, to get this part of the project done? How would the money destined for marketing be used, with what strategies would the game be publicized, how would the target audience be reached? I believe that the gaming universe is one of the richest for the cryptographic community, in the sense that they have many projects and many interested users. So it is of paramount importance that advertising is done in an attractive and assertive way. With that, I think that this and also the other parts of the game's development should be better explained, more detailed in relation to funding. Finally, speaking of the team, this is the part that leaves something to be desired, unfortunately. We don't know much information about the team members, including their full names, which is very necessary information. For example in the case of Maria, we know that she is the creator of the game. But what professional training does she have, how does she relate to the Cardano ecosystem? It would be important to understand a little of her professional trajectory, which projects she has developed until today and so on. It would be important for this information to be proven by some link, a linkedin profile, for example. Likewise for the other team members. Unfortunately, this topic leaves a lot to be desired, requiring more detail in all 3 main parts, especially in the team presentation. That said, it is necessary that a general deepening be done, so that the script allows us to have a more specific understanding of what would be done, how, when and by whom (and why); the division of funding is better broken down, arguing the need for the requested budget; and the presentation of the team is more complete, with CVs that allow us to understand their professional paths.", "q1r": 3, "q2": "Proponents provide good material that can serve as auditability of the final results. We know what are the expected results for each quarter and also what would be the success scenario of the game, which in short would be people playing, having Omimimo NFTs, learning about nature and environmental preservation as they evolve in the game, there is still the possibility to visit a physical camp. Regarding this last part, I believe that there was a lack of detail to understand how, in fact, this activity would be developed. Where would this camp be located, would it only be accessible to European players, as plane tickets are generally very expensive? In this sense, would players from other parts of the planet have any possibility of real immersion in relation to the game's experiences? One point that I think is important to comment on is: we know what should be monitored, but not how. In other words, how would the Cardano community have access to such information, in a direct and simple way? The ideal, in my opinion, would be for the members of this team themselves to have reports, posted or on social networks, or on telegram channels, discord, in short, a means of communication between community members. So that in such reports partial progress could be described, information about each area of ​​development of the game, however diverse they may be. Whether those involved would be carrying out the activities established within the correct time frame and in the expected manner, etc. Another very important issue that was somewhat absent in the auditability of this project was how the impact for the Cardano community would be measured, that is, how the specific objectives of the challenge would be addressed. How can we be sure that the number of transactions on our blockchain has increased? Certainly these NFTs would be minted at Cardano (hence, CNFTs), but how can we ascertain the considerable growth in the number of smart contracts in circulation? Could Ada be involved in this game in some way, besides the cryptoasset itself created especially for the game? In order for all of this to be better understood, it is necessary to establish a solid communicative point with the community, so that all advances, even if sensitive, can be monitored. It is also necessary that the tangible consequences for our blockchain be stated some time after the project is carried out, a direct survey could be carried out with the players, for example, to understand in what ways they would be relating to Cardano after participating in the game (if would have become active members of the community and how). So, as a whole, I don't think that auditability is precarious, but very important issues were not so evident either, needing to be taken more into account.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 9, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 8297, "q0": "Initially, I want to point out that I have seen this project popped up in Fund 8, specifically in the Gamers On-Chained challenge setting. This current proposal seems to be similar to the one in Fund 8, however, I believe that this is a continuation of the one in Fund 8 rather than a lazy copy-paste work. Therefore, I’ll still give my unbiased verdict to this proposal.\nOverall, this section of the proposal is well-written, well-aligned, easy to comprehend and the intention is clear. The aim of this project is to raise awareness and provide knowledge for players to cherish the environment, protect the wildlife biome and preserve the resources wisely, all of which is a noble cause, without a doubt. I notice that the team also has plans for a field trip, apparently, to the Nordic regions for further appreciation of nature, which is very welcoming. The proposal also mentions the integration of Cardano into the game, which is the objective of all challenge settings, however, I feel like the proposer should give more details regarding how technology and real world assets are made for each other, since that part is still quite unclear to me. \nI’m still intrigued that this is a free-to-play survival 3D game utilizing the Cardano blockchain for a noble cause, as stated multiple times in this section. The proposal also offers a glimpse into some elements of gameplay, such as the item rankings of Epic, Rare, Uncommon and Common species; ranking up mechanism through mystery box acquisitions and surviving from predators; and the Omimimo token being the main CNFT currency of the game.\nNevertheless, there are still some flaws to this proposal that I would like to deduct. Please note that I have brought up these issues in my past assessment of this project in Fund 8, however, those issues seem to remain in this current iteration. Therefore, I shall list them down once more.\nFirstly, in order to gain more credit and likelihood to be accepted, I believe the proposal should include some key metrics or KPIs to determine the success-to-come of this project, for example, an estimation of a player base or how much income players will be able to earn from the game.\nSecondly, while the proposal does address a potential challenge of the project for the foreseeable future, which is the ability to make contributions to the preservation of nature while still creating an enjoyable experience for players, there is yet to be a viable solution being offered. It’s clear that the team does have enthusiasm and passion for the project, but I think that a more profoundly impactful action should be taken, for example, the team could extract a small amount of income to donate to charity or organizations with a similar cause.\nLast but not least, the proposal does ambitiously aim, to quote directly from the proposal, “to reach even the most passively pro clean water gamers”, meaning they should have a great target audience in mind, which is suitable for this project. Yet, despite my interest in the genre of this game and the heavily-featured noble cause of nature protection and preservation, the proposal doesn’t offer many details for me to be desired and attracted, regarding the content of the game. There are still a few elements as listed above, but coming from a gamer myself, I still need more details relating to the gameplay mechanism, specifically, what tools players will have and what actions and interactions players can do in order to survive; the game lore which tells the story and background of the game, leading to the open world setting of the game (since I’m pretty sure a survival won’t be limited to a confined space). So I strongly recommend the proposer supplement those details quickly.", "q0r": 2, "q1": "Having finished researching this section, I would like to send out my congratulations to the team for delivering a pretty well-conceived roadmap and milestones. I wish to point out that apparently the project is on the verge of completion, as in Q3 of 2022, the website, gameplay mechanism and the OMIMIMO community is still in development. Still, the team hopes to have delivered the final product in one year’s time, as the final phase of the project is expected to arrive in Q2 of 2023. Even though I would love to have more details at each stage of the project to carefully inspect, I have high hopes that the project will be able to achieve the desired outcome. And I am absolutely loving the idea of bringing the game to the realm of Virtual Reality, as this technology has been on the rise and worth the money for its various applications in different fields and industries. To have players hop into the game and become the survivors stranded on strange land sounds very promising and interesting.\nAs for the budget breakdown section, to be honest I’m quite baffled with the Fractional Ownership part. This part mentions the activities, ownership rights and benefits that players can expect to gain from the game, which, don’t get me wrong, is a very welcoming feature considering that you’re aiming to lure in people to play your game. I’m just not sure whether this is the right section to put this part in. That being said, the requested budget is detailed, due to the fact that the proposal includes sufficient information regarding each phase of the project, from the work needed to be done and the enclosed time periods to the amount of funding for each phase. I notice that the real life visits to the Nordic wild camp doesn’t come with a figure, but the total sum of Q3 of 2022 is $15,500. Subtracting the $12,000 of 12 weeks of game development, the cost of the Nordic trip should be $3,500.\n Nevertheless, the requested budget that the proposal lists, which is $19,000, is incorrect according to my calculation, since the total figure of all quarters is $13,000 + $4,500 + $15,500 + $10,000 = $43,000, more than doubling the the number that the proposal lists out. I strongly suggest that the proposer update this information for best clarity.\nAs for the members participating in this project, the proposal does list out the names along with the expertise and the positions in the project. I must admit that this sector is a little vague since I feel like myself and the community would want additional information regarding their expertise and appropriateness to the project, perhaps some visual evidence or affiliated profiles online, for further inspection.", "q1r": 3, "q2": "From what is offered in this section, I would say that the proposal has gained a certain level of auditability, though there are some small tweaks here and there that I would like to make. The proposal does include its supposed versions of future success, which are the short-term, mid-term and long-term success. All three are relevant to the production of the game with the hopes of a perfectly delivered game in the long haul. However, the team has yet to provide a means of tracking progress of the project, so I suggest using tracking tools such as JIRA for this purpose. And I also notice that there are no details relating to the benefits and profits that the Cardano blockchain can expect to reap from this project, which I would advise the proposer to add since they are quite pivotal.\nOne more thing I would like to add is that in the Impact section, I thought that the Nordic trip was for players to enjoy the natural sceneries and relax. I wish to reaffirm that in actuality, the assets that players may own in the game translates to real world properties, by which I am genuinely surprised. How the team will be able to realize this feature, I believe, hasn’t been specified yet.", "q2r": 3, "assessor": "z_assessor_2974", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 2388, "q0": "According to the ideas present in the proposal, we realized that the project fits the objectives of the challenge in which it finds itself, as it aims to use Cardano technologies to develop a game with the potential to reach many users, promoting the preservation of nature. If the game manages to achieve the intended engagement, in fact this proposal would have a great impact on our ecosystem, and in this context, the budget being requested seems consistent with what is planned to be accomplished. Unlike other games that use blockchain technology, we see here a clear concern to create an immersive and captivating universe for the player to evolve. This is a clearly differentiating point, as other similar games are only aimed at selling NFT's. With that, if well executed, we would have here a good example of allocating funds to promote the Cardano ecosystem and the environment through a game.", "q0r": 5, "q1": "As previously mentioned, a good execution of the project would be essential for this game to reach the desired visibility and awareness. In fact, when we look at the activities that will be carried out on the timeline, we can find ideas that have a good progression and that gradually become more complex, which makes a lot of sense. However, it seems that currently the project is not at a very advanced stage, when we take into account the milestones that aim to be reached later this year. This puts in doubt the feasibility of the project, as perhaps the steps provided here are not enough for the game to be released on the scheduled date (November 2022). In this context, perhaps the expenses foreseen in the budget breakdown are not enough for all the work that must be done until the game's launch. In particular, we are in doubt whether the amount allocated for programming is enough when considering the aforementioned caveats. Thus, we can say that the main point of doubt so far about feasibility is that we don't have so much information or demonstrations that the game is in a more advanced stage of development, analyzing the game's website I also didn't find such indications easily. But it is important to mention the positive factor that the team showed a constant concern to promote the game through marketing and community growth. Still in relation to this team, we noticed the presence of relevant technical knowledge for the development of the game, however, it seems important that other people related to non-technological areas were also present on the team. People who had specific knowledge in project management or administration, for example. It would also be nice if the CVs of the aforementioned team had been made available so that we could verify their experiences more easily.", "q1r": 2, "q2": "Regarding the team's perception of success, we realized that it is consistent with the ideas developed during the proposal, to create a game always thinking about its environmental impact. However, regarding the metrics used to follow the evolution of the game towards this successful scenario, it seems that some numerical goals could have been better established to clearly understand this path. Some of these possible goals would be the expected number of players in the first few months after the game's release, an expected volume of NFT's marketed or even a survey seeking to understand whether players' environmental awareness has increased after the experience.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9288, "q0": "I agree with the proposal to create a game to strengthen and train the cognitive capacity in all people about protecting nature and pure water. Your proposal text provides a consistent and very detailed summary of the solutions to the challenge. By focusing on 3D play spaces for money and real world assets created for each other that can be used to create a better world and for everyone to play for free. This will be one thing that attracts players. One arrow hits 3 targets. People both understand more about Cardano and have environmental awareness and can make money. But this project will be a challenge when it comes to connecting the protection of nature in the real world with the world of technology. In general, your suggestions are suitable for the existing problem. However, it is necessary to work hard because the idea is good but it will be difficult to implement.\n", "q0r": 4, "q1": "I really like your project OMIMIMO - Pure Water Game. I see the seriousness of your suggestions. Your detailed plan has clear long-term and short-term. The interface design of your games is so beautiful that attracts me. Your detailed budget table is very detailed, very good, clear and transparent. However, your group members in general do not have a link to illustrate. But it's okay with the seriousness of the above proposals I see this project has great potential.", "q1r": 5, "q2": "I agree with your project progress tracking. The ways shown to have the project monitored are quite adequate and in line with the ideas presented in the feasibility plan, it is also interesting that the team comes up with a clear, divided short-term plan. clear out each 3-6 month period (short-term success); 6-12 months (success midterm); 12-24 months (long term success). You also have some notes for everyone when you want to participate in the world of OMIMIMO. In short, your auditability performed well.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10263, "q0": "Personally, I really like your idea, and I think the game you are trying to develop based on Blockchain technology is a good solution to raise awareness of the Cardano community in particular and the world in general in the protection of biodiversity and water resources. Your proposal is aligned to the goals of challenge setting through integrating the 3D game with NFTs. Your suggestions contribute to the Cardano ecosystem in two ways, entertainment and public awareness. Although blockchain has been around for a long time, applications like this have only recently emerged as more and more people are learning and spending time in the field. ", "q0r": 5, "q1": "Unfortunately, the proposer did not provide evidence of their personal skills and experience related to project management or application development nor a well-defined and coherent strategy for implementing the project. The game Omimimo has a lot to do with the animal world, I think in your group it is very important to have an expert in this field to make the game more realistic. Besides, the details of the specific number of man-days and costs for each item need to be explained in more detail, I think 19000USD is not feasible for you to implement this proposal because of both technical and maintenance issues, later development.", "q1r": 3, "q2": "The process of collecting information and building your game is quite reasonable, the product integrates with Blockchain technology, transmits information about biodiversity and protects the environment, and protects water resources. The actual visit to Nordic Wild camp and other activities provide all the information for the community to audit the proposal conveniently afterwards. Technically, it will be easier for the community to evaluate and believe in the proposal if the author publishes and shares it on Github,if so I believe your proposal will be more convincing.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10520, "q0": "This proposal tries to bring impactful uses to cardano by offering an engaging game utilizing NFTs.\nThe overall idea is very promising and interesting. Making it a survival game is very engaging, and an extremely fun way to implement NFT assets, as one of the main disadvantages of current NFTs is that we cannot do much with them and only display them. Integrating real life assets into the game and attaching them to NFTs is also extremely interesting, and will bring more interested people, as a big critique of owning an NFT is how it feels like you don't own a tangible object. The goal of the game being to educate the gamers about the importance of the environment and protecting it is compelling, and especially relevant, as the world finds ways to fight climate change. It's a very engaging topic that many people are passionate about. This project completely meets the goal of impactful uses for cardano. I feel it is a very meaningful project.\nI do think the project needs more brainstorming. While the initial idea is very nice. We don't know what the actual content of the game is. What genre of game willit be? What are the characters? Is there any artwork or concept art? What are the features and gameplay mechanics being worked on?How exactly will \"\"real life elements\"\" be implemented to the game? What kind of real life elements? Who will be in charge of the conservation efforts for the environment? There are many elements that remain unanswered, or extremely vague. Perhaps it would be better to focus on a simpler aspect of gameplay, and really flesh out one idea first. It also seems like the game is an immense workload to both maintain online assets and offline assets. It would be better to split the work and collaborate with an existing conservation team, instead of creating a brand new one.  Overall a very promising idea with lots of fun ideas.", "q0r": 4, "q1": "I would really prefer if there were more details about the team working on the project. A more in depth presentation of their skills and past projects, and portfolios of their past works. The artwork shown in the attached examples are very promising. I believe the artwork is the first thing that will attract people to the project, as it is the first thing that people will notice at a glance, and the artwork shown is very appealing to me. The budget breakdown is detailed,but I would like more specification on some aspects. What marketing strategies are going to be used for the appointed Marketing budget? What kind of coding work needs to be done for the Coding budget?", "q1r": 3, "q2": "This project is a little hard to audit. The website has a news section where we can learn about new progress on the game, but there is no other real social media presence. It is also difficult to find the developers' social media platforms. The website is also very rudimental and lacks polishing. There is also no forum or chatroom to see what other players think of the game, to see how successful it is. Work needs to be done so that users can easily interact, give feedback to both the developers and other users interested in the success and progress of this project.", "q2r": 1, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11116, "q0": "\"This is a game proposition and it certainly falls within the scope of the challenge. This game is called OMIMIMO, as far as I understand this game is about protecting nature such as rare animals and plants. Players will own their own NFT, players will be upgraded and improve their rank through finding mysterious boxes and surviving predators in the wild depending on you entering the NFT. And especially through the game can enhance and train cognitive capacity in all people, attract and approach professional clean water players passively. This game will integrate the Cardano blockchain by spreading the knowledge of how technology and real-world assets are made for each other and can be used to create a better world. This will be a survival 3D money game and everyone can play for free.\nIn my opinion, the OMIMIMO game has an interesting idea, through the game it is possible to both make money and entertain, and at the same time, players will also understand more about the ecosystem. Through the game, players will understand why it is so important to care for and protect wild nature, thereby raising people's awareness about protecting nature. If this proposal is successful, it will not only stop playing the role of a game but also connect the protection of nature in the real world through the Non-profit Organization, which is very welcome. Unlike other games that also use blockchain technology in their development, the distinguishing feature of this game is its appeal to environmental issues. Therefore, the fact that the items sold in the game have this identity makes their ultimate success of great importance to the entire Cardano ecosystem.\"", "q0r": 5, "q1": "\"The proposed implementation period is 1 year, lasting from the third quarter of 2022 to the second quarter of 2023. In each quarter, I understand what each sub-task will include, forming an order constraint. What we find here is an explanation of what needs to be done, and what activities will be developed so that they can set up the project as a whole. However, this is not in line-time form. It is recommended that this explanation be broken down into smaller, phased parts of the project and we will need to be linked together. Ideally, these stages will include a list of tasks, and each task should also be set for a specific month and informed how long it will take to complete.\nAs for the budget, I'm a bit confused, as the aggregate budget requirement is $19,000 from Q3 2022 to Q1 2023. However, according to the analysis, the third quarter needs\n-Marketing: 3 weeks $2000\n-Legal: 2500$\n-Game Development, 12 weeks $12000\nThe first quarter of 2023 needs:\n-Encryption: $5000\n-Marketing / Community Growth $5000\nAccording to my calculations the cost needed for this proposal is: 2000 + 2500 + 12000 + 5000 + 5000 = $26,500. Besides, costs like \"\" Design thinking & marketing, 3 weeks $ 4000\nThe development site, 3 weeks $3000\nCode, 5 weeks $ 6000\nTotal: $13000\"\" If the community were to put all of the above together, the budget needed for this project would be much larger than the budget requested by the writer of the proposal. In addition to the cost, requirement do not match, my budget needs to be explained more thoroughly example marketing in = 2000$ we have to understand exactly the next strategy to be used, the next way Near target audience, this process will take 3 weeks and who will do it. Likewise, the development cost need 12000$ will cover the total cost, what kind of development will be, and how many members will be involved in this work?\nAnd finally, on the topic of appearing the project participants are people with experience like: \"\"20 years as a Social Philosopher / Futurist / Scent Developer / Businessmen.\n+10 years of app development. AppScent\n+15 years Author of \"\"31 Ways to Be Free\"\" and \"\"Anthill Warrior\"\", the forthcoming book on futurism.\n+2 years as a Cardano Enthusiast / Researching and learning about Blockchain. \"\"However, in the detailed presentation, we only know 4 members of the project with roles listed very briefly, even the name of the group is not listed. For example, Maria is a game creator and advocates for more women's inclusion in Cardano. But what role will she play exactly here? What do we know about her curriculum and previously developed projects? We have \"\"K\"\" \"\"TT \"\", and \"\"W&D \"\", they are all software engineers, and Cardano experts, but how can we verify that information? Team members need to provide more information about themselves, their name, profile link (if applicable), details of their role in this project, etc.\"", "q1r": 3, "q2": "\"The project's envisioned success aligns closely with the goal that posed the challenge, which is a massive user migration to Cardano, while at the same time working towards the loftier goal of protecting and preserving wild nature. wild and pure water. In this section, the measure of project success is clearly defined with specific deadlines and goals to be achieved. I like how the author divides success into short-term and long term\nFrom an audibility perspective, I strongly agree that this proposal should be easily followed by the community. The team has provided both short-term and long-term success indicators. Since all the timelines and timelines are broken down into more details, the community will have a pretty good idea of ​​what's being worked on or working on right now and what's backlog.\"", "q2r": 5, "assessor": "z_assessor_3223", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11205, "q0": "The idea is to make a game that has assets associated with a real nature reserve. In such a way that the game helps to protect wildlife and makes people learn about the value of the earth's resources. Training the cognitive abilities of all humans.\nIt all sounds very beautiful, but there is really little information on how they want to carry it out.\nInformation about what the game is going to be, practically non-existent. It is only known that it will be a 3D survival game. Surviving predators, chasing for food and water while avoiding traps. \nAll this integrated in a way that is not very clear with a nature reserve, where you will have NFTs that make you owner of a portion of this nature reserve. \nThe impact of this project may be good, but it is really too unspecific to make a good analysis. They should elaborate more on both the game and its relationship with the nature reserve that would be related to the game.", "q0r": 3, "q1": "The team they present is only 4 people, they don't provide full names or any social network like linkedin to give some support to their knowledge. \nRegarding the detail of how the funds will be used, it is very poorly developed. The amounts required for each part of the development do not match the total amounts required.\nConcepts are repeated in the same quarter and with different values. They group categories and then disaggregate them. Really too confusing. \nConcept design & marketing 3 weeks $4000 then Marketing,3 weeks $2000 all this in 2 different parts but both correspond to Q3/22.\nIn total they would need $13000+$4500+$15500+$10000+$10000=$43000\nThey are only asking for $19000, but there is no mention of whether the rest of the required funds have already been raised, whether they will provide them themselves or how they intend to raise them.\nThere is too much information missing to consider that they will successfully complete the project. Besides, a team of 4 people can't make a videogame as complex as a 3d survival game and with such a small budget.", "q1r": 1, "q2": "There are no estimated dates for the alpha and beta release of the game. Between the first 3 to 6 months they will be developing the gameplay and demo of the game. But there is no date for when this should be complete. And considering that currently there is nothing presented of the game, not a single image even if it is conceptual of the game. \nBetween 12 and 24 months the game would be fully developed. But there is no previous step to be able to see the progress of the game. Within 6 to 12 months they should only reveal mystery boxes. \nThey should put together a much more careful roadmap, where dates are set with tangible progress both in the development of the game and its integration with the real world. According to the roadmap presented there is no way to know if any progress has been made until the game is complete. It would be good to at least have information about which graphic engine the game will use, in order to know the complexity that they intend the game to have. ", "q2r": 1, "assessor": "z_assessor_3231", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13409, "q0": "I love how your team uses games to raise awareness of their responsibility to protect nature and rare animals. This brings a lot of entertainment and attraction. Your model integrates free to play, play to earn and learn to earn. Through the process of playing games and NFTs, educate gamers about animals, water resources, land and other knowledge. I think this achieves the goal of addressing the challenge in the proposal. 1 Minus because I didn't see you guys mention how this proposal adds value to the Cardano ecosystem. You should add it as it is an important part of the Cardano community.", "q0r": 4, "q1": "1) Team\nI can't find any documentation links to the profiles of team members. You should add it so that CAs can authenticate the information you provide\n2) Project\nIn terms of technology, there is no model that describes you encoding real-life data, such as pure water into blockchain technology, and then into this game. This makes it difficult for me to visualize.\nYou can also clarify more about the tokens you use in the game and how the team will allocate the tokens.\n3) Budget\nThe budget is outlined in several parts but is still not clear and specific. The number of employees, the salary for the employees, the amount paid for each marketing activity are important information that is missing.", "q1r": 2, "q2": "1) I agree with the development plan of the project, the steps in the roadmaps are properly designed. To ensure this progress, your team will have to work extremely hard.\n2) The way the team presents the project's success metrics looks like the project's roadmap. I suggest you can give metrics like the number of people participating in the game, the number of app downloads, the number of website visits...", "q2r": 3, "assessor": "z_assessor_3623", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14715, "q0": "\"It is interesting that the gap between physical world and crypto world is filling up. This project was about designing the gameplay that gamers having assets via NFTs linked to nature i.e., pure water. This pure water is reserved by the non-profit team, and the water purity data can be sent to gamers whenever they want. The gameplay is in play to earn, survival 3D format. By playing this game, gamers’ knowledge about the environment e.g., mammals, fish, insects, plants and trees can also by enhanced. It is exciting that the developers involve VR in this game. Moreover, the proposers offered the Nordic wild camp, helping gamers to gain profound insights about the connection between the knowledge gained from the game, the NFTs they earn, and the real-world nature.\nThe proposer stated the right major risk: it is difficult to connect the real-world protection of nature (water) through a non-profit gamification. However, the proposers did not clearly show the solution to the risks. \nIf this project is successful, the new users to Cardano ecosystem will be increased; thus, this solution is aligned with the challenge.\"", "q0r": 4, "q1": "\"The timeline and task processes were in-detail and well addressed. The budget breakdown was also detailed, ranging from coding, gameplay designing, webpage developing, marketing, legal, etc. Moreover, the proposers allocated the budget breakdown in accordance with the timeline, which was good. \nIn terms of the human resources, the core team included members having backgrounds related to the task processes needed to be done. I have further recommendations that the proposers should allocate the human resources into the task processes, and it would be better if the team members introduced more clearly about their work experiences, educations, etc. \n\"", "q1r": 3, "q2": "\"The proposers stated quite clearly about their success scenarios by dividing the success by short-term success, mid-term success, and long-term success. Since the project is related to sustainable development, the SDG Rating was used. \nHowever, apart from SDG Rating, I did not see any other metrics related to the game development. I would like to recommend some metrics such as the number of gamers, the number of NFTs earned, gamers’ feedbacks about their game satisfactions or their understanding related to nature. Then the proposers should state the exact desired KPIs/metrics in a timescale. For example, after launching the game by one month, there will be 1000 gamers joining the game.\"", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14911, "q0": "Firstly, the proposal raised an urgent issue in modern society - particularly the role of clean water and generally the threat of ecological and environmental diversity. From there, a well-aligned challenge settings solution combining two categories: environment and gaming was proposed to create positive values globally (protect the wildlife biome and create awareness on earth). I suppose it is a new strategy based on the \"knowledge is caring\" philosophy that targets those interested in protecting the environment (such as pure resources and wildlife) in the blockchain platform with a direct impact on the roots of the problem. Through cool gameplay and story, players will be able to “protect nature together in a flow on the blockchain” by “having their piece of the wild on an NFT” which allows them to grow and collectively create enlightenment on earth while making a profit for themselves. In addition, the proposal promises to create software real-timing to manage the water measuring sources data on the blockchain and organize a Nordic wild camp for individuals to have a more intuitive view of nature. However, to emphasize the importance of the proposal, it would be better if the team provided some more data and cases to describe the current state of the environment. Regarding the challenge settings, the proposal should analyze the suitability of the Cardano ecosystem (ex: available facilities) for their plan's prospects explaining the execution right now and offering suggestions to improve and enrich our community. Moreover, although the proposal has identified the potential target audiences, it had better have a clearer view of their natures (ex: mindset in protecting environment solutions, platforms usually approach) to have an effective marketing and propaganda strategy. Furthermore, the proposal might provide some KPIs/key metrics to express positive impacts on the Cardano ecosystem and its users (such as total number of users, amount of awareness being produced, and player income generated) to make it become more reliable for voters. In the challenges and risks section of the proposal, “connecting the real-world protection of nature with the gamification” is considered the biggest one – the actual situation of most projects in this field. Nevertheless, the proposer failed to offer a solution to the problem when they only mentioned enthusiastic people believing in binding tech to nature for a better world in a general way but still did not clarify what and how to actualize that global goal.", "q0r": 3, "q1": "The provided timeline is realistic and detailed from Q3 2022-Q2 2023 separated into quarters and targets with quantifiable numbers broken down into step-by-step categories. In each milestone, several prototypes were realesed to study user reactions and prepare for subsequent developments. I highly appreciate the proposal in terms of ​​providing a budget breakdown specifically and well-aligned to milestones in the detailed plan. The amount spent on the HR section is listed transparently by week. Though, I wonder if those employees are part-time or full-time, how many hours per week they do, and how to ensure the finished product. Moreover, in some sections as marketing and legal, it would be better if the proposer could provide a more detailed plan of activities (qualities and skills of ideal employee, number of people to hire) to match the stated cost. Their HR team currently consists of four members (one game creator and three software engineers) who have been working on the Cardano ecosystem for a while, so have a better understanding of the ecosystem to establish projects in the blockchain field. However, they should provide more detailed profiles such as educational background, experience, and skills suitable to the job position of existing personnel to increase voters' confidence in the proposal. ", "q1r": 4, "q2": "Their success was separated into three milestones (short, mid-term, and long-term) for 3-24 months and predicted some goals based on a well-aligned theory with detailed plans. Though, I notice the proposal is still too focused on the timeline without specific quantitative numbers to evaluate its development (number of users, traffic, and income of both team and players) and a means for the community to monitor the project after being funded. The goal criteria logical mark a fundamental progress at each milestone as releasing a part/prototype of the project (ex: VR Integration in the OMIMIMO game in Q3 2023) but should still have specific KPIs so that the community could accurately gauge its success without difficulty.", "q2r": 4, "assessor": "z_assessor_4110", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14959, "q0": "This is an innovative idea that, to some extent, solves 2 of the most concerning problems globally: environmental pollution and vulnerable animal species. The author clearly stated the solution to such troubles is to create a gaming environment where players learn more about nature as well as how to protect it through attractive gameplay. By applying Blockchain technology, they may be able to keep track with realtime status of the nature being reserved. Moreover, a Nordic wild camp is also arranged for physical trips, which is a very creative point to help people observe the results of the game in real life. Nowadays, the play-to-earn mechanism based on NFT is gradually becoming more popular than ever in this era. That mechanism is also applied well into this project and makes it aligned with the challenge. The team pointed out a very detailed idea, which is building a NFT-based survival 3D game, combined with hidden mystery boxes as well as an interesting ranking system. This is a strength to take advantage of in order to attract new users to the Cardano ecosystem as well as compete with already existing NFT games. Moreover, the most featured point is that every token collected by players will be used to fuel the nature reserving system and develop the future growth of the game. They believe that this will train cognitive capabilities about nature in all humans. Finally, they mentioned the challenge of making the game as realistic as possible so that gamers do not consider it as a simple NFT game but a responsibility to protect the environment. However, I do not consider this as a risk that would prevent them from delivering the project successfully, but an ambition to make the game incredibly attractive. I suggest the team reconsider their practical weaknesses in order to make the proposal fully prepared and minimize the risks.", "q0r": 4, "q1": "The targeted potential users for this project are gamers. Not only does this bring them the experience of gaming but also help them realize how important nature is and bring them closer to nature through camping sites. The roadmap and milestones are clearly explained. I believe that the team prepared the plan carefully before the proposal was made. Launching the game in November, 2022 is a reckless idea since they do not have much time to prepare. However, I believe that the team members are enthusiastic about the project and it will be feasible. The budget breakdown is quite detailed. The amount of money and time needed to complete each section is clearly stated. However, I am still confused about the total amount of money requested from the line “TOTAL REQUEST FROM Q3 2022 to -Q1 2023: $19000”, since the sum of requested funds is supposed to be around $43000 (as I calculated). This should be a point that needs to be reviewed and clarified. The team members listed for this project are reasonable for their professions. However, in my opinion, adding some further backgrounds such as achievements and education would be helpful for a more objective point of view.", "q1r": 4, "q2": "Success measurements are clearly divided into 3 sections: short-term, mid-term and long-term. Key metrics are clearly stated and the plan for future launches are well-arranged. The authors stated that they have been full-time investing their own money and time into the project, which proves their dedication and confidence. However, they are still missing some specific numbers for key performance indicators. I suggest adding some estimations such as the number of players achieved or the number of tokens claimed by players in the first month of launch would draw a better imagination. In addition, some management tools may be needed so that both the investors and the project managers can keep track of the progress easily.", "q2r": 4, "assessor": "z_assessor_4118", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Developing a future store of value by protecting pure water and rare species.\nCreating knowledge of nature.\nThrough gaming our goal is to increase and train cognitive capacities in all humans.", "experience": "+20 years as a Social Philosopher/ Futurist/ScentDeveloper/Entrepreneur.\n+10 years App development. AppScent\n+15 years Author of \"31 Ways to be Free\" and \"Anthill Warriors\", upcoming futurist book.\n+2 years as a Cardano Enthusiast/ Blockchain studies and research."}