{"id": 414289, "author": "decentralizemusic", "title": "DecentralizeMusic.com", "url": "https://cardano.ideascale.com/a/dtd/414289-48088", "category": 26595, "amount": 110000, "description": "There is no solution for addressing all aspects of music commerce. From royalties & live streaming to minting music NFTs on the Cardano blockchain. Artists also need a guide into web3 adoption.", "f6_no_assessments": 20, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"id": 1605, "q0": "The idea of ​​the proposal is very good, and theoretically it aligns very well with the objectives of the challenge, because it will create a platform aimed at the music industry, in which artists would have more control over their art, and would also increase the contact between them and their fans, through various technologies pertinent to blockchain. This would achieve the specific objectives of the challenge in terms of adding new active members to the community, increasing the number of active digital wallets, circulating Ada and CNFTs, etc. However, I have some observations to make. I have no doubts about the impact and revolution that this project could create, as artists would create profiles, sell goods, music, NFTs, etc., keeping control of most transactions (which would be smart contracts). From what I understand, it would also be possible to perform some virtual shows, which already happen from the project presented on the jazzisdead website. The great idea here, in my opinion, would be to reduce bureaucracy and the profits that recorded companies have with the commercialization of content generated in the music industry; once these become active tokens, they can be handled much more easily by both artists and fans/end users. However, a big challenge that I believe needs to be taken into account would be: how would fans and artists get to know about Cardano's development tools, needed to run the functionality? This obstacle is mentioned directly by the proponents as well, that is, it is positive as they are aware of this possible difficulty to be faced during the practical development of the project. I would like this question to be more widely debated and thought about. Would there be some kind of practical manual on the website itself, instructions? How will people who have no contact with the cryptographic universe safely use and handle the tools and functionalities mentioned here? If this problem is resolved and circumvented properly, I believe that this proposal has a lot of potential and could bring great gains to the Cardano ecosystem, since it is dealing with a giant industry that moves a lot of money, involves many people. However, the barrier of technical knowledge must be broken, people must be educated in a clear and assertive way, we know that blockchain technology is increasingly popular and widespread, but not all people have such knowledge, and music is universal, so it's important that we make this platform accessible to all audiences. Therefore, I will give it 4 stars, if this problem is solved I believe the impact will be maximum.", "q0r": 4, "q1": "The proposal script is very specific in the sense of telling us what needs to be done and in what order, however, the temporal notion is a little confusing. As I understand it, everything said is pertinent to phase 2, but how long, in months, for example, would this phase last? And these little activities, how long would each last? Which professionals would work in them, and what would their work routines be like? Only if we can have a good understanding of the process, mainly because the proponents also provide us with observations, this could be even better if a time division was more specific and also if the explanation of each activity itself was more detailed. Unfortunately, when it comes to budgeting, the total asking amount of 100k is split quite broadly, meaning we know that 30k would go to project management and 15k to marketing for example. But what would the project manager's activities be, how many hours per month would he work on this project? We do not, therefore, know what the value of your working hour is, thus making it more difficult to understand whether the amount requested is fair and compatible with current market values. When it comes to marketing, I would like the publicity campaign to be better explained. I believe that advertising is a crucial part of the success of this project, as the intention here is to bring those involved with an already well-established industry to blockchain technologies. So how can we be sure that the maximum number of people would be reached, coerced into adopting this platform? How could artists and fans understand the advantages of the project, in relation to what is already traditional in the music industry? That is, if the marketing campaign were better explained, we would understand how this crucial part for the project would develop and also if the asking value makes sense. Finally, analyzing the team, unfortunately this part leaves a lot to be desired since we don't know much information about each of those involved. We are only told their names and professional roles, but we don't know their resumes, we don't have their linkedin profiles, we don't know how they relate to the Cardano ecosystem. If such information were passed on, certainly our security in relation to the team's preparation for the project would benefit. With that, I think that all 3 main parts of feasibility provide us with information that is useful, but lacks detail to understand if the proposal is safely viable. So I'll give it 4 stars because I believe the information given is valid, but it can be better detailed.", "q1r": 4, "q2": "Talking about how this project could be monitored, I think we can divide the analysis into two main parts: the monitoring of the process, that is, the unfolding of the phases, and also the measurement of success. Talking first about the last part, the measurement of success, the proponents tell us what the desired scenario would be in general - that a new wave of users would be attracted to Cardano, through the platform that offers various services related to the music business. We also know of more specific factors that could prove whether this happened, such as: the creation of the 3 types of profile on the platform (artist, record label or fan), the interactions between them, subscription to offers, participation in live broadcasts, creation and commercialization of CNFTs and so on. In other words, we have many palpable ways of understanding whether the project got where it wanted to go. However, I think it would also be important to think about two more things when it comes to this. First, I would like a qualitative analysis of the project to be done as well, in addition to quantitative data. That is, to understand the satisfaction of different types of users towards this project, as well as whether they have become active members of the Cardano community in other ways, for example, getting involved in other types of projects, in games, delegating Ada, minting active tokens that are not necessarily involved in the music field, etc. It would be very interesting for the proponents to carry out this general study and bring this information to the Cardano community in a summarized way, which could be done through, for example, a written report and disseminated through the communication channels of our community. Or, also, there could be a page on the website specially dedicated to understanding the impact of all this for Cardano, a place where the users themselves could express themselves, for example. Now, focusing on monitoring the process: it is super important for us to understand how the activities are being developed, how the phases are unfolding, etc., and not just what was generated from them. Proponents claim that the project will be managed with some tools like JIRA, slack and github commits. Besides github, I'm not familiar with the other tools, so for me it would be important to clarify how they work and the feedback they could give to our community, in relation to being always updated with the progress of this project. Thus, I agree that it is a proposal for a possible audit, but some points can still be improved.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 4245, "q0": "DecentralizeMusic.com is a live streaming music platform that aims to become a viable alternative to current centralized providers like Spotify, allowing artists to create profiles, sell their products, music and NFT using the Cardano blockchain, this should bring fans closer and artists and allow them to continue to receive royalties on their musical productions in the future and forever. All this should lead a large number of users to approach Cardano. Bringing even 0.1% of the quarterly subscribers of a company like Spotify would mean chaining 180,000 users to Cardano. Not to mention that spotify is not the only leading company in the sector.\n(https://www.businessofapps.com/data/spotify-statistics/)\nConsequently, I believe that this proposal meets the objectives set by the Dapps, Products & Integrations challenge, however similar solutions are already being developed on the Cardano blockchain and another project has been financed in the fund8, I suggest to the proposer to evaluate possible collaborations:\n- https://cardano.ideascale.com/c/idea/396558", "q0r": 5, "q1": "The proponent reports that the live streaming, music streaming / physical merchandise and social aspects components are already completed and defines precisely how the CNFT market will be implemented during phase 2 but there is no defined time horizon. Unfortunately I have tried several times to register on the platform but without success and since there are no channels to ask or a support service I had to give up, I suggest the team to work on this aspect. As for the social components; Twitter and instagram are practically empty while the youtube channel seems quite active even if with a low number of subscribers.\nThe project launch has reportedly been aligned with over 30 events and tours organized by Jazzisdead.co (see current events jazzisdead.co/EVENTS).\nI was able to find the following team members online (Links and references of past experiences were missing in the proposal, I suggest adding them):\n-Marcus Gray (https://www.linkedin.com/in/marcus-gray-90a59947/) who demonstrates years of experience in Project menaging and system engineering\n-Andrew Lojero (https://www.linkedin.com/in/andrew-lojero-17462432/) Event Producer / Artist Management / Record Label Co-owner\nHowever, I was unable to identify the other team members and unfortunately the team reports that being an overseas team, they have no reference links or links on the pages\nAbhi - Head of the development project\nDevendra - Python developer\nFizanul - Frontend Developer / React\nAgain I suggest adding references / evidence / links to past experiences.\n \nThe proposal shows a royalty cost of $ 0.01 per stream. However, the team is aware of the lack of knowledge of the Cardano development tools needed to execute the features, so there is no evidence of the sustainability of such a royalty cost paid to artists.\nAccording to data reported by GlobalWebIndex (https://www.gwi.com/reports/music-streaming-around-the-world), the average North American user listens to an average of 140 minutes of music per day.\nTaking into account an average of 3 minutes per song we are talking about 47 songs per day for a value of 47 * 0.01 $ = 0.47 $ (per day to be paid as Royalties), per month the calculation becomes 0.47 $ * 30 = 14.1 $.\nThis is therefore a higher cost than that incurred for a monthly subscription on Spotify (9.99 $).\nFurthermore, microtransitions are not currently available on cardan, so a solution is needed on this front as well to avoid further raising costs for the consumer and lowering earnings for the artist. You could consider an idea such as grouping transitions until a threshold agreed with the rights holder is reached, once this is reached the payment will be sent.\nAt the same time, it should be borne in mind that Spotyifi pays an average of $ 0.003 per stream to the artist, so there is a good margin for maneuver.\n(https://magicviral.com/marketing-news/194-come-guadagnare-con-itunes-and-altri-servizi-di-streaming-musicale.html#strongguadagnareconlamusicasuitunesstrong)\n \nI suggest the team to hire experienced staff in the Cardano development tools necessary for the implementation of the features in order to define more precise and sustainable costs.\nThe required budget is divided into identifiable items, however it lacks specificity in defining the number of hours of work and the hourly cost required for front-end and backed development, I also suggest adding evidence / estimate of the legal cost ($ 35,000)\nAccording to what has been reported, it is likely that the proposal will need additional funds to be carried out, however there is no defined plan in this regard.\nIt is possible the proposal can be implemented, counting a beta and a record label to support it, however a more precise plan of timing and technical aspects is needed, moreover the music sector is a very competitive sector in which it could be useful to forge collaborations with other houses. record companies, I suggest to the team to consider also in this sense", "q1r": 2, "q2": "The roadmap, currently in phase 2, includes identifiable milestones but lacks defined timelines. The team plans to use project management tools such as JIRA, slack and github is committed to tracking progress and milestones, but there is no link at the moment.\nAccording to when written in the proposal Successor looks like adoption and operations however are kpi metrics defined to measure it. An example could be:\nnumber of artists registered on the platform\nnumber of monthly unique listeners registered on the platform\nnumber of average daily / weekly / monthly reproductions per user\ntotal value of the transitions made on the platform", "q2r": 4, "assessor": "z_assessor_2531", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 8299, "q0": "From the initial introduction of the proposal, I can assume that this project would address the requirements of this Challenge by creating an adoption of music artists who wish to make a groundbreaking step up in their career and music lovers in search for a fresh array of new faces in the industry. Having a music streaming platform for product distribution and monetization is not an uncommon idea nowadays, as there are such big names currently dominating the market, for instance, Apple Music, Spotify, Deezer, Tidal or Soundcloud, etc. However, integrating NFTs and a blockchain into the platform, I believe, has yet to be mainstream and well-received. Therefore, DM could become a fresh change of pace for the wide variety of users out there, especially those interested in cryptocurrency and blockchains. And not only will DM be a marketplace for NFT-based sales and purchase between parties, but it will also be somewhat a social media platform as well, boasting social elements to create a community where artists and producers can interact with their followers, and followers can express their support and admiration by purchasing their favorite works. \nI’m excited to see that DM will welcome all kinds of art creators, from independent artists to even firms and labels, all of which seem to be suitable target audiences. And for those who have just discovered their newfound interest in NFTs and the Cardano blockchain, the team has also hosted events and tours where there will be demonstrations of the project and Cardano itself, and created a series of educational Youtube videos introducing Cardano for new audiences. A very thoughtful move in my opinion. And the fact that the team’s previous CNFT project Jazz Is Dead and the proposal for this project have recently been featured on Cardano Ecosystem News is a promising sign of things to come, at the same time further spreading DM to potential users. \nI’m delighted to know that DM has reached a 70% rate of completion before this proposal to Catalyst, meaning all the fundamental elements have been made readily up and running with the team’s very own budget and only the implementation of CNFT and blockchain features is needed. Personally, I would prefer that the team had included that 70% development process and what took place at each stage, since that would better demonstrate the features DM has and offer more clarity as well. \nConsidering that the team has finished 70% of the project on their own, getting the funding for the remaining 30%, which is to integrate the blockchain-based functionalities into the platform, is undoubtedly a main concern for the proposers. Though I am not the one with the final verdict, I’m confident that the team should be able to seal this funding.\nHowever, as for the other challenges of lacking the knowledge of Cardano and its development tools to perfectly execute said functionalities and not possessing a strong enough server to host various artists at the same time, the team has not offered up any viable resolutions. I suggest that the proposers should quickly include those solutions, since these brought up challenges seem quite critical to the foundation of the final product.", "q0r": 3, "q1": "As mentioned above, 70% of the project has been completed, so It’s natural that the completed features be experimented in the BETA test. \nFor the roadmap to deliver the CNFT marketplace implementation, the proposal has managed to enumerate all the elements of its marketplace website, each page comes with respective functions and errands, though not too detailed. Personally, I would love to see a timeline for this phase to determine how long it would take from start to finish and when a serviceable MVP could be released to the public.  \nFor the requested budget, It will be divided amongst 4 different sectors of the project and also one portion will be assigned to the payment of the blockchain dev team. I think that this section could use a bit more information regarding what would take shape in each sector and how much it would cost for each installment to better clarify the requested funding.\n\nAs for the participating members of the project, though the proposal does give me the names and respective positions, there’s still a lot to be desired for this section, as I believe that the community would love to know more about the relevance of the team, for example, applicable expertise, educational backgrounds and past experiences. It would be even more convenient to verify them if there were some sorts of visual evidence or dedicated profiles. Another noticeable detail is that apparently there is no individual whose specialty is Cardano and its development tools, as specified in the Impact section that the team still lacks, however, the team has not made any announcements about the recruitment of such a crucial position.", "q1r": 2, "q2": "As far as auditability is concerned, I believe that by using project tracking tools like JIRA, Github and Slack to keep tabs on progress and milestones, there is some level of clarity achieved here. Nonetheless, I would love to see some more information on the utilization of said tracking tools, for example, will the data be accessible for internal involved parties only or will they also be available for the outside community to have a look at as well? Or perhaps how long periodically will they post the progress, updates or changes of the project?\nThe envisioned success of the project for the team includes the adoption of artists and music lovers to Cardano and multiple transactions being made on a fully functional music streaming platform where users can not only enjoy music but also interact with one another. This is undoubtedly what the proposers set out to achieve, which aligns well with the required scope of success of this Challenge. Yet, once again, It would be beneficial for the team to include key metrics for measurement and estimated figures of adoption and transactions to describe a possible scenario of desirable outcome, further solidifying the proposal.", "q2r": 2, "assessor": "z_assessor_2974", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1192, "q0": "This is a proposal to develop a website/app live streaming platform to minting music NFTs on the Cardano blockchain. Live streaming is now a popular form with a large transaction volume in all online commerce items. Live stream programs also easily attract a large number of communities. Therefore, I believe this project, if implemented, will attract more people to cardano, especially new artists and users who were previously less interested in the blockchain field.\nLive streaming of art products also helps to better verify product identity, ensuring real goods reach buyers. Therefore, this project is in line with the direction that this challenge offers.", "q0r": 5, "q1": "The project will implement the plan into two phases (BETA of website and CNFT implementation). They have detailed each task and the order of implementation, so this plan is clear enough for us to track progress. However, they need to attach a timeline for each working period by week/month, which is better.\nRegarding the proposed budget, I agree with basically the expenses they applied for. However, they need more detailed activities on project management, marketing... to see specifically who is in charge, what is the job, and how much time is needed for it. That will be enough to convince the community to vote for your project.\nAbout the personal profiles of the members here it is really unclear because you have only mentioned the names and roles of 5 people without the link to each person's profile and photos as well as their work experience. This is a pretty big weakness.", "q1r": 3, "q2": "Because the work plan above they do not have a deadline for each work phase, it is quite difficult to track the project progress. I hope they will add this information in more detail. They will report this progress through github, JIKA - I believe these tools are enough to see project transparency about project progress. However, they need to specify the parameters to report to the community. For example, the number of website visits, the number of purchase and sale transactions on the website, the number of published and purchased works...\nFinally, since this is a project related to works of art, they need to have a communication plan for users and artists. I hope they can refer to previous successful projects for better proposals, as this concept project is very encouraging.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11972, "q0": "The idea in the proposal is a community focused on music and the people who directly support it. DM is a Dapp to expand business for independent artists, visual artists, gallery owners, etc. Artists can sell music for streaming and get 0.01% of streaming royalties. Artists can also use NFTS music to create smart contracts for their businesses. The impact of DM is not only to adopt and educate music activists in the Cardano ecosystem but also to serve as a one-stop resource hub for artists interested in getting involved in solutions Web3 on Cardano. I completely agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal team is concerned with providing a short description of each member, and then we know their names and their roles. Despite that, it would be even better if they provided a social networking page for each member (e.g., Linkedin) because we can see each member's past experiences and connections. The proposal group described a detailed step-by-step roadmap. The live streaming, music streaming/physical merchandise components, and social aspects are completed. The next step is to implement the CNFT marketplace and blockchain-dependent features. However, the proposal team could improve feasibility by adding specific timelines for the work, for example designing all the necessary pages for the website within the first month after funding.\nRegarding budget, I've found 110,000$ value fair for what the project purports. This value is divided into a few topics, which gives a good understanding of how to use it. However, I believe there could be more details. Example: Marketing and Project Management - $25,000. How to determine precisely how much money will be needed? Although, I believe the team gives us an overview of the budget and process, even if the details are lacking. \n", "q1r": 4, "q2": "The problem of bringing DM to market and reaching potential users is not simple. This process takes a lot of time, effort, and money. Besides, technical limitations are also a risk when there are many concurrent users. The proposal team has carefully analyzed these risks. Therefore, I also understand that success metrics during this period are difficult to quantify. We can only track progress and milestones through project management tools like JIRA, Slack, and Github. But in general, I think this topic is well covered.", "q2r": 4, "assessor": "z_assessor_3321", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10360, "q0": "The proposal suggests solutions for music commerce. The team will build a platform on Cardano (called DecentralizeMusic.com) which brings benefits for artists. DecentralizeMusic.com (DM) is a platform which allows artists to create their profiles, sell their music products and NFTs. Furthermore, DM can also help independent artists, indie labels, concert promoters, gallery owners, visual artists expand on their business on Cardano. All of them will receive their royalties on assets which are sold. DM will also be a place where artists can receive a consulting service for their future plan. I think this proposal is worthy of receiving the encouragement and attention of the community.", "q0r": 5, "q1": "There are 5 people in their team. They have experience about art, technology but they lack of members having experience about Nft or tools for developing on Cardano. So, they need to recruit more human resources in these fields. They should also provide LinkedIn of their team members. They have transparent road map with what they are going to do. They also recommend a budget $110,000 for their development however I suggest they should detail each spending range in each stage of the road map. In general, they have a very detailed road map. Their first phase is in Beta and they are testing it now. The team has completed 70 %  of their plan. We can check their progress on the website: jazzisdead.co. That's the encouraging point of their project. Now, they are needing funds for continuing their plan and I think that this proposal is a potential project.", "q1r": 4, "q2": "They just mention using project management tools such as JIRA or Github for the community to track their progress. But, it’s very hazy and genral. I don’t  find out their detailed KPIs for measuring the effectiveness of their project. They don’t also have  milestones for auditing the progress. ", "q2r": 3, "assessor": "z_assessor_3183", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10007, "q0": "The purpose of the proposal to create the Wedsite platform uses Cardano to implement the commercialization of musical products (jazz). The proposal attracts artists, making their works widely known to the public. Others can also purchase works and own NFT-related songs. The proposal is in line with the stated challenge setting, creating a network of music lovers. The manner in which cardano's proposed real impact is unclear, Wedsite seems to be aiming for commerciality to be the main, at live-streaming events cardano may be introduced, but how to do this has not yet been stated. The challenge of creating a valuable Dapp depends on the impact on the user, the goal of the proposal is directed at musicians and audiences but has not yet shown a real impact on these audiences. We can see the proposal that facilitates musicians bringing works to the public and making money from them. To be willing to pay for a song, the streaming session is a difficult thing for users, they have an easy choice from the completely free Wedsites. The risk that the proposal encounters is that the author's market competitiveness needs to have appropriate solutions for this.\nRating: 3\n", "q0r": 3, "q1": "The implementation plan of the proposal is mainly to build the Wedsite platform, the construction of UX/UI and the creation of NFTs. The proposal describes the functions on wedsite built up. We look forward to seeing the content and how the proposal works to create a community of users. What are 70% of applications made? How to maketing to attract users is also an important factor in the success of the proposal. With so little information about the members implementing the proposal, we need specific information that demonstrates their competence, experience and ability to complete the plan. Assigning work to each member corresponding to the ability is essential for the proposal. The proposed amount of $110,000, the budget analysis of the proposal does not show all the spending in the implementation of the plan, the expenditures are still general.\nRating: 2\n", "q1r": 2, "q2": "Using project management tools like JIRA, slack as well as github commits to track progress is what the proposal is not really convincing to test. Metrics/KPIs need to be more clearly defined e.g. Number of registered artists present on the platform, number of attractable users, expected CNFT. Proposal test outlines have a lot of trouble with doing the work not really clear. The success of the proposal only shows the work being ready to do the deals, not to mention what has been created, how many tracks have been announced, are the live streams done? The proposal offers quite adequate competitive solutions but does not show success in the commercialization of the market. We did not define the success of the proposal, too many elements of the success factor were missing. Rating: 2", "q2r": 2, "assessor": "z_assessor_3144", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9477, "q0": "For generally explaining problems in the music industry, pointing out how this platform creates a new way to interact with an artists community, and adoption potential, I end up ranking this section a 3. First, I would reframe the identified risk of “not getting enough funding to take it to market.” This might make voters think that this project built 70% of the platform without proper preplanning to ensure it reaches completion and is now in need of a bailout, which is not a good start to an investment. I also feel like I am missing a sense of magnitude that is brought by market research, following reports, and disclosure of reputable partnerships. The size of the impacts section is measured by how many people a project could reach, whether that be artists, listeners, social media followers, and/or talent agents. So as far as the impression that I get for the impact/cost ratio, I am neutral on whether or not I think that it is worth the $110k request. ", "q0r": 3, "q1": "For lack of detail on core team member’s experience, elaboration needed on budget, and inefficient use of roadmap space, I rank this section a 2. Voters will want relevant information easily accessible and this proposal does not give anything for the core development team other than their name and role with this project. If the purpose of this section is to evaluate the chances of this proposal feasibly seeing success, it is essential that the voters know what the experience and capabilities of the team to carry it out. On the roadmap, there is a lot of wasted space here (in part, because of the double spacing of every line). The substance provided in this section for is a little less relevant for what the voters need. This roadmap provides every aspect and detail of what needs to be built on the platform but we really just need a timeline for how long each section needs to be built. This roadmap needs more information on timeframes and hours of labor required as well. The budget is the least of this sections problems but it is still an issue that it doesn’t thoroughly breakdown how each category is being spent. While it only allocates amounts to different categories, voters will need to see hourly rates and how many hours of labor is allocated to each category so that voters can determine if the funds are being spent efficiently. Overall, this section has some easy fixes and it does have to do some restructuring on the roadmap to better inform voters. ", "q1r": 2, "q2": "Due to lack of objective target metrics, I rank this proposal a 1. This auditibility section generally talks about where they track progress and what defines success for them but they do not disclose what objective metrics they want to be seeing in these areas. It seems like the only measure of success here is the completion of the application in its planned capabilities. There is room to add more KPIs like social media engagement, Github engagement, user base, created artist profiles, website traffic, and whatever other creative metrics that might provide voters with a sense of confidence that the project has objective goals. I give bonus points for proposals that give these metrics in a timeframe format that show milestones at each point. I think these changes will provide massive improvements in the eyes of voters. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9451, "q0": "The idea is oriented directly to one of the four strategic goals of Catalyst Fund9, namely - Build real-world solutions based on the Cardano blockchain. The idea is impactful as it allows the artist and/or label to retain the majority share of all transactions, bringing all aspects of musical commerce to one platform.\n\nThe ambition of the team is to introduce many music creators and music lovers to the Cardano community through DecentralizeMusic.\n\nIntegration of live streaming, NFT music marketplace, selling physical, digital and streamed music is a way to establish strong connection between music market and blockchain technology.\n \nThe team has already completed a large amount of preparatory work – application, live streaming, music streaming/physical merchandise components and social aspects of the platform.", "q0r": 4, "q1": "The activity plan provided is very detailed. However, this does not make it sufficient to visualize all the activities intended to lead to the successful implementation of the project.\nThe described plan is aimed only at the tasks related to creating the platform (the website with its functionality). It is not clear to me if and how the team will ensure the functioning of the platform - campaigns to promote and attract musicians and bands, advertize the functionality and benefits of using the platform, etc.\n \nThe project budget is described too generally divided into only large categories. There is no clarity about the calculation of costs and the specific activities included in them. What will be paid in the Legal section, worth $35,000? What activities, how many people and for how long are behind Marketing and Project management? How the FrontEnd development for Marketplace and BackEnd development for Marketplace pay rates are calculated.\n \nThe presentations of the team members are in a single line each, which does not allow to evaluate their capacity, expertise and experience for the implementation of the project. Links to members' detailed CVs or portfolios would add credibility to the project proposal.\n", "q1r": 2, "q2": "There are no measurable KPIs and milestones defined in this proposal. The team promises to utilize project management tools such as JIRA, slack and github. But do not give an explanation how they will be used to track the progress of the project.\n", "q2r": 1, "assessor": "z_assessor_3061", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8567, "q0": "According to the proposal's author, there is no solution that addresses all aspects of music commerce. The necessity for an artist's guide to web3 adoption is also included in the problem description. And, yeah, the hypothesis is correct. The team gets their first point for presenting the problem statement in a way that is both simple to comprehend and relevant to the challenge. The solution is also obvious: create adoption and community around music via live streaming, digital music sales/streaming, physical merchandise sales & a CNFT marketplace. In detail, the proposers will introduce the community to DecentralizeMusic.com (DM), which is a live streaming platform that also allows artists to create profiles, sell their merchandise, music and NFTs. I like the overall idea and wish the team the best of luck. The authors of this also foresee some obstacles implementing the project but the possible actions to address them seem not sufficient to me. Furthermore, it would be interesting to clarify the objectives for each statistic in order to quantify the impact. This proposal would gain greater support from voters if the proposers could provide additional detail on what I just said.", "q0r": 3, "q1": "Unfortunately, the proposal fails to include not just a description of the team's talents and experience, but also a reference to back them up. The author of this proposal might consider giving the community a description of the individuals' talents and expertise, as well as links to further LinkEd, YouTube channels, or Twitter accounts to define who they are. According to my understanding, the project is 70% complete, and the team is looking for support for phase 2. Given the plan provided, it is unclear whether the proposal will be successful. Despite the fact that there is a description of the implementation plan, which allows readers to comprehend the tasks required. Unfortunately, the team did a poor job of giving a timeline and milestones for each stage of the project, and there was no mention of a deadline for the solution, making it difficult to determine whether it could be completed in a certain amount of time. I would have preferred it if the team had offered an overview of what may have been accomplished in three, six, or twelve months (for example). The team requests a total of $110,000 in funding. The budget is divided into five components, the majority of which will be allocated to the legal field. In order to fully understand the budget allocation, I feel that more specifics in a budget breakdown would be desirable. In other words, the proposers could consider breaking each element into more identifiable items. I mean, for instance, $25.000 for marketing still leaves room for imagination. Its cost is quite higher than that of other proposals in the field of Marketing. Additionally, I advise the team to detail the development expense, such as how many working hours will be divided among how many employed individuals, etc.", "q1r": 2, "q2": "In terms of auditability, the team promises to track progress and milestones using project management tools such as JIRA, Slack, and github commits. It would be preferable to establish a platform or channel of communication between the team and the auditors. To quantify auditability in a structured and systematic manner, I would advise that the proposer provide considerably extra detail about the project's development and process. It would be really advantageous if we could see a clear path with milestones and an expected timeframe. I would also recommend incorporating some success measures in order to track progress. For example, how many people are expected to join after a certain time period.", "q2r": 2, "assessor": "z_assessor_2992", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8485, "q0": "The idea of this proposal is very well articulated. The proposer has shown us clearly how their project is going to impact the Cardano ecosystem by creating adoption and community around music with live streaming, digital music sales/streaming, physical merchandise sales & a CNFT marketplace. The team has already started landing a solid foundation for their project by completing 70% of the application and beginning educating users on their Youtube channel. They want to build decentralized music, live streaming and a CNFT music marketplace that aims to allow the artist and the fan to engage in a way that may not have been possible before, this proposal is very ambitious and I can see how it’s going to bring a massive adoption to the Cardano ecosystem. With the promise of being at jazzisdead.co and aligning their launch with over 30 events and tours they are producing from now into fall 2022, I can see so much potential in this proposal. I can see how this proposal addresses the challenge as it’ll help generate a funnel for adoption and education for artists and musicians into the Cardano ecosystem and also serve as a boutique resource hub for musicians interested in engaging in Web3 solutions on Cardano. The artist and label will be able to retain an e majority share of all transactions. Bringing all aspects of musical commerce to one platform. Hence, the project will almost certainly attract so many users (musicians, producers and audiences) to our ecosystem, contribute to the development of the CNFT music market in general and benefit Cardano. Since the team has had their preparation going, the risks of the project have been pointed out quite fairly. However, they have not had an idea to solve those such problems and my concern is focused on the lack of knowledge around the Cardano development tools needed to execute functions as a solution seems to be crucial to take the project to success.", "q0r": 4, "q1": "Although the team lists out a very detailed to-do list and their idea display, I don’t find any timeline or roadmap being provided. Hence, it’s very difficult to comment on the feasibility of the project. The budget breakdown is very vague and doesn’t seem to follow the tasks closely. Since most of the budget object is explained in terms of categories like legal, and marketing, … I think it’s important to break it down into relevant required working hours. Otherwise, it’s almost impossible to justify the requested fund. Moreover, the team requested 110,000k which is higher than the challenge’s budget, hence it’s even more important to show an explanation for this exceeded amount.  Regarding the team member introduction, I’d suggest the team give us more information about their team members such as their obtained skills, working background and relevant experience so that we can see how compatible it is as well as the potential of the human resource for this project. ", "q1r": 2, "q2": "In terms of audibility, I think the community won’t have enough evidence or leadings to audit this project in the future since the team doesn’t provide any specific key metrics and KPIs. There are no short-term KPIs and no long-term goals whatsoever. There’s no clear definition of the success of this project, or how can the community can audit the project in the future. The team should build clear key metrics for this project and better with time-related KPIs, which can be regarding the number of new users joining, the number of new artists joining and posting their work, the sale of CNFT creation and so on. Overall, there is still a lot of work that needs to be done for the community to see the vision of this proposal. ", "q2r": 1, "assessor": "z_assessor_2989", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8229, "q0": "First off, there aren't many websites where users can use virtual currency to pay for services, thus I truly enjoy the concept behind this project. A lot of helpful information regarding the solution was included in the proposal. The issue was brought up so that voters would have a greater understanding of the project's importance. The proposer then outlined the benefits and features of the proposed solution. Additionally, the proposal highlights the project's innovation as compared to traditional music websites. The second part of the Impact section also does a good job of outlining how the project can fix the issue and how it will affect Cardano. The founding team identified the largest danger the project may encounter and offered solutions.", "q0r": 5, "q1": "In the 'detailed roadmap and timeline' section, the proposer has given a pretty good roadmap, the tasks that need to be completed as provided. However, the proposer has not provided a timeline for the above works, which leads to the voters may not know the project implementation time, or the project's time schedule. The 'detailed budget' section is pretty well informed when the total spending sections are given. Proposer may also reveal additional information such as projected expenditures with marketing subsections undertaken by the project. More information about members should also be provided. Instead of just providing the name and title of each person, the proposer can provide additional education, relevant work experience, etc.", "q1r": 4, "q2": "When the proposer very explicitly requests that the team specify both the technical expectations and the quantity of users, the objective for success is fairly excellent. Even if the team has changed the process to github for voters to follow and track, the proposer should still provide more KPIs/Key metrics used to evaluate the success and development of the project so that the voters may better understand the measurement criteria that the team sets.", "q2r": 3, "assessor": "z_assessor_2967", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6882, "q0": "-\tAwesome proposal submission the arts and entertainment space focussing on music and challenging business models in the music industry as we know them\n-\tThis proposal brings together Digital Rights Management, Gamification, Incentivization, Ecommerce, ticketing, and social networking features all in one platform aiming to decentralize and disrupt the music industy by bringing labels, artists, event venues together\n-\tIn doing so, it challenges the Cardano Ecosystem to provide tools needed for such innovations to materialize and also positions Cardano to compete with some recent products like Audius (https://audius.co/)  & the UtopiaMusic ecosystem (https://utopiamusic.com/)\n-\tThe business model is clearly thought out and planned, and the big challenge is more about implementing features, scaling up rapidly. This can benefit from Cardano’s roadmap for scaling up from the Basho era features (https://roadmap.cardano.org/en/basho/)\n", "q0r": 5, "q1": "-\tThe cost breakdown appears to be adequate and brings together competencies much needed at this stage ( technical, legal, customer experience design, project management and some marketing )\n-\tThe longer term, vision and mission have been clearly explained. The roadmap and immediate objectives for this proposal with respective timeframes could be clarified. The team is not starting from scratch and if 70% of the application is already done in phase 1, and the focus is on completing the platform for go to market, in a phase 2, the budget may be adequate.\n-\tSome further details on the go to market strategy could help better understand if there may be some gaps in this respect, i.e marketing and communications campaign and gearing up with an operations team, business developers & partnership managers  to develop the partnerships needed. \n-\tSetting up a business model canvas to explore an operating business model could highlight some other gaps or hypotheses that the team is making ( https://www.strategyzer.com/canvas/business-model-canvas) \nIn order to accelerate time to value, the team could consider looking at some of the references below: \nSome developments in the Ethereum space with regards to royalty standards : \n-\thttps://eips.ethereum.org/EIPS/eip-2981 - standard for royalties in Ethereum\n-\thttps://cips.cardano.org/cips/cip27/#simplesummary standard for royalties in Cardano\n-\thttps://www.openlaw.io/ - platform for legal smart contrats\nDigital rights management : \n-\thttps://www.zdnet.com/finance/blockchain/new-platform-uses-nfts-as-a-gateway-for-digital-rights-management/ \no\thttps://rair.tech/ - Blockchain based digital rights management platform\nCardano ecosystem integrations that may be of interest : \n-\tProfila for CRM from Cardano ecosystem\n-\thttps://www.clanity.com/#Platform  for social marketplace from Cardano ecosystem including business to business and business to customer features.\n-\tIntegration with lending protocols to faciliate liquidity for those purchasing rights to create content from artists or for manufacture of merchandise\no\thttps://www.meld.com/ from Cardano ecosystem\nThere are also some similar proposals in Fund9, so probably setting up a Cardano community focussing on the music industry, eg a Guild or even a consortium going forward could benefit everyone : \n-\tLicensing Remixed Music On-Chain, https://cardano.ideascale.com/c/idea/421968\n-\tProject Catalyst... for Musicians , https://cardano.ideascale.com/c/idea/414440\n-\tCardano Music Marketplace, https://cardano.ideascale.com/c/idea/416274\n-\tFML : P2P sync licensing protocol , https://cardano.ideascale.com/c/idea/418686\n-\tCardano For Musicians , https://cardano.ideascale.com/c/idea/419013\n-\tPerma-music rmNFT Marketplace, https://cardano.ideascale.com/c/idea/415152\n", "q1r": 4, "q2": "-\tThe team is clear on customer acquisition and adoption being the key outcomes they are after. As there is a go to market phase, having some indicators for feedback collection eg : number of users using it, number of interviews, ( groups, individuals) , feature requests using a user-voice mechanism , could be useful to gauge how well the product is being received and the potential for growing it into a mature product.\n-\tAs this is an arts & entertainment space with active players the product needs to be solid and stable in order to develop the acquisition level it clearly deserves. Poor user experience could probably adversely affect growth, so some caution may be needed there. The team is rather experienced, so I would assume this is taken care of.\n-\tNonetheless, some operational KPIs may be handy as the user-base scales, eg, some performance related metrics like number of crashes of application, outages, support requests and resolution rates. This could inform the sizing of the operations team needed as the application scales, and  I sincerely hope it will\n", "q2r": 4, "assessor": "z_assessor_2845", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 5982, "q0": "Music brings millions (or even billions) of people together and Is a great way to expand the Cardano project. The fact that they already work with many artists, for example, the American composer Adrian Young makes it clear you already have support from artists to get involved in the project.  \nThe fact that the platform in the proposal will combine the offering of music, merchandise and ticket sales, etc., is a significant advantage against other big players like Spotify. Furthermore, the implementation of NFTs is kept simple and is aimed at the broader audience by using three tears when buying albums, NFTs for ticket sales and NFTs for lottery tickets.\nThe project actively educates people on Cardano on their website decentralizemusic.com. The information is aimed at the platform users and is clear and brief. I’m optimistic about this information because this gives me the sense they acknowledge the importance of education when working with new technology for the average user this platform is aimed at. ", "q0r": 4, "q1": "The 0,01 cent per stream for the artist on the live streaming platform is feasible for the artist and is more than the average pay-out on the Spotify platform. However, I’m also of the opinion that music professionals want more control over their business. \nThe project team is listed, but I would advise including an easy way to get to the CVs of the team members involved.\nIn the proposal is stated that the project is already 70% completed. They have a platform and website in Beta, and the fact they never received funding in previous rounds gives me confidence in the project. ", "q1r": 4, "q2": "I’m missing a breakdown of goals and self-imposed deadlines. I would advise adding a roadmap to the proposal. There are no KPIs in the proposal to measure what success would be like for the proposal. You can use metrics such as songs streamed, albums sold and stream library size, for example. Goals for the proposal should be specific, measurable, attainable, relevant and Time-bound (SMART principle).\nThe statement “We will utilize project management tools such as JIRA, slack as well as Github commits to track progress and milestones.” is not specific enough. You could, for example, link existing Github commits in this section so we can see what this communication would look like. ", "q2r": 2, "assessor": "z_assessor_2767", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5717, "q0": "Music industry has been in the limelight of being one of the most advantaged industries when NFT technology comes to life. This proposal, if implemented successfully, will provide a space where safe and secure payments of arts are made. Moreover, this app will provide a social media of musicians and music lovers that run on Cardano technologies. I believe the volume of the music industry is enormous, thus making mass adoption of this project easier and faster if implemented correctly and efficiently.", "q0r": 5, "q1": "As stated in the proposal, the project has finished about 70% of the app; therefore, I believe if provided enough capital resources, this project will be implemented successfully. There are business workers and developers who have necessary skills to build and execute this project. However, I am worried that there would not be enough funding for this project to run. In my perception, the app would need enormous amount of money for marketing, market education, servers, and necessary legal steps. Based on similar solutions regarding NFTs and cryptocurrency, the $110,000 might not be enough for the project's execution in the long run.", "q1r": 4, "q2": "While I adore the proposal of being extremely informative regarding the details of the app, which include technologies and market aspects, I wish I could see a better and in-detail description of the people behind this project. In my viewpoint, the people aspect is the most important when it comes to technology startups; therefore, such lack of information regarding human resources will somewhat deter my prediction of the project's future success.", "q2r": 4, "assessor": "z_assessor_2741", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 3425, "q0": "problem statement is fair as music streaming as it is nowadays usually does not favour artists as it potentially could. Proposer does a good job on describing how adopting and descentrilized web3 music platform could help to solve this problem and this is the final product being offered here. It is also aligned with challenge as a new Dapp that can potentially boost Cardano adoption is being developed (challenge kpis of \"Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases.\"). Moreover, this platform, as propsoer states, is 70% already complete so the value delivery to the community will be quick, which is very good. However, there are a few points to consider. Nowadays, there are plenty of music streaming apps (considering the ones centrilized). the majority of them have nearly all songs and artists one would like find. Therefore, there's a great switching cost for the users to move to an emerging one, that dont have (at least for now) all this content they can find in these other apps. it could be clearer here what is the main value proposition for users that would defintely make them migrate. Maybe if artists migrated only to this new descentrilized app but this is a great leap. The value proposition for artists is very clear, though. In the same sense, the competition with the current big players will not be easy as this is currently a pretty much established market. ", "q0r": 4, "q1": "AS for the plan, there's no specified timile, only a product backlog with the main features in it. It could be said here when they intend to deliver each of these features. I understand that a project like this will likely adopt na agile approach and that this would vary a lot but some idea on general times or milestones could be provided. This backlog seems to cover most of the final product with good level of details though.\nBudget breakdown is fair and mateches prodcut backlog but the hours to develop each budget line could be highlighted.\nThere are 5 people committed to this project and their roles are stated here. However, there's no linkedin link nor are their experiences and backgrounds described.", "q1r": 2, "q2": "Proposer is suggesting to track project progress via milestones report using Jira, slack or github. While this seems to be a good suggestion, these milestones are not clear in the plan provided here. There's also no metrics provided. It would be imporant to track number of users (divided into the 3 main profile models: artist, label or fan), number of transactions, amount of ADAs traded and so on.\nOther description of success provided here are delivering Dapp main features.", "q2r": 3, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2767, "q0": "This idea makes me think of the interaction between an artist, or a speaker, being able to live stream or sell live it's like what Youtube, facebook, and many other social networks do, and the great thing. The greatness of this idea is better than the social media sites that are being broadcast now but they can't get the copyright like this idea proposes, in the future this proposal will be successful and work widely in many countries. think it will have a huge impact on our NFT mosaic, the speakers will sell their knowledge on this live streaming platform this is exciting, this is an idea that will take engineering Blockchain developer expertise, but in the description of the solution, the team provides a link http://decentralizemusic.com/ and features when the project is completed without mentioning a little technical solution. art, real learning. I think this is because this is a good idea and has a world scale, so the recommending team could consider building a landing page with a whitepaper, progress, or more information to update on it, maybe in In the future, the team will perfect this because it is still related to the issuance of tokens, of this idea, there are more than 2 risks proposed by the team mentioned in the description of the solution but not in the section on how to reduce the risk. maybe this is a sketch of the summary of the proposal, the team has raised the risks so I believe the team has a plan to fix it,", "q0r": 4, "q1": "All the goals that have been established by the team in phase one have been completed by the team, and phase two has been implemented, designing all the necessary content for the website, but the team has not provided a certain time to do so. implementation, or a clear milestone to accomplish the goal, of the expenditures provided in the budget section. Through this summary, I identified a group of 4 people who assigned work to each position for each person,", "q1r": 3, "q2": "there are many social networking sites of the team that provide and commit to update the progress, and milestones of the project on it, like github, youtube, I highly recommend this part of the team because the team mentions the academically experimenting with decentralized apps with three different groups: profiles, brands, and artists. and at the same time, success is also clearly defined and presented by the team, the nearest date to experience is an artist for this idea.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 2397, "q0": "We realized that the ideas described in the proposal present a good conformity with the challenge in which it was placed. In fact, we still haven't noticed a great integration between the current music platforms with concepts and technologies that can be implemented by the Cardano ecosystem. Thinking from this point of view, and taking into account everything that the platform in question aims to accomplish, we have that the amount being requested is consistent. However, the scope of the actions to be taken raises a little doubt whether too big a step is being taken. As previously mentioned, there is still no clear integration between blockchain technologies with the music market, and the project's great differential would be to bring several features related to this integration. The fear lies in the fact that perhaps the market is not yet ready for this, and a large amount of capital would be being used in a non-optimal way. The medium and long-term impacts on Cardano's ecosystem are quite positive if this project is successful. However, linked to this is also a considerable risk.", "q0r": 3, "q1": "Regarding the explanation of the steps that will be carried out in the construction of the project, we realize that there may have been a little more detail on the motivation for carrying out each of them. In the section on the details of the plan, we have that the information transmitted appears to have a very technical character, with general explanations about what the 'body' of the platform will be like. But it would be nice to understand the reason for carrying out these implementations. Regarding the professionals involved behind the project, we noticed that they have different specializations, not only being focused on the technology area, but also having people experienced in project management and event production, such as Marcus Gray and Andrew Lojero, respectively. This makes us believe in the team's ability to solve a plurality of problems that may arise during development. Despite all these positive characteristics, we cannot fail to mention that perhaps many fronts are being attacked simultaneously in this current business plan. One possibility would be to choose a specific type of blockchain integration to implement and focus as much as possible on developing it. With this, it might even be possible to reduce the expenditures explained in the budget details. Currently, the amounts allocated there for different functionalities make sense, when we consider the plurality of actions to be performed. But choosing a smaller amount of features, probably the development expenses would also be lower.", "q1r": 2, "q2": "The perception of success conveyed by the proposal is in line with the concepts developed, since it aims at the existence of a living ecosystem that is widely used by different types of users. The metrics exposed to achieve this success are also consistent with the technological nature of the proposal, since tools such as Jira and GitHub are currently among the most used for monitoring projects. However, given the dimensions of what the proposal aims to achieve, it would be very important that some numerical targets had been exposed, to facilitate a future evaluation of the project's performance. For example, an average number of monthly active users on the platform could have been defined, or an expected volume of CNFT transactions after the integration with blockchain technologies was carried out.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14484, "q0": "The proposal team intends to address the issue of a lack of solutions for all parts of music commerce, from artist royalties to minting music NFTs on the Cardano blockchain. The team is seeking funding to create DecentralizeMusic.com, a live streaming platform that also allows artists to create profiles, sell merchandise, music, nfts, and other services. This is a great and bold idea. This proposal is about difficulty setting. The proposal, as well as the overall tasks and milestones, are realistic. However, there is no mention of the likely community impact of the implementation. There are no measurable KPIs or impact measures in the proposal. The proposer has defined a risk as \"we face are our the lack of knowledge around the Cardano development tools needed to execute functionality,\" but has not offered details on how they intend to overcome it.", "q0r": 3, "q1": "The team's experience and expertise are too unclear, and more information about both the team as a whole and the people working on it is required, including resumes and possibly social links to validate their expertise. The total amount sought is $110K, which has been divided. However, more specifics in a budget breakdown would be ideal in order to comprehend the budget allocation. The majority of the funds asked, will be used to compensate the development team. It would be extremely helpful if the plan included a response to the question of how many working hours should be divided among how many hired individuals, and so on. A well-described roadmap is provided, with realistic milestones showcasing the implementation's steps one by one. It's a shame that the delivery deadline for the proposed project isn't specified. As a result, no timeline for completing the above tasks in each phase exists. In terms of feasibility, this proposal is very unlikely to be implemented effectively.", "q1r": 3, "q2": "The proposer's approach for tracking project development is to track commits on GitHub and also updates on JIRA. I entirely agree with this method but, if the proposal is funded, the proposer should include detailed timelines so that the project progress may be tracked through it. There are no formal KPIs to measure project success; the proposer must submit a number of users that will be gained so that it can be proved how the project will assist the Cardano community grow. The proposer can give proof of the BETA version, which the proposer has stated as nearing completion; this will also be very crucial in assessing the project's success.", "q2r": 3, "assessor": "z_assessor_4060", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14718, "q0": "\"The music industry is huge and lucrative. Nowadays, there are lots of artists distributing their art works via electronic/social media platforms such as Youtube, Spotify, Soundcloud, etc. However, the major problem is that artists may have to pay a large amount of revenue to the owner of the platform. DecentralizeMusic.com created the platform for artists to retain the majority of their transactions. Thanks to this advantage, the artists may be interested in Cardano ecosystem, thus generating an adoption and education for artists. The proposers have done the similar project called jazzisdead, with 30 events and tours, and attendees will be introduced into Cardano and this project ecosystem. Therefore, this solution perfectly aligned with the challenge setting.\nThe proposers carefully listed out the risks, however, the solutions dealing with the risks should also be addressed to make a better proposal. For example, for the lack of knowledge problem, the proposers can consider post the problems into IT-related freelancers/problem solvers platform.\"", "q0r": 4, "q1": "\"The proposers mentioned that 70% of the projects have been done, which was the BETA including the live streaming, profile creation, music streaming and profile stores. The CNFT marketplace implementation was in-progress. \nOn the bright side, the very in-detail tasks and processes were proposed. This would help the community to have a vivid image of what this project will do. However, to increase the feasibility, the detail timeline (or time needed) for each task and process should be addressed in this proposal. Moreover, the budget should be more specific on how to calculate it, the more specific (and logical), the easier the project gets fund-raised. For example, the “Legal” part costs $35,000, and the proposers should clarify what included in that part. \nIn terms of the human resources, the proposers should attach the work experiences, or a CV/LinkedIn profile to these members. For example, Devendra – the Python Developer, what is his background? How long he has been working with Python language? Answering these kinds of questions will increase the feasibility of the project. \"", "q1r": 3, "q2": "\"A great success of this project which is the huge number of users using this platform, would be beneficial for the whole Cardano ecosystem. \nThe proposers use JIRA – a project management tool, and Github commits for tracking progress. However, the in-detail KPIs/metrics should be proposed. I would like to recommend some metrics such as the number of artists, labels, or fans used this platform, the numbers of songs/song plays, the total transactions between fans and artists/labels. Feedbacks from users about their satisfactions of the platforms e.g., ease to use, the percentage of income, etc. should also be considered. After that, the proposers should specify the outcomes of the KPIs/metrics they want to attain in the given timescale. For example, after 3 months, the platform will have 10,000 daily listeners. These specific KPIs/metrics will help the community to easily audit the project.\"", "q2r": 2, "assessor": "z_assessor_4098", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Creating adoption & community around music with live streaming, digital music sales/streaming, physical merchandise sales & a CNFT marketplace. DM will also serve a consulting service for musicians.", "experience": "Marcus Gray is a web developer & project manager with 10 years of experience. Andrew Lojero is an artist manager, concert promoter, record label owner with 20 years experience. We are currently outsourcing our development."}