{"id": 414203, "author": "alex.pipo", "title": "ANIMETA | Anime Museum Metaverse", "url": "https://cardano.ideascale.com/a/dtd/414203-48088", "category": 26595, "amount": 111033, "description": "The demand for digitizing an Anime world is huge to NFT, Anime resources of artists are being shared without benefit by centralized platforms. Anime assets and ownership of artists are not guaranteed.", "f6_no_assessments": 6, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 14479, "q0": "This is a proposal on the NFT theme for artworks, the project will build a 3D art space where ANIME works are stored and allow exhibitions in the space of this digital platform. These anime works will be tagged with NFT tokens based on the Cardano blockchain technology. The development team will integrate the most advanced technology solutions to solve the problems they pose such as building 3D spatial models and integrating Web3 features to realize the ownership of the technologies, artists, and all of the end-users on this Metaverse platform.\nSpecifically, the techniques they apply focus on Ubiquity, Semantic Web, Artificial intelligence, and 3D graphics. These are Web-3 features that fit the ideas to be implemented for this proposal. As we know the global anime market is growing, especially in Asian countries, the team that proposes this project comes from the most dynamic place of Anime art creations. A market that brings a lot of value and impacts on other economic sectors, with hundreds of billions of dollars each year, anime is directly related to many industries” (Anime products are also a source of creative inspiration for other) industries to develop such as film adaptation, music, game publishing, advertising, food, or cosplay production ...)” In my opinion, with a large volume of anime every year being created with only a small fraction of NFT-linked digitization, it will greatly accelerate the shift of traditional anime and NFT Cardano technology has a lot of work to be created, This is really a project that affects a lot of people in addition to the money community, but also the anime community and creative content on the internet. The risks of the project raised by the proposer revolve around many issues such as (communication, NFT anime user education, cryptocurrency market price, or bad techniques of Cardano blockchain ..) Besides clearly explaining the implementation steps and necessary solutions for future problems. The development team has foreseen many possible risks, this is very good, fully understanding their project and confidently developing it. Indicators to measure the development and goals of the project are covered, the proposer also offers legal solutions, licenses, communication campaigns for the product, and a wide range of features usefulness of the ANIMETA metaverse platform. This is a proposal worth investing in and developing, wish you success.", "q0r": 5, "q1": "I tried accessing the 3D anime space that you guys are building, https://lp.anique.jp/exhibition/fireforce really the system runs very smoothly, the player can move in that space, click and look at the anime paintings on display, walking along the corridors of the 3D museum, there are a lot of artworks, be it anime paintings, anime films and interactions with exhibitors. I tried writing a few comments on the pictures and clicking on the heart icons for the anime I liked. I wonder if this is a necessary 3D anime space to combine with NFT, you guys have done a lot before submitting this proposal. More about the proposer of this project that I see, they have very good professional skills, they are entrepreneurs and creators of entertainment content on the internet. With those people, it's great to develop a proposal. Most of the members have clear and authenticated identities, I tried connecting with them and got a lot of useful information about this project. Some of those members are: “Telegram: https://t.me/alex_trongnguyen; Linked: https://www.linkedin.com/in/trong-nguyen-4092b568;Telegram: https://t.me/darkcompet;Github: https://github.com/darkcompet;Linked: https:// www.linkedin.com/in/khanh-pham-ngoc-79541371/;Telegram: https://t.me/nkpham” This is a highly qualified and experienced team that matches the development requirements of the proposal. I also took a close look at the Roadmap sections in this proposal, it's the most complete and detailed I've seen, the items listed line by line are what they're going to do. The required budget is not too high for a large project like ANIMETA, specifically, the web programming part is $12,000, the 3D Builder is $14,950, and the Blockchain developer $16,000.. those are important parts of our core work. project and the budget are very modest. I think these are cost estimates that are very realistic and somewhat below the market, which is beneficial for the Catalyst fund. To summarize in this section, a complete explanation of feasibility is proposed, complete and clear, your team has been successful with many products, and I hope you continue to succeed with this 3D Anime NFT Museum project.", "q1r": 5, "q2": "The success of the project is briefly defined, what is needed to succeed in the Fund 9 phase of this proposal is covered, which is: “Build APIs and mint NFTs; Attach NFT products to that of NFT on the Cardano blockchain; Build a 3D gallery space for anime works; Build a wallet of the ANIMETA platform that serves customers to create and manage their assets.” In addition, the token for the anime museum ecosystem is also issued, the tokennomics implementation is presented in the excel file and the proposer is attached. In the internal team, it is recommended to use a software development process that is very popular these days like SCRUM, which allows tasks to be defined and completed according to those KPIs. The Catalyst community can also follow the development of the project through the links (community, source code submitted, or website) provided by the proposers.\nOverall, ANIMETA is a great proposal that includes many items that need to be done, has many useful features of the anime exhibition museum, and the graphics are beautiful and harmonious. The proposal has a wide impact on many communities and the ability to execute successfully with this development team, they have many achievements in funds8 with other dApp platforms.\nI would like to advise proposers to develop more mobile versions of ANIMETA to serve a larger set of customers, young people who want convenience and always have a smartphone in their hand. If ANIMETA's dApps are deployed on mobile devices I believe this export can go even further, possibly expanding in the next funds like funds 10, and 11 on this Catalyst fund. I support developments that add features and versions of the ANIMETA platform that you are after.  I believe that the Catalyst community will soon experience this product and hold the first $AME tokens of the project when released.", "q2r": 5, "assessor": "z_assessor_4059", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 5966, "q0": "Anime is drawing art originating from Japan and is very popular in the world. It is a wonderful idea to build a metaverse for anime as they are already in the digital format that can be easily converted to NFT for trading and securing intellectual property. This platform will attract many anime creators as it helps them to earn more money ", "q0r": 5, "q1": "The team profile is familiar with me as I have evaluated some of their proposals in Fund8 and Fund9. They are have a strong background in software development, blockchain and system admin. I think they are able to complete this metaverse project successfully. The proposal owner did a good job on risk assessment to ensure the completion of this ambitious project. Project plan is divided into phases per quarter with concrete action plan and expected output. Cost estimation is nicely done too with breakdown of detailted tasks with cost per hours.", "q1r": 5, "q2": "Output in the first phase of this project such as community, APIs, 3D gallery are concerete items which can be checked and verified. For example, we can join the project's online community to check the project progess and updates. The APIs output should be checked by visit the project Github webiste. Other items such as designing the game tokenomic, wallet can be verified by asking the team to providing a demonstration.", "q2r": 5, "assessor": "z_assessor_2764", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6059, "q0": "An existing problem in the anime world is that the artists' anime resources are being shared on centralized platforms without benefit. The authors plan to build a museum that will display Anime and allow it to function as a metaverse platform. This way, artists can create, define and manage their NFT anime assets in the Cardano ecosystem. Combining WEB3 technology with 3D will create a more vivid and luxurious anime world in the metaverse. This anime world is built on the Cardano ecosystem to ensure the right to own the anime work is tied to NFT, and the artists can freely create and manage their anime resources without going through any intermediary. ANIMETA acts as a dApp platform and solves significant problems in the anime world, such as securing the best ownership, accelerating progress, expanding the Anime and blockchain world community, and attracting many participants for fairness and transparency of assets based on the Cardano ecosystem. These things convinced me, and I consider this proposal a perfect fit for this challenge.", "q0r": 5, "q1": "The roadmap of the proposal is presented from Q3 2022 to Q2 2023. The qualifications of the proposal team members are detailed and relevant to the tasks listed in the project. A $111033 is allocated to 3D Builder, blockchain developer, system design, graphics design, web frontend dev, web system backend dev, QA & Testing platform, marketing & legal,  hardware, and risk management. The number of labor hours spent on each item and the hourly remuneration was given in the description, and I found them to be worth the workers' effort. Overall, I agree that from experience and planning, it is very likely that this proposal will be successfully implemented.", "q1r": 5, "q2": "The team proposes to use the SCRUM model to manage and track the development progress of the AIMETA application. Specific roles for project participants have been divided and explained in detail in the description to increase the controllability of the proposal. In addition, the author team also provides evaluation indicators such as the number of NFT anime displayed on the ANIMETA platform, the number of accounts registered in ANIMETA, the number of connected ADA wallets, etc. Four significant risks (media, ADA coin down, internal teams, technology not yet supported) that could impede the proposal's implementation were analyzed and proposed to be remedied by the team. I don't see any problems tracking the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6185, "q0": "I'm surprised by your ANIMETA proposals, I've been through a lot of metaverse proposals, of all genres but still don't really understand what the specific metaverse will be? Fortunately, this project made me understand the problems and features of a metaverse. Perhaps this is the best, most practical, most understandable proposal of the metaverse that we need to popularize. I am also a software engineer and understand that defining a commercial product is very difficult, moreover, it has to be understood by everyone, even people who are not in the blockchain industry can understand it. You guys did a great job on this definition, very intuitive, and easy to understand without being too academic - A museum of pictures exhibited in 3D in a Metaverse platform, those anime are NFT attached. or self-defined by end-users. Indeed, even though high school students reading this proposal know what NFT ANIME is, I give you a plus for the problem-solving part of this project. The problem-solving part is also very easy to understand, why to build the ANIMETA museum, you take advantage of Cardano technology to decentralize with traditional Anime platforms, and at the same time divide rights for artists who create and produce those anime products. You apply Web3 technology as the foundation for asset creation, asset management, and property ownership for the participants in this Anime museum. Once again the technology in this proposal is very simple and easy for everyone to understand,\nI am very impressed with what you present here. Really Web3 technology makes me still confused but you guys have made me more knowledgeable. Your project addresses a real need in the global Anime community, the need to digitize assets, the need to protect property rights, and the need for decentralized exchange of assets. Now an anime artist or more broadly a content creator can attach NFTs to his or her production as the sole security of exchange and that is the property attached to that product. . The project has a strong impact on artists, publishers, or NFT investors on Cardano's blockchain platform. Proposal to build a 3D space museum with full functions of exhibits, galleries, spatial corridors, live commentary, and upcoming collections.\nProposed towards a really large market with annual sales of several tens of billions of dollars, according to the statistics pages you refer to “https://aja.gr.jp/english/japan-anime- data https://animetide.com/anime-industry-statistics-and-facts/ “I see that in 2020 the Japanese market alone is worth nearly 5 billion USD. Those are impressive numbers and a potential market for the NFT ANIME industry. There are a few risks that the price of cryptocurrencies fluctuates up and down affecting the project you have proposed. The rest I think is not a significant risk. You are writing a very meaningful proposal and opening the future for the digital industry with works of art. I will totally vote for your project.", "q0r": 5, "q1": "The proposal offers a roadmap that could not be more detailed, the time being each quarter of the year with dozens of jobs listed as a to-do list. I give an example in Q3 that you have clearly planned and done a lot of work such as:\n“Analysis and design system of Anime Metaverse museum.\n    •    Build 3D digital space modules. \u2028\n    •    Design the Metaverse features needed in the digital platform. \u2028\n    •    Design the database architecture of the platform system. \u2028\n    •    Build and set up Node Cardano server. \u2028\n    •    Build Cardano's DB-sync server. \u2028\n    •    Build APIs that communicate with the Cardano blockchain. \u2028\n    •    Detailed definition of the enhancements of the platform. \u2028\n    •    Design features of the ANIMETA system. \u2028\n(In this section the teams involved in development: 3D design, backend, system, network, and blockchain technical team)”\nThis is just a small excerpt that I wanted to demonstrate to the voter’s Catalyst community, in addition to the numerous portfolios of diligent work the proponent wrote. Well-planned short-term and long-term goals: In 3-6 months:\n(Complete basic 3D design modules.\n    •    Completed programming the basic functions of the platform. \u2028\n    •    Release of MVP version of ANIMETA platform. \u2028\n)\n12 months (Complete programming of application features.\n    •    Release ANIMETA version 1.0 with full functions on PC. \u2028\n    •    Develop separate community channels for customers. \u2028\n    •    Open funding rounds from investors, and collector Anime NFTs. \u2028\n    •    Complete product marketing of phase 1 \u2028\n)\nThis is very suitable for the roadmap of the tasks to be executed, with such a time period that is not too stressful on the completion of the project but also does not prolong the work, the factors here are very logical. . The project development team is highly specialized, they already have many funded projects in fund8 and are working hard on them. They are experienced in software development and have worked on the Cardano blockchain. I came across a few of their projects, which are high-quality and impactful projects in our Cardano ecosystem. Like the bWorks, cBilling, and IronSky projects they are implementing. With the digital content experts of the development team, I believe that the project will soon be fruitful and successful. The proposal has a total required budget of 111033$, which I find to be a small number compared to what it takes to have a great platform like ANIMETA. The proposal has divided the budget into corresponding work items, which is easy to control and avoids loss of funds. I agree with this budget for the development of the project, if I had to choose a Metaverse project on the blockchain platform I would definitely choose ANIMETA because what you are doing there is very practical and highly feasible.", "q1r": 5, "q2": "The proposal has been very professional in impact research related to the Sustainable Development Goals (SDG). They carefully read the goals and indicators in the SDG table and explain the importance and contribution of the proposal to those goals. Here the proposal to mention is:\n“Goal 8: Promote sustained, inclusive and sustainable economic growth, full and productive employment, and decent work for all\nGoal 10: Reduce inequality within and among countries.\nWe already know that a lot of people have used NFT trading to supplement their income. We feel that with our marketplace we will further contribute to both direct job creation (by hiring full-time employees) and by giving NFT lovers yet another space for them to showcase their work and benefit from our rewards system so they can further supplement their income….\nTo read more about Goal 8 please click here https://sdgs.un.org/goals/goal8\nTo read more about Goal 10 please click here https://sdgs.un.org/goals/goal10\nGoal 12: Ensure sustainable consumption and production patterns\nWe chose the Cardano blockchain because it is well known for its energy efficiency as well as its commitment to the environment. By bringing our marketplace to the Cardano blockchain we are ensuring it is also energy efficient.\nIt shows that the project has clearly defined and transparent long-term goals.\nIn the administration and tracking of project workflows, the development team uses the SCRUM process with participants assigned specialized roles to perform tasks. The success metrics and easy-to-define KPIs, tools for the community to track here are:\n“See more details of the proposal by following the link: https://bit.ly/3QGNh3X\nIn addition, the community can track our project progress on GitHub and the community groups that we set up specifically for the ANIMETA community group.\nGitHub: https://github.com/adaboys/ameta\nTelegram: https://t.me/animeta_platform”\nThat proves the transparency in the audit part of this proposal is very good. In the near future projects will have certain successes such as:“    •Build APIs and mint NFTs.\n    •    Attach NFT products to that of NFT on the Cardano blockchain.\n    •    Build a 3D gallery space for anime works.\n    •    Build a wallet of the ANIMETA platform that serves customers to create and manage their assets.\n    •    Build complete functionality of the ANIMETA platform…”\nAbove all this is a project that brings many benefits to the communities participating in it, ANIMETA will be a new platform for the global ANIME industry. Please develop your great ideas, I am looking forward to this project.", "q2r": 5, "assessor": "z_assessor_2788", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8728, "q0": "I am impressed by your care in both summarizing the solution and explaining it in detail. In fact, all the information about the project is already presented in the proposal. From what is described, this is indeed a fascinating project. Anime is a potential market, but no one has realized it. Your description makes me look forward to this project. You also provide a variety of illustrative charts in the proposal. In addition, you also explained how your proposal would address the challenge. In addition, it seems that the project will face a lot of challenges from media, coin, internal team to technology. However, I think there will be no problems because you have already given the solution to them. In short, I highly appreciate this opening. A great opening to a potential project.", "q0r": 5, "q1": "This is a long term project and your roadmap is organized very well. The roadmap is divided into quarters and in each phase detailed tasks have been provided. However, I think the part of \"term success\" that you also give should be presented in the following section, it will make more reasonable. Here you just need to provide the roadmap. Your detailed budget breakdown is extremely good. Items, tasks and amounts to be paid are listed clearly. They are detailed and transparent. I am really impressed with this meticulousness. Furthermore, profiles of the members have also been provided. Honestly, there's no reason to complain about this presentation. Thereby, I highly appreciate the feasibility of this project.", "q1r": 5, "q2": "I have to admit this is one of the best audit parts I've ever reviewed. It is extremely detailed. You mentioned progress management and project development metrics. Besides, you also provide indicators to track the development of the project. With such careful preparation and your experience, I believe this project will be successful. In addition, the success of the project is also described extremely thoroughly. First of all, you have identified certain success steps to be achieved in the first phase. You show us what the success of the project will be through the outstanding benefits of the platform and the value it brings to the users and the ecosystem. It not only contributes to the growth of the Anime industry, shapes the future of digital assets for Anime, but also contributes to the richness of the dApp ecosystem on Cardano. There is no doubt about the auditability of this project.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12593, "q0": "The proposal is well-suited to the challenge, given the growing popularity of anime and the huge influence of this entertainment industry in the world, I fully believe that if the project succeeds, it will have a lot of appeal. great. A metaverse museum that showcases anime and manga works that promote creativity, investment from fans and investors. This greatly contributed to the development of the Metaverse and Cardano blockchain, not only that, but also developed this entertainment platform, increasing the popularity of anime and manga.\nIssuing tokens obviously makes sense for such a project, which will grow the budget. I believe artists and creators will be intrigued with the platform's features, especially As an auction and event organization, creative contests will be held along with prizes that will foster creativity to diversify the museum.\nAs you said, the copyright issue is still very important and unresolved in the artist world, the Metaverse platform with blockchain has always solved this problem completely. I think the only barrier of the project is the problem. advertising and persuading artists to participate in the beginning because they are afraid to get acquainted with NFT sometimes just because they are afraid of risks with NFT because it also carries a lot of notoriety. I am impressed when you analyze current platforms and their shortcomings, although these are not professional research articles, it shows that you have invested a lot in research.", "q0r": 5, "q1": "This project cannot be underestimated. We have the necessary information, to a level of detail that I find satisfactory. The project roadmap is very detailed, Actual timelines go along with the details. reasonable and clear objectives, the proposer also states which groups, which members will participate in development, short-term successes, etc. I have no further comments on this part of the proposal. , because I think the information provided is satisfactory. Financially, I think the amount requested is reasonable given the scope of the project and the ADA price risks, and is fairly straightforward to understand how it will be used by the proposer who explained it in quite detail and Specifically. The proponent provided evidence of their personal skills and experience related to project management or application development. Thank you for providing details on who led the project. their qualifications as well as their qualifications and experience can give voters peace of mind that funds, if awarded, will be awarded to qualified people.", "q1r": 5, "q2": "Proposer makes it very clear and accessible that all projects funds in the past can be tracked and audited as progress is made. I think that in terms of success, success and goals are completely achievable, the first stage is an important stage because it is quite cumbersome to build, design but everything is stated will ensure the transparency of the project, the proposer defines the exact ways in which we can perceive Realizing the project's impact on Cardano's blockchain, it's a big project and I'm looking forward to seeing the project deliver on the success it can achieve in the following funds if funded. Therefore, my opinion is that the auditability of the process is excellent. You should systematize this information on an official website with enough pictures and videos of the activities. This helps the team work closely with the community and easily receive support", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Building a museum displaying Anime in 3D allows it to act as a Metaverse platform along with the adoption of WEB3. Artists can create, define, & manage their Anime NFT assets on the Cardano blockchain", "experience": "We are IT experts, software developers with 15+ years startups in the field of Mobile App, Mobile Game and internet entertainment content. Our team also has experts in Security, Cloud computing, AI, Blockchain. Besides, there is cooperation with online digital marketing partners."}