{"id": 414220, "author": "kirkstone", "title": "Erdős (An AirBnB Competitor)", "url": "https://cardano.ideascale.com/a/dtd/414220-48088", "category": 26595, "amount": 88100, "description": "The online marketplace for lodging is dominated by a handful of competitors using fiat money for transactions. This results in high rental rates for both hosts and customers.", "f6_no_assessments": 11, "f6_rating": 4.545454545454546, "videos": [], "media": [], "f6_assessments": [{"id": 14441, "q0": "The proposal will target the accommodation sector with the aim of promoting cryptocurrencies ($KIRK - Cardano’s native token) over fiat money through the launch of Erdos - a hosting service similar to AirBnB with a blockchain-based operation. The objective is easy to process and so is the target market - lodging. That being said, the proposer should still demonstrate the vast potential of the lodging industry (preferably with figures and coupled with the growth of tourism) to highlight the great impact the proposal could have on the Cardano community. Imagine if the project could promote tokens to be used for widespread bookings and rental fees, Cardano will receive huge publicity as well as investment from traveling and accommodation giants (hotels, resorts chains) as well as individual lodging estates). This is a great point on Impact that can be explained further. The financial incentive for using $KIRK is a discount on payment - this is a simple but effective way to encourage the use of cryptocurrency. The proposer highlights how receiving funds will add assurance to investors as well as the short-term growth. Initially, Erdos will offer token transactions for a discounted fee which gradually progresses to more services (ex: tokenization) as counterweight to mainstream centralized lodging services. The selling point of this project and also the key idea of the solution is to reduce conventionally overpriced exchange fees to minimum using cryptocurrencies. To better highlight how fiat money transactions are overpriced, the proposer should make a comparison with clear figures for better visualization of the proposal. A good point that the proposer makes is that the high exchange fee does little to the community, unlike Cardano. From this point, the proposer can explain how the Cardano community has a clear mission to work towards a better world through innovative ideas from blockchain technology. Therefore, using $KIRK to support Cardano is a way to do good. Another strong point in this proposal is the clear presentation of resources (Kirkstone), output (dApps - practical integration to Cardano ecosystem) and a whole section dedicated to explain their impact on the Cardano ecosystem, Catalyst, homeless community: the Cardano network will be utilized, fiat users can also onboard Cardano - which are of significance once achieved; charitable offerings for the homelessness - a good gesture of altruism that puts the Cardano community in  good light. The main risks are sufficiently listed with consideration from various aspects (governmental regulation, users’ reluctance, failure in long-term, developmental issues,...), each of which is well-addressed with reasonable measures. ", "q0r": 4, "q1": "The roadmap is detailed and informative with clear milestones (for ex: Q1 from funding), clear activities with explanation of what will be done. Similarly, the budget breakdown is clearly presented with distinct sections where the budget will go to. Explanation for expenses is satisfactorily provided, making the proposal high in feasibility and transparency. Hours of development are provided, with an estimated cost of 70usd/hour for an arrival at the total cost. However, hours spent on marketing is yet to be announced, something that should be rechecked once information is fully updated. The team members are presented with clear information that gives assurance to their credentials. The number of team members seems to be sufficient to carry out the project of this scale and their roles in the project are specified. A plus point is that the proposer is confident that no further funding will be needed. ", "q1r": 5, "q2": "The auditability is good as there will be regular meetings for progress updates with minutes of these meetings being publicly available which makes it more transparent and open to external audit. The documentation process is systematically handled with different types of report to provide. Key metrics are also quantifiable and closely aligned with the proposal. Success is divided into levels, which means the achievements of this project are monitored and assessed in an objective and practical way, which is beneficial and convenient for audit.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2499, "q0": "Lodging industry is on of the biggest revenue generating industries in the world. Many People allocate a portion of their disposable income every year for planning vacations. Then there are students and employees who are away from their homes and need a place to stay. These are just some examples of how much demand is there for this industry. Normally these services are being booked through traditional marketplaces like AirBnB and Vrbo. The problem with the these systems is the excess fees related to the use of fiat as a payment vehicle. Furthermore, the fees included in these lodging systems do not contribute directly to the community. Also if the consumers and landlords are from different countries, this involves more the one fiat currency and makes the payments more difficult. \nThrough this proposal, named Kirkstone, the team is developing an online marketplace for standard lodging. The platform can be used by landlords and renters to find the suitable options which fulfills their requirements. The payments can be done and accepted in the native currency of the Protocol $KIRK and later on other options like ADA and COTI might be added to the options. Tenants who use $KIRK to pay their rental fees will be given a discount, incentivising them to use this currency. The project aims to bring the public to Cardano by offering renting service that is integrated within the Cardano blockchain. Taking market share within the renting space would bring the masses to Cardano, further driving growth and innovations within the space. This proposal, if successful, might help to onboard a significant number of fiat users onto the Cardano blockchain.***\nThis aligns with the objectives of this challenge and will help in the adoption if Cardano through the development of dApp. The concern I have with the project is that renting a space specially for medium to long turm involves legal issues like making formal contracts and verification of Tanents  through law enforcement agencies. As there are no laws, at present, which can help in conducting these activities using Cardano blockchain, getting the real world adoption will be quite difficult. Also looking at the fact that project is focusing on UK market, it might further limit the scope of the project specially if there are some anti crypto regulations posted in that Jurisdiction. To mitigate these risks, they can develop the marketplace in Decentralized and permissionless manner where renters and landlords can contact each other from anywhere in the world and should be incentivized to use the platform.", "q0r": 4, "q1": "This Proposal is divided into 6 phases and will be completed tentatively by Q3 of 2023. It involves steps from planning and developing the basic protocol to advanced stages like multiple wallet integration, Mobile app launch and marketting. The team includes 8 people who are experienced in various fields and are skilled to complete the project as per the details provided about them in the proposal. Although there are no links provided to LinkedIn profiles of the team members or to their other social website profiles either in the proposal or on their webaite which makes it difficult to verify these details. \nTotal budget requested by the proposal is  $88100 and the breakup provided in the Proposal shows that it is reasonable amount for completing the project.\nBuilding the basic protocol looks easily attainable and hence the proposal will be feasibile to implement. the main concern would be the real world adoption as there will be many legal issues involved in renting a space for medium to long term  and complying with these issues is the reason for popularity of traditional systems as their local agents help in completing legal requirements. Still the protocol might be perfect for people who are looking for the space for short turn like for vacation and this can bring new users to Cardano.", "q1r": 4, "q2": "The team will conduct weekly meetings to review the progress of the project and then update meetings will be conducted fortnightly, the minutes of which will be published for the community. Other then that monthly reports will be released to show the progress achieved as compared to varios milestones. Similarly detailed reports will be released after completion of each of Testnet, Trial phase and Mainnet Launch. These frequent updates will help in monitoring and audit of the peoposal and this makes it easy to achieve the Auditability of the implementation of the proposal.\n*****\nThe project is trying to take a bold step and bring real life usecases to Cardano. It might not be able to achieve its objectives but it is still worth trying. I wish the team all the best.\n*****", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "The plan for Erdos is to initially release in the UK and then expand globally country by country."}, {"id": 4256, "q0": "This proposal is well aligned with the stated challenge category. The Kirkstone team proposes to develop an innovative RealFi platform that will benefit the Cardano community and outsiders.\n\nBy providing lower rental fees to users in their housing marketplace, they will hopefully generate significant interest and attract newcomers to the Cardano ecosystem.\n\nAs a user of AirBnb and similar services, I can see a strong demand from customers to lower the fees charged by these intermediaries.\nHowever, reaching a significant critical mass that will attract sufficient landlords and customers is a colossal challenge, which would bring tremendous activity on Cardano if successful.", "q0r": 5, "q1": "Given the foothold that AirBnb and its competitors currently have over the rental market, trying to take a share of this market will require very high efforts and investment from a strong and experienced team.\n\nSeeing as most Kirkstone team members are relatively young students and recent graduates, the risk is high that they do not have the required experience to successfully carry out their plan.\n\nHowever, the quality of their initial plan and budget shows a strong motivation and attention to details, and I believe the low funds required ($88k) is worth the risk if the team manages to complete their objectives.", "q1r": 3, "q2": "The Kirkstone team promises to publicly issue regular development updates containing sufficient information (milestones, KPIs, timelines) to gauge the progress of the project.\n\nThey plan on providing detailed KPIs for each of the three phases of the project that will give the community ample data-points to quantitatively assess their progress and achievements.\n\nIf the team executes their reporting plan as promised, sufficiently detailed and regular updates will be provided to evaluate the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2534", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8196, "q0": "The team has provided a detailed description of their project including raising problems, offering solutions, identifying the target audience, determining the expected outcomes and how they will benefit the community and the Cardano system in general. The proposed solution is well aligned with the challenge. Cryptocurrency has gained tremendous popularity and value in recent years, so the tendency to move toward it is feasible. The team did well in predicting the main risks that might happen during the execution process followed by a brief of reasonable solutions. However, if possible, the proposers can give more details on the risk management plan so that the community can access their capability. For example, when working on the government regulation, the team can predict some upcoming changes based on collected data, or how they can keep up with changes (e.g. hire local lawyers). Some of the characteristics of fiat currency are that it has social-economic consensus and is accepted for taxes. So, how can the native token $KIRK meet these requirements and comply with different regulatory regimes? When it comes to low adoption, what is the marketing strategy, and how can the team approach the target audience?", "q0r": 5, "q1": "\"The roadmap is carefully prepared, and there is clarity in the delivery plan which is broken down into 3 main phases (Q1,2,3 from funding). All the deliverables are also clear with proper durations. Based on this plan, the catalyst community can track down the activities and detect any delay that might happen, thus initiating adjustment programs. The requested funding is also reasonably allocated according to the delivery plan. I can see two-thirds of the cost will go to the salary of developers and the rest will be spent on market research, management, and marketing. The financial breakdown is also transparent, allowing the community to easily follow. \nThe team members’ information is well described in the proposal. The working experiences indicate that they are a strong and reliable team. The proposers can embed the link to their members’ portfolios to support the verification process.\n\"", "q1r": 5, "q2": "\"The problem and the solution are very clear and aligned with each other. Auditing the proposal has been made easier for the community given all the KPIs, metrics, and relevant materials. The team has planned the meeting and report schedule, which can keep the community updated about their progress and development. The indicators are also good and split into different phases (short-term and long-term). \nThe success of the project is also well visualized with 3 levels, allowing the team to focus on their goals. Using levels to evaluate the project, the catalyst community can easily identify the current status of the project and prompt actions in case the project fall behind the plan. The goals are also achievable. \n\"", "q2r": 5, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8563, "q0": "This proposal appeals to me, and I agree that this belongs to the dapps, products and integrations category. The problem statement is well-defined. According to the proposal, the online marketplace for lodging is dominated by a handful of competitors using fiat money for transactions which results in high rental rates for both hosts and customers. The team aims at solving this by providing a cryptocurrency alternative to AirBnB and Vrbo called Erdős dApp, which is cheaper and easier to use for hosts and guests. I like how the problem statement and solution are both comprehensive and relevant to each other. The proposer is specific in articulating what the benefits are for each stakeholder and provides a picture of how the project will be implemented. It's also extremely great how the author discusses the essential tasks that would take place in the Dapp, providing us a solid understanding of what this idea is about and how it would work in practice. As taking market share within the renting space would bring the masses to Cardano, further driving growth and innovations within the space, I believe it is a very interesting proposal with a high chance of providing very positive results, and if successfully funded and executed, it can bring new members to the Cardano ecosystem.", "q0r": 5, "q1": "This proposal's team has provided a good explanation of the team members' experience and competency, as well as their specific role in this project. Despite the fact that there is a long list of related talents, I couldn't find a method to check them by googling or following the links provided in the proposal, which left me wanting additional information about the credentials of the individual that will be executing the project. In terms of timeframe, the plan is adequately stated, providing a good picture of when the team expects the six described phases to be accomplished. Various activities are required in each phase but we can know how long it takes to finish every single one of them in the form of working hours. The proposers demonstrate not just when, but also how the task is completed. The idea described here is very straightforward, therefore I don't see why it should be split more. In terms of budgeting, it is extremely helpful to have a breakdown of the actual costs that are planned in the roadmap. The team requested an amount of $88,100 and did a good job describing how the money will be used and distributed. Given the actual cost of today's market value, I thought the hourly rate for an experienced developer was appropriate, as was the market research rate. The resources required to implement the proposal, as well as the technical aspects of the project, are fully outlined. The proposers have enough resources to effectively build their project from the ground up. Given the information shown above, the only thing that I believe needs to be improved is for the team to give verifiable links to verify each member.", "q1r": 5, "q2": "The auditability is excellent in this case. The author offers us with a really well-written script that is incredibly comprehensive and detailed. This allows us to precisely monitor whether or not what was promised is being carried out, given the defined roadmap and timeline. The authors also describe how the project's success would be with average, good, and best scenarios, so that we have all the information we need to track whether the proposal delivered on its promises. KPIs are also offered, allowing us to more carefully track proposal activities during the development, short term, and long term phases. Reports that offer feedback to the community can be produced using the KPIs provided. Details on the meeting schedule and documentation production are included as well. Furthermore, certain risks and problems are highlighted, as well as possible solutions to some of the problems in a way that I believe is reasonable. I believe it is totally feasible to audit the proposal in an appropriate and secure manner.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8657, "q0": "The main purpose of this project is to develop an online marketplace for lodging service platform integrated into Cardano. To be able to compete with competitors that are occupying the market, promotion is the only and best way for them to improve their competitive advantage. The proponent's policy is to encourage users to pay through their native currency $KIRK to transact to receive a discount. It can be said that their application still acts as an intermediary application, but they will charge a lower fee than the intermediary fees on the market today. I think users always like what the promotion is and this app will be able to attract a number of new users to sign up in the beginning and later if the intermediary fee keeps it the lowest and lower than the average fee of other online marketplace for lodging service applications in the market. Incentivizing the use of cryptocurrencies for payments instead of fiat could also boost Cardano's liquidity capabilities. however, the proponent still hasn't provided us with the exchange rate between other currencies to their native currency $KIRK, for example, how many dollars is 1 $KIRK? And does its value fluctuate over time as other currencies fluctuate (as is the case with cryptocurrencies)? Overall, in the short term, this project can meet the key metric of the Challenge which is increasing blockchain adoption, but in the long term there can be a big risk that other competitors will copy their model and lower the intermediary cost even more, at this time their user base will probably continue to be divided, so what is the solution for the proponent to face this problem.", "q0r": 3, "q1": "The proponent presents a very clear and logical project development plan, looking at it we can know the timelines, the target works to be completed, and especially the estimated number of hours to complete those tasks. Marketing is an important task to attract new users while there were too many strong competitors before this project, fortunately, the proponent had a plan for this in their overall plan. The budget section is extremely detailed as the proponent applies the formula of working hours x corresponding remuneration, and it is in line with the platform development roadmap they have set out. This proposal has tried to assemble a team of people with experiences that can help them develop well in such jobs as platform building – marketing strategy – crypto operations consulting. However, in addition to the descriptions of the members, I encourage recommenders to include links to their profiles like Linkedin, Github, CV, etc. as a reference to reinforce the claims you are referring to.", "q1r": 4, "q2": "People who love this project can easily track and update the progress of the project by choosing which tool is most convenient for them from a range of tools/reports that the proponent will publish according to the different cycles. The proponent outlined his/her project definitions of project success at short- and long-term milestones such as the number of servers, wallet addresses with $KIRK, new crypto users joining the Cardanoa community. However, stopping at the definition without specific numbers is not enough to visualize and measure the success of the project in the future. KPIs should be expressed numerically, for example, for a long-term period, expect new crypto users to join the Cardano community at 1000/month.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9605, "q0": "This project aims to build a dApps that functions similar to AirBnB but allows tenants to pay with $KIRK tokens. Tenants and landlords will enjoy cheaper transaction fees than using fiat as traditional services. In addition, this project will also increase the utility of the Cardano ecosystem when tenants do not need to exchange fiat money to use real-life services anymore but can use tokens on Cardano to pay directly. This proposal completely addresses the challenge setting by increasing use cases for the Cardano ecosystem while also increasing the number of new users coming to Cardano.", "q0r": 5, "q1": "Regarding the project team, I suggest that the proposer needs to provide more evidence (references, links) about the skills and experience of each team member. Especially for Hassan Alubeidi - The lead Developer of the team. Because according to what is written in the proposal, I do not know how many years of experience Hassan has and what skills he has in smart contract programming on Cardano.\n\nThe project budget is broken down into specific identifiable items. In my opinion, this budget is reasonable to implement the project. The timetable is presented in very detail and is realistic.\n\nIn terms of the technology of the project, since this project is a dApps, the proposer can take a closer look at the technical aspects involved to implement the project such as the programming language used for Android and iOS mobile apps development, system architecture, and the technologies they use to ensure the scalability of the system to hundreds of thousands of users.", "q1r": 4, "q2": "The project has given milestones so that the community can evaluate the success of the project as a dApps that supports landlords listing their properties and tenants can rent on it, supporting multiple Wallets (Nami, Yoroi), and has mobile apps on Android and iOS. Once those milestones are completed, the community is fully verifiable. The KPIs used to evaluate the success of the project are also carefully considered, which include the number of hosts/properties on-boarded, customer satisfaction rate, the amount of money saved compared to using traditional services, customer repeat, number of new users coming to the Cardano ecosystem. However, the project also needed to add an accessible public channel to deliver regular updates to the community for auditing progress.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12712, "q0": "The Proposal correctly addresses the Challenge Topic of \"Dapps, Products & Integrations\" as it aims to provide a lodging facilitating service for both hosts and customers.\n\nThe Team has presented a well-prepared proposal with detailed solutions to existing problems in the real estate market, namely the leasing market. I believe their solutions are thoroughly evaluated and that they will be able to solve the problems with the proposed solutions.\n\n\"I believe the ability to scale up the project outside of Proposer's country is endless, just like Airbnb has scaled up their business globally. It is not too hard to promote the Team's ideas and solutions, as existing market participants are already well-educated and fluent in the usage of lodging facilitators like Airbnb, bookings.com, and so on. \n\"\n\n\nFor the above reasons, I give the Team a 5/5 score for Impact.", "q0r": 5, "q1": "The Team consists of 8 members, each with relevant experience and background to add to the Project, from technical to marketing, design, and finance. All their submitted materials are prepared clearly and professionally, from the Catalyst Fund Proposal to the white paper and the websites. The Team has already created and deployed their token on Blockchain, which furtherly solidifies their total commitment to the Project.\n\n\nGiven the team's intensive technical background and the fact that they are asking for funds to build a technical product, I truly believe that they will be able to carry out the product-building activities following their projected timeline. Their execution plan and budgets are plotted out in hourly units, which shows that the Team has studied thoroughly and understands their Project.\n\n\n\nTo conclude, the Team has shown that they are well-prepared, they have spent a lot of time evaluating important aspects of this Project and they are committed and capable of carrying out this project successfully.\nFor the above reasons, I give the team average of 5/5 for Feasibility.", "q1r": 5, "q2": "The Team's execution timeline is well presented and their milestones are clearly laid-out. There are clear objectives for each phase with important checkpoints to achieve and measure against, which makes the Project easily auditable.\nThe Team has a very detailed timeline with important qualitative KPI items for each execution phase. The Team has successfully addressed Cardano Catalyst Fun Community members' concern and have shown their objectives with measurable criteria for success/failure in a devoted manner. I value the team's effort in preparing their proposal as a whole and in creating well-structured KPI items in particular.\n\nThe Team has provided a thorough reporting system for this Project, which includes meeting minutes, monthly reports to Cardano, test-net review report, user report, and launch review report.\nFor the above reasons, I find the Team's Proposal very well-prepared, that the Cardano Catalyst Fund would be able to easily track the Team's progress. As a result, I give the Team a 5/5 score for Auditability.", "q2r": 5, "assessor": "z_assessor_3470", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13413, "q0": "The proposal is for a complex business model that aims to disrupt the marketplace for short term rentals as dominated by AirBnB and VRBO. If successful, one result will be the eventual onboarding of thousands of people to the Cardano ecosystem, as users will choose to use the project’s Cardano-based token, $KIRK, to pay for their rentals. The public and landlords will benefit from lower rental costs and simpler international transactions. A portion of the profits will go towards a charity helping the homeless. Helping the community while replacing a portion of the traditional fiat-based rental market with a less expensive, Cardano blockchain solution both help to meet the challenge of growing the adoption and integration of the Cardano ecosystem. In one area though the proposal could be made stronger - the question of risk and mitigation. The well-considered list of risks lack an explanation of how they might be mitigated. The risk of users being unwilling to use $KIRK and so will be given the option of using $ADA or DJED is an exception. More such ways to mitigate the risks would be a welcome addition to the proposal.", "q0r": 5, "q1": "Overall, the proposal is very well conceived and written. It is obvious that a lot of care, thought and planning has gone into it. The project team has many of the skills needed, and plans to hire outside help to fill any gaps. The team has more than enough experience to manage this startup and already has an existing company that will provide support and a testing ground for the new payment system. The team has written a detailed and realistic step by step plan moving from product design to technical design, product development, testing, and launching their new app and payment system. Finally, the planned budget covers the various aspects of the project with an appropriate allocation to each. Therefore, the proposal is very likely to be successfully implemented.", "q1r": 5, "q2": "This proposal is quite complex, understandably so for a startup that aims at taking on a mature, traditional ecosystem such as the rental housing market. Wisely, the team plans to deliver biweekly and monthly reports of its progress to the public. Further, it will release reports on the results of various key phases - the test-net, trial phase, and launch review. Finally, it has detailed KPI measurement criteria for the development, short-term, and long-term phases. The project has a reasonable set of success goals, ranging from what an average, good, and best level of success would mean in concrete terms. Taken together, these reports and goals will allow the community to monitor the progress and success of the project.", "q2r": 5, "assessor": "z_assessor_3624", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14532, "q0": "The project impact is closely aligned with the challenge. First of all, it offers a solution with great details. Their goal is to create a lodging platform that competes with the current centralized platform such as AirBnB. As mentioned in the proposal, their advantage is the competitive price due to the low fee, especially for international transactions. According to their belief, the current fee of the centralized platform is too high but I think they should explain more about the reasons standing behind this phenomenon. By doing so, the problem that the proposal brings out will become more persuasive. In order to make this project feasible, they also describe how the project will be implemented with great details. More than that, the likely result is also depicted and it will have profound impacts for different members of the society. On one hand, it will facilitate the acceptance of Cardano ecosystem by introducing current “unblock chained” users to the Cardano network. On the other hand, it also add social value by donating a proportion of the Erdos system fees to the homeless community. However, it is encouraged that the proposal add more key metrics to describe its outcome.As for the risks the project is facing, the proposal describes several problems with respective solutions. However, they should explain their solution more specifically. For example, to solve development issue, they tend to hire more Haskell developers but what exactly they are going to do to tackle it is not mentioned.", "q0r": 4, "q1": "With reference to the timeline, the project is carefully planned for each quarter of the year and they always tend to solve a big part of the project. For example, in order to attract users, the platform must have a good interface so that even non- crypto users can easily use it. Understanding this, the project will spend the first quarter after funding only to improve the product design. As emphasized in the proposal, they consider “UI and UX are crucial for this project and DApp to be successful”. Secondly, the budget breakdown also strictly follows the plan. Each with a specific number and an amount of working hours to measure. Lastly, the team member list is quite detailed. However, it is incentivized that they should attach a LINKED IN profile in case someone wants further research about the human resource of the project.", "q1r": 4, "q2": "The auditability of the project is described in two ways. The first is inside the team. Each week, team members will join a meeting to discuss the project development and each fortnight the team will hold an update meeting on the project, the minutes of this meeting will be available publicly. More than that, there are various reports that the project will provide for the community to keep track of the project development. These reports will contain specific KPIs that are designed specially for each phase of the project. The success for this project is described in three different scenarios: average, good, and best. All of which aims to gradually take part in the lodging market and increase Cardano onboard.", "q2r": 5, "assessor": "z_assessor_4071", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "LinkedIn profiles will be provided in the proposal and also on our website. "}, {"id": 14714, "q0": "\"Renting a house is a common practice nowadays. However, current renting services are dependent on the third party/middleman. This third party does marketing, selling, customer contact, etc. and thus the renting fees are spiked up. Erdos, is a blockchain based, landlord hosting service. Thanks to the smart contract features, the procedure of renting may be simplified, by removing the roles of middleman services, and thus reducing the cost of renting. Moreover, the exchange rate fees when tenants rent abroad could also be minimized since crypto is the main payment instead of the fiat currency. One more meaningful thing about this project is that a portion of the renting fees will be contributed to Ashby foundation – the homeless community.\nIn terms of the risks, the proposers addressed the risks well and also proposed logically solutions. I just wondered if AirBnB and Vrbo (proposers’ main giant competitors) joined the crypto world and allow users to pay cryptocurrencies for renting. Then how this project/platform could survive?\nOverall, in this part, proposers described very clearly about the project, helping readers to understand what they are trying to do. If this project succeeds, the Cardano users will be boosted significantly since the renting demand is high; thus, this solution is well aligned with the challenge setting.\"", "q0r": 5, "q1": "\"In this part the proposers listed out the tasks needed to be done, and it is good that they also thought of the time required to do each task by hours. To help the audience understand if the project is feasible, it would be better if the proposers write down the expected timeline for the audience to easily follow up the project. \nThe budget breakdown was in detail and sufficient, ranging from product, technical, testing, launching, management, etc. The budget was in accordance with the roadmap and the task process, helping readers easily to follow up. In terms of the human resources, the core team included many experienced members, from economic (marketing, finance, etc.) to technical (design, engineering, etc.) backgrounds. These backgrounds were in-line with the tasks needed to be done in the project, showing great potential that this project could be done. \"", "q1r": 4, "q2": "\"It was good that the proposers publicized the information of the meeting. Monthly reports, and report from new phases were updated. The KPIs were well set up, splitting the KPIs into development phase, short-term phase, long-term phase. The success scenarios were provided (from “average” to “best”), helping the audience to follow up the projects and understand if the project was successful or not. \nHowever, from my point of view, to improve this proposal, the proposers should try to have certain numbers of these KPIs in a given timescale. This will increase the auditability and help the community easy to track the project progress. For example, in the short-term phase, after one month of platform launching, there will be 500 host/properties on-boarded. \"", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will provide a cryptocurrency alternative to AirBnB and Vrbo, which is cheaper and easier to use for hosts and guests. A percentage of the fees will be donated to the Ashby Charity.", "experience": "Detailed further below."}