{"id": 414379, "author": "adiuvat", "title": "ADIUVAT: Find your place", "url": "https://cardano.ideascale.com/a/dtd/414379-48088", "category": 26595, "amount": 8936, "description": "The typical user has become used to a sedentary lifestyle. His debt has grown and due to this as well as inflation and scarcity of resources he is stuck at home and unable to go anywhere.", "f6_no_assessments": 5, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 14575, "q0": "The problem described in this proposal is quite aligned with the challenge. It is easy to understand the proposal's idea that Adiuvat is a Daap helping people find locations such as shops, cinemas, malls, salons, sports centers and other fun and recreational places which force people to have fun and go out. This makes a change in their behaviors, from a sedentary to an active and powerful lifestyle. I believe that Adiuvat is an interesting and useful product that can be built in the ecosystem, raising the reasons people have to interact with the Cardano blockchain that can help further drive more adoption, feedback, growth and even more innovations. The idea of the proposal is presented apparently. However, there are some additional considerations for the proposer to write in the proposal which helps make the proposal more convincing and reasonable with the challenge setting. The first one is existing products or integrations. The writer should say whether there is another dapp in the ecosystem that has a similar function with theirs or not. What are the core differences between the proposal being presented and those existing ones and why will that provide impact to the ecosystem? Or how the dapp of the team can integrate with the existing one and give the ecosystem a great combination. Those emphasize why Adiuvat needs to be built. About how the proposed solution will address the Challenge, the information is repeated with the situation and idea presented in the first part: “The typical user has become used to a sedentary lifestyle . His debt has grown and due to this as well as inflation and scarcity of resources he is stuck at home and unable to go anywhere.” Those are not enough to persuade the voter.  In this part, the proposers should show what results the project would give and how suitable and aligned they are with the KPI/Key metrics of the challenge. And after the project is completed, what can it contribute to the Cardano ecosystem? With that additional information, the proposal can be highly appreciated by the voters. In the risk part, the proposer mentioned the inflation and scarcity of resources producers, increasing prices and reducing the consumption. This seems to be the problem that happens to the people for the dapp Adiuvat to solve. However, it is better for the proposer to talk about the risks when the dapp is built, are there any bounders that prevented the projects to be successfully built. ", "q0r": 3, "q1": "I don't think the proposal is feasible enough. Proposal has no detailed plan, no timeline or key milestones for delivering the proposal, no detailed budget breakdown. It is better for the proposer to impress the apparent roadmap, milestones of the plan and the results that the project will give in each milestone. Also, the budget should be added in the proposal as well. In this part, details of the costs that the team needs to build the app. This can be the budget for Human Resources or the necessary assets for the project completion. In addition, it is vital for the writing to include details on the people who will work on the projects. The information on this proposal needs to focus on the people so that it can answer the question of who leads the whole proposal, who completes the work in each time of the process, and what is the strength of the workers. These are to prove that the talents have the ability to contribute to the success of the project. Whereas, the data that the proposal gives is the explanation about Maslow’s pyramid.", "q1r": 1, "q2": "I don't think the proposal’s auditability is explained transparently. The information is repeated so it is the same as the previous parts (impact and feasibility). It is better for the proposer to focus and explain more details about the project’s auditability. I think it is difficult for the community and voters to follow and assess the process of completing the project. After being funded, the team has to report to the community regularly. So it is important that the proposal shows how to evaluate based on the key metrics or transparent KPIs in each period of time like number of users, which part of work the team has completed, traffic, … This makes it clear about the results and the definition of the project’s success. ", "q2r": 2, "assessor": "z_assessor_4073", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2399, "q0": "We realized that the ideas conveyed in the proposal have a foundation of using technology to improve people's lives. In fact, the problems mentioned are recurrent and are part of the lives of many people belonging to different socioeconomic realities. However, it was not so clear what would be the differential in using Cardano technologies in this application. Likewise, we could not easily understand which innovation would be brought by this application, despite the pertinent questions that underlie its creation. In this context, it is not possible to say that the idea is aligned with the objectives of the challenge in which it finds itself. In this way, perhaps the budget being requested is also not adequate since we are not confident about the possible impact of the project.", "q0r": 2, "q1": "Regarding the described ways on how the project should be carried out, we could not find much detail. In this section, it would be interesting if the main activities to be carried out were described, as well as the motivation for their execution and the instruments used, however, there is a lack of this information. Regarding the details of the budget, it seems interesting that the capital allocations for each activity were described, to make it clearer how the total amount being requested was defined. Additionally, it would be legal to make available the CVs of the professionals involved so that we could understand whether the range of technical knowledge is consistent with what we want to accomplish and with the budget that was requested.", "q1r": 1, "q2": "In the auditability section, it would be interesting to demonstrate some parameters that would be used to understand if the project is moving in the expected direction, such parameters could be, for example, the number of users registered in the application, as well as establishments. And in relation to the perception of success, although a promising scenario has been described, it would be possible to establish quantitative goals to see if the project achieved a good projection, goals such as the number of users to be reached in a certain period of time after the launch of the application.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6797, "q0": "Recently, life has become so challenging that we almost forget to have fun, socialize, watch movies, have family time, get a hair cut, visit the beach etc and when these things go out of our daily lives, we become totally far from life itself. The proposal objectively fashion out these pain point in our daily lives and tries to bridge the gap.\n\nThe proposed solution intends to develop/build a robust App that will enroll various social and fun event centres like clubs, bars, restaurant, cinemas, pubs and other categories of similar fun services and users will be able to customize their preferences and receive notification of events happening in their preferred areas of choice. The proposer will leverage the Cardano blockchain to build a DApp that can be used for payment using ADA and other CNTs for services offered. These will open multifaceted opportunities for businesses as well as unlock real world usecase for Cardano. However, I believe these proposal aligns with the challenge category.", "q0r": 4, "q1": "I was able to fish out timelines and some notable milestones in the proposer. It is expected that by the beginning of Nov. 2022, the website should be ready, public gitbook and native tokens although some dates provided in the proposal are conflicting but yet the proposer has an articulated, objective and a realistic timetable for execution and a conductible implementation plan. \nThe proposer is requesting for a sum of $8936 but there is no budget breakdown that explain how that amount was arrived at although he claims that the proposed sum is to bootstrap the project but i suppose, an explanation will only better clarify the community. Also teams information is absent and void. I therefore have two concerns (No budget breakdown and no team details) which the proposer should try to make available in case they apply in future funding rounds. ", "q1r": 4, "q2": "The metrics and KPIs provided are very detailed as they outline key deliverables of the project and set timelines. The team also plans to use agile task management tool to track and measure progress. Furthermore by 2030, team expect the project to be a global company where all expected and other additional features are in full swing usage and that generally defines the success of the project.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8231, "q0": "Proposer is pretty thorough about the problem at hand and how the solution they provided can fix it. Proposer also outlines some of the solution's features such as the types of entertainment that will appear on their platform. However, the proposer has not mentioned the impact of the project on the Cardano ecosystem, or how users in the ecosystem will participate in this project. Risks for the project have been identified but no resolution has been found for those risks, the proposer should add this. Because these solutions will strengthen the confidence of the voters with the success of the project.", "q0r": 3, "q1": "The information of the FEASIBILITY section is terrible. Necessary information is not provided. Proposer should pay more attention to the content of the sections in the proposal. For the roadmap and timeline sections, project timelines should be provided in a short and concise manner. Proposer must show the voter the direction of cash flow if the project is invested and should provide more information of the participants about education, work experience, etc.", "q1r": 1, "q2": "The information provided in the AUDITABILITY section is rather sketchy. Proposer should add key metrics so voters can see the evaluation criteria for the development or success of the project such as the number of restaurants/hotels/malls participating in the project. Not to mention the goal that the project wants to achieve also needs to be further clarified so that the voters can see the destination that the project wants to aim for.", "q2r": 2, "assessor": "z_assessor_2967", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9294, "q0": "Bored one day, you want to find a place to eat, drink and entertain, but you don't know where to look. After finding it, save it temporarily so you can get to that location. Or is the location interesting or not, is it suitable for the needs you are looking for... These are the problems that still exist and I think your project idea is quite relevant to the questions. , my concerns above. Your proposal would be to register bars, clubs, restaurants and venues in different categories to invite people to hang out and have fun. This will stimulate and encourage people to be more active and positive. Especially after a few years of the covid epidemic, everything was frozen, this is the time for your project to develop. In the proposal you also find out the risks of the problem and how to fix them.", "q0r": 5, "q1": "You have a very detailed work plan, clearly divided. However, I did not see the budget breakdown nor the team members presented in this section. With your planner, I strongly believe in your ability to work, but without a clear budget and no list of members, it will be a big barrier for the project to be funded. The lack of these two elements is a great deficiency.", "q1r": 3, "q2": "The proponent has said they will provide progress updates using JIRA which is a good app because the way JIRA works is results-focused, immediate, and flexible to use. However, besides using a good application for reporting, I recommend that the proponent take a moment to come up with criteria for reporting progress. I have not seen how well you analyze your work progress measurement. In this section, we want to see a clear roadmap with clear ways in which the team will announce the status of the roadmap as time passes to complete the project.\n.In this section, if funded, will communicate progress and fair use of the awarded funds. In this case, it is to bring adiuvat tools to the community to encourage people to use and know about the decentralized financial system: Cardano (how many people, how many people react positively when use...)", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We'll enroll bars, clubs, restaurants and places of different categories that'll call people to go out and have fun. Like a diary of possible activities to do. Every day events and things change", "experience": "We are a team of experts in software development, digital marketing, finance and investment projects. We have a legal advisor with more than 10 years of experience in the field."}