{"id": 414374, "author": "vareca", "title": "Olympics–Shots promotion platform", "url": "https://cardano.ideascale.com/a/dtd/414374-48088", "category": 26595, "amount": 15000, "description": "Platform for promotion of locations, brands, specialties, incl. food, craft products, arts, history related to the scene where high resonance events take place. Video, picture, comic art used as media", "f6_no_assessments": 7, "f6_rating": 3.523809523809524, "videos": [], "media": [], "f6_assessments": [{"id": 2398, "q0": "We realize that the idea in question brings the creation of a product using blockchain technology, with the objective of obtaining benefits from the use of smart contracts in the area of ​​disclosure. With this, we can say that the proposal is aligned with the objectives of the challenge. However, we noticed that the area of ​​video advertising is today very large, but also quite dominated by few companies, and their business logic seems to work well for content producers and also for contractors. With that, although it is clearly possible to obtain benefits by creating a similar structure using blockchain, this seems to be a very arduous battle and with not so great chances of success. As a basis for this, we have that the budget being requested of $15,000 seems not to be enough to create a product with enough attraction, even more so because the proposal does not plan to ask for more funding in the future. In this way, we are in doubt about the possible impact that would be caused by this proposal:", "q0r": 2, "q1": "In addition to the points described above, we also noticed some details in the feasibility plan indicating that perhaps the best strategies were not taken to implement the proposal. One of the ways to manage the platform, as indicated, would be to charge higher fees for the content if the platform reaches certain audience levels. But it seems that this could end up discouraging new content creators and contractors from being interested in using a new product that is not yet proven on the market. In addition, we see that much of the success of this type of video viewing platform comes from the growing number of users creating an engaged ecosystem, rather than charging higher fees when the content reaches more views. On the budget breakdown, we realize that capital allocations may not be necessary to create a product that has the desired impact, as development costs may be more expensive than anticipated. And while marketing spend represents the largest forecast allocation, which makes a lot of sense in this proposal, a more considerable amount may be needed to generate the expected engagement. Regarding the project timeline, we observe activities that are well organized and with a good progression, that is, they gradually evolve over time. However, the main point for this project to become viable is a wide adoption, which would come through convincing the advantages of using Flashot. However, we could not find an explanation that clearly conveys what these advantages would be. But, in relation to the professionals involved in the project, we noticed a highly qualified team with experience in the area of ​​software development, which also made their CVs available so that the experience could be verified. Thus, we have that with the adjustments of some points, this project seems to have its chances of success greatly increased.", "q1r": 2, "q2": "Regarding the metrics chosen to monitor the evolution of the project, these are consistent with what was described about the project and help us to understand the projection that the platform is gaining. It is also interesting to note that numerical goals were established to be achieved, which helps to define whether the project was successful or not. It would also be nice if the use of some tool was indicated so that the community could follow the results and evolution of the project, in addition to providing the numbers that will already occur as indicated. Regarding the perception of success, and given the projection that the project can achieve, it seems interesting that the success scenario was a little more detailed, with the exposure of more success factors, in addition to the number of records. For example, an expected average monthly growth in relation to new users and total views obtained by the platform could be established.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4163, "q0": "The challenge seeks to drive adoption by growing an ecosystem of Dapps, products, [services] and integrations.  Ultimately, adoption – transition from innovator and early adopter to early majority and late majority phases – depends on the provision of utility to end users.  People will be drawn to the blockchain that enables them to DO things safely with the least friction. IMPACT: This proposal fits within the challenge problem.\nProposal Clarity & Fit (2): The problem statement does not state a problem.  Rather, it implies a platform with features.  Because the problem statement is deficient, the purpose of the project is more vague.  The proposal forces me to infer more than it should. Due  to the broadness of the challenge, fit is a low hurdle.  It seems the proposal seeks to create a NFT media platform, Flashshot, utilizing NFTs with rights management built in and managed by smart contract. Further, it seems to focus on video capped at 45 seconds in length.  Apparently, the platform would allow creators to promote and license content to customers. It seems the platform would have the capacity to commission work, although it is not clear whether it is more in the mode of Fiverr or Shutterstock.  The project also seems to have designs around the Milan Olympics in 2026, although the exact relationship is unclear. \nCardano Impact (5):  Content platforms providing intermediation between content creators and patrons needing to use content is a substantial business. The proposer suggests the platform will be highly visible, and thus bring notoriety to the Cardano blockchain.  This platform would contribute substantial utility to Cardano.   \nScalability (4): The concept seems capable in theory, but scaling is not addressed in the proposal other than the breadth of their intended deployment.  \nThe challenge presents the following KPIs: 1) increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, 2) Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products, and 3) increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community. A project would be successful under the challenge if it satisfies at least one of the conditions.  \nKPI Alignment (4): While few, KPIs are present and consistent with the challenge.  \nAverage Impact Score (4).  \n", "q0r": 4, "q1": "Experience Required and Fit of Team (2): Experience requirements are not specified.  The team consists of three engineers, at least one of which completed Plutus Pioneers Program.  \nImplementation Plan & Budget (2): At $15,000, the budget is extremely modest, particularly given the potential legal issues requiring contention.  No additional funding sources are intended. The time horizon for development is approximately one year, with user registration and smart contract deployment in September 2023.  This project is long, involves the development of multiple products including training videos, and potential need for legal work.  It seems incredulous that this can be done for only $15,000.  The team is also apparently working on other Catalyst projects.  \nTechnically Sound (2): Conceptually, a platform could be feasible.  Supplemental materials do not present any exploration, even at a high level, of the model.  There is no white paper, animation, explainer video or other content separate from the proposal form to assess technical aspects of the project.  \nRisk Awareness & Mitigation (3): The proposer recognizes a risk in deploying a system across a wide range of stakeholders (global) raises potential regulatory issues.  The proposal proposes two mitigations: first, the team would narrow content domains to tourism and sports. If necessary, they will recruit a legal officer.  The requirement for a legal officer seems certain due to regulatory complexity arising from different intellectual property provisions across jurisdictions.  While the platform may manage IP rights through smart contract exchanges, the platform either needs to ensure IP cannot be used off platform or that it off-platform use is defensible in courts. The plan identifies another risk in its provision for Flashshot to screen content to ensure inappropriate materials are prevented.  Presumably, this would include child porn and other illegal content.  Content illegality may vary across jurisdiction and imposes additional legal issues to be managed.  \nAverage Feasibility Score (2).\n\n", "q1r": 2, "q2": "Roadmap, Milestones and Time Horizon (4):  These elements are present at moderate detail.\nReasonable and Quantifiable KPIs (4): While more indicators could be monitored, the KPIs are quantifiable and achievable. \nTransparency (4): The team has a Github repository for the project, and they will report on KPIs monthly.  \nAverage Auditability Score (4).\n", "q2r": 4, "assessor": "z_assessor_2523", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 6909, "q0": "Explanation of Use Case and Clearness:\nThe Olympics-Shots promotion platform proposal wants to establish a blockchain based products that helps video makers to make themselves independent from middle mans and and create a platform where stakeholders can make orders and the media makers on the other side can produce the wanted products. This will be done with the help of smart contracts and the platform that will be created through the succesfull funding of this project. The description of the us case is written shortly and dense and therefor describes the solution only on the surface. The reader has an idea on how the product should look like and work but details are mostly hidden unfortunately. The reasons why cardano/ blockchains are used for this are explained but not completely clear.\nCompetitor:\nThere is no indication of competitors in the proposal but the company Fiverr should be at least mentioned as they are providing the same service but without blockchain technology.\nLink to challenge setting and other challenge settings:\nThe challenge settings are mostly met as this proposal aims to create a product in the media industry and connect people that possibly want to work together. \nRisks:\nThere are two risk mentioned. One would be unexpected issues and regulatory issues and the other one would be to add a legal officer to make the proposal more robust. Those risks are more general risks and unfortunately do not describe risks in finishing the product or relating explicitly tot he proposal. To give the reader more confidence in the ability to overcome problems and managing risks properly the proposer should take enough time to establish main risks and ways to manage them effectivly. \n", "q0r": 3, "q1": "Showing of realistic timetable:\nThe time table is written more as an overview as it shows explicit deadlines. To make the roadmap and timetable more realistic the proposer needs to get more into detail and explain more about the different steps that need tob e done to finish the milestones.\nBudgetfit:\nThere are only 15.000$ requested for over one year of work for a team of 3. Also 10.000$ are entitled to marketing aspects. It seems that this would be way too little funding to finish this project and realisticly cover all costs. \nMotivation/drivers:\nDrivers for the project seem tob e a specific project that needs tob e done in 2026 (Winter olympics). Other than that I cannot find any other motivations. \nTeammembers and experience:\nThere is a team of three consisting of the lead  Gabriele, and two developers – Samuel and Mateus. All of them seem experienced in their profession. \n", "q1r": 2, "q2": "KPIs and goals:\nThe KPIs mentioned are overseeable and easy to audit. They have qualitative factors and quantitative meazures to weigh against. \nCommunication channels and audits:\nThe proposer mentioned a reporting loop of one month. Unfortunately it was not meantioned where this can be seen. \n", "q2r": 4, "assessor": "z_assessor_2848", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7761, "q0": "The name of proposal is quite interesting.\nAs for any brand or product right way of marketing and advertising plays very important role in reaching wider market. As proposal wants to build platform where very huge will be gathered or many big events takes place in which they can be used for promotional activities which includes advertising the locations, brands, specialties, incl. food, craft products, arts, history which is related to the place of event or event itself. As solution Flashot will make 45seconds video a short promotional video using provides an block-chain based platform for meeting demands. For all those firms who want to promote there product.\nI strongly agree with proposal and This proposal effectively addresses the challenge.   ", "q0r": 5, "q1": "They have given all details of roadmap and timeline in depth and explained fully from start to end. They start explaining with example that is great. They have completely divided into phases which starts from funding that is august and explained what all they will be doing with given time at stage 1 and 2.\nThey have explained there business model and its income and marketing idea. \nThey have given details on budget breakdown  which includes developer cost and promotional cost and server cost one by one.\nTeam member includes well experienced developers that to be noted. As all given data feels feasible I strongly agree with proposal and  Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Proposer planned to details on concept video on Dec. 2022 and development completion on \nQ2, so users can get it by Q4 of 2023.\nIn mean time they will also be providing details on deliverables and  progress report with community. As monthly update will be available at public domain so interested people can keep track of progress. As KPIs and Metrics will be shared I strongly agree with proposal and with given data information provided is sufficient to audit the progress and the success of the proposal.   ", "q2r": 5, "assessor": "z_assessor_2917", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8198, "q0": "\"The solution itself is aligned with the challenge. The project use blockchain technology through smart contracts and NFTs, which will enhance Cardano’s presence. The proposer also provides the description of their platform; yet, it can be improved. As I know, there are other platforms (not blockchain-based) such as Tiktok, and Youtube…where people can simply upload videos and they can easily “go viral”. So the question is why do people need to choose Flashot? The team did go through some outstanding features and benefits of the Flashot, but it would be better if they did some comparisons with the apps above and point out the “pain points” (especially the copyright concerns). Once the team proves they can address those “pain points”, the proposal will be more persuasive and viable. \nThe main challenge is foreseen and covered by a proper addressing orientation. \n\"", "q0r": 4, "q1": "\"The team did well in presenting a detailed plan covering key milestones and deliverables. There is clarity in the explanation of the business model, marketing promotion as well as training activities. These infomation will be helpful for the assessment process. However, the budget breakdown appears a bit vague. For example, how can 10000USD be spent for dApp marketing promotion? The team has already offered detailed activities for this aspect so they can based on the planned tasks to allocate the fund. This can not only ensure transparency but also the logicality of the spending. The description of team members is also provided, allowing the community to review the team’s capability to effectively develop the project. \n\n\"", "q1r": 4, "q2": "\"There are some KPIs provided to keep track of the project’s progress. I believe these are good indicators since they are well aligned with the goals and features of the project. Certain milestones are set so the community can use them to mark the achievements and also detect any possible delays. The team state that all the figures will be reported monthly so i wonder where the reports will be published and how to ensure the clarity of these reports. However, the proposer has a good vision for the project’s success when setting a specific goal (registered users>600 entities by Dec 2023). This will enable the team to shift their focus on the right path and optimize the project in all aspects. \n\"", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10264, "q0": "The purpose of this proposal is to provide a blockchain-based platform, using smartcontracts to promote products and tourist attractions, and encourage video makers to produce videos about products and services. The Olympics is the biggest global sporting event, and this is clearly the best opportunity for more people to know about the Blockchain dApp in Cardano ecosystem.The problem the team try to solve is to eliminate intermediary costs and make requests transparent through smartcontract. In addition, the team also applies NFTs to manage copyright and reproduction rights. I belive you have made a very good proposal in popularizing and interacting with the Cardano Blockchain ecosystem to the community, as far as the Challenge settings are concerned. This can be the basis for wider and more popular use for promoting other products and services. It can help to really boost Cardano's popularity, show the benefits of low-cost transactions and have really useful effects in life.", "q0r": 4, "q1": "There are many applications that allow users to create short videos and share on social networks, typically Tiktok, I think you have a very specific and methodical strategy for Flashot to compete successfully. Besides, copyright, ensuring the appropriateness of videos on Flashot platform are also complicated issues and you have a detailed plan to solve. I think building a relationship with the Milan city government for information and support in the implementation process needs to be done early in order to get community participation and support. The author plans the incomes of the Flashot proposal to come from two sources of reproduction rights extension and marketing cross-selling based on the number of interactions \"views\" and \"likes\" are reasonable, following the general trend of other social networking platforms. . Proposing to build quite detailed 2 stages of project implementation, both product promotion and handling technical issues, required detailed budget is 15000$ is appropriate for the team to implement. Team members all have at least 3 years of experience in LoT and Blockchain, I hope you will make Flashot application available on Android and iOS Store platforms to reach community, I believe in the feasibility of propose and hope you will be funded.", "q1r": 4, "q2": "With a detailed plan and experience from the  team, especially you have been funded in the \"Crowdfunding with inbuilt mediation\" project in Fund 8, I support and believe in your success, it is good to bring the Flashot dApp to the community for promoting the Olympics. One point I am not happy is though the KPIs that have been listed, however it is superficial, you have not given the community enough information and a basis for voting. I think you will get better results if you provide more details for the community to vote for.", "q2r": 3, "assessor": "z_assessor_3170", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14915, "q0": "In this section, the proponent proposed a blockchain-based Flashot, which uses NFT contracts to provide promotional services for a specific product or a tourist destination among service providers, manufacturers' video output, and stakeholders. However, this project has not yet stated clearly what are the outstanding benefits that stakeholders will receive when using Flashot specifically, Flashot has something more dominant that will attract users to choose instead of choosing other applications that have the same function in addition to intermediate costs . The project also has not made clear how Cardano's presence will be enhanced (for example, it is possible to increase the number of Cardano wallet users to pay for their services, wanting to get the right thing. In this case, what solutions will be needed for them to use Cardano wallet instead of other forms of payment because not everyone knows how to transact with Cardano wallet). The project has not mentioned whether or not customers should try the product so that customers can see the benefits before deciding to use it for a long time and accept the fee.The project uses ADA as a utility token this will increase the visibility of Cardano, however, the project has not mentioned that there may be some customers who are hesitant to use this method at first for payment, this can reduce KPIs, what will be the solution?", "q0r": 3, "q1": "The project has a plan with a specific time for each part. However, the project has not mentioned how users can register to pay with Cardano wallet into the application and what benefits policies will be reserved for stakeholders to help them come back and stick with Flashot for a long time. The project does not mention that in the future, Flashot will expand its service offering beyond sports and tourism, and  can expect to have more than 45'' for a video products yet to be mentioned in the project. In the expected budget section, no mention of the money will be paid to the winners of the video/photo/comic contest in May 2023, the cost of legal staff (if necessary to hire them in the event of a dispute or breach of contract). The project has not mentioned whether to recruit new members or not (because currently the team members do not hold the role and have experience in the field of legal settlement).", "q1r": 3, "q2": "In this section, the project has not mentioned in the KPIS section the number of customers who will return to initiate NFT on Flashot when they have finished their previous NFTs. And a detailed periodic report on project progress, details. Have budgeted goals been sent back to the Catalyst community so they can keep track of the project that hasn't been mentioned. Once the project is completed reach the customers, what benefits will it bring to the Cardano ecosystem, how to improve the quality of the existing product and integration based on user feedback? used to help the Cardano ecosystem grow larger and larger. How they can maintain and develop the goals of sustainable development have not seen the project has not yet mentioned.", "q2r": 3, "assessor": "z_assessor_4111", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Flashot, 45 sec. short media, provides an block-chain based platform for meeting demand by entities willing to promote a specific product, masterpiece or location and video, picture, comic art-makers", "experience": "Mechatronics engineer, 10+ y entrepreneur experience, Plutus PP graduate, green-fields start-ups in China and Japan in sectors. Over 15 years business development experience"}