{"id": 414357, "author": "chadle", "title": "NFT Search Engine on Cardano", "url": "https://cardano.ideascale.com/a/dtd/414357-48088", "category": 26595, "amount": 35000, "description": "Currently, Cardano applications are search-able based on token policy ID and name and do not search based on metadata characteristics specific to NFTs.", "f6_no_assessments": 12, "f6_rating": 3.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 8300, "q0": "In terms of the problem statement, the team does offer a brief and understandable rendition of the current situation regarding the ability to search for the exact applications that consumers need. Therefore, a new search engine that specializes in finding the metadata traits residing within particular NFTs does sound necessary and intriguing. I can’t help but relate to this situation since I did find myself in this tangle not long ago when I was grinding through the Internet looking for a laptop that has powerful internal components packed in a lightweight and portable chassis, but my searchings gave me nothing but a awkwardly long list of ultrabooks and gaming laptops from various brands such as Asus, Acer, Lenovo, HP, Alienware, Razer, etc. It’s worth keeping in mind that there is only a finite number of laptops out there, but the metadata storage is immense, so this example should fortify the necessity of this project even more. However, from the information provided in this section, I believe that this project is still so far a concept, since there are only details depicting the main functionalities, while other features are still left out and the existing components, which are sophisticated pieces of infrastructure, have not been dived into details, either. As a consequence, there lacks the key metrics needed to determine the success of this project, which is a crucial part of this section.\nThat being said, the team has managed to give a more thorough description of the possible challenges they may face in the execution of this project, which is the concern to deliver a desirable search engine that lives up to the expectation of the community. And they intend to resolve that by integrating complex search algorithms that have been successfully tested, which I suppose makes up for the lack of main component listing I mentioned earlier. As for the scalability to tackle the long-term implementation, the team hopes to put in use more sophisticated elements to further strengthen the engine.", "q0r": 3, "q1": "Straight from the beginning of this section, the team claims that they have already had a proof of concept made prior to this proposal to mitigate the above challenges and they are expecting to deliver the project in a time span of just 3-6 months, which is probably a good sign of things to come. \nIn the first milestone, which is nearly finished work in progress, they hope to deliver a first look at the architecture and core functionality of the project, which is also the proof of concept that they have mentioned in the Impact section. To be specific, there will be working web app with a text search field for users to look for the applications the want, with the returning results ranking in order of relevance and each result containing information that relates to the components of the Cardano application, such as images, summary of the metadata, minted NFTs, etc. \nThe second milestone, supposedly taking place in June 2022, will carry on the achievements from the first one, focusing on the given feedback from users and strengthening the performance and architecture, and hoping to deliver overall faster and more conclusive searchings. \nThe third milestone, supposedly occurring in September of the same year, will continue to improve the project further based on the combined feedback of two previous milestones, this time concentrating the most to the result relevance compared to the search keywords to offer more precise and up-to-date results. And the proposal has also included the team’s dedication to continue integrating new components and enhancing the overall functionality and features, further solidifying a good chance of getting the fund approval. Therefore, based on the performance so far in this section, I would say that the requested budget is somewhat justifiable, and I say “somewhat” because the infrastructure costs are the only ones getting a clarified deduction compared to the other costs, all of which curiously have the same number of $8,866.\nAs for the team members of this project, It was mentioned at the beginning of the proposal that this project currently has 2 hands on deck only. Nevertheless, they both have had a significantly long amount of 25 years to accumulate their experience and expertise for this project, so while some may doubt that only 2 members will prolong the time needed to deliver the project, I believe that they have more than enough capabilities to pull through. And the proposal also claims that the duo is also looking for at least one more professional developer on deck, so when they do, I think It won’t be too much of a stretch. The only small thing I would love to suggest the team adding to the proposal is the dedicated profile or portfolio of each member for further verification.", "q1r": 4, "q2": "Taking this standard into consideration, while the team claims to encompass best project management practices for milestone tracking, pace reviews and predictions, they haven’t gone into specific details of what those practices, pace reviews and predictions are, and also mentioned whether those details will be accessible only to internal parties or will be available to the public community for observation as well.\nThe desired success would of course be the launch of a fully functional, bug-free and feature-rich site that allows users to find exactly what they look for, leading to more and more people adopting this search engine for Cardano NFTs. In theory, that would benefit Cardano by introducing an effective Cardano-based search engine and inherently introducing people to Cardano as well. Still, I would love to see some estimated figures demonstrating a particular vision of success by the team.", "q2r": 3, "assessor": "z_assessor_2974", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 2057, "q0": "I think this proposal is quite promising as it develops an application to search metadata in Cardano blockchain using Cardano-node, Cardano db-sync, PostgreSQL, IPFS and web technologies. By creating the NFT Search Engine, it will allow those interested in Cardano NFT to easily find NFTs with the characteristics they are looking for. This proposal, if successfully implemented, would address the challenge by enabling an easy-to-use, responsive website for deep metadata searching. Results will be announced via Ideascale, social networking sites, as well as via messaging apps. The author also recognizes the challenges and difficulties that may be encountered during the implementation of the project, which is always positive because prevention is better than cure and fortunately he also has a solution. Redundancy is great for overcoming those challenges.", "q0r": 5, "q1": "Regarding the roadmap of the proposal, according to the author, the roadmap consists of 3 milestones and the proposal is in the process of implementing milestone 1 (60% complete: deploying a working web application with a text search field) free, for now just tweaking the user experience and fixing bugs). Milestone 2 will start after Milestone 1 is completed (about 2-3 months) and Milestone 3 will start after Milestone 2 is completed. We know each milestone will have what tasks to accomplish as well as the ultimate goal of each milestone. However, if the timelines are defined every month and it is detailed what will happen in each of those sections, I believe our visualization of the process will be more logical and straightforward.\nNext is the budget, in this section, I think the proposal could also be elaborated further. We know the total required budget is $35,000 and it's broken down into sections like: \"$8,400 infrastructure costs, $8,866 Developer / Sysadmin, $8,866 Sysadmin / Management, $8,866 Searching find another developer\". In general, we know how the total amount will be divided into large parts, but each of them can be explained better. For example, why is the cost of infrastructure $8,400, and what does it include? Similar to $8,866 asking for developers: how many developers does the proposal need, how much time will they spend on the project, and what is their hourly salary???\nAnd finally, about the development team, the team is described as having 2 members with about 25 years of experience in IT infrastructure and application development, besides currently looking for more members to take on the role of developer. In my opinion, this section needs to be added as we only know about their expertise, Linkedin link profile can follow them more easily through this link. However, it would be better to have a small board for them to introduce themselves...How can we measure his experience and relationship with the technologies related to the Cardano ecosystem? Overall, the author of the proposal provided us with a basic assessment of this: roadmap, team, and budget, but it was not enough for me to judge the feasibility of the project.", "q1r": 3, "q2": "And finally, about the ability to measure project progress, it is mentioned that \"We will incorporate project management best practices for milestone tracking, velocity assessment, and prediction, and focus on focuses heavily on using LEAN techniques (e.g. Kanban)\" perhaps this is how the team can track the progress of the project, the key is \"project management best practices\" Which method is that? How do we have a basis for an audit? And then maintain regular communication with the Cardano community, to give us regular feedback on the development of the project in action. I can't see how this proposal could be easily audited because, other than being unable to track the project's progress, we don't know in detail any KPIs to determine the success of the project. So even though the success of the project was clearly defined as the release of the website and users started using it as a Cardano NFT search engine. But as mentioned above, we have no basis to measure whether this proposal is successful or not. Unfortunately, this proposal only stops at the level of providing basic information, we need more details to evaluate. Therefore, my conclusion is that the proposal is difficult to audit.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2172, "q0": "This is a great proposal intending to create an NFT search engine that can be searched via metadata.\nThe team already have a sample demo anyone can interact with here https://beta.cnft.it and a demonstration here \nhttps://youtu.be/RNA1_C2GMDk \nThe proposal stated it will utilise technologies such as Cardano-node, Cardano db-sync, PostgreSQL, IPFS, and web tech.\nIs there any plans for mobile phones versions maybe built with flutter? \nthis is considering the fact that most people now interact more with smartphones now than with web apps.\nI would have love to see the team talk about security for their indexed data against attacks and not missing\n the opportunity by posting the same text in the \"Please describe your proposed solution.\" section into\n  the \"Please describe how your proposed solution will address the Challenge that you have submitted it in.\" section of this proposal.\nI will be giving 5 stars according to the PA guidelines for impact as this is a well needed feature\n for Cardano users and also new users as it will help to ease searches.", "q0r": 5, "q1": "This proposal provided a detailed roadmap with milestones and associated timelines of the activities.\nThe budget breakdown would have been more detailed in some of the sections such as (\"$8,400 infrastructure costs\" - how is this arrived?).\nThe proposal provided details of the team members with verifiable links to their bio.\nI will be giving 5 stars for feasibility as i believe the team is capable of executing the proposal with the provided information.", "q1r": 5, "q2": "The team promises to use various best practices in milestone tracking, velocity review and prediction, citing an example of Kanban(https://www.atlassian.com/agile/kanban#:~:text=Kanban%20is%20a%20popular%20framework,of%20work%20at%20any%20time.).\nI agree the provided tools can be used to track the progress of the proposal.\nI will like to ask the team what they currently use (Considering there is a beta already) and will that be available too to the community to track the projects progress?\nI will be giving 5 stars for auditability.", "q2r": 5, "assessor": "z_assessor_2301", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 2769, "q0": "When this idea is successful, it will decode the difficulties that NFT product users, or new artists face. I have experience with the team's Wep site at the relevant link 1 but couldn't use it smoothly and fluently at first, so can the team have tutorials for new artists? ? If possible, it will be a time-saver for users and artists. This idea requires a lot of engineering to build the infrastructure, but with the team's available experience of more than 25 years in the information technology industry, the implementation of this idea will be within the scope of knowledge. of the group. The team also provides a website for testing for users. yes it can happen, it is big data export size on Blockchain however there is a solution to this risk, in the future when the idea is successful we will have written metadata to give community the fastest and most accurate data ", "q0r": 4, "q1": "The roadmap is provided in the complete and very detailed summary, each milestone is clearly explained, especially milestone one is 90% complete by the time of submission of this idea and milestone two is also in the works. The third milestone will begin in September this year, and the team also commits that in the future distribution products will focus on integrating 3rd parties with market platforms. The detailed budget table of the group stated the expenditures for the implementation of the proposal, and in addition, the group also mentioned that if there is a shortage of funds in the future, the group also has a plan to reserve funds to implement the project. judgment. Currently the team has two people with similar experience and is very rich, and still planning to find one more developer, for this reason I am afraid that the team will work with great intensity and affect the progress project, if possible, I hope that the team can update the weekly work progress on the group's Youtube channel so that the community can regularly update the progress, many thanks", "q1r": 4, "q2": "The proposed team is committed to incorporating project management best practices for milestone tracking, but that's not quite enough to win voter confidence, as the team doesn't yet offer social media tools. The meeting of each person in the group, just stopped at the group's Youtube channel, so it is very difficult to interact with the community voter with the project, so you can consider updating the weekly progress of the proposal on My Youtube channel will ensure the update of the community. The proposal's success is also easy to test because once the debugging and metadata export infrastructure is complete, users can experience that success for themselves on the proposal team's WEP page", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 10, "ne": 2, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 3430, "q0": "Idea is pretty straighfoward (implement na engine search that includes meta data in Cardano NFT) and proposal is well written. It tells how this new search engine will work which includes an already devloped algorithm search algorithm to deal with the size of the data and accuracy of the search itself. it also is aligned with challenge as it can potentially address kpi as \"Increase quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community\" as a more efficient search egine might increase the usage/transactions of Cardano NFTs. There's also a very didactic video showing how it would work so anyone can understand the solution. There's a website provided for a beta version so project seems a bit advances already - though it didnt work properly in my computer so I couldnt check it for real.\nAll in all, its a \"simple\" project that can can potentially increase the adoption of NFTs in Cardano blockchain, solving a pain point that users nowadays face.", "q0r": 5, "q1": "There's a bery detailed plan, devided into 3 main milestones and explaining with a very good level of detailed what is going to be done to achieve this milestone. Plan is also time-framed, for each milestone,  and seems to empass the whole project scope defined in the impact. Imporant to highlight that milestone 1 is already nearly completed as the proof-of-concept is alsmot done. It is also appreaciated that the project will follow an agile approach, which might guarantee an iterative process, based on feedback, to make sure adaptation will occur as project evolves.\nAs for the budget, it is well brokendown but the activity costs could contain the hours necessary to perform the work. like the plan, it matches project scope.\nRegarding the team, there are 2 people with good competencies committed: a software engineer with experience in the industry and one focused on operation and management, with experience in IT intrastrucuture. it is necessary, however, to hire one more developer. That's the main reason I'm not scoring 5 on this criteria. Linkedin links could also be provided.", "q1r": 4, "q2": "The Kanban approach that is going to be adopted in this project allows for a very visual way to track project progress (kanban boards) and this will be explored by proposer, to communicate about its development. The milestones from the plan is also a good way to assess project evolution. However, some kpis could be provided, specially after launch, as the number of searches, uquality measured by users feedback and so on.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8230, "q0": "Proposal has provided some useful information regarding the solution. Proposer has shown the voters the problem to see the need for the solution. Next, the proposer also introduced quite well about the sultion as the solution's features, and how their new system solves the problem as well as the more prominent points compared to the existing NFTs search systems. Besides, the proposer also shows the impact of the project on Cardano as well as the benefit of the NFT search engine to the users of Cardano. The team also pointed out the risks that the team may encounter during the project implementation and have a plan to overcome it. This will help reduce the risk of the project.", "q0r": 5, "q1": "Proposer has given a quite detailed roadmap and includes a timeline for each milestone. This is a right decision because then voters will know the project implementation process and have more basis for evaluation. Similarly, although the budget information is written briefly, it is quite enough to show how the cash flow will be distributed if the project is invested. However, for the information about the members of the program, the proposer can provide a little more information such as the names of the members.", "q1r": 4, "q2": "The information in AUDITABILITY is not very complete. Proposer should provide more Key metrics or KPIs so that voters can see the evaluation criteria for the project that the implementation team is interested in or so that they can measure the development/success of the project. . Besides, the proposer should also be more specific about his goal by giving dream numbers such as the number of users who use a search engine for Cardano NFTs.", "q2r": 2, "assessor": "z_assessor_2967", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9478, "q0": "For demonstrative functionality without greater explanation of what the positive benefit of this proposal would be, I rank this section a 3. If the impact section is supposed to explain how a proposal is solving a given problem or how a post-proposal world would look different, this proposal doesn’t quite take that linking step to explain why the Cardano ecosystem might need this tool and why the impact is worth $35k. This sections could definitely benefit from some market research to display if other blockchains have this tool, how often those tools get used, or which people might be talking about a need for this kind of tool. These sorts of citations would provide voters with a sense of magnitude to tangibly grasp how this might impact the ecosystem and to what degree. It might also be helpful to give examples of how this tool might be used, such as NFT shopping (if this tool links to NFT marketplaces) or tracking down particular assets. Voters might be able presume some of those impacts but they would respond more favorably if the proposal does that work for them. ", "q0r": 3, "q1": "For providing information on a highly capable team, demonstrating a clear timeframe based roadmap, and producing a budget that is well broken down into labor hours and hardware costs, I rank this section a 5. The biggest issues with this section of the proposal is not content at all, rather I think some more organizational formatting can make the proposal appear less dense to voters. I think adding spacing between each milestone and bulleting each subpoint would greatly improve the visual comprehension of voters. The given pay rate is $80 for all roles, which translates to $156k yearly, and is on the higher end of industry standard for most of these roles. However, the overall cost is not that expensive compared to most other Catalyst proposals. I very much appreciate the resume descriptions and LinkedIn profiles for the core team members. This section of the proposal is practically perfect in terms of content, it just needs some organizational improvement. ", "q1r": 5, "q2": "For providing minimal/vague information on the definition of success and providing no target metrics on measuring progress, this section scores a 1. The purpose of this section is supposed to be to provide voters with assurance that the team has a clear direction and targeted definition for success and I don’t think that they get that here. This could be obtained by further defining progress measurement with identification of various metrics and target numbers. There is a lot of room to measure website usage, number of searches conducted, or perhaps social media engagement and awareness. Some of the better proposals set metric targets at different milestones to track the timeframe progression of the end product. This will tell users that the proposers have specific definitions of success that provide a mechanism for adjustment as time goes on. Without thorough thought and content on this section, voters don’t know what the proposer thinks is “good.” ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9663, "q0": "I would mention that nft search engines are not relatively new, and there are various tools/websites that provide this service. However, developing an app specifically for Cadarno users can be a start toward engaging with the Cardano community and potentially developing future catalyst proposals. W ith the beta web version given in this proposal I have yet to access it because there may be a problem with the web not working. I can have a peek of what the web can be thanks to the YouTube video. My first impression was that it was quite minimalist and consisted of basic details. To begin with, this website is cool because of its quickness and accuracy in relevancy. The display may be a little basic, but I believe the team will be able to add additional functionality in the future if the proposal is approved. The risks outlined are understood, and strategies for mitigating these risks are provided. Please explain why your team chose Elastic Search. And please explain why this plan will garner more attention and attract users than existing nft search engines. Like what they're lacking and what this app has.", "q0r": 4, "q1": "A bonus point for the team for working ahead of time on the proposals and having already completed 90% of milestone 1. The proposer describes the architecture and functionality of the app, as well as how it works, and is concerned about its relevancy. How each result displayed should be mentioned also helps readers understand very quickly. Only two things remain in milestone 1:UX refinement and Bug fixes.Because the proposer did not specify the team's experience, I am unsure if M1 is being handled completely in compliance with the timeline. Milestones 2 and 3 will be continued after receiving feedback, and I believe that timeline is reasonable. Moving on to the proposals' budgets, the numbers provided are quite specific, but the proposer did not provide any additional information. For instance, how much each milestone costs. M1 may be completed by now, and the proposer can estimate and include the budget. The proposer should also explain why these budget amount is suitable. The proposer mentions that they need one more developer, therefore this proposal will be worked on by three individuals. To enhance the probability of this proposal's success, I believe they should clarify each person's experience and how they work for it. ", "q1r": 3, "q2": "The answer regarding \"what you will measure to track the progress of your project\" is rather generalized, and the community may be unable to audit the proposal's progress and success. Clearly indicate how milestone tracking, velocity review, and prediction are included into project management. For instance, how the app's relevance develops over time, what feedback will be necessary for each milestone. If the team see the success of this proposal include users start using using this site as a search engine for Cardano NFTs then how many new users are expected for each milestone should also be mentioned to trackdown. Delving into the specifics will demonstrate the team's commitment to the proposal. The proposer does an excellent job presenting in the start, however more effort should be placed into the auditability section.", "q2r": 2, "assessor": "z_assessor_3080", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11427, "q0": "The proposal of this project wants to develop a search engine for NFT across the cardano network. I think this is a dark idea for the following reasons:\nNFT is increasingly explosive and will be applied a lot in many fields not only art. Users will be extremely difficult without an effective search engine (imagine how useful google is to us).\nCurrently, the search engine is really not effective on cardano because it just stopped searching for big topics (my personal experience when buying and selling NFT on CNFT)\nIn this section they have also given some quite effective methods that they will use to develop their project. (using powerful Postgresql queries along with full text indexing). I like this project and find it not too complicated or too risky to implement - the reason I give the maximum score.", "q0r": 5, "q1": "Their plan is divided into 3 very clear phases and they focus on perfecting this search engine, refining it over time to make it effective, and the recommendations of this search engine. increasingly meet the needs of users.\nRegarding the proposed budget, they suggested a total cost of 110 man-hours and additional infrastructure costs. Although the cost is a bit high compared to other areas ($80/hour) the costs are obvious enough for us to see.\nThe new working team has only 2 people named and has enough linkedin profiles and related shorthand experience. I hope they will have a stronger team in the future because usually strong teams will be appreciated more.", "q1r": 4, "q2": "This team is committed to using several project management methods to track milestones (LEAN, Kanban). However, they have not announced the official website or github channel so that we can monitor and verify the progress of this project.\nIn addition, in order for the report to be effective and convenient for everyone, you should create a google sheet form or fill out the available form of the catalog to report.\nI think this is a new project, and also a new team, so they lack experience in presenting ideas in this content.\nI encourage your team to participate more actively in the catalyst meetings held weekly as well as refer to previous successful projects for a better presentation in the following funds.", "q2r": 3, "assessor": "z_assessor_3244", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14574, "q0": "I believe their proposal will make a big impact on the Cardano ecosystem. As they develop the application to search metadata in the Cardano blockchain by indexing all the NFT/token metadata to return tokens for what the user is looking for. The team tackles the challenges using Postgresql queries for an easy-to-use, responsive website for deep metadata searching. It can be seen that this proposal is quite suitable, synchronized with the KPI/Key metrics of the challenge. To address the risks, I also see the team come up with a lot of obvious ways of doing things like exporting, indexing and searching the entire blockchain and it's constantly evolving. Besides, they implement queue patterns in the architecture to achieve some parallelism when data from blockchain arrives and requires indexing. Additionally, they are also looking at using ElasticSearch to enhance our full text indexing, especially with metadata.", "q0r": 5, "q1": "I quite appreciate the feasibility of this proposal. The team followed LEAN and Kanban techniques to achieve reliable deliverables and timelines, and in the end, they delivered 3 key milestones in the project's roadmap. They also outline the activities to be done and the target product for each of those timelines. Regarding the budget sheet, the team gives the estimated expenses and the additional budget contingency plan, however, in my opinion, they should provide more details about the above expenses and the total budget required. About the people present in this project, the group has not given enough information about who the engineer, operator/manager is, and they are also in the process of looking for more people to accompany the group, which This will probably make the sponsors hesitate even though the group's proposal is quite good.", "q1r": 4, "q2": "I'm not sure that the team did a good job of accounting for this project. They talk only about incorporating project management best practices for milestone tracking, velocity assessment, and prediction, and focus heavily on using LEAN techniques but fail to deliver Clear quantitative indicators to track project progress. I think they should add this so that everyone can objectively evaluate the progress indicators of this project. When describing the success of the project, they will officially release the website and look for related information, all the bugs will be fixed in the code and the biggest target result will be users who will use the website This does Cardano NFT search engine. However, in order to strengthen the belief in the success of the project for everyone, especially the sponsors, the team should provide other proposals of the same project that have been funded, or are being called in this round.", "q2r": 2, "assessor": "z_assessor_4073", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14719, "q0": "\"The rise of NFTs leads to the demand for enhancing users’ experiences when interacting with NFTs. The search engine of this project provided a more in-detail, convenient way to search compared to the traditional engine i.e., searching based on token policy ID and name. This search engine allowed searching the NFT/token metadata. \nIn terms of the risks, I do agree that the major risks (or challenges) when implementing this project are the performance, accuracy, and scalability of the search engine. The proposers addressed these problems by using some advanced algorithms. \n This application allows the users to easily find the NFTs that they are looking for; therefore, the platform of NFT may be more friendly to non-crypto user. This may increase the users joining Cardano ecosystem; thus, this solution may align with the challenge setting.\"", "q0r": 4, "q1": "\"The proposers implemented LEAN (e.g., Kanban) techniques to achieve reliable timelines. In terms of the roadmap, the proposers stated quite clearly the task process that need to be done, and the process was flexible based on the consumers’ feedbacks about their using experiences. To increase the feasibility of the project, it could be more fulfilling to the readers, if the proposers divide the milestone into smaller several sub-task processes, then attached due dates to them. The budget was provided. If possible, the proposers should provide the detail calculations for the budget. For example, the “infrastructure costs”, what does it take to cost $8,400?. Moreover, I would like to recommend the proposers allocated the money into the task processes to make the proposal clearer. \nIn terms of the human resources, since this was not a very huge project, the team members needed was small, and reasonable. These members were highly experienced individuals with strong backgrounds in IT. These backgrounds were in accordance with the project tasks; thus, the feasibility is assured. \"", "q1r": 4, "q2": "The success scenario was quite obvious: if the user can search easily for the NFTs they need, the project is successful. In terms of the measurements, specific metrics should be used; instead of vague terms. For example, the numbers of users for this search engine, the feedbacks of satisfactions of users, etc. Moreover, the proposers should include the measurement methods for the key metrics/KPIs. That would increase the auditability of the project, since the project is easier to follow.", "q2r": 2, "assessor": "z_assessor_4098", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14960, "q0": "Generally, there is one common inconvenience with the search engine of Cardano currently, which only affords searching for token ID and name, but not the characteristics of tokens. To solve this problem, the team brings about an application which provides the searching tool using metadata of the NFT. Personally, I think this idea is innovative and necessary to update the Cardano ecosystem. The information contained in this section is also sufficient and aligns with the challenge proposed. The proposer mentioned that multiple pieces of infrastructure would be combined to deliver a complete product, yet, I believe this part was not explained clearly. Beside Postgresql queries, they should give more detail about other techniques to ensure the full function of the platform. Moreover, a responsive, easy-to-use website for deep metadata search is promised to be developed, though the author does not explain how the team would create those characteristics. They should describe some common features such as: what categories and information the final website/application provides for the users, what further actions can users take after searching for a specific NFT, what features would attract new users efficiently,... To conclude, I believe this is a great idea for widening the Cardano ecosystem and potentially onboarding more members to the community, yet some criterias should be improved to draw a better imagination about the project for the Catalyst. Beside the content offered, the information presented is quite confusing and incomprehensive, since one paragraph is copied and pasted to answer 3 different questions included in this section. My suggestion is that he/she should rearrange that paragraph to bring about a clearer overview.", "q0r": 2, "q1": "A very detailed plan is offered in this section, which includes 3 milestones with key ambitions for each one. Overall, the final outcome would be conducted within the final quarter of 2022, with the first milestone being 90% done. Every function and feature that this application contains, as well as some further integration in the future are offered thoroughly within this roadmap, which I find very interesting and efficient. The mechanism to approach each target is also explained comprehensively and particularly. Furthermore, a budget breakdown is provided accordingly with the techniques required. Nevertheless, they should provide some information such as: the total working hour throughout the project, the salary required per hour, the total working hour per day/month,... in order to help the Catalyst easily assess the quality and process of work. Finally, a brief introduction about team members is also given with details on working experience. However, I believe they should describe more about name, education, previous achievements/project or an affiliate link (LinkedIn, Twitter, CV,...) to present background information for a better assessment of their capability.", "q1r": 3, "q2": "In this section, the author answered properly how they are going to keep track of the progress, and stated some reasonable success measures, yet I believe that it is still insufficient. Particularly, they should give some specific KPIs, such as: the expected number of users in the first month/year of operation, the number of searching activities performed daily, the quality of users’ feedback,... These aspects would help them a lot in evaluating the success and improving the platform. Moreover, some sustainable development goals should be settled and followed to ensure the long-term growth of this application and show the Catalyst what their future visions are.", "q2r": 2, "assessor": "z_assessor_4118", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We will develop an app to search metadata in the Cardano blockchain utilizing Cardano-node, Cardano db-sync, PostgreSQL, IPFS, and web tech.", "experience": "Our team consists of 2 team members with around 25 years each of IT infrastructure and application development expertise. We have run Cardano since early 2020 in the beginning of the ITN running the BBHMM stake pool.\n*Looking for at least one more developer. Join our team"}