{"id": 414440, "author": "sessionizill", "title": "Project Catalyst... for Musicians", "url": "https://cardano.ideascale.com/a/dtd/414440-48088", "category": 26595, "amount": 30400, "description": "Musicians need money to make music; the most talented sign the rights to their art away to major labels. Large SPOs are a centralizing force; smaller ones struggle to win delegators.", "f6_no_assessments": 6, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 2000, "q0": "The main objective of this proposal is to help musicians financially. For this, the idea is to integrate the music incubator in Cardano and, in addition, to create an SPO that would work as a “pool of pools”, to finance the artists.\n\nThere are two main problems observed in this project. The first revolves around musicians, as they often lose money to major labels and/or are struggling to get some funding to stay in the music business. The second problem envisioned refers to the idea that small SPOs are fighting for crumbs while large SPOs exist. Therefore, the idea of creating this Music Incubator integrated with the Pool of Pools aims to solve, in a way, these two problems – musician would be financed and the reward of the larger pool would be distributed among the smaller pools.\n\nThis directly aligns with the challenge at hand because: a) they are bringing in people who might not be interested and would not look into the blockchain ecosystem, and by running this project on Cardano, this new community will interact directly with the ADA; and b) it solves a real-world problem using the Cardano blockchain, potentially increasing blockchain utilization and visibility.\n\nThe metrics and goals of the idea also correlate with the challenge, as they measure the growth of the project and they, indirectly (some metrics) and directly (others), align with those of the goal. Ultimately, it will increase Cardano's integration with the real world and increase the volume of transactions within it.\n\nAs the MVP gets ready, the project starts rolling and the marketing starts to work its magic, it's entirely possible for the project to scale and reach many musicians from all over the world. Furthermore, because music moves many people, it is plausible to think that small SPOs will also join for two reasons: 1) support for artists of their choice; and 2) the possibility of increasing your rewards (even those exclusive to the assisted artists).\n", "q0r": 5, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: Unfortunately, there wasn't a good detailing of the plan itself. Firstly, the homesite was not provided, which I believe should have more information and, in addition, it was said that it would probably already be available. Perhaps the most elaborate plan, containing the steps to be taken within this project, with a vision of the future, is integrated with the requested budget. However, even checking the two parts together, there is still a need to explain further the allocation of resources and the steps taken. I understand that the development and marketing teams are outsourced and, perhaps for this reason, there are not so many details (neither financial nor procedural). However, to facilitate project feasibility, whether it is this specific project or the specific projects you have asked to deliver, there should be a sequence of events, with deadlines and checkpoints. For example, the first budget listed is for the voting tool, however, there is no deadline for execution, there are no checkpoints, there is not much to work on here. Therefore, I miss more detailed information for the execution of the project.\nDespite knowing that teams are specialized and that individual tasks will be performed, it is necessary to have an idea of the steps so that we can verify the total feasibility, verify that everything will fit together.\n\n2 – budget: Same thing for the budget. Are these values for hours only? Did you hire a closed package or will you have to pay some tool, monthly fee, etc? It would be interesting to have more detail on this part.\n\n3 – team: The teams that are working together have a lot of experience in what they do, being well known. So there's no need to worry about deliveries.\n\n4 – risk management: There are some risks listed by the proposer, however, mitigation actions were not listed (not directly). Obviously, the risk of getting musicians can be reduced with the marketing team, strategizing to talk to the musicians and attract them to the project.\nAnother listed risk that raises some concern is the feasibility of the Pool of pools project (stakingDAO Project), which can directly influence the future development of this idea. It is necessary to join forces for the final execution of both projects for the benefit of blockchain (once it manages to flow with musicians and delegations in its pool, it can generate funding to assist in the completion of the project).\n\n5 – self-funding/scalability: The project, if successful, is able to sustain itself and, if the marketing strategy is correct, it will be able to scale both to the musicians and to the delegates.\n", "q1r": 3, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: As mentioned earlier, because there is not enough information for the roadmap and, with it, there is also no division of smaller tasks that have defined deadlines to assist in the verification, it makes it difficult to audit the project. That is, to allow everyone to follow the development of the project, it is necessary that there is an increase in the total detail of the project development phases.\n\n2 – Metrics and KPI: The added metrics and KPI are excellent for tracking the development of the project and, if they are on the wrong path, it will be possible to take action to circumvent this situation.\n\n3 – Channel: It was not provided an own channel to share information (although it was said that there is a channel – I was not able to find it).\n\n", "q2r": 2, "assessor": "z_assessor_2298", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3981, "q0": "In my understanding of the proposal, the goal is to create and implement a Music incubator, a Project Catalyst of musicians and lovers of music. It is planned to act on a Stakepool-network foundation, where the people staking help decide on what artist that will get funded by voting. As an active musician and a Cardano enthusiast, the idea of a decentralized music incubator is very exciting. In my experience as a recurring PA since fund 6. I have yet to see such a unique proposal that addresses the music industry in this way, especially since it also involves SPOs. The discussion on how the music industry doesn’t allow artists to profit properly, nor have the freedom of being their own creator has been a very prominent reality for a long time, that is why I believe projects such as this is very important. Most similar projects are focused on NFTs and music royalties, which is why this proposal stand out a bit, instead focusing on new artists realizing their creativity into reality. The idea of putting the decisions in the hands of the music enthusiasts via the SPO-idea crosses the border of pure blockchain tech and arts in a natural way, and could act as a stepping stone for people not experienced with Blockchain tech or Cardano. (And thus increasing the number of participants in the Cardano ecosystem). \n\nBut what exactly does the delegates get? Will it be some kind of NFTs from the artists they choose to support, or something else? This is information I would like to have seen included in the proposal, at least a thesis or suggestion on it. (Even if that decision is up to the artists). \n\nDue to the reasons stated above, I believe that there is incredible value in trying to prove this business model, both for the music industry and for the Cardano Ecosystem. I agree that this proposal effectively addresses the challenge. ", "q0r": 4, "q1": "First off, the proposer has experience of submitting in Catalyst since several funds back (6), and being funded for one of them. The proposer states within the proposal that they (most likely) will not need to return for further funding, since they plan to be self-sufficient as soon as possible. \u2028\u2028The proposer states that the official project and website is up and running by the time of reading the proposal, but this is sadly not referenced anywhere. Considering that the website is where they’ll post valuable information like a list of the funded artists, it would be very nice to see the website (and preferably social media channels) in the proposal. \nBy reading the proposal we know what the proposer wants to achieve, but it would be beneficial if the proposal included a proper roadmap (with included milestones) set on a timeframe. This way it would be easier to estimate the amount of work that is being done, and when we can expect new functionality and other updates, etc. \n\nCollaborating on this proposal is several known actors within the Cardano ecosystem. AIM has improved the workflow and mindset of numerous Catalyst members (including myself, I’m using the PA-tool right now). Also onboarding the StakingDAO project is a very smart idea, from Rhys’s experiences with decentralized staking and running small SPO-networks. They also mention to have included a popular youtuber, but this is harder to verify the impact on, since youtube influencers are affected by so many different aspects. All of these are linked to in the proposal, so it is easy to verify their existence and previous work. \u2028Regarding the lead proposer, there are some information missing that I would’ve liked to see included. If we had the official website included in the proposal, there would probably be information there but that is out of our reach, as of now. I would have loved to see the expertise validated by some LinkedIn-profiles or social media channels, or references to earlier work related to the areas needed for the completion of this project. \n\nThe total budget requested is 30 400, which seems quite reasonable for starting a project like this. In the budget breakdown provided we can see that almost a third of it will go to AIM and the development of their voting tool, for example. Most funds will go to hired consultants, developers or the initial funding for the musicians. A suggestion could be to include an estimation of the work hours for each responsibility area or person, in order to assess the workload of the proposal, especially if we would also be provided with an estimated timeframe of each milestone. \u2028\u2028Even though this information is missing and I would’ve liked to see it included, the project is stated to be already live as of writing this, which means it is already implemented in its initial phase. This cannot be verified by the information contained in the proposal, which is a shame. Therefore, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 3, "q2": "The KPIs intended for this proposal is spot on, and highly relevant in order to measure the success of implementation. Number of delegators, number of artists, number of value distributed, number of single SPOs, etc. The proposer states that all of these numbers will be published on the official website. As stated under feasibility, it would be wonderful to have that website included in the proposal, since it cannot be verified as of now. Transparency is super important, and the proposal would benefit greatly by allowing the community to give feedback on a variety of channels (social media, official website, etc). Also, if the proposal would include timeframes in conjunction with the milestones, the community would be able to follow the progress of the development, step by step. Due to the lack of verifiable information included in the proposal, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_2504", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1455, "q0": "Session Cruz, through his well conceived Fund 8 proposal, took a giant step along the path of mass adoption to revolutionize blockchain and it’s relationship to musicians. DEMU is the kind of innovative, inclusive and self sovereign platform that led Champ Medici to bring his father, Snoop Dogg, to the Cardano community. In actuality, it was Clay Nation that struck the deal with Snoop, but it is exactly this type of forward thinking that brings high caliber artists to our community. In the latest iteration of DEMU, Cruz requests funding for a self governing stake pool community of artists within the DEMU umbrella. The design entails creating a “pool of pools” whereby individual artists can be supported by their own stake pool, but can receive rewards more commonly associated with large pools by amalgamating resources into a host pool that contains all of the smaller individual pools associated with each specific artist. The impact of this project adroitly aligns with strategic goals and challenge criteria of driving adoption, innovation, onboarding, tool creation and decentralization.", "q0r": 5, "q1": "After successfully proposing DEMU and awarded funding, the team is now collaborating with Rhys Morgan of Stoic Pool and Phil K of the legendary AIM project. Shout out to AIM, I use their tools almost every day! A highly visible, influential and respected member of the community, Session Cruz has assembled an even stronger team to execute on this expansion of the original proposal. The likelihood of success leading to accelerated adoption is quite high. The music created on this platform may even get you higher.", "q1r": 5, "q2": "Incremental progress leading to successful project completion and implementation, can easily be tracked by well crafted KPIs. The following measurable metrics are indicated in this proposal; number of staked delegators, number artists onboarded, number of individual stake pools operating under the umbrella pool, total revenue disbursed to artists and total funds raised for each and every stake pool. These highly measurable metrics ensure transparency and full accountability. Rounding out the verification process are metrics designed to follow delegation, exposure, music creation, record label involvement and more. ", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 1610, "q0": "Speaking of impact, the proposal is very much in line with what the challenge seeks, as it would develop 1) a marketplace that would increase the number of transactions carried out on Cardano (in this case, it would not be a traditional market, but a system for investing in artists in that each musical project would be a kind of proposal to be financed, where small SPOs would act, so indirectly it is a marketplace). 2) the project will be able to develop a valuable Dapp, which would increase community engagement and help to enrich the ecosystem with a new use case, which would be precisely the sponsorship of musical artists. The idea, in general, is to allow fans and people interested in music to support the career of artists through financial collection. The music incubator would go main in the Stake Pool model where each pool would finance an artist, as I understand it; it is very interesting that the proponent has made a parallel with Catalyst itself, in which projects are first presented to the community, evaluated and then voted for funding. Photos would be delegated to Pool operators, and artists would reward them with exclusive items, such as music NFTs (it's not really clear whether the NFT would be an artwork, a song, an album cover, or fan articles at all). ). With this, the proponent intends that “all artists can become their own record labels and their own participation groups, and their fans can delegate to them. In return, delegating fans can select artists that are financed by the label.” I thought the idea was very good, as it would allow new artists to be able to produce content without necessarily being linked to a traditional label - we know how bureaucratic this market is and also how high the percentages in the profit sharing of the labels are, so that artists not have such a high return. This can generate new opportunities for them, but without a doubt also a project that can bring many benefits to Cardano, because: firstly, the number of transactions being minted on our blockchain would increase, while NFTs would be minted, probably the payments for artists it would be done via smart contracts, new Pools would be created, generally it would increase the circulation of Ada; 2) the idea could be a great attraction for new members to join our ecosystem, as people would be attracted to the music and the new modality of support for independent artists. We would not necessarily attract an audience that already belongs to the cryptographic world. However, some explanations were lacking to better clarify how this relationship would take place between these new people, who would be arriving in the community and getting to know Cardano's technologies: how would they learn to create digital wallets, Ada delegates to support their favorite artists? Apart from this more pragmatic issue, the proposal is very interesting and in line with the challenge.", "q0r": 5, "q1": "Regarding the script, unfortunately there is a big gap of information that should be said. It would be necessary for us to know the phases of the project's development, what would happen in each of them, which activities would be proposed for each and details on how they would be developed. How would the interface be created? First, we would need to know more about the work of the developers, what their routines would be like, the partial results expected for each month, how long the site would be in full operation (it is said that it would already be launched when the proposal was published, but I would like to know how long it would be operating at 100%. It would also be necessary to understand how the bridge with the musicians would be established, how they would understand what would be done here, how they would come to understand about blockchain and its technologies and how they would benefit from the project. We would also need to know details about how the project would be publicized, how it would be marketed, how the general public would be aware of the platform and could support the artists, etc. That is, we would need to be able to understand how the development process would take place from the moment of an initial meeting until when the product was completely finished. It is also not satisfactorily explained about financing, as we know some information about how it would be distributed, but it is not possible to understand in detail how the money would be used. For example, 10 thousand dollars would be destined to pay the Cardano AIM team, but we don't know how many professionals would be involved in the project, if they would all be on the team (I believe this team is composed of 3 people), or if only some of them, for example 2, would participate in the project. It would be necessary for us to know how the distribution of that 10 thousand dollars would be - how many developers would work for how long and etc. The other parts of the expenses should also be better explained - what the work of this professional would be like, how many hours would he dedicate to the project; how the initial funding for musicians would be distributed (the amount of 5000 dollars would be distributed to how many people?); the other 5000 that would be earmarked for additional costs, if not needed, would it be redistributed in what way? Finally, speaking of the team, the proponent states that “we have identified the three main parts of our Music Incubator MVP. The artist proposal website, this “Pool of Pools” concept and the voting tool. For those three things, I got in touch with members of the Cardano community who are already building these tools, to implement them in this DEMU Incubator idea.” Therefore, the Cardano AIM team would be hired; Rhys Morgan and Michal Malewicz. In my view, despite being experienced people, apparently, it would be more appropriate for them to be presented more fully, for us to know more about their CVs, which tools they have developed so far (an example is given for Cardano AIM, but what about the others?) . For these reasons, feasibility is not bad, but it also has several aspects to improve.\nRegarding the script, unfortunately there is a big gap of information that should be said. It would be necessary for us to know the phases of the project's development, what would happen in each of them, which activities would be proposed for each and details on how they would be developed. How would the interface be created? First, we would need to know more about the work of the developers, what their routines would be like, the partial results expected for each month, how long the site would be in full operation (it is said that it would already be launched when the proposal was published, but I would like to know how long it would be operating at 100%. It would also be necessary to understand how the bridge with the musicians would be established, how they would understand what would be done here, how they would come to understand about blockchain and its technologies and how they would benefit from the project. We would also need to know details about how the project would be publicized, how it would be marketed, how the general public would be aware of the platform and could support the artists, etc. That is, we would need to be able to understand how the development process would take place from the moment of an initial meeting until when the product was completely finished. It is also not satisfactorily explained about financing, as we know some information about how it would be distributed, but it is not possible to understand in detail how the money would be used. For example, 10 thousand dollars would be destined to pay the Cardano AIM team, but we don't know how many professionals would be involved in the project, if they would all be on the team (I believe this team is composed of 3 people), or if only some of them, for example 2, would participate in the project. It would be necessary for us to know how the distribution of that 10 thousand dollars would be - how many developers would work for how long and etc. The other parts of the expenses should also be better explained - what the work of this professional would be like, how many hours would he dedicate to the project; how the initial funding for musicians would be distributed (the amount of 5000 dollars would be distributed to how many people?); the other 5000 that would be earmarked for additional costs, if not needed, would it be redistributed in what way? Finally, speaking of the team, the proponent states that “we have identified the three main parts of our Music Incubator MVP. The artist proposal website, this “Pool of Pools” concept and the voting tool. For those three things, I got in touch with members of the Cardano community who are already building these tools, to implement them in this DEMU Incubator idea.” Therefore, the Cardano AIM team would be hired; Rhys Morgan and Michal Malewicz. In my view, despite being experienced people, apparently, it would be more appropriate for them to be presented more fully, for us to know more about their CVs, which tools they have developed so far (an example is given for Cardano AIM, but what about the others?) . For these reasons, feasibility is not bad, but it also has several aspects to improve.", "q1r": 3, "q2": "Finally, in relation to the follow-up of the proposal, the proposer provides us with some relevant information about the partial results, but it is very difficult for us to measure progress without a pre-established roadmap. It would be necessary, first of all, for us to know exactly what would be done and who at what point in the timeline (activities X, Y and Z for the first month, for example); as well as details on how they would be done and who would be responsible for them. That way, we would have tangible material to be audited, to understand if what was planned was being fulfilled. As the proposal is presented, unfortunately it is not possible to audit progress, only partial successes, which would be perceived by metrics such as “more delegation to small SPOs, more exposure for new artists and direct financial support for them, easier access to new music and less gatekeeping for listeners, more labels represented in Cardano and greater decentralization of Cardano”. In reality, we were also unable to have such a good understanding of the success scenario based on what we are told, since it is not clear how such information would be analyzed by the proponents and presented to the Cardano community. We would need to know how these metrics would be analyzed and how they could be presented in a verifiable way to our community. It would be necessary for the proponent to carry out a direct survey with users of the platform, in order to understand how they would be entering the blockchain world, how they would be adopting the technologies relevant to Cardano and also how they would, in fact, be becoming members. assets of our community. It would be necessary to understand further about how the artists who would be financed would be developing, if in fact their goals would have been achieved through this project, as well as the general public, how they would be using technologies such as NFTs and etc; how they would be making use of the technologies of our ecosystem. In general, in my view, auditability is not so adequate, both because we don't know how the progress could be measured (we don't have a roadmap, this would need to be defined and it would also be necessary for there to be monthly reports, updating our community on advances); we have a certain understanding of the final successes, but not to the point where we can be sure that the context will be well studied and presented to our community. Therefore, in my view, these improvements should be implemented so that we actually have a safe way to monitor the proposal, under different aspects.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "This assessment feels very nitpicky overall.  Furthermore, the assessor repeats themselves to extend the length of the assessment and make it appear like a viable assessment. It's repetitive. The information this assessor is requiring for in their Feasibility assessment is overkill.  It's pretty simple and straight forward. We build a website that communicates our intention to distribute the money generated by stake pool operation, to fund artists. We do not need to spell out how \"an interface will be created\". We hired a notable UI/UX designer who has worked with huge projects in the past. That should be that. To be forced to divulge the \"the routines\" of my developers who are simply building a website front end, means that the assessor doesn't even really understand what is required.  We're building a website, not a protocol. This level of detail requested is overkill. Assessor asks for an inventory of \"who on the AIM team\", when mentioning the team should be enough. The audibility section is more nitpicking. Anyone can easily audit the success of the project based on publicly-available metrics... metrics that anyone who knows how to use Pool.PM could see. We're already putting those metrics front and center on our website. Which we've detailed in the proposal. Overall, this person was digging very deeply to find things to criticize. "}, {"id": 6000, "q0": "The proposed idea is great and adds value to the Cardano ecosystem. I am a music lover and would like to contribute constructive ideas to the music industry and I find value in this proposal. This proposal helps me do that through votes from SPO staking. This creates value for those who delegate to the SPO team. The block rewards generated by the pool closing the block will be deducted to fund artists through votes. This will be the motivation for artists to promote their creativity to create quality products. This can also be seen as a case of bringing blockchain to life. This increases the utility and adoption of Cardano to the community. And so the proposal fulfills the objectives presented by this challenge.", "q0r": 5, "q1": "In general, I agree with the feasibility of the project, but there are a few points that I would like to add my opinion to help the project increase the probability of success. We have a plan of the work that will need to be done but I think we can specify this plan through the implementation timeline. That is, what work will be done at what time, will be carried out for how long.\nOther than that, I'm quite satisfied with the budget breakdown that the proposer provides. Clearly show each cost for each job. There are marketing costs to attract more users to join the authorization into the Pool. Project members have the necessary experience to carry out this project. And I think the project will have a high probability of being implemented successfully.\nI rate this section 5 points.", "q1r": 5, "q2": "The audit of the project is generally quite easy to do. The amount of ADA authorized to the stake pool or the amount raised for each SPO will be checked through websites like pooltool.io. The number of artists receiving sponsorship as well as the amount distributed to the artists will be updated through the project's website => very transparent.\nInformation about members is easy to check and easy to follow through the evidence provided by the proposer.\nI think a bright future for the project is to create a lot of SPOs, making the Cardano network more decentralized. At the same time, the music scene is more developed.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6798, "q0": "The proposer describes the project as an incubator for musicians and artist. I however find it difficult to understand and attach much relevance of the idea to the challenge category. The proposal further describe the solution as building a music incubator on Cardano  which will be funded by coalition of single stakepool operators. The proposal in my understanding is a DAO in it's basic terms, however the problem statement and the intended solution is sounding vague to me and does not objectively articulate any core unique contribution to Cardano, the intended stake pool operators as well as the challenge category/criteria. The proposer further articulates further that the mission of the project is to have every record label run a stakepool which however contradicts the previously stated mission of it been a music incubator. I will interprete the intention of the proposer to be a project that intentds to bring together different single stakepool operators to share a common mission of supporting artists and record labels and if that explains the proposers intention, then i will strictly classify the project as a DAO and thus does not effectively address the problems in these challenge category.", "q0r": 2, "q1": "The proposer passively provided some information outlining how the project is planned to be implemented. The information provided talks basically about setting up a stake pool and inviting other stake pool operators to join the project where they will collectively fund artists proposals that is voted by their community and in my understanding, that is clearly a DAO. The proposer does not identify any major DApp development or integration to be involved in the project. The only technical aspect of the project is setting up a stakepool which i believe is a regular housekeeping that most or any Core Cardano community member has knowledge of setting up.\n\nThe requested budget amount is relatively high and most items in the proposal does not really define what is relevant to the proposed idea for example items like Develop voting tools + artist proposal and voting mechanic: $10k. Now what voting tool are we building (A DApp or just an internet plugin) also what does artist proposal mean? (I suppose artist should take care of providing their proposals). Some items are repeated in the proposal among many other inconsistencies. Information about team (though provided) is not satisfactory as the proposer respectively provides links and names of people building some other related projects which i do not think we can rely on them as core team behind the project.", "q1r": 3, "q2": "The the proposer provided some more metrics added with the roadmap and milestones previously outlined, we can manage to some extent audit the project. The success of the project is however dependent on some factors which include more delegation for small stakepools, more exposure for new artists among others. In a more wider outlook these information will not sufficiently be enough to audit the project but can work for a limited scope of the project.", "q2r": 3, "assessor": "z_assessor_2831", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This is not a DAO. Nowhere in the proposal does it say that we are a DAO.  Assessor doesn't seem to understand that you can have extended goals beyond the core mission of being a Music Incubator. And this extended goal is to get record labels to spin up their own stake pools. \n\nAssessor contradicts themselves by rating feasibility low and then talks about how our approach is \"regular housekeeping\", which should actually then make the project MORE feasible.  They dismiss the team that is building the project, which is odd. \n\nThe assessor explains how easy it is to track stake pool delegation, and exposure to new artist... yet that's not suffiecient to audit the project? Yet doesn't offer any ideas for how to better make it auditable. My assumption is that there are none better than the metrics we are already tracking to measure success. "}], "solution": "DEMU ‘Inc’ is a Cardano-based incubator that funds music projects. We will build a developing network of single SPOs to support smaller pool operators and the further decentralization of Cardano.", "experience": "I've worked in music for 20 yrs+, as an indy artist, then w/ major labels (Universal, Sony, etc) b4 working for Kanye's Yeezy. Founded DEMU, a music protocol being built on Cardano to automate music royalty payments. We've assembled a team of 10 core members & 15 contributors."}