{"id": 414760, "author": "walton.sam.art", "title": "TREASURE CHAIN - An NFT Art Network", "url": "https://cardano.ideascale.com/a/dtd/414760-48088", "category": 26595, "amount": 50000, "description": "Cardano needs games that are timeless, adaptable, customizable, and collaborative. Most games now have limited game play and have a specific art style that does not appeal to a wide audience.", "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 8302, "q0": "From my first look at this section of the proposal, I believe that the proposer has managed to deliver a precise description of the blockchain gaming situation, stating that the current games still lack finesse in gameplay and essential elements to make themselves stand out from the crowd, resulting in a temporary rise in fame. Therefore, this proposal wishes to bring forth a game that will avoid all said shortcomings, while aiming to deliver more freedom and features for artists and gamers alike to explore and exploit. The proposer has listed out 3 factors that are contributing to the current success of NFTs and also claims that the game they make will be able to consist of all 3, which is quite ambitious to me. I’m also excited that this game will boast full freedom for artists to collaborate, create and trade their artwork, and all transactions will be made in ADA, which should benefit Cardano as a whole. In theory, applying the foundation of Stephen Wolfram cellular automata and the Wolfram Physics project along with the five mentioned rules to the game should end up in a world of vast content for users and players to interact with, a scenario in favor of Cardano. \nThe proposal also brings up a main obstacle for the foreseeable future of the project, which is the creation of this game, as most of the information above is only concept. To quote the proposal, this project consists of “the game itself, a multi-user host server, IPFS file storage, and blockchain smart contract integration”, which are a lot to ask for. The proposer also announces that the programming of the game is not their expertise, so they would need to enlist the help of professional Cardano members. Perhaps the proposer should already have a plan of recruitment in motion, as they are yet to have a proof of concept to back up, either. Should they succeed in bringing in good personnel on board, they also promise to ensure that the game is risk-free before rolling out to the public, which is a wise move for a game developer.\nOne more thing I’d like to add is that this proposal is missing a few important elements to back up their chances of getting an approval, such as practical case studies, key metrics or KPIs depicting current achievements or successes, estimations of an user base or the revenue that players and artists can expect to gain from the game.", "q0r": 3, "q1": "As for this section of the proposal, the proposer has listed out time frames for their two year’s span of completing the game, which closely line up with what the proposer sets out to have for the game in the Impact section, with milestones for each time frame as well. However, I would love to have more details on what exactly would be taking place at each stage, and the results that the team hopes to obtain.\nApparently, the funded money will be equally divided to pay the team members, so I have no quarrel with that. However, I notice that the proposal hasn’t included the work, duties and responsibilities cut out for each member, so I suggest that the proposer add that set of information for further clarity. The members involved in this project are all enclosed with past experiences justifying their expertise and LinkedIn profiles for a closer look, which is very welcoming. But I believe there is misinformation or a mistake in the proposal, since the budget will be allocated to 5 members, but I can only see 4 members listed in this section, who are Samuel R. Walton, Deryck Lance, Dominick Garey and Derrick Oatway. Therefore, I strongly urge the proposer to clarify this.", "q1r": 3, "q2": "Since this project is mostly a concept at the time of this assessment, It’s understandable that the project hasn’t had a dedicated roadmap yet, as the one in the Feasibility section is still rather brief, so that’s another thing that the proposer needs to work on. That being said, I love the fact that the new roadmap will be publicly available and accessible on the Treasure Chain website, and updates to the project will be posted on social media for tracking convenience. The envisioned success does fit with the desired outcome of the project, to adopt massive numbers of users and become a thriving ecosystem for artists, creators, collectors and gamers to have the privilege and liberty to enrich themselves, and ultimately enrich Cardano itself. Personally, I would want to have some form of visual evidence or KPIs to determine more carefully, but then again, this project is still in its early phases.", "q2r": 3, "assessor": "z_assessor_2974", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8321, "q0": "Gaming is something that could draw people’s attentiom and engagement. Therefore, this proposal suggested a game which is different from the old ones existing on the blockchain and how it would bring more excitement to the audiences.This proposal pointed out that existing game on the blockchain is just known to those joining the crypto space and there should be games that can attract users to willingly use crypto and gradually become a part of all events happening around it. Games should exploit more strong points of what has to offer on the blockchain system. In fact, it listed three things that NFTs possess that could bring more funtions and experiences to users and this proposal suggested a game that can combine those three factors to bring a more interesting gaming experience to users and from that can encourage more people to join the blockchain. It clearly explained how this game incoporated NFTs to make the game more appelling to users. This game is a NFT artnetwork and users can create their own artworl. This is not only just a game but it is also a social media plaftform for users to make a profit from their own creations and contribution. This is what the challenge is looking for, a solution that can improve users experiences giving them the freedom to enjoy and immerse themselves into the game but still being able to make a income from that. However, it would be better if the proposal analyzed more of why this project should be built on the Cardano ecosystem instead of other blockchain platforms. The description, the characterictics and the rule of the game was mentioned quite great. Having said that, it should include more detail about how game users make a transaction in ADA when playing the game. A description of the some challenges of this project seems to be general and not explained in great detail but a plus point here is that there is a plan of how to overcome every challenge along the way.", "q0r": 4, "q1": "The plan should include more descriptions of what will take place at each stage. Now, everything is not so clear for people to see what will happen at a certain period of time. The plan is for until 2024 but in the next last four months of 2022, it is still vague of how the project will be operated. It should include what should be done in the near future and how something should be done to make sure that the project would be proceeded on time. About the cost breakdown, it mentioned the cost for hiring some member needed for the project, and all the requested funding would be spent for these people. However, it should mention other costs when proceeding this project will take and how it mange those cost as well withoutt funding. Regarding the human resources of this project, it did not include so much information related to the background and the related experiences of staffs. There was just some basic information and the linkedin, twitter and instagram link. Another concern for this proposal is that some people working for this project also have other projects to handle so  the process of the project may be affected because of the overload workload for members to do. In conclusion, there is no concrete evidence to 100% conclude that this project would be feasible apart from the idea of the project is quite good.", "q1r": 3, "q2": "The proposal did not mention a clear way of how this project would be tracked and traced. It should include information on KPIs for each stage of the project, which could be used to evaluate whether the project is still in progress or not. Similarly, more specific figures should be added to evaluate the success of the project.", "q2r": 2, "assessor": "z_assessor_2975", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14577, "q0": "The problem described in this proposal is clarified well and closely aligned with the challenge. The proposed solution intends to build blockchain games that are timeless and appeal to users outside the crypto world and an art network where users can assign rules about how their NFTs can interact with each other. The Treasure Chain rules are attributes, adjacency (sự gần gũi), combination, completion, containment. These make it easy for the users to create  games such as collectibles, murals, portfolios, world building, treasure hunts, text threads, pokemon-type creature evolving, collaborative art, mood boards and more. Those help increase adoption to the Cardano ecosystem. The risk that can prevent the project from being successful is that the proposer does not know how to do much of this programming. To mitigate this difficulty, he has given the suitable solutions to tackle. He learns from the other brilliant ones in the Cardano community and he seems very confident to learn how to conduct the idea quickly.  There will be a test phase of allowing a small number of users to try it for a while before opening it up to a wider audience when there is a fully functional prototype. His mind is a long lasting product, which is a good point of his contribution to the successful project, I think. ", "q0r": 5, "q1": "First of all, the plan is built with a transparent timeline from the final quarter of 2022 to quarter 3 of 2024. The tasks are aligned to the proposed solution. However, the activities are listed quite vaguely. As I can understand, the items which are mentioned in each quarter are the results. However, there should be a clear explanation or more detailed activities in each stage of time. \nAbout the budget breakdown, the team aims to split up funding between multiple funds. There are 5 people participating in conducting the projects and the spending is calculated in the number of people. The total money the team needs for Fund 9 is $50,000. This is a reasonably calculating way. \nAbout details of the people who will work on the project, I highly appreciate the proposal that it provides the linkedin profiles of the workers. The experience of them is mentioned. However, it is better for the proposal to include additional information about their exact years of experience in somefield that is needed for the success of the project. This will help the voters see clearly about the talents and be easy to understand to assess and vote for the team. ", "q1r": 4, "q2": "There is no information about exact KPIs or measurements to track the project’s progress. What we have here is only the confirmation that there will be a public roadmap and updates to the Treasure Chain website and social media will be given monthly on what progress has been made. It is good that the team has given the way they show to the community the success or the results of each stage based on the roadmap. However, there is a lack of specific indicators, which makes it difficult for the people to evaluate the success of the project. \nAbout the success picture, the team expects Treasure Chain will have  thousands of users and will be a thriving ecosystem.  Artists will be able to fully support themselves through the platform. Creators, collectors and gamers will all coexist together and have formed huge networks of interconnected tiles. It will be a whole new artform of collaborative world building. Those are apparent illustrations about the success, which I highly appreciate. ", "q2r": 4, "assessor": "z_assessor_4073", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14753, "q0": "Proposers state that games in the Cardano community need timeless, adaptable, customizable, and collaborative and artistically creative to appeal to a wider audience. The solution that the team is aiming for is to create a Treasure Chain- an art network.\nProposal writers have presented their product functions and features or the main components and main activities of the project very specifically. The project includes a combination of factors that make NFTs successful. The solution section given in the proposal is extremely detailed and explains the technical aspects in-depth. The goal of the project is to attract more external audiences to participate in the Cardano community through games. This means a lot to the Cardano ecosystem and supports the goal of the challenge.\nHowever, the proposal still does not have the content stating how the Solution will address the challenge. In this part, the proposer will have to show the content to show what their project's results are and whether it is appropriate and in sync with the KPI/Key metrics of the challenge. And after the project is completed and communicated, what results will it achieve? This section should be clearly stated at each stage. This will help viewers accurately assess the project's goals and the project's impact on the Cardano community.\nIt seems that there are still many limitations in terms of human resources as well as technical aspects when implementing this project. But the proposer has also contemplated solutions to these difficulties to ensure the project implementation and achieve the expected goals.", "q0r": 4, "q1": "Proposal metioned information (evidence, witness, or link…) about the skills and experience needed to carry out the activities.\nProposers have laid out a basic roadmap with milestones to show the progress of the project and the results that the project will produce at the time of that roadmap or at that timeline. Proposers have also clearly identified the positions and number of people needed to carry out the proposed project. However, Proposal needs a realistic timeline to complete the tasks given in a reasonable manner. Proposal should show a reasonable plan not only for what they will accomplish, but also for how it should be and should have details on technical aspects such as architecture, language and technology needed to execute the plan. The more detailed this information will be, the more it will show that the plan that the team has set out is completely consistent with the goals that the project aims to achieve.\nThe same for the plan for using the budget should also be stated in more detail. Overall, the budget was in line with the plan. However, the budget should be presented in a clear breakdown and bullet points used for each activity. This will make it easier for viewers to comment on the project's spending plan.\nThe team consists of leaders with sufficient knowledge and experience in the field. This builds confidence that the project will be completed on schedule and achieve its goals.", "q1r": 3, "q2": "Proposal is still incomplete in the Auditability section. In order to finalize the proposal, the team needs to show clear quantitative indicators to track the project's progress. For example, the number of users, the time to complete which part - which activities, the number of traffic... These numbers are based on the timelines of the roadmap mentioned above. For each timeline, give specific numbers so that the community can rely on it and evaluate the success of the project in each phase.\nPictures of the project's success were mentioned in the proposal. Those are the results that the project will achieve when successful. Based on those results, the community can make an accurate judgment for the project when it is completed.", "q2r": 3, "assessor": "z_assessor_4099", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Treasure Chain is an art network where users can assign rules about how their NFTs can interact with each other. With these rule templates the NFTs can act like a giant neural network of art.", "experience": "I am a lifelong artist, animator, and inventor. Since getting into crypto in 2019 and learning about NFTs, I have began studying programming and learning the Godot game engine to create my own game. I have learned from my digital artist peers what kind of platform would be ideal."}