{"id": 414872, "author": "christianho", "title": "Startverse-Metaverse for Startups", "url": "https://cardano.ideascale.com/a/dtd/414872-48088", "category": 26595, "amount": 100000, "description": "Everyone has dreams of success and happiness, but they don't have money to build their dreams. STARTVERSE is a metaverse, where everyone can build their real startups with minimum spending.", "f6_no_assessments": 5, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7998, "q0": "The problem is that people don't have the money to build real startups. The intention is to build Startverse (a metaverse) on which people can build real startups with minimal spending. Metaverse gives the opportunity to people who want to create a startup but no capital, no knowledge and that if the startup fails you still have money left. The main problems are already included in the proposal (NFT game problems). To solve these problems, the creators of this proposal have opted for a unique concept, brand features, action to earn, free to play, high quality and technique. It has already been clearly described how this metaverse will be constructed. This will consist of 8 core elements. These are clearly written out. This proposal offers a solution to the requested problem statement. This project will have a positive impact on the Cardano ecosystem provided there is sufficient marketing to publicize this project. The proposal includes a roadmap that clearly states how the proposed solution addresses the challenge. The project will be carried out in 3 phases, each lasting 6 months. The risks that could prevent the project from succeeding have also been taken into account (long project, downward trend of the market, 3 projects in fund 9). The proposal is very transparent and gives a clear picture that this project can have a major impact.", "q0r": 5, "q1": "The proposal includes the people involved in this project. The entire team is well described on their website (https://startverse.io/#team). It would be useful to include relevance links in the proposal. The proposal contains a clear description of who is needed to make this project a success. The team has provided a document detailing what the funding will be used for. .The budget will be sufficient to partially finance the project. It is stated that financing will probably be required in the future. A realistic timetable is included. (about 2 years). Normally there will be enough time to finish this. It will be important that the market is in a positive flow. The proposal lists the resources needed to carry out the project (for money). The proposal clearly states what the technical aspects of startverse will be. It also states everything that will be present in the project. A clear study has been made of the risks that must be considered for the project to be successful. I am a supporter of this project. With sufficient financing, this can be a great success.", "q1r": 5, "q2": "There is a very clear road map with associated milestones. This roadmap is very comprehensive and offers a lot of transparency for the people. Parts of the project have already been completed. On the website of the project you can clearly see that a lot of hard work has been done. The website can also be used to report interim evaluations of the project. KPIs are clearly included to measure project success. It is good that short-term and long-term success are taken into account. I think it is certainly possible to have more than 100 000 fans on social media channels. It will be very important to conduct good marketing campaigns and to have cooperation with large communities. Startverse can certainly offer a solution for this requested problem.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8670, "q0": "The race to build Metaverse is becoming fierce because of the participation of technology giants, corporations are pouring all their enthusiasm and resources to develop a Metaverse that belongs to them, because they know that those who hold a stronger metaverse infrastructure will gain an advantage in the future. How to create the greatest competitive advantage for metaverse projects that do not come from big technology companies/groups when they have great advantages in terms of brand awareness, loyal customers/users? It's a sprint to growth, with diverse, unique, and genuinely outstanding features, borrowing the names of the big brands. I think it's a wise move for this proponent to call for funding and develop the project in Cardano's name. Despite the advantages of technology and resources, the interconnectedness between the metaverse and concepts like decentralization, NFTs, stablecoins is limiting the conversion of users for corporations, while it is a beneficial advantage of blockchains like Cardano because we have a user base that has a certain understanding of the above concepts and it is a good starting point for later user conversion. I believe, Cardano will not pass up any opportunity to build their own metaverse, including this project. So far, this project has had a clear outline of the concepts they will build into the metaverse, clearly describing salient features, and user engagement guides. Time is the biggest advantage and also the biggest risk in this project if anything delays the completion of the metaverse, so the proponent has also set out mitigation options for this problem. I think 2 years is the suitable amount of time to complete, to be able to reduce the risk of users getting impatient in the meantime, a proper marketing campaign, community building, user experience releases, etc can be an effective way to retain users. Luckily, I saw these options in their proposal presentation.", "q0r": 5, "q1": "Some pieces of work and demo have been completed before the funding call, which shows the ability to execute the project and can trust the team that developed this project. The plan table is presented in a very detailed and logical way, we can easily know when the listed works will be completed, the time for MVP and the official version release. In addition to the blueprint for the development of the metaverse's architectural base, the author also provides a roadmap for the development of ancillary work such as marketing, community building, etc. Because of the relatively heavy workload on this project, such splitting of the two planners will make it easier for the community to track the progress of the project. Estimates of budgets for activities, and documents are too general, they can not provide an overview of the work efforts, I encourage the author to provide additional estimates of the number of projects working hours to facilitate the audit work later. With a long-term and ambitious project like this one, it is necessary to expand the staff in the future. Although there are no clear descriptions for this plan, it is undeniable that the working capacity and the ability to execute the project well of the current main members of the project. Evidence of the results of previous well-done work, the link to the member's verification records, the commitment to professional competence and the ability to complete the project provided by the proponent are the best things to prove my conclusion.", "q1r": 5, "q2": "There is a roadmap for the audit clearly outlined here, the indicators given are ideal and appropriate for project development capacity and for success assessment. However, the long-term timeline for measurement should be estimated with a more specific number. It is not difficult for the community of people who love the project to track its progress, the author has provided two avenues for monitoring and managing the project including blog posts, social media updates (Twitter, Telegram, Facebook, Youtube, Tiktok...). For this project, the audit was completely easy.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9136, "q0": "\"I think the proposal has met the challenges presented very well with the interesting idea of creating a big world like the real world. The proposer clearly understands the current thorny issues such as startup dreams without eligibility and players having difficulty participating in the NFT game. They show how to handle these problems through the Startverse project in a clear and understandable way for the reader.\n\t Players in Startverse have the ability to build their own company or just want to generate extra income and can even join this project without fees. The team's idea is to create a world where everyone can do everything like go to work, eat, go to the gym, entertain, interact with others, and more.With this idea, participants can feel a second world that is not much different from the outside world.\n\tThe proposer gives a clear plan consisting of 3 phases and each stage takes 6 months with the tasks to be completed. When the project is completed, they will measure key metrics such as the number of active users, the NFTs exchanged, the brands that work with them, and the number of social media followers.\n\tWith such a large metaverse project, the completion time will be very long. The team plans to develop the team and cooperate with other companies to be able to complete this project in the best way.\n\"", "q0r": 5, "q1": "\"In the feasibility section, the proposer gives a specific, logical roadmap along with what is being done or completed and what will be achieved at that time. For the cost part, they detail the amount to be paid for each position in the first phase of the project in the attached excel folder which is quite complete. \nThe team behind this project also has a lot of experience in game project development which shows that this project has good development potential. I also have a small suggestion that the proponent can give more details about the remaining key people so that everyone can understand their responsibilities in the project.\n\"", "q1r": 5, "q2": "The proponent provides a lot of key metrics that will be published for the community to monitor the project. The team set two specific criteria, long-term and six-month, along with metrics to measure the success of the project. This part is good enough and I think if the team could add the specific timing of the items done in this section, it could help the proposal better", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14925, "q0": "\"With the requested funds, the team plans to hire more developers and artists and improve the marketing so that they can build a stronger team and attract new users to Metaverse/Startverse, a game free to play and earn. I believe this is a robust technical team due to the fact that the game has been developed on the website. As I enter the link provided in the solution section, I get to know literally everything about their game. For example, I learn about the features and activities users can do to earn in the game.\nIn the scope of this proposal, the solution they are trying to deliver is to release Marketplace and MVP where users can buy NFTs and start to play the game. This belongs to the 1st phase of the over-two-year project. Key metrics for the 1st phase are well-defined and they help me understand how the project is closely aligned with the challenge’s objective and how it can bring an impact on the adoption of Cardano blockchain. \nOne thing I suppose is missing is probably an explanation of technical aspects about two key products, including MVP on web and Marketplace to sell NFTs. In addition, while they have outlined some kind of challenges they are facing, I would expect them to describe some steps they are planning to take to tackle them well. \"", "q0r": 4, "q1": "\"In terms of feasibility, it is easy to assess since I have no difficulty understanding their roadmap and timeline. It is easy to know what they have done and what they have been in progress. \nSimilarly, it is easy to assess whether the requested budget is sensible. This is because detailed estimates and many other information about the budget spending for technical development can be monitored via a link. They have broken down the budget for the scope of this proposal - quarter 3, 2022. \nThe experience and expertise related to the core team members has been described as a paragraph which helps me understand how they are a good fit for a project in the game industry. \nHowever, it seems that something is missing. First, the number of members will be required. Secondly, regarding verification, there is no link to personal profiles for checking the information. \nThere are just a few suggestions for further improving the presentation of the roadmap and budget breakdown. Regarding the roadmap, since the focus is on quarter 3, 2022 which has two key deliverables (MVP on web and Marketplace to sell NFTs), the community probably would like to know what will be done in this particular phase, who is/will be in charge of the tasks, and when the tasks will be done.\nAs for the budget breakdown, for instance, since they have the need for hiring more developers and artists, they should specify how much they plan to spend on recruitment and since they plan to improve marketing activities, how much they plan to use for this purpose. \nOverall, I'd say I agree that they have the ability to fulfill the goals. \"", "q1r": 3, "q2": "\"With regard to auditability, I totally agree that there will be little difficulty performing audit exercises in the future. The team has been aware of transparency and provided the community with various ways of monitoring goals and progress. Further information will be updated and published on the team’s blog Startverse Global via Medium.com. Another method is publishing related files and documents. I just want to know how many blogs per week they plan to publish if possible. \nThe success they can deliver in the scope of this proposal is well-defined as KPIs such as in a 6-month period. All of them seem to directly relate to the objective, namely number of the active users in the game, number of NFTs made and sold, total followers in social channels, or number of brands they co-operates with.\"", "q2r": 5, "assessor": "z_assessor_4113", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 15352, "q0": "Everyone has dreams and ideals, but not everyone can realize their ambitions when financial problems do not allow them and there is no foundation on which they can rely. STARTVERSE is a metaverse that will make everyone's dreams come true, where people can build real startups with minimal spending and built from many factors. The proposal describes in detail, the specific solution to meet the goal of the challenge. The proposal is not only detailed but also very well explained. Besides, the proponent has set goals for the project, demonstrated the proposer's ability, and knows what he does and how to go to the success of the project. At the same time, the proponent also sets out possible risks in the project and has a positive solution for each risk. ", "q0r": 5, "q1": "Regarding the plan of the proposal, the proponent provided a link so that we can check the details of the roadmap and analyze the specific budget. At the same time, it also provides a breakdown of the roadmap of the work in progress, completed, and about to be carried out from Q4/2021 to Q2/2023. In addition, the proponent provides a roadmap of the strategic phases of the project through the three phases and specifically lists the work to be done in the project. A clear roadmap ensures the progress of the project development.\nIn terms of budget, the proposal asks for a $100,000 budget and an explanation of $104,000. There was a disagreement on the budget, but not too much (probably due to a typo when placing the proposal). However, the budget is allocated to each job and explained clearly but could be more detailed. Example: Customer Deployment: $33,000; Art made: $37,000. Because the value is quite large compared to the total budget required. We need more details to better understand the funding process.\nWe were provided with written introductions about the three team members. We know each member's name, skills, and professional experience. However, it would be nice to be able to provide links or social media pages of each member so that we can learn about each member and determine what was covered.\nThe overall project is good, however, budget and team members could add more details.", "q1r": 4, "q2": "The community will easily track the progress of this project based on the information that the proposal provides. The information about this project is completely transparent because the proponent provides their website https://startverse.io/ where the community can follow this project at any time. The proponent also provides us with metrics and publishes several methods and files for measuring project progress: Detailed estimates; Development documentation; Schedule of activities; Marketing calendar ... check on social networking sites, web\nIf the proposal is successful, it will facilitate the team's growth, improve operations, and attract new users to the group's metaverse. Here, long-term and six-month success indicators are established. In general, everything is suitable here. The team established very well what we need to track and what specific goals need to be achieved", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "In STARTVERSE, we allow worldwide people to do anything to earn(Actions to earn) and build their dream life, dream companies, meet their couple, hire friends to work for them, and earn real money.", "experience": "Our core members are all entrepreneurs with more than 10 years in the gaming industry with many Canadian, Korean, and Japanese clients. We also have a development team of over 20 developers, and a marketing agency with 5 core members to cover this project in the first phases"}