{"id": 414876, "author": "christianho", "title": "Startverse: Marketplace Portal", "url": "https://cardano.ideascale.com/a/dtd/414876-48088", "category": 26595, "amount": 50000, "description": "Everyone has dreams of success and happiness, but they don't have money to build their dreams. STARTVERSE is a metaverse, where everyone can build their real startups with minimum spending.", "f6_no_assessments": 8, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 4851, "q0": "I felt excited when reading through this proposal. The idea really interests me because it is the combination of Virtual reality, NFT and game in one product, namely Startverse, the first metaverse game for startups in the world. Startverse is created with the goal of resolving problems of current NFT games in market, helps users's dreams come true with minimum spending, increase the adoption of Cardano blockchain ecosystem. Well, in fact, to understand about Startverse, it takes me a little bit of time to read as there are some specific concepts about this game. I am impressed with how the proposer and his team prepare for this project before asking for fund, which as I know, not many proposal could do such as website built, Youtube video demo of the games, Powerpoint slideshow of their project, strong communities in social media... The proposer give a very detailed explannation of how Startverse resolve NFT games problems in terms of unique concept, branded features, action to earns, free to play, and high quality & tech, and price of NFTs. A special point about this game is that the price of NFT will be automatically calculated by their features and levels, if players want their NFTs to become more valuable, they need to spend time, spend effort in-game to upgrade their NFTs. Besides, every elements of their metaverse is explained clearly including country chains, seasons, maps, games, marketplace, multiple NFTs system, co-op Infra, and social features for community so they have a better visualization of the game idea. Within the scope of Phrase 1 of business strategy, the proposer will focus on developing a marketplace portal that allows users to exchange NFTs, Stake token to earn benefit. However, I would like the proposer to explain a little more about the question \"How their proposed solution will address the Challenge that you have submitted it in\", which is not clearly explained by the proposer. But in my opinion, this proposal is suitable for the challenge as it will bring many positive impact to players, starts-up, the NFT markets; one more NFT interesting game is created for starts-up, as a result, increase the adoption of Cardano blockchain. Besides, the proposer also mentions about some risks related to market downtrend and situation when all their 3 projects funded at the same time which puts pressure personnels for project running. In short, I would like to give this proposal full mark for the details it conveys and personally, this is a very good proposal.", "q0r": 5, "q1": "Well, in general, this feasibility of this proposal is okay, but some parts need to be more detailed. Through their plan script and provided link, I understand that the proposer has a vision of developing this project since Q4 2021 to Q2 2023, it means some works finished, and some works is being done. However, I am very impressed for the detail of works it conveys. First, the proposer provides a general roadmap with flow of work for each quarter so that community could have a general idea of the whole picture of the project. Then, within the scope of this proposal, the author provides a detailed implementation plan for each task for 3 month (Q3/2022) in regarding to product development, documentation & quality management, and project management. Speaking of budget, via their provided Excel spreadsheet link and proposal script, I'm more surprised of how professional the team is in calculating the project' expense, leaving nothing for any more comments. The cost for each task is based on how much effort they could put on (based on man-day, man-month). From that, we could calculate the exact cost for each item. I think this is a very smart way of calculating the cost. Now, move to personnel part, I felt a bit sorry that the proposer said \"you can check the info in the attached file below\", but forgets to give the file link that I think it is proposer's mistake as they're newbie in raising funding in Cardano. Therefore, I could only based on the introduction script, there are only 3 main people mentioned, they are all very talented with over 10 years of experience in developing games, AI, software development in well-know companies, mobile apps,...which shows their ability and rich experience in delivering the first phrase of this proposal and keep moving further in the future. If the proposer could pay more attention to the presentation, I think, their proposal would be more perfect. After all, I think I could not give them full mark for this part with all above analysis. ", "q1r": 4, "q2": "The proposer gives a variety of methods in which community could follow the development of the project. Community could check their website Startverse.io as they will publish their works regularly in their blog section. Besides, the team has a very active communication channels such as Twitter, Telegram, Facebook, Youtube, Tiktok,..with a lot of current active participants for community feedback and interaction. Moreover, their roadmaps will be updated regularly based on actual situaltion which will help community to follow the implementation of project in metaverse production, comic production, comic calendar publishing... In addition, documents of the development such as game, basic design, tokenomic,.. also be a source of tracking the project. Regarding the success of the project, the proposer clearly shows their outlook for the next 6 months and in longer term vision. After 6 months, release marketplace and sell Boxes successfully, more than 10,000 users join into marketplace, and can sell first 30,00 boxes. For long-term vision, users could buy boxes, exchange NFTs, stake tokens to get profit, and could sell 1 million boxes which shows their ambitious goals. After all, I think, the auditability of this proposal is possible.", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5878, "q0": "This proposal is very interesting. It creates a place where people can realize their dreams (no capital, no knowledge, no money if it fails). This is a game that can be played for free, with an eye-catching interface, including VR techniques,... it will certainly bring a great experience to players, attracting the attention of many people. . In Startverse, users not only move to earn, learn to earn, but also do anything to earn money (action to earn). In addition, it also allows users to exchange NFT, Stake tokens for profit. With the above reasons, I believe this project has effectively solved the challenge.", "q0r": 5, "q1": "Team information has been provided. Your team consists of 3 members, they have a lot of experience in fields such as: games, AI, software development,... . They have all the knowledge, skills and experience to carry out this project. Each of them has their own strengths, each achieve their own successes, they combine to form a perfect team. Teams play an important role in determining the success or failure of a project. You've got a strong team. However, it would be great to have links to their profiles (linkedin, telegram,...). This will make the above information more transparent and easier to verify.\nWhen accessing the link you provided (https://bit.ly/3ytIbAS). I'm really impressed with its interface, it's beautiful, it's amazing, I'm so excited and looking forward to being able to try it out. Besides, a detailed roadmap has also been listed, this proposal focuses only on Q2 3 4 2022. You have identified the things that need to be done and distributed them in the appropriate timelines. Besides, the budget allocation is calculated very meticulously and in detail (via the link https://bit.ly/3yr6i37 ). You have calculated a budget based on the number of people involved in each job, the number of hours worked. This is probably the most detailed, detailed roadmap and budget proposal I've come across. There is nothing to criticize. In addition, you have also identified the risks, challenges and ways to mitigate it. This is very necessary, it keeps your project away from the bad effects affecting its long-term development.", "q1r": 5, "q2": "Criteria for assessing project progress and success have been provided. Besides, there are specific numbers, which will make it easy for people to compare and evaluate. You have a blog page to update the progress, this is very necessary, it will be a place where users can monitor the progress of the project themselves.\nThe information provided is complete, people can easily believe in the success of this project. This is probably the best proposal I've come across. I am completely impressed by the interface, gameplay, detailed roadmap, budget,... that you have provided. This project will surely attract a large number of participants, thereby promoting the development of the Cardano ecosystem. I will definitely VOTE for you!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6800, "q0": "The metaverse is a huge technology that is still in it's infancy with many pieces of the puzzle yet to be assembled. The proposer however, intends to leverage the capabilities of the metaverse to provide a level starting point for businesses and startups.\nThe solution is to build a metaverse with a large suite of services that will allow for integration of businesses and startups at almost zero cost. ", "q0r": 4, "q1": "The proposal was implicit and well detailed. Links were provided that further help with my understanding of the project. The solution has some amazing and unique deliverables most of which are actively in development for example, the marketplace design portal is completed, NFT items is ongoing, NFT smart contract (ongoing) among others. However, the roadmap/timeline in the proposal is not thesame as the roadmap in the project's website, secondly, the project's token seems to have been launched on BSC chain (Is the project a migration from another chain?) Lastly, i also notice that the proposer does not at any point mention if/how the the project will be executed on our (Cardano) blockchain even though the implementation plan was well articulated and structured.\nBudget and team details were all presented. In all, the proposal does not outrightly pronounce in any way how the project will utilize our (Cardano) blockchain for building the product and i however find it confusing to judge if it's a Cardano project or just a blockchain project seeking for funding from the Cardano community.", "q1r": 3, "q2": "The project has some partitioned stages/phases with unique milestones for each phase, these perhaps will make it easy for auditing, also the development progress will adequately be shared with the community. Team also have longterm and short term goals which were all outlined and i believe they are sufficient to evaluate success of the project.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9307, "q0": "Oh. I find your project very interesting and attractive to players. I like the suggestion of not allowing the user to decide the price of the NFT on their own. The price of NFTs will be automatically calculated according to their features and levels. I like this suggestion because it avoids inflation and measures player value. Players will have to play with ability. Because if players want their NFT to become more valuable, they need to spend time and effort in the game to upgrade their NFT. This will help players fight harder. I totally agree with your suggestion. You should have more illustrative videos. In your proposal, I have seen that you present the problem very specifically, logically, in an easy-to-see form. Hope you will be able to implement the project in reality to contribute to the Cardano ecosystem a nice project.\n", "q0r": 5, "q1": "I have access to the link you provided. The detailed budget table created by you is very detailed. I think your game design is also very beautiful to attract viewers. Oh my gosh I'll give you 5 stars. Your plan is designed very eye-catching, logical. You create animations that look extremely lively. Although the team member is only 3 people, everyone works very well, very efficiently. That's my opinion when reading your suggestions. I believe this project will be developed in the good future.", "q1r": 5, "q2": "Honestly to me, I think you guys have a very nice website design. I agree with your progress measurement. In this section you should be clear about a brief description of the recommended development path using which software. I find the plan of Building a community plan by Twitter, Telegram, Facebook, Youtube, Tiktok ... is completely reasonable. These are very hot websites today and are used by many people around the world.\nFinally, about the success of the project, you have set specific KPI targets, long-term and short-term. This is good.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11209, "q0": "Starverse is a metaverse where every player can do whatever they want, it is a concept that we have heard about many times and few times have had a success comparable to Second Life. This project already has a working game base that doesn't have graphics comparable to AAA games, but it doesn't need them. The game I mentioned earlier, Second Life, has a level of graphics comparable to Starverse and has been and is a very successful game. Having a game of this type of characteristics in the Cardano network, I believe, could attract many users to the ecosystem. \nThe work they intend to do is very ambitious, where you can access many countries, with many areas, from gyms, stadiums, offices, bars, beaches, etc. Allowing every player who gets into the world of Starverse always have something to do. Whether it's meeting people, enjoying the weather or working. \nThere will also be multiple mini-games to pass the time with. \nThe marketplace will be very broad, because it will not have a single type of nft, as in other games. Here you will be able to buy/sell, items, land, buildings, businesses, houses, etc. You can even lend and borrow NFTs from other players. \nFor all this, I consider that the impact that this game can have is huge.", "q0r": 5, "q1": "The team that is presented is very small, only 3 people and do not have links to any social network. I think it is always desirable that the team presents some linkedin profile or some other social network, as to provide some support for their knowledge. \nOn their website you can find information about the rest of their team, which are 7 other people and 2 advisors. I don't know why they didn't present the rest of the team in the proposal. Although they do not have links to social networks either, it is good to know how many members the whole team consists of.\nRegardless of this, they have a website where you can test the game, where you can create your own character and go through the city. So even though it is a small team they have been working a lot on the project, by the progress they have made I guess the team is more than capable.\nThey have applied to 3 projects in the F9, so if you are funded to more than 1 project, they will have some difficulties to manage to carry out the 3 projects simultaneously.\nFrom the progress they have already made I see that the team will be able to make the game. As a negative point is that they will need more rounds of funding to finish the project. Although they are looking for other financing options such as the sale of NFTs and Venture Capitals contributions.", "q1r": 5, "q2": "In the proposal they have not put the roadmap, which is on their website, although it is quite brief. Having only 4 steps and given the current date they should only be missing the last 2 steps of their roadmap. This type of information should be provided along with the proposal and it should not be necessary to search the website to find it. And beyond this, there should be much more information provided than what is provided. \nFor example the next 2 steps are: Release (Closed alpha, Closed beta, web version, update marketplace) and Update Game (Release PC, Web version, Release Mobile version, Develop Branded Business). \nThis kind of games are being expanded and made in parts, so the future release version will incorporate many updates. When they say update game, what do they expect to update? They should have a detail of the mechanics that will be incorporated and in which times they will be done. There are so many mechanics that they want to implement that it is obvious that they will not be able to implement them all in the short term. This part of the project is the one I see the weakest.", "q2r": 3, "assessor": "z_assessor_3231", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11444, "q0": "I think this is an interesting proposal. The proposer has the idea about a metaverse, Startverse game that players are free to do what they want to build their dream life, dream companies,..and earn real profits. The proposer explain very clearly how we could play Startverse, what special about this NFT game as compared to other current NFT games on markets. It is exciting for community to try play this game demo on their official website. think this proposal will attract many game lovers, increasing the adoption of NFT on Cardano blockchain, which is suitable for the requirement of this Challenge. ", "q0r": 5, "q1": "Within this scope of the proposal, for Q3 2022 (3 months), the proposer provides a very detailed roadmap, focusing on implementing frontend and backend of marketplace, UI/UX, design, test, management, communication, translate,..which shows their seriousness. Next to the list of tasks, it is the cost for each item. I admire the proposer for a very good calculation of the project's expense. The method that the proposer uses to calculate the cost shows their professional which I highly appreciated. Moreover, the team members are qualified and experienced enough for implementing this project. I recommend the proposer should add their social media account such as Twitter, Telegram... or Github for community to get to know them more. After all, the proposer shows a lot of confidence, and I am more convinced as there are some proof of works in this proposal. I believe the team could do well. ", "q1r": 4, "q2": "It is easy to check the progress of this proposal as the author gives some methods for community checking. Community could base on the commitment in their roadmap, published development documents, their marketing activities (social media channels, published content articles), or could visit their websites for more regular updates of the project in the blog section. In short, it is absolutely possible for community to monitor their project. ", "q2r": 5, "assessor": "z_assessor_3246", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12599, "q0": "This proposal fits the challenge. A platform where participants can build their own virtual investment or business model and even make money from it. The project will attract a large number of new communities, which is quite similar to Play-to-earn gaming but it's broader and includes P2E games, its impact is much more.\nYou mentioned the project also helps players understand how to work to make money, how to invest to raise capital and how to build a startup from their capital. The idea of ​​the project is amazing, which can completely make it as real as possible. I mean, a virtual world but the gained experience is real. It solves an age-old problem that is the fear of starting a business, which stems from the modest conditions of startups, they have no knowledge, no experience, not much capital... the start-ups need a solution that allows them to gain experience without having to experience failure in real life, and the solution the project offers is for them to experience in a virtual world, they can accumulate experience, will understand how to work, accumulate capital, do business, invest. If successful will solve this problem. And its impact is huge.\nThe amount of information the proposal provides is satisfactory, I have no comment on this part, I rate it highly.", "q0r": 5, "q1": "The proposed roadmap is very good, it determines what works will take place in each quarter of the year. Although not the most detailed scenario, it is enough for us to safely understand its development. The information about the project members is also provided in great detail, the team has a lot of experience in the fields related to the project and I believe they are capable of taking on the assigned workload. I don't have any questions about this part, I just hope that in the future you should attach the link right below the member information so that it is easier for the PA to find and confirm what you say is true. In terms of budget, it's pretty easy to understand how it's used, and it fits the project scope.", "q1r": 5, "q2": "Thank you for providing detailed information about the data related to the project. The proposer also clearly demonstrates how the community can track project progress through publicly available files or through the project's website. This makes it easy for the community to follow and get feedback and support. But I would like in future surveys, proposer will collect data on what metrics, what specific metrics they plan to achieve, like number of users, amount of NFTs owned by users. ... it will be the basis for me to compare the success of the project and better understand the long-term vision of the proposer.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12950, "q0": "The proposal is about the  STARTVERSE where  everyone can build their real startups with minimum spending. Here in the  STARTVERSE people from all around the world can do anything Meet people ,Hire someone for work ,earn real money,Make friends and so on. By this way people can achieve their dreams with very little amount of spending Here in this proposal people can buy NFT's and People can exchange their NFT\"s .\nand People can even stake the NFT's and get some profits .The proposal clearly adds the value to the cardano eco system and The key metrices and the goals of the proposal align with the outlined challenge settingsThe proposal is able to scale to addresses future challenges .The proposal have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.The proposal is able to scale to addresses future challenges. The proposal have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.", "q0r": 5, "q1": "\nThe project's proposer has provided a complete strategy, complete with a timeframe and significant checkpoints, for carrying out the project, which includes designing the marketplace portal and NFT goods. staking feature implementation, NFT smart-contract implementation, marketplace portal frontend implementation, and marketplace portal release.The Approach to the challenge is great the proposal have considered the relevant risks and challenges for the successful implementation. Upon reviewing the proposal I agree that the proposal is likely to be successfully implemented. The proposer have also described the details of the team and the skill of the team which is needed to implement the proposal ", "q1r": 5, "q2": "The progress of the proposal can be measured by looking at number of NFT's created , \nThe proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described.\nThe Metrices/Kpi's mentioned in the proposal define the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "In STARTVERSE, we allow worldwide people to do anything to earn(Actions to earn) and build their dream life, dream companies, meet their couple, hire friends to work for them, and earn real money.", "experience": "Our core members are all entrepreneurs with more than 10 years in the gaming industry with many Canadian, Korean, and Japanese clients. We also have a development team of over 20 developers, and a marketing agency with 5 core members to cover this project in the first phases"}