{"id": 414945, "author": "nhan.tran", "title": "METAIN: Asset backed NFTs/New trend", "url": "https://cardano.ideascale.com/a/dtd/414945-48088", "category": 26595, "amount": 100000, "description": "Real Estate investment using crypto is largely unaffordable and unregulated. Asset-backed NFT can solve the problem but it requires a lot of work and trustworthy parties to implement. Case study", "f6_no_assessments": 10, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 2061, "q0": "According to the author, real estate investment using cryptocurrencies is largely non-affordable and unregulated. Asset-backed NFT can solve the problem but it requires a lot of work and trusted parties to implement. I like your suggestion because it is addressing an area that needs more coding. The solution given to this problem is MENTAIN which will help bring real-world asset returns to the crypto world for affordable, transparent, and safe investment. The problem started and the intended solution presented in the proposal fit the challenge clearly and logically. The author also very clearly presented his solutions, and how to make MENTAIN successful, helping us to be more confident about the problem in question. It also establishes possible difficulties and challenges, demonstrating readiness to deal with adversity. If this succeeds, it will be a big step for Cardano to become popular in some respects, fully achieving what is sought in the challenge.", "q0r": 5, "q1": "The roadmap is divided into 4 milestones associated with specific goals and a defined period. And we understand what activities will take place. In this project, as I understand it, these activities will follow each other, i.e. when one activity ends, another will be performed later. And we also understand what the result of each milestone is.\nNext is the budget, the proposal asks for $100,000, and the proponent has reflected the budget very thoroughly, this is a highly qualified team that will spend a lot of time on this project, driving the development of existing tools and conducting research on the field being studied. We know how the money will be divided into small portions and each of them is clearly explained. In other words, we have a very precise vision of where that money is going.\nAnd finally about the team, in general, I find this section to be excellent, as most professionals provide a good level of detail about their profession, exemplify previous experiences, and provide affiliation about them, about how we can get to know them more directly. In addition to the 6 key members, the proposal also includes a 15-person advisory team, some members of the advisory team are also provided with detailed information, increasing our confidence in the team implementing this project. Therefore, the feasibility is very good, we know in detail all the background information about the scenario, budget, and team and so we can understand for sure the development process of this project.", "q1r": 5, "q2": "The information provided is sufficient to assess the progress and success of the proposal. The ability to check the progress of the project is very good. The provided KPIs are very clear:\n-Acquired the web dApp at https://metain.io\n-REIT NFT on Cardano.\n-Signed contract with Deloitte (financial and tax audit).\n-Signed contract with CBRE (asset assessment).\n-Notice about custody and property insurance of the Bank Trustee.\n-Complete NFT license agreement (August)\n-Start selling First Chance Trusts (as REIT NFTs)\nWith the information provided, we know what specific goals are expected here and which are related to different areas of the proposal, not just one-sided. Regarding the testability of the project, the publisher says that it will provide a fully managed platform for the Cardano community, so I believe we can track the progress of the project easily.\nAnd finally talking about the success of the project mentioned by the author as \"REIT NFT exchange and ecosystem in Southeast Asia with more than $1.3 billion in corporate assets including investment portfolio Real estate is valued in the stable currency for 5 years\" the author is very aware of the success of the project, which is good because it gives us insight into what needs to be achieved. Therefore, I strongly believe that this proposal if funded will bring great results for the Cardano community", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4248, "q0": "Metain stands as a valid alternative to the current centralized real estate investment funds.\nMetain aims to create a solution that makes real estate investments with cryptocurrencies accessible, transparent and safe.\nReal estate tends to be very expensive and many investors cannot afford to take an underlying position in real estate. In addition, many of the current real estate investments that use cryptocurrencies are not clearly regulated.\nTo carry out this project, Metain aims to purchase assets in the Southeast Asian real estate market to be tokenized (represented on blockchain), for the first sale of REIT NFT,\nREIT NFT which will be issued as a security token. The sale as a security token implies that the NFT is considered as a security, as such the sale will be subject to the laws and regulations governing financial products.\nTokenization also makes cross-border investments easier, while a distributed ledger offers the benefits of secure transaction records and transparency.\nMetain follows the REIT (Real Estate Investment Trust) regulation, assuming the sole role of asset manager, while the titles of the properties or assets are managed by a third party bank trustee (write who is and check), who does not own the asset o the property at no time, as this remains the property of the NFT shareholder.\nTherefore, even in the event of Metain's bankruptcy, the assets (under the Bank Trustee's agreement) will be sold by the Bank under the supervision of the law firms Morgan Lewis, DN Legal and following all the protocols of the legal and legal authority to return all funds to our investors.\nSome of the biggest benefits of a REIT are that it can provide both ongoing dividend income and long-term capital gains. Ongoing dividend income can often come from leases which can offer a predictable revenue stream. At the same time, the value of your shares in the REIT may improve as the value of the properties held by the REIT improves.\nThe APY of the NFT is therefore estimated based on the historical value of the asset and two main components that affect the APY include the rental yield and the appreciation of the market value of the asset. The appreciation of the market value of the asset is reassessed annually by CBRE, an international third party (which is / the largest real estate consultancy company in the world).\nTo ensure financial transparency and full compliance with all tax obligations, Deloitte will conduct audits at Metain twice a year. It is a leading consulting and auditing company, the first in the world in terms of revenues and number of professionals.\nOne of the biggest changes in the Real Estate Investment Trusts (REIT) space is that the sector has become highly specialized. When the industry first emerged, the trust would buy virtually any property.\nover time, the industry has realized that the risk-return profiles of each of these investments are different. Therefore, companies have begun to specialize in one of these types of properties. Today, most Real Estate Investment Trusts (REITs) will only state the type of property they invest in and the risk benefits that accrue as a result in their investment brochure. Investors therefore have more control over where their money is invested.\nIn the case of Metain NFT it is also DAO to increase the decision-making power of investors, who will have the opportunity to vote for the property screening proxy before buying / selling, renting or selling.\nInvestors therefore have more control over where their money is invested than traditional REITs.", "q0r": 5, "q1": "The proponent provides evidence (linkedin) of their skills in startup development and clearly and precisely defines the number and type of team members needed to implement the proposal.\nFor each team member and / or consultant, the relevant linkedin is provided. The team shows grounded experience in various sectors; maketing, investment banking, financial and real estate investments, wealth management, technology and blockchain. By examining the linkedin, the skills of the members are confirmed by other experts in the related sectors.\nThe budget requested by the proposer will be used for the development on Cardano, while the operating costs are already covered by investments by companies and financiers.\nOn the Cardano development side, additional funding may be requested in subsequent funds for some implementations (wallet app + plug-in, smart contract optimization, metain ecosystem).\nThe budget is divided into identifiable items, there are small discrepancies compared to what I was able to find online, some items require slightly less others slightly more but overall the total required is more than reasonable.\nKey milestones, technical aspects are identified and achievable and verifiable delivery times are provided.\nAmong the main challenges identified by the proposer for the implementation of a successful proposal is the lack of REIT knowledge on the part of the cryptocurrency community and the property acquisition process which must be rapid to avoid other competitive models", "q1r": 5, "q2": "There are milestones with identifiable measures of success and a well-defined time horizon.\nHowever, the key performance indicators are very general and do not specifically measure the added value to the Cardano network. In this regard, it would be interesting to see the evolution over time of statistical data such as:\n-Number of users who own NFT REITs\n-Total value locked in real estate\n- Exchange volume of NFT REITs\n- increase in property cost / rental income", "q2r": 4, "assessor": "z_assessor_2531", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 4352, "q0": "Issuing a real estate NFT is a relatively new idea. I think in the Catalyst community there are not many ideas related to real estate investment and management like this. This idea is considered in line with the goal set out in the Challenge \"Dapps, Products & Integrations\". There is a reality currently happening in Vietnam that is: Many projects call for investment but are fraudulent tricks, some other projects call for joint investment but regular investors. lost money or the value of the property has been inflated and no one has verified the value of the property. Before that fact, the proposal has identified the problem to be solved and the solution is the use of NFT - considered a fund certificate (even with annual interest when using NFT - a platform on joint investment) has been increasing the value of the Cardano ecosystem. I think the proposal has a relatively large impact, especially in the real estate market in Vietnam because it contributes to solving the inadequacies in this market (if it is applied in practice). . Scaling up and addressing the challenge is possible but it will take time in the future for the team to develop its proposal to the next level. I like this innovative idea, and see it as a high-tech product related to the Cardano blockchain. I vote 5 stars.\n", "q0r": 5, "q1": "I have commented that the number of members in the group as well as the proponents have certain qualifications and especially you have done a great job, one thing is to clearly identify the members through the links of social networks. association (linkedin, twitter), along with accompanying documents to make it easier for the community to identify and trust the team implementing the proposal. This is an important step to increase the feasibility of the proposal. Accompanied by advisors with extensive experience in the field of real estate, marketing and communication. I highly recommend this team and consider it a necessary resource to implement the proposal (5 founding members all work full time for Metain). I realize that most of the money you apply for is used mainly to hire Haskell programmers, train programmers, do audits... It seems the team has taken action to lay the foundation. so a professional organization can make long-term use of not only this proposal but also other projects. I think it makes sense in the same way as the team's plan and execution. I have a question for you: From a technical point of view, is the issuance of NFT based on a decentralized platform? If it is decentralized, on what basis does the team say that it is decentralized when there are still lawyers, banks...? How many NFTs is the team planning to release? And what is the basis for NFT valuation? I ask because it makes it clearer for those who want to learn about the feasibility of the proposal. In short, technically, the team can clarify through my question. Regarding the risk challenges associated with implementation, I am quite convinced with the risks listed in the proposal and add my thoughts: If the project fails or house prices do not increase as expected, Where will you get money to pay investors? Maybe when investing you will choose real estate in the city center, the real estate price there is always high and the possibility of loss is very low. But in fact, there is always the possibility of loss even if the percentage of loss is very small. But if you still lose, how do you compensate investors? Where to get money for compensation? Overall, I am satisfied with the feasibility of the proposal presented by the team. And to confirm the transparency of the proposal to the community, I asked some more questions like just now. Hopefully the team will have good preparations to put the proposal into practice (if funded).\n", "q1r": 4, "q2": "You have clearly stated the four milestones that you intend to implement under the proposal. I completely agree with this process. It shows the professionalism and understanding of the market and technology of the team. I have an additional question to verify the transparency of the proposal: I know that there will be intermediaries (law, banks) participating in Metain, so the participation of intermediaries will be possible. Publicly let the community know or not? And is this publicity reflected in specific smart contracts? In terms of performance indicators, the team did what many other proposals did not, which is to provide KPIs. I find this index quite reasonable because the growth rate of household spending and per capita income are closely related to the market, including the real estate market. And finally, I have no opinion on the description of the problem, because the team's proposal is quite clear and easy to understand, along with the solution offered to be satisfactory and reasonable. I love it and encourage the team to continue to build on what has worked well. I completely agree with the transparency of the proposal. However, as you all know, I still have some questions so that if you can, you can further refine your proposal on all 3 aspects: impact, feasibility, and auditability. I vote 4 stars.\n", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8574, "q0": "According to the proposers, investing in real estate with cryptocurrency is largely unaffordable and unregulated. Asset-backed NFT can help solve the problem, but it requires a lot of effort and trustworthy parties to put in place. I completely agree with this statement. In order to address this problem, the proposal’s aim is to build the real-world asset-backed NFTs with compelling interest of 15%-25% APY. Following REIT regulations, NFT is SECURITY TOKEN. DAO votes for property screening delegation before buy/sell, for rent or listing. If such a project were to be implemented on Cardano, it would not only revolutionize the housing market in general, but it would also attract one of the world's most profitable businesses, since the real estate market is unquestionably one of the most profitable. Similarly, I believe that both the problem and the solution are relevant, and that the success metrics offered are both appropriate and in line with what this challenge is seeking. Despite the fact that the project is ambitious, the team carefully divided it into four parts, allowing the community to assess the impacts the team expects to make in each step. Unfortunately, no clear effect measurements are provided, preventing me from making a valid judgment.", "q0r": 4, "q1": "If this idea is to be executed successfully, I believe it will be because it is supported by a very good team with their names and titles. The team has gathered profiles with a variety of talents and expertise. This involves knowledge of Blockchain knowledge, finance, real estate, fin-tech, media & marketing, etc. The presence of references to the team members and contacts of the mentioned advisors makes me have nothing but praise for the team, very transparent indeed. Likewise, a detailed, itemized breakdown of the budget is presented. At the same time, it would be great if the proposal provided more analysis and discussion about the funds required to achieve stated goals so that the community can accurately evaluate the budget fairness, for example, $7000 is requested for Project's community building for Cardano in 6 months, as this covers the salary of a community manager and moderators, and other costs such as advertising, seeding, Social Network fees; The hourly rate and projected contracting time must be included, as well as the ways via which the team intends to market. Also, a more detailed description of the team members in each role (who will do this and who will do that) would have been helpful in visualizing how this idea will appear. There is a reasonable timeline for completing the project successfully. The roadmap is divided into four major stages, each with its own set of milestones. Although I would like a higher level of information displaying the tasks completed at each stage, the achievable milestones are sufficient for me to understand.", "q1r": 4, "q2": "The team once again provided good performance in the auditability section. There are certain clear final deliverables that can be used to audit the project. The simple tracking of project progress is supported by good milestones from the roadmap. There is also a good risk discussion in the proposal. My only recommendation is that the team present the impact measures in such a simple and straightforward manner so that they will become a good fit for the problem they are attempting to address. As the roadmap and the goals included are feasible and auditable, if these were to be transparent through a means of user-friendly communication, it would be perfect. For right now I see no mention of such a method to keep the community and the team in contact.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12588, "q0": "The idea of proposal is good. Project will solve problem for small investors can join in real estate market through buying NFT assets. However I do not give 5 star because you need show more information about marketplace where real estate owners can sell and investors can choose to buy by NFT. Beside some problems were not mentioned in proposal as legal & policy about crypto asset in some asian country still not admit and protect. ", "q0r": 4, "q1": "Execution plan, risk management, finance plan are really good and transparent. They have good experience team with good background. So I think they can make this project successfully. However they need to solve problems about policy of some asian country for investment in crypto asset through sell/ buy real estate by NFT. They need some advisors who can understand clearly about that.", "q1r": 4, "q2": "The roadmap need to show more detail to investors can follow when they invest early at first NFT sale. They have a good finance & tax audit company as Big4. They got some important milestones to run this project smoothly.", "q2r": 4, "assessor": "z_assessor_3440", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12601, "q0": "The project tackles the challenge effectively. Finding and investing in a safe and transparent asset class is always a top priority for investors. The project has come up with a great way to meet this need by bringing these assets from the real world to the blockchain, which will break down investment barriers like investors around the world having difficulty investing in real estate in Southeast Asia. This allows retail investors to have more opportunities to profit from investing in safe assets such as real estate with capital within their means, and will eliminate difficulties in investing when geographically isolated, and although investors' understanding of crypto is still limited.", "q0r": 5, "q1": "The proposer has given a detailed concrete roadmap with realistic timelines, Amount requested and hours provided is reasonable to carry out the project as described. And I believe that this project has a huge opportunity for implementation. The team is very experienced in relation to the development of this project, and all the background information of the team members along with the advisors is provided very clearly and in detail. The development of this project is defined in detail, I think it's a bit complicated, but a little more detail will give CA, vCA and voters a more solid view of the process.", "q1r": 5, "q2": "The proposer makes it very clear and accessible that all previously funded projects can be tracked and audited as progress is made. An audit can heavily depend on the performance of upcoming proponents and a sense of accountability, and while this team has some impressive resumes, a project like this can carry out significant tasks. steps in the audit to reassure the community and establish trust.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13746, "q0": "Proposal towards real products and Defi with the desire to create REIT funds that generate profits for the future. It seems that the title of the proposal does not match the problem that the author raised. REIT is a real estate investment trust that creates profits but also risks when investing. The proposal has the idea of ​​creating NFTs that are open for sale to attract REIT participants, creating NFTs for land assets will not be suitable, real estate is an irreplaceable asset just as NFT is unique. The issue has not yet shown a real impact on the Cardano community as well as the development of the Cardano ecosystem. REIT is a form of individuals entrusting their money to invest in real estate, so the assets will have to be valued from a third party, which affects the \"decentralization\" of the proposal, it doesn't align with what Cardano is aiming for. The proposed risks are the lack of REIT knowledge in the e-community, the competition of other models, and the community's confidence in the proposal. The way to deal with risk is not really convincing, for investors to have confidence, the proposal needs to show its true potential, financial ability and ensure that investment sources are not lost. In addition, the proposal should take into account the risk of legality, in Vietnam there is no protection for cryptocurrencies and other forms of investment related to cryptocurrencies. The purchase of NFTs generated by the proposal may not create value, the investor's money may be lost. It is proposed to have better solutions to minimize legal risks and create confidence for investors.\nRating: 2", "q0r": 2, "q1": "Developing NFT REITs and giving the Cardano community a reservation to buy NFT REITs is like creating an NFT game today. The proposal does not show how buying REIT NFT is an investment form? How do these NFTs relate to real estate investing? What is the value of this NFT? These factors can make the investor community afraid to participate in investment. The plan launched is just the beginning of attracting the attention that creates the investor community. Unstated plan How will REIT be implemented? What assets will the investments be purchased? What is the value? How many investment funds are expected to attract? How to guarantee investors that their money is not lost? Lots of questions and problems to be solved. The implementation plan of the proposal still has many obstacles, which may affect investors' anxiety. The proposal is made by an experienced implementation team, but there is no guarantee of the success of the REIT, financial security and protection of investors against the risk of losing their investment. Unresolved legal issues greatly affect the success of the proposal.\nReview 2", "q1r": 2, "q2": "The given plan is not consistent with the results achieved, there are no timelines for completing the work stated. The indicators/KPIs of the proposal are not really clear, there are no data on the implementation of asset purchases, what is the number of people involved in investing? What is the investment fund? How much REIT NFT generates? The authenticity of the property inspection team before listing is not yet available. Does the DAO vote for the sale of assets to be published? The audit of the proposal has a lot of difficulty in implementing to determine the success of the proposal.\nRating: 2\n", "q2r": 2, "assessor": "z_assessor_3777", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14415, "q0": "\"The problem for low-income people to invest in real estate safely and effectively in this proposal is a dilemma of the world. As proponents have mentioned, so far the only way to invest has been through banks and private funds. But either way requires a large amount of capital (money) and is not for low-income people. And the solution to solve this problem using unbacked crypto-assets (as opposed to the traditional method of backed assets) to decentralize investment channels is really feasible and appropriate to the challenge.\nThe way the proponents describe their solution is very clear and specific. For example, they used a specific number to evaluate the sale ($8 million and $18 million). Furthermore, they also cite some relevant external information to support their solution and use visual graphs to make it easier for readers to grasp the information. \nPublic ignorance of REITs is a real challenge for this project. The reason is that this is a new method (technological method) so it has not been trusted by the community. Both of these are mentioned. I believe as they said that the community will gain their trust over time after seeing the benefits and transparency of their project.\nOverall, the impact has more than enough information and matches the challenge.\"", "q0r": 5, "q1": "\"Dates and times are shown specifically to track the milestone of the progress. The task of each milestone is details indicated. For example, the first milestone is code to develop the REIT on Cardano, the second milestone is open to the public, and so on.\nOn the budged breakdown, the cost are mention transperently. Every salary of the member who is paid, every cost for third party to outsourcing are listed well. I do not have any complain about this part.\nAll team members working on this project are shown in detail and also have their LinkedIn attached for more information or the ability to contact if needed. In general, all team members have many years in the department for which they are responsible. For example, Khanh Nguyen, co-founder, is a CIO with 15 years of experience in finance, real estate, and many other related fields. Furthermore, I love that they mentioned future development with the Cardano system to emphasize interoperability with the aim of the project to build, optimize, and maintain a great REIT on Cardano.\nIn summary, I think this part is well written and shows the professionalism of the project team members.\"", "q1r": 5, "q2": "\"The project success conditions are indicated clearly. As a pioneer project in the field of real estate investment, regulatory approval is the real key to the project's success. And the proponent has listed all these conditions very exhaustively. They also list all the partners involved in the project as an accreditor to show that the project will be eligible for regulatory approval. \nThe big picture of success they painted on this project lies precisely in the purpose of the project, and the challenge as well. The successful project will be the most reliable channel where anyone, regardless of income, can confidently invest in real estate. Especially in the market value of $1.3 billion in Southeast Asia as mentioned by the proponents.\nIn short, the information they give is reasonable and sufficient in this section.\"", "q2r": 5, "assessor": "z_assessor_4045", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14578, "q0": "The solution in this project affects the Cardano ecosystem. First, what sets METAIN apart from other Web3 companies and projects is that the chain has real-world use cases, value and utility, and transparent and secure supporting assets. Besides, METAIN also offers Emurgo security token: Cardano Partner Explained, EMURGO & How EMURGO Is Planning STO. However, I have not seen that the project's results are consistent and in sync with the KPI/Key metrics of the challenge, the team needs to add this issue. In addition, the group mentioned possible risks but they have not proposed effective and reasonable solutions to reduce them.", "q0r": 3, "q1": "The team provides a roadmap with four important milestones starting from July 12, 2022 to November 25, 2022 and also sets out the goals and key activities to do in this plan. . Even so, I still hope that the team can be more detailed about the work to be done in each phase so that I can easily track the progress of the team. Regarding the budget, the team estimates the costs to pay for the necessary personnel and assets, however, the team should calculate the total estimated cost to see if it is reasonable and balanced. The team consists of a team of experienced professionals: Denise Thi; Minh Vo; Hong Luu; Khanh Nguyen; Charz Kelso; Advisor - Eddy Abramo; Duc Tran - Partner at IDG Capital; Minh Thach; Hung Dinh and 15 other advisors. Besides, the team also proposed a few other ideas and created confidence that will bring more rewarding opportunities to the Cardano community when the market becomes stronger in the near future.", "q1r": 4, "q2": "Regarding the auditability, I have not seen the team clearly show quantitative indicators to monitor the implementation progress of the project. The team should supplement and perfect these indicators and how they are measured. When describing the success of the project, the team said that it will become a reliable, measurable investment, REIT NFT exchange and ecosystem in Southeast Asia with more than $1.3 billion is the company's assets including a real estate portfolio denominated in a stable currency over a period of 5 years. In addition, the group also identified Goal 10. Reduce inequality within and between countries in the SDG as a benchmark for measuring the achievement of this proposal's goal.", "q2r": 3, "assessor": "z_assessor_4073", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14619, "q0": "The project was created to solve the problem of Cryptocurrency-based real estate investing being preeminent and uncontrolled. The Metain chain brings real-world property earnings to the cryptocurrency world to make investments more accessible, transparent, and secure. It also provides real-world use cases, value, and utility.\nThe proposal does not show the target audience that Metain expects. Since this is a big technology and financial project, it is very important to define the customer persona. It helps to stick to the original goal, and at the same time can estimate the number of people participating in the Cardano ecosystem, and the amount of ADA that can be used through the project.\nIn the description of the proposed solution, the proposer has listed a list of expert groups to develop the project and the main functions of such objects as technical/marketing/financial expert, crypto strategist... The proposer has demonstrated how it works technically in a Metain flow chart, which makes the plan seem easier to understand when depicted graphically. The way this project operates matches the criteria of the challenge.\nIn the description of the risk solution, the proposer raised the risks of the lack of REIT knowledge in the crypto community and the pressure to quickly establish a fund to dominate the market before other competitive models. . Although there is a basic solution, it is not detailed enough to solve the above difficulties. Besides, I also found some other challenges such as legal and tax issues in the country where real estate exists.", "q0r": 4, "q1": "I find it highly responsible for the proposer to provide a very detailed plan of content and milestones defined by a specific date and not by a period. The project's budget is allocated in a very clear way for each activity, it's easy to know who the money will be spent, on what, and for how long.\nI am extremely impressed with the profile of the team members, all members are experts with extensive experience in the fields of technology, finance, software, and investment. They have a solid knowledge base and good expertise, I believe the project is completely technically responsive with the above list of high-quality personnel.", "q1r": 5, "q2": "The Metain has signed contracts with Deloitte (financial and tax audit) and CBRE (asset assessment) enough to prove that the team is completely serious about this project. Besides, the proposer listed key solutions very reasonably. The roadmap for development and cooperation with reliable partners in many fields around the world such as United Overseas Bank, Morgan, Lewis & Bockius LLP, KyberSwap…\nThe proposer has a long-term vision with clear expectations for the future. The detailed roadmap of the project has been described above. The proposer can add additional methods to monitor and manage work progress such as Jira, and Ora software... because the proposer already has a very specific estimate of the time to perform the work (in the budget allocation section).", "q2r": 5, "assessor": "z_assessor_4076", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "\nThe real-world asset-backed NFTs with compelling interest of 15%-25% APY\nFollow REIT regulations, NFT is SECURITY TOKEN. DAO vote for property screening delegation before buy/sell, for rent or listing\n", "experience": "I finished my bachelor's degree in the stream of Computing Security Major in the year of 2008 from VSB in Czech Republic and a serial entrepreneur with 3 successful startups prior to METAIN in booking online platform, entertainment and online game outsourcing company. Linkedin"}