{"id": 415015, "author": "legrand", "title": "Returning Trust To Global Donations", "url": "https://cardano.ideascale.com/a/dtd/415015-48088", "category": 26595, "amount": 84000, "description": "Current methods used to ensure transparency of donor-NGO relationships are time consuming & easily infringed leading to mismanagement of funds & embezzlement without any stakeholder accountability.", "f6_no_assessments": 13, "f6_rating": 4.512820512820513, "videos": [], "media": [], "f6_assessments": [{"id": 1629, "q0": "The proposal is very good and fully aligns with the objectives of the challenge, because it intends to create a platform that connects donors with NGOs, where donations/financial transactions will be recorded on the blockchain, so that these processes are done transparently and not corruptible, with the objective of eliminating any embezzlement and corruption involving the activity. This project would be very beneficial for both NGOs and Cardano. Firstly, this could potentially increase the number of donations being made to the most diverse NGOs, both because, once the donors understand how the blockchain works and understand all the transparency of the thing, they feel more motivated to donate, since that they would be sure that their money was actually being used by that NGO and for the desired ends. Another point that I think would help with the increase in donations would be the fact that on a single platform, several NGOs with different themes would be brought together, that is, different types of donors could perform these actions (whether for the animal cause, protection against women , fight against hunger, etc.), not to mention the fact that doing everything online would increase the degree of practicality, which could also contribute to an increase in the number of donations. This would be a fantastic way to introduce blockchain and Cardano to new audiences, as we wouldn't be trying to get new users to come through new technology; in fact, they would be people who would already be interested in donating, and Cardano's technologies would only be intermediaries. In this way, the specific objectives of the challenge would be solved: the creation of a Dapp (in this case, a platform, a website) that increases the number of users of our blockchain technologies, number of smart contracts and Ada in circulation, popularization and wide adoption of Cardano and etc. Theoretically, everything is perfect, but I think some explanations were pending so that our understanding was complete about the impact of the proposal. The first question that came to my mind when reading the idea was: how would donors who have never heard of (or who know, but do not understand about) blockchain learn to create a digital wallet and carry out transactions on Cardano? This is cited in risk 1 (“the challenges mentioned above are in the decentralized nature of the project, so we need to approach NGOs professionally and prove to them that blockchain can help them restore donor trust, as well as make the process of receiving payments easier and much faster”); but it is not clear how this would be resolved, in the mitigation part. Would these transactions be done in Ada? How would NGOs that do not believe in blockchain technology be educated, how would they come to trust? I think these details are lacking in the approach to the idea, because in theory it is perfect, but in practice we would need more security in the sense that both donors and NGOs understand what blockchain is and learn to do the basic processes in the decentralized network. . The proponent comments on the difficulty with NGOs and says he will try to resolve this, but does not explain how. Therefore, if this were clarified, the grade would be maximum, but it is still an issue to be worked on.", "q0r": 4, "q1": "Starting with my comments in relation to the team, I believe that this part is practically perfect, as the ideal would be if all the professionals needed to carry out the project were already defined. A lot of confidence is conveyed in the professionals involved who are introduced to us, as they attach detailed information about each. Their names are said, a short summary of their training and professional backgrounds and CVs, linkedin profiles (where we can find out everything that has been passed on and get to know them more intimately), in addition to the fact that the team has a specialist in Cardano (Mohammad Mneimneh), which conveys security that they are people prepared to deal with our blockchain technologies. It seems to me to be a competent and capable group, capable of carrying out this project successfully. Regarding the other parts of feasibility, roadmap and budget, unfortunately the information is not passed with the same level of adequacy. For example, the script: it's good, but it's not ideal. The project is divided into a few phases, and the activities that would be carried out and each one of them are listed in topics, as well as how many months they would take. We were able to understand what would be produced and approximately when, but not so precisely. Ideally, this division would be done in months, for example, phase 1, month 1: such things would happen; phase 2: month 1 would happen this, month 2 would happen that, and so on. The activities could also be a little more detailed. For example, in phase 2, the “portal audit and implementation of best practices improvement” would take place. How would this process develop, exactly? Which professional would be working here, and doing what activities? In phase 1, the marketing campaign would be carried out, but how, in fact, would it be built and disseminated? Marketing is a crucial part of this process, as it is necessary for people to know about this new way of donating, for NGOs to understand the tool and be willing to participate, it is necessary for everyone to understand how to do the processes, etc. So it would be important, in my opinion, for all of this to be better explained. It is a really complex and large project, which increases the need for a very detailed and specific roadmap in relation to the phases and what would be developed in each. Finally, analyzing the funding requested, the total amount is divided into some parts, but these are not as well detailed (some less than others, for example we know exactly the hourly value of the smart contract developer but not the UI designer/ UX). It would be important for all parts to be well explained, like the marketing budget, why would it cost 10k dollars, how would that money be used? In general, I think it's a super viable proposal, but a few more details would enrich this understanding of the script and the use of the requested funding.", "q1r": 5, "q2": "The auditability of the proposal is very good, but some necessary things could be added to convey more security in this part of the proposal. Starting with the analysis of the process, the suggested KPIs are all numbers and refer to the partial results, such as “numbers of NGOs listed on our platform, numbers of donors and amount of cryptocurrency donations”. Certainly this data is necessary for us to understand in a practical and concrete way if the project would be succeeding in what it set out to do; but it is not possible to understand the unfolding of the phases and daily work of professionals based on this data. It is important to know if the professionals involved are performing their tasks as agreed, if the advances in production are happening as expected, that is, if they are working the hours that were defined, if the tasks necessary for such numbers to grow are being performed. . In other words, it is positive that the proponent and his team make us aware of how the construction of the platform itself would be, and not only of what is generated from this tool. In this regard, it is important that, together with the provision of the data he cites, we are told how the execution of the phases has been. I believe that reports at the end of each month could add this information, the important thing is that the Cardano community is aware of everything in a simple and direct way; such information can be transmitted either through a written report (as I suggested), or through illustrative messages disseminated in our community communication channels (telegram, discord, etc); in short, the important thing is that knowledge reaches the members of our ecosystem, in one way or another. Talking about the final results, I think the analyzes suggested by the proponent are great, but they are very focused on the success of the tool itself and how it would be contributing to the benefit of NGOs. The only topic specifically aimed at Cardano is “2. Converting NGOs to Cryptographic Space”. Therefore, my suggestion is that the team make a study especially to understand if the specific objectives of the challenge would be addressed, that is: if this platform contributed to new active members in the community; if all donations were made in Ada, if the number of smart contracts has increased considerably; whether the project has driven Cardano adoption, compared to other blockchains and etc. That said, in my opinion the proposal is very auditable, but some more studies should be included in the consequences analysis, too, to improve the topic even further.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3444, "q0": "The idea is very valid and addresses the challenge, by creating a new Dapp which will utilize cardano blockchain (increasing challenge KPI \"Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases.\"). At the same time, it targets a noble cause by delivering a solution to make donations to NGO more transparent and, potentially, increase them, benefiting both sides. Problem statement is clear and solution addresses it.\nIn regarding to the proposal itself, it is generally well written, highlighting very clearly the value proposition for all sides (Donors, NGOs, vendors and Cardano). Risk management is also well done, with several good challenges identified and properly mitigated. However, a few more information could be provided in the business model of the Dapp, informing how to stay profitable and where to act (globally? locally? in a specific region?), for instance. Naturally, initial scouting and contact with selected NGO would have to be done first and then a communication/advertising strategy would benefit proposal a lot. Other suggestion would be to get in contact with the NGO even before starting developing it to validate the concept and test if they would be interested.\nConsidering all of this, this is a good proposal that addresses challenges, can improve Cardano adoption might have positive sustainability (either social or envirmental, depending on the NGOs) impact, it just need some small improvements to make it more robust. My rating then is 4.\n", "q0r": 4, "q1": "There's a very good time-framed plan proposed, with the main product deliverables listed and other development activities, all matching project scope. It is good to see that Marketing campaign is considered in the plan, this is key for this project.\nBudget breakdown is well done, with the main expenses listed and their hours required stated, giving more transparency to it. it also matches acitvites and deliverables present in the plan.\nFinally, in regarding to the team, there are 5 people already committed with background in business development, marketing, Cardano, network in NGOs and management experience. A good description on their experience, their roles and linkedin links are provided. The only reason that I'll not rate 5 here is because there's stilla technical team to be hired", "q1r": 4, "q2": "There are lots of good kpis provided to assess project success and they all have a pre-defined goal. there's also a very nice phased definition of success, with short, medium and long term milestones that do seem imporant to track progress. It's also key that all these kpis and milestones are public somehere (could be a social media, a website, github, etc).\nAll in all, proposer does seem to take auditability in fair manner and the proposed methods to do this auditing are good enough. My rate is 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4854, "q0": "As we know, lack of transparency is always a big problem in any organization, and it could results in lost of money and resources. In fact, some NGOs are losing fund due to misuse or theft. Therefore, to solve this problem, the proposer suggest a platform on Cardano decentralized blockchain to track transactions and vertify spending which is absent from donors and NGOs. At the later stage, the proposer would like to develop an extension platform to select and enlist vendors offering relevant products/services that NGOs need based on their causes; for example, for animal welfare NGOs provide food supplier, for kids education provide school material supplier,...I think, this idea is promising as it deals with real problem happening everyday in NGOs and create transparent environment for donors, NGOs, and vendors that donation could come to the receiver and used for right purpose. In addition, in my opinion, this proposal is suitable for the challenge \"Dapp, Products & Integrations\" as their solution will help NGOs improve in transparency problems, as a result, donations/funds are used properly to bring positive changes to different goals: environment protection, human rights, disadvantaged people,..hence, attracting individuals or organizations onboarding to Cardano ecosystem and more adoption of Cardano blockchain. However, this idea is ambitious and risky as the author has to deal with many challenges ahead:  Will NGOs willing to use blockchain and want to be transparent and how to persuade them? Where could you find the donors? How could you vertify vendors? What kind of influencers is willing to promote your platform? are they expertise in technology or celebrities? .....in which we need a strategic and professional approach to NGOs, from that they see its advantages to centralized methods and your platform need to be user-friendly, convenient, easy-to-use for users. My thought is that if we could persuade the donors first, then we could persuade the NGOs later becauses if the donors is only willing to donate via your platform, then the NGOs must accept that. The most difficult things is to onboard people who haven't had any idea about blockchain and its advantage could bring about in the long term. After all, I support their idea, I think it's good, I am looking forward to what the team could do in the future.", "q0r": 4, "q1": "From what the proposer presents, I think, the feasibility of this proposal is possible but not easy. In term of the plan, it is devided into 5 phrases with main focus in each stage. For each stage, I think the amount of work is quite large which requires great commitments and talented teams. As I know, the main focus on Phrase 1 is The Launch of the platform which requires a lot of technical works such as developing UI UX, use cases, user journey website, donation portal, but at present there are not professionals who in charge of technical work yet, and they are still recruiting UI UX designer, developers. Therefore, this make me wonder about the executing ability of this Phrase 1 on time? In addition, marketing campaign and social media engagement plan will be run in parallel with the development of the platform, but my question are: what kind of marketing campaign will they do for NGOs and donors here?  How could they engage audience via socia media? What kind of social media will they use?... Moreover, we are clearly about the completion milestones for Phrase 1,2,3, but for Phrase 4 and 5, the proposer haven't shown the exact milestone yet. For example, the author will finish Phrase 1 after 2 months. But the timeline for each phrase is not shown here: When will they start on phrase 1, from which month to which month? Regarding the project's expense, from the proposal, I know that, the budget is required for Phrase 1 only in 2 months. As I said, at present, the team do not have developers and designers, so from the consultation with Developers in Cardano community, the breakdown of budget is given, I think it is okay, but needs to be more detailed on: How many hours per day could designers/developers dedidate? How could you calculate marketing cost? Finally, about the team, the proposer shows quite detailed of 5 members' profile: I know their name, how many years of experience as a Business Developer, Marketing Expert, Cardano Expert, Anthropologist and Chief Financial Officer with Linkedin provided, but lack developers and designers. After all, their solution is still at the idea stage, therefore, at this moment, it's hard to know exactly how this platform look like and the chance of success of this project. I think, it is better if the team could show any proof of work which shows their seriousness and ability in executing this project to some extent. ", "q1r": 4, "q2": "The auditability of this project is possible. To manage the development of the proposal, the proposer could base on some key metrics: the number of NGOs and donors enlisted, amount of crypto donations, amount of NFT and token reward to donors, the number of vendors, amounts of transactions,..Besides these indicators, I suggest the proposer to have offical channels for building strong community engagement and following the project such as social media, Discord, Github, website,..In addition, I recommend the proposer should have monthly report, might be in documents and share public to community to get more valuable feedbacks on improving your platform. Though the proposer doesn't have detailed KPIs for each phrase yet, but they provide some idea and milestones about the success of the project in the short-term, mid-term and long-term future. After all, this part is okay but needs to be more detailed.", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5629, "q0": "The problems identified by the proposal are closely aligned with the Challenge. Mismanagement and embezzlement of global humanitarian aid and donation is indeed a real-world problem which has been around for a long time. Besides, current Web 2.0 methods of managing donations can be extremely inefficient. I believe Cardano currently has the necessary infrastructure to ensure global donations are managed in a more efficient and transparent manner. The proposal sets out to be one of the pioneering Dapps to do just that. \n\nThe proposal also articulates clearly how it brings value to the Cardano ecosystem in terms of bringing substantial, impactful real-life use cases to the Blockchain, using Cardano infrastructure to create positive impacts to nation governance systems. What all these set out to accomplish for Cardano is allowing the world to finally interact with the Cardano ecosystem and discovering its tremendous use-cases to remedy what’s lacking in Web 2.0 technology. \n\n\tThe key metrics indicate a great potential impact for this proposal. \n\nI believe the proposal is highly scalable for future challenges as it is a rather neutral platform open to all NGOs of all nationalities and causes. Its neutral nature allows it to evolve over time. Besides, there are plans to generate team expenditure via 1% transaction fee for each donation, rendering it less reliant on future fundings. \n", "q0r": 5, "q1": "GIven the experience presented, this proposal conveys a huge confidence in the successful implementation of this proposal. However, given the technical infrastructure behind what the team proposed to build, I think the proposal can be greatly benefited from providing more explanation on the tech department. Specifically, what sort of qualifications are they looking for in their tech department? This is on top of the tech department being the most heavily funded department (at $64,000 out of the total requested fund of $84,000). \n\nI think the total requested budget of $84,000 is largely reasonable, given the amount of personnels needed in the tech department. However I think there should be more explanation on what entails marketing budget. Will the team be doing both online/offline marketing?; Are business trips to meeting stakeholders under the supposed marketing budget? These are the questions I have in mind while assessing the requested fund. \n\nWith regards to timeline, I think the team has done a great job in covering the best they can whilst providing a reasonable timeframe for themselves. Although Phase 2 - 4 are not detailed, it is completely understandable given the complex nature of this proposal such as requiring multiple parties from different industries and technical complexities. Besides, the proposal has conveyed greatly what they set out to do over the long-run. \n\nThe greatest challenge of this proposal is identified as many NGOs' potential unwillingness to participate in this project, rendering the project’s effort to onboard NGOs a huge feat. However, given the team’s capabilities, I am confident the team has what it takes to attract only the most innovative, sincere NGOs whose aim is to ensure donations and aid are utilised properly by their recipients. \n\nOn a side note, a factor that affects the proposal’s feasibility is its affiliation with the team’s proposal under Fund 9: DAO <3 Cardano. As this proposal is highly related to the aforementioned proposal, it should be expected that the success of this proposal will be heavily affected by the other proposal from the team. \n", "q1r": 3, "q2": "There is clarity in description of the targeted problem and how it is tied to the proposed solution and proposal. The roadmap is highly detailed with milestones and deliverables within the foreseeable future of December 2023. The team even went on describing its ultimate goal of creating a platform with legitimate NGOs being held to the highest level of accountability. \n\nMetrics identified are strong indicators of the project’s success as they are highly relevant to the project’s stipulated timeline and deliverables. \n\nAs far as auditability goes, I think the team can improve further by providing readers a summary of where progress of the project can be found (public channel to review project’s progress). For example, where exactly can the community find out about the number of participating NGOs and their background? Will the public have access to proof of expenditure from the NGOs? \n", "q2r": 4, "assessor": "z_assessor_2729", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8002, "q0": "The makers of the proposal want to create a centralized platform that ensures that NGO actions are auditable and suppliers are managed (transparent donations). The problem addressed here is that some NGOs run out of money after the funding. This platform would ensure that it is clearly visible how the NGOs use the money and how it is spent. The proposal could have a big impact on the Cardano ecosystem because all the people who have an NGO can use it and also the people who want to follow up on the transparency of the companies. A number of goals have been drawn up with a breakdown between donors, NGOs, sellers and Cardano. The benefits are clearly listed and provide a clear picture of how this project can make a positive contribution. Future challenges are included in the proposal. These risks can only be tackled if enough NGOs are willing to participate in this project. The advantage, of course, is that corrupt NGOs will not cooperate. This project can provide an important basis for distinguishing between corrupt NGOs and good NGOs. It's good that there are already forward-looking plans to expand the platform.", "q0r": 5, "q1": "A list of people with relevant experience needed to implement the proposal is included. Their experience is discussed in detail. The people can all be looked up via their twitter or linkedin. The proposal also states that a number of people still need to be hired (UX designer, Front-end developer, Back-end developer and Smart contract developer). There is a clear breakdown of the budget with the corresponding hourly wages. The budget seems to be sufficient to run everything. Most of the budget will be used to hire people. It might be useful to create a buffer if unexpected problems arise during development. The proposal states that they are creating an ecosystem with a long roadmap and so will return for additional funding. The project offers a realistic timetable divided into 5 phases. Sufficient time has been chosen between the different phases. The implementation plan is very clear and the objectives are certainly achievable. The biggest risk for this project will be to involve enough NGOs in this project. This project can certainly be a great success if enough NGOs are attracted.", "q1r": 5, "q2": "A comprehensive roadmap has been included with clear milestones for the project. The project is divided into 5 clear phases with the objectives per phase. The roadmap is very transparent and also includes the timeframe for each phase. A number of KPIs are included (number of NGOs, donors, donations, rewards for donors, number of suppliers, number of transactions). The team will use these KPIs per phase to measure success. It is good that the team has short term, medium term and long term goals. These are clearly defined and certainly achievable. The team wants to counter corrupt NGOs. By creating this platform, this can certainly be counteracted. The proposal is very transparent and the chosen KPIs are clearly measurable. It might be useful to share the measured results per phase via social media or a website.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8202, "q0": "\"The solution presented in the proposal is linked with the challenge. The proposer has proposed some benefits and outstanding features that the project will offer for particular entities (donors, NGOs, Vendors, and the Cardano system), which enables the community to easily assess the positive impacts of the project. It is no doubt that blockchain technology implementation will increase the transparency of donations distributed by NGOs and help them regain the trust of the community. However, it seems a bit vague to me about how blockchain will be applied in this project. Therefore, I think the team can add more details about this part in the proposal so that the Catalyst community can smoothly go through the ideas. \nAs the team mentioned, I can see the biggest challenge is in approaching NGOs and making them understand the solution. I think the community would expect a detailed strategy for this problem so the proposers can add information about the marketing plan or provide educational materials for those who don’t have enough knowledge about blockchains. \n\"", "q0r": 4, "q1": "\"The roadmap is clear and covers a specific timeline, deliverables and milestones over time. There are 5 phases in the project’s execution process, followed by main activities, which allow the community to follow and assess the workload in an efficient way. The budget breakdown is reasonable given mostly the compensation of staff’s salary. However, the distribution is a bit unspecific. For instance, I expect more details regarding the activities in the promotion process (marketing), required steps, and corresponding funding allocations. \nThe team members are well described, the relevant working experiences mentioned will be the verification of their full capability to efficiently run the project. Personal contacts (LinkedIn accounts) are also provided to support the assessment process.\n\"", "q1r": 4, "q2": "\"The relevant KPIs are provided making the auditing process easier and more transparent. These indicators are well aligned with the set goals and good for tracking the progress, as the expected outcomes would clearly highlight the platform’s adoption thus proving the development of the project.\nThe team also visualized the success of the project in a clear manner including specific goals for short, mid and long-term periods. This vision will help the team stay focused and modify any off-tracks that might happen. \n\"", "q2r": 5, "assessor": "z_assessor_2966", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9454, "q0": "The project proposal is a clear example of commitment to one of the four strategic goals of Catalyst Fund9, namely - Build real-world solutions based on the Cardano blockchain. The idea of ​​creating a transparent and verifiable system for financial relationships between donors and NGOs has the potential to gain great importance and have a serious impact.\n \nThe successful implementation of the project using the possibilities of the Cardano blockchain will be proof of the possibilities of blockchain technologies to serve to solve real social problems - lack of oversight and transparency in NGO funding, misuse of funds and corruption, money laundering etc.\n \nThe project team has identified three risks that could prevent the project from successful delivery. They are related to lack of belief in the efficiency of blockchain, lack of knowledge/information about blockchains and refusals of NGOs to be transparent. The team describes a strategy to overcome each of the identified risks.\n", "q0r": 5, "q1": "The timeline and the plan behind this project is bigger than this project proposal. The team defines 4 phases of the implementation of the project and this proposal is targeting funding for only phase 1. This stage lasts 4 months and is described in detail.\n \nThe budget has specific rates by hours and duration of work. The prices are precisely calculated according to each task and the duration of the work for its implementation. In addition to the tasks of the specialists who will develop the platform, the tasks of each member of the project implementation team are also clearly described.\n \nAll team members are presented with a short CV and a link to more information. The professional experience and expertise of each of them is directly aimed at the implementation of the project - Business Developer, Interior Architect background and cryptocurrency enthusiast and investor, accountant for wholesale, retail and manufacturing industry, Marketing Expert, researcher of social and human science with UNESCO working on SDG.\n", "q1r": 5, "q2": "There are clear and understandable KPI identified in line with the proposed activities. Measuring the progress of the project will be   mainly focused on the timeline for launching the platform. After the testing finishes and feedback is collected through focus groups the success will be measured by reaching targets for onboarding NGOs and donors (100 NGOs and 150 donors)\n", "q2r": 5, "assessor": "z_assessor_3061", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9664, "q0": "Transparency, which is the most important aspect of any transaction, would be ensured with the use of blockchain technology. By assessing the problem that causes NGOs to lose funds, the proposer proposed a solution while also benefiting the Cardano community. The separate KPIs for each subject are carefully worded and match to the challenge.Many risks were discussed in good detail, indicating that the proposer and his team thought about every possible eventuality. However, in my opinion, the answers to such risks may be more clearly defined. Please explain in full how to approach NGOs in a professional way. Add some related experience from your team, for example, to potentially develop some contacts and ways to recruit NGOs.", "q0r": 5, "q1": "The plan is pretty detailed. It was concluded that practically all activities, even the simplest, had to be completed. When I look at this plan, I feel pretty convinced. According to the proposal, the entire funding for round 9 is for Phase 1. I got the opportunity to evaluate a similar proposal, and they already request ten times the budget. Giving a thorough proposal only for phase 1 indicates that the team has planned properly for this and has a long-term goal. A plus when the team consults with Cardano Developers to accurately determine the budget. The team members and their experience were also provided, and I believe that their qualifications are adequate to ensure the success of this plan. I give it 5 stars.", "q1r": 5, "q2": "The proposer has identified the KPIs, SOPs, and target numbers for monitoring. However, I believe that more could be said about how they would be measured and for how long, perhaps one week, two weeks period...? Describe how the community can keep track of the development process. A small paragraph following each bullet point may make it easier to understand.", "q2r": 3, "assessor": "z_assessor_3080", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10375, "q0": "The proposal which the team suggests is a great idea for Ngos. This project is a decentralized project built on Cardano blockchain so it will create a clean environment for vendors, donors and Ngos. This project will attract many people to participate. The more people involved, the more known Cardano will be. Cardano will also become a trusted platform that attracts Ngos and users.", "q0r": 5, "q1": "The proposal's team are an experienced and professional team. They are still hiring more designers and developers. Their team has Mohammad Mneimneh, I follow him on Twitter and as far as I know, he is a “Pavia.io Creator Program Verified” on Pavia Metaverse (Pavia is one of the first Metaverse projects on Cardano). He has many beautiful designs and often interacts on Twitter. So, I think that hiring more staff members will not be a big deal for their team if they get funds. Their phases for development are very detailed. Their suggested budget is $84000. In that budget, they will spend $20000 on marketing. I think that number is reasonable because, for this platform, marketing is one of the most important parts.", "q1r": 5, "q2": "They have a good plan for development phases. They give specific target numbers for key metrics in short-term. In the mid-term and long-term, they will continue developing more specific target numbers and their platform. They also have very detailed KPIs but I think they should also develop social media channels such as Twitter, Discord, and Telegram so the community can track their progress. The team should publicize their documents on Github. That helps the project more decentralized.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11925, "q0": "The proposal wanted to develop a dApp as a new platform of donation for the NGO to use. Each payments will be made in the Cardano blockchain to ensure its transparency and easier international scale payment. The project would bring a new opportunities of onboarding user and transaction potential for Cardano network to be included in, resulting in the bigger impact of Cardano usage in the international scale through supporting donation and NGO activities. This solution also will scale efficiently on handling the main issue of non-transparent NGO transaction and activities, resulting in the main objective of the project, regaining trust of donations.\n\nThe plan has been explained concisely and very detailed, thus I would say that I have confidence the project can be implemented successfully. Proposers has considered the risk outside of the technical development which are the cooperation of NGOs and the people outside the chain itself, yet, every risk is answered with logical and feasible mitigation.", "q0r": 5, "q1": "Milestones and action items for the project has been defined clearly, with each months from Sep 2022 to December 2023 included the work of technical development and social approach (NGOs and people research). The proposal has even included their further plan in more phases, with also a broader roadmap and long term goal defined. \n\nThe budget has been broken down very detailed including the total cost of each workload and items with the cost per hour/item detailed down.\n\nEach member backgrounds information and related skill has also been provided along with their Linkedin URL to check their credibility.", "q1r": 5, "q2": "A very concise items to audit the project progress and the final result has been provided, such as from numbers of NGOs listed , numbers of donors, amount of transactions, and finished KPI or milestones in each respective given time. All of the stated goals has already been very clear and measurable.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14357, "q0": "This proposal effectively addresses the challenge. The idea of creating a dapp where donors can donate to their favorite NGO and making the process transparent has a huge impact globally. It is solving a major problem worldwide.\nThe case study listed by the team members highlights their direct experience with the problem, and from there they came up with a solution.\nThe proposal has a huge impact on the Cardano blockchain. This will bring an exposure to the Cardano blockchain as well as increasing its adoption globally.\nThe risks stated by the proposer are logical and the way of mitigating those risks are reasonable and feasible. The team has put thoughts in those risks and challenges.\n", "q0r": 5, "q1": "The proposal has a detailed plan and structured in a clear way. The proposer has stated specific dates for each step, which is helpful for auditing. He even added the whole roadmap for the project to give a broader vision for the community. \nThe detailed budget is specific and clear. The budget requested for the MVP its marketing is reasonable. The time frame stated is good considering the MVP has good features to implement.\nThe team behind the project has the relevant experience to launch the platform, but in the future, they need to expand the team to include technical members.\nA good gesture to breakdown the task of each team member publicly. \n", "q1r": 5, "q2": "The team has detailed the roadmap with specific dates, which makes the process of auditability easier. The project progress can be easily measured\nThe KPIs chosen are relevant to the project, and the team chose KPIs for the development of the MVP and for the launch of the MVP.\nThe proposal in general is very detailed and the dates are mainly used to showcase auditability. The success of the project is also based on a timeline.\nTheir SDG is a bit vague, considering that they don’t tackle a specific SDG, but I would have liked to see KPIs for specific SDGs.", "q2r": 5, "assessor": "z_assessor_3998", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14579, "q0": "This proposal is geared towards NGOs and donors facing the problem of a lack of transparency about the facts of abuse and theft. I find this proposal to be challenging and highly impactful on the Cardano ecosystem. They build a platform on the Cardano blockchain, connecting donors with NGOs from around the globe. With no option to edit or delete the blockchain database, NGOs will not be able to edit the amount once registered. They also come up with the desired outcomes after implementation, that is, after the introduction, the suppliers are linked to NGOs on the Blockchain, which incentivizes the vendors not to accept Cryptocurrency payments join the Cardano ecosystem as a new potential market emerges. Accordingly, the contributions being distributed will be shown transparently; increases the traceability of NGOs to avoid mismanagement or theft. In this section, the proposer details the possible challenges faced by donors, NGOs, vendors and Cardano. In addition, they also identify risks not only from Cardano's internal factors but also from external factors, thereby suggesting practical solutions to minimize each risk.", "q0r": 5, "q1": "As for the feasibility, I highly appreciate this proposal, as their team has clearly and thoroughly demonstrated the roadmap, important milestones of the plan and their outputs in each segment of the project. that route. In addition, they also provide detailed and transparent expenses that they will need to use the budget to spend on it. They estimate items such as hourly wages and other necessary assets/expenses (UX design UI and marketing budget). About the team members, including Raphael Ibrahim: Business Founder/Developer, Marie-Claude Abou Khalil: Marketing Specialist, Mohammad Mneimneh: Cardano Expert, Zuha El Helou: Anthropologist and Fadi Tawile: Chief Financial Officer, all of them have long experience in their field of operation. So, I believe, their proposal will be really successful.", "q1r": 5, "q2": "This proposal provides clear quantitative metrics, and all KPIs, SOPs and target numbers for the above indicators are developed for each period to measure progress and align with the project target. This proposal is also described in three phases (short term, medium term and long term) so that we can track whether their team is accomplishing the goals of this proposal. In addition, this proposal provides another prosal under the same project: Sustainable Development Goals (SDG) Rating, which increases the likelihood of convincing donors when there is a previous successful demonstration.", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14892, "q0": "The project is reaching out to donors to NGOs around the world to help raise money for the people. I think we should add examples such as because of the covid epidemic, we have lost our jobs, we have no money to cover our living expenses, or we can also highlight the poor families who lack food to call for the support that the project will bring. Blockchain technology produces a process that is quite secure and allows only precise execution without modification, I find the system to be quite strict and transparent when it comes to money. The team provides the benefits that the project brings as well as the example for the reader to easily imagine, I like how the team communicates clearly and completely. All transactions are provided with evidence, so it is completely possible to be authentic and work seriously without lying. I see that the team has not presented the results it brings, but only talks about the difficulties that will be encountered. . The team needs to mention some more consequences that will happen when the project is completed such as better people's lives or creating conditions for everyone to have better conditions. The project has a clear and quite complete KPI but has not yet stated the results in sync with it, it is possible to use the examples I mentioned earlier. But the team does a good job of bringing out each individual  and not missing anyone, which is a good thing that shows the connection between individuals. Each division benefits and operates fairly.The challenges they present are very good, showing the care and understanding in the project. The good thing is that some organizations will not agree to the project terms or refuse to verify the transparency, the team offers a very good solution, not too fussy for people who are not experts in it to also nod agree. Non-transparent transactions need to be banned and the team have showed it.", "q0r": 3, "q1": "At first I saw that each stage was laid out very clearly with a very complete estimated time. Phase 1 focuses more on design but needs to be said more workers will be implemented. The next stages are presented convincingly and fully understandable. But the last two stages should add more time and some more in-depth explanation. The team's cost for each item is very clear, mainly the cost of machines and materials. I think it should be added to the average salary of personnel. At the end of the team, the total amount is also shown very accurately and aggregated for easy tracking. Team members have a full profile of information including name, position and number of years of experience. The team is even more careful to have a very good link likedin for each person. I believe with these talented individuals the project will develop very well. But perhaps the team is still missing a few positions but has already stated who they need to recruit, so they should  add a requirement for more years of experience to help the project develop further.", "q1r": 4, "q2": "The team has not given a clear number, for example, when it comes to how many things have to be shown or the amount of money, it has to say the average price. There are activities that need to be grasped to measure progress, they are very complete and clear. I like how the team is divided into several terms, it is very clear in each phase. For example, in what time period will match which results, I can hardly see any errors in the 3 terms.", "q2r": 4, "assessor": "z_assessor_4108", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Develop an interoperable, scalable & decentralized platform that mediates transparent transactions between donors & NGOs to ensure legitimacy of both ends & revive the trust between all parties.", "experience": "Team with 10 years of solid experience in human rights and social work, marketing, entrepreneurship & auditing. Our team is solely focusing on the Cardano blockchain for the values it represents.\nWe are passionate about finding solutions to critical problems in the crypto space."}