{"id": 415094, "author": "qin.li", "title": "Pay&Rate Reputation System", "url": "https://cardano.ideascale.com/a/dtd/415094-48088", "category": 26595, "amount": 22800, "description": "Reputation system is an essential component for e-marketplaces to facilitate business transactions and fostering honest behavior. Cardano lacks a decentralized reputation system for e-marketplaces.", "f6_no_assessments": 7, "f6_rating": 3.9047619047619047, "videos": [], "media": [], "f6_assessments": [{"id": 14704, "q0": "\"Reputation system is an essential component for e-marketplaces to facilitate business transactions and fostering honest behavior, so the Pay&Rate reputation system is created for marketplaces in Cardano, and has the impact to Cardano ecosystem. This reputation system has the features: open-source, community-driven, decentralized, immutable, transparent, highly scalable, marketplace-independent, and secure. In the proposal, the Pay&Rate reputation system includes four components: Pay&Rate smart contracts, Governance smart contracts, Governance DAO, Governance treasure. These components are interconnected: the creation and update of reputation smart contracts is the task of governance smart contracts; Pay&Rate contract is created by interacting with a governance smart contract via the Governance DAO’s website;  the governance DAO controlls and operates the governance smart contract, and manages the governance treasury. The functions of the Pay&Rate reputation system in general or of the Pay&Rate smart contract in particular is supporting payments and maintains the ratings, reviews, and reputation score regarding sellers with respect to a specific service or product that they sells. At once, with the reputation smart contract, the buyers can also retrieve the latest reputation score of the seller with respect to the service or product, then they will provide a new rating and review to the reputation smart contract using the rating token. \nThrough the Cardano smart contract and the eUTxO model, the proposer gives the Pay&Rate reputation system for marketplaces in Cardano eco-system, with the outstanding features when compared with the reputation systems commonly seen in web 2.0 online marketplaces. The features as “open-source, community-driven, decentralized, immutable, transparent, highly scalable, marketplace-independent, and secure” build users’ trust in the Pay&Rate reputation system, but haven’t clearly shown their results able to affect how the KPI/Key metrics of the challenge. \nThrough the proposal, the major risk which the project will be meet is a lack of adoption from marketplaces. The proposer has already advanced how to mitigate by incorporating an incentive mechanism into the governance DAO tokenomics that incentivizes marketplaces in the Cardano eco-system to adopt the Pay&Rate reputation system. With this solution and the Pay&Rate reputation system outstanding features, the proposal entirely aligns with the challenge’s objectives.\n\"", "q0r": 4, "q1": "\"The information is exposed above that the Pay&Rate reputation system is built with four interconnected components: Pay&Rate smart contracts, Governance smart contracts, Governance DAO, Governance treasure. This proposal only deliver the solution in Phase 1 – developing components of facing user, including: Pay&Rate smart contract with corresponding off-chain code, and Governance smart contract with corresponding off-chain code. The Governance DAO which keeps the role of controlling and operating the governance smart contract is developed in this proposal. Futhermore, the proposal have’t get a detailed plan and a clear roadmap with specific milestones for developing these components, as well as the explanations for the technical aspects to implement the plan. \nThe budget breakdown for the project in phase 1 is too general, there is no division in each payment item. With this undetailed budget breakdown and a spare timeline, the plan given by the team isn’t enough to achieve the desired targets. In my opinion, the proposer should clearly bullet the expenses pay for what items, as salary, equipment, marketing,…., and these expenses must be suitable for the rewritten detailed plan for developing every component.\nFor the team members, people who work on the phase 1 of project, author didn’t identify the relevant information, as name, position, skill, experience,… None of the team is working on any other proposals from current or previous Funds, even we didn’t have any evidence of their ability to carry out the activities mentioned in the proposal.\n\"", "q1r": 1, "q2": "\"Through the proposal, the writer will track the progress on Phase 1 of the project by measuring the level of progress in percentile on the tasks: development and test of Pay&Rate smart contract and of its corresponding off-chain code, of governance smart contract and of its corresponding off-chain code, development and test of the website and deployment of it. At once, they also measure the level of adoption by the clear quantitative indicators as the number of marketplaces adopting the Pay&Rate reputation system, the number of reputation smart contracts created, and the average number of ratings and reviews reported to reputation smart contracts. However, they haven’t shown how they will measure these progresses, and by what manners.\nThe success of the project is shown after the project has completed in both phases: in phase 1, a working website is available so that sellers can create and initialize Pay&Rate smart contracts by using the governance smart contract, and working Pay&Rate smart contracts are running on Cardano; and in phase 2, a well-designed governance DAO tokenomics integrate the incentive mechanism, a working governance treasure and a working governance DAO are running on Cardano, a working ballet-box stuffing attack detection system and a open collaboration platform. The project also succeeds based on the clear quantitative indicators that the largest successes are shown at least 1 marketplace adopting this Pay&Rate reputation system within 3 months after the completion of Phase 1, and the expenditure to operate the governance DAO and its revenue breaking even 3 years after completion of Phase 2 and subsequently becoming self-sustainable in finance.   \nThe team is really serious and clear about their goals, the results expose sufficent for indicators, milestones, Sustainable Development Goals (SDG), Key Performance Indicator (KPI),….. However, the proposer need bring out the compatibleness between the proposal with Sustainable Development Goals (SDG).\n\"", "q2r": 3, "assessor": "z_assessor_4097", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1200, "q0": "This is a practical idea proposition when they want to develop a decentralized reputation system. In the internet/online space, privacy is paramount, and a lot of people are willing to pay more every day to fulfill this need. The cardano ecosystem is in the early stages of developing decentralized applications. Therefore, this application will help it become more useful and trusted by large organizations, as well as commercial companies and individuals who need this service.\nThey adopt Reputation smart contracts, Governance smart contracts are governed below by the DAO mechanism for this entire system, ensuring smooth operation and user-friendly individual end-users.", "q0r": 5, "q1": "Their project is divided into 2 major phases. In this proposal they have shared, this proposal focuses on phase 1 - focusing on user-oriented applications. After this phase 1, a website will be born and end users can start creating their first reputable security contracts.\nThis entire phase 1 will be done in about 8 months. I think this time period is reasonable for such a complex application development.\nThey will publish the code on github - a reputable enough website and easily accessible for everyone.\nRegarding the proposed budget, unfortunately they write quite a bit of this content. The human resources section also has only 2 people and there is no clear information about previous work experience as well as linkedin profile. Therefore, I cannot give a high score in this section.", "q1r": 4, "q2": "In this content, they give full parameters for project progress as well as numerical goals for the project. Specifically: They will report on the development and testing of reputation smart contracts, development and test of the governance smart contract...\nAnd the target numbers show the seriousness of this project: After 2 years 30% of marketplaces in the Cardano eco-system adopt this reputation system; After 3 years this figure is 50%. This is an encouraging thing.\nThe objective is consistent with the entire body of the proposal. However, they should also add a few effective marketing methods to attract users in the future (maybe in the second stage of the fund later if they continue to apply for funding from catalyst). After all, this piece of content earned my full marks.", "q2r": 5, "assessor": "z_assessor_2217", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9926, "q0": "Reputation systems will certainly be one of the most important information systems for resource allocation in the future. Basically any track record may be used to build up a reputation if there are tools available for it. I find experimenting and developing practical reputation tools very important. The proposal defines a reputation system infrastructure which is structured to different elements. This approach gives it a wide applicability to many different services. Each type of action which can be rated has its own smart contract governed by a governance smart contract governed by the governance DAO which' operations again are funded by the governance treasury. When implemented, the utility of integrable DAO tools increases which is well aligned with the challenge. \n\nAll kinds of reputation systems can be expected to grow and evolve rapidly alongside self-sovereign identities. Reputation is primarily an identity linked asset. By combining the purchase (transferable value) and reputation rating (identity linked value), this proposal integrates these two different information systems. That again addresses the challenge perfectly. \n\nThe DAO element described in this proposal enables the system to work dynamically and keep updating itself when new solutions become possible as well as increases its objective resiliency over the long term. The risk of becoming stagnant or corrupted decreases. If successful, this project provides additional incentives to use applications and marketplaces embracing this solution and thus bring them new customers and grow the ecosystem. ", "q0r": 5, "q1": "The project is divided into 2 phases. The first phase is about developing the needed smart contracts and user interfaces to perform ratings. The second phase is about building the DAO and governance components. This funding round covers phase 1 and the second phase is planned to be funded through tokenomic actions at the time of the DAO creation. I see the risk that there is not enough interest (and thus funding) in this second phase. However, it is not required for a successful implementation of the proposal in the extent as it is described in the phase 1. \n\nThere are directive time estimates for implementation available. The budget breakdown could be more detailed. The total budget is reasonable and planned to be allocated between two developers. The proposer holds a PhD in information security focusing on reputation systems and he is also a Plutus pioneer. The other team member is a web developer and some information/track record is available on the project’s GitHub pages. The implementers should be capable of finishing the work described in the proposal but the dependence on these key contributors introduces a small extra risk. ", "q1r": 3, "q2": "Phase 1 has been divided into six development steps in which the progress will be measured separately. It would be good if the project reported regularly about the progress or told how the outsider can access that information. The solid roadmap makes it a very viable possibility. When the system is in place, the KPIs include multiple different quantifiable metrics about the adoption of the protocol. The proposal also provides several timed goals for gaining use and traction among marketplaces and end-users. The success level in estimating these metrics gives useful information for the future project planning, not only to this team but to everyone else as well. \n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10533, "q0": "This projet seeksto bring more impactful uses to cardano by setting up a decentralized, community-driven review system, so that sellers and buyers can feel more safe and confident to make transactions within the cardano ecosystem. This idea answers the challenge very well. If done well, all parties will feel safer navigating the cardano marketplace, and make more transactions through it. The author proposes open-source code, enabling more transparency to make sure the review system is fair to all parties. The added security measures will help immensely with authenticity of reviews. The high scalability will really help facilitate implementation of this system on a wide variety of sites and platforms, allowing people easier access into the cardano eco system.", "q0r": 4, "q1": "The main concern that could impact feasibility is the risk of not many people using the system. For this, the team is researching an incentive program. I think this incentive mechanism will be the key factor to how successful this reputation system will be. However, the team is only seekingfunding for the coding and developing aspect of this project for now. The author's qualifications are more than enough to deliver on the coding and development phase of this project. The allotted budget for coding seems fair and reasonable. I believe there will be no big issues during this first phase of development, and the product will be delivered as planned.", "q1r": 5, "q2": "The source code is completely open-source and available at any time on the author's GitHub, we will be able to completely monitor the progress of this project. The author also provides a very detailed timeline, which in addition to the github can tell us if the project is proceeding according to plan. As this first phase is only about delivering the code and website, there will be absolutely no issues auditing this project as these elements will be completely visible publicly.", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12246, "q0": "The proposal fits the challenge. By leveraging the Cardano smart contract and the eUTxO model, they propose a novel native Cardano Pay&Rate reputation system for marketplaces in Cardano ecosystem. The use case for an e-commerce focused reputation system definitely has the potential to positively impact our ecosystem and industry. A functioning reputation system creates trust and can improve the quality in the e-commerce sector in terms of ratings in particular through broad acceptance. This is especially important for a decentralized system.  The team has elaborated the proposal well and derives the solution approach well. It describes step by step which components are considered and which different roles and parameters are integrated into the system. In principle, I find the idea valuable and support this approach in principle.\n", "q0r": 5, "q1": "The plan for implementation is described only briefly, but the detailed description of the solution quickly makes it clear what is meant by which step. Overall, however, I have doubts whether the budget does not seem too low. For the creation of such a protocol, I would set significantly more time and budget. To better understand this step it would be helpful if the proposer would list the number of estimated hours per task including hourly rate. Furthermore, a detailed description of the team is missing. This is a pity, because so I have to give a low rating, although I like this idea. However, the plan to implement this idea is not mature enough.\n", "q1r": 3, "q2": "There is a rough schedule listed in the proposal. Unfortunately, the proposal does not indicate how or where the community can track the progress of the proposal. At least a Github page is mentioned, but it would be nice if there was a direct statement of how we can evaluate the team's audit process. A number of metrics are presented. Also, the proposer explains in detail how they define success. What is still missing for me is a good approach to go-to-market. The Proposer recognizes the risk, but doesn't mention in enough detail how he manages the risk. Overall, I rate the proposal positively, but due to the rather superficial information regarding implementation and auditability, I cannot give it a better rating. \n", "q2r": 3, "assessor": "z_assessor_3370", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14725, "q0": "\"Thanks to the blockchain technology and decentralization; the money transactions now are more convenient and secured compared to the traditional ways. However, since the buyers/sellers are anonymous, there are risks of scammers. I agree with the idea that Cardano needs a decentralized reputation system for e-marketplaces. \nPay&Rate offered this solution. The proposers described in-depth about the Pay&Rate system and how does it work. The Pay&Rate system includes four main components: Pay&Rate smart contracts (support payments & maintain ratings), Governance smart contracts (update smart contracts), Governance DAO (operation system), Governance treasure (place to keep the asset). Each component played a vital role in the Pay&Rate system. \nIn terms of the risk, I agree with the proposers, that there is a lack of adoption of this system into the marketplace. I think the Cardano system should advocate the use of this system (if the platform is successful) since this is a win-win situation. The Cardano system will be beneficial by a boost of users to join the ecosystem, since the e-marketplaces with blockchain-based attract great interest nowadays. The solution of this proposal is well aligned with the challenge. \"", "q0r": 5, "q1": "\"This proposal is only about phase one of the project. Still, the proposers listed out the tasks and time needed for the phase one. However, in my opinion, the proposers should break down the tasks into several smaller tasks for the readers to evaluate the feasibility of this part. For example, for website creating, the sub-tasks could be website conceptualization, website designing, coding, etc. Then, it would be clearer if the proposers put the exact date for each sub-task. \nThe proposer did a good job when allocating the fund needed in accordance with the roadmap. However, the proposers should give clear explanations on how they come up with these numbers e.g., how does website creation cost 4800 USD. The core team members should be more specific (maybe the project is in the recruitment phase), it would be better if the proposers attached some information of the members e.g., CV or LinkedIn profiles. This background information is essential for readers to evaluate if the team has sufficient work experiences relevant to blockchain technology to assure the feasibility of the project.\"", "q1r": 4, "q2": "\"The metrics and KPIs set up were logical and sufficient. To make it more convenient to the community when it comes to auditing, it would be more fulfilling if the proposers provided the exact number of KPIs/metrics the proposers are aiming to (for example the numbers of adopting marketplaces, smart contracts created, etc.), and also an in-detail measurement methods for each KPI/metric.\nThe great success scenarios were well provided and can be audited by the followers. The Sustainable Development Goals Rating was used here since the project is related to the society.\"", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14963, "q0": "Initially, I believe this idea is essential and efficient in this era where the covid-19 pandemic devastated the whole world’s economy and the application of e-marketplaces has never been more realistic. Overall, the information offered in this section is well-prepared and explained thoroughly. The general mechanism of Pay&Rate is to build a reputation system so that sellers can reach more customers through increasing their credibility and buyers can make a worthy purchase among different choices. The application is based on 4 components, which are: Pay&Rate smart contracts, Governance smart contracts, Governance DAO and Governance treasure. These 4 components interact with each other to automatically upgrade the system and limit as many flaws and bugs as possible. I feel like the intention of the developing team is to reduce as much humans’ intervention as possible in order to create a community-driven and transparent marketplace environment, and I totally agree with it. One outstanding feature that the application contains, which impressed me, is that the reputation smart contracts are made for each product and service that a seller provides. Not only does this help customers avoid unrelated ratings and consume carefully but also it shows sellers what product or service needs to be improved. Other features being mentioned are open-source, decentralization, immutability, high scalability, marketplace independence and security. All of these resulted from an effective application of block-chain technology, which makes the project special and creates a big competitive advantage. I believe this proposal is well-aligned with the challenge settings, potentially widens the Cardano ecosystem and attracts more users to Cardano. One and only minus point, in my opinion, is that the risk stated by the writer was not mitigated properly. A more specific explanation of how they plan to attract more adoptions, not only inside but also outside the Cardano ecosystem, would give assessors a more objective point of view.", "q0r": 4, "q1": "The plan to deliver the solution is clearly divided into 2 different phases, user-facing components development and system governance components development. The purpose for this proposal is seeking funds for phase 1 only. Nevertheless, the team provided the whole detailed plan, with the amount of time needed for each activity, in order to draw a better imagination about what would happen after funding. However, I suggest adding more specific dates or timeline for each milestone to clarify on when the first steps are actualized. Besides, I think the budget breakdown is still too general. My suggestion is that the developing team should explain more about some concerned problems such as: what programming languages would be used, what the website would look like and what categories are contained in it,... Answering these questions would be very helpful to evaluate the amount of money requested. Finally, the proposer mentioned a team of 2 for developing and deploying the first phase, though, I do not think it is convincing enough. There should be a portfolio introducing their professions, achievements as well as experiences briefly. This would assure that they are suitable for the project and increase the feasibility of it.", "q1r": 2, "q2": "The key metrics provided in this section are quite detailed. Especially, the measures of success are prepared thoroughly and presented in a logical order. Moreover, the SDGs and KPIs mentioned are also clear as well as reasonable for the clarity of the project. On the other hand, some particular tool or application should be used to keep track of the progress and understand what is going on at the moment. Another point I want to make is that the team should work out on what actions should be taken in the case of KPIs settled are not achievable. Contingency plans would help the team improvise in case problems arise.", "q2r": 4, "assessor": "z_assessor_4118", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "A Pay&Rate reputation system for marketplaces in Cardano, which features open-source, community-driven, decentralized, immutable, transparent, highly scalable, marketplace-independent, and secure.", "experience": "I have a PhD degree in Information Security with research focus on designing and analysis of reputation systems.\nI am a Plutus Pioneer Program first cohort pioneer.\nI am also an intern from MLabs focusing on smart contract testing and auditing."}