{"id": 415157, "author": "tellus2", "title": "Tellus2 – Gamifying Sustainability", "url": "https://cardano.ideascale.com/a/dtd/415157-48088", "category": 26595, "amount": 160000, "description": "Negative human environment interaction and climate change is continuing, partly due to people making the wrong choices.\nhttps://www.youtube.com/embed/tjULI1bkOHg  ", "f6_no_assessments": 7, "f6_rating": 4.095238095238095, "videos": [], "media": [], "f6_assessments": [{"id": 1635, "q0": "The dApp in question attends very well to the objectives of the challenge. I believe that the project has a lot of potential, and its theory is fully in line with what we are looking for at the moment, although some things regarding the gameplay could have been more clarified, in my opinion. Starting with the problematization, the key situation to be resolved here would be, in general, the environmental problems. This is very clear in the excerpts: \"Tellus2 will be our next generation sustainable metaversion of planet Earth (Tellus), will be populated by our NFT avatars, the Tellusians, will be influenced by the community to a large extent, which is the Tell us too part. Tellus2 was created to fulfill people's will to truly live sustainably in every aspect and be an NFT Metaverse with a real impact on sustainability through its hand-picked collaboration partners.” In other words, the proposed solution would be to create a metaverse, called Tellus2, where players would possess avatars (NFTs), and could interact with the real world through their actions in the metaverse (and vice versa too, an attitude in the metaverse would impact the real world and a real attitude would impact the metaverse ). The avatars, called Tellusians, would be hand-drawn, that is, they would be very handcrafted and exclusive. The idea is that people have fun playing and at the same time perform ambitious actions. mentally positive. An example given to understand how the game works would be the following, that when you buy a jacket in the real world your NFT would receive a jacket (if the company that sold the clothing was a partner of the game). Also, for example, if you plant a tree in the metaverse, some partner company would do the planting in the real world. The idea is that various areas such as “Energy, Transport, Food, Clothing Recycling and reuse” and etc would be part of the project. The problem I identify here would be exactly this - how can we ensure that all these areas are covered? I think it would be very positive if the proponent had already specified some companies that would be partners with the game, as well as some other actions that would be reflected from the metaverse to the real world and vice versa. That is, to have extended a little more in the explanations of the practical cases. Moving forward in the analysis, I found it very interesting how they defined that Cardano would be a perfect blockchain for the establishment of the game, due to its sustainable operation, which uses little electricity. Accessibility is also facilitated and fees are low and predictable, making our network very suitable for project development. It is also very positive, as the proponent raises a series of challenges and possible risks, already pointing out how these could be resolved. For example transforming artworks into NFTs, how can this be fixed; how the lack of public reach can compromise the core of this proposal and how this can be resolved, and many other cases. Overall, I believe this proposal has the potential for maximum impact, although some doubts were still present when reading the full scope of the proposal. The most interesting thing is in relation to the universe that would be created, although some more details could have been presented, the proposal has, in my view, the maximum potential to bring benefits to Cardano.", "q0r": 5, "q1": "Talking about the script, despite the temporality not being divided into months, as I usually suggest, the level of detail of what will be done is really very rich, as we can see in the excerpt that says about marketing: “Our Discord server is ready to go, as well as our Twitter account. We have prepared a big amount of educational tweets about our project and will be very active here, 2 tweets daily minimum. We will actively interact with other individuals and projects across the crypto space”. We know for sure what will be developed, in which quarter and how; we know the objectives of each activity and also what has been done so far, such as the creation of the business plan, marketing plan, programming of vending machines, etc. In other words, the script is very good in terms of the level of specificity about what would be done, but it would be even more interesting if the proponent had divided the whole into months (this would add even more clarity in our understanding) . But the way this information is passed on, we do have a solid understanding of what's to come. The other points of feasibility, however, could be better explored. For example, let's think about budget analysis. The asking amount is very high, 160 thousand dollars. It is divided into a few parts (the biggest of which is the metaverse development, with blockchain programming). $130,000 is earmarked for this, and $10,000 for marketing and legal issues. I think each part could be better broken down. For example, metaverse development: 2 developers would be hired for 6 months. But after that time, what would the team look like? Would it still be a duo, would more people be hired? What would be the monthly salary of developers? Would they work full-time, or part-time? I believe an amount as high as 130k dollars should have been better justified. I believe it is compatible with the complexity of the project, but this does not eliminate our need to understand exactly what would be done. Talking about marketing, it is said that “paid advertisements, paid partnerships, participation in events, internal expenses” would be made. More details should also have been provided. Legal expenses would also be 10k, how would such needs be justified? Finally, looking at the team, this part should have been better detailed as well. Let's look at the examples: “Kok-Wing Giang – Programmer and cryptography expert”. Does he have experience programming on Plutus? About Annie Hallén AD, I would love to see some examples of digital art she has already produced. Generally speaking, it would be interesting for each of them to have a better detailed resume and for their linkedin profiles to be attached as well. They also intend to hire new professionals, as is clear in the excerpt “To be able to create a first version (there will be community driven improvements and developments) of our Metaverse we need external expertise on game and 3D model development. Our plan is to hand pick two developers to work with us a year to start with to develop the first version of our Metaverse”. It would be ideal if we already had all team members properly selected and well presented, so that more confidence in the team in general would be conveyed. In other words, feasibility is good, but not perfect, we have things to work on here.", "q1r": 4, "q2": "Progress can even be measured by some information passed in the impact part. For example, the proponent states that an informative video about the idea and monthly updates about the project will be made available on Youtube. This is already a way of auditing the partial results. It is also said that podcasts will be contacted and that there will be participation in well-established NFT events. These are also ways to find out how the project is being implemented. Some specific KPIs would also be the “Number of NFT avatars sold\nAmount of activity on our social media channels / Number of active Tellus2 Metaverse users / Partnerships established in the aforementioned areas / How often our partnership-driven sustainability actions occur.” I think we have a good base of information on which we could monitor the progress of the project. Furthermore, I would like to suggest that the monthly updates also comment on the development process itself, that is, what has been done behind these achieved products, the work routine of the professionals involved, and so on. For example: if the digital artist was able to deliver the number of drawings that were agreed, how has their production process been, if difficulties were encountered and how they were mitigated. In general, the project can be satisfactorily audited for progress, even if this part is not yet perfect. As for success, in my view the proponent is based much more on the development of Trellus2 than on Cardano's goals in funding this project. How can we be sure that the project was as impactful for Cardano as it sets out to be? I agree that we need to understand if the project worked, if the metaverse became popular, if more people started to participate in the technology and carried out sustainable actions at the same time, and so on. But it is also important for us to understand whether the objectives of the challenge have been achieved, for example: Have all players become active members of the Cardano community? Could it be that, in addition to acquiring these CNFTs, are they participating in Catalyst, or working on projects, creating digital wallets, delegating their Ada, etc? I believe that this information is worthy of a good analysis, and that everything that is studied should be passed on to the community. Since they will use youtube as a communicative bridge, such aspects should also be mentioned there. I think that, based on what I have pointed out, the auditability is not, but there are still fundamental points to be reviewed so that it becomes ideal. I would like the same attention to be given both to the game itself and to our ecosystem, and for the communication bridge between the game team > Cardano community to be very solid and to pass information periodically and guaranteed.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 8116, "q0": "The Tellus2 project was created to take action on people's will to live sustainably in all respects and become the NFT Metaverse with a real impact on sustainability through collaborative partners established by carefully selected. Tellus2 is a hybrid between an NFT project with a positive impact on the environment, such as CardanoTrees and Minecraft, with world-building features, adding community and identity aspects, Also an environmental project. By doing so, the team provides a practical approach to space that the Cardano ecosystem will benefit from and planet Earth and humanity. They will use blockchain technology to offer real solutions to real-life problems. Thus, this proposal has responded challenge.\nThe team's solutions are described in detail, clearly, and analyzed in each aspect. The team believes this project will attract hundreds of thousands of players to their Metaverse. Also, combine the real world with the Tellus2 Metaverse, using it to encourage and make more sustainable choices that lead to a greener planet Earth.\nEvery project undertaken is inevitable. With this project, the team has outlined several possible risks. First of all, is the risk of piracy when creating many unique works. Followed by hazards such as the program crashes and the buyer losing money without receiving their NFT; failure because no one was interested in the project; the homepage can be hacked; Risks in the development of Metaverse...v.v. Each risk is significant; anticipating these risks helps the team to prepare in advance and find suitable solutions to reduce or minimize them, as the author has presented in the proposal.", "q0r": 5, "q1": "The project's roadmap starts from Q3/2021 to Q2/2024. The author has provided a very detailed plan, with a specific timeline and clear goals. Implementation progress is also noted in this plan, the work and goals for the third quarter of 2021 have been completed and the team is implementing the work for the second quarter. Funding will likely catalyze the process as a whole, start building the metaverse right away, and market more aggressively, increasing your chances of reaching potential NFT buyers.\nIt can be seen that with or without funding, the project will continue, but it will be more difficult and time-consuming. An absolute fund will be an essential catalyst for the team to reduce risk in the project. The team has plans for both funded and unfunded scenarios. I greatly appreciate the feasibility of this project. The proposed budget is only 2% of the total budget for the Challenge. The team will spend this budget on promoting marketing and legal issues and start Metaverse development + blockchain programming. However, to make it easier for the community to visualize, the team should be more detailed and give a reasonable explanation for each of those expenses.\nThe description of the project team members has not been detailed. The author only lists without detailed reports does not assign specific tasks and does not provide a basis for identity verification. I hope the author will also provide more information about the biography, experience, and capacity of each member directly involved in the project to check the suitability of the proposal's objectives. In addition, the author should provide a profile link such as Linkedin, Twitter, or disco.... for easier identity verification.", "q1r": 3, "q2": "This is a brand new project that has not previously received funding in Catalyst. But the transparency of the project is quite clear. The author has provided specific measurement indexes to check and track the project's progress easily. Those metrics are the number of sold NFT avatars; the amount of activity in social media channels; the number of users; establishing a partnership; frequency of sustainability actions resulting from the partnership. Also, the project homepage is being updated, and their Discord server and Twitter account are ready to go. They have prepared many educational tweets about their project and will be very active here, with a minimum of 2 tweets per day. On Youtube, they will provide informative videos about the idea and monthly Tellus2 360 project updates for the community to follow. They will be reaching out to podcasters in the Cardano and crypto space for interviews, promoting more widely.\nSuccess for Tellus2 comes as its community grows in nature every year, ultimately making it a long-term player in the global arena of technology and sustainability. Their brands and Metaverse are known, appreciated, desired, and respected by many individuals and companies worldwide.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8205, "q0": "\"The proposal has carefully covered the background information of the proposed project. All the main features are well explained and the project is expected to have wide impacts on blockchain applications as well as expand the Cardano system, which is closely aligned with the key metrics of the challenge. Following this description, the community can get an overview of the project’s scope, and thenceforth better evaluate the project in general. \nThe main challenges and risks are well foreseen and described in a clear manner. However, some of the proposed addressing approaches are still unclear. For example, regarding the adoption and engagement of the players, the team can come up with specific marketing strategies to drive their interests (e.g promotion campaigns, rewards, streaming, free testing of new features,...) It is just a suggestion, I think overall the team did well in risk management, ensuring a smooth workflow and effectively minimalizing the loss. \n\"", "q0r": 5, "q1": "\"The roadmap is very detailed with specific milestones and deliverables. They also updated their current status in the execution process, which indicates clarity and effectiveness. The fund is reasonably allocated according to the delivery plan, the numbers are specific and transparent. They even have a backup plan in case they are not funded in this round, which I find impressive since they are really well-prepared. \nAs the work is already in the operation phase, I believe they are a strong team with highly experienced members. The fact that the proposal has been well-written shows that they are fully capable of running the project effectively. Yet, a summary/portfolio of past projects or working experience of the team members will be a plus point in the verification and assessment process\n\"", "q1r": 5, "q2": "The proposal has provided relevant KPIs to support the monitoring process. Since the indicators mentioned are in sync with the plan and goals of the project, they are suitable to track down the project’s development. The team can set solid goals for each KPI (e.g. 6 months after launching, the number of NFT avatars sold is 10k - these goals need to be realistic and achievable) so that the vision for the project’s success will be clearer and more feasible. Additionally, the reporting method needs to be mentioned. How will the catalyst community be updated these results/data? (e.g. monthly report published on website/meetings/using reporting tools…)", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10014, "q0": "The project has the idea of building the game NFT (Tellus2), the idea is that close real-world relationships (IRL), players participating in metaverse will have a sense of protecting the actual environment. The activities of players in metaverse will have a positive impact on the current world, each meaningful work in metaverse will have rewards and impact that directly contributes to the environment. Planting trees can be provided from Tellus2, each player's contribution activity will contribute a portion of the money and be transferred to Tellus2's partner to carry out the planting. The project has just created a Metaverse playground and has a good impact on the environment, which is in line with the challenge set out. NFT was created meaningfully in Tellus2, owning NFT is contributing to improving the environment, using ADA to buy NFT will have a direct impact on the Cardano ecosystem. The proposed solution presented has had widespread implications for their partners, however the impact on Tellus2's players is unclear. Tellus2 has an interesting experience in Metaverse, attracting players is what we need. The implementation solution of the project needs to have important details in attracting the volume of participants. The project risks raised about selling NFT and creating NFT could have an impact, hackers could attack the homepage, and attracting community creation could be difficult. A lot of the risks that have been taken by the author have been appropriately minimized by the author. Predetermined risks indicates that the vision of the project will lead to certain success.\nI rated: 5\n", "q0r": 5, "q1": "The implementation plan of the project has taken basic preparation steps from the third quarter of 2022. The project has made achievements in the competition in Sweden are important highlights of the success of the idea. The project provides a complete plan of content, timelines for the implementation of the work in a reasonable way. However, the project also depends a lot on capital, there is more money from the sale of NFT to hire developers to complete Metaverse. We haven't seen Wedsite Tellus2 yet because it's under construction, the construction of the Metaverse world has not been detailed, the construction of UI/UX is not yet informed. We hope that the author's promise to provide informative videos about the project on YouTube will show this. The project members are a group of 4 people, introduced with skills suitable for the project. In addition, the project hires more Metaverse developers and builds technical parts related to the application. With the implementation of the work content will be assigned according to the capacity of each individual, basically the implementation of the team's set plan is possible. Using the funds granted for specific work is reasonable, $130,000 is enough for metaverse finishing development and Blockchain programming, the rest is for UI/UX construction and maketing is reasonable. In addition, the project has a revenue of about $ 280,000 from the sale of NFT during the implementation, which helps the project to be carried out continuously. The acquisition of funds from the sale of NFT is calculated in detail and has a reasonable spending intention.\nRating: 4\n", "q1r": 4, "q2": "The measurement of project progress depends on the number of NFT sold, the channels communicated to users, the number of users, the number of users, etc. We see the progress of building the Tellus2 Metaverse application, the details for measurement are appropriate. The timelines for progress are based on the implementation plan, I have an opinion that the development of a detailed report on GitHud is essential to monitor the progress of the project. The indicators/KPIs that show the success of the project are unclear, I would like to know: What is the number of metaverse participants? What partners do you work with? How the NFT products sold have had an impact on the environment, the number of recycled products sold with NFT, the actual number of trees planted through tellus2's operations. These indicators are important factors in determining the success of the project. The audit of the progress of the project is carried out, the missing details may be supplemented by the author during the implementation process.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10535, "q0": "This proposal plans to bring more impactful uses to cardano by making a game where the purchase of NFTs in their game will have real life impacts to better the environment. I believe this answers the challenge well. Through a fun game experience, users will be able to help preserve our planet. People who are not familiar with cardano or NFTs but want to have a positive impact on the environment will want to join in, and explore the cardano ecosystem and all it has to offer. NFTs will have a tangible use, as they will be linked to tangible changes in real life. The setting of the game, a minecraft-like building experience, is also very attractive and can help younger audiences learn about both environment preservation and cardano. With the cardano proof-of-stake system being more eco friendly than its proof-of-work alternatives, cardano is the perfect platform for crypto enthusiasts and enthusiast-to-be's to start making meaningful projects for the environment.", "q0r": 5, "q1": "The team is relatively small, with only one coder and one artist. It may be difficult to do both development of the project and troubleshooting with a team this small. However, seeing the progress they have already made in Q3 2021, i have high hopes that this team will deliver on their proposal. Furthermore, the team's commitment to continue their project regardless of being approved for funding gives me faith that they are dedicated. The very detailed timeline and budget seem reasonable and realistic. I would like to see a more detailed description of their marketing strategy. What is the target audience? Games are also mostly visual, and I would like to see a bigger focus on art assets, and marketing it in a very visually appealing way. What kind of incentives will the project give to real life organisations in order to find partnerships? Overall, I think this project has a good chance of being successfully implemented, if the team continues to put forth the effort they already have.", "q1r": 4, "q2": "The metrics provided by the proposer is adequate to track success. It will be easy for us to see the game's success through the community engagement on their twitter, discord and website. The team's commitment to a big social media presence will be very helpful in tracking both progress and success. Perhaps the author should also provide a platform where partnered organisations can post about the impacts the bought NFTs have done in real life. For example, posting a picture of the trees that were planted, when a user buys a tree NFT. ", "q2r": 4, "assessor": "z_assessor_3189", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14539, "q0": "The project solution offers a great way to drive the acceptance of Cardano ecosystem and also promote the environment awareness of people. Their goal is to create a meta verse that allows interaction with the real world. To explain, the activities performed in the game will have an impact on reality and vice versa. For example if you buy a jacket from recycled materials from our partner your NFT avatar will get a cool jacket as well. As you can see, the partners play a big role in executing the users activities and in how to guarantee this execution is still unknown and the proposal should explain more on this aspect. The proposal also points out several successful case studies such as CardanoTrees and Veritree/Cardano Forest. But in order to make it more persuasive, they should discuss this in detail and mention things that Tellus2 has learned from them or what they can do better to successfully deliver the product. As for the risks, various have been mentioned and they all come with a respective solution. This shows that the team has a clear vision of what are the adversities they are facing and what they can possibly do to mitigate the situation.", "q0r": 4, "q1": "The timeline is planned until Q2 of 2024. Each quarter is scheduled for a specific work such as marketing or NFT sale. They even give out the specific number to illustrate the points of the progress such as “Starting off with 10.000 NFT avatars available for sale” in Q3 of 2022. The budget is broken down with two different scenarios. One is with Catalyst funding and one without. No matter which one, they still distributed to each sector logically. The only difference is that without funding, their money will heavily rely on NFT sales and it is not sustainable since no one can guarantee how many they can possibly sell. Another downside is the fact that team members are poorly listed. All we have is their names and expertises with little information relating to their background experience. It is advised that they should attach a LINKED IN profile alongside with an overview of the background in case further research is needed.", "q1r": 3, "q2": "In oder to track the project development, the team has proposed several key areas such as Number of NFT avatars sold or Amount of activity in our social media channels. However they fail to mention how this statistic is public to the community. They should take advantage of SNS tools to do so.Their vision of success is the gradual growth of the meta verse and the environmental changes which the project effect on the global scale. However, how this project directly affects the Cardano ecosystem is not mentioned.", "q2r": 2, "assessor": "z_assessor_4071", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14903, "q0": "The proposed solution is close enough to the problem stated. Approaching Metaverse is a motivating way since this technology is being explored more and more in recent years. To be informative with this new technology. The metaverse can contain entire worlds due to the fact that it’s a boundless 3D universe with no limits. And that doesn’t just apply to the physical world. Social lives can also move seamlessly into the metaverse’s worlds. As the metaverse is right now, individuals can invite friends and family to come along with them on digital adventures. The metaverse is an inherently social experience thanks to all the people within it. To have an idea of how events and actions in the real world will affect the Metaverse and vice versa through our partnering companies, thus gamifying sustainability is really smart. By giving rewards to users every time an action is done, it can replace in-person physical interaction to an extent. During the pandemic, many users turned to the Metaverse for social activities and gatherings, even conducting entire weddings inside the platform. A bright future can be thought of since the potential of this project is unmatched. However, they seemed to have multiple risks and challenges on the way, so solutions to mitigate those problems are expected to be found by proposers.", "q0r": 5, "q1": "So far, the project's progress is on the right track. Several works have been completed, and they have a clear plan for the project's remaining components. it would be much easier for the community to follow if there was a list of members in the core team as well as other finished jobs. They have their Discord server and Twitter ready, but no link or name has been found in the proposal. Overall, they did a great job of listing everything in detail and having goals for every phase of the project. In the budget breakdown, the suggested fund was 160000 USD. They divided the money into 4 main sections, Marketing, Legal matters, Metaverse development initiation + blockchain programming and Graphic design. The requested amount for Marketing was 10000 USD, specific payments were listed but still not detailed enough to keep track of. Furthermore, they hire 2 developers for 6 months to start with, but a paycheck for each month is needed. The dedication of the team is admirable as they said they will continue to work on the project. As described in the proposal, this is a big project but only 4 names were mentioned and there was no link to confirm the listed people. If they want the product to come to life, some information is needed so that the community can follow it as easily as possible.", "q1r": 4, "q2": "They do have a good point about what success would look like by showing the key areas and how they expect to develop the product. On the other hand, some numbers to demonstrate the NFT sales they are looking to achieve and a specific number of users would be great to look at. This can be a promising project due to the proposers’ dedication and settled goals that have been made.", "q2r": 3, "assessor": "z_assessor_4109", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Next gen NFT Metaverse with incentivizing reward system and a real impact on sustainability for planet Earth through partnering companies – making green choices easy to sort out and hard to resist.", "experience": "Kok-Wing Giang CEO – Programmer & crypto expert\nAnnie Hallén AD/Artist – Bachelor of Fine Arts, super skilled digital artist\nMy Yen Giang Finance/Legal – Master of Science in Business and Economics\nLinus Hansson Marketing and Partnerships – Journalist/Media working experience"}