{"id": 415486, "author": "amit.sarag", "title": "Social Images: Stock Photos as CNFT", "url": "https://cardano.ideascale.com/a/dtd/415486-48088", "category": 26595, "amount": 36000, "description": "Content creators are looking for authentic, creative and real time stock images that can be found in social media, but social media content is not accessible, no easy way to purchase it.", "f6_no_assessments": 6, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 1637, "q0": "Absolutely yes, I thought this idea was very good and it fits perfectly with the objectives of the challenge. It is also an innovative idea, in my view, as it seeks to define the solution to a real problem through the adoption of the NFT ecosystem, in the field of the use of images, and I have not seen any proposal that suggests this (that images of ordinary people on social networks to be monetized). For sure, the idea will be a great gateway for new members to our community, since people will not need to be specifically interested in blockchain to be part of the project, but rather want to profit from content they already post on social networks. , something I don't see why people would refuse. Speaking more deeply about the problem, the proponent raises the issue that “content creators are looking for authentic, creative, real-time images that can be found on social media, but social media content is not accessible, there is no easy way to buy it”. According to the proponent, the photography market is saturated, two large companies dominate it and the images that are currently being circulated are clichés and not at all innovative. In addition, it is a giant market, according to a survey that the proponent brought, today it moves about 4.1 billion dollars and could reach 6.4 billion in a few years. It is also undeniable how many people use images on the internet, as he cited as an example: “news agencies and publishers, marketing professionals and advertising agencies, video publishers, film and TV production companies, web developers, youtubers and bloggers, social media influencers” and etc. Nowadays, the internet is becoming an increasingly common and consolidated way of working, so in my view this market also tends to grow. So the idea of ​​monetizing social media content from ordinary people (in the sense of not working directly with it, not being photographers or working in photo agencies) is very interesting. If these images saw NFTs on the Cardano blockchain, surely the number of active tokens minted on our network would grow exponentially. An excerpt that argues this idea very well is “Countless snapshots of sporting, cultural, political and news events are shared daily on social media, and media outlets and editors would love to get their hands on them. Furthermore, social media users are wonderful brand ambassadors – countless images of products and brands (cars, food, fashion, drinks, etc.) But all these authentic, creative, real-time images are not easily accessible and there is no easy way to find and buy social media content.” In other words, we have what it takes to develop this technology: quality images and the possibility of working with NFTs, in order to boost the growth of the Cardano ecosystem, popularizing it as it seeks the challenge. It is very clear what the benefits of the project would be for each type of audience: for content creators who need the images, there would be an increase in the diversity of images available, in addition to being more authentic; for those who will produce the images, this can represent a new source of income, including passive income, as they could trade an image and each time it was used they would profit. My only doubt was in relation to how these people, the creators of the images, would understand how to use the technologies. The proponent states that they could agree to negotiate all the images posted (what that process would be like), or just mention the project in an @, but it is not so clear how this bridge would be established. It is also said that “customers have the option to acquire sole ownership of an image through a smart contract on the blockchain”: how would they learn to do this? Aside from these doubts, I believe that the project is very well aligned with the challenge, addressing exactly the topics cited by the proponent: “Establish cardano as a valid alternative over the current centralized providers of stock images + Provide a new case of use for the cardano blockchain, and with it: Integrate new users into the ecosystem + Add value to businesses and provide an alternative for businesses that have no choice but to rely on providers like Getty Images or Shutterstock.”", "q0r": 5, "q1": "The topic is pretty average as all we know is basic information. The proposal roadmap is unfortunately not adequate, due to the lack of detail and more extensive explanations about what would be done in each month of the practical development of this proposal. The first 30 days are called “Full Project Discovery”, which would include things like “Token NFT, Contract Market, Smart Contracts, Billing Backend Services”. However, it is not easy for us to understand what would actually be done here, in what way these subjects would be developed, what would the work behind it be like? Perhaps the month will be dedicated to the development of the platform itself, which will handle NFT tokens, smart contracts, backend billing services, etc? Unfortunately, these explanations are a little abstract, as they are not well connected to each other, there was a lack of explanations for us to really understand how the work of the professionals involved in that first month would be. The second month will focus on “Contributor Recruitment – ​​we will handpick 1,000 active influencers (starting with 5,000 followers each) who will contribute at least 2 images each to our platform”. Okay, how would these influencers be selected? How would they be introduced to the project, how to make this project simple to understand for those who do not know what an NFT or blockchain is, Cardano's differential in relation to other ecosystems, etc? The third month would be focused on promoting the project to potential buyers, such as the marketing and branding industry, content creators, bloggers, etc. How would this publicity be done? In addition to the dissemination to the target audience, how will the common user be introduced to the idea? In general, it is not possible to have a solid view of what would be done, it would be necessary for much more explanation and detail to be provided for this part of the proposal to be adequate. The division of costs could also be better explained, it is said that for the first part, for the complete discovery of the project, 8 thousand dollars would be used, but how would this be divided between the various parts mentioned? Why would the marketing and promotion campaign for potential creators cost 10 thousand dollars, what would be the strategies here and what would justify this amount? Why would the ready-to-use platform cost another 8 thousand dollars, this would be divided into the salary of the professionals involved, such as developers, programmers, designers, etc? Unfortunately, this part also lacks more extensive and detailed information. The last part of the feasibility topic also leaves something to be desired because we are only properly introduced to two team members - Amit Saragosi and Nir Livni. It would be necessary to mention the professionals of the WarmDevs Team who will work here: what each one would do, what their resumes, previous experiences, etc. A very important point is to understand how everyone is involved with Cardano, how would this relationship be traced? How can we ensure that they have the experience and preparation to deal with our blockchain, in the case of developers and so on? For these reasons, unfortunately the topic leaves something to be desired as a whole, needing general improvements.", "q1r": 3, "q2": "As well as the topic of feasibility, this one needs some improvements, both in terms of monitoring progress and the success of the final results. We don't have many ways to follow the development of the platform because 1) our roadmap is not detailed, we don't have much information about what would be done each month, so it is not so simple to know what would be done and when; 2) the proponent does not say that he will constantly monitor the tasks, so that we know what is being built little by little, what the work routine of the professionals involved would be like, etc. It would be necessary for us to have these understandings about the progress of processes, tasks, work routines, what was behind the partial results that the proponent cites: “number of registered employees, quantity and quality of images added to our platform, quantity of registered buyers, their satisfaction with the project and project revenues” and also the development milestones “Platform UI design screens + MVP version of the marketplace + Registered users 3 months after MVP launch - >1000” . There is also the question of how these milestones and this monitoring of the project's progress will be informed to the Cardano community, what would be the means of communication used as a bridge between this team and us? I then suggest that the proponent define where he will make the performances available (for example, some online platform such as MiroBoard, Notion, Google Docs and etc; or some social media such as the project's Instragram, Telegram and Discord channels, etc). Then my suggestion is that he prepare a written report (or a video as well) where he informs the updates both in relation to the development process itself - the work activities of the team's professionals - and the partial results that would be gradually being conquered. The success of the proposal is defined with the launch of the MVP (Minimum Viable Product), which would match the Social Images platform, which would allow a new business model in relation to images, providing a growing market for photographers, media creators, agencies that need images, in order to “provide a service to media companies and an income opportunity for media creators, will enrich the world of images with creative, authentic, real-time images – made by real people in real situations” . It is certainly necessary for us to understand whether these objectives were achieved, but, even more, it is necessary to understand that if the KPIs of the challenge would have also been achieved, if the project would have actually attracted new people to become active members of the Cardano community, such as these people would be learning about blockchain technologies, getting involved in other projects, looking to use our technologies in their lives, acquiring Ada, using dApps and so on. In my view, it is also necessary to have this understanding of how the project would directly affect the Cardano ecosystem. For these reasons, I believe that some important topics should be included here, although we already have pertinent information.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 4176, "q0": "The \"Social Images: Stock Photos as CNFT\" proposal addresses the Dapps, Products & Integration challenge by building the first and only marketplace for social media content. The stock images are often 'staged' and outdated unlike 'in-the-moment' images on social media. With this media marketplace, creators and content providers can trade on the blockchain as NFTs. As a social media content creator myself, I understand the merit of having a \"dedicated platform to generate revenue from my own social media content. However, this doesn't stop me from doing it 'my own way' instead of this proposed CNFT platform. I tried minting NFT out of my photo and launched it on the opensea.io This raises  some doubt on the impact of this proposal, however, I believe if the platform gains traction and have active users, this might not be a concern. The impact of this proposal to Cardano would be very much dependent on the market adoption of this idea and whether they see the necessity of using the platform. The team has specified the risk (one of which is blockage in accessing the content from the well known Meta company platforms (facebook and instagram). I also would like to add that social media users might have to pick between platforms as surely the media buyers wouldn't want to pay for images that are widely available to the public and not an exclusive content. Then the social media users might go for platform that they generate more revenue and have more user base.  Currently media agencies are in touch with their influencers and pay them to generate fresh unique content per campaign. Once the campaign is finished, the rights to the asset belongs to the campaign owner. I can see that the team project (CNFT) could help the social media influencers to still own the rights and take some cut if it's reproduced in other campaigns (quite rare for cross campaigns recycled content). It's important that the team would fine tune business model idea (taken into account all examples I raised so far as the active social media users) and legal loopholes before implementation.", "q0r": 4, "q1": "The project duration is 90 days from 1) full product discovery, 2) recruiting contributors and 3) campaign for potential buyers with ready to use NFT platform. I would suggest the team to do 'market research' as soon as the team can and include in the stage 1 as it is important to check if the demand for their platform is there so that the team knows if their idea needs some tweaking. The majority of budget ($20,000) will go towards 1) recruiting the first 1000 social media influencer and pay them $10 each for their 2 images on the platform($10,000) 2) pilot campaign to potential buyers(another $10,000). The budget should rather be spent more on the technical side ie. smart contracts & backend service as I think the team would have to audit their smart contracts before launching into use. Also if the platform will generate revenue later for social media influencers, they would have signed up without having to pay them upfront just to have their images on the platform. For the campaign for buyers, it is important part and the team needs to elaborate what is their USP (unique selling point) to attract those buyers? Also how does the team come up with $8000 for the NFT platform. It'd be nice for voters to see the breakdown. The team has provided the Linkedin profile of team members and are experienced professional in TV & media. The project has good feasibility but need a brush up on their budget and action plans. ", "q1r": 4, "q2": "The team defines early stage success as having a working MVP for users, then in later stage, their project would be a platform for novel business idea for media creators as their income source and people got more choices with images. They have specified the measures to track progress with number of registered contributors, images quality, registered buyer & their satisfaction, project's revenue with clear KPIs of what the team need to achieve. The team should mention which channel the community can oversee the progress ie. social media channels (blog, facebook, instagram etc.)  The team understand that there is a demand from content creators to look for authentic, creative and real time stock images that could be satisfied with CNFT platform. The idea has a good potential to increase CNFT adoption; however there are some challenges that the team would need to address in order to make this project working successfully.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8206, "q0": "\"The proposed solution has been presented in a clear manner. The team has analyzed the market and current problems with stock images as well as foreseen the opportunities of developing the project. They also explained how their platform will work and some of the main features. By using NFT blockchain technology, the team has expanded the Cardano blockchain network and applications (provide a new use case for the Cardano blockchain, on board new users, bring value to businesses), which are closely linked with the metrics of the challenge.\nThe main risks are well predicted followed by a suitable risk management plan. The challenges and solutions are logically listed, ensuring clarity and viability. The community can base on these addressing approaches to assess the prospect of the project.  \n\"", "q0r": 5, "q1": "\"The project is expected to be operated in 90 days. Three main milestones have been marked with main activities accordingly in the delivery plan. However, I think the community would prefer more details on some aspects of this plan. For example, what steps need to be done to build NFT tokens/smart contracts, who will be in charge, and what is the expected delivery time? How can the team execute the marketing campaign for the target audiences that had been identified? What are the main activities/desired outcomes in the campaign?\nAfter presenting such a specific action plan, the team can easily allocate the fund with suitability. The current financial plan is reasonable, yet a bit vague. For example, the team should explain the definition of $10,00 for the pilot/marketing campaign. By doing that, the team can not only increase the feasibility of the project but also significantly support the assessment process of the community. \nThe information of team members is clear and adequate enough to evaluate their capability to execute the project. I believe they are a strong and reliable team consisting of highly experienced members and able to ensure smooth workflows.  \n\"", "q1r": 4, "q2": "The project’s progress can be measured by the KIPs mentioned (the number of registered contributors/ qualified images/ registered buyers, the project’s revenue…). These indicators are good and relevant since they indicate the engagement of the target groups with the platform. Some of the development milestones are also provided, allowing the community to keep track of the project’s success and detect any failure possibility. There is also a need to mention the reporting method: how can the team report these outputs to the catalyst community and how to ensure the correctness of the data?", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8578, "q0": "This proposal is presented in a clear and understandable way. It is really straightforward in the problem statements, content creators are looking for authentic, creative and real time stock images that can be found in social media, but social media content is not accessible, no easy way to purchase it. The team aims to introduce Social images: The first and only marketplace for social media content. Monetization of social media content, owned by the creators and can be traded as NFTs on the Cardano blockchain. The fundamental idea is incredibly pertinent and fantastic, and if realized and properly developed, it might be a game-changer for the Cardano Ecosystem as well as for businesses that are heavily relied on providers like Getty Images or Shutterstock. I appreciate that the team devotes a section to clearly describing the technical approach and how it functions. The author assures us that he has anticipated various situations to ensure the success of the project by providing a well-explained overview of potential risks and how to overcome them. Given the thoroughness with which the proposal intends to carry out its stated plan, I wholly agree that it addresses the challenge.", "q0r": 5, "q1": "The core team's competence includes different fields, such as filmmaking, marketing experience, webflow programming, and UX/UI design. Some references such as examples of past work, LinkedIn pages and other kinds of information to make it easier to understand their background are all presented. With this variety of skills, it is clear that a thorough understanding of what is required in order to develop and scale up the project. In terms of a detailed plan, this proposal did a very good performance. We are served with a short overview of what it takes to achieve the stated goal and then the team behind this will go into detail, separating the total duration of the project in 3 phases, each with 30 days. Based on the evidence of the team's abilities, the proposed timeline and milestones are appropriate for the amount of events in each phase to be accomplished. They are also clearly described. One thing I love about the project is the proposers have included a specific number of targeted influencers to contribute to the platform, further increasing the proposal's transparency. We don’t have to guess anything like when this will happen, how many people contribute their images or how many images to be contributed by each person for the implementation of the platform. As for the requested fund, the proposal asks for an amount of $36,000. That seems like a decent amount taking into account the scope of what the proposal wants to accomplish. It should be enough to maintain and scale the project for the next 90 days. I would have preferred to see a little more specificity in the financial breakdown to make the idea a bit more realistic. Some components in the budget plan should be broken down into identifiable items. I would like to have a more detailed description of how and when the project expects to advertise their platform during the development of this project since, for instance, $10,000 for a pilot campaign is confusing and imprecise and given that marketing is included in this component.", "q1r": 4, "q2": "This project is being worked on by a highly motivated and skilled team. The proposal includes a roadmap that covers 90 days dividing into 3 phases and presents milestones in an easy-to-understand manner. The project audit metrics and KPIs are mentioned, and they make sense to me. However, I believe that adding some KPIs to the roadmap would be beneficial in order to further boost the proposal's transparency. How many contributed images, for instance, is the project anticipating having after 60 and 90 days? It is also challenging to determine when the team expects to achieve the success metrics specified. How the team assesses the satisfaction of the registered buyers is another concern I have. I would expect detailed info on this success metric so as to enlighten the success definition. Also, I suggest a channel where the community or users of the platforms can monitor and interact with the proposers would further increase the level of auditability of the project as a whole. However, it is encouraging that a thorough description of potential risks and development-related obstacles has been presented. This increases confidence in the team's competence and demonstrates that they have a solid understanding of both the project and the marketplace. Overall, I still agree that this proposal provides me with adequate information to evaluate how well its stated objectives are being met.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8677, "q0": "The main aim of this project is to create a marketplace for social content, where sellers can post unstaged real-life photos for an extra source of passive income and buyers are content creators looking for authentic materials. Deploying such a centralized marketplace platform will help creators reduce the time and stages of searching – author contact – deal – purchasing the images they need. This novel idea integrated into the Cardano blockchain will be an impetus for users and new users to adopt and interact more with the blockchain, and it fits perfectly with the key metrics this Challenge sets out. To demonstrate the feasibility of the Social Images marketplace, the author gave evidence that the demand for available images is increasing. Although the proposal has not yet progressed to the stage of providing a demo of the market platform for reference, the author's descriptions are still enough to give us an idea of ​​how the platform works. The risks are carefully considered and appropriate measures are taken, but there is a risk that should be considered in the case of people using images not owned by them to post and advertise, how will these cases be detected and handled?", "q0r": 5, "q1": "The project development plan outlines the milestones and tasks to be done, we also know exactly when the platform will be ready for use. The operating budget is presented as an overall estimate for each item/task. This formula is not effective for auditing or making comparisons with other projects to conclude the required budget is reasonable. The operating cost formula that I always encourage proponents to use is actual hours worked x respective remuneration. The working experience and areas of expertise of the core members show that they are qualified to perform the main tasks in this project, which are designing ideas for the website - building and operating the website - marketing. The personnel descriptions and attachments provide a solid basis for supporting this conclusion.", "q1r": 4, "q2": "Only a few of the KPIs suggested by the proponent have numerical estimates, such as recruiting 1000 collaborators from active influencers on social platforms or 1000 registered users 3 months after launching MVP, and these two indicators belong to the MVP phase of the project. The KPIs after launching the official platform to measure success and the milestones for measuring them are still unclear, which means that in addition to providing the concept/definition, the author needs to have more specific numerical predictions. In addition, there is no information provided by the proponent yet showing what tools/methods will be used by the community to be able to track project progress and access information about it.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9319, "q0": "\"That is a good proposition. Because the NFT Marketplace facilitates trading between people who are interested in cryptocurrencies as well as art in general. In addition, these online communities provide the opportunity for photographers to earn extra income by selling their digital art or NFT photos. The collection and sale of works of art takes place only in galleries or picture fairs, where only \"\"tangible\"\" works have a chance to be sold. With this in mind, you have created a tradable media marketplace on the blockchain in the form of NFTs between creators and content providers, which can offer solutions for both parties.\n These works are exhibited on a global scale, helping the author to reach a lot of potential new customers. If the author is lucky enough to find a \"\"loyal customer\"\", the author can get a steady source of income by selling works on a regular basis.\nSimilar to social networking sites, the NFT platform also offers instant access to art creators. So, if there is a certain number of followers, the authors will have a huge advantage in this harsh competitive environment. So I totally agree with your project.\"", "q0r": 5, "q1": "You have prepared your work plan. I don't understand why you don't divide by the month you write (30 days, 30 days, 30 days total 90 days). Regarding the budget table, you should divide it more specifically in section 4. Test the campaign for potential buyers (ad agencies, content creators, marketing and branding industry, website creators). web, press (print & digital), blogger & youtuber, brand (small & large), designer - $10,000. About membership, I'm very impressed with Amit Saragosi because as Editor and senior TV advertising director for major brands (Google, Alibaba, Mercedes-Benz, Coca-Cola) Brands that have existed and are still very successful today. I really believe in your team, but the video you provide below with member information I can't access to watch.", "q1r": 4, "q2": "I agree with the criteria for measuring your progress. You should point out the numbers. You should be more logical. Each criterion should be written in sentences and lines. This will make it easier for people to see. Your developmental milestones should be more specific. The success of the project is also the positive of the community when it is possible to earn extra income by sharing and creating social images. Hope you will be successful in the project.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Social images: The first and only marketplace for social media content. Monetization of social media content, owned by the creators and can be traded as NFTs on the Cardano blockchain", "experience": "Nir: 20 years of experience in senior management positions in leading advertising agencies.\nAmit: Awarded TV & Film Maker. Managed promo departments for Israeli biggest TV channels. Editor and director of premium TV ads for big brands (Google, Alibaba, Mercedes-Benz, Coca-Cola)."}