{"id": 416361, "author": "thomas.wagner", "title": "W3:RIDE : The future of cycling", "url": "https://cardano.ideascale.com/a/dtd/416361-48088", "category": 26595, "amount": 84000, "description": "Traditional web2 fitness platforms are centralized with self-serving designs that prevent broader community engagement outside of specific company ecosystems.", "f6_no_assessments": 8, "f6_rating": 4.375, "videos": [], "media": [], "f6_assessments": [{"id": 1644, "q0": "The idea is very interesting and fully aligned with the objectives of this challenge. It's about creating a Dapp for cyclists to interact, earn rewards and sell CNFTs that basically involve cycling activity. This is sure to bring a new audience to Cardano, because apps for tracking pedaling and physical performance have been around for years, so this new approach could be attractive to users, mainly because of the rewards involved. More detailing the idea: it is about creating an application inspired by those that already exist in the fitness universe, but that are saturated, have very limited tools; As proponents point out, the design is geared towards self-service, meaning that people don't interact with other athletes or people outside that small ecosystem (eg, Nike's fitness apps, which are very performance-centric). So the idea would be to create a platform that would serve “cyclists to share, win, celebrate and connect with cyclists locally and globally. Provide new incentives to drive and inspire cycling in the community.” This would be done through various tools, such as: systems that could extract more value from physical exercises through rewards: athlete A has certain goals and athlete B too, they bet on who would achieve their goals, and the winner would keep the rewards, while the other would have to make a transfer (it's not so clear if it would be in Ada, NFT or even local currencies). Another interesting feature is that athletes would be introduced to the universe of “digital goods, digital identity and the power of tokenized incentives”. Bicycle-based CNFTs would be set up, as I understand it, and these could be displayed, traded and sold. Like a kind of marketplace. Athletes would also store their data in decentralized identities, and could interact with each other, creating a collaborative community centered on a common subject - cycling - but powered by cryptographic technologies. I think this idea is super interesting because it wouldn't be creating a technology from scratch, but taking something to web3 that is already well established on web2. In this way, new users would certainly be attracted to ours, and the specific objectives of the challenge would be addressed, as 1) new digital wallets would be created - for athletes to receive their rewards and place their bets; 2) new CNFTs created, minted and traded on the Cardano blockchain; 3) certainly a new audience would be added to our community.", "q0r": 5, "q1": "In terms of script, I thought the proposal could be better detailed. Little information is given about each part, for example: “July 1st: *Pre-sale NFT*s. August 1st: Alpha App store release for NFT holders. Onboarding NFT Holders: All NFT holders can link their wallets to verify ownership and begin riding. Syncing Apple Health and Fitness: Users will be able to allow access to their health data to verify rides from a variety of sources, from Zwift to Strava”. As you can see, what is said are the results that we expect to achieve based on a certain time of year. For example, as I understand it, as of August 1, the aim would be to create the “Alpha App Store version for NFT holders”; integrate these holders; link them in digital wallets so that they had an identity that could be used for pedaling; apple health would be synced; etc. That is, we would have several products to be conquered in that time interval (between August 1st and September 12th), but in my view the script would be more in-depth if we knew not only what it would have to be done, but how it would be done. What would the process of developing each of these metrics look like? How could we audit the work of the professionals involved, understand what their daily life would be like with the development of the project? From the way the information is passed on, we can understand what would be done, but we don't have such a solid understanding of what would need to be done to get there, I think that maybe it's not the best way to have the information we need to understand to understand the all solidly. Moving on to the next topic of analysis, which would be the budget, a total of $84,000 is asked for project costs. The value is high, but it is explained in a very detailed way. It is divided into a few parts, each of which is specifically detailed. For example, $30,000 is set aside for marketing; and what would be included in this part would be “- social media advertising + content creation + narrative + PR campaigns + promotional content from influencers (Tik Tok, Instagram, Youtube, Twitter, Medium) + specialized press articles (bike press , crypto press, tech press, business press)1”. Like this part, the other expenses of the project are quite justified, for example, we know that the legal part would include NFTs and market laws, private data, etc. So the monetary explanation is very well argued, the value seems to have been thought out to the smallest detail and a lot of sense of necessity is conveyed. Finally, talking about the team, there is a lot of confidence in the members involved due to the degree of detail that is said about each one; we know their names, roles in the project and a brief résumé about them. We know that Romain Pomarelle is already involved with Cardano, which in itself already conveys a lot of confidence. In general, the proposal is very viable, deserving only a few improvements in the script.", "q1r": 5, "q2": "Finally, when we analyze the auditability of the project, unfortunately the topic is not as suitable as the previous ones. We know that progress would be measured by some metrics, but they are basically quantitative: number of app downloads and daily active users; in addition to the number of kilometers/miles traveled by active users and also the trend of the NFT price in the secondary markets (I didn't understand this last point very well, it would be interesting if it was better explained). In my view, these data help us to have an idea of ​​whether what was being planned was being adequately accomplished and as expected, if partial results are being observed in practice. However, such parameters are not useful for us to understand if the script was being followed, if the work schedules were being followed, how all the work behind such final results would be being done, whether in the construction of Dapp (programming and design part), in the advertising campaign, in the organization of legal aspects, etc. In my view, it would be necessary for all this data to be gathered, studied and summarized in monthly reports, which should be made known to the Cardano community, either through social networks (such as discord, telegram, twitter and etc - they will work with social networks , then it would be interesting to choose one to be the communication channel with the public); or even through after Townhalls. Success is summed up by building a huge daily user base and accelerating people adoption of web 3.0 (especially Cardano) + a high quality NFT project, we also aim to see increasing value from our NFTs in secondary markets + become a global digital “layer 1” on health tracking and cycling tracking apps.” What happens here is quite common, it is said that it would be success, but not how it could be verified, perceived and proven. It would be necessary for the team members to do a final study, gathering the pertinent information to understand if this Dapp was really able to bring users from web2 to web3; increase the number of active Cardano members, new digital wallets, more CNFTs circulating and etc; how it impacted both the fitness market and the growth of our blockchain. We would need more information to understand whether the challenge-specific KPIs (“Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products” etc) would be contemplated. Finally, I think that the auditability could be, as a whole, better reviewed and built, so that we have a deeper understanding of how to monitor these projects, in several ways.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 373, "q0": "W3:RIDE are proposing an application that helps to bring together cyclists and pool data across multiple platforms to give a new experience of riding to mint NFTs as a reward for cycling. The proposal looks to use unique art and collectibles which currently includes bicycles and rider NFTs to bring together the cycling community around a common interest and also help to foster the growth of community clubs. A key thing that is not covered in any depth in this proposal is around the data of the rides. Currently cyclists give their data to these centralised providers and finding a way for cyclists to own this data themselves would be a key factor towards making it easy for them to use whichever platforms gave them the most value with their existing data. In the risks this is not mentioned at all that existing platforms have the benefit of adoption and a small form of lock in due to historic data. Another risk that could have been covered is that is vital is the economics of the ride to mint, is this sustainable in perpetuity? If anything valuable can be extracted out of doing a ride as proof of work then this system is susceptible to being gamed - how do you truly verify that the ride that is being recorded is real and not spoofed? Currently people have little incentive to fake rides in existing platforms however if someone else tries to add economic value to this process the incentive increases and then this suggested mechanic could easily fall apart. Overall there is potential for this application with improvements that could make a more dynamic marketplace for cyclists and connected community, for this proposal more detail and specifics are needed to provide a higher level of confidence that what is being suggested will be sustainable over in terms of tokenomics and proof of work incentives over the longer term. The proof of work part should ideally have better coverage of how it could be gamed or spoofed by the community for their own benefit.", "q0r": 4, "q1": "In terms of feasibility the team break it down into accurately dated releases roughly ever month. They've already begun the NFT release. The app release will allow riders to verify ownership of their NFTs, access their health data from the different platforms and then display their bikes, unlock rewards and start levelling up tiers by completing challenges. Afterwards they will start to introduce the community club experience, custom bike part NFTs and utility for purchasing with the $ride token. The budget is broken down into marketing, website development, app design, legal compliance and brand guidelines. The team list includes five people detailed with others on their website team section. The team has a mixture of experience in design, business, tech and development. No professional profiles are provided on the proposal or in the website making it more difficult to verify the backgrounds of those involved. The team has already show some signs of execution with the launch of NFT since submitting this proposal. Overall it looks feasible this proposal could be executed, in future proposals it would be advised to provide as much information as possible regarding technical evidence and professional background to remove any doubt for assessors of the feasibility of the proposal.", "q1r": 4, "q2": "For tracking the progress of this proposal the team mention app downloads, daily users, NFT price trends, and kilometres cycled by users. It would have been good for the team to be explicit on how they intend to do updates to the community to share progress so the community can easily audit each phase of the proposal. Another useful area would be if anything is open source to provide a Github repository so development can be tracked. In terms of success they state they want to build a massive daily user base, an increasing value to their NFTs on the secondary market and to become a global layer 1 for health and cycling tracking. In terms of success I believe this could be improved by adding more specifics to this proposal itself. The success metrics are more long term vision for this project, the community is not expecting the team to reach this at the end of this proposals execution. However what the community would like to know is what specific measurable objectives are realistic and achievable in the short term after this proposal is executed? How were those numbers derived? Without considerations on this it is harder to have confidence that the team have thought about what the key factors are for early adoption with a strategy to measure and track those factors. Overall more specific auditability metrics are needed to increase confidence in knowing whether this proposal will produce positive outcomes.", "q2r": 3, "assessor": "z_assessor_2073", "no_vca": 15, "ne": 7, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2408, "q0": "We can say that this proposal fits perfectly into the metrics established by the challenge, as we have the implementation of Cardano technologies in a market with great scope and potential to create new utilities and profitability related to blockchain. So, if successful, this project will be having a positive impact on the Cardano ecosystem, as well as introducing blockchain to people who might not know about it if not through cycling. Even with all these positive characteristics, we have that the budget being requested is quite high, but another encouraging factor is that the project already has a certain degree of construction, which makes the budget being requested $84,000 justifiable.", "q0r": 5, "q1": "In line with the above, we can say that given the large budget requested, it would be expected that the action plan would be well defined. And in this regard, we found a good organization of the planned activities, we were also able to notice that they evolve gradually. As a positive point of this stage, we can mention that a reduced version will be released beforehand for the validation of concepts. As for the professionals who make up the team, we can point out that their experiences are related not only to development, but also to very important areas for the project, such as design and creative direction. About the details of the budget, we can say that the distributions of capital are consistent with what was developed, and in this context, it makes sense that the greater allocation of capital is aimed at marketing.", "q1r": 5, "q2": "Regarding the ways chosen to follow the progress of the project, we see that in general good parameters were chosen that really demonstrate the adoption of the project as well as the engagement around it, but in a complementary way, it would be interesting if some way to measure citations about the project on social networks. Regarding the perception of project success, we see a correct description of what should be the result of a successful execution of the project, but it would be interesting if numerical goals were also defined to be achieved that would help us to define in the future whether the project was successful or not. Successful. Such targets could be, for example, an average number of monthly active users or an expected volume of transactions from your NFTs.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4177, "q0": "\"The W3 Ride: The future of cycling\" proposal addresses the Dapps, products & integration challenge by elevating from web2 to web3 where the rider can earn, compete, and communicate. Rider can earn and get reward based on proof of work ($ride) shown in their ride data (speed, distance, elevation change). Riding unlock NFTs and riders can collect unique bike part designed by artists. Riders are also motivated by wagering tokens ($Power). By extending the capabilities of existing fitness apps and empower them with web3 ability, this proposal addresses the challenge by creating impactful dapp that will increase Cardano adoption. The team cited lack of proper marketing campaign as the risk for this project. However, since this project has been in operation for 9 months, they already formed the meaningful partnership to make their impact heard by cyclist community.", "q0r": 5, "q1": "Checking the CNFT.tools against their timeline, their NFTs are not for sale yet (Pre-sale since July 1st). They set August 1 as the App store release for NFT holder and Sept 12 for all users to join the community. The fund they requested for fund 9 is $84,000. The majority of budget $30,000 is spent on marketing. Although I agree with their marketing strategy, I think the amount spent on marketing is quite big and should have a breakdown by each medium they use. The pay rate should accompany the website redesign, the App design, legal & compliance, brand guideline. The team should have included their linkedin profile along with their responsibilities for the project. The team has background in cycling, tech, finance and software & web 3. The team doesn't plan to return to Catalyst. The project has potential to scale and the team has considered project risk in making the cyclist community aware of their solution but found ways to mitigate the risk.", "q1r": 4, "q2": "The team view project success as building a massive daily user base and accelerate Cardano adoption and see NFTs value increasing. Their mission is to become a 'global' digital layer 1 over health tracking and cycling tracking apps. Their KPIs are \nnumber of downloaded apps, number of daily active users, NFT price trend and amount of km cycled by active users. They could include the target associated with these metrics and also indicate how they want to report back to the community ie. social media, monthly report, or bi-weekly meetings so that the project progress can be audited by community in a timely manner. The team has considered the gap/issue of self serving design in web2 fitness platform and fill that gap by creating a unifying platform for cyclists as the effective solution. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4525, "q0": "I strongly agree that this proposal has a high impact. The solution belongs to the move-to-earn category, biking in particular that meets the challenge settings (i.e., build new NFT marketplace and tokenize physical products/bikes). The proposer articulates the benefit to the Cardano ecosystem, comprising a unique art and collaboration platform on Cardano (i.e., the NFT marketplace). It also meets Fund9's startegic goal (i.e., prepare a group of people/the cyclists who are able to make contributions to the ecosystem - by minting and exchanging NFTs). The proposer is requesting funds for their branding and marketing effort only, as the product suite (including white paper and tokenomics, first version of the website) has been developed. This is a special point of this proposal that there is a shorter time to realize its impact versus other proposals where product development has not been started. The proposer expects the project will scale sustainably after launching and will not require further funding. \n", "q0r": 5, "q1": "I believe that the proposal is feasible. This is a marketing, branding, and launching implementation, not product development. The proposer points out that they have onboarded on their team a partner who is strong at marketing and driving mass adoption of new technologies (Nexus Cognitive Solutions, Wagner and Pmarelle). The team provides a timeline of 3 months to launch multiple product initiatives (e.g., NFT pre-sale, in-app bike store). However, the proposer misses providing the timeline for the marketing campaign they are asking for funding for. For example, I would expect to see a planned timeline for their social media advertising, website redesign, app design, and brand guidelines. It would also be helpful to estimate the man-hours required for each task. Moreover, it is not clear from the proposal if the project has already had the infrastructure to launch their collaboration platform on Cardano; if not, how they plan to build one. Last but not least, I would recommend the proposer to elaborate on their partnerships with established brands from web2, as supporting evidence that their product launch is likely to succeed.\n", "q1r": 4, "q2": "I agree that the project is verifiable from the product launch's perspective. The success is defined as a massive daily user base for the product, an active secondary market for their NFTs, and for them to bring a global cycling-tracking focused layer 1. The proposer will measure their projects by the # of app downloads, # of DAU, NFT price trend, and amount of kilometers cycled by the community. However, the value adds for the Cardano community is not clearly verifiable from the proposal. As this is not a Cardano-native dApp, I would suggest the proposer be more explicit and comprehensive regarding the impact on Cardano. Two thoughts I have for consideration are (1) to add metrics that measure the impact on Cardano (e.g., new Cardano wallet from the W3 community, NFT transaction volume on Cardano), and (2) to establish communication channels such as participating in the Project Catalyst Townhall to update the Cardano community on the project's progress.\n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9322, "q0": "Your team's suggestion is consistent with the reported issue. I like this idea of the project especially in the context of rising fuel prices, very expensive gas prices and increasing environmental pollution, this would be a good idea. Cycling also helps people's health improve, reduces many diseases, especially with the suggestion of cycling friends to earn more money (creating digital assets). I have seen your illustrations, you should make them bigger and more photos for everyone to see. Hopefully W3 will create a unified community platform and inspire cycling in the community. I hope this project of yours is funded and implemented in reality.", "q0r": 5, "q1": "The detailed plan of your friends I don't understand why split the days like that? I think it should be more clear and detailed. This part is not really detailed and convincing to me. The detailed budget breakdown should also be clearer than the amount in each specific job and has the totals below. Your team all have great members, everyone has good capacity but need proof to show that for example provide instagram, access link, facebook...", "q1r": 4, "q2": "\"Number of apps downloads\nNumber of active daily users\nNFT price trend in secondary markets\nAmount of kilometers/miles cycled by active users\nIn addition to these progress tracking factors, I think there should be the number of positive user reviews, user input, the amount of electronic assets that people earn.. The success of this project in my opinion should have both long term and short term. Short-term example: the project attracts 200-300 stable and active users who cycle daily. Long term: There is a huge and famous community in many countries and is trusted by everyone...The success of the project is also the fact that people have positive feedback about their physical and health status. mental health after participating in cycling with W3Ride.\"", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12951, "q0": "\nThe proposal is for developing the decentralized fitness platform where the cyclists can share, earn, celebrate, and connect with other riders on a local and international level and create the some incentives to promote and encourage cycling in the neighborhood . Earlier on web2 platforms were centralized and have limited community interaction to avoid this the proposer is creating a decentralized platform where the riders can connect to local and international levels .The Web3 Ride mobile app is a community-owned platform for earning and creating one-of-a-kind digital assets focused on cycling through a user-managed custodial wallet.\nThe proposal clearly adds the value to the cardano eco system and The key metrices and the goals of the proposal align with the outlined challenge settings.\nThe proposal is able to scale to addresses future challenges .The proposal have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.The proposal is able to scale to addresses future challenges. The proposal have also mentioned the risks and challenges and also mentioned the solution to tackle the risks.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the project. The NFTS will first go live on the store, after which all NFT holders can link their wallets to confirm ownership and start riding. after that Users will be able to display their bikes, gain ride incentives, and level up their earning levels by completing tasks after syncing Apple Health and Fitness.Both the stated timeline and the budget breakdown are excellent. The proposal has taken into account the pertinent risks and obstacles for the successful execution, which is a wonderful approach to the topic. After reviewing the proposal, I agree that it is likely to be implemented successfully. The proposer has also provided a description of the team in depth and a list of the team members' necessary skills.", "q1r": 5, "q2": "The number of app downloads, the number of daily active users, the price trend of NFT in secondary markets, and the number of kilometres or miles cycled by daily active users can all be used to measure the proposal's progress.The proposal's performance is measured by the Metrices/Kpi mentioned in proposal.\nThe challenge has been clearly as possible defined by the proposer, and the method for its successful implementation is also provided.\n", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13667, "q0": "In simple terms i like health and web3, when you combine both of them , it is this project(W3:RIDE). This proposal has a lot of potential and future in cardano blockchain. It will increase the sales and transactions in cardano chain just like Axie infinity in Ethererum. It is a new kind of Ride to earn project. This kind of usecase makes the value of NFT to increase and increase rthe cardano community. This proposal effectively helps the community to grow and hence it fully address the challenge.I have seen this kind of project on solana blockchain but now it came to cardano too. I have been waiting for this kind of project in the cardano ecosystem too. With the help of project catalyst i have found it. I too interested to buy an NFT and use to ride and earn. Just like how  Axie infinity made a difference this project too has potential to make a difference.", "q0r": 5, "q1": "The proposer provided all the required links about the information of the project. The website is cool and stylish and can ride the cardano cycle to hills. The timeline is very clear and accurate. The team planned the project very carefully. Even though most of the work is done and the budget seems too high, this project has the potential to be required  to be funded for this proposal. By seeing the related projects like these in other blockchains, this kind of project needed more funds . The team main plan is marketing the project so more number of users might participate in this project. The team provided all the team information successfully. If more funds are needed for this project, the proposer provided required information to be funded again.", "q1r": 5, "q2": "The information provided above and the links are enough to audit the proposal. It has funded with many VCs. The project is very detail and a nice way to earn crypto with risk free. The information is provided is sufficient to audit the progress and the success of the proposal. The main Problem of this project in my opinion the project will be successful only for few months and later due to more circulating supply or bear market it will go down eventually. It may take few months to get back on it. Even though every project is like that, a solution to be found to decrease this problem. In my opinion to decrease this problem community should increase and should be strong. With their help this proposal will be a one of a kind projects than other projects. This proposal has provided all the required public channels to help the community.", "q2r": 4, "assessor": "z_assessor_3735", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Create a unifying community platform for cyclists to share, earn, celebrate and connect with riders on a local and global level. Provide new incentives to drive and inspire cycling in the community.", "experience": "A strictly selected team of international experts is involved in the project. Highly experienced web2.0/web3.0 developers combined with professional NFT artists and even former pro-cyclists build a foundation rounded up by an advisory board with a 7M+ following community."}