{"id": 416563, "author": "tesla", "title": "NFT BATTLE ROYAL GAME ON CARDANO", "url": "https://cardano.ideascale.com/a/dtd/416563-48088", "category": 26595, "amount": 25000, "description": "The blossoming NFT technology has seen poor adoption globally. The space demands easier ways for blockchain enthusisasts to own NFTs", "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 1653, "q0": "The proposal theoretically aligns with the objectives of the challenge. I say this because a game based on NFTs would be developed, which would increase the number of active tokens being minted on our blockchain - which corresponds to one of the specific objectives of the challenge. A Dapp would be developed, in this case a game (it is not very clear whether it would be for web or mobile devices), and in addition to increasing the number of NFTs, new digital wallets would also be created, so that users could trade the active tokens and carry out payments, as I understand it (it is also not so clear if the tokens would be paid in Ada, but I believe so). Naturally, the game would attract new members to our community, we know that the gamer community is very extensive and active, and by bringing interesting projects, we would be attracting new people who were not necessarily interested in the blockchain universe, but in games. Regarding the game itself, what is understood is that it would be a battle game, inspired by games like Clash of Clans, Age of Empire and Diablo, according to the proponents. The game would be play-to-win, which is quite interesting, as people are quite attracted to the idea of ​​profiting through fun. It would be a world (Kingdom of Pangea) in which players would build fortresses, buildings and training units, and from what is understood the objective would be to venture through different kingdoms, battle and conquer new territories, with each territory having the name “Lord Protector”, which would be the strongest commander, and players could, through diplomacy, become Lords of different units. Although the idea is in theory perfect, I have some observations to make. Firstly regarding the following excerpt: “Pangea Kingdom will educate traditional integration players about non-fungible tokens and decentralized exchanges until it becomes common knowledge in all traditional games. The method will increase transactions within the Cardano Ecosystem.” How would this education be done, as new players, who have never had contact with the blockchain universe before, would learn about these technologies? This point would need to be made clearer. Would there be any tutorials in video form, or for example, would there be any professional users who would be available to help beginners, perhaps? As some sort of team member who gets delegated to that specific role? Another point that worries me is when the proponent states that “we are mainly affected by 3 reasons, as we are an initial team, lack of adequate funds for marketing and general misunderstandings about NFT technology”. It is quite worrying when they say that they have no domain over NFT technology. When reading the descriptions of the team members, in the topic of feasibility, I conclude that no one has experience with this, in fact. So how will this problem be mitigated? The proponent already points to a resolution to the marketing issue, but the difficulty in dealing with NFT technology is still open, generating concern. Therefore, I think that the proposal can generate a good impact for Cardano, but some points should be better clarified.", "q0r": 4, "q1": "The viability of the project has strengths and weaknesses, and some issues should be reviewed, so that the safety in the development of the project is better guaranteed. Starting with the script analysis, the main problem observed here is the lack of a better determined temporal notion. We know that the project development time is divided into quarters of the year 2022, and each of them has a list of activities that would be developed. It would be important for these activities to be better situated in time. For example, in Q2, many things will happen (landpack sale, team expansion, v2 site, seed and private sale, market development, source development and etc). It would be necessary for us to understand in which months each one of them is planned to occur, so that we have a more solid understanding of the organization of this process. In addition, some activities deserved to be better explained, with a more intense level of detail. For example, in the first quarter of the year, the announcement of the project would be made: where? With which strategies would the target audience be reached? In terms of organic community growth, how would that goal be achieved? On “partnerships”: with whom do they intend to establish these partnerships, how would the partners be selected and how would this bridge be built? In the third quarter, a “free land merger event for event winners” would be held. Would this event be online, in person? How would event attendees be encouraged to be a part of this moment, in what month of the year would it take place, exactly? The fourth quarter is the one that needed improvement the most, as all that is said is that a “merge feature” would be done; but it is not clear, at least to me, what this is and how it would happen. Talking about the budget, a similar thing happens: we know in a basic way how the 25 thousand dollars would be spent, but each part could be better justified. How would the marketing campaign be executed and why would it cost $4,000? What would be the works of art that cost 6 thousand dollars? It would be interesting for them to better detail how the work to develop 3D game assets would be, since this is the most expensive part of the project, as well as the work routines (how much time these professionals would dedicate to the project) of the developers. Finally, speaking of the team, a certain trust is passed because we know many details about each person involved, such as their resumes, what they have done so far in their professional lives and so on. However, it is worrying (as I already commented on the impact) that we do not have any members experienced with NFT technology or Cardano. In my opinion, it would be necessary for at least one person to be more knowledgeable about these matters, so that we could be sure that the work would be done correctly and as planned.", "q1r": 3, "q2": "From the information that is provided, I believe that progress monitoring will be done properly. It is said that the Agile methodology would be used (it would be very positive for the proponent to better understand how this methodology works, I have heard about it in other proposals, but perhaps some CAs or voters do not have any prior knowledge about it). It is also said that the tasks would be organized by the Gantz chart (again, explanations about this chart would be welcome). Proponents claim that many tools would be used to track the steps, such as GitBook, GitHub, Titan Email and Trello; and that progress reports would be made weekly. The question that remains is: how would all this information, so diverse, reach our community? From what I understand, the tools would be accessible to all members of the Cardano community, but it would be interesting if a summary was made monthly and posted on one of these communication channels (for example, on Trello, a session could be created with “summaries monthly” to summarize the main updates). I say this because there are many projects in progress in the ecosystem, so it would be very positive if we had a general picture that showed what is most important at the end of each month. However, it is very well assured that the Cardano community would have several ways to monitor the progress of the phases, so this part is very satisfying. Talking about the final success, on the other hand, I thought this part was pretty abstract. We know what the ideal scenario is (“creating a safe community where players can socialize, play and store value in NFT assets / celebrate diversity and create a melting pot where people from different cultures can interact and understand each other”). But how could we measure the success of this game, specifically, and the consequences of the project for Cardano? Speaking first of all about the game: it would be necessary for the bidder to suggest tangible metrics and KPIs, such as the number of CNFTs generated and minted, amount of Ada that would be circulating from the purchase and sale of these tokens, number of active users, amount of created meetings, etc. In addition, it would be interesting to study some more qualitative aspects, such as the satisfaction of these users, how much time they spend playing per day and how they have evolved within their missions, that is, if the engagement is being as expected. And, in order to understand how all this impacted Cardano, I believe the main question to be analyzed would be whether these players started to get involved with other community activities, that is: now that they know and understand what blockchain is and its ramifications, are they participating in other Cardano projects, whether games or not? Are they participating in Catalyst? How did the game contribute to the popularization of Cardano, specifically? I think the auditability was very good in the first part, but in the second part, it deserves a reformulation to make it more adequate.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2535, "q0": "The game presented in this project is an example of a play-to-earn game incorporating Cardano NFTs as a basis of proof of ownership of different assets on the game. The game is inspired by multiple popular games like Battle Royal and Diablo. There is a real potential for this game to be a great added value for our ecosystem. The project also aligns with the challenge's guidelines since the product is integrated natively with the Cardano blockchain.  Furthermore, the team makes it clear that they aim to make this game a global one where everyone can participate and express themselves and take social impact to the core of the project. Finally, the ability to scale for such projects is definitely significant since such games are starting to gain worldwide reactions, especially with the latest hard fork coming such transaction-heavy projects will be working smoother than ever. On the other hand, I would have appreciated seeing more planning or structured details on ways to increase the game's impact.", "q0r": 4, "q1": "The team as described seems balanced and suitable as a bootstrap for such project, but I was unable to confirm the information given about the team members since no relevant links were given and nothing popped up on the internet. Furthermore, no Github repos were shared which would have been useful to at least showcase the team's expertise in relevant areas. The team presents a quarterly roadmap with different goals to achieve, but again these goals are often than not broad and doesn't showcase what exactly be worked on in terms of infrastructure and development. The budget seems fair for what needs to be done and is divided between multiple needs of the project i.e Website refinement, development,...\nThe risks mentioned remain a bit scarse, I appreciate the mentioning of guerilla tactics in marketing which would be useful for an underfunded nascent team that is yet to prove its value and perhaps bring an MVP to the market that will help investors feel more comfortable with onboarding.", "q1r": 3, "q2": "While the team mentioned being involved in Discord and being accountable to the community every single step of the way, it remains ambiguous how can the community really audit the development of the project, especially since the nature of the project is sensitive to leaks and code can not just be shared openly with the community. Furthermore, The quarterly milestones in the roadmap are significant, but what would have been better is to specify exactly what one can expect in every milestone by mentioning forecast numbers. This would have helped the community manage expectations and judge the project's development more fairly. At this stage, I believe the project might need more time to refine its proposal and work a bit more on its roadmap and accountability data points. Also, sharing more links to the team members and past projects would help us have more confidence in the project and recommend it for funding.", "q2r": 3, "assessor": "z_assessor_2317", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4463, "q0": "Creating a game with Cardano NFTs that is made by experienced Unreal game engine developers and has appealing looks and great gameplay on a budget would be an incredible and very worthwhile undertaking. I am sure that this would create some publicity and attract new users to Cardano. Showcasing that Project Catalyst can be used to bootstrap an ambitious game development project outside the big studios by a team of proposers from Nigeria would be something I would love to see, and consider highly impactful and aligned with the challenge's goal of boosting user adoption, user experience and integration of blockchain and real world use such as gaming.", "q0r": 5, "q1": "The sample work and Youtube teasers are promising and the team have extensive experience with the Unity game engine, and have worked on similar (off-chain) projects before.\nIt is great to learn that the team \"collaborate(s) using tools such as GitBook, GitHub, Titan Email, and Trello\" but it would have been nice to see links, screenshots of examples to underpin this claim. The Gitbook link works well and shows some promising video examples and a lot of background about world building and player experience (\"Lore and Storytelling\").\nI personally find it hard to believe that the budget (which could have been broken down into more granularity) and the game launch in the third quarter of this year are realistic targets, so it would have helped me better if this would have been framed as a \"pre-alpha\" or community-project or some wording like this, or some more explanation about the size and quality at launch. \nIn general, this project is presented with fairly good detail, but given how difficult it is to make quality games, I would have liked to see this question answered in more depth.\nThe likelihood of this project being launched successfully is quite high given that the teasers and gitbook are already there and quite promising, but given the timeline and budget may not be called a full game. Nonetheless, I am excited about this project and hope it will be implemented with improved communications from the proposer team.", "q1r": 4, "q2": " It is great to learn that the team \"collaborate(s) using tools such as GitBook, GitHub, Titan Email, and Trello\" but it would have been nice to see links, screenshots of examples to underpin this claim. This is a theme across the entire proposal: eloquent descriptions could have been backed up by numbers, quantitative goals and data.\nIn addition to the Gitbook, which looks very promising and is fairly detailed pre-funding, more external links (to the profiles or portfolio of the team, ways to track the progress of the project or communicate with the proposers) would have increased both the ease and confidence of assessment.\nIt may help when developing on a tight budget to look for partnerships and document project management with diagrams and high granularity to increase both chances of success and confidence in the successful delivery.", "q2r": 3, "assessor": "z_assessor_2554", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5811, "q0": "The game partially addresses the challenge. It has a nice potential, as it can be seen on few in-game videos that are available. Any multi-player game that uses CNFT has a good potential for Cardano community, especially if it looks to be in good hands as it seems to be in this case. Proposers are mentioning that CNFT will be affordable and easy accessible for people to use, that is definitely a good approach, as this will attract more players. And there is no pay-to-win option that I also fully support.\n\nThe game will use unique dynamic CNFTs during the game, but I failed to see at what extend. How will they be used? Would like to see this part more explained. It is also mentioned that there is weekly report of the game progress, but failed to see where it is shown. ", "q0r": 4, "q1": "The proposal (game) is already in development, so it is not entirely depending on community funding, it will only help them. There are already some gameplay videos available and I have to say it looks quite promising. The team is relatively experienced and looks to be highly involved in the development of the game. The team is actively working on promoting the game as they say via 'guerilla marketing' and funds are needed also for promotion purposes. \n\nTherefore I do believe that proposal has a good chance to be implemented successfully. ", "q1r": 4, "q2": "I would have to say it lack more information to audit the progress. There is information available only as quarterly overview and since we are already in July, it would be nice to see the current status. Are roadmaps from Q1 and Q2 achieved fully? If not, what is missing? \nThere are no precise dates for future and what will be delivered when. It is mentioned that target is to have 50,000 people playing the game. But difficult to say when or if it will be achieved.\n\nI like what I see, but still need more information. Additionally it is mentioned that users of the game will 'most likely trade their CNFTs' and therefore create revenue, but there is no guarantee as it will not be mandatory during the gameplay. ", "q2r": 3, "assessor": "z_assessor_2752", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10378, "q0": "The proposal applies for funding to build a project called \"Pangaea kingdom\". It is a Gamefi project on Cardano. We all agree that Gamefi is a part of Cadano. When many game projects develop, they also help to develop Cardano. I follow this project from the beginning on Twitter and Discord. Although they have tried to develop their project, they haven't attracted the community. Gamefi is a good direction but I suggest they should make their project different.", "q0r": 3, "q1": "As I mention, the team should make some adjustments to their project. Instead of selling lands, Nfts or coins, the team should focus on developing the quality of the project firstly. Then, they should offer some policies to show the difference of Pangaea kingdom. For example, the team should let the community experience NFTs or assets Pangaea kingdom freely. If the game is good, the community will willing to pay to play.\nAbout the team, they are experienced engineers and developers in the game field. They have a clear roadmap for their project. About the game, they have already built Pangaea kingdom for few months. I highly rate their ability in the design and graphics of the game. They have a roadmap for the project and it will last about 1 year. They suggest $25000 for this roadmap.\n", "q1r": 4, "q2": "They don't provide security solutions for assets and nfts in the game Pangaea Kingdom. In addition, they don't provide solutions to ensure decentralization. They don't also have clear key metrics to measure the effectiveness in each milestone; however, the community can track progress efficiently in their weekly progress reports and semi-weekly standups. Besides, they also report the developments of the project and latest achievements through the website: https://pangaea-kingdom.gitbook.io. ", "q2r": 3, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14490, "q0": "This is an interesting proposal, an NFT game genre with a combination of elements from famous games such as Clash of Clans, Age of Empires, and Diablo. This proposal's game describes many features, including war, diplomacy, and leaders such as kings, conquering regions, and expanding the geographical map. This might be the type of game that gamers love. The proposal has focused the solution for the development of this project with the solution of building game ideas connected to NFT and aiming as an Axie Infinity Marketplace. The author mentions 50,000 users within the first year of the game, which is the only KPI he provides. The risk section is clearly written with difficulties such as a development team, a lack of marketing budget, and misunderstandings about NFT technology, and solutions to mitigate these problems are also given.", "q0r": 4, "q1": "The team gave us a description of each member so we could get to find out exactly their contributions to the project. They have people with substantial experience in software development using the Python programming language, Unity game development, and marketing. They have all been designated employment roles . Each month, the team gives a detailed plan of what will be prepared and finished. This makes it easier for the community to follow the project's roadmap. The budget clearly divides project costs into pieces but fails to provide a detailed breakdown with hourly rates and hours required. With the info given for feasibility, it is quite possible that the project will be carried out effectively.", "q1r": 4, "q2": "GitBook, GitHub, Titan Email, and Trello are among the tools offered in the suggested project progress tracking section. They also use the Gantz Chart to manage tasks. The tools offered for managing this gaming project are appropriate. The author also discusses the project's vision as well as the general benefits of a successful NFT game product. The proposer has gave a clear plan with milestones as well as a clear timeline broken into quarters to help maintain track of the project. However, they have failed to provide clear KPIs and Metrics to help measure the impact of their success. Additional information, such as metrics, are needed for audibility in order to evaluate the proposal's success and progress.", "q2r": 4, "assessor": "z_assessor_4060", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Pangaea Kingdom’s solution is to create an interactive play-for-fun-and-earn concept which is the Social-GameFi. ", "experience": "\nMore than 5 years of experience on Unity Game Engine\nMore than 4years of experience with Marketing\nFormer Digital Manager and Marketing Team of Bondex App\nPreviously worked for NotScared, SeeAlgo, Four Pillars Entertainment, and Quiva Games\n"}