{"id": 416529, "author": "magnox", "title": "Create Value For Screenplay Writers", "url": "https://cardano.ideascale.com/a/dtd/416529-48088", "category": 26595, "amount": 60000, "description": "For 100 years the film industry has been run by middlemen. and agencies. This has significantly tapered the income and creative freedoms of screenplay writers.", "f6_no_assessments": 10, "f6_rating": 4.1, "videos": [], "media": [], "f6_assessments": [{"id": 1650, "q0": "The problem is really something that happens a lot in the cinematographic universe, which is the difficulty in producing films due to an outdated industry full of intermediaries, which makes it difficult for artists to earn a fair income from their ideas and projects. To solve this, the proponent suggests the creation of a platform whose main objective is to help audiovisual professionals to produce their content more safely and also to have more rights over the sale and distribution of their scripts, as web3 would be used, the Blockchain technologies would be the tool for such content to be coined and monetized more adequately. In other words, theoretically, the proposal aligns well with the challenge of Dapps, as it seeks to create a Dapp that will attract a portion of people who are not necessarily involved with the cryptographic world. Audiovisual professionals would be interested in the initiative because of the advantages that creating cinema here would have, and not necessarily because of the blockchain and its technologies, although one thing would lead to another. The problem I identified with the proposal's impact is that, even though we carefully read the entire scope of the proposal, it is not so clear in what ways the Web3 technologies would be integrated into the platform. Some things are very well defined here, for example, the difficulties that professionals in the field face, such as “writers do not receive royalties for the idea they created + small stores to display their scripts for sample readings + little or no possibility of interact directly with actors or producers + spec scripts are going through handlers” and so on. In general, transparency and quality control are lacking during the film creation process, according to the proponent. It is also very clear what the advantages of using the platform would be (creating a safety net and guidance for film industry participants + allows artists to have economic freedom across the film industry + allows new ideas and content to be presented to final consumers, etc.). But in relation to how the blockchain would be linked to all this, in my perception the explanations were a little summarized, so that we have no way of adequately understanding how Cardano would be used, in practice. What would be the contents minted on the blockchain? Would the NFTs be the scripts, would they be the other parts of creating the film? How could screenwriters track and share their ideas, both with other audiovisual professionals and with artificial intelligence? In this regard, it is said that artificial intelligence would be used to improve the quality of the content created and to make creative suggestions, how would this technology be built? Regarding the fee for companies, what would be the % compared to the costs of each film being produced? Would it be a fee charged per project, per professional…? In general, my perception of this proposal is that, yes, it is a good idea and that in theory it fits with the objectives of the challenge (because it will create a valuable Dapp that will attract a new audience to Cardano, fostering our community) , but lacked some practical explanations about blockchain integration.", "q0r": 4, "q1": "The roadmap presented in the proposal is not very adequate, the activities are presented on a quarterly basis and are not as detailed. It is said during the explanation of the impact that an effort would be made for many writers and companies in the field to get in touch with the platform, but during the explanation of the task schedule it is not mentioned how this would be done. The proposed activities are not well detailed, for example, how would the preparation of the software architecture be done, and what would be “safeguarding the blockchain roadmap”? As in the third quarter of this year, the other quarters should be their activities better explained. Each activity should contain an individual detail so that we could understand not only what would be done, but also how and who would do it; the temporal division could also be more specific. For example in Q1 2023, the focus would be on two activities: early access for some writers and cloud/API test security. What would happen in January, within these options, and in February? I believe that the way the roadmap is laid out, unfortunately we don't have a solid understanding of the processes that will be developed in the future. A positive point, however, that I think it is important to emphasize in terms of the script, is the milestones reached. The proponent defines some of the goals in the technology field (KI-Analyse Roadmap, licensing/selling roadmaps, internal process, blockchain implementation, cloud security and API, among others). For this part to be complete, in my opinion, it would also be important for us to know when each of these milestones is expected (in which months of both 2022 and 2023 they are expected to be reached). Talking now about costs, in my view, something similar to the presentation of the script happens: we know the basic information, but we don't have many explanations about how the money would be used. For example, $10,000 would be earmarked for UI/UX design, how would the interface be built, what would the designer's work routine be, what would be the price of his hour of work? The same doubts arise in relation to the other parts, such as the backend developments, AP implementation and etc… How would the community development be done? Perhaps here, in this part, the issue of disclosure within the cinematographic environment would fit, but it still remains a little open. Talking about the team, we actually have a duo defined here, an average trust is transmitted in those involved, since they are given some information about them (but not so much), their linkedin profiles or other ways of verifying the information are not provided that are passed. I also believe that the team still has to be complete, for example with a designer. It would be important for all members to be properly introduced.", "q1r": 3, "q2": "The information provided about the auditability of progress seems pretty safe in the sense that the team stays organized and constantly and solidly monitors its progress, but it doesn't give us as much confidence as to how such information would be conveyed to members of the Cardano community. It is said that progress would be tracked by the Scrum framework, it is positive how the proponent explains the workings of the tool (\"the Scrum framework is based on transparency, inspection and adaptation and will allow us to move forward at sustainable speed and deliver the parts of the product in small iterations ”). In this way, those readers of the proposal who had not previously come into contact with this technology would have a better understanding of how it would be developed. Other positive points of this part of the proposal are that the proponent states that weekly sprints and daily 15-minute meetings will be held, so that the team always remains cohesive and alert about what is being done. So my suggestion here is in relation to how all this information would reach our community, in my opinion it would be necessary for the team to prepare monthly reports that allow the community to have knowledge about what would have been developed in that period of time ( therefore it would be important that the script be detailed with greater specificity). Talking now about the auditability of success, several informed metrics are reported that can illustrate the ideal scenario (end users -screenwriters- can use the platform to safely load and save segments of their scripts + the platform helps users to come up with new ideas for + NFTs can be generated as scripts + users actively use the platform). In my opinion, it would be positive for an analysis to go beyond the success of the platform itself. By that, I mean a more in-depth study of how screenwriters and audiovisual professionals who would be using blockchain technologies would be relating to the cryptographic universe. It would be necessary to understand what were the most palpable consequences of all this for our blockchain, will these professionals have started to use other Web3 tools, since they now know their uses and advantages? How could Cardano, in particular, stand out from other blockchains in this process? How can we confirm that the specific objectives of the challenge have been met - have the writers become active members of our community? So, I believe auditability is fine, but some small changes are needed to make it ideal.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3984, "q0": "In my understanding, this proposal is targeting a fractional part of creating a large (web3) platform on Cardano for Screenwriters, Actors and Producers (This proposal addresses screenwriters). The discussion on the art industry and the fact that large companies of the film industry is limiting creators has been going on for several years. The tools and spaces created to mitigate this is not well developed, so in my opinion (as a musician) this proposal addresses an important and underdeveloped need in the film and arts industry. The proposer seems to have understanding of the problem, and describe in great detail not only what they want to do, but also how they want to do it. This is shown by focusing on creating functions that is well needed for screenwriters, from the creative process (collaborating on ideas with others on the platform) to selling their screenplays as NFTs (and still holding the royalties). \n\nThe proposers are well aware that this project will take a lot of time and effort, with a couple of other risks. To mitigate the potential risks mentioned in the proposal, they know that the people involved in this project need to be 100% focused, it is nice to see them addressing the need for dedication. The market conditions-risk is complicated, but I believe that focusing on the community-first principles is the right way to go. That way, the first steps of implementation doesn’t need to be fighting a trillion dollar film-industry, and focus on the creators and actual community instead. The development will probably be a bit slower this way, but it will increase the probability of the project being successful. Having a strong and dedicated community will also build a strong foundation for the future development and sustainability of the project. \nThe team states that choosing Cardano as a working platform fits well into their own thorough (and slower) first-principles-based ideology, and this is clearly reflected in the proposal. \nThe intended product has potential to address several different aspects of the Cardano, with a heavy focus on community and NFT market. \n\nI would like to have seen some inclusions on the KPIs related to adoption rate, as of now the current measurements of success is connected to functionality of the product. Since outreach will be an important part of this proposal. It would also be beneficial if the proposer further expanded on the risks of listing two team members for a proposal of this scope. (Correction: after looking through their official website the number of team members is 12) \nJust including a paragraph including some thoughts on if they plan to hire Cardano developers would be helpful, etc. \n\u2028Overall, I agree that this proposal effectively addresses the challenge. ", "q0r": 4, "q1": "The proposer provide us with a very detailed roadmap with included milestones set on a timeframe of roughly one year. It could be formatted to be presented more clearly (lots of jumping back and forth between milestones and roadmap) but this is just minor, in my opinion. All of the relevant information is there. \u2028In the budget breakdown we are provided with a rough sketch of the budget allocation. The requested amount in total (60 000 USD) seems fair for what the proposer intends, and most of it (50k) will be spent on product development. In order to make the proposal even stronger, I would suggest to include an estimation of work hours for each team member and responsibility area, and connect it to the budget numbers to provide us with an estimate of workload and hourly wage. \u2028\u2028As mentioned before, there are two team members listed in the proposal and 12 team members listed on their official website, It would be beneficial to include some clarifications on if the whole team will be included in this, or if there will be need for hiring staff outside of the company. On the website we can find LinkedIn-profiles, contact information to many of the members. From my perspective as a recurring PA since Fund 6 and a voter, having that information included in the proposal would be nice (since we wouldn’t have to jump back and forth between website in order to verify the expertise of the proposers). \nThe team seems to have a lot of expertise covered in order to implement this proposal successfully, but there is clearly a gap in regards to blockchain technology and specifically developing on Cardano. Maybe it is not meant to be included in this initial stage, but I would have liked to see a paragraph explaining the plan for the implementation on Cardano, and where the proposer will find that competency. \n\u2028The proposer states that it is likely that they will return to Catalyst to apply for further funding (due to the immense scope of the project), I hope (personal opinion) that they keep their intention of focusing on this project for the future, so that their attentions and time won’t be divided between different projects. \u2028\u2028Overall, I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "In my experience as a recurring PA since Fund 6, I’ve come to really appreciate and understand the value of transparency, especially in two areas: Transparency within the team during the process of development, and transparency when communicating that with the community, outside of the team. In regards to the retrospective and measurements of KPIs within the team, the proposer has a strong plan of continuous check-ins during development. I don’t have experience with using Scrum, but involving external tools in order to increase transparency and process is always a good thing, in my experience. \nA key question to ask is: where will the team communicate this with the community? Will the community be able to provide feedback during development? There is an official Facebook-page, an instagram page along with a twitter handle where all of these probably will be communicated, but this is information that could’ve been included in the proposal. As a PA, I’m assessing proposals and preferably not information that is assumed to be understood. The more relevant information included in the proposal, the more transparent and credible the proposal will be. \u2028\u2028As mentioned before, I would also suggest to include tracking KPIs that are relevant to outreach, and the community. How many people are using the beta when the app is released after 1 month, 3 months? How many on-boarded screenwriters will be measured as a success, according to the team (including target numbers, etc). \u2028\u2028Conclusively, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 4, "assessor": "z_assessor_2504", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1206, "q0": "This is an idea to build an application in the film industry, allowing screenwriters to upload their movie scripts, identified by NFT to protect copyright. Of course, they choose the network cardano, smartcontract to write this application. The film industry is an age-old and near-powerful field centered on a few but long-standing film producers. According to the information of the proposed writer, although it is not easy to bring this application to the public, but if this project is successful, it may change the financial distribution of the transparent and public film industry. more equal. I agree with this proposal, it fits the goal of the challenge presented.", "q0r": 5, "q1": "The project's roadmap is built with clear technical tasks, and will take place in 1 year from now until the end of the second quarter of 2023. They will develop AI technology, NFTs, MVP, user interface... to serve this project in the whole plan.\nHowever, the member profile (2 people are named) however I have not seen their linkedin or twitter profile link to be able to follow and verify member capacity. Therefore, I am not sure about their ability to implement the project.\nThe cost of applying for funding is not too large, but the costs are not really specific with information on the number of working hours, the number of people in charge and when it will be completed. For these reasons, I cannot give this content a high score yet.", "q1r": 3, "q2": "They plan to report weekly and use the scrum tool to fully report on project costs, application features, and progress. This is a good reporting tool, can be transparent and convenient to verify the report value. However, because in the above work plan, they have not really detailed the deadlines as well as detailed technical milestones or target numbers to be achieved. This is why this piece of content is lacking. In addition, they also need to uphold the security of user information, movie script information and project communication. In the end, the content is quite suitable for the overall project but not detailed enough for me to rate higher.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2534, "q0": "This project is a platform for screen writers, actors, directors, and producers to find each other, this proposal focuses on the screenplay writing aspect of the project and attempts to automate a lot of the process where a screenplay is written to the time when its bought and used by a production company. The team also seeks to get rid of the friction preventing new talent to pierce through the space while remaining transparent and abiding by SDG goals. Cardano here will be facilitating the automation of acquiring the right to screenplays and the exchange of value through the blockchain. This project is an innovative one and constitutes a paradigm shift in how things are done currently. This project has the ability to introduce a whole new demographic to our ecosystem while remaining easy to use and not very technical which will make a good impact on our ecosystem. Furthermore, the project has an immense ability to scale as long as the product is well designed and proper AI algorithms are introduced in order to minimize human interventions which limit the product.", "q0r": 5, "q1": "According to the information and links shared by the team, the success likelihood of the project is pretty high. For starters, one of the members of the team is responsible for CNFT awards which was a highly celebrated event and required a lot of organization skills. Furthermore, the team provides a link to the website which is highly organized and matches the niche or creative minds it's trying to attract. The proposal and the website provide detailed information about what the team is trying to do from ideas to specific use cases of NLP and Blockchain technology in their architecture. The team also provides a quarterly roadmap including what will be done that he's to manage expectations and sets multiple milestones to accomplish. The budget is well detailed and shows what will be spent on what from management to development and seems to be fair considering the task at hand. The risks are put into three categories: Team, Technology, and Market condition, and for each one some mitigations are proposed. The team also uses an Agile framework of development which matches such projects and raises confidence in the process taken by the team.", "q1r": 5, "q2": "The team seems to be internalizing accountability and is open to accountability from the community. For instance, the project uses Scrum while incorporating constant team meetings and development tracking, and constant testing. This framework matches the projects since it included 2 sensitive and valuable assets which are tokens and screenplays and so on. The community will be able to track the development of the project by following the quarterly milestones set by the team and success metrics provided like features released and the number of users,...\nThere is no constant delivery date since the team plans to release an MVP and then constantly roll out features and continuously add value. The fact that the project doesn't share any code so far is a negative point but it's still understandable due to the stage where the project stands. But I'd prefer seeing the team open-sourcing some of the non-critical code and also provide some documentation for their planned architecture since that would help the community and perhaps other teams planning to use similar solutions in different fields like music, sports,...", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6804, "q0": "Great adoption has to come with some level/avenue of acquisition. One amazing place to create demand and usecase for our blockchain is through the movie/screenplay writing industry. The proposer objectively identifies the problems caused to screenplay writers by middlemen who run the film industry.\nThe solution will provide a secure web3/blockchain powered platform for screenplay writers to securely store, manage, license and distribute their works (on their terms). These will cutoff the need for agencies and middlemen thereby exposing them to untempered income and unlocks great deal of freedom. ", "q0r": 4, "q1": "The proposer provided great deal of information that provides reasonable and definite value for the idea (website is up and functional with valid demo of the idea). The solution will also be AI powered and artist can collaborate to make great films, these however ensures sustainability of the project. Film makers and screenplay writers are supposed to be entitled to royalties for their works, they are supposed to have legal backing and control over their works. All these among others are the benefits that are deprived and these proposer clearly identifies steps to address the problems. The timelines provided clearly show a structured implementation plan with unique set milestones. Budget is also fair and reasonable although there's not much information about people who will be working on the project as proposer provides just two names of team members. Team also should consider to have a very solid legal backup because these idea will have some legal eagle eyes when it lives. Overal, i believe the team is capable of implementing the project considering the workdone already.", "q1r": 4, "q2": "The articulate structure of the timeline and milestones uniquely creates easy path to audit the project. Different phases of the project is broken down into realistic timetables quarterly. Team will also use agile project planning/implementation method and ensure feature set delivery which i believe will ease auditing and provide better clarity thereby producing optimal results. The successful implementation of these project will ensure that NFTs can be generated as screen plays, users are empowered and new ideas is built among others. These however i believe are unique KPIs to evaluate success. ", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7289, "q0": "This is an interesting and useful proposition. The purpose of the proposal is to create a Web3 platform built on Cardano for scripters to securely store and manage, edit, sell, license, and distribute their scripts. The project has clearly defined its business model, as a third party, a platform provider, the team proposes a solution to support its partners and customers. Specifically with partners who are amateur and professional actors and directors, Empower, give them a number of features to help them write better scripts, after writing they can upload the script to the platform. The platform is generated with a QR code which makes it easy to confirm the secret movies, moreover the platform algorithm will verify and check the database for duplicates or scripts with the same characteristics. Guaranteed ownership, transparency and no copying, they can then sell their screenplay (NFT) for monetary value or create a project that allows actors to participate with production capabilities. script output. This can create opportunities to earn more income and access to Cardano Blockchain technology for script writers. As for customers who are production studios and sponsored projects, they will support to charge a modest fee for businesses when using this platform, helping them to confidently choose a suitable script. Yes, there is a clear, transparent QR code, no fear of copyright infringement. Through the application of the platform to the production of movies, it helps to increase the transaction volume, expand the reach and increase the number of people who know and participate in the Cardano ecosystem. If the project is successful, I think it can expand to other areas similar to music, literature etc. Future.", "q0r": 5, "q1": "The project plan is described and listed in detail, clearly divided into sections and milestones, but unfortunately the team did not attach the corresponding specific timelines, the advice would be better if have specific timelines, as it can make it easier for the review community to track and evaluate. The team is experienced and skilled in accordance with the work content of the proposal, so the project can be successfully implemented, and the members' information is easily known through the Web site https://collude.online /aboutus that the team provides. The team budget outlines each work item with corresponding amounts. A special feature is that the project uses Scrum as a flexible project planning and execution method. This will allow the project to better calculate the cost, time and quality for each feature development. The proposed team has outlined the risks that the project may face and taken measures to reduce the risks to the lowest level.", "q1r": 4, "q2": "The progress of the project is detailed, but unfortunately does not include specific timelines for achieving results, so that it can be easily followed by the community. Measures to address the challenge posed, described, explained clearly and understandable. KPIs, success metrics are presented clearly and easily by the team, in addition, the team has used Scrum, a flexible project planning and implementation method, and will be calculated and refined. backlog work, take measures, improve team cooperation, sprint, to complete the work, set KPIs according to the plan to successfully implement the proposal.", "q2r": 4, "assessor": "z_assessor_2886", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8619, "q0": "This project aim to create a transparent and accessible platform that will help the film industry to become decentralized and independent from the middleman, by getting paid directly to the them. This will help not only the adoption of Cardano, but the independent screenplay writers, actors and the people within the industry to self sustain themselves. This proposal also align with Cardano ecosystem by pushing its technology and community spirit. \n", "q0r": 4, "q1": "The team profile is still in working progress so it lacks detail, they do elaborate on each team profile by providing relevant experience in related fields but didn’t include any professional references such as Linkedin links, etc. The proposer provides a working website and links to their Github repo (although it has yet been made public), They are able to recognize the risks that might ensue and hinder the progress of their project, and comes up with a solution to mitigate the problem. They explained the roadmap and milestones quite clearly and were able to elaborate on possible resources needed. The budget breakdown is offered but still lacks details such as how many people will work on it and who will work on it? Do they outsource the people or utilize people within the team? Providing those extra details will help with understanding their budget allocation. \n", "q1r": 3, "q2": "While the proposal provide theis goals milestones, It’s does need more refinement and supplemental details and specific roadmap, also it might be better to include target number. They also didn’t provide any kind of link besides their website to further track their progress / to audit, It would be helpful if they can improve on their transparency by maybe providing a link to their community based space like discord? or by giving a more elaborate explanation on the audit.", "q2r": 3, "assessor": "z_assessor_2994", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11448, "q0": "The proposer would like to create Web3 platform for screenplay writers to safely store, track their ideas, sell and license their screenplays (NFT) on Cardano blockchain. I think it is a good idea because it could assist screenplay writers on their journey without the involvement of numerous third parties, help increase transparency throughout the process as its meta data about screenplay is saved on the Cardano blockchain. In fact, this is not an easy task to change how the film industry operates which have been run for hundred of years by middlemen and agencies. Therefore, I think this is an ambitious idea of the proposer which might face a lot of challenges, but I appreciate it and looking forward to how this proposal turns out. ", "q0r": 4, "q1": "The feasibility part is average, I think, some parts need to be more detailed. Starting with the roadmap, they provides one-year plan, quarterly implemented, and some technical activities are mentioned in each phrase. However, in each quarter, I would like the proposer to clarify how many weeks does it take to complete each task? what exactly their main focus in each quarter? who will be in charge which task? As I know, there are only 2 people in your team now. And the proposer introduce shortly about them as product management, software architecture, and how they know Cardano without any profile link for community reference. My suggestion is that the proposer should clarify their detailed roles in this project. Also, it would be better if they have team members who have experience in film industry, and more personnels as the project progresses. Next, the cost of the project is not clearly explained. How is it calculated? I mean, how many hours does it take to complete each task? Will it be calculated on hourly rate or monthly rate? I mean, more details about the use of funding is needed. In short, in my opinion, the proposer need to more preparation in most parts of the proposal script which could shows their confidence and ability to carry out this project successfully. ", "q1r": 3, "q2": "In my opinion, the auditability part is insufficient and detailed enough for community to keep track of the project development. The proposer claims that they will use Scrum to monitor project planning and implementation, by backlog planning, weekly sprints, daily 15min meeting. However, this methods is only for the internal checking of the project, where will they publish their reports? on website, or any other social media channels? What will be their project KPIs, I mean, key indicators such as the number of users registered on the platform, the number of screenplay scripts published, the volume of transactions, or how many active members on their social media channels such as Facebook, Telegram, Twitter,.. Therefore, it is lack of the proposer not to tell exactly how the community could keep track of their project development, and how to increase communication among their team and community. ", "q2r": 3, "assessor": "z_assessor_3246", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11984, "q0": "For at least 100 years screen play writers and the film industry in general has been taken advantage of middlemen and agencies depriving for reasonable income and creative freedoms of screenplay writers. The solution to this problem is Collude a Web3 platform where screenplay writers can securely store & manage, edit, sell, license and distribute their screenplays. The project meets the challenge's KPIs by upscaling Cardano ecosystem in other areas apart from crypto, by bringing onboard new users whose intention is not just crypto, and use the Cardano blockchain technology as the underlying technology or rails to validate and secure the work that end users are doing.  ", "q0r": 5, "q1": "The project will be implemented within  quarters which is enough time for the team members to complete the project successfully.  The team members are experts in dev and product management.  Links have been provided to their profiles and video about their work.  The budget is broken down into two main tasks: project design and product development, and these are further broken down into smaller tasks.  This helps in aligning tasks and deliverables with the budget requested.  The proposer addressed a few risks but the main ones are a 100% dedicated team to the project and communication and cooperation with freelancers. All will be mitigated with the help of the Community.    ", "q1r": 5, "q2": "A clear and realistic roadmap has been provided (4 Quarters broken down in tasks that can be used to track progress) and is aligned with the milestones of the project. To track progress Scrum a method for project planning and implementation) will be used.  This method will help calculate the cost, time, and quality for each feature development. The Scrum framework is based on transparency, inspection, and adaptation and will assist both the proposers and the Community to track and deliver the project as per milestones and deliverables.  ", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12605, "q0": "The proposal meets the challenge setting. The problem that the project poses is completely true, not only in the field of cinema, now many other fields, transactions, distribution, ... are through intermediaries. This will cause difficulties in brand development and reduce income. I believe this project has a great opportunity to work, it has a good platform that attracts writers and writers, they can utilize their talents and maximize their income. The proposer presented the project in detail and the methods applied by the project,That proves you've invested a lot in research, I couldn't ask for anything more. I very much welcome projects that integrate Blockchain into platforms making it decentralized, which will solve all the problems of transparency and will completely eliminate the high cost of middlemen.", "q0r": 5, "q1": "The proposer has provided a project roadmap that clearly contains the assigned work of each phase. And project members' information and proof of their experience are clearly presented on the project's website. I have full confidence that the team has enough experience to take on this project and meet the workload across the entire roadmap. I have no comment on this part, on the requested budget I consider appropriate for the project scope.", "q1r": 5, "q2": "Thank you for providing the necessary information. But I hope you will give me some specific metrics to help me compare with future surveys, which will help me more clearly when measuring the effectiveness of the project. For example the number of scenarios uploaded that you want the project to achieve in the short or long term. The proposer has also provided a github link so that the community can easily follow updates on future project progress. I have no further comments on this part.You have to me to look at your view on the public project of this project.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Collude is a Web3 platform for screenplay writers to securely store & manage, edit, sell, license and distribute their screenplays.", "experience": "Our Team is comprised of 5 members; 1x Project Manager, 2x Fullstack Developers & a 1x Business Developer, and 1x DLT specialist.\n{Work in Progress}"}