{"id": 416660, "author": "kaizencrypto", "title": "Cardano 101 Course - Kaizen Crypto", "url": "https://cardano.ideascale.com/a/dtd/416660-48088", "category": 26595, "amount": 30000, "description": "A lot of Cardano content is not structured to onboard new users. Many Youtube videos are focused more on price than on education. Many people coming into the space are not familiar with basic skills.", "f6_no_assessments": 8, "f6_rating": 4.458333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4562, "q0": "Onboarding new users to crypto ecosystems remains one of the larger roadblocks to adoption, and Cardano is no different. A well-curated and presented set of instructional materials is always helpful in helping newcomers navigate through pain points. This proposal should meet the criteria of the challenge through the social media provision. \n\nOn the other hand, there already is a pretty large amount of content out there that addresses many of the Cardano basics, so it's important to stress what new kinds of educational materials, techniques, or media are being brought to bear. With that in mind, I'd suggest mentioning the quizzes (from the Auditability section) earlier, as they're an important distinguishing factor. That said, even if nothing game-changing is being proposed, more of what we already have doesn't hurt.", "q0r": 4, "q1": "Pritesh, through the Kaizen Crypto accounts on Twitter and YouTube, is one of the more recognizable voices in the Cardano community, as well as a successful stake pool operator. He's already produced solid informative videos on Cardano-related topics, so the proposal is essentially a version of what he's already doing, but with higher production values and more convenient organization. There's no reason to believe he won't be able to deliver on the proposal. \n\nAdditionally, the project is pretty straightforward with a definitive end point. The budget should be reasonable for the tasks involved. ", "q1r": 5, "q2": "The proposal provides a number of strong performance indicators. The quizzes, in particular, should provide an excellent feedback mechanism regarding the effectiveness of the teaching materials. \n\nIt's not clear whether community members will have a chance to see video samples and snippets prior to full deployment of the course? Doing so could be a great opportunity to workshop the materials, as well as keep the community up-to-date on the project's progress. ", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6416, "q0": "This proposal has been written very well and is clear on what it plans to achieve. It talks about the current state of Cardano content on social media platforms and other services such as Youtube. A lot of Cardano content is focus on price rather than fundamentals which prevents casual Cardano users from educating themselves in the space. We want Cardano users to be educated and not be holders of the token for the sole purpose of appreciation of the asset. The solution to this challenge is that the proposer suggests creating a Cardano 101 Course which will include educational content that the community currently lacks. It will be focused for onboarding newcomers to Cardano and those that are not educated yet. The proposed idea is to create a platform/website where these users can go to go through a series of educational content which I will go over in the next section. I believe that this could be of great use to the Cardano community given that education is one of the many important topics for Cardano. For these reasons, I give this section 4 out of 5 stars. The main reason it hasn't received 5 stars yet is my question to the proposer would be, why is this platform completely necessary when it could potentially be done on Youtube? I understand that there will be more than just educational content such as implementation of \"hands on\" opportunities and quizzes for these members to implement what they learned. I bring this up just to allow the proposer to think about this and could potentially include a statement on this in the proposal. However, I do think it is a great idea and for that reason have given this section 4 stars.", "q0r": 4, "q1": "This proposal includes information on the proposer. Pritesh has his own Youtube account where he discusses current Cardano news and provides educational content to his community as well. It is important to note that this proposer already has a following on Youtube. This will be important because it shows that there are followers of this project/proposal and that the proposer will be held accountable for this proposed idea. The roadmap gives details on exactly what will be worked on throughout the building process of this project. The roadmap extends into the future for almost a year. There is a description around every 2 months that specifies what will be worked on and also the completion dates of those sections. This is important because it is a specific detail that will be able to be accounted for. There is also a budget breakdown that gives specific information on exactly where the requested funds would be allocated if funded. After looking through the roadmap and this budget breakdown. The requested funds match up with the roadmap. It is likely that this educational content will be exciting for his community members and will ultimately have a positive impact on the community. My question for this section would be, how does this proposal plan to reach the attention of even more community members? Maybe the difference between the community at Kaizen Crypto and the Cardano community? The more people that become engaged with this proposal. The more valuable it will be and the more likely that this proposal will be implemented successfully. For these reasons, I give this section 5 stars with all things considered.", "q1r": 5, "q2": "There is a lot of information provided in this proposal. This is a very good thing. There is no rambling and all of the information provided helps audit the potential success of the project. It is concise and straight to the point. Meanwhile, it includes specific information and specific dates of completion. When auditing the potential success of a proposal, there are a couple of things that can help lead to this decision. The first being transparency from the proposer or team behind a project. This includes being completely open with the current community and building trust with them. This would hopefully increase the engagement with this specific proposal and will likely lead to improved growth and traction for this project. Another important concept is accountability. Once there is a connection between the team and the community members, they will likely hold the team accountable to completing their project or in this case, this proposal. It should be a positive thing because of the excitement the community has for a project. With all of these things taken into consideration, this proposal proves that it is likely that it will be successful if funded. Remember to think about the ideas suggested throughout this assessment. There can be some great ideas that could likely help increase the rate of success for this proposal. The Cardano 101 Course will likely bring utility to the Cardano ecosystem and will help educate those that are looking to learn more about the basics of Cardano. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7896, "q0": "I taught math and accounting part time for three years and from my experience, most students did well in topics that were taught in an engaging and fun way. The subject did not matter as much as to HOW that subject was taught. The more interactive and fun the lessons are, while still driving the point home, the better result will be.\n\nPublic keys, private keys,DEFI and smart contracts. These are terms most Cardano members have heard, but not fully understand. This project can add value to the Cardano ecosystem by filling the learning gaps of existing members and through onboarding new users. The quizzes will also provide a meaningful interaction and will gauge the level of knowledge our community members have regarding the ecosystem. Current members may benefit by being able to build on existing knowledge which could potentially allow them to start building DApps. \n\nThis proposal does address the objectives of this challenge. ", "q0r": 5, "q1": "It is mentioned in the proposal that there are more than ten team members but reference links were only provided for one of them. The proposer is an experienced content creator on YouTube with 30K subscribers and almost 400 videos. The Kaizen Crypto has a strong brand in the Cardano YouTube space. This could assist in helping the educational course reach more people, locally and globally. The proposer has covered loads of topics ranging from wallets, NFTs, DEFI, setting up a stake pool and more making him an reputable person who will very likely implement this proposal successfully. \n\nThe budget is clearly outlined showing how much each item costs. A good thing to note is that the beginning stages of this project is already funded by the proposer. The risks for and solutions are clearly outlined. ", "q1r": 5, "q2": "The roadmap is clearly defined with timelines, however it is not easy to measure the success of the proposal by the community alone. The proposer does not indicate how and when the findings will be made public. Results from quizzes, numbers of attendees and retention of courses will be provided by the proposer alone. It would have been good if the results could be displayed publicly like Google Sheets for example. Community members can view the numbers whenever they want instead of waiting for when the results will be made known. \n\nMaybe the proposer will provide monthly reports to the community but it is not stated in the proposal so this left open for interpretation. The proposer should give more information on how the community can audit the progress of the proposal.", "q2r": 2, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8493, "q0": "The proposal is very articulated, I like the way the proposer introduced the idea in such a simple but very effective way. I can easily imagine how the team is going to run the project. Everything is introduced briefly but also very sufficient. The idea aims to produce a high-quality and engaging course that walks users through the various elements of being a part of the Cardano ecosystem. I can see how this project will help a lot of new users go through the various elements, and give them a credible source of information to feel confident in their ability to navigate the Cardano landscape. There’s a huge gap in the market out there for people who are interested in the crypto world but with a lot of conspiracy about crypto, they are still very hesitant to involve. In my opinion, education is the best approach to bringing crypto and Cardano to newbies, where you can introduce the crypto world to people by showing the fundamental of its principle (how it works) and its positive impacts in the real world. With that being said I think this idea will definitely attract lots of users to Cardano by making it a lot simpler for newbies and with a lot more new people coming in, it’ll enrich our ecosystem. And I strongly agree that this proposal completely addresses the idea. In terms of the risk, I to be honest find that this proposal has a minimal risk that can totally be under control. Although I’m on board with those risks the team mentioned regarding the friction, market volatility, and confusion from the new users. I suggest the team not to underestimate the marketing work, since you’ll need to build a certain reputation to get newcomers to choose you as their learning platform out of a pool of options on the market and moreover, to get to work with other several community members who are very knowledgeable with long-form NFT content who could potentially help with course creation on the blockchain (The Alexandria Project, DripDropz, etc). Hence, It’ll be very helpful to read more about your marketing ideas.", "q0r": 5, "q1": "Firstly, I’m very impressed with Pritesh Gosai and his background involving the Cardano education field. And in terms of human resources, I’m almost certain that the team has sufficient skills to deliver the project. Other than that, the team has done a very good job delivering a detailed plan with short-term and long-term plans. The roadmap is drawn clearly. Every step to implement development is listed carefully and aligned with the scope of the proposal. However, when it comes to budget breakdown, it’s better to have your budget following your plan closely, hence it’ll be very helpful if the team can also provide a working hours budget for each task, especially since the salary fund is 24000 out of requested 30000USD, when we put the budget breakdown next to the estimated working hours, we can easily justify the requested fund very fairly. ", "q1r": 4, "q2": "To audit the project, I believe that the team has provided sufficient aspects for audibility. However, for the community to define if this project is a success, time-related KPIs with a specific goal in numbers is necessary. For instance, after a month/ 6 months/ a year of launching this program, you would want to see how you can tell this project is going on the right track by getting XXX users to subscribe and X% out of XXX users complete a module each week, and so on. However, I’m happy with your long-term idea of success, and that’s a doable target I might say. ", "q2r": 4, "assessor": "z_assessor_2989", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8742, "q0": "The Cardano 101 course is an interesting idea. Personally, I find it very practical because as you said, many people who come into space are not familiar with the basic skills. The proposal outlines what you're building: what the course will offer and to whom it will benefit; project goals and outcomes. The illustrations are also very interesting. Besides, you also give reasons why the project is necessary. How this solution will solve the challenge is also mentioned in the proposal. Moreover, you completely anticipate the risks that the project may face and offer solutions to minimize them. All information is provided in full. I highly appreciate this IMPACT section.", "q0r": 5, "q1": "After reading this section, I personally found your presentation very good. First of all, you have provided steps you will take to implement development of Cardano 101 Course. Each step is mentioned very specifically. Then an extremely reasonable roadmap was mentioned. The roadmap has very clear timelines and specific activities. I have to admit it's extremely convincing. In addition, you also set a long-term vision and managing workload for the project. Budget information is provided in detail, openly and transparently. I have no complaints about this. As you introduce, almost all the work of the project will be done by Pritesh Gosai. His talent and experience is unquestionable. I hope the project will be successful soon. I strongly believe in the feasibility of this project.", "q1r": 5, "q2": "The project will be measured by two metrics, namely the number of people who are completing a module each week and the knowledge retention of course attendees. How to measure and the purpose of each metric are clearly explained in the proposal. Besides, you also describe the success of the project through two aspects. The first is for new members of Cardano. The second is for the Cardano ecosystem. This success gives me the feeling that this is really a potential project. I think this project is completely auditable.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9487, "q0": "As the perfect creator uniquely positioned to carryout such a proposal, for a relatively low-average cost, I rank this section a 4. Where this section loses points for me is in missing a few key critical components that can allow this proposal to reasonably get access to these outlined impacts. First, there doesn’t seem to be a reliable mechanism in place to reach new/unreached people that have not yet adopted the Cardano ecosystem. The proposal says that it will leverage the Kaizen crypto brand but the link to new users is limited only to people that are searching for the content (which may not be necessarily be saturated with newer users). I would like to see an outreach strategy to provide assurance and security that this content will be consumed by the target audience. This missing component could also be filled with some kind of market research that demonstrates who viewers are (perhaps from collected data from YouTube polls). The second component missing from this proposal is an identification of the risk of posting this course on a platform where it is restricted by a pay wall. Another YouTube channel could create a similar course for free and vastly reduce the demand for a paid version of the course. One would assume that it would be posted on the Kaizen crypto YouTube channel where it’s most openly accessible for new people to consume and effectively reach the impacts described in this section. However, later in the proposal it suggests that they will be developing quizzes to test users knowledge and posted to platforms like Udemy. While it could be argued that this might add more effective education, this chosen method will definitely mitigate impacts. These concerns can be put at ease with some more market research about YouTube to course conversion and may only be mitigating factors as the Kaizen Crypto brand is successful enough within the Cardano community to be a “go to” beginner’s course for navigating Cardano. ", "q0r": 4, "q1": "For a clear step-by-step roadmap and a perfectly reasonable budget that is all developed by demonstrably capable hands, I rank this section a 5. Voters will view feasibility through the lens of the development team and Pritesh is possibly one of the best candidates for the job as a long-time Cardano community member, one of the older Cardano based YouTube channels, and a very experienced Cardano Stake Pool Operator. If I had to give advice for improvement, I would suggest adding a breakdown of the estimated hours of labor for each point of the roadmap. This shows voters that the proposer has thought out every specific detail of every step of the project, even if they’re just estimated timeframes. I would also like to seem more specifics on the marketing strategy that would facilitate the actual impact that this project has on the ecosystem. A completed course with no awareness or users makes no impact on the ecosystem. On the budget, my only qualms is that it almost doesn’t seem like enough to facilitate a thoroughly top of the line production. $1000 for a camera is only enough to pickup a entry level DSLR (no audio equipment or lenses), $500 is only enough to subscribe to Adobe Premier Pro for a year (without additional effects software), and $2000/month for a full-time year salary seems too low for someone of Pritesh’s experience. This are all highly nit-picky critiques as this proposal is perfectly and obviously feasible in my view. ", "q1r": 5, "q2": "For demonstrative attention for all of the minimum base KPIs, I rank this section a 4. I think this section is where the proposal starts to fall short as I think a lot more thought, organization, and development can be put into this section. While I think the number of users reaching completion and knowledge retention of the participants is exactly the right things to be paying attention to, I think there is room for additional metrics to be monitored. I think metrics like social media engagement should be developed to measure awareness of the course, I also think website traffic should be measured to monitor conversion rates (if this data is available), and I think revenue should be measured to track ROI. Also, I do appreciate this section pointing out particular metrics being aimed at but I would very much like to see more timeframe based metrics with specific milestone targets. This proves to voters that there is a specific vision of success that produces a mechanism to help the proposer know if there is a need for adjustment as the project progresses. I think these fixes can turn a good auditability section into a great one that secures greater Catalyst voter confidence.  ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9615, "q0": "The project aims to create a course for newbies who have heard about Cardano, but don't know where to get started. The content of the course will revolve around the basics such as how to create wallets, NFTs, EUTxO, public keys and private keys, DAO, staking pools, DEFI, smart contracts, and other blockchain terminology. After taking the course, learners will have enough knowledge about the Cardano ecosystem and thus feel confident in their ability to navigate the Cardano landscape. The product this project produces will help drive more adoption to Cardano and become one of the most reliable sources of information for newbies. Therefore, I rate 5 stars for the impact of the project.", "q0r": 5, "q1": "The project will be completed mainly by Pritesh Gosai, the owner of the YouTube channel Kaizen Crypto with 30k followers. I went through some videos on that Youtube channel and can see that the videos are professionally made with high quality. The content of the videos on the Kaizen Crypto channel is easy to understand for those who are learning about the Cardano blockchain. With Pritesh's skills and experience, I consider him capable enough to carry out this project.\n\nThe project budget has been broken down into identifiable items. The budget is mainly used to pay Pritesh salary within 1 year to implement the project with a salary of $2000 / month. In addition, there are other expenses such as buying cameras, editing video software licenses, and hiring video editors on Fiver. In my opinion, the budget proposed by the proposal is reasonable.\n\nThe proposal presented a roadmap with clear milestones and timelines. At the same time, the proposer has also come up with a plan to manage the workload so that his 3 projects in Fund 9 can all be completed on schedule if all 3 projects are funded.\n\nThe proposer considered the risks and challenges involved in the success of the project. This includes friction with traditional course hosting infrastructure, ADA price fluctuations, and users who don't understand how to use the course. The solutions proposed by the proposer are suitable to reduce the risk of the problems mentioned.\n\nOverall, I consider the proposal presented in detail and the proposer capable enough to bring the project to success, therefore I rate 5 stars for the feasibility of this proposal.", "q1r": 5, "q2": "The project provided a clear roadmap with milestones that needed to be achieved in a specific timeline. The metrics and KPIs used to define the success of the proposal are reasonable in my opinion. Those KPIs include 10,000 people completing the course and bringing 100k new people to the Cardano ecosystem. The information that the project gives is enough for the community to audit the progress and success of the project.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14731, "q0": "\"Blockchain technology in general, and specifically Cardano, are not easy-to-grasp concepts. The Cardano ecosystem offered numerous tools and application potentials. I agree with the proposers to create a learning platform in which the Cardano-related contents are in presented in a structured format. The content will be varied, such as creating a wallet, public and private keys, NFTs, DEFI, smart contracts, etc. The educational content will be presented as video formats, along with relevant documents provided. \nIn terms of risk management, beside the risks stated, I just wonder if the platform had the strategies with “lazy” learners since e-learners are quite easily to be distracted by the Internet? Are there any methods to boost the motivation of these learners?\nThanks to this platform, newbies joining the crypto world will have the opportunities to learn. If the platform is successful in terms of delivering knowledge to learners in a simple way, there will be a large number of people who clearly understand and join Cardano. This may boost the Cardano ecosystem. From this point of view, the solution is aligned with the challenge setting.\n\"", "q0r": 5, "q1": "The roadmap was quite clear and was divided into multiple smaller task processes. It would be clearer if the proposers assigned a specific due date to each sub-task process and provided the detailed of how-to-do methods for each process. The budget was provided; nevertheless, I believe the proposers should divide it down in line with the roadmap to make the proposal clearer (in this case would be financial report by months). A clear proposal helps the community to evaluate the project feasibility. Regarding to the human resources, the team working for video editing is not yet defined. ", "q1r": 3, "q2": "I do not think it is enough to simply propose KPIs/metrics, to increase the auditability, I recommend that proposers probably consider mentioning the specific number of KPIs or metrics they expect to achieve over a given time period, and the methods by which they will be monitored. For example, after 3 videos are published, 100000 views are obtained; or scoring of 50 is considered as “pass the test”. Moreover, the proposers should have some ways to announce the project progress to the community (for auditing purposes).", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The Cardano 101 course will be an A-Z style platform that breaks down the process of being involved in Cardano. From setting up a wallet, understanding the eutxo model and even plutus smart contracts.", "experience": "Pritesh Gosai - Kaizen Crypto Owner, Cardano Ambassador, Stakepool Operator, & Content Creator\nPritesh has been a member of the Cardano ecosystem since 2017 and began creating Cardano Youtube videos in 2019."}