{"id": 416745, "author": "rarety", "title": "NFT Powered Pay-Wall System", "url": "https://cardano.ideascale.com/a/dtd/416745-48088", "category": 26595, "amount": 25000, "description": "How can we ensure Cardano NFTs create real-world business value? Jpeg images of animated monkeys are all cool, but the real long-term value is in creating lucrative business opportunities.", "f6_no_assessments": 7, "f6_rating": 4.190476190476192, "videos": [], "media": [], "f6_assessments": [{"id": 1460, "q0": "By far the best bang for the buck of any proposal I have assessed, the value proposition of the NFT powered pay wall system could have the best ROI Catalyst has seen to date. The impact of this project could drive mass adoption by it’s access to untapped markets through the creation of user friendly interface that enables new opportunities for buyers and sellers. The issuance of NFTs provide content creators with the ability to create their own marketplace and sell their product directly to their target audience. Affiliations with sporting industry professional allude to endless possibilities of marketing rare sports moments into blockchain collectibles. This project significantly addresses an unmet need of the content creation community, and has high potential to be a vehicle for innovation and adoption, aligning perfectly with this challenge setting.", "q0r": 5, "q1": "The team promises undeniable success and it is hard to argue otherwise. At an asking price of only 25k, the combination of feasibility and value are truly remarkable. A series of short, but extremely well produced videos demonstrate a fully operational pay wall with a beautiful interface. A link can be found here. \n\nHaving successfully completed past funded Catalyst projects and awarded funding on three prior occasions, the development team are seasoned and capable. Deqree, Rarety.io and Cardsec are listed accomplishments and the team also features a lead Plutus developer from Gimbalabs. With these credentials and detailed roadmap in hand, successful implementation is all but assured.\n", "q1r": 5, "q2": "Extremely clear and easily attainable metrics highlight the KPIs created to facilitate the evaluation of progress and success of this project. Numbers of projects, transactions, attached wallets and volume of Ada transacted are elements of a well designed tracking system facilitating ease of audit. Adherence to the timeline indicated on a detailed roadmap provides an additional measure of progress. Lastly, Discord viewership and membership data provide nearly every measurable data point across a matrix of accountability specified in this proposal. This hyper-professionally worded and constructed proposal leaves absolutely no room for scoring deductions, fives across the board!", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4164, "q0": "The challenge seeks to drive adoption by growing an ecosystem of Dapps, products, [services] and integrations.  Ultimately, adoption – transition from innovator and early adopter to early majority and late majority phases – depends on the provision of utility to end users.  People will be drawn to the blockchain that enables them to DO things safely with the least friction. IMPACT: This proposal fits within the challenge problem.\nProposal Clarity & Fit (5): The proposers seek to build a pay-walled NFT marketplace on the existing Rarity.io, a multi-sig NFT launchpad.. The platform includes a tool for creators to upload content and distribute it in the form of tradeable NFTs.  The platform accepts NFTs in a variety of media (e.g. images, video).  Buyers can then access NFTs through the paywall. Users interact through a web interface and directly linking a browser based Cardano wallet. Additionally, the platform will support subscription models, allowing for serial distribution models.  This proposal fits within the challenge.   \nCardano Impact (5): This project is consistent with the general vision of functional blockchains with applications that DO things. In present centralized systems, content platforms like YouTube or Patreon enable creators to build profitable businesses. While this implementation does not feature advertising revenue, it still enables monetization of content distribution by creators.  The attraction of content creators to applications like this will raise the profile of Cardano.  \nScalability (5): The team addresses scaling as the final phase in development. The plan includes API development and exploring both Djed integration and potential e-Commerce partnerships.  \nThe challenge presents the following KPIs: 1) increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, 2) Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products, and 3) increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community. A project would be successful under the challenge if it satisfies at least one of the conditions.  \nKPI Alignment (5): The KPIs are appropriate, quantifiable and consistent with the challenge.  \nAverage Impact Score (5). \n", "q0r": 5, "q1": "Experience Required and Fit of Team (5): While experience requirements are not specified, the team has experience in developing on Cardano.  They have previously been funded on Catalyst (3 projects/components).  Their prior projects include Degree, Rarity.io, and Cardsec. The team is specified by name with roles identified. One of the team members is a Plutus developer with GimbaLabs. The team also includes a marketing specialist.  \nImplementation Plan & Budget (5):  The timeline projects development across a 3-month horizon, with completion projected for October 2022.  The budget is reasonable. The project is sufficiently narrow that the both the time horizon and budget are reasonable to ensure completion. Milestones are presented with an order of execution.  \nTechnically Sound (5): The project is communicated with examples of use cases, and videos and text describing user interactions.\nRisk Awareness & Mitigation (4): The proposers identify a risk associated with new users who do not have existing wallets.  The proposers will mitigate by integrating an alternative payment method based on existing Web 2.0 systems.  \nAverage Feasibility Score (5). \n\n", "q1r": 5, "q2": "Roadmap, Milestones and Time Horizon (5): These elements are present. This project adds features to a previously funded projects (Rarity.io). \nReasonable and Quantifiable KPIs (5): KPIs are appropriate, quantifiable and sufficient for the project. \nTransparency (3): The team uses Discord. They have used Github for prior projects but there is no mention in the proposal for use on this project.  The team does not mention periodic reporting.  Presumably, they will do so as part of the Catalyst protocol, and given their experience with Catalyst, they are likely aware of these protocols.  \nAverage Auditability Score (4).\n", "q2r": 4, "assessor": "z_assessor_2523", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4563, "q0": "Solving the \"I can just right-click to save it\" conundrum is an important aspect to the economic viability of NFTs. While a paywall won't necessarily stop all instances of piracy, it should prove as a useful test case for the impact of such a system. Since NFTs are such a large part of the user-facing L1 experience, it's fair to say this proposal meets the standards laid out in the challenge, and is appropriately categorized.\n\nThe proposal does a good job of laying out what the team will be building through the use of videos, text, and illustrations, which should make it easy for non-technical voters to wrap their heads around. I'd like to see a little more information about how NFT-minter might be able to tweak and customize their paywall, since users are likely to have pretty diverse needs. \n\nI like that the proposal addresses potential issues with onboarding and user experience. This is especially important in a context where piracy isn't just opportunism, but a matter of convenience. ", "q0r": 4, "q1": "As this project is essentially an expansion of an existing platform, there's little reason to doubt the team will be able to complete the project. The proposers are Catalyst and Cardano development veterans with a track record for delivering on the technicals. I'd like to see a bit more on Jason and David, however, since PR will be so crucial to the success of this project. Getting people excited enough to commit the time and mental bandwidth to learn and invest in the platform will not be a trivial task. Rick Carter's links to NCAA are an exciting prospect, of course.\n\nThe developer budget is lean, but it might be clarifying to breakdown the server, software, and hardware costs into more itemized expenditures. ", "q1r": 5, "q2": "This project is a continuation of one greenlit in Fund 7 (with a pivot from smart contracts to multi-sig), with the results observable at Rarety.io. Likewise, development milestones, many of which involve the ability to host specific types of media and the paywall itself should be easy to verify.\n\nSince the project will be using usage metrics as KPIs, it would be helpful to get some target numbers. What level of usage would be required for this project to effectively be self-sustaining? ", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7897, "q0": "Having a subscriptions based model is good for the content creator but might not always be for their customers, unless they provide highly differentiated value. The proposer offers a way that content creators can monetize their content via a paywall. They aim to target the sports industry with the help of a former Division 1 assistant basketball coach. They are also targeting the film and music industry. An initiative like this can onboard new users via not just the athletes and artists, but their fans as well. Stars have fans all over the world and this proposal aims not only to let them interact with them but also open up a new way to sell them premium or limited content. ", "q0r": 4, "q1": "The proposer has provided references for their team which show their past works. They consist of mainly developers with members and RP and marketing as well. It was good to see that one of the team members is a Plutus developer. The team already has one working web app which adds to their credibility. The other web app(deqree.in) does not appear to be live but there is a video tutorial in the reference links showing how to upload certificates on the Cardano blockchain. \n\nThe budget was not clearly laid out. Since the proposer has timelines showing the months, he could have linked it to the budget. Instead of itemized budget items, they are grouped together and no unit costs are visible. The proposer should seek assistance from someone in an accounting background or someone with relevant experience in preparing the budget. The proposer can also look at successful proposals in previous funds to get an idea of what more or less makes up a good budget. \n\nAccording to the proposer, there are no risks that will prevent them from delivering the project successfully. This would lead the reader to believe that the proposer is too optimistic or did not fully consider this section of the proposal which is not good to see. ", "q1r": 2, "q2": "The roadmap was clearly set out with dates and tasks to be completed below those dates. These types of roadmaps are good to see. It shows that careful thought was given and that the team knows what it wants to do and when. The KPIs that were also defined however they are not quantified Things like “Number of projects on boarded ” and “Number of buyer wallets attached” have no targeted number to aim for. The proposer could have a dashboard on its website showing each KPIs analytics for example: Number of projects on boarded - 35% (75/200). Sadly this proposal show's very little on how the community can measure the success of this project. ", "q2r": 2, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9091, "q0": "It definitely address the challenge and within the category of dapps, product and integrations.  Addressing the challenge of targeting the non-crypto crowd by integrating conventional payment methods using on and off ramp crypto payment providers, is good. However, i dont think that should be the concern as of yet. Roadmap of progress is sufficient, but i think UI/UX testing should be done every month, a continous process. A key point to note, because this is essentially a NFT minting platform on the cardano blockchain, there are not many unique aspects of the project. What is to stop someone from choosing to list on Opensea, magic eden or some exchange marketplace. This platform has to have an enticing aspect such as low gas. Which wasn’t really talked about in the deck.", "q0r": 4, "q1": "There are already NFT minting platforms on cardano. Something unique to this particular project would be the accessibility for creators to earn from NFTs instead of a centralized provider such as youtuber which was quoted in the deck. The network of creators has to be extensive enough for this project to be profitable. Some things that were not talked about would be the business model. This paywall system, would still take a cut of the transaction fees and NFT minting fees etc right? How much would those amount to? Also, i get that you have direct access to powerful actors. But maybe listing an existing partnership or partnership to be would really help with accessing the success of this project. Looking at the advisors, one area that you guys would be targeting is likely sports famous personalities which quite afew are already in the NFT game. Having a wider spectrum of advisors would be great. In fields of music and art, would definitely value add to your vast number of connections.", "q1r": 4, "q2": "Having a linktree would be great to get all your links together in one place for easy auditing/viewing purposes. I’m doubting that community outreach and technical support would only cost $2000. For the famous personalities that you are onboarding, depending on their tier of popularity, it might cost quite abit. I would lump that under marketing which definitely amounts to more than $2k. However, $2k is a good start. The metrics to track the project’s success looks realistic and accurate. More social media channels of the project can be added. Like i mentioned, the linktree. Telegram is a good way to advice people of your progress and its easily accessible from any mobile device. Something that would be a good direction to focus the project is to identify a niche for it. I mentioned bringing in more advisors of different fields but its good to start of with a niche in an area first which i would think is sports. It would be a hub for sports fan. Branching out from there would be a story not for now. That being said, i like that the UI is very clean and simple to use. Its a good platform for first time users as well.", "q2r": 3, "assessor": "z_assessor_3020", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9733, "q0": "The proposal identifies a real world use case that implements the ADA blockchain, and has a way to monetize that idea as well. . The team has identified a need and their proposal outlines a feasible way to address it. Overall, this is a well-written proposal that shows a good understanding of the benefits they will be leveraging from cardano . The proposal demonstrates an understanding of how the proposed solution would be a great asset to the cardano community. The team is passionate about what they are doing and that comes through in this proposal. The team has extensive experience in the field of blockchain tech, which gives them an upper hand in understanding the objectives of this challenge.. ", "q0r": 5, "q1": "The team behind the proposal has a lot of experience in implementing projects, and they have shown they know how to be successful. The proposal lays out a clear path for voters to see how thing will be implemented. The proposal is very business oriented, and the team wants the project to be profitable. The sooner a project can become profitable the better. Being profitable ensures longevity and is a good measure for success. However, even if a proposal ticks all of the boxes, there is no guarantee that it will be successful. Ultimately, it is up to the community to decide which proposals are worthy of funding.The proposer is working on other proposals and that can effect the quality of  their proposal.\n\n\n\nIt is important to asses the proposers work on other projects as it can give you an indication of how much effort they are willing to put in to this project. If the proposer is already working on multiple projects, it may mean that they are not able to dedicate enough time and energy to this project, which could lead to a lower quality proposal. Additionally, if the proposer has a history of unsuccessful proposals, it may be indicative of a lack of understanding of what is required to create a successful proposal.", "q1r": 5, "q2": "The proposal indicates that the team will want to community to be involved and engaged throughout the progress of the proposal if funded. They are working to improve user experience and getting involved with their project would be the best way to assess their progress. Also,  the team plans to open source their work which would also be beneficial for the community.\n\nThe proposal is well thought out and seems like it would be beneficial for the Cardano blockchain. The team seems dedicated to their work and involved with the community. There is a good chance that this proposal will be successful and i hope to see them get funded.", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12495, "q0": "The proposal provided a problem in the Problem Statement, which was a challenge to solve that helped ensure NFT value was generated from the Cardano ecosystem. Allows NFT creators to sell their products via Paywall. Building the value of NFT gives the proposal potential for future expansion as the NFT industry has exploded in 2020 and 2021. I believe the proposal can contribute positively to the community. Cardano community and the creators in the ecosystem, it will also attract new creators to join the community.", "q0r": 4, "q1": "First, the proponent has not mentioned the experience or skills needed to implement the proposal, the community needs to know they have experience in the specific field. The proponent has not provided the number of project team members, but the proposed team has provided evidence of the experience required to implement the proposal. The proposal has a budget however the proponent needs a budget breakdown balance sheet to be identifiable. The proposal has a plan that includes milestones defined on a monthly basis. However, the proposal does not mention the risks that the project may face, risks are an important part of project management, the writer should determine the factors that can affect the project. In addition, the project team also needs to come up with solutions for those risks.", "q1r": 4, "q2": "The proposal provides a roadmap with timelines to achieve, the given indicators/KPIs that can measure the progress of the proposal implementation and the success of the project. However, the proposal does not provide a way for the community to track the progress of the project. I suggest that the project team can provide a portal that includes a real-time updated road map, along with phased cash out and spend process so that the community can go along with the project.", "q2r": 3, "assessor": "z_assessor_3425", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Rarety aims to build customizable use cases using a trade-able NFT paywall, built in-house, enabling creators to sell digital content behind a scarce and trade-able paywall.", "experience": "We are a team of five including three times funded proposers, Plutus Pioneers, WebApp Developers and Marketers. We are the developers of Rarety.io (Multi-sig based NFT launchpad), cardsec (github.com/SkryptLabs/cardsec) & Deqree (Certificate Validation system)"}