{"id": 416795, "author": "iagon", "title": "Dynamic NFT-based reputation model", "url": "https://cardano.ideascale.com/a/dtd/416795-48088", "category": 26595, "amount": 578000, "description": "Trusting pseudonymous users identified only by a wallet address and assets/on-chain history is problematic in the blockchain space. Off-chain whitelists require a lot of work and are non-transitive.", "f6_no_assessments": 8, "f6_rating": 3.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 378, "q0": "Iagon propose a dynamic NFT-based reputation model where users will be able to establish and build reputation with projects over time. The solution will use non transferable tokens and dynamic content NFTs to create these reputation models. The execution of this solution allows users to start providing a type of social collateral when interacting with projects where their actions and behaviours in the project could influence their reputation by changes to the dynamic content in the NFT that is always attached to their wallet. This solution has a massive potential to create high impact as there is a need for solutions where the end user can create reliable and ongoing reputation in ecosystems without having to reveal their full identity. It also covers the need for people to have more ownership of their own data and which projects will have access to and can interact with that information. The solution intends to utilize what is being built with Iagaon as a decentralized storage solution to make this proposal possible. The proposal is currently at the idea stage and the proposers outline that a risk for this proposal is that it is indeed an ambitious project to deliver. The two main risks they cover regard the business model of this proposal and issues surrounding how data can be deleted from the NFT that has changing content. As an idea, and as some feedback, I imagine one approach could be for people to have to pay to remove bad reputation points from their NFT or need to perform some form of public good or good deed that is verifiable. As someones reputation grows this cost could increase or the number of good deeds could increase to a certain threshold to create the right incentives for people to have some control over their reputation but for changes to have a cost to that user. Allowing a user to pay to remove certain things could be part of the business model that makes this work! Overall this is a very exciting project that has enormous potential in other applications across the ecosystem whether that's finance, climate change initiatives, gaming and the rest! This is because the same model is repeatable and transferrable across many markets and domain areas. As one piece of critical feedback I believe this proposal should have mentioned self sovereign identity and to what capacity it should be integrated into a solution like this as SSI helps users to be the sovereign owners of their data. In future proposals I would kindly ask the Iagon team to provide thorough reasoning and justification for the inclusion or exclusion of utilizing SSI technology with this suggested solution.", "q0r": 5, "q1": "In terms of creating a detailed plan the team outline that this proposal is in idea stage. They outline three phases after this which cover the business model, token type implementation, integration token into Iagon, support adoption of new token standards, deploy the reputation model and finally collaborate with end users and projects. The roadmap could have added more depth to what will be happening in these steps to add more clarity to increase confidence that this proposal will be feasible. A budget breakdown separates the distribution of funds into market research, architecture, consultancy fees, development and audit/security costs. A spreadsheet image is provided that shows how this will be spent amongst different roles in the team or with consultants. The costings look reasonable for the deliverables of the proposal. The team details are provided with some professional LinkedIn links provided and the website also provides a background and more information about the team. Iagon already have partnerships with GeniusYield and are in talks with DC Spark. The team does not yet have a fully launched product however they are open to beta testes. Overall it appears the team have the right background to execute a task as described, have a number of growing partnerships that would be able to support this work. In terms of improvement, more details could have been added in regards to the plan and there is also a risk of execution for proposal as it relies on unfinished releases from Iagon that this proposal will rely on. ", "q1r": 4, "q2": "For tracking the progress of this proposal the team outline that they follow an agile sprint based process and that a third party organisation would be who deals with the auditing of the code. It would have been good to have more information on how the progress of this proposal will be communicated with the community over different social channels. It also would have been beneficial to have a Github repository link for any open source work. It is also not explicitly clear what would be open source from this proposal, in future proposals making this clear would be beneficial as the impact of proposals like this in an open source format could be highly effective for supporting the development community. In terms of success the list provided covers the execution of the different stages for this proposal. It would have been good to suggest some example initial use cases that they believe would attain initial adoption so that both assessors and voters could have higher confidence that the execution of this proposal can lead to adoption in the short term. Overall the clarity of this proposal is to a good standard with the main improvements being some more information around open sourcing parts of the proposal, approaches to communicate progress to the community and being more specific on objectives for how this solution could realistically be used in the short term.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 6671, "q0": "This is a highly technical proposal, but links extremely well with the challenge. Let’s try to make sense of it. To summarize the problem statement, we have to understand that it is difficult to trust crypto users based solely on their wallet address, and we need a way to establish trust in this pseudonymous environment. The solution proposed here is the development self-sovereign pseudonymous reputational model, which needs two additional pieces of technology to be implemented: non-transferable (aka soul-bound) NFTs and dynamic content NFTs, which have the ability to change the off-chain data at a later point in time. I would be lying if I said here that I truly understand  \n\nThe proposal seems to be backed up by a research paper of Rohit Gupta, a co-founder of Iagon, the company behind this proposal. I did open the research paper (from 2004) and skimmed the abstract, and we are in fact told that the paper proposes a reputation management framework for large networks “achieved by developing trusted communities of nodes whose members trust each other and cooperate to deal with the problem of nodes’ selfishness”\n\nIf it is indeed possible to develop these two new types of NFTs based solely on that research, in this case the proposal has an extremely high potential impact for Cardano, especially if the development will take into account the EUTXO model and develop the features in such a way to make use of all the Cardano features brought by the Vasil hardfork (metadata, inline datum, etc.). But since this is a highly technical proposal, it’s rather difficult for the average assessor (me) to vouch that the technology and prior research are enough for the technology to be built. In conclusion, a very unique value proposition for which I can only offer four stars. ", "q0r": 4, "q1": "Iagon is a Norway based technology company focused on the decentralized cloud services industry and the company behind this proposal. They have a very informative website, with many external links and descriptions of their product, and the team is very diverse in terms of skills and competencies. \n\nTimewise, the team is currently finalizing the idea and discussing potential use cases. The project should take around six months to complete, and would be split in three phases: phase 1 would bring the development of the business model and the new token type. Phase 2 would integrate Iagon’s solution with the toke and work with wallet developers to increase adoption. Phase 3 would see the deployment of the reputational product. There is a rather worrying phrase within the proposal stating that “The initial idea came from Navjit Dhaliwal, and the algorithm developer Trym Måke Bruset. More details concerning the project design will be provided by them”. Provided when and how, and why not not, within the proposal? This is definitely an unfortunate error that they have not finalized including all the technical details within the proposal.\n\nThe budget is presented in a very detailed manner in two table screen shots, but it would have been a good idea to include a text version within the proposal itself. Overall there is an extensive level of detail for each budget caption, with the highest part of the budget funding the technical design and consultancy fees, mainly through monthly fees attributable to each developer working for the project. A strong point is that the team also accounts for an external audit of the code, but we do not have additional details as to how exactly the selection of the third party will take place and how they intend to mitigate potential conflicts of interest stemming from this part of the project. In addition, we are being informed that there are two ways of spending the budget, but it is not very clear what the distinction is between these two solutions, and perhaps more thought should have been placed in a few simple explanations. \n\nIn conclusion the proposal seems feasible from an operational point of view, although not perfect given that they don’t make it easy to understand the budgetary implications of their two proposed solutions and that there are still technical details lacking, so four stars are appropriate.", "q1r": 4, "q2": "The team has adopted an agile working methodology and conducts sprint planning to track the project’s progress. The team also has a QA function but they will be using a third party audit as well, so this is a very good sign. Sadly, we are not informed whether the code developed will be open sourced or not, and this is definitely a critical piece of information that should have been included here. Another worrying point is the fact that the company does not present us any github repository for their work, and we can only assume that the earlier question regarding open source coding, and there is no evident effort to engage in discussion with the wider Cardano community. \n\nLastly, the team makes a good effort of defining what success means for the project: if in the future, projects will be incentivized to use this technology and to share their collected data with other projects while maintaining user sovereignty. I appreciate the effort but I would have expected more in terms of: \n\n- setting clear goals in terms of how many projects to use the technology in the future\n- include a detailed set of performance indicators relevant for a technology that wishes to position itself as a standard within the ecosystem\n- finally, make it very clear whether the developed solution will be completely open sourced. \n\nGiven the many (but not critical) worrying points above, I think four stars are appropriate for this project’s feasibility. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1149, "q0": "This proposal addresses a key challenge in the blockchain industry. The team has identified a real-world problem and presented a solution to that very problem. Unfortunately, from my point of view, there is a lack of detail to assess how feasible this solution is and to justify the large budget. With this amount of budget, I would like to see a more in-depth presentation of the implementation plan and more discussion of possible challenges. However, the team has plausibly demonstrated why the solution is helpful and useful to our ecosystem. To give more than three stars for Impact, it needs more depth. For further proposals, I recommend analyzing 5-star proposals and using them as a guide for the level of detail. Such a solution is certainly desirable for our ecosystem. ", "q0r": 3, "q1": "The team has set itself a big task. The team presents budget and a plan. However, the linkage of both is a bit missing. What exactly are the developers working on over the mentioned period. Detailed steps with respective outcome would provide more clarity and give the opportunity to evaluate if the given timeframe and resources are enough to create the solution. Most of the technical implementation is done with partners. From my perspective, this process makes sense. However, it would be helpful to see which partner is doing which tasks. The same goes for the proposer team. More details about experience and background would create more trust .For a better evaluation I recommend more detail next time. \n", "q1r": 3, "q2": "There are some questions left unanswered in this proposal. It would be helpful to provide a direct source for documenting the progress of the implementation. At least there are links to a website and blog so I expect the team will report on progress sufficiently. The team itself states that it is still in the ideation process and a detailed plan is still missing. In this case I recommend to adjust the budget to the current state of progress and not to ask for a big sum yet without being able to say exactly what will happen with the money in detail. ", "q2r": 3, "assessor": "z_assessor_2213", "no_vca": 1, "ne": 0, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 6328, "q0": "The proposal entails the creation of a reputation model based on the soul-bound token, NFT pointers & Iagon's decentralized storage. The proposer will create the mentioned soul-bound token for this model, and the NFTs will act as pointers to the contents file stored on Iagon's decentralized storage bank. The required parties or platforms can update the reputation data based on the user's behavior on the files stored on Iagon's storage. Therefore, this proposal is aligned with the challenge as it involves the creation of a reputation model product.\n\nThere is a demand for a reputation model in the crypto space. For example, there has been a conversation going on in the Cardano space to use the reputation model in Catalyst, and if I am not wrong, several proposals are already working on this problem, and they are utilizing the 'Atala Prism DIDs' for developing the solution. Therefore, if the proposer can successfully build this product, it will positively impact and add value to the Cardano ecosystem.\n\nI think the proposer should also utilize Atala Prism DID instead of creating a new 'soul bond token' protocol. This will reduce overall cost and saves a lot of time which can be spent to complete the other parts of the proposal and launch the final product soon. Therefore I am rating four stars because of this reason.", "q0r": 4, "q1": "Anybody interested can find the full details of the Iagon's team on their website along with their LinkedIn profiles. Additionally, the proposer will collaborate with Dc Spark, Genius Yield, and Vacuum Labs to achieve this project. Hence it seems the team is capable of executing this proposal if funded.\n\nThe provided detailed plan and timeframe are a bit vague as the proposer. For example, after giving three-stage details, the proposer stated that they anticipate more stages. Moreover, only the milestones are displayed under each phase without the technical information and specific tasks. I suggest it should be elaborated considering it is a big-budget project.\n\nThe asked budget is broken up based on the different expenses such as design, market research, audits, and development costs. It could have been better if the proposer expanded the plan with the identifiable tasks and provided the amount required for each task besides them.", "q1r": 4, "q2": "The proposer mentioned that he would use Agile Methodology and conducts sprint planning to track the project's progress, but he did not say whether he would provide its access or not to the auditors or interested parties from Catalyst for them to track as well.\nOn the other hand, the proposer has clearly stated what the success will look like in four points.\n\nAs I mentioned above, the proposer should present the plan with further details and identifiable tasks instead of just citing the milestones under each phase. Also, regarding budget, the proposer should mention the amount required for each task beside each task. This clarity of details will help the auditors or interested parties track the project's progress.\n\nThe provided delivery dates are vague as the proposer said they are in the initial stage of idea finalization, waiting to finalize a few more details. Still, he expects the whole timeline will account for at least six months.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9932, "q0": "Due to decentralized and programmable infrastructure, the reputation systems are becoming one of the major information systems for resource allocation in the world. With such functional systems many activities which have previously been disincentivized are now attracting capital and participation. The whole world of new real and informational (financial) applications is getting built. The Challenge is looking for novel and viable applications so this proposal addresses the challenge beautifully. \n\nThe proposal’s approach to build on their existing decentralized cloud platform enables the system which has never been tried before. By relying on the EUTxO accounting model, this solution on Cardano is very unique in nature. It also introduces an innovative way to use NFT structure as a pointer to the content on the decentralized cloud. By this construction, the project is able to cover an important “dynamism” -feature of any information system or reputation system. This is another example of integrating different infrastructures from the blockchain space to serve a new purpose and, as such, well aligned with the challenge. ", "q0r": 5, "q1": "Finding the most effective ways to enable reputation building in different domains requires a lot of research and trying out new potential solutions. This is a big and ambitious endeavor in its initial steps and I can imagine many unforeseen hurdles on the road. However, the roadmap is clear although not very detailed. The estimated timeline (at least six months) feels quite short to me. The budget breakdown for this time period is detailed for each month and each developer. The cost estimates seem slightly high in my eye but within reasonable boundaries. The scope of the project and thus the total funding requested is very high so there is a notable financial risk for the Catalyst. \n\nThe team has a really solid track record of building decentralized infrastructure. Design and implementation of basic blockchain infrastructure like token systems will be fluent. Internal roles in this project seem to be clear and they are building partnerships required to take care of different phases like security audits. Information and track records of individual team members as well as the Iagon company are available.\n", "q1r": 4, "q2": "The progress tracking of internal work is planned to be systematic and organized. Based on these practices the team is going to perform QA sessions and message the development made. Iagon's blog on their websites has the ‘project update’ section which, I think, might also be used to follow the progress of funded proposals. The success after the completion is determined mainly by accomplishment of the technical implementations described in the proposal. Collaboration with other web3 projects is mentioned but any wider commercial success KPIs are not specified. \n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11502, "q0": "As problematics of off-chain whitelists are clear a better reputation model will absolutely improve trust and usage of wallets in blockchain space. Proposed solution successfully tackles this challenge with invention of EUTXO construct for soul bound tokens and decentralized store for it. Impact of this proposal is underlined with academic work on it done for long time. This solution will help to achieve trust between unknown parties to make transaction between them. Successful delivery of this project will help whole crypto, and ADA liquidity with NFT applications of proposed solution.", "q0r": 5, "q1": "Described budget specification fully meets the needs of successful project implementation. Budget is split for roles with appropriately set salaries with monthly payout makes proposal cash flow feasible. Further funding of this project might be needed to scale it for future needs, for project that is beneficial and targeted for improvement of other project, this is understandable. LinkedIn references for core proposal team members serve as base evidence for verification of relevant skill and experience of team. Additional roles will be filled by confirmed collaborators from other partner corporations. Timetable is well set on month basis for 3 phases, additional specificity for each phase would improve proposal as only general idea is provided. As risks are properly considered and mitigation strategies are set, I believe feasibility of this proposal deserves full score.", "q1r": 5, "q2": "Proposal is completely auditable with milestones and time horizon set for every phase. Progress of team can be audited by community, but resource where progress will be provided is missing and should be provided later on. Main KPI determining success is adoption of this product by other web 3.0 projects. Measurement of this achievement is simple and there is also possibility to measure issuing reputational dynamic NFTs. This project effectively solves described problem, is auditable and has plan to be also audited by third-party auditing firm for code security. With described proposal assessment I strongly agree that this proposal is provided sufficient information for audit.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12247, "q0": "\nThe proposal directly addresses the Challenge, and the use case for an NFT-based reputation system definitely has the potential to create a positive impact for our ecosystem and industry. A working reputation system builds trust and through wide adoption it can bring diverse benefits for various use cases, e.g. a reputation model increases the quality of content, suggestions or ratings, which is especially important for a decentralized system.  \nUnfortunately, from my point of view, the proposal does not justify the requested budget from a content point of view. The information described deals with the problem only superficially and the solution presented is only roughly outlined. Even if I think the idea is good and support this approach in principle, I still see a lot of need for optimization (see further description) for the proposal.\n", "q0r": 3, "q1": "The proposing team seems to be suitable from their experience for the implementation of the proposal. However, the composition of the team is not yet finalized. Furthermore, a detailed list is missing from which it is clear which person will tackle which task in which time frame. Without this information, it is not possible to adequately evaluate the budget. The presented overview is not enough, in my opinion. I think with requesting well over $500k this team owes the community this level of accuracy. Overall, the plan is not mature (just like the description of the solution) and seems more like an idea. The proposer does say that this idea has been researched for many years. On the website the overall project shows much more depth, yet in the Proposal this depth of information is unfortunately not apparent. \n", "q1r": 3, "q2": "This proposal has a rough timeline listed. Unfortunately, it is not clear from the Proposal how and where the community can track the progress of the Proposal. There is talk of a 3-party review of progress. But who is that? Where do we see the results? Again, a mature plan is missing. Everything seems more like a rough idea. The definition of what success looks like is even roughly described: E.g.: integration of tokens? What exactly is the success here? From my point of view, there is a lack of information about product adaptation in the market or concrete examples of usage (user interactions, etc.). Compared to this proposal, there are many other projects in this Challenge that describe much more concrete results for much less budget. Therefore, my evaluation is poor.\n", "q2r": 2, "assessor": "z_assessor_3370", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14759, "q0": "The project aims to solve two main problems: NFTs are indestructible and immutable and Reputation of the service, resource providers is platform based, non-transferable. And in parallel, based on the solution ideas Dynamic NFTs in which data can be in which data can be altered and Reputation to be used as a measure on resource providers wealth, latency, usage of green energy etc. In real time, proposers offer this project.\nIn the impact section, the proposal writer presented the functions and features of their product or the main components, main activities of the project and the potential audience they were targeting. Case study examples and in-depth technical explanations also highlight the features the project promises to deliver. However, the proposal has not yet clearly stated the target audience of the project as well as the impact of this project on those objects.\nThe results set out by the project are also stated very specifically. At the same time, these results are also consistent with the KPIs set by the challenge. The key metrics & KPIs section is clear to each part, each stage. This is a good point of the proposal to help viewers have a more detailed view of the impact of the project. If possible, please state clearly where the above ideas of the proposal, will directly affect the Cardano ecosystem and can be expanded in the future or not by estimating the number of users will attract more to. with the Cardano ecosystem.\nDifficulties that the project will face are expected to include issues related to intellectual property rights and data deletion. These challenges are recognized very specifically, but have not yet given a solution if encountered.", "q0r": 4, "q1": "In order to demonstrate that the plan that the team proposes in the proposal is sufficient to accomplish the goals expected by the team, the proposers need to provide information (evidence, witnesses, or links...) about the skills and experience needed to implement the activities mentioned in the proposal.\nProposal mentions this is only the idea development phase for the project. So the proposal needs to be improved by giving a roadmap with milestones along with what the project will deliver in each phase. Proposers should also clearly define the locations and number of people needed to carry out the proposed project. The project implementation plan must be reasonable from the method of implementation, the work items to be completed and the criteria for evaluating the quality of each job. The project also needs to have a realistic timeline to complete the given tasks in a reasonable manner. It would be even better if the propopsal detailed the technical aspects such as architecture, language and technology required to execute the plan.\nIn terms of budget, the project intends to spend for 5 items. However, we need a more specific spending plan. The team should estimate the budget needed to build the project. Budgets should also be broken down and clearly bulleted to be used for each activity. From there, new viewers can evaluate whether the budget is reasonable compared to the plan set out in the proposal.\nThe personnel required to carry out the project have been specified. They include people with enough knowledge and skills to be able to carry out this project.", "q1r": 3, "q2": "In this section, in order to increase the credibility and seriousness of the project implementation, indicators and milestones should be stated in as much detail as possible. Proposers should present clear quantitative indicators to monitor project progress. For example, the number of users, the time to complete which part - what activities, the amount of traffic... Based on the information, the milestones in the roadmap and the time period to achieve the goal and key metrics or specific KPIs to define that this proposal will be successful based on what and how. This information is very necessary for investors to evaluate the implementation of the plan as well as for the community to easily monitor the progress of the project.\nThe image and definition of the project's success are clearly stated in the proposal. Those are the outcomes that the project is aiming for when completed.", "q2r": 3, "assessor": "z_assessor_4099", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Using a unique EUTXO construction and our decentralized storage network architecture allows for collecting and storing reputational info on user wallets on-chain, with user sovereignty maintained.", "experience": "One of Iagon’s co-founders, dr. Rohit Gupta, wrote a Ph.D. dissertation titled “A Framework for Reputation management of the nodes” (link). He’s been working on this model since 2005.\nIagon’s been focusing on decentralized networks since 2017."}