{"id": 416902, "author": "mplomin", "title": "Mehen: Fiat-backed Stablecoin USDM", "url": "https://cardano.ideascale.com/a/dtd/416902-48088", "category": 26595, "amount": 193660, "description": "Cardano DeFi adoption is slow due to no stablecoin diversity. Cardano only has algorithmic stablecoins and needs a fiat-backed option for those who prefer that or need a direct-to-fiat bridge.", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 14928, "q0": "The Mehen team has described the problem and solution very well. I understand that this project meets the challenge’s objectives. With this funding, they will build a Cardano Native Asset stablecoin USDM which will be a true fiat backed stablecoin for the Cardano community, so they will be able to create considerable impacts on the number of DEXs and DeFi platforms that hold USDM, thereby enrich the Cardano ecosystem. With regard to success metrics, I can identify them easily and I believe they are well-established. Technical requirements have been analyzed. To help secure this funding, they did manage to present a discussion about potential risks concerning legal risks and complexity in product development, along with some important steps that mitigate the related issues. ", "q0r": 5, "q1": "\"I wholeheartedly agree that although this project is believed to have a certain degree of complexibility, the robust team with an array of desired skills and experience could manage to deliver the final work successfully. \nThe team has been described in an excellent manner. They all have valuable experience in the software and technology field. One of whom is a highly respected member of the Cardano community with 20+ years of experience in cloud technologies. Others have a passion for Blockchain technologies or have an outstanding work history. Additional details can also be found on LinkedIn profiles. \nThe description of the implementation plan is absolutely well-done. It provides details of two main stages of 8-month Development and 4-month Maintenance. There are multiple milestones for the development of the Mehen dApp and delivery timeline. I see a number of items to be carried out in each milestone.\nThe budget breakdown has also been established very well. It consists of some parts regarding the roles, responsibilities in this project, names of members, monthly salaries, hourly pay rate, and total working hours that will be dedicated to different milestones. Additional costs that this funding will cover are Service Hosting and Infrastructure and Marketing and Promotion. Each of which has outlined specific items. \n\"", "q1r": 5, "q2": "\"They have explained how the community can measure project progress with the Gitlab repo which is a great tool to track the completion of milestones tied to the detailed timeline given over the course of 1 year. \nBasically, there has been a clear indication of 3 success indicators. All of which seem to be closely aligned with the challenge’s goals. The launch time of the Mehen dApp with full stated capabilities has been indicated clearly. I agree that the success’ relevant impacts can be evaluated effectively. \nThe community might expect the author to clarify the continued growth of user accounts and continued growth of USDM in circulation and the number of DEXs and DeFi platforms that hold USDM.\nMy only suggestion regarding success metrics would be adding some targets and giving a timeframe for each target to be measured and published to the community on a long and short term. This would possibly make it easier to keep track of the project's achievements and further enhance the project's auditability. Still, considering other great aspects, I don't think this would add difficulty in auditing this project. \"", "q2r": 5, "assessor": "z_assessor_4113", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15117, "q0": "This proposal clearly follows a path that has been seen in other crypto ecosystems which have forayed into the stablecoin territory. The proposers have a valuable idea and proposal of providing the Cardano community with a stablecoin alternative to the one that is being planned [Djed], which is being developed by the COTI team. This challenge specifies that DeFi solutions and products are exactly what fall under its scope, as the first type listed is DeFi and among them - stablecoins. I think the proposers have seen there is a clear space available for fiat-backed stablecoins in the Cardano ecosystem and have moved forward to try to occupy that space. The challenge specifies that the possible metrics for these proposals are: \"DeFi - Total value locked, the total number of users, number of active daily/weekly/monthly users\" ... but this proposal does not follow that suggestion precisely, probably due to the early stage of the proposal development. The team states that they see longer term success as \"continued growth of user accounts and continued growth of USDM in circulation\" .... \n", "q0r": 5, "q1": "Plans for developing stablecoins would naturally differ - depending on the stablecoin type. If developing an algorithmic stablecoin (think Terra/Luna, think Djed on Cardano, think SigmaUSD on Ergo). The key aspects of the system are technical and the trust component is technical - users want to see an open source code if possible, they want to see high-assurance code and they want to see code auditing and stress testing to the highest degree. Licences - probably not needed or less of a factor, while verification of reserves and dollar backing, not necessary, as there are no FIAT reserves. Now, lets look at fiat-backed coins, the technical aspects are important - the technical team is important. Yes, they need to be technically competent and the Mehen team seems competent for the technical software aspects of the proposal, the technical plan seems reasonable, the technical milestones seem detailed, the budget breakdown seems to be well done (alert: I am not a developer, so do not rely on my in-depth assessment here). However, what the team seems to be missing is the feasibility of obtaining licenses (what if their other Catalyst project for funding of money transfer licences fails and other financing sources for licences to not come through?), the feasibility of building trust without a specific plan with milestones for high-level and detailed 3rd party auditing of the bank statements and the financials, the feasibility of building a fiat-backed stablecoin - without smashing head-on into the lack-of-trust problems that have been plaguing Tether. The critical point for a fiat- based stablecoin- \"issuers hold 1:1 reserves of fiat currency. The total value matches how much they have backed by fiat\" - has not been addressed in detail and expansively. Even if a fiat-backed coin has sufficient reserves, this is not enough. This has to be constantly audited and verified - and there needs to be a detailed plan for making this information available to the wider community. With this fact in mind, I see the ultimate feasibility of what the team said as a solution: \"fully-backed 1:1 with high-quality, liquid, transparent, audited USD assets\" - as questionable. The plan does not address these aspects [liquid, transparent, audited] in sufficient detail and the team does not have financial experts or legal experts listed in their team. The team admits as a risk: \"This project is complex in that there are laws and other legal requirements that need to be followed or there could be legal ramifications for Mehen.\" When talking transparency around FIAT-based stablecoins, we are not talking just Github or money transfer licences, we need 100% financial transparency of what is going on behind the scenes and in the Mehen bank accounts behind the USDM front. Hence, I see these issues missing from the budget, I see these issues missing from the timetable, and a plan that is not complete.\n", "q1r": 3, "q2": "\nThe team has identified as the problem that they wish to solve a very good and important problem for Cardano. The milestones are related to technical development alone, however they do not include legal milestones (such as licensing achievements) and true verifiability of the USDM reserves by the wider community on a regular basis. Although part of the problem is seemingly a bit incorrect as it states that \"Cardano only has algorithmic stablecoins\". Aas far as I know, Cardano has no native stablecoins yet, although Djed is in development - but has not launched on the Mainnet. So, effectively, Cardano is still an ecosystem without a native stablecoin. This does increase the importance of having stablecoins and even a \"fiat-backed option for those who prefer that or need a direct-to-fiat bridge\". The thing is that the solution was well identified as \"USDM uses stablecoin best practices: fully-backed 1:1 with high-quality, liquid, transparent, audited USD assets.\" Yet, the solution does not have very good measureable definitions of success. The proposed solution is overly focused on one side of the equation (technical development ), but the workplan is very sparse on details how and when will licenses be obtained and how will this be communicated to the community. So, having a Gitlab repo will help the community monitor tasks/issues that need to be completed. These tasks are tied to project milestones. So, technicals can be monitored. Yet, on the other side, we have some general statements about the importance of licensing and seeking money transmitter licenses - but there is no real meat on those bones inside the proposal. We do not have information when were license applications submitted, when are they expected to be granted, what will happen if they are not granted. The solution also states \"fully-backed 1:1 with high-quality, liquid, transparent, audited USD assets\". Who exactly will guarantee that the liquidity is really there? How will this transparency be ensured and through which channels? Who will be the auditor and how will the auditor's reports be published and how often? What happens if the auditor's report shows the 1:1 is not in place? A collapsing fiat-backed stablecoin (not Mehen, but such a coin) could harm the Cardano ecosystem - so the proposers need to work on the utter anc complete auditability of FIAT reserves  if not approved now and resubmitted to Fund 10. Trust in a FIAT-backed stablecoin cannot be built easily simply through a Gitlab repo that contain a list of tasks/issues that need to be completed - there needs to be a an accessible public channel for delivering regular updates to the community on frequently audited financial reserves and bank statements, as well. \n", "q2r": 3, "assessor": "z_assessor_2047", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15134, "q0": "Just as the proposers explain themselves, algorithmic stablecoins are flawed and for propper security and usd peg we need a fiat backed stablecoin. It will surely be beneficial to the Cardano ecosystem. It definetely matches the challenge and can participate a lot in improving Cardano Defi's scalability.", "q0r": 5, "q1": "The overall implementation plan is well-made: The team is introduced and their qualifications seem to be valid. Also, they already have all the required personnel forthe implementation. The roadmap for implementing the proposal itself is a very fine-grained and detailed and seems realistic. Regarding the budget: It seems realistic regarding the rates when you consider it's slightly below industry rates. Maybe the proposers could however try attaching hourly estimates to the individual tasks and not just total hours to the position to show more sensible planning.\nA contingency plan has been made and even a whitepaper is presented that shows that various differnt aspects have already been thought about.", "q1r": 4, "q2": "The problem description is sufficiently clear and a very detailed solution is described. The roadmap is very detailed and gives good points to audit along with the general success criteria. Some KPIs however are missing and should be added.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15139, "q0": "The Mehen project proposes its own fiat-backed stablecoin on Cardano. This would be a fully centralized, KYC-requiring and 100% USD backed native Cardano token. The proposer has a finance background and is partnering with Lidonation and Drasil for the backend. For just under 200k budget, and apparently not relying on its other two proposals in this fund for success, this is a great DeFi direction, matching the challenge brief closely. The fees could initially be quite high, based on Coinbase (where if I remember correctly DAI and USDC trading costs a fortune) but would fill an almost desperate gap in the ecosystem. I think this project is on the ambitious side, but I wish them luck and cannot wait for the final product.", "q0r": 5, "q1": "Even fully fiat-backed Stablecoins are not trivial from a technical point of view. Without budgeting for smart contract audit and adequate Plutus muscle, this seems high risk and unlikely to succeed all the way in its current form. The team provide detailed profiles and is impressive, just not complete for this project in my opinion. The budget and milestones are well crafted, very detailed and the LLC formation and progress with the KYC and existing collabs are very strong points for this proposal. It is likely that with some additional funding and further iteration, this will be a success. It would be a useful milestone for Cardano.", "q1r": 4, "q2": "Tracking will be possible through Github, and the website of Mehen. The work created so far and the detail revealed in this proposal bode well for future Auditability. The strong TradFi background of the proposers shows in this. Mostly, Auditability confidence comes from data provided in other sections, the Auditability fields could have been filled with more KPIs and quantitative metrics.", "q2r": 5, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15143, "q0": "Mehen seeks to create a stablecoin backed by liquid assets. It is clear that a successful implementation would greatly benefit the entire Cardano ecosystem and add diversity and robustness to the current native stablecoin offering, mostly composed of Djed, whose backing method is algorithmic.\nHaving reliable and well-structured stablecoins is a key aspect for the incorporation of new users who have confidence in the capabilities and utilities offered by the blockchain, especially Cardano. That is why I consider this proposal has a direct impact and perfect alignment with the challenge at hand.", "q0r": 5, "q1": "I gladly went through all the material offered by the Mehen team; from their clear and well-structured proposal, the clean design of their website with clear information about their objectives and the team involved in the development, as well as their blackpaper and even the page of who seems to be their main technological partner, Drasil. Definitely everything seems to be in place, with a clear work plan and well divided into milestones composed of different activities, plus a detailed and well-defined budget that seem to add up.\nThe creation of a stable coin - which if successful will become part of the wealth of many users looking to exploit the goodness of the crypto ecosystem - is a task that should not be taken lightly, and the proposing team seems to have done the task with a well-structured technical plan. \nThere are 3 sections that I feel should be over-explained and that I would like to suggest the team incorporate more information into their proposal:\n-The legal aspect: since with the increasing regulations in various countries, it is necessary to know that they have ample knowledge in this field so that technological progress is not limited by, for example, licensing processes. As a tip, one of the members of the project answered assertively and satisfactorily to the questioning of this aspect by a member of ideascale in the comments, I believe that this information should be incorporated into the proposal so that those of us who do not have a banking or financial background can have a better understanding.\n-The Drasil component. I understand that Drasil is a partner that provides customized services thanks to its extensive expertise in Cardano environment developments, however this is not sufficiently clear with the information provided in the proposal and for me it was necessary to access the site of this company and do research on the type of services it offers to understand the role that Drasil plays in the development of this application. Since Drasil's subcontracting carries 20% of the requested budget, it would be nice to provide more context so that voters and advisers can better understand the proposal at a glance.\n-The tokenomics. We know of the problems that stablecoins with a logarithmic backing have had recently, and Mehen makes this a differentiator with their product, however they do not offer an argument deep enough for an average user to understand how exactly the possible risks are mitigated. I am not an expert in tokenomics, however, and although the principle is very obvious and is explained very well in the mechanism to mint and burn coins backed by the liquid assets that the user deposits, a scenario ii would like to propose where  a strong market correction affects the entire crypto market, hit by external factors such as wars or other crises. In that case, it is likely that many users will want to withdraw their liquidity at once, would Mehem be prepared for this? How? Since the assets will be held by banking institutions, what are the risks, and what are the warranties for the users? Additionally, I would like more information on the earnings model, that is, what are the commissions that the company will charge to maintain the operation of this service?\nThese remarks are not meant to be a negative criticism, but legitimate doubts from one of the many potential users that Mehen will potentially have in the future. I consider that the information presented is very good and the proposal is fully achievable in the time and manner established by the team, but could improve in the eyes of the voters if the above observations are heeded.", "q1r": 4, "q2": "The work program is divided into milestones with a clear execution window and concrete tasks, in addition the team has a member well versed in agile methodology and techniques such as Scrum, so the construction and development section seems totally achievable.\nOn the other hand, the general goals that are proposed are coherent, however, for example, a goal for the number of accounts or coins in circulation after a certain time of operation is not proposed to understand if the project will be economically viable. Although these aspects are mentioned, no numbers are committed to measure the success of the project, which I consider to be an important component for the community to decide if this proposal should be funded, I would like the team to incorporate more information about their projections .\nThe proposal is very interesting and if it is funded, it will be one to closely monitor, as its success would greatly impact the Cardano ecosystem in a positive way.", "q2r": 4, "assessor": "z_assessor_2719", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15150, "q0": "The idea of the proposal is to build a usd assets backed stablecoin named usdm. I see this being beneficial to the cardano ecosystem if implemented, because it's always good to have a stable coin for operations like transfering money out of volatile coins withought incurring high taxes and moving back to fiat.\nI think the proposal is aligned with the challenge settings and will be an product and integration although I couldn't say it's going to be a decentralizaed application, because stablecoins that have a fiat backing is needed to be centralized because of the law.\nI don't agree the biggest risk is the lack of funding. I'd argue that the biggest risk is the same depegging that happened to terra and I'll expand on that in the feasibility section. Lack of addoption is a big risk as well.\nOverall an impactfull proposal for sure.", "q0r": 5, "q1": "in the proposal to the ones in the given links and everything checks out. As a developer I can state the team has the necessary skills to bring this project to a success.\nCompares to terra but doesn't specify high security liquid assets. The white paper mentions \"USD-denominated investments may be authorized\" and that those investments priority for those investments will be \"principally, stability; secondarily, liquidity; and a distant third, yield\" which means that stability has higher priority than liquidity which has a problem of depeggning because of back runs. The paper doesn't specify percentages of planned on assets / investments, initial investment values or detailed tracking or explanation of the growth plan. That leaves me unsure of the project feasibility.\nOverall a good team with a great roadmap although I think the salary ranges are too expensive compared to the guides and other proposals, but it's ok to ask what you think you're worth so I don't base my score based on that. \nOverall I'm unsure about the feasibility of the project because of the lack of information regarding the backing assets of stablecoin.\n", "q1r": 3, "q2": "There is a github repository that would hold the roadmap progress so I'd say the projects' progress is tracable somewhat. There's a clear roadmap and a straightforward problem to be solved, but the solution to it could use a bit more details as mentioned in the feasibiltiy section.\nThe auditability overall is good. Anyone interested in the project has a place to check how the project is doing and provide feedback.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Mehen is working with the community to build a Cardano Native Asset stablecoin, USDM.\nUSDM uses stablecoin best practices: fully-backed 1:1 with high-quality, liquid, transparent, audited USD assets.", "experience": "Finance team avg 20+ yrs exp. in fiduciary TradFi. Deep experience in financial markets managing 2a-7 funds and large company cash portfolios\nLead dev is a SPO w/23+yrs exp. in Angular, Java, SpringBoot, DevOps, SysAdmin, and automation\nDev team includes: Drasil, Lidonation"}