{"id": 416954, "author": "alex.pipo", "title": "IRONSKY NFT GAME | Build on Mobile", "url": "https://cardano.ideascale.com/a/dtd/416954-48088", "category": 26595, "amount": 88880, "description": "The Cardano ecosystem has few NFT games, not keeping up with Metaverse trends, and will lose its competitiveness with other crypto ecosystems, with very few games on Cardano for ADA holders to join in", "f6_no_assessments": 9, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 6075, "q0": "Proposals in this FUND9 I had the opportunity to read through them, I do not have much time in the middle of this year so just looked at a few good ideas on Catalyst.\nYour proposal is a very great idea for this Fund. I am impressed with what you have shown, the meticulous and intuitive image refinement makes anyone passing by stop to take a look at the project and your doing it.\nTalking about this proposal in-depth, I have a few comments for you: A good game scenario and throughout the development process, the content, events as well as the development of the PvP team game model are very attractive in my opinion.\nWith the discoveries in the game levels, special items, and valuable NFTs created by you, I am also looking forward to participating in this game you are working on. Most of the previous Cardano games I've known often lack rich content, unattractive gameplay, and only land purchases, coordinates, or NFTs that have no operational value in the game.\nYou guys are excelling and doing something new for this Cardano gaming ecosystem, something that many Cardano holders expect as well as the gaming community wants.\nIn this proposal, the game scenarios have been divided according to each season, map, and version to be able to perfect the content in the most methodical way, as a mobile game player I understand this way of doing it is completely reasonable. With 6 Phases in IRONSKY is a game with great content, it needs a certain development period and the life cycle of the game will certainly be long term, creating peace of mind for players as well as those who invest in this game.\nI agree on how to solve the problem of the proposal, how to put risky situations that may come to the project as well as how you guys handle it when you have problems in the future.\nNothing is without risk but everything in this game you guys are controlling them well. I see in the future that this will be the proposal that brings certain success in the Cardano ecosystem, as the shining star that we all desire. You guys are doing well, keep it up, we really need Cardano blockchain games to be played on mobile devices.", "q0r": 5, "q1": "The IRONSKY is a proposal that has been very successful in the funds before Fund 8. The way you organize your game development team is very good even though you are working on other projects at the same time, the important thing I see is clarity in the resources you allocate in the project. Each small team with specific skills for their task is listed on a to-do list and the tasks to be completed. The way to break down the work in the project development roadmap, the tasks, and the time is very logical. Besides, you have very high-quality personnel and many years of experience in software development as well as mobile game development that you are still pursuing. I see that in your Peafone Game Studio you've been working on trending titles like Live on Planet for many years and puzzle games. This proves that you have certain success in your career as well as in your game-making field. This IronSky game really makes us excited, I believe you complete it like the products that you have done successfully before. I will not go into many details about each member of the team because you have written very carefully, what I want to say to the people who voted for the project: This group of engineers built their own team, and the members from large technology corporations such as (IBM japan, Fortinet, Mobage, Nikkie ..), they are fully capable of implementing this project in the best way. Another thing I observe is the budget statement in this proposal, the proposer not only lists the amounts but also attaches the team working on the budget, it makes the funder’s project really feel secure, see what they spend that budget on and which team does and receives that spending? The answers are satisfying in what this proposal is written. I just quote a little here to demonstrate what I have reviewed:\n\n“Graphics Design:\n    •    Tasks: (Design UX/UI of IronSky Game mobile, both smartphones and tablets, collaborate with frontend team to complete graphical interfaces for IronSky Game mobile applications)\n    •    Cost: ~ 180h x ($55/h) = 9,900\nQA & Testing App:\n    •    Tasks: (Test game on mobile launching, App Game mobile functions testing, unit test, security testing, combined with Dev teams to fix bugs and perfect the product)\n    •    Cost: ~ 140 x ($40/h) = 5,600”\nSummary for this section: You guys are good experienced engineers, given a clear project development roadmap, and reasonable budget estimates, I fully support the IronSky game on Cardano.", "q1r": 5, "q2": "The auditability of this proposal is concerned with project management as well as project progress tracking. The proposed team presents completely, they are information technology experts and use SCRUM workflow, which I think is a good option for product development teams. The proposed team defines project roles, clearly delineating tasks, reports, and weekly meetings. I've seen their work videos put together poorly, it's a very active team working on this project:\nMeeting\nhttps://youtu.be/8M4hgi2MXss\nWorking\nhttps://www.youtube.com/watch?v=kkU_EaZOFVc&amp;t=85s\nTracking\nhttps://www.youtube.com/watch?v=RxT1S97c55A\n\n\nRegarding the project tracking KPIs, they are also quantifiable and easy for the community to track:\n    •    The number of game versions released on apple store and google play.\u2028\n    •    The number of game downloads on mobile devices.\u2028\n    •    The number of people playing games regularly daily, weekly and monthly.\u2028\n    •    The number of tokens to be issued.\u2028\n    •    The number of NFTs generated.\u2028\n    •    The number of members in our gaming community.\nThe information given is not ambiguous but very transparent for everyone to see. Especially, the proposed team has given success figures before, in Fund 8 they have the highest position in the Game-on-Chained challenge. Very excellent achievements are: up to ~95% voted YES for IRONSKY GAME and attracted 1152 ADA wallets to vote on this proposal. Those are very impressive numbers and indeed your proposal is written very professionally and seriously. \nThe successful scenarios of the project such as attracting thousands of gamers, attracting investors, and enriching the dApp ecosystem on Cardano are entirely possible. Above all, you appreciate the cooperation in your proposal for the purpose of increasing the membership in Cardano, increasing the holders and users of the ADA cryptocurrency, and increasing the development and communication partners, I totally agree with your ideas and support you to continue to develop this project, especially blockchain game applications in the mobile environment.\n", "q2r": 5, "assessor": "z_assessor_2779", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2066, "q0": "This proposal is about games, and we are probably no stranger to the name IRONSKY NFT GAME, the reason I say this is because Fund7&8 has attracted a lot of attention in the community. And in this fund 9, the proposal continues to return with the expansion of game development on both operating systems and gaming platforms, in addition to PC. This is a game project that I find quite interesting. The size of the game is very attractive, a space game with specially designed spaceships with unique NFTs attached to the items. Game Player Experience different stages of the game with 6 consecutive scenarios (Aurora, Luna, Solar, Stars, Galaxy, Universe)\nYou guys surprised me with the depth of this game, which is definitely what I would expect from a game on the Cardano ecosystem. Especially NFTS, items, and rewards make your game more attractive to players. The proposal directly impacts ADA holders as well as existing gamers looking to migrate to the Cardano ecosystem in search of new experience opportunities.\nWith the 3 mechanics, you are designing like play to earn, play for free, and play to earn Goto Travel, I am sure to get more players to join your game. I like \" playing to earn the \"Travel mechanic, it makes me want to play and accumulate points so I can exchange them for travel somewhere that I can use to pay, you guys have set up The game mechanics are very well designed smart, and creative.\nIn general, the proposal meets the criteria in the challenge set, attracts players, benefits the community, and is very interesting, creates liquidity for Ada ... for all of that, I completely Fully support you to further develop the next stage of this game.", "q0r": 5, "q1": "Starting with the roadmap is a very detailed roadmap both in terms of time and specific activities. The proposal provides us with a roadmap covering 4 quarters, starting in Q3 2022, the proponent has a very clear vision for his product development. I found this game development roadmap to make perfect sense, we knew exactly what work the team needed to do, ensuring tasks were completed within established timelines. Next is the budget, the total requirement to implement this proposal is $88,880 which is extremely detailed and fully explained. The costs such as System Design, App Backend Dev, Blockchain Developers, Graphic Designers, App Frontend Dev... are all calculated. We know the cost for each job including how many hours performed, as well as the hourly rate of each job. This makes investors feel secure about the money they invest in your game.\nAnd finally about the project team, in my opinion, this is a strong and skilled team to develop this project. We know all the information of each member about their name, the field of activity, and experience related to blockchain as well as have all the members' links. We must know the role of each member of the project, which leads to the conclusion that the team also has the technical expertise to carry out this project.", "q1r": 5, "q2": "In fund 7 and fund 8 this IRONSKY game project was ranked top 1 in the poll showing its attraction to the community. In this fund 9, the next steps are also clearly stated. The proposed team has come up with several KPIs to track the project's progress:\n-Number of game versions released on Apple Store and Google Play.\n-The number of mobile game downloads.\n-The number of people playing the game regularly daily, weekly, and monthly.\n-The number of tokens to be issued.\n-Number of NFTs generated.\n-Number of members in our game community.\n-Number of ADA wallets registered in the game.\n-Number of people participating in the Airdrop.\n-Number of ADA wallets joining ISPO to receive $ISKY tokens.\nProponents provide detailed tracking of a project's progress and milestones and make it easy for investors to track their work. This proposal is to adopt popular tools for their exchange and project management such as Clickup, and Microsoft Project Management. More specifically, the authors mentioned the Scrum process that was run during the development of their project. I know that the Scrum process is an advanced process for software development teams that requires constant teamwork such as discussions, presentations, exercises, testing, review meetings, and product deployments products....so it is very suitable for a dynamic project like this\nAnd finally, the success of the project is well defined, and the implementation of the game token is very balanced and complete. And will release at each stage of the game's development. Tokens will be issued according to the project implementation time. From 1 month to the next 62 months. This is a fun game and the results are worth looking forward to. Once again, congratulations to the proposed team for the results you have achieved in funds 7& fund 8.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4856, "q0": "The proposer has the interesting idea about creating a highly entertaining game focusing on NFT integration into Metaverse on Cardano blockchain, namely Ironsky - a space game expressed through spacecraft warfare. I really like their idea and this project goes well with the Challenge.  This fun game would definitely attract more gamers, players, investors, partners to Cardano community, as a result,  gaming communities would be more interested in the Cardano blockchain. I appreciated that the proposer describe clearly about the game that I could visualize about it and find it enjoyable. This game will have its own story about a boy exploring the galaxy with his spaceships, and has 6 phrases in total (Aurona, Luna, Solar, Stars, Galaxy, Universe). Each phrase is different explained in a detail way that I think, the quality of this game is very high which differentiate it with other NFT games in market. The proposer shares key metrics (KPIs) to achieve after this funding round, I think,  shows they are very passionate and serious about building this game. In short, I found that the presentation of the game is very good, I would like to give them full mark for this part. ", "q0r": 5, "q1": "The feasibility part is very high. For the roadmap, the proposer provides in detail their plan from Q3/2022 to Q2/2023 with focusing on expanding game development on both OS and gaming platforms, in addition to PC. I know exactly what they would do for each quarter. Moreover, the proposer provides their targeted goals for the next 3-6 months, 6-12 months and 12-24 months that shows their long-term vision and seriousness in this project. For the budget part, with the given link for more details,  their main tasks and description of tasks within the scope of this proposal and details of using capital is given clearly: I know how many hours would be needed for carrying out each task, the hourly rate for each type of job, the total required project expense that I think, it is reasonable. It would be more perfect if the proposer could add information on who will be in charge of each task? and explain a little bit about how the team could manage their time for this proposal as they are executing many other project in this fund. As far as I'm concerned, this is a very ambitious proposal, which need a big team for implementing it. I am impressed that they have many years of experience in game making and deep technology knowledge. In fact, they are multidisciplinary team of more than 10 professionals with a vast skillset from tech, UX/UI, product design, marketing, business, and community leading. Their team is devided into different departments for better operation and support which shows their professionalism. The proposer confidently introduces each member and their profile is shown clearly in the proposal with link given for community. I strongly believe in the feasibility of this project with the explannation above. ", "q1r": 5, "q2": "This is an auditable project. For internal monitoring of the project's progress, they will use tools like ClickUp, Microsoft Project Management. Moreover, they will use Scrum framework for complex work, which is their strong point for project management. Besides, Japanese HO_REN_SO process for key members will also applied for smooth communication at different management levels. For community to follow their project development, the team would update information on their website homepage. Along with that, community could base on some key indicators: the number of game version released on Apple store, Google Play; the number of game downloads on mobile, the number of players daily, weekly, monthly; the number of tokens issued, the number of NFTs, the number of members, the number of ADA wallets registered, the number of people participating in the Airdrop, the number of ADA wallets joining ISPO to get token $ISKY. In addition, for more direct and engagement with the team and project, community could follow their social media channels such as Telegram, Website, Github,..After all, this auditability is very good. ", "q2r": 5, "assessor": "z_assessor_2622", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6200, "q0": "I love gaming topics and am always looking for proposals related to mobile games.\nThe Iron Sky p2e game proposals for mobile caught my attention, after seeing a few other proposals I decided to review your project.\nAbout the game IRONSKY, it describes the spaceship battle with the role-playing image of the player character very attractive, different from other traditional games, this is a challenging space adventure through many stages for players like AURORA, LUNA, SOLAR, STARS, GALAXY, UNIVERSE.\nIronSky delves into the experience and features related to NFT items to add value to players and increase the attractiveness of the game.\nSurely this team of proposals are very professional game makers, they script the game very logically and have a long story with rich game content.\nThe missions for the player, the scenes, and the features of the character are described.\nI have seen the clips they put up, really the game content and images are worth our experience. “https://www.youtube.com/watch?v=RxT1S97c55A”\nThe way you solve this problem is very good, you know how to create a big game that attracts players and investors who want to own NFTs or Tokens of this game.\nThis is probably a game that will catch the attention of the Cardano ecosystem and have a great deal of influence in the crypto community when it is released.\nThe basic KPIs selected by the proposer are very core, they are the key indicators for the execution of this project, and are completely measurable in numbers.\nI can summarize here what the proposal offers (number of people playing the game, number of registrations, number of game downloads, number of game versions released, number of people participating in the IronSky gaming community...) These are core metrics for game success as well as identifying milestones to increase game value, adding value to ADA holders participating in the game.\nIn my opinion, this will be a game that will have a great impact on the gaming community on the Cardano platform as well as gamers on other platforms who want to participate.", "q0r": 5, "q1": "The proposal offers the clearest and most complete disbursement plan I have ever seen in a project, sections such as taxes in jurisdictions with incentives down to 0% for technology projects as shown in the proposal. this. I also feel very reassured when the proposer deducts 10% for risk management for the project (Cost: ~80,800x10% = $8,080), mainly this reserve fund is to avoid the devaluation of the ADA coin in the short term. deadlines for the payment of employee salaries.\nThis is of little interest to any proposal, it shows that the proposed team has taken into account many possible scenarios to ensure the best development of the project in my opinion. The good thing here is that the proposer attached the team along with the divided budget and clearly stated the task of the work, I found that “\nApp Backend Dev:\n    •    Tasks: (Coding API, Database query, Build SDK, Deploy IronSky game to iOS, Android environment, cooperate with blockchain developer to provide available APIs)\n    •    Cost: ~ 200h x ($60/h) = 12,000\n”\n… That is a specific quote in the disbursement. The development roadmap of this project is explained in detail:\nQ3/2022\n    •    UI/UX design for mobile gameplay.  \n    •    Design and build a system of mobile game clients.\n    •     Build and program APIs to connect backend systems with game clients.  \n    •    Integrated wallet and KYC authentication for Game App.  \n    •    Test the interoperability between Gameplay and Marketplace.  \n    •    Integrate and load NFTs game items into Gameplay.\n(In this section the teams involved in development: UX/UI, frontend, backend, system, and blockchain technical team)\n… There are still many such details, the project team has been divided into quarters with a lot of content and workload. Prove that the development team has fully planned and prepared it for a long time, this helps to limit mistakes or omissions in certain work of the project. About the IronSky development team: they have many members covering many skills related to game development, software engineers, IT engineers, blockchain engineers, artists, and marketers.. have many years of experience. They are experts in the field of cough. This is a talented team that has developed many products as well as has been successful in previous Catalyst Funds. They listed some projects like IronSky Fund8, cBilling dApp Fund8\nhttps://cardano.ideascale.com/c/idea/399208\nhttps://cardano.ideascale.com/c/idea/403809\nWith their many years of experience in game development, I believe this is the next successful project and absolutely they can do it. Please support this great proposal if you are a lover of games developed on the Cardano blockchain.", "q1r": 5, "q2": "This is a continuation and expansion proposal of IRONSKY in Fund8, if in Fund8 they develop PC versions, with Fund 9 they especially focus on developing mobile game versions, which are important and scalable platforms for game players. In this auditability, the proposer listed information to help the community easily track the progress of the project as well as the results of the funding rounds. They also provide the necessary links and annotations to track the progress of this project, which are:\n“..the community can also talk to the game's developer or more information at the links below.\n    •    Telegram: https://t.me/ironskygame\n    •    Website info: https://ironsky.info\n    •    (*) GitHub: https://github.com/adaboys/IRONSKY_NFT_GAME\n(*)Note that during game development, important parts of the project cannot be published immediately to ensure the security of the project”\nThis shows that they work very carefully with every little detail to serve our Catalyst community. In addition, they also list the success indicators of the desired project with tens of thousands of game players and ADA holders participating, achievements from previous Funds, and how the project is managed according to the SCRUM process and Ho-Len-So process of Japan. Another important part of the game's success is the implementation of Tokennomics to grow the in-game economy as well as the split ratio in the Ironsky ecosystem. This is a part I think is very important to investors and players of the Play to Earns game.\n“plan to issue 1B tokens and distribute them to the following categories\n    •    Foundation 5%\n    •    Seed 4%\n    •    Private 7%\n    •    Public 5%\n    •    Team 23%\n    •    Advisor 2%\n    •    Airdrop 1%\n    •    ISPO 5%\n    •    Marketing 4%\n    •    Ecosystem 44%\nAnd will release according to each stage of the game's development. Tokens will be issued according to the project implementation time. From 1 month to the next 62 months.”\nThis proposal did everything perfectly, I don't seem to have to do much searching but the documentation in the project is always available. This is a good project with a lot of potential for success and I hope many people choose it. Thank you for your sense of making the Cardano ecosystem more and more valuable.", "q2r": 5, "assessor": "z_assessor_2793", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6209, "q0": "This proposal seeks funding for the development of a Highly Entertaining Play2Earn Game focusing on NFT integration into Metaverse anchored to Cardano. \nThe problem is clearly explained and the solution is straight forward.\nThe development of such game is exactly what the challenge Dapps, Products & Integrations is about.\nGiven the size of the gaming market, if the fame is succesful, this project could have a significant impact on the Cardano adoption.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "This is a continuation of a project funded in F8.\nThe game story is enticing and explained in the proposal as well as the github page of the project, where the development has already began.\nThe proposers have experience from fund 8 with a total of two funded proposals for over 80K total. So far we know that the proposer has done two monthly reports on the funded proposals.\n In fund 9 the proposers have applied for funding with five proposals for the total funding of over 492K.\nThe proposers have a website with a road map of the game creation on it where we could see that the work has begun in Q4 2021.\nThe project has a well explained road map with timeline in quarters and a list of tasks for quarter.\nThe proposal has very well outlined and broken down budget including 10% risk management buffer.\nThe team of ten is well presented and has linkedin accounts where experience could be cross checked. The team looks sufficiently experienced to take on this project.\nThe proposer plans to continue using Project Catalyst for funding of the development of this project.\nThe proposer considers risks for the project and provides mitigation for these risks.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "In the auditability section of the proposal there are a lot of explanations on the structure of management of the project, however there is a lack of concrete numbers and dates against which the auditor could measure the progress of the project.\nHowever the very specific breakdown of the plan of this proposal helps to clarify things.\nThe success metrics are explained, but lack numbers and dates, the detailed plan again helps.\nThe proposer provides information on the homepage and follow the schedule of the established roadmap. However, the proposer does not specify how often they will bring reports to those places.\nHowever the propose has an active telegram channel where the developers could be reached from the community in order to get updates on the project.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6838, "q0": "This proposal effectively addresses the challenge as the team is creating amazing things for the Cardano community. I first came upon this project in fund 8 and was totally blown away by the fact that a real play-to-earn game that I would actually like playing so its great it can be developed here . As an old-school gamer and UGC creator, I love flying games and space invader-type games, so the Ironsky game ticks all boxes. It was very nice that the team got funded and we can already see the progress of the game, the ships look awesome as they are paving the way for an epic gaming industry built right here for the Cardano community, to be able to own and trade your spaceship is such a bonus, players want to be really apart of the game so owning something valuable and earni9ng to play makes sense with all hour used. As we all know the gaming industry is massive and people love to be entertained when this project delivers on its goals, it would attract the gamers and investors, bringing wealth to the community ", "q0r": 5, "q1": "Looking at the team's experience they seem to have many years of software development between them and they have a good development team with decades of experience within the mobile gaming industry. Iron sky already has the potential to be one of the top games on Cardano! Being able to play via PC is good but to make it mobile is where it definitely needs to be as its practical and will be easily accessible to all.", "q1r": 5, "q2": "The Audit progress can be checked from the engagement it creates from website visits, Nft purchases discord and telegram, advertising is one of the main problems with getting projects like this seen, places like TikTok is a good place to advertise where the users are able to create real user-generated content on gameplay and Nft spaceship trading. I have great hopes for this project for the future, when the game is available on mobile the downloads and game rating should give you a good indication on how the game is doing. Cardano needs some good vibes and entertainment and wealth for our ecosystem and community. all the best for this team, I will be keeping up to date with game developments closely..", "q2r": 5, "assessor": "z_assessor_2834", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11449, "q0": "The idea is about creating a game called Ironsky focusing on NFT integration into Metaverse on Cardano blockchain. I think, this would be a highly entertaining and \"play to earn\" game for gamers, investors. The proposer designs this game into 6 phrase, about a boy must overcome each challenge, for that players could earn NFT items, tokens, ADA through staking, farming or trading, and most importantly, to experience an exciting journey with the boy (character in the game) through the game. Personally, I find this game very fun after watching game demo. I love their idea. ", "q0r": 5, "q1": "They have a very good team members. They are talented and experienced in different fields, especially their team has in-depth understanding of the technical terms in games and creative game designers. The proposal shows a lot of confidence about each member's introduction. Moreover, this is on-going project, the team shows their ability to implement this project with proof of works to some extent. Therefore, I am persuaded that this team could do well. Besides, details of works, timeline, key milestone are also shown clearly in their roadmap. For the project's expense, it is calculated based on hourly rate and total hours for each type of job, that is reasonable, leaving nothing for more comments. In short, it is possible to carry this project. ", "q1r": 5, "q2": "It is possible for community to keep track of the development of the proposal. They could visit the website ironsky.info for updates of the project, the social media account: Telegram, Twitter to talk to the game's developers and directly ask questions. Additionally, community could check the product code on Github. Besides, they could follow the roadmap of the project as the KPIs for each phrase is clearly stated by the proposer. Furthermore, the team will use Clickup, Microsoft Project Management, Scrum for better management of project, and apply Japanese HO-REN-SO working rule to ensure smoothness. In my opinion, it is very easy for community to follow their project.", "q2r": 5, "assessor": "z_assessor_3246", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12609, "q0": "Proposal tailored to challenge requirements. A game that integrates NFT into Metaverse on Cardano is a great idea, in the past year the play-to-earn trend has really exploded but the number of high quality games is too small, so the platform will be difficult to collect. attract a community of gamers - an extremely potential community.\nIn my opinion, the project focuses a lot on developing the plot and the environment in the game, a very important point in a game, when the trend explodes, the games ignore this part and only focus on the mechanics. play-to-earn, leading to boredom and not being able to keep gamers for long. I am therefore very pleased with this part of the project.\nThe scenario and objects in the game are detailed with 6 stages, of which the last 2 stages I think the project is doing very well in keeping gamers playing for a long time with virtual reality and continuously extending the time space survival time to be able to explore.\nSo, I think this is a potential project, it will have the ability to attract the gaming community and potentially thrive when the play-to-earn trend returns.", "q0r": 5, "q1": "The roadmap offered by the project is a continuation of the project at fund 8. The proposer outlines the processes with realistic timelines, clearly listed tasks and goals, and groups and participants is also specified, I have no opinion on this part, because I think the information provided is satisfactory. The budget section and short- and long-term successes are provided in great detail and are fairly easy to understand. Proposer have also given evidence of their personal skills and experience related to project management or application development. With the amount of information provided, I can fully believe in the success of the project if it is funded and I expect the project to come to fund 10 with the successes achieved.", "q1r": 5, "q2": "The proposer clearly states the strengths of the team and the information about the schedule is set, she has a lot of project management experience, so in my opinion the proposed KPIs are completely reasonable. A lot of links about the group and websites are given, This shows that the working group is willing to publicize the work information so that the community can easily check the results, helping the group work closer to the community and Easy to get support.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14409, "q0": "I am reviewing the proposal IRONSKY NFT GAME | Build on Mobile in challenge F9: Dapps, Products & Integrations. A very exciting challenge and like many great projects submitted in this category, IRON SKY is one of those interesting projects. This is a proposal to build an NFT game on the Cardano blockchain. The story of the game is the exploration of space, along with the simulated space wars through the built spaceships. It is attractive by many changing contexts and designed items in the game. According to this game’s developers, special NFT-attached items are rewarded to players who successfully complete missions in the game. To develop a wide audience to participate in this game, the developers created 3 gameplay mechanics such as Play to Free (which helps players explore and learn the basic gameplay to continue their journey in the game). game space) Play to Earns (Allows players to delve into cosmic levels and versions, maps, and higher levels in search of valuable special NFTs). Play to Travel (Allows to expand the ecosystem of IRON SKY, impact on players' lives, and allow redemption through real-life travel activities of gamers).\nRegarding the image of the game, it is very suitable for space games, has role-playing parts, has space and space, and the characters are very well designed. I have seen their demo game as well as Some pictures on the website www.ironsky.info. Through this, I get the opinion that the project development team has come up with a good solution for developing a game of the quality they want, which will make a positive and great impact on the applications of the Cardano Ecosystem.\nThe proposal to contribute to the blockchain gaming community attracts gamers to the Cardano platform to experience such exciting games. Some of the risks mentioned in the proposal such as (cryptocurrency market decline, Cardano technology, and human resource fluctuations ..) the proposed team all have reasonable solutions, they have experienced themselves, these fund7 and fund 8 this is very good. In addition, KPIs are defined as, quoted “Develop versions of the game IRON SKY running on iOS and Android. Players can download the game from the Apple Store or Google Play. Release tokens for the game's ecosystem, for advertising, partners, or airdrop for the Cardano community. Increase the number of ADA participating in the game and the number of wallets registered for the game.” The development team raised the problem and explained the proposed solutions. I believe this is an amazing game for players and investors in the Cardano ecosystem.", "q0r": 5, "q1": "I continue to review the development team of this project in the section Feasibility, they are experts in the field of content development on the internet platform, and they focus on developing mobile games and mobile applications for users. Perhaps these are the core experiences for them to form this IRON SKY proposal. Members have many years of working with the skills and roles required for today's project, such as programmers, systems engineers, graphic designers, and experience working on the Cardano blockchain. Here are some of the development team members and their specific work.\n“PhuongNguyen” Designer, Artist, Graphics, 3D builder Experience: 3D module build, UI/UX design App Mobile, Game Artist Contact Telegram: https://t.me/hlxb353 Facebook: https://www.facebook.com/giangquynhn.\nDev_Team ThangLe, ThiPung Inbox: (thanglq01 n.b.hoa, phuongvanthi1206) in Skype Dev team engaged for a long time in more than 20 mobile game projects with members who are Full-stack developers for a large-scale system. Experienced working with various languages and technologies such as C++, Java, Node.js, React, React Native, Flutter, Unity, MySql, MongoDB for iOS and Android app development.\nBlockchain_tech ThangTran (Inbox: trannamthang in Skype) https://github.com/saigonbitmaster Developer expert in React Native, Node.js, Haskell, and Plutus. Leader of ADABoys Lab team (as an image of MLAB in the future). \"\nI assume these are engineers with good experience working on the technologies, tools, and modern programming languages in use today. Therefore, the implementation parts of this proposal are possible. The project has a total required budget of $88880 with specific costs such as frontend web programming, how much the backend, graphic design, server costs, blockchain programming costs, product testing, and also the cost of risk management are mentioned with a clear list for the teams that perform that task. This is a budget of no more than $ 100K for a big game on mobile, which is very suitable and saves the community budget of the Catalyst fund.\nThe roadmap of the project is planned in detail by the development team with timelines that are:\nUI/UX design for mobile gameplay. Design and build a system of mobile game clients. Integrate and load NFTs game items into Gameplay (in Q3/2022).\nTest mobile game versions of IRONSKY on Android and iOS.\nRelease the MVP version of IRONSKY on Smartphone and Tablet devices (in Q4/2022).\nRelease the full version to Apple Store and Google Play (in Q1/2023).\nThe to-do items are very sequential and logical with defined timelines. This is a completely successful route to the todo list proposed by the development team, I agree with the points in this Feasibility part of the proposal. This will be the project that contributes to the success of the NFT Games on Cardano blockchain.", "q1r": 5, "q2": "The next part I am reviewing is the audit section of the proposal. I didn't know about the Japanese Ho-Len-So process until I saw as this proposal. I learned more about that process and the Project Development Team explained it well in their attachment (https://docs.google.com/spreadsheets/d/1wC8HddWmFjvSg0jmqpHYnE-umvZBY4Q4jnwI9qUM0oU/edit#gid=178850880) ). Thereby Ho-Len-So is a dynamic workflow, it is a continuous workflow and unites small teams in large projects. The proponent cleverly combined the SCRUM and Ho-Len-So processes for the development of IRON SKY, which helps them to keep track of the project's progress, the progress of the small tasks as well as the reports generated. given daily weekly as mentioned.\nIn addition, they’re game communities on youtube, telegram, discord, and GitHub channels ... help the catalyst community to track the progress and events of the project.\nThe proposal also promotes cooperation with partners in the media, business, and communities in the catalyst, especially as Airdrop game token programs or ISPO (benefit sharing for ADA holders in different countries). the pool they collaborate on for the game IRON SKY) … those campaigns are all focused on benefiting our Cardano community. The proponent has taken great care of the community and designed good campaigns that harmonize the interests of the parties involved in their project. The success of the proposal is to create an attractive big game in the Cardano dApp ecosystem, attracting thousands of gamers and investors to join and hold ADA coins.\nThis is the very amazing future we all look forward to, I will definitely look forward to your IRON SKY experience. Notice that these are their previous successes, quoted: “This is a previous funding proposal, it related to the work parts of the entire IRON SKY game proposal in F8 before. (https://cardano.ideascale.com/c/idea/399208) It has been ranked TOP #1 in the voting with ~95% voted YES for IRON SKY GAME and attracted 1152 ADA wallets to vote on this proposal.”", "q2r": 5, "assessor": "z_assessor_4038", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We will be creating a Highly Entertaining Play2Earn Game focusing on NFT integration into Metaverse to attract Gamers & Investors to Cardano. A space game genre is expressed through spacecraft warfare", "experience": "Over 15 years of experience in game mobile development. In-depth technical team& creative game designers, passionate about game& blockchain. Besides, we gather innovative startups on new technology platforms, with an experienced digital marketing team in deep understand of users."}