{"id": 417043, "author": "thrift.labs", "title": "DeFi Access from Mobile Devices", "url": "https://cardano.ideascale.com/a/dtd/417043-48088", "category": 26595, "amount": 118200, "description": "Provide user-friendly access to DeFi services directly from mobile devices, boosting financial health sovereignty.", "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 3887, "q0": "The issue being providing user friendly mobile access to DeFi services thus Increasing financial health sovereignty. The proposer will be building a DeFi connector for mobile wallets such as Thrift and other projects. for both android and iOS devices. this will help resolve the issue effectively. The proposal does help DeFi ecosystem and this helping cardano. Therefore this proposal do effectively addresses the issue", "q0r": 5, "q1": "The proposer and their team consists of Project Manager, Wallet Developer, Financial Analyst and UI/UX Designer. They are also looking to hire few more required people.\nBased on these there do have to required experience and skills to implement the proposal.\nThey have given clear plan and have requested a budget of $118200 USD. They have provided a rough budget breakdown more detailed things like hourly rate would have helped to understand if the fund demanded is justified or no. The proposer has considered possible risk that may affect the proposal. It is very likely this proposal will be carried out successfully", "q1r": 4, "q2": "The proposal does have clear plan and timeline. The timeline is divided monthly wise and the proposer has mentioned the work which will be done in these month. which is great to measure the progress of the proposal. The proposal also consist of clear key performance Indicator and also sustainable development goals which is needed to measure the impact of the proposal.  The proposal have also provided details on success of the proposal. All these information should be enough to track the development and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8123, "q0": "I find that the author has raised an important issue and is very close to the actual needs of people, the scale of impact is large when hitting the smartphone market directly. The smartphone market in the world is growing strongly and the number of users is increasing. Providing DeFi access from mobile devices is important to users. Especially where the population does not have access to traditional banking services to maintain their financial health (such as in some countries in Africa).\nThe proposed solution will solve this problem. By building a DeFi connector for mobile wallets (iOS & Android) to address the lack of mobile access to DeFi services for Thrift and other Cardano projects. (Thrift is a user-friendly financial smart mobile wallet to drive Cardano adoption through savings and open decentralized finance. This project was funded by Catalyst in Fund 8.) The author has described the solution in detail and made a reasonable argument. Africa will be the key to the adoption of the solution, it will open the way for Thrift and more Cardano projects to widespread adoption.\nFrom the above, it is shown that this proposal met the \"Dapps, Products & Integrations\" challenge.\nThe author has mentioned 3 main risks that can be encountered when implementing the project. Every risk has a suitable solution. It also meets the Sustainable Development Goals (SDG) of ending poverty in all its forms everywhere, promoting sustainable economic growth, and reducing inequality within and between countries.", "q0r": 5, "q1": "The roadmap of the project is clear, has a specific timeline and detailed plan. The content of the work is presented by the author on a monthly basis, the project is implemented in 6 months. Thrift Wallet is still in the process of completing basic functions and needs to share the funding of this proposal to continue (the current status of Thrift Wallet can be checked via the Trello board the author has provided the link for). ).\nThe proposed budget represents 1.51% of the total Challenge budget. This amount has been allocated to expenses. However, I find that it is not detailed and there is no explanation for this calculation. My contribution is that the author should explain in detail those costs to make it easier for viewers to understand, such as the cloud cost is 12 months but the roadmap The project was implemented in 6 months. The remaining costs are calculated as a package or monthly or hourly (if by month or hour, what is the average cost of 1 month or 1 hour, how much is the total number of months or hours performed)\nThe author has provided full information about the members implementing the project. They are all people with a wide range of abilities and experiences that are relevant to the goals of the proposal. They already have a number of projects that have been funded by Catalyst in previous Funds. In addition to this proposal, they have a number of other proposals also submitted in Fund 9. Their identity is also provided by the author with a Linkedin profile and project website link to help the community easily verify their identity and learn more other information.", "q1r": 4, "q2": "The author has provided many measurement indexes and ways for the community to monitor the progress of the project in a very reasonable and transparent manner. There are 4 measurement indexes mentioned (Number of DeFi services integrated, number of dApps used, number of users using and increased cooperation facilitated by this implementation). The monitoring of the progress and development of the project will be publicly reported every two weeks to Catalyst organizers and the rest of the community through the project's social media channels and through the Trello table.\nThe success of the project is clearly defined over time and has specific KPIs. The author's presentation is very detailed, easy to follow and shows the transparency of the project.", "q2r": 5, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8210, "q0": "\"The description of the solution is very detailed. The team has pointed out the current problems with banking services in order to explain their project’s potential and application. The expected impacts of the project aim to drive Cardano adoption and familiarize the DeFi concepts, which are well in sync with the key metrics of the challenge. \nThe main risks are well predicted and mitigated by some proper approaches. I think the team can add more details regarding the legal procedures and security insurance. Since the target market will be different countries (Kenya, Nigeria,...), how can the project comply with different regulations and jurisdictions?\n\"", "q0r": 5, "q1": "\"The timeline and key milestones in the delivery plan are clear and detailed. The project will be operated for about 6 months, starting from Aug 2022. All the main tasks are broken down in each phase so the community can easily follow and assess the project’s progress. The spending is also carefully allocated accordingly, however, there is a need for more clarity here. What is the team’s definition of “UX/UI: $4500” or “training: $900”? I think the team can work more on the required steps/resources for each aspect to ensure the reasonability and practicality of the financial plan. \nThe information of team members has been included in the proposal. Based on the working experiences highlighted, I believe they are a productive team and capable of running the project effectively. \n\"", "q1r": 4, "q2": "\"All the key deliverables and KPIs mentioned have made the auditing process easier, meeting the transparency requirements. The metrics are relevant and well aligned with the delivery plan, enable the community to monitor the development of the project. I think the community would expect specific goals to measure the project’s success. For example, what is the desired number for each KPI mentioned, and in how long these results will be expected to get?\nDespite the vague success’s visualization, the team manages to publicly report the project performance every two weeks to the Catalyst community, which indicates transparency and constant updates\n\"", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8583, "q0": "This proposal takes a pretty transparent approach as the proposed DeFi connector for mobile wallets aims to solve the lack of mobile access to DeFi services for Thrift and other Cardano projects, while also delivering profitable and secure services from the Cardano ecosystem to African countries. This goal is perfectly consistent with the challenge objectives. The problem is stated properly, and the answer addresses it appropriately. In my perspective, such a project would have a positive influence on the Cardano environment, and if correctly implemented, this solution could easily scale up. In order to evaluate the solution, the proposers provided some metrics concerning its impact. This contributes to greater voter trust. One question I do have is in regard to some possible risks mentioned by the proposer. Although the author of this proposal highlighted the team risk, technical risks, and adoption and market risks, there is no mention of their concerns about service compliance in African countries. I'm also not confident what methods the proposer intends to use to overcome the aforementioned threats. If the proposer could provide more specific information, voters would be able to better understand the impacts of this idea.", "q0r": 4, "q1": "Concerning the competency of the core team, the essential verification of both skill and experience of the core team is provided in detail. The team possesses a diverse set of talents that will all be needed.The proposers also outlined partnerships with an expert Haskell/Plutus lab, This gives me confidence that they have set the framework for the project to thrive. Their search for Haskell and Plutus developers, a Mobile Engineer, DevOps Engineers, and Community Managers is reasonable, but need more additional info such as including the experience required for each role or other standards the team is looking for in a member? Given the amount of time that would be out into the project, the proposal's budget is acceptable. The required funds are divided into identifiable components, with the majority going toward the salaries of mobile engineers in 5 months. However, there is still room for advancement. Perhaps the team should provide a monthly rate, name the specialists handling the work, and how many people are required for the role, indicating how the $36,000 will be spent would be beneficial, improving clarity over implementation details. Another consideration is that, given that marketing is included in the budget projections, I would have liked to have a more detailed explanation of how and when the project intends to market during the development period. On the plus side, the proposer goes into great detail and makes a dedicated effort to explain the technical aspects of his plan. Additionally, the proposers offered a defined timeline for the project, which shows that the project will run from Aug 2022 to Jan 2023. I myself find the milestones are achievable. With more concrete information on the budget breakdown, this proposal is sure of high feasibility.", "q1r": 4, "q2": "The team prepares a monthly road map with deliverables, which I believe is relevant to the implementation plan. This demonstrates that the proposing team has a clear vision of what they want to achieve and a clear roadmap to attain the outlined goal. They also provided a simple and transparent explanation of their goals, and their proposed solution is sensible and makes a lot of sense. Success metrics are reasonable and outlined and fall within the challenge’s requirements. The team promises to post a two-week update to Catalyst organizers and the rest of the community through their social media channels and through their public Trello board. A real link of the current Trello board for Thrift Wallet MVP is provided straightforwardly. It is a very auditable proposal indeed.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12748, "q0": "This proposal wants to build a dApp connector for mobile wallets. Their plan is described in detail and the two ways to integrate a smart contract connector with mobile applications are presented.\nIt´s clearly described how this proposal addresses the challenge but I think goes beyond the named usecases. Having access to smart contracts from mobile devices could help everyone in the Cardano ecosystem but the focus on Africa gets clear with the IOG & Iceaddis Incubator Program for Africa. Overall I think this proposal clearly matches the challenge. ", "q0r": 5, "q1": "The team has given short texts and their linkedin profiles. I checked their CVs and they should have enough skill and experience to implement this proposal. They still search for a variety of employees but at this stage it´s okay because the team isn´t final. Their current website and app are looking good this gives additional proofs of their skills. \nThe timeplan is very clear. Different months are tasks assigned. The projectplan is from August until January. Overall all the tasks are reasonable and easy to understand. \nThe budget is listed but the total doesn´t match the numbers. They are missing 8000 $ Other than this it´s clearly formulated and easy to understand. That 40% of the 56000$ are used for the wallet is also clearly stated. But I remove one star for the miscalculation. \nThe risks have been analyzed. The team has made some mitigations. ", "q1r": 4, "q2": "The project management is made in Trello. They have published their page and it shows exactly their open tasks and goals. \nThe four KPIs and metrics are well chosen and easy to evaluate. \nThe overall roadmap is also clear so overall it´s very easy to audit.", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 13595, "q0": "This is a very long proposal and lots of technical words. The author should have a footnote of technical words so that people without technical knowledge can understand its meaning. For example, what is RealFi?\nThe content presented in the proposal is very detailed, but the presentation does not make the reader feel easy to understand. The author should clearly define the following outstanding issues: Who will use this product? Why should they use this product? What are the benefits of this product?\nThe way content is presented according to these topics will stand out and be easier to understand for readers.\nIf possible, the author can add numbers from local articles, to demonstrate that the opportunity for application is very potential. For example, how many smartphone users in Africa, how many Africans can't get a loan from a bank? These numbers help me and the voters see more clearly the potential of this market. Meaning the opportunity for the application will be huge if it is completed.\nRegarding the risks listed by the author, I just need to add one more suggestion. It is a risk that ADA slippage could lead to the project running short of funds to complete the proposal. Therefore, the author should add 5-10% of the total amount requested in case ADA slips.\nThis is a very professional team, the content of the proposal is very complete, so I will give them 5 stars.", "q0r": 5, "q1": "I rarely see a monthly or quarterly blueprint in other proposals. But in this proposal, the author and the team wrote in great detail about the monthly implementation plan. I would like to add, in the tasks that the team will perform during the month, there should be more names of the member who will perform that task. This helps me and the voters fully assess whether team members have the experience and skills to complete those tasks.\nIn the cost description, I see two expenses that I don't quite understand.\n- Translation $ 1800: What languages ​​does this translation translate into, and how much is expected.\n- Licenses: $1200: Why is this cost needed? What benefits does this license provide?\nRegarding the profile information of the members on Linkedin, I find them to be very talented and experienced members of Cardano programming. That reassured me that their team had the skills and knowledge to complete this proposal even though the technology to complete it was extremely complex.", "q1r": 4, "q2": "The author and team have provided a very clear and detailed roadmap month by month.\nAlso offers highly publicized proposed execution plans on the task planning app Trello.\nRegarding the KPI to evaluate the success of the proposal, I think the author should add another indicator: the number of transactions from the dApp. This allows me and the community to see how frequently this dApp is used by users and how it impacts the growth of Cardano.\nI think this is a pretty excellent proposal from members who have a lot of experience in Fund8. I believe that if this proposal is supported by the voters in this Fund9, they will successfully complete this proposal and contribute a lot to the development of the Cardano ecosystem. At the same time helping people in Africa easily access a huge financial resource in the world, helping them change their lives.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will build a DeFi connector for mobile wallets (iOS & Android) to solve the lack of mobile access to DeFi services for Thrift and other Cardano projects.", "experience": "Our team members have combined experience in blockchain, finance, analytics, African business, big data, UI/UX."}