{"id": 417021, "author": "gavriel", "title": "The DAM Marketplace", "url": "https://cardano.ideascale.com/a/dtd/417021-48088", "category": 26595, "amount": 50000, "description": "Web2 traps us with marginally-personalized experiences, wasting our time in searching for (and often missing) the experiences we truly value.", "f6_no_assessments": 7, "f6_rating": 3.8095238095238098, "videos": [], "media": [], "f6_assessments": [{"id": 1933, "q0": "The DAM Marketplace aspires to build a foundation for decentralized web3 marketplaces. This proposal is a ‘pre-phase’ to the actual development of the solution that builds the structure and planning of the architecture. The project and proposal is greatly aligned with the challenge setting of the “Dapp..” challenge. The project/solution contains multiple components that are impactful on their own, and if they were to be implemented and integrated they would result in a very impactful project in the Cardano ecospace, or maybe in the whole blockchain domain. The resulting score will be high as a consequence, 5 points.", "q0r": 5, "q1": "The proposal is ambitious in its vision and the proposal successfully delivers this vision to the reader in a few aspects. The project related to the proposal is a pre-phase that builds the foundation and structure to successfully deliver the solution in the future. It is a big plus that an ambitious project starts at the right end, to avoid bottlenecks and unexpected obstacles down the road.\nThe detailed plan delivers a broad picture of the work that goes into each phase(month), it is spare but provides a sufficient overview. However, the proposers have failed to provide a budget that reflects the detailed plan. This is unfortunate since the team is credible and proposes a very feasible project in all other aspects. The team is experienced and they seem to have a clear path to success, therefore it should not be a complex task to provide a detailed budget and more explicitly stated tasks related to each phase.\nThe proposal is feasible but the lack of a budget must be considered, as a result, the score will be neutral. 3 points.", "q1r": 3, "q2": "The proposers state that they will deliver KPIs with measurables when the project has started. They are indicated in the proposal, but no hard numbers or estimates are provided. This is not optimal, but given that the project is starting its initial phase, it's considered sufficient. It is not fully clear to the reader how they could audit the project during its progress in terms of measurables, this could potentially be refined further with a structured and more explicit approach in the proposal. \nFurthermore, a publicly available channel should be provided to the community where the progress updates are delivered. It is a bit uncertain if/how/where this will be done in the current state of the proposal. \nBy refining the above mentioned aspects, the proposal would gain a greater score. A kind of “rebate” is given in the score, since the project showcases ambition and an otherwise structured proposal. The score will be a weak 4 pointer, resulting in 4 points given. ", "q2r": 4, "assessor": "z_assessor_2290", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2067, "q0": "This proposal aligns with the challenge of \"becoming a better alternative to existing centralized providers\" by challenging through a decentralized autonomous marketplace. The goal of this proposal is to create a globally recognized brand that can grow to compete with Amazon, Facebook, Twitter, Patreon, and all the regulated social networks and monetization markets. and other focus. Front end accounts allow new web3 users to build their alternative digital life experiences beyond web2. The minus point of this section is that there are some challenges listed in the project, but we have not seen the options to be able to face those challenges.", "q0r": 4, "q1": "In my opinion, this part of the proposal needs a lot of improvement. Regarding the roadmap, the proposal provides a 4-month roadmap, we know what tasks will happen in those 4 months. Would it be better if each task was detailed e.g. Development of specifications with what methods, who would do that part, and what would be the results? Next comes the budget, this part needs to be improved as a whole, we know the budget required for this project is $50,000 with the explanation that includes the cost of consulting developers and designers to Build model architecture and prototype interface design. We need a detailed explanation of the amount requested, why they want 50k dollars, how this money will be divided into parts, what the salaries of the professionals involved will be, etc Sorry, we don't have budget information. And finally, about the project team, only one member mentioned, Gavriel Shaw, described his experience and field of activity. I think he needs to attach a small professional resume, as well as a LinkedIn or Twitter link so we can confirm the above. In addition, it is also advisable to provide information about team members and their roles in this project.", "q1r": 2, "q2": "Based on what is provided it is difficult for the community to track the progress of this project. What the author describes is likely a way for him to track the progress of the project. In fact, no KPIs were given, so I can't determine how we would audit this project about development. The success of the project is mentioned as driving momentum towards actually building the various components needed for a holistic and integrated Dapp marketplace that will capture the public's attention and help developers. Dapp developers quickly find real-world users.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4182, "q0": "The DAM Marketplace proposal addresses the Dapps, Products & Integration challenge by building a componentalized marketplace with a fully customizable interface allowing developers to offer app experiences based on user autonomous filtering and matching.  From the linked paper discussion about the project, it seems to be a marketplace that gather all relevant app components into a single place (customized by users) and the apps will then enabled by developers that users choose to use and pay for. There are 3 layers: app layer, social layer and data layers. This network effect of all digital experiences under one roof where data access is controlled by each user is although visionary and scalable, it is still relatively hard to imagine in term of execution as it has many moving components and might be more suitable to focus on either one use case (that the proposer sense the most impact) to work on before scaling to other app areas. If the proposer prefers to be the framework, it can emphasize more in term of UX/UI to create customized experience and delve more about this aspect in the proposal. ", "q0r": 4, "q1": "The proposer lists total duration of this project as 4 months with the expected milestone in each month. The proposer should provide the total budget and breakdown in detail. The project will be done by an experienced professional in web3. He is looking to model DAM in this first phase. The proposer will need to include the estimate of total budget in his proposal so that the community can see if it is possible that this project can be completed successfully. The proposer has offered risk/challenges of deliverying this project successfully that the developers may focus on separate dapp execution rather than collaborating on a grander scale. I would suggest the proposer to start reaching out to community on telegram and see if anyone would be interested in forming team and bring this visionary idea to reality. There are a lot of people who still look for the team members and each has different skillset that can complement with the proposers. The idea shown in the google shared drive shows that the proposer has spent considerable amount of time in the idea conception and it would be awesome to evolve this creative idea and refine it with some detail. ", "q1r": 4, "q2": "The proposer views this project success as a bigger pathway towards collaborative commercialization of web3 economic opportunity and inspire momentum required for integrated marketplace of dapps. He also details milestone in each month for the designers, developers and advisory board. The proposal could be more polished by populating with KPI detail and indicate channel to report to community ie. weekly/monthly report, GitHub, or meetings I would recommend the proposer to add these detail to boost the proposal auditability. ", "q2r": 3, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8389, "q0": "The idea of creating a premium store where developers can freely express their styles and opposed to Amazon, Facebook, CH Store sounds interesting, probably it will cause strong effects to both developers and users. However, the proposed solution seems to be the goal for the next generations, not for now as the author does not show any exclusive feature / special point to meet the challenge and come to replace current centralized providers. The risks are expressed sparely and it is hard to catch the author's idea when they talk about individual developers and motivation; also coming to technical riskes they should make it clear and do not just refer in general.", "q0r": 3, "q1": "The process will be spread within 04 months and each month the author indicates main jobs to be completed. As there are no specific metrics / KPI for this project, it is not convinient for us to track step by step. For example, in the first month, they have to recruit many employees, from designer, developer to contractor and it is unclear about the total number of people they want. In month 3 \"technical development\", outsider investors like me cannot imagine which will be developed unless the team could give more examples about the features and challenges they can face. In brief, they should give some instances (even their expectations) for us to catch the flow. As there are missing information from team members, it is likely to understand that we cannot have an exact amount in the breakdown, a pity that it could create bad impression that they are not serious in the project or they are not ready in this round to raise fund. Finally, it is terrible to know that the writer intends to recruit based on communnity desire, assuming that the leader has more than 15 year experience in product management but when you come to this round, you should prepare everything, especially attending members because they are core factors to decide whether the project can be outstanding or not and if you depend on the community, I do not know how long it takes for the project to carry on.", "q1r": 2, "q2": "In order to measure the progress, the author supports us many indicators to consider but there are no specific number for each KPI and it can be seen that it is mostly replied on the advisory board which is still vague at the moment. It is better if the author could give us more information about these positions before coming to another metrics. Agree that if it works, this project could attract more attentions from community and inspire more developers to think outside the box and reach out approriate users for their products, and maybe someday it will become one of the first steps of Web3 era, but the risks are unsolved so far and there as many competitors already have the same projects which can be the tough burden for the plan.", "q2r": 3, "assessor": "z_assessor_2979", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12669, "q0": "The proponent of the problem here is that Web2 traps us with slightly personalized experiences, wasting our time searching for (and often missing out on) experiences that we really appreciate.\n- Solution to the problem: A componentized marketplace builder with a fully customizable interface, allowing developers to deliver app experiences based on their autonomous filtering and matching user.\n- The proposed budget is 50,000$\n- An open-source component library core consisting of 'apps' that can be integrated via the codeless UI builder to kickstart Billy's infinitely customizable web3 marketplace.\n- A 'premium' App Store (built from open source components) that allows any developer to add any app at any price (including reputation rating features) different Billy can choose).\n- Integrate multiple solutions for data storage and distribution (such as IPFS, Graph, centralized storage, Blockchains, P2P torrent storage, etc.).\n- risks when implementing the proposal:\n+ Individual developers are more focused on implementing a separate dapp than on a diligently paced layered approach to collaborating on a larger integration towards a multi-component marketplace.\n+ Significant technical barriers may exist in the required architecture. Projects can require several stages to launch a mass brand.", "q0r": 5, "q1": "- Proposal subject has 15 years of product management and marketing across industries. In 2018, conducted an industry-wide research project on low-code app development tools, since working with the web3 social network, now incorporated those experiences into a vision for the segmentation market. canopy.\n- The number and types of members needed to participate in the project have not been given.\n- Provide a realistic timetable to implement the proposal within 4 months with a detailed plan of each month's work, looking at the progress of the project can be determined\n- The detailed budget table has not been given. I think it would be better if the proponent outlines clear, detailed budgets corresponding to each month's work so that voters can more easily determine the feasibility of the project.", "q1r": 4, "q2": "- Have a specific, detailed 4-month roadmap with milestones and specific timelines for achievement and clearly defined indicators to measure project progress.\n- clearly describe the goal: to help stimulate, encourage, inspire and illuminate a bigger and better path towards collaborative commercialization of the web3 economic opportunity. If our project works, it could drive momentum towards actually building the various components needed for a holistic and integrated dapp marketplace that will capture the public's attention and help dapp developers quickly find real-world users. The second success would be if the Cardano fund team opened up a new 'challenge' area for the DAM Market (or something similar :)\n- Clearly describe, easy to understand the problem and give the appropriate solution to solve the problem.\n- It's a brand new project.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13461, "q0": "The fact that Web2 traps consumers with personalized experiences is a problem to solve in this challenge it makes people waste time in doing. The problem is clearly defined and perfectly suited to this challenge. The solution to this problem is clearly defined by the author, the Dam marketplace is conceived with a fully customizable interface that allows developers to provide app experiences based on automatic filtering and matching. user owner this is the solution the author gave to the user. This problem can effectively solve the challenge it can scale to solve problems in the future making more users aware of Cardano and Catalyst.", "q0r": 5, "q1": "The proposal has set clear, detailed and reasonable timelines for doing work with specific goals. The author has formed and coordinated a task force to help model how a DAM Marketplace works. The author has divided the period of 4 months from January to April to implement the timeline for this period. They also make a clear to-do list for each month. The solution to the challenge was to create a globally recognized brand that could grow to compete with Amazon, Facebook, Twitter, Patreon and all social networks.", "q1r": 5, "q2": "KPIs are clearly defined by the author. The proposed future implementation plan is very detailed and complete to take on this challenge. Gavriel Shaw is the person who launched this project. He has 15 years of experience in product management and marketing across many different industries, and has been involved in cryptocurrency since 2017 until now. And as the former chief marketing officer of Wirex scaled up from 5 employees to 150 1.5 million customers. The grant budget for this proposal is $50,000 of the grant budget less than 20% of the total challenge budget. On this budget I have not seen the author list his expenses for this challenge. I need a specific and detailed figure for each stage of the project. This is a brand new project and waiting to be funded.", "q2r": 4, "assessor": "z_assessor_3650", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14761, "q0": "The problem of concern to the proposers is that we are wasting our time searching the Web2 and we often miss out on good experiences. The idea proposed by the proposers is to create a componentized marketplace builder with a fully customizable interface. Personally, I think this is a great idea, if successful, this project will bring many benefits to the Cardano community.\nIn the Impact section, the proposal met the requirement to clearly present the function and main components of the project as well as how the project works. The technical areas proposed by the proposers are covered in depth and detail. This provides an overview for viewers of the impact and how the project affects the Cardano community. However, in order for the project to be further appreciated for its impact, the proposers should clearly define the target audience and mention specifically in the proposal. Furthermore, the team also needs to clearly state how this project will affect those audiences.\nThe results that the project wants to achieve are mentioned in the proposal. These results are based on the goals of the Challenge. However, the proposal needs to have detailed content for each part, each stage showing that these results are in sync with the Key metrics / KPIs of the Challenge.\nThe 2 biggest problems that can be encountered when implementing the project are mentioned by the proposal. Anticipated difficulties will help proposers guide how to solve them when they encounter them in the future.", "q0r": 4, "q1": "Proposer has provided information (evidence, witnesses, or links…) about the skills and experience needed to carry out the activities mentioned in the proposal. This is a bright spot for the proposal.\nThe proposal clearly shows the roadmap for the project implementation plan. roadmap is divided into 4 phases corresponding to 4 months. However, the plan needs to be broken down by milestones. For each milestone, proposers should state each outcome. The proposal should have a realistic timeline for completing the given tasks in a logical manner. Proposal should show a reasonable plan not only in terms of what they will accomplish, but also how it should be, and have more detail on technical aspects such as architecture, language and technology needed to execute the plan. The proposers should also clearly define the positions and the number of people needed to carry out the proposed project. The more detailed this information, the easier it is for the community to assess the goals set by the proposal as well as the potential of the team.\nThe budget plan has also not been presented in the proposal. Similar to project execution plans, budget plans need to be broken down and clearly bulleted for activities. The budget should be stated as a figure that matches the plan laid out. It could be the details of the expenses that the team will use the budget to spend on it. It can be personnel by monthly salary, hourly salary, weekly salary or per job. Or pay for the necessary assets.\nThe project is carried out by Gavriel Shaw, an experienced person in the field. With his knowledge and skills, he promises to successfully implement the project and benefit the Cardano community.", "q1r": 4, "q2": "The criteria to evaluate the success of the proposal have been clearly stated in each section. However, in this section, proposers should state specific numbers that define the success of the project. Those quantitative indicators are clear to track the project's progress. For example, the number of users, the time to complete which part - what activities, the number of traffic ... Based on those numbers, the community can track the progress of the project and evaluate the success of the project.\nThe image of the project's success is clearly outlined. The project wishes to develop the dapp and expand the Cardano community.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A componentized marketplace builder with a fully customizable interface, allowing developers to offer app experiences based on user autonomous filtering and matching.", "experience": "15 years product management and marketing across industries. In 2018 conducted an industry wide research project for low-code app development tooling, since worked with web3 social networks, now combining those experiences into a vision for a distributed marketplace."}